[
    "Al Jazeera, link to home page",
    "Ukraine says six killed in Russ­ian at­tack on Kryvyi Rih",
    "UK says Russia receiving ‘larger consignments’ of Iranian drones by ship",
    "Dam breach will sow huge problems for food security: UN’s Griffiths",
    "Ukraine says seven villages retaken in ‘tough’ offensive",
    "Air defence systems in Kyiv region engaged in repelling air attacks: Officials",
    "China spinning a ‘web’ of influence campaigns to win over Taiwan",
    "India threatened to shut down Twitter, founder says",
    "US says 22 soldiers injured in Syria helicopter accident",
    "Five things to expect from Trump’s appearance in Florida court",
    "NATO’s largest air force drill prepares for ‘crisis situation’",
    "‘Extraordinarily difficult operation’: All eyes on Ukraine attack",
    "Rescued Colombia children recovering, relatives in custody tussle",
    "Palestinian President Mahmoud Abbas arrives in China",
    "Rights groups to screen BBC film on Modi before White House visit",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Don­ald Trump’s in­dict­ment: What you need to know",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "Can Trump run for pres­i­dent af­ter in­dict­ment?",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Ukraine says six killed in Russian attack on Kryvyi Rih",
    "‘Massive’ Russian missile attack on Ukraine’s Kryvyi Rih city",
    "Russia-Ukraine war: List of key events, day 475",
    "New Zealand’s RNZ apologises for ‘pro-Kremlin garbage’ on Ukraine",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]