[
    "Al Jazeera, link to home page",
    "Ex­plo­sions rock Kyiv as African del­e­ga­tion vis­its Ukraine",
    "Putin will visit Turkey ‘soon’: Interfax",
    "Explosions in Kyiv as African peace delegation arrives",
    "Ukraine to send several dozen pilots to train on F-16s",
    "Situation in eastern Ukraine ‘tense’: Commander",
    "Protests across Greece as hope to find shipwreck survivors fades",
    "Cyclone Biparjoy disrupts power, kills two in India and Pakistan",
    "Why is US Secretary of State Antony Blinken going to China?",
    "Protesters in Lebanon vandalise banks, demand their money back",
    "World breaks average temperature record for June: EU",
    "FIFA chief wants refs to stop football games when racism occurs",
    "Seoul salvages part of rocket from North Korea’s failed launch",
    "Mixed martial arts fighter Conor McGregor in sexual assault claim",
    "Pakistan, Sri Lanka to jointly host Asia Cup cricket",
    "What could a possible prison sentence for Donald Trump look like?",
    "Why do US sanctions fail? Because a platypus can’t become a birdquotesOpinion byAaron Schneider",
    "Berlusconism was the prequel to TrumpismquotesOpinion byVito Laterza",
    "India’s deadly train crash: Forget the truth, blame it on MuslimsquotesOpinion byApoorvanand",
    "Waiving US visas for Israelis would be a mistakequotesOpinion byDaoud Kuttab",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Explosions rock Kyiv as African delegation visits Ukraine",
    "US military chief says Ukraine offensive a ‘very difficult fight’",
    "Russia-Ukraine war: List of key events, day 478",
    "Russia-Ukraine updates: US general says Russian army in disarray",
    "As Russians fight for Ukraine, Kyiv is faced with a new dilemma",
    "At least 15 killed, 10 injured in bus crash in Canada’s Manitoba",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]