[
    "Al Jazeera, link to home page",
    "Trump in­dict­ment: Demon­stra­tors, me­dia gath­er out­side court",
    "Protesters shout at Miami mayor at courthouse",
    "Trump again attacks prosecutor ahead of court appearance",
    "Defence will explain ‘why Trump had a right to these documents’: Republican strategist",
    "Political intrigue creates business opportunity",
    "Putin says Ukraine’s counteroffensive is failing",
    "Trump’s arraignment: The scene outside the Miami courthouse",
    "‘If we came second, we got nothing’: Berlusconi’s football legacy",
    "Israeli army kills Palestinian in occupied West Bank raid",
    "Sprinter Tori Bowie died from childbirth complications: Autopsy",
    "Ukraine’s counteroffensive begins: What do we know so far?",
    "Djokovic raises bar to 23 slams: Is he the greatest of all time?",
    "Thousands displaced as Mayon volcano in Philippines spews lava",
    "‘Clear threats’: Muslims forced to flee northern Indian town",
    "Trump’s ar­raign­ment: The scene out­side the Mi­a­mi cour­t­house",
    "Trump’s ar­raign­ment: A sim­ple guide to his­toric court ap­pear­ance",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Trump indictment: Demonstrators, media gather outside court",
    "Trump’s arraignment: A simple guide to historic court appearance",
    "Belarus will not hesitate to use nukes if aggressed: Lukashenko",
    "Cyclone Biparjoy to hit India, Pakistan: What we know so far",
    "Read the full text of the Donald Trump indictment",
    "India and Nigeria threatened to shut down Twitter, founder says",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]