[
    "Al Jazeera, link to home page",
    "Ukraine ac­cus­es Rus­sia of blow­ing up a ma­jor dam",
    "Dam blast shows ‘brutality of Russia’s war in Ukraine’: NATO chief",
    "Photos: Damage at the Nova Kakhovka dam in Russian-controlled Kherson",
    "Kyiv struck dam to distract from counteroffensive ‘failures’: Russia’s Saldo",
    "What does Erdogan’s re-election mean for Turkey-Gulf relations?",
    "Old is gold: Can ageing spark a surprise economic boom?",
    "Uighur siblings in India jail since 2013 face deportation threat",
    "US, UK push against child abuse online alarms Asia dissidents",
    "Living the ‘Chinese Dream’: Beijing’s new world order",
    "Kuwait votes in parliamentary polls in hopes of ending deadlock",
    "Afghan provincial governor killed in car bombing",
    "Fattah: Iran unveils its first hypersonic missile",
    "Ukraine says Russian forces blew up Nova Kakhovka dam in Kherson",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "Sanctions on Russia may not be working, we now know whyquotesOpinion byBerit Lindeman",
    "Brazil’s Lula is right on global politics and wrong on UkrainequotesOpinion byBruno Cava",
    "‘King’ Modi’s sceptre and the wrestlers without rightsquotesOpinion byApoorvanand",
    "Change is coming to Capitol Hill and Israel won’t like itquotesOpinion byAyah Ziyadeh",
    "‘So trapped’: A young Iraqi dri­ver’s cost­ly taxi to nowhere",
    "Could AI car­ry out coups next un­less stopped now?",
    "The ac­tivists con­fronting pe­ri­od taboos in Pak­istan",
    "The Alep­po elec­tron­ic artists us­ing mu­sic to heal in Gaziantep",
    "Recre­at­ing a Pales­tin­ian vil­lage 75 years af­ter the Nak­ba",
    "Ukraine accuses Russia of blowing up a major dam",
    "‘Wild fantasies’: Wagner boss tears into Russian success claims",
    "Zelenskyy lauds Ukraine advance amid counteroffensive speculation",
    "Sanctions on Russia may not be working, we now know why",
    "Bye Singapore, hello Malaysia: Expats chase cheaper living costs",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]