[
    "Al Jazeera, link to home page",
    "Death toll in Greece refugee boat tragedy climbs to 59",
    "Rise in migrants from Horn of Africa to Gulf states worrying: UN",
    "How are Black refugees and migrants treated across North Africa?",
    "Tunisia tennis star urges ‘dignity’ amid crackdown on immigrants",
    "‘End of an era’: Italians bid farewell to Silvio Berlusconi",
    "The downfall of Nigeria’s ‘all powerful’ central bank governor",
    "Six killed as Russia hits Odesa, Donetsk with missiles",
    "House razed, a year in jail and bail refused for father’s burial",
    "Lebanon’s parliament fails to elect president for 12th time",
    "Trump pleads not guilty at arraignment: What happens next?",
    "Taiwan’s FM seeks ‘support from European friends’ in Prague",
    "Nine killed as ethnic violence continues to grip India’s Manipur",
    "Russia jails Navalny campaigner Lilia Chanysheva for ‘extremism’",
    "Af­ter flee­ing FGM, refugees strug­gle to make ends meet in Ire­land",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Putin claims Ukraine suffered ‘catastrophic losses’ in offensive",
    "Top Russian officer reported killed in Ukraine counteroffensive",
    "Russia-Ukraine war: List of key events, day 476",
    "Ukraine’s counteroffensive begins: What do we know so far?",
    "Ukraine latest updates: Putin tells West to stop arming Ukraine",
    "US pushing India to seal armed drone buy when Modi visits: Report",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]