[
    "Al Jazeera, link to home page",
    "Rus­sia con­sid­er­ing ter­ror at­tack at Za­por­izhzhia plant: Ze­len­skyy",
    "The Kremlin calls Zelenskyy’s ‘terror’ act claim ‘another lie’",
    "WSJ reporter appears in court to appeal extended detention",
    "Zelenskyy says Russia is considering ‘terrorist act’ at Zaporizhzhia plant",
    "Ukrainian forces fired four missiles at Chonhar bridge: RIA",
    "Israeli army uses force against Druze protests in occupied Golan",
    "At least 31 dead after gas explosion at China barbecue restaurant",
    "What is Hajj? A step-by-step guide to the Muslim pilgrimage",
    "Titanic sub: Crews exploring undersea noises in ‘complex’ search",
    "Libya 6+6 deal: Loopholes cast doubt on democratic elections",
    "Critics decry Modi’s US visit as he begins day with UN yoga event",
    "Pakistan PM Sharif requests IMF release $1.1bn tranche",
    "Man jailed for 55 years in US after ‘road rage’ killing of Muslim",
    "EU summons Kosovo and Serbia leaders for emergency talks",
    "‘Ego trip’: African peace mission criticised in South Africa",
    "‘Om-washing’: Why Modi’s yoga day pose is deceptivequotesOpinion bySheena Sood",
    "To tackle racism in football Spain needs to face its historyquotesOpinion byGabriel Leão",
    "Titan and the trawler: Whose lives matter?quotesOpinion byPriyamvada Gopal",
    "Rwanda is no refuge for UK asylum seekersquotesOpinion byVictoire Ingabire Umuhoza",
    "Why it’s the most dangerous time to be a refugeequotesOpinion byOthman Moqbel",
    "Refugees can fix Europe’s doctor crisis. Poland’s showing howquotesOpinion byHans Kluge",
    "Russia considering terror attack at Zaporizhzhia plant: Zelenskyy",
    "Russia thermonuclear bomb scientist dies, Putin boosts nuke force",
    "‘Furious resistance’: Ukraine counteroffensive slowed by Russia",
    "What are the key challenges in search for Titanic submersible?",
    "Ukraine offensive against Russia not ‘Hollywood movie’: Zelenskyy",
    "Titan and the trawler: Whose lives matter?",
    "Russia-Ukraine war: List of key events, day 484",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]