[
    "Al Jazeera, link to home page",
    "Two Pales­tini­ans killed af­ter Is­raeli set­tlers gunned down",
    "Israeli officials call for ‘military operation’ in West Bank",
    "Palestinian Authority ‘pretty quiet’: AJ correspondent",
    "Why does Israel keep raiding the Jenin refugee camp?",
    "Settler violence erupts in Huwara: AJ correspondent",
    "Russia warns Ukraine against striking Crimea with US, UK weapons",
    "Crews race to find Titanic sub lost in vast North Atlantic",
    "Dozens killed in Somalia’s Puntland after parliament debate",
    "Carlos Ghosn sues Nissan, aims to ‘fight to the end’",
    "China negotiating new military training facility in Cuba: Report",
    "Search for missing Titanic submersible: What we know so far",
    "US news chain Gannett sues Google, alleges online ad monopoly",
    "Four Israeli settlers killed in attack in the occupied West Bank",
    "Joe Biden’s son Hunter agrees to plead guilty to federal charges",
    "History Illustrated: Inside the “Doomsday” Seed Vault",
    "Rwanda is no refuge for UK asylum seekersquotesOpinion byVictoire Ingabire Umuhoza",
    "Why it’s the most dangerous time to be a refugeequotesOpinion byOthman Moqbel",
    "Refugees can fix Europe’s doctor crisis. Poland’s showing howquotesOpinion byHans Kluge",
    "Reimagining global leadership: Not who but howquotesOpinion byMarwan Bishara",
    "Muslims opposed to LGBTQ curricula for their kids aren’t bigotsquotesOpinion byYasir Qadhi",
    "My imprisoned father is the freest man I knowquotesOpinion byKaouther Ferjani",
    "Ukraine says ‘biggest blow’ yet to come in counteroffensive push",
    "Two Palestinians killed after Israeli settlers gunned down",
    "Who is on board the missing Titanic submersible?",
    "On World Refugee Day, visualising the flow of 35 million refugees",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]