[
    "Al Jazeera, link to home page",
    "Death toll in Greece refugee boat tragedy climbs to 59",
    "Rise in migrants from Horn of Africa to Gulf states worrying: UN",
    "How are Black refugees and migrants treated across North Africa?",
    "Tunisia tennis star urges ‘dignity’ amid crackdown on immigrants",
    "The downfall of Nigeria’s ‘all powerful’ central bank governor",
    "Six killed as Russia hits Odesa, Donetsk with missiles",
    "After fleeing FGM, refugees struggle to make ends meet in Ireland",
    "Nine killed as ethnic violence continues to grip India’s Manipur",
    "Lebanon’s parliament fails to elect president for 12th time",
    "Trump pleads not guilty at arraignment: What happens next?",
    "Taiwan’s FM seeks ‘support from European friends’ in Prague",
    "China targets ‘unity in thought’ with campaign on Xi’s philosophy",
    "Egypt approves budget amid privatisation drive, economic crisis",
    "Trump pleads not guilty at fed­er­al ar­raign­ment in Flori­da",
    "Trump’s ar­raign­ment: The scene out­side the Mi­a­mi cour­t­house",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Top Russian officer reported killed in Ukraine counteroffensive",
    "Putin claims Ukraine suffered ‘catastrophic losses’ in offensive",
    "Trump pleads not guilty at federal arraignment in Florida",
    "Russia-Ukraine war: List of key events, day 476",
    "Ukraine latest updates: Putin tells West to stop arming Ukraine",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]