[
    "Al Jazeera, link to home page",
    "Chi­na should ex­ert its in­flu­ence on ‘ag­gres­sor’ Rus­sia: Scholz",
    "‘Let NATO fight if it doesn’t want to freeze the conflict in Ukraine’: Russia’s Lavrov",
    "Hungary ignoring requests for contact with war prisoners: Ukraine",
    "Russian attacks in Kherson kills one person: Zelenskyy’s aide",
    "Kyiv says EU will train 30,000 Ukrainian soldiers",
    "Joe Biden’s son Hunter agrees to plead guilty to federal charges",
    "On World Refugee Day, visualising the flow of 35 million refugees",
    "Search for missing Titanic submersible: What we know so far",
    "French police raid Paris 2024 headquarters in corruption probe",
    "Sixth Palestinian dies after Israeli raid on Jenin refugee camp",
    "Questions remain over Greece’s role in boat tragedy",
    "Romanian prosecutors send Andrew Tate to trial for trafficking",
    "Is the Women’s World Cup ready for its close-up?",
    "History Illustrated: Inside the “Doomsday” Seed Vault",
    "Rwanda is no refuge for UK asylum seekersquotesOpinion byVictoire Ingabire Umuhoza",
    "Why it’s the most dangerous time to be a refugeequotesOpinion byOthman Moqbel",
    "Refugees can fix Europe’s doctor crisis. Poland’s showing howquotesOpinion byHans Kluge",
    "Reimagining global leadership: Not who but howquotesOpinion byMarwan Bishara",
    "Muslims opposed to LGBTQ curricula for their kids aren’t bigotsquotesOpinion byYasir Qadhi",
    "My imprisoned father is the freest man I knowquotesOpinion byKaouther Ferjani",
    "China should exert its influence on ‘aggressor’ Russia: Scholz",
    "Ukraine says ‘biggest blow’ yet to come in counteroffensive push",
    "Who is on board the missing Titanic submersible?",
    "Why does Israel keep raiding the Jenin refugee camp?",
    "Russia launches ‘massive’ air attack on Kyiv, Ukrainian cities",
    "Russia-Ukraine war: List of key events, day 482",
    "Muslims opposed to LGBTQ curricula for their kids aren’t bigots",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]