[
    "Al Jazeera, link to home page",
    "Don­ald Trump put US na­tion­al se­cu­ri­ty at risk, in­dict­ment says",
    "Trump has right to make his defence, former VP says",
    "Biden declines to comment on indictment",
    "Top Democrats say case must ‘proceed peacefully in court’",
    "US Secret Service prepares for Trump court appearance",
    "Colombia and ELN rebel group sign ceasefire agreement",
    "US says Iran is helping Russia build drone manufacturing facility",
    "‘No one is above the law’: Reactions to Trump indictment",
    "Pakistan lays out budget but may not satisfy IMF",
    "Who is Hafize Gaye Erkan, Turkey’s new central bank chief?",
    "UK ex-Prime Minister Boris Johnson resigns as MP",
    "Q&A: RSF adviser on Sudan ceasefire, Wagner and civilian killings",
    "Serbians join anti-government protest following mass shootings",
    "South Korea summons China envoy over US ties remarks",
    "Why I’m strik­ing: UK roads union rep fights back against pay cuts",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Donald Trump is doomed. FinallyquotesOpinion byAndrew Mitrovica",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Ukraine updates: War escalates as Kyiv quiet on counteroffensive",
    "Are Canada’s wildfires under control? Here’s what to know",
    "Donald Trump put US national security at risk, indictment says",
    "Donald Trump is doomed. Finally",
    "Ukraine counteroffensive against Russia under way: think tank",
    "Thailand’s cannabis lovers face comedown amid legalisation U-turn",
    "Russian man killed in shark attack off Egypt’s Red Sea resort",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]