[
    "Al Jazeera, link to home page",
    "Three killed in Ode­sa as Rus­sia-Ukraine war in­ten­si­fies",
    "Zaporizhzhia plant can get water from wells: Russia",
    "Blast in Odesa comes 24 hours after Kryvyi Rih attack: AJ Correspondent",
    "IAEA chief to visit Zaporizhzhia plant on Thursday",
    "Swedish prosecutor hopes to conclude Nord Stream investigation in autumn: report",
    "The downfall of Nigeria’s ‘all powerful’ central bank governor",
    "Will the Lebanese parliament manage to elect a president today?",
    "Nine killed as ethnic violence continues to grip India’s Manipur",
    "Trump’s arraignment: What happens next?",
    "China targets ‘unity in thought’ with campaign on Xi’s philosophy",
    "Seventeen dead after boat carrying migrants capsizes off Greece",
    "Here are the key takeaways from UN report on forced displacement",
    "China’s Qin Gang airs concerns in call with US’s Antony Blinken",
    "Police say about 100 killed after boat capsizes in Nigeria",
    "Trump pleads not guilty at fed­er­al ar­raign­ment in Flori­da",
    "Trump’s ar­raign­ment: The scene out­side the Mi­a­mi cour­t­house",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Three killed in Odesa as Russia-Ukraine war intensifies",
    "Top Russian officer reported killed in Ukraine counteroffensive",
    "Putin claims Ukraine suffered ‘catastrophic losses’ in offensive",
    "Russia-Ukraine war: List of key events, day 476",
    "Defiant Trump outlines potential defences against federal charges",
    "Ukraine latest updates: Putin tells West to stop arming Ukraine",
    "US lawmaker group wants S Africa punished over Russia ties",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]