[
    "Al Jazeera, link to home page",
    "Ukrain­ian ‘sab­o­tage’ group cross­es into Rus­sia, gov­er­nor says",
    "Ukrainian shelling wounds at least three people in Russia’s Belgorod: Governor",
    "IAEA pushes to safeguard Zaporizhzhia nuclear power plant: Washington Post",
    "NATO’s Parliamentary Assembly recognises Russia’s crimes in Ukraine as ‘genocide’",
    "Zelenskyy’s senior aide says Ukraine has nothing to do with Belgorod operation",
    "Beijing summons Japanese envoy over G7 statement ‘smearing’ China",
    "Real Madrid’s Vinicius Jr says La Liga ‘now belongs to racists’",
    "Killing of Indigenous Ecuador anti-oil activist spurs questions",
    "India hosts G20 tourism meet in Kashmir under heavy security",
    "Israeli forces kill three Palestinians in Nablus raid",
    "Greece’s Mitsotakis seeks second vote after election win",
    "Can Africa’s first content moderators union change Big Tech?",
    "At least 20 children killed in Guyana school dormitory fire",
    "Meta fined $1.3bn over transfer of EU user data to the US",
    "Su­dan’s army, ri­val para­mil­i­tary force sign week-long cease­fire",
    "US­AID chief says com­mit­ted to help­ing Su­danese refugees",
    "Khar­toum’s out­skirts at­tacked as Su­dan war en­ters sixth week",
    "Su­dan can­not af­ford to re­ject for­eign help",
    "No es­cape, no aid as fight­ing in­ten­si­fies in Su­dan’s West Dar­fur",
    "Photos: Iraqi artist battles to save boating tradition",
    "Ukrainian ‘sabotage’ group crosses into Russia, governor says",
    "‘This is the culture’: The Indian wrestlers fighting sexual abuse",
    "Russia says F-16 transfer to Ukraine would raise NATO question",
    "Russia-Ukraine war: List of key events, day 453",
    "Ukraine still has a foothold inside Bakhmut, says official",
    "Why is Bakhmut important in the Russia-Ukraine war?",
    "Russians celebrate reports that ‘fortress Bakhmut’ has fallen",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]