[
    "Al Jazeera, link to home page",
    "Coun­ter­at­tack ‘tak­ing place’ against Rus­sia, Ukraine leader says",
    "Water levels sinking rapidly in Ukrainian reservoir after dam breach",
    "France warns Iran on drone deliveries to Russia",
    "Ukrainians say making gradual gains north and south of Bakhmut: AJ correspondent",
    "Nord Stream sabotage probe turns to clues inside Poland: WSJ",
    "LIVE: Man City vs Inter Milan – Champions League final build-up",
    "‘Unabomber’ dies in US prison at age 81",
    "Ukraine claims gains near Bakhmut as heavy fighting rages in east",
    "Khartoum quiet as 24-hour Sudan truce to let much-needed aid in",
    "‘Collective punishment’: Israel demolishes Palestinian homes",
    "Four children found in Colombian jungle 40 days after plane crash",
    "UK politics reels from ex-PM Johnson’s shock exit",
    "Can Trump run for president after indictment?",
    "France knife attack suspect charged with attempted murder",
    "Photos: Philippines evacuates thousands after volcano rumbles",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Donald Trump is doomed. FinallyquotesOpinion byAndrew Mitrovica",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "Counterattack ‘taking place’ against Russia, Ukraine leader says",
    "Putin claims Russian forces halting Ukrainian counteroffensive",
    "Russia-Ukraine war: List of key events, day 472",
    "Germany’s anti-Palestinianism is escalating",
    "Are Canada’s wildfires under control? Here’s what to know",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]