[
    "Al Jazeera, link to home page",
    "War­ring sides trade blame for shelling in flood-hit Kher­son",
    "Veteran Russian rights campaigner Orlov goes on trial for discrediting army",
    "Ukraine dam’s reservoir water can no longer cool nuclear plant reactors: Operator",
    "NATO chief urges speedy Ukraine aid after dam breach",
    "South Africa is open to hosting peace talks",
    "US extends air quality alerts as Canadian blazes cause smoky haze",
    "Children fight for their lives after French Alps knife attack",
    "Why is Hannibal Gaddafi on hunger strike in a Lebanese prison?",
    "At least 11 killed in Afghanistan mosque explosion",
    "USAID says it is halting all food aid to Ethiopia amid diversions",
    "US Supreme Court rules in favour of Alabama Black voters",
    "El Nino under way, raising fears of extreme weather patterns",
    "Why has Saudi sovereign fund taken over kingdom’s football clubs?",
    "Bodies floating in flooded areas after dam collapse: Zelenskyy",
    "How much plas­tic is in our oceans?",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Warring sides trade blame for shelling in flood-hit Kherson",
    "India slams Canada for parade float showing ex-PM Gandhi’s murder",
    "China’s backlash against Little Mermaid exposes Hollywood bind",
    "Scientists find ‘lost world’ in billion-year-old Australian rock",
    "Russia-Ukraine war: List of key events, day 470",
    "‘Poor people don’t have friends’: A Pakistani widow’s life",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]