[
    "Al Jazeera, link to home page",
    "In­ter­cept­ed call proves Rus­sia was be­hind dam blast: Ukraine",
    "Russia says it repelled attacks in Zaporizhzhia",
    "At least five people killed in dam flooding, Kyiv says",
    "‘No doubt’ that both sides are intensifying attacks: Journalist",
    "Russia summons Japanese ambassador over military supplies to Kyiv",
    "Saudi Arabia, US announce 24-hour Sudan ceasefire from Saturday",
    "‘Europeans are almost not coming to the UK any more’",
    "Are Canada’s wildfires under control? Here’s what to know",
    "‘No one is above the law’: Reactions to Trump indictment",
    "Former US bank executive appointed as Turkey central bank chief",
    "Crisis-hit Pakistan set to present budget as IMF watches",
    "Palestinian president to visit China after mediation offer",
    "Malaysia will ‘not survive’ if it does not change: Anwar Ibrahim",
    "Ukraine counteroffensive against Russia under way: think tank",
    "Why I’m strik­ing: UK roads union rep fights back against pay cuts",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Donald Trump is doomed. FinallyquotesOpinion byAndrew Mitrovica",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Intercepted call proves Russia was behind dam blast: Ukraine",
    "Donald Trump is doomed. Finally",
    "Russian man killed in shark attack off Egypt’s Red Sea resort",
    "China’s backlash against Little Mermaid exposes Hollywood bind",
    "‘Poor people don’t have friends’: A Pakistani widow’s life",
    "Thailand’s cannabis lovers face comedown amid legalisation U-turn",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]