[
    "Al Jazeera, link to home page",
    "Palestinian killed as Israeli settlers attack West Bank village",
    "Sixth Palestinian dies after Israeli raid on Jenin refugee camp",
    "Israel says Palestinian toddler killed ‘unintentionally’",
    "Israeli army kills Palestinian in occupied West Bank raid",
    "Sudan’s warring sides resume fighting after latest ceasefire ends",
    "Ukraine counteroffensive slow, Zelenskyy says; Putin sees ‘lull’",
    "Hundreds attend funeral for Palestinians killed in Jenin raids",
    "‘Underwater noises’ detected in search for missing Titanic sub",
    "Dozens of people drown after dinghy sinks near Canary Islands",
    "‘Reeks of profiling’: US ‘no-fly’ list appears to target Muslims",
    "‘Hopelessness’: Why Pakistanis are leaving, losing lives at sea",
    "Amazon duped millions of people into enrolling in Prime: US FTC",
    "Death toll rises to 46 in Honduran women’s prison gang violence",
    "Renk, South Sudan: Life, death and fear for refugees",
    "To tackle racism in football Spain needs to face its historyquotesOpinion byGabriel Leão",
    "Titan and the trawler: Whose lives matter?quotesOpinion byPriyamvada Gopal",
    "Rwanda is no refuge for UK asylum seekersquotesOpinion byVictoire Ingabire Umuhoza",
    "Why it’s the most dangerous time to be a refugeequotesOpinion byOthman Moqbel",
    "Refugees can fix Europe’s doctor crisis. Poland’s showing howquotesOpinion byHans Kluge",
    "Reimagining global leadership: Not who but howquotesOpinion byMarwan Bishara",
    "Russia: US and UK ‘fully dragged into conflict’ if Crimea bombed",
    "Titan and the trawler: Whose lives matter?",
    "What’s behind Indian Prime Minister Narendra Modi’s US visit?",
    "What is the summer solstice, and why is June 21 the longest day?",
    "What are the key challenges in search for Titanic submersible?",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]