[
    "All five people on Titan sub dead after 'catastrophic implosion'",
    "Five dead on Titan sub were 'true explorers'",
    "The woman who wants to end abortion in America",
    "What professional women often sacrifice",
    "Europe's most expensive painting ever?",
    "Canada police name 16 victims in highway crash",
    "Rust movie armorer charged with evidence tampering",
    "Spate of mass brawls at German outdoor pools",
    "'A huge opportunity to see if England have caught up'",
    "IOC strips IBA of recognition as governing body",
    "Chelsea owners buy majority stake in Strasbourg",
    "How will Titan investigators find out what happened?",
    "Key questions about the Titan's implosion",
    "British father, son and explorer among sub victims",
    "Hear from the Titan’s crew before the tragedy",
    "A 2,200-year-old mystery hidden in a Roman pie",
    "How modern tech is helping scientists talk to animals",
    "Sweden's magical day of feasting",
    "The Gen Xers making dream-career pivots",
    "How dangerous is the Titanic wreck?",
    "A show likely to get on viewers' nerves",
    "Thompson twins hoping for NBA Draft history",
    "India man 'cons' posh hotel for two-year free stay",
    "German woman jailed for keeping Yazidi slave",
    "1 Risk fast-fashion website uses forced labour",
    "2 Bank boss denies wanting slump after 5% rate shock",
    "3 Musk and Zuckerberg agree to hold cage fight",
    "4 Ocado shares surge on Amazon takeover rumours",
    "5 Turkey hikes interest rate to 15% in Erdogan U-turn",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "Could hosepipe drones tackle wildfires?",
    "Airbus experiments with more control for the autopilot",
    "The latest technology news direct to your inbox",
    "How the story of the Titan sub unfolded",
    "US Coast Guard confirms Titan sub loss",
    "'The only solace is that they didn't suffer...",
    "'The only solace is that they didn't suffer for days'",
    "Watch: Titanic sub passenger recalls losing...",
    "Watch: Titanic sub passenger recalls losing contact",
    "Dozens killed in China restaurant fire",
    "Louis Tomlinson fans hurt in wild hail storm",
    "Paris building in flames after huge explosion",
    "Watch: Stuck horse rescued from Florida pool",
    "'Hi miss!': Hollywood star surprises sister...",
    "'Hi miss!': Hollywood star surprises sister in class",
    "Watch: Huge fire burns in Las Vegas",
    "Cindy Beale returns to EastEnders after 25 years",
    "Barbados PM leads fight for climate cash shake-up",
    "Police warn over new Android 999 call feature",
    "Mosquito-borne diseases risk increasing in Europe",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "Singapore fines firms over Wirecard payments scandal",
    "Satellite images reveal Ukraine canals drying up",
    "Beijing records hottest June day in 60 years  By Kelly Ng",
    "Amazon accused of tricking Prime customers  By Natalie Sherman",
    "Why the US is rolling out the red carpet for Modi  By Vikas Pandey",
    "The struggles and scandals of Hunter Biden  By Sam Cabral",
    "Three key priorities in crucial US-China talks  By Anthony Zurcher",
    "Hacker gang Clop publishes victim names on dark web  By Joe Tidy",
    "Why African leaders are travelling to Ukraine  By Barbara Plett Usher",
    "McGregor accused of sex assault after NBA game  By Chelsea Bailey",
    "The workers already replaced by artificial intelligence",
    "Kelly Hoppen: 'Music is design to me'",
    "Beauty of insects revealed in photo competition",
    "Dazzling ancient bronze sword found in Germany",
    "Burna Boy bling and high flyers: Africa's top shots",
    "Man trots globe blending scenes into film locations",
    "In pictures: Nottingham attack shakes city to core",
    "بقایای زیردریایی تایتان پیدا شد؛ علت سانحه انفجار به داخل بوده است",
    "Cả năm người trong tàu lặn Titan 'đã chết' dưới độ sâu của đại dương",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]