[
    "Andrew Tate challenged on misogyny in combative BBC interview",
    "Biden trips and falls on stage at graduation event",
    "US Senate weighs debt deal as deadline looms",
    "The 1998 film that predicted the future",
    "Why 'back-up careers' are disappearing",
    "The untold tale of America's first spelling champ",
    "Elon Musk reclaims title of world's richest person",
    "Nova Scotia battles its largest wildfire on record",
    "PGMOL condemns 'abhorrent' abuse of referee Taylor",
    "Ronaldo urges more big names to make Saudi move",
    "Bowlers will step up if Stokes is not fit - Broad",
    "Why so many LGBTQ+ workers are quitting",
    "An underrated LGBTQ+ haven in the US",
    "Incredible drag queens from history",
    "Is this the Dutch secret to a healthier, happier life?",
    "Are tech companies doing enough to protect us?",
    "How modern life is making men infertile",
    "What did Stonehenge sound like?",
    "The students with retired housemates",
    "New Spider-Verse is a 'disappointment'",
    "Why Gen Z are so pay motivated",
    "The low-effort edible plants for lazy gardeners",
    "Kim Cattrall to appear in Sex and the City revival",
    "War crimes evidence erased by social media firms",
    "1 British Airways fined $1.1m by US government",
    "2 US debt ceiling deal moves forward after House vote",
    "3 London still works for share listings, says boss",
    "4 Mining giant underpaid workers for 13 years",
    "Why we need more female electricians",
    "Where the sound of nature is too quiet",
    "Lebanon's unexpected solar boom",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Andrew Tate denies allegations of manipulation",
    "Andrew Tate denies allegations of...",
    "Soldier's loss raises prosecution question......",
    "Soldier's loss raises prosecution question... in 83 seconds",
    "Moment climber found in rare Everest ‘death...",
    "Moment climber found in rare Everest ‘death zone’ rescue",
    "Watch car fly off tow truck ramp on US...",
    "Watch car fly off tow truck ramp on US motorway",
    "Watch: Missile falls from sky onto busy Kyiv...",
    "Watch: Missile falls from sky onto busy Kyiv road",
    "Why South Korea woke up to sirens... in 73...",
    "Why South Korea woke up to sirens... in 73 seconds",
    "Watch: Rick rolls on to BBC Breakfast in his...",
    "Watch: Rick rolls on to BBC Breakfast in his pyjamas",
    "Chinese jet buzzed US military plane, says...",
    "Chinese jet buzzed US military plane, says Pentagon",
    "Black bear walks into bakery and eats 60...",
    "Black bear walks into bakery and eats 60 cupcakes",
    "On Air: World Business Report",
    "Amazon to pay $25m over child privacy violations",
    "Fears for environmentalists jailed in Iran",
    "Phillip Schofield says he is not a groomer",
    "Argentina eases access to morning-after pill",
    "Windrush generations mark 75th anniversary",
    "New US-Taiwan trade deal as China tensions rise",
    "Using pig fat as green jet fuel 'will hurt planet'",
    "Peas that don't taste like peas could help planet  By Pallab Ghosh",
    "She bought an abandoned US lighthouse. Now you can too  By Chelsea Bailey",
    "AI 'godfather' feels 'lost' over life's work  By Zoe Kleinman",
    "A top soldier's defamation case rocks Australia  By Tiffanie Turnbull",
    "Why Erdogan's victory matters for the West  By Katya Adler",
    "Why prosperity can't break India's dowry curse  By Soutik Biswas",
    "A growing case of transatlantic heartburn  By Katty Kay",
    "Branson's rocket plane returns to spaceflight  By Jonathan Amos",
    "Why car parks are the hottest space in solar power",
    "Protein's power is being uncovered and unleashed",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "Photographer blends Africa with Welsh communities",
    "Warm smiles and purple skies: Africa's top shots",
    "In pictures: King and Queen visit Northern Ireland",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]