[
    "Russia warns of 'colossal risk' over jets as Zelensky attends G7",
    "Crucial questions as US supports fighter jets to Ukraine",
    "Man climbs BBC HQ scaffolding and hammers at statue",
    "A 'gloomy' last Indiana Jones adventure ★★☆☆☆",
    "Premier League: Tottenham 1-2 Brentford - Mbeumo double as visitors come from behind",
    "'Serious differences' hamper US debt ceiling talks",
    "Decorated officer charged with helping Proud Boys",
    "You think you know Satanists? Maybe you don't",
    "Butler leads Miami to 2-0 advantage against Boston",
    "Ancelotti says he is staying on as Real Madrid boss",
    "Scheffler, Hovland & Conners share US PGA lead",
    "Fast X: 'Preposterous from beginning to end' ★★★☆☆",
    "Jellyfish blooms: Why not just eat them?",
    "Africa's remote geological wonder",
    "The prince of pleasure who became king",
    "Four Japanese rules to live past 100",
    "The 2,000-year-old 'computer' that simply shouldn't exist",
    "The men who tried to kill a Queen",
    "Why workers feel they never make enough",
    "Southeast Asia's ubiquitous curry puffs",
    "The Zone of Interest is 'a masterpiece'",
    "'I hit the fire alarm and evacuated an airport'",
    "Disney ends $867m Florida plan amid DeSantis feud",
    "Outcry as Australian police taser 95-year-old woman",
    "1 Tesco chair to quit after claims over behaviour",
    "2 Will a Russian diamond ban be effective?",
    "3 China overtakes Japan as world's top car exporter",
    "4 New sanctions will make sure Russia pays a price - Sunak",
    "Lebanon's unexpected solar boom",
    "The 1968 photo that changed the world",
    "What 1.5C living actually looks like",
    "Protein's power is being uncovered and unleashed",
    "'We are selling a product that we hope gets discontinued'",
    "Watch: Cannabis farm suspects ditch phones on roof",
    "Watch: Cannabis farm suspects ditch phones on...",
    "Man scales BBC HQ wall and hammers at statue",
    "Watch: Officer clings to speeding car in wild...",
    "Watch: Officer clings to speeding car in wild chase",
    "How West Ham's night of glory turned ugly......",
    "How West Ham's night of glory turned ugly... in 85 seconds",
    "It's just not cricket! Hot air balloon halts...",
    "It's just not cricket! Hot air balloon halts match",
    "Watch: West Ham players confront violent AZ...",
    "Watch: West Ham players confront violent AZ Alkmaar fans",
    "Watch: Emotional Harrison Ford accepts Cannes...",
    "Watch: Emotional Harrison Ford accepts Cannes award",
    "G7 leaders unsure whether to wave during...",
    "G7 leaders unsure whether to wave during group photo",
    "Flying sofa seen over Turkish capital during...",
    "Flying sofa seen over Turkish capital during storm",
    "Cash App founder murder suspect pleads not guilty",
    "How Ukraine is tackling the mental scars of war",
    "Amazon's Jeff Bezos to help Nasa return to Moon",
    "Four Eurovision songs enter top 10, setting record",
    "North Carolina bans abortion after 12 weeks",
    "'I fractured my neck rocking out on stage'",
    "Bills set to rise to pay for £10bn sewage clean-up",
    "The last refuge of abortion access in the US south  By Sam Cabral",
    "Why G7 has eight more seats at the table this year  By Laura Bicker",
    "Will $3bn IMF loan solve Ghana's economic crisis?  By Thomas Naadi",
    "World likely to warm beyond key 1.5C limit by 2027  By Matt McGrath",
    "Asia is spending to boost birth rates - will it work?  By Mariko Oi",
    "Thai vote winners ready to govern - if they're allowed  By Jonathan Head",
    "Finding Anwar - born while his mother fled for her life  By Rajini Vaidyanathan",
    "US cities far from border grapple with migrant crisis  By Mike Wendling",
    "How computer games encourage kids to spend cash",
    "Should social media face-altering filters be regulated?",
    "Awards, yoga and Eurovision: Photos of the week",
    "Dancers, divers and film-makers: Africa's top shots",
    "Slurping Spaghetti and other food photo contest winners",
    "Scans of Titanic reveal wreck as never seen before",
    "In pictures: Electric rally at an old coal mine",
    "خامنه‌ای: انعطاف جاهایی لازم است اما به معنی عقب‌نشینی نیست",
    "El peor error judicial de la historia británica por el que se condenó a 736 inocentes",
    "Titanic: Công bố bản quét 3D hoàn chỉnh đầu tiên của xác tàu đắm",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]