[
    "Missing Titanic sub has 40 hours of air left - US Coast Guard",
    "Titan sub: Narrow, dimly lit tube with curtained-off toilet",
    "Japan outrage as child sterilisations revealed",
    "The mid-life workers chasing job dreams",
    "How dangerous is the Titanic wreck?",
    "Hunter Biden charged with tax and gun offences",
    "Andrew Tate charged with rape and human trafficking",
    "Global monkey torture ring exposed by BBC",
    "Euro 2024 qualifying: Scotland v Georgia to resume at 21:15 BST if rain stays off",
    "England denied by Australia in Ashes classic",
    "West Ham reject Arsenal's second bid for Rice",
    "What we know so far about the missing Titanic sub",
    "My trip aboard the Titanic tourist sub",
    "Who is on board the Titanic submersible?",
    "Why is the missing submersible so hard to find?",
    "How modern tech is helping scientists talk to animals",
    "This is what Stonehenge really sounded like",
    "Do you have an end-of-history illusion?",
    "Seven cleverly-designed emergency homes",
    "A big job-market problem for women",
    "How deep-sea tourism became so popular",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "A daytime nap is good for the brain",
    "1 Ousted boss Carlos Ghosn sues Nissan for $1bn",
    "2 Hackers claim not to have BBC, Boots and BA data",
    "3 South Korea 'cryptocrash king' Do Kwon jailed",
    "4 Record plane order made by IndiGo at Paris Airshow",
    "5 Amazon, Hilton and Pepsi in refugee hiring drive",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "Could hosepipe drones tackle wildfires?",
    "Airbus experiments with more control for the autopilot",
    "Today's newsletter: Zuckerberg’s astonishing comeback",
    "St John's hoping for missing sub's safe return",
    "St John's hoping for missing sub's safe...",
    "Search expert describes friends missing on...",
    "Search expert describes friends missing on Titan sub",
    "Titanic sub visitor: We're aware of risks,...",
    "Titanic sub visitor: We're aware of risks, it's not a lark",
    "Bodycam shows officer dragged into drainpipe...",
    "Bodycam shows officer dragged into drainpipe in flood rescue",
    "Chaos on BBC sofa! BGT's Viggo leaves hosts...",
    "Chaos on BBC sofa! BGT's Viggo leaves hosts in shock",
    "Tracking data sheds new light on migrant...",
    "Tracking data sheds new light on migrant shipwreck",
    "Police spot boa constrictor in busy...",
    "Police spot boa constrictor in busy Birmingham road",
    "Souness swims Channel to raise £1m for...",
    "Souness swims Channel to raise £1m for charity",
    "Beauty of insects revealed in photo competition",
    "Judge asks why Piers Morgan has not given evidence",
    "Sudden heat increase in seas around UK and Ireland",
    "Why Spotify's big bet on Meghan fell flat",
    "Ex-medical officer close to tears over Covid deaths",
    "Swiss voters back carbon cuts as glaciers melt",
    "Is food inflation higher in Europe than in the UK?",
    "The struggles and scandals of Hunter Biden  By Sam Cabral",
    "Three key priorities in crucial US-China talks  By Anthony Zurcher",
    "Hacker gang Clop publishes victim names on dark web  By Joe Tidy",
    "Why African leaders are travelling to Ukraine  By Barbara Plett Usher",
    "McGregor accused of sex assault after NBA game  By Chelsea Bailey",
    "Japan rewrites sex crime laws in landmark move  By Kelly Ng",
    "First synthetic human embryo raises ethical issues  By James Gallagher",
    "Brutal report is devastating for Boris Johnson  By Chris Mason",
    "The workers already replaced by artificial intelligence",
    "Kelly Hoppen: 'Music is design to me'",
    "Dazzling ancient bronze sword found in Germany",
    "Burna Boy bling and high flyers: Africa's top shots",
    "Man trots globe blending scenes into film locations",
    "In pictures: Nottingham attack shakes city to core",
    "Surreal skies grip New Yorkers - in pictures",
    "Qué se sabe de las 5 personas que viajan en el sumergible desaparecido que se dirigía al Titanic",
    "Trung-Mỹ gặp nhau trước thế Chiến Quốc vừa đàm vừa đối?",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]