[
    "US debt deal clears hurdle despite hard-line revolt",
    "A top soldier's defamation case rocks Australia",
    "New Yorkers gather for Manhattanhenge",
    "The rise of highly sensitive parents",
    "The book revisions causing an outcry",
    "Ukraine mothers go behind enemy lines to save stolen children",
    "North Korea says spy satellite launch failed",
    "Watch: Air raid siren worries Seoul residents",
    "England World Cup squad announcement, football news and transfer latest",
    "'Mourinho feeds Rome with dreams and emotion'",
    "TV gang illegally streamed Premier League matches",
    "How can we better protect ourselves online?",
    "The unfortunate history of a deadly 'demonic pact with the devil'",
    "Where the Amish go on holiday",
    "The isles where baguettes are regulated",
    "Why Gen Z are so pay motivated",
    "The big myth about patriarchy",
    "Is it necessary to wash our clothes?",
    "Man behind Secret Tory tweets unmasks himself",
    "India official who emptied dam to get phone fined",
    "Rare manuscripts reveal medieval 'stand-up comedy'",
    "1 Tesla boss Musk on first China trip in three years",
    "2 CBI chair to quit as lobby giant fights to survive",
    "3 Chip firm briefly worth $1 trillion amid AI boom",
    "4 Coffee and chocolate drive supermarket prices up",
    "Why we need more female electricians",
    "Where the sound of nature is too quiet",
    "Lebanon's unexpected solar boom",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Chinese jet buzzed US military plane, says Pentagon",
    "Chinese jet buzzed US military plane, says...",
    "Black bear walks into bakery and eats 60...",
    "Black bear walks into bakery and eats 60 cupcakes",
    "Elizabeth Holmes walks into prison to start...",
    "Elizabeth Holmes walks into prison to start sentence",
    "Watch: Police find marijuana stash in...",
    "Watch: Police find marijuana stash in church-owned plane",
    "Watch: Beachgoers run for cover as shooting...",
    "Watch: Beachgoers run for cover as shooting breaks out",
    "Watch: Video appears to show drone flying...",
    "Watch: Video appears to show drone flying over Moscow",
    "My windows shook in Moscow drone attack - BBC...",
    "My windows shook in Moscow drone attack - BBC editor",
    "See how police freed a bear trapped inside a...",
    "See how police freed a bear trapped inside a car",
    "Watch rocket launch first Chinese civilian...",
    "Watch rocket launch first Chinese civilian into space",
    "Watch: Cheese rollers run down near-vertical...",
    "Watch: Cheese rollers run down near-vertical hill",
    "Elizabeth Holmes begins 11-year prison sentence",
    "I, Daniel Blake star hopes adaptation 'makes people angry'",
    "Man prises croc's jaws off head at Australian resort",
    "Coffee and chocolate drive supermarket prices up",
    "Top Chinese scientist says don’t rule out Covid lab leak",
    "Windrush generations mark 75th anniversary",
    "Precious cheetah cubs die in Indian national park",
    "Why Erdogan's victory matters for the West  By Katya Adler",
    "Why prosperity can't break India's dowry curse  By Soutik Biswas",
    "A growing case of transatlantic heartburn  By Katty Kay",
    "Branson's rocket plane returns to spaceflight  By Jonathan Amos",
    "How nervous are investors about the debt ceiling?  By Natalie Sherman",
    "FBI reveals 1980s plot to kill Queen Elizabeth II  By Chloe Kim",
    "Deep-sea mining hotspot teems with mystery animals  By Helen Briggs",
    "Why is UK inflation higher than US and Germany?  By Faisal Islam",
    "Why car parks are the hottest space in solar power",
    "Protein's power is being uncovered and unleashed",
    "Photographing history: The quarrymen of Wales",
    "Photographer blends Africa with Welsh communities",
    "Warm smiles and purple skies: Africa's top shots",
    "In pictures: King and Queen visit Northern Ireland",
    "Dad completes 1,000 days of toy car photos",
    "NE Scotland, Orkney & Shetland",
    "رئیس قوه قضائیه ایران: آنها که باید اعدام شوند، حکم‌شان اجرا خواهد شد",
    "La odisea de las madres ucranianas que viajan a Rusia para recuperar a sus hijos robados",
    "Chiến đấu cơ Trung Quốc lượn 'hung hãn' gần máy bay quân sự Mỹ",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]