[
    "Turks decide if Erdogan should have 5 more years",
    "Hundreds of expelled Germans set to leave Russia",
    "McCarthy confident of US debt ceiling deal in time",
    "How rhythm affects your social life",
    "India's new wave of shocking films",
    "Twitter pulls out of voluntary EU fake news code",
    "'We’re ready to begin counter-offensive' - Ukraine",
    "Dortmund draw gifts Bayern title on thrilling final day",
    "Verstappen grabs Monaco GP pole from Alonso",
    "Lara v Wood & Okolie v Billam-Smith - radio & text",
    "Belfast's Conlan faces Lopez for IBF world title - live text",
    "What's the best language for maths?",
    "Why is the US banning children's books?",
    "A singular American sandwich",
    "Where the Amish go on holiday",
    "The science behind intermittent fasting and why it's so good for you",
    "The surprising pitfalls of the most common career advice",
    "Is talent or hard work more important?",
    "Why we need more female electricians",
    "David Lynch on 'the beauty in the dark'",
    "Istanbul's five best hammams",
    "Passenger arrested for opening plane door mid-air",
    "Celine Dion cancels entire tour over poor health",
    "Amazing pictures of 5,000 new species found in the Pacific Ocean",
    "1 BA cancels dozens more flights following IT issues",
    "2 Sam Altman: OpenAI has no plans to leave Europe",
    "3 Top Twitter engineer quits day after DeSantis launch",
    "4 JP Morgan cuts 1,000 jobs after US bank takeover",
    "5 Sainsbury’s boss denies profiting from high prices",
    "Where the sound of nature is too quiet",
    "Lebanon's unexpected solar boom",
    "The 1968 photo that changed the world",
    "The chip maker that became an AI superpower",
    "Why car parks are the hottest space in solar power",
    "Russia warns of 'new dimension' in Ukraine war",
    "Russia warns of 'new dimension' in Ukraine...",
    "We're ready to retake our country - Ukraine...",
    "We're ready to retake our country - Ukraine security boss",
    "Car swept backwards in raging Spanish...",
    "Car swept backwards in raging Spanish floodwaters",
    "Footage from cabin as plane door opens...",
    "Footage from cabin as plane door opens mid-flight",
    "Did Ukrainian drone boats attack Russian...",
    "Did Ukrainian drone boats attack Russian warship?",
    "What happened during Madeleine reservoir...",
    "What happened during Madeleine reservoir search?",
    "Supercell mesmerises storm watchers in New...",
    "Supercell mesmerises storm watchers in New Mexico",
    "Gushing winds rip through Guam during typhoon",
    "Moment car crashes into Downing Street gates",
    "Warm smiles and purple skies: Africa's top shots",
    "JP Morgan cuts 1,000 jobs after US bank takeover",
    "Willoughby 'hurt' over Schofield's lies on affair",
    "Musk brain chip firm's human study approved",
    "Alarm over cosmetic surgery-linked fungal outbreak",
    "Government defends oil boss to head climate talks",
    "ITV investigated rumours of Schofield relationship",
    "Branson's rocket plane returns to spaceflight  By Jonathan Amos",
    "How nervous are investors about the debt ceiling?  By Natalie Sherman",
    "FBI reveals 1980s plot to kill Queen Elizabeth II  By Chloe Kim",
    "Deep-sea mining hotspot teems with mystery animals  By Helen Briggs",
    "Why is UK inflation higher than US and Germany?  By Faisal Islam",
    "Poison and sabotage - why South Africa's lights go out  By Andrew Harding",
    "Four sticking points holding up debt ceiling deal  By Anthony Zurcher",
    "Biden's no-show takes shine off Pacific pact  By Laura Bicker",
    "Protein's power is being uncovered and unleashed",
    "'We are selling a product that we hope gets discontinued'",
    "In pictures: King and Queen visit Northern Ireland",
    "Dad completes 1,000 days of toy car photos",
    "NE Scotland, Orkney & Shetland",
    "Tina Turner: A life in pictures",
    "Ray Stevenson's film and TV career in pictures",
    "Picnics and blooms: The Chelsea Flower Show in pictures",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]