[
    "Silvio Berlusconi, former Italian PM, dies at 86",
    "Russian airman who defected and fled on foot speaks to BBC",
    "Girl, 11, from British family shot dead in France",
    "The millions of undiscovered shipwrecks",
    "The return of the UK's medieval highway",
    "'An era is over': World reacts to Silvio Berlusconi death",
    "Ukraine claims first victories of counter-offensive",
    "Jodie Comer among winners at Tony Awards",
    "Man City celebrate Treble, Toney on betting ban and transfer latest",
    "'Australia are formidable - but they can be beaten'",
    "Has Djokovic settled the men's GOAT debate?",
    "How to rewire your brain and tame your dark memories",
    "Is this the worst country to be gay?",
    "The 'alien' lifeforms discovered in the deep ocean",
    "Is 'burning bridges' a career killer?",
    "How Jurassic Park was 'Jaws on land'",
    "A 2,200-year-old secret inside a tart",
    "Why Apple Vision faces an uphill battle",
    "Top Belgian museum rethinks its Africa relationship",
    "George Soros hands reins of $25bn empire to son Alex",
    "The Scottish islands desperately seeking doctors",
    "1 Facebook owner Meta plans to create Twitter rival",
    "2 Reddit communities to go private on Monday",
    "3 Warning UK mortgage rates set to rise further",
    "4 Food boss calls for higher taxes on unhealthy food",
    "Could hosepipe drones tackle wildfires?",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "India attempts to revive its dwindling rubber industry",
    "'Two of my gay friends have gone missing'",
    "Busy US highway collapses after oil tanker blaze",
    "Busy US highway collapses after oil tanker...",
    "Nicola Sturgeon's arrest - explained in 80...",
    "Nicola Sturgeon's arrest - explained in 80 seconds",
    "Watch: How Colombia children jungle rescue...",
    "Watch: How Colombia children jungle rescue unfolded",
    "Trombonist soldier plays on after fainting",
    "Boris Johnson's political career... in 72...",
    "Boris Johnson's political career... in 72 seconds",
    "Watch: The public no longer believe Johnson -...",
    "Watch: The public no longer believe Johnson - Curtice",
    "Drone footage shows blaze at listed building",
    "Train smashes through truck on railway...",
    "Train smashes through truck on railway crossing",
    "Drone footage shows extent Ukraine dam burst...",
    "Drone footage shows extent Ukraine dam burst flooding",
    "Windfall tax to end if energy prices drop",
    "The Cube voice reveals prostate cancer diagnosis",
    "Man trots globe blending scenes into film locations",
    "How AI is helping doctors spot breast cancers",
    "US cancer drug shortage hits thousands of patients",
    "HotSat spacecraft to map heat loss from buildings",
    "Royal Academy Summer Exhibition: Who makes the cut?",
    "The elephant that has two India states on edge  By Meryl Sebastian",
    "UK heatwave: How does sunscreen work?  By Rachel Schraer",
    "The ghost of Boris Johnson haunts Rishi Sunak  By Chris Mason",
    "'The level of cruelty... it's like Stalin's time'  By Steve Rosenberg",
    "Is this indictment a threat to Trump's 2024 campaign?  By Anthony Zurcher",
    "El Niño planet-warming weather phase has begun  By Matt McGrath",
    "Taurine may extend life and health, scientists find  By James Gallagher",
    "Catching the men who sell subway groping videos  By Zhaoyin Feng, Aliaume Leroy & Shanshan Chen",
    "Why millions of useable hard drives are being destroyed",
    "The tech tricks that make computer games look real",
    "Surreal skies grip New Yorkers - in pictures",
    "In Pictures: The biggest music acts to play Wales",
    "Mosque plasterers and rock cutters: Africa's top shots",
    "Strawberry Moon captured over England",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "سخنگوی وزارت خارجه ایران مذاکرات با واسطه با آمریکا را تایید کرد",
    "Colombia: Làm cách nào bốn em bé có thể sống sót trong 'rừng thiêng nước độc'?",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]