[
    "Wagner group fully funded by Russian state, Putin says",
    "Kyiv likely to have retaken land held since 2014 - UK",
    "Major research 'lost after cleaner turns off fridge'",
    "Is there alien debris in the Pacific?",
    "The problem with 'fun' company retreats",
    "Trump heard on tape discussing secret documents",
    "Deforestation surges in 2022 despite pledges",
    "New Zealand to wipe out every last rat",
    "Transfer latest - Rice and Kane among targets",
    "Stokes 'deeply sorry' to hear of discrimination",
    "Chelsea's Loftus-Cheek close to joining AC Milan",
    "Are French people lazier than Americans?",
    "'Should I want to be fixed?'",
    "The truth about supplements and who should be taking them",
    "Why divas deserve to be difficult",
    "The 'Depression Burger' of Route 66",
    "A new city rising from the desert",
    "How workers win office-return fights",
    "Trafficked for his kidney and now forced into hiding",
    "US high court stops school's skirt rule for girls",
    "1 Meta launches $7.99 a month virtual reality service",
    "2 UK to work more closely with EU on financial services",
    "3 Ex-Audi boss avoids jail in VW emissions scandal",
    "4 Supermarkets deny they are making too much money",
    "5 PwC Australia sells division for 50p after scandal",
    "How a photo changed our view of chimps",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "The women tackling the 'woeful' diversity in plumbing",
    "The latest technology news direct to your inbox",
    "Police hunt man filmed carving names on Colosseum",
    "Police hunt man filmed carving names on...",
    "Fire engulfs tower and sprays embers over UAE...",
    "Fire engulfs tower and sprays embers over UAE city",
    "Watch moment horse airlifted to safety from...",
    "Watch moment horse airlifted to safety from pit",
    "Ros Atkins on... five impacts of the Wagner...",
    "Ros Atkins on... five impacts of the Wagner mutiny",
    "Watch 'curious' whale follow kayaker in...",
    "Watch 'curious' whale follow kayaker in Sydney",
    "Minke whale spotted leaping off Yorkshire...",
    "Minke whale spotted leaping off Yorkshire coast",
    "Powerful tornado tears through US city",
    "How many ways can you fill a pothole?",
    "Glastonbury: Watch the final day's acts in 93...",
    "Glastonbury: Watch the final day's acts in 93 seconds",
    "Lewis Capaldi calls off tour after Glastonbury set",
    "Revenge and deepfake porn laws to be toughened",
    "Masks, fighters and witches: Student photographers on show",
    "Trolleys spot hidden heart problems in shoppers",
    "Tribute acts stage protest outside Meta office",
    "UK could be starved of energy, says North Sea boss",
    "Titan sub CEO dismissed safety warnings as 'baseless cries'",
    "Myanmar army cuts off aid to cyclone survivors  By Kelly Ng & BBC Burmese",
    "Fox picks Jesse Watters to replace Tucker Carlson  By Sam Cabral",
    "Instability ratchets up pressure on Russian president  By Steve Rosenberg",
    "Teen on sub took Rubik's Cube to break record - mother  By Nomia Iqbal & Chelsea Bailey",
    "Why is it so rare to hear of Western cyber-attacks?  By Joe Tidy",
    "Why Kenya struck a big deal with the EU on its own  By Waihiga Mwaura",
    "How will Titan investigators find out what happened?  By Pallab Ghosh",
    "Beijing records hottest June day in 60 years  By Kelly Ng",
    "Cheers! Can AI help drinkers buy a better bottle of wine?",
    "Students switch to AI to learn languages",
    "Photographer shares shots of famous musicians",
    "Fans, foes and foil clothes: Africa's top shots",
    "Millinery masterpieces at Royal Ascot",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "Beauty of insects revealed in photo competition",
    "خلع سلاح واگنر آغاز می‌شود، همه شورشیان عفو شدند، پوتین: از جنگ داخلی جلوگیری شد",
    "سمجھ سے بالاتر ہے کہ جب کسی کے خلاف ثبوت نہیں تو فوج اسے کیسے گرفتار کر سکتی ہے: چیف جسٹس",
    "Mạng lưới toàn cầu của Wagner sắp tới sẽ ra sao?",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]