[
    "G7 agree to 'starve the Russian war machine'",
    "Could a US debt default unleash global chaos?",
    "Agency refuses to hand over Harry and Meghan photos",
    "How many space launches end in failure?",
    "Indiana Jones has 'lost its sparkle' ★★☆☆☆",
    "Why G7 has eight more seats at the table this year",
    "Outcry as Australian police Taser 95-year-old woman",
    "Inside the routine at Elizabeth Holmes' prison",
    "Premier League news conferences & Phil Jones to leave Man Utd",
    "Toney future is with Brentford despite ban - Frank",
    "'I don't think anyone has a bigger heart than me'",
    "Monster is 'a marvel' and 'bittersweet' ★★★★☆",
    "Indiana Jones and other Cannes highlights",
    "Depp's comeback 'respectable but dull' ★★☆☆☆",
    "The prince of pleasure who became king",
    "Four Japanese rules to live past 100",
    "The 2,000-year-old 'computer' that simply shouldn't exist",
    "Why it's 'imperative' to start using AI",
    "Lebanon's unexpected solar boom",
    "The Italian 'maestro of murder'",
    "The masters of a 5,000-year-old craft",
    "Quiz of the week: What's The Weeknd's name again?",
    "Smiths bassist Andy Rourke dies aged 59",
    "Bible becomes world's most valuable manuscript",
    "1 China overtakes Japan as world's top car exporter",
    "2 New sanctions will make sure Russia pays a price - Sunak",
    "3 Disney ends $867m Florida plan amid DeSantis feud",
    "4 Strip club dancers to form only US topless union",
    "The 1968 photo that changed the world",
    "What 1.5C living actually looks like",
    "The revival of a historic Italian fruit",
    "Protein's power is being uncovered and unleashed",
    "'We are selling a product that we hope gets discontinued'",
    "Watch: West Ham players confront violent AZ Alkmaar fans",
    "Watch: West Ham players confront violent AZ...",
    "Watch: Emotional Harrison Ford accepts Cannes...",
    "Watch: Emotional Harrison Ford accepts Cannes award",
    "G7 leaders unsure whether to wave during...",
    "G7 leaders unsure whether to wave during group photo",
    "Flying sofa seen over Turkish capital during...",
    "Flying sofa seen over Turkish capital during storm",
    "Abuse case won't define me - Johnny Depp",
    "Man saved after being spotted hanging out of...",
    "Man saved after being spotted hanging out of skylight",
    "Titanic: Scan reveals world's most famous...",
    "Titanic: Scan reveals world's most famous wreck",
    "Watch: E-scooter explodes and fire engulfs...",
    "Watch: E-scooter explodes and fire engulfs room",
    "Harry and Meghan arrive at event before...",
    "Harry and Meghan arrive at event before alleged car chase",
    "Dancers, divers and film-makers: Africa's top shots",
    "Indiana Jones star Ford 'moved' by Cannes award",
    "How Ukraine is tackling the mental scars of war",
    "Bills set to rise to pay for £10bn sewage clean-up",
    "Nicole Scherzinger to star in Sunset Boulevard",
    "Cash App founder murder suspect pleads not guilty",
    "North Carolina bans abortion after 12 weeks",
    "Will $3bn IMF loan solve Ghana's economic crisis?  By Thomas Naadi",
    "World likely to warm beyond key 1.5C limit by 2027  By Matt McGrath",
    "New negotiators raise hopes of US debt limit deal  By Sam Cabral",
    "Asia is spending to boost birth rates - will it work?  By Mariko Oi",
    "Thai vote winners ready to govern - if they're allowed  By Jonathan Head",
    "Finding Anwar - born while his mother fled for her life  By Rajini Vaidyanathan",
    "US cities far from border grapple with migrant crisis  By Mike Wendling",
    "'My grandma died alone in Sudan, now I can't bury her'  By Barbara Plett Usher",
    "How computer games encourage kids to spend cash",
    "Should social media face-altering filters be regulated?",
    "Slurping Spaghetti and other food photo contest winners",
    "Scans of Titanic reveal wreck as never seen before",
    "In pictures: Electric rally at an old coal mine",
    "In pictures: Eurovision performances fire up fans",
    "Angel wings and chess champs: Africa's top shots",
    "دستگاه قضایی ایران سه متهم پرونده «خانه اصفهان» را اعدام کرد",
    "Lãnh đạo G7 bàn kế hoạch tăng trừng phạt Nga trong ám ảnh di sản hạt nhân Hiroshima",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]