[
    "Search for Titanic sub enters decisive phase",
    "The health risks facing the crew of the Titanic sub",
    "Fears grow over Indian state on brink of civil war",
    "What professional women often sacrifice",
    "A unique safari through remote Brazil",
    "Could Russia really play nuclear roulette in Ukraine?",
    "German woman jailed for keeping Yazidi slave",
    "Why RFK Jr's campaign has avoided vaccine talk",
    "Man City's Gundogan to join Barcelona on free",
    "The draft star and his overdose - a death that changed America",
    "Arsenal agree £65m deal for Chelsea forward Havertz",
    "A 2,200-year-old mystery hidden in a pie",
    "Why is the missing submersible so hard to find?",
    "How modern tech is helping scientists talk to animals",
    "Europe's most expensive painting ever?",
    "The Gen Xers making dream-career pivots",
    "The aircraft that can 'see' underwater",
    "The LGBTQ+ landmark almost no one knows",
    "Stars watch Pharrell take over Paris Fashion Week",
    "Toxic algae kills hundreds of dolphins and sea lions",
    "Morgan and Rapinoe named in USA World Cup squad",
    "1 Australia threatens to fine Twitter over online hate",
    "2 Amazon accused of tricking Prime customers",
    "3 Turkey set for U-turn and steep interest rate hike",
    "4 Singapore fines firms over Wirecard scandal breaches",
    "5 Canada bread maker fined C$50m in price-fixing scheme",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "Could hosepipe drones tackle wildfires?",
    "Airbus experiments with more control for the autopilot",
    "Today's newsletter: Zuckerberg’s astonishing comeback",
    "Watch: The missing Titanic sub... in 77 seconds",
    "Watch: The missing Titanic sub... in 77...",
    "How tapping sounds might reach rescue teams",
    "Paris building in flames after huge explosion",
    "'Hi miss!': Hollywood star surprises sister...",
    "'Hi miss!': Hollywood star surprises sister in class",
    "Watch: Huge fire burns in Las Vegas",
    "Watch: Glastonbury fan gets the giggles live...",
    "Watch: Glastonbury fan gets the giggles live on TV",
    "How the search for the Titanic sub is...",
    "How the search for the Titanic sub is unfolding",
    "St John's hoping for missing sub's safe...",
    "St John's hoping for missing sub's safe return",
    "Watch: Inside Titanic sub before it went...",
    "Watch: Inside Titanic sub before it went missing",
    "Search expert describes friends missing on...",
    "Search expert describes friends missing on Titan sub",
    "Hackers claim not to have BBC, Boots and BA data",
    "Succession star to play 26 roles in UK stage show",
    "Barbados PM fights for shake-up of climate finance",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "Arkansas ban on gender transition treatment scrapped",
    "If US firms 'go woke', do they really go broke?",
    "Experts had warned about safety of missing sub",
    "Why the US is rolling out the red carpet for Modi  By Vikas Pandey",
    "The struggles and scandals of Hunter Biden  By Sam Cabral",
    "Three key priorities in crucial US-China talks  By Anthony Zurcher",
    "Hacker gang Clop publishes victim names on dark web  By Joe Tidy",
    "Why African leaders are travelling to Ukraine  By Barbara Plett Usher",
    "McGregor accused of sex assault after NBA game  By Chelsea Bailey",
    "Japan rewrites sex crime laws in landmark move  By Kelly Ng",
    "First synthetic human embryo raises ethical issues  By James Gallagher",
    "The workers already replaced by artificial intelligence",
    "Kelly Hoppen: 'Music is design to me'",
    "Beauty of insects revealed in photo competition",
    "Dazzling ancient bronze sword found in Germany",
    "Burna Boy bling and high flyers: Africa's top shots",
    "Man trots globe blending scenes into film locations",
    "In pictures: Nottingham attack shakes city to core",
    "Liệu Nga có chơi trò hạt nhân ở Ukraine?",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]