[
    "Millions advised to mask up due to wildfire smoke",
    "Pence tears into Trump at 2024 campaign launch",
    "BBC reporter confronts man who sells groping videos",
    "Why Ukraine dam sabotage is so catastrophic",
    "Why Wales became the 'land of song'",
    "Hundreds of NYC flights delayed over smoky skies",
    "Why this teen says he was rejected by top US colleges",
    "US cancer drug shortage hits thousands of patients",
    "West Ham win dramatic Europa Conference League final",
    "Surviving Hitler - the Jewish star who shone amid Berlin's ruins",
    "'I've taken the decision' - Messi to join Inter Miami",
    "Five myths about wildfires",
    "How distant wildfires harm your health",
    "The most intense firestorms in the world",
    "How an advanced civilisation vanished 2,500 years ago",
    "Why one of the world's greatest composers was erased from history",
    "The ancient mystery of Sicily's underground 'palace'",
    "The world's best 'hidden' dive spots",
    "The best comic book movies ever made",
    "Why AI won't be a burnout cure",
    "Why fish are finding it hard to breathe",
    "Egypt bans Dutch archaeologists over Black music exhibit",
    "Florida admits role in flying migrants to California",
    "We tried out Apple's $3,499 headset - what's the verdict?",
    "1 CNN chief out after just 13 months",
    "2 Telegraph Media Group set to be put up for sale",
    "3 Heathrow security officers announce summer strikes",
    "4 Sunak to raise trade issues in US talks with Biden",
    "5 TikTok owner helped China spy on HK activists - lawsuit",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "The first lab-grown burger: 10 years on",
    "'Two of my gay friends have gone missing'",
    "Why millions of useable hard drives are being destroyed",
    "Canada fires shroud New York City with orange haze",
    "Canada fires shroud New York City with orange...",
    "Ukraine drops water bottles to people...",
    "Ukraine drops water bottles to people stranded by floods",
    "Watch Hawaii's Kilauea volcano erupting in...",
    "Watch Hawaii's Kilauea volcano erupting in fiery display",
    "Watch moment woman is rescued from...",
    "Watch moment woman is rescued from floodwaters",
    "Ukraine dam breach rescue... in 62 seconds",
    "Prince Harry arrives at the High Court for...",
    "Prince Harry arrives at the High Court for day two",
    "Colorado wildlife officer frees bear from car",
    "Watch moment thief gives up on liquor store...",
    "Watch moment thief gives up on liquor store robbery",
    "Strikes heard during BBC interview about...",
    "Strikes heard during BBC interview about floods",
    "Ros Atkins unpacks the Ukraine dam breach",
    "Customers surprised by naturists dining in pub",
    "Why it took India 42 years to convict a 90-year-old of murder",
    "The Flash: Flash of genius or flash in the pan?",
    "Ghana patients in danger as nurses head for UK - medics",
    "Mind how you use brain data, watchdog warns",
    "TV's Julie Goodyear reveals dementia diagnosis",
    "The only place in the world selling lab-grown meat",
    "GPs in England set to offer weight-loss jab to reduce obesity  By Michelle Roberts",
    "Cyber gang issues ultimatum to mass hack victims  By Joe Tidy",
    "No means no: Japan is set to redefine rape  By Tessa Wong & Sakiko Shiraishi",
    "Why Putin has put this religious art on display  By Steve Rosenberg",
    "Ex-Vice-President Mike Pence joins White House race  By Sam Cabral",
    "How did three trains collide in India?  By Geeta Pandey",
    "How the Pakistani military feel about Imran Khan  By Farhat Javed",
    "Putin - South Africa's big headache  By Andrew Harding",
    "The tech tricks that make computer games look real",
    "The 'exploding' demand for giant heat pumps",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "Top Scottish landscape photographers announced",
    "Long lashes and fashion flair: Africa's top shots",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "Las prohibiciones que están transformando Florida en un bastión ultraconservador en EE.UU.",
    "عمران خان کو ایک بار پھر گرفتاری کا خدشہ، تحریک انصاف کے اہم سابق رہنما جہانگیر ترین کے کیمپ میں",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]