[
    "Nasa UFO team says over 800 'incidents' investigated",
    "Sackler family wins immunity from opioid lawsuits",
    "Djokovic's political message 'not appropriate'",
    "Spider-Verse sequel is 'disappointing'",
    "The isles where baguettes are regulated",
    "AI 'godfather' feels 'lost' over life's work",
    "US debt deal heads to vote despite hard-line revolt",
    "A top soldier's defamation case rocks Australia",
    "Europa League final live text: Build-up to Sevilla v Roma",
    "Messi set for decision on future - and it won't be Barcelona",
    "Mead left out of England World Cup squad",
    "Are tech companies doing enough to protect us?",
    "The unfortunate history of a deadly 'demonic pact with the devil'",
    "Where the Amish go on holiday",
    "The fight over children's classics",
    "What is an 'orchid' parent?",
    "Why Gen Z are so pay motivated",
    "The first autism-friendly US city",
    "Sia reveals autism diagnosis after film backlash",
    "Air New Zealand weighing passengers before flying",
    "New Yorkers gather for Manhattanhenge",
    "1 Amazon staff protest climate record and office return",
    "2 Tesla boss Musk on first China trip in three years",
    "3 CBI boss admits vote on plans to change 'critical'",
    "4 Chip firm briefly worth $1 trillion amid AI boom",
    "Why we need more female electricians",
    "Where the sound of nature is too quiet",
    "Lebanon's unexpected solar boom",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Watch: Missile falls from sky onto busy Kyiv road",
    "Watch: Missile falls from sky onto busy Kyiv...",
    "Why South Korea woke up to sirens... in 73...",
    "Why South Korea woke up to sirens... in 73 seconds",
    "Watch: Rick rolls on to BBC Breakfast in his...",
    "Watch: Rick rolls on to BBC Breakfast in his pyjamas",
    "Chinese jet buzzed US military plane, says...",
    "Chinese jet buzzed US military plane, says Pentagon",
    "Black bear walks into bakery and eats 60...",
    "Black bear walks into bakery and eats 60 cupcakes",
    "Elizabeth Holmes walks into prison to start...",
    "Elizabeth Holmes walks into prison to start sentence",
    "Watch: Police find marijuana stash in...",
    "Watch: Police find marijuana stash in church-owned plane",
    "Watch: Beachgoers run for cover as shooting...",
    "Watch: Beachgoers run for cover as shooting breaks out",
    "Watch: Video appears to show drone flying...",
    "Watch: Video appears to show drone flying over Moscow",
    "My windows shook in Moscow drone attack - BBC...",
    "My windows shook in Moscow drone attack - BBC editor",
    "Music industry responds to streaming pay anger",
    "Gollum game mocked as developers issue apology",
    "Peas that don't taste like peas could help planet",
    "Chip firm briefly worth $1 trillion amid AI boom",
    "Top Chinese scientist says don’t rule out Covid lab leak",
    "Windrush generations mark 75th anniversary",
    "Using pig fat as green jet fuel 'will hurt planet'",
    "She bought an abandoned US lighthouse. Now you can too  By Chelsea Bailey",
    "Why Erdogan's victory matters for the West  By Katya Adler",
    "Why prosperity can't break India's dowry curse  By Soutik Biswas",
    "A growing case of transatlantic heartburn  By Katty Kay",
    "Branson's rocket plane returns to spaceflight  By Jonathan Amos",
    "How nervous are investors about the debt ceiling?  By Natalie Sherman",
    "FBI reveals 1980s plot to kill Queen Elizabeth II  By Chloe Kim",
    "Deep-sea mining hotspot teems with mystery animals  By Helen Briggs",
    "Why car parks are the hottest space in solar power",
    "Protein's power is being uncovered and unleashed",
    "Photographing history: The quarrymen of Wales",
    "Photographer blends Africa with Welsh communities",
    "Warm smiles and purple skies: Africa's top shots",
    "In pictures: King and Queen visit Northern Ireland",
    "Dad completes 1,000 days of toy car photos",
    "NE Scotland, Orkney & Shetland",
    "Trung Quốc gây hấn trên Biển Đông và động thái của Thủ tướng Chính",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]