[
    "Man tries to open plane door",
    "From OceanGate/FILE\n\n\n\n\n\n•Live Updates",
    "Deep-sea explorer on what the banging sound could be",
    "Ex-OceanGate employees voiced safety concerns years ago about missing vessel",
    "Yes, Titanic tourism is a thing, and it’s dangerous",
    "These are the people onboard the missing submersible",
    "Here’s what James Cameron has said about diving to the Titanic wreckage",
    "Opinion: While we hope for the best, let’s not forget these other victims",
    "Ukraine pleads for F-16s as they struggle to contain Russia forces",
    "Live Updates: ‘Another massive air attack’ on Kyiv by Moscow",
    "Analysis: Ukraine has cards left to play in brutal, slow counteroffensive",
    "Ukraine needs investors to rebuild its war-torn economy",
    "Ukrainian sniper shares new video of injured fighter ‘torn apart’ by blast",
    "Sean Kilpatrick/AP/File\n\n\n\n\n\n•Analysis",
    "How Modi went from being banned to embraced by the US",
    "Opinion: Biden rolls out the red carpet for a controversial world leader",
    "Biden compares Xi to ‘dictators’ a day after Blinken’s visit to Beijing ends",
    "Grief shrouds remote Pakistan mountain village after Greece migrant boat tragedy",
    "China surpasses US in popularity among Arab youth as Beijing expands Middle East footprint",
    "UK stands out from its peers as inflation unexpectedly holds steady",
    "Your worst nightmare: A Chinese student found a rat’s head in his food",
    "Palestinian villagers attacked in wake of Israeli settler killings: Palestinian official",
    "CNN on scene showing burned-out cars as violence surges in West Bank",
    "‘Mao’s Last Dancer’ to step away from ballet due to ‘serious health concerns’",
    "India's Press Information Bureau/Reuters",
    "Elon Musk says Tesla is coming to India ‘as soon as humanly possible’",
    "Germany’s biggest newspaper cuts 20% of jobs at it prepares for AI",
    "Three students abducted in deadly school attack rescued by Ugandan forces",
    "Cocoa prices are soaring. This is what it means for your chocolate",
    "Cristiano Ronaldo scores last-minute winner on record-breaking appearance",
    "His wife posted on social media that he was dead. Then he rode into his funeral on a helicopter",
    "FilippoBacci/E+/Getty Images",
    "Travel experiences you can only enjoy while you’re young",
    "Daniel Leal/AFP/Getty Images",
    "Summer solstice is here. Here’s what that actually means",
    "European tourist island declares itself a phone-free zone",
    "Clive Brunskill/Getty Images",
    "NOAA Office of Ocean Exploration/AP",
    "What we know about the ocean’s depths — and why it’s so risky to explore it",
    "South Korean man who attempted to open plane door mid-flight tests positive for drugs",
    "Lionel Messi reportedly expected to make Inter Miami debut in July",
    "The Big Rock Blue Marlin Tournament/SPORTS REPORT+/TMX\n\n\n\n\n\n•Video",
    "Shark ruins $3.5 million payday for fishermen",
    "Stefano Rellandini/AFP/Getty Images",
    "See Pharrell Williams’ new collection for Louis Vuitton",
    "Billionaire heiress Aerin Lauder shows off her ‘enchanting’ Palm Beach mansion",
    "The Rembrandt museum’s newest souvenir is ‘a work of art that you carry with you for life’",
    "Move over, Europe: a new culinary capital takes World’s Best Restaurant title",
    "Massimo Insabato/Mondadori Portfolio/Getty Images",
    "Tennis great Martina Navratilova tweets that she is ‘all clear’ after cancer treatment",
    "The Ashes 2023: ‘Bazball’ down but not out after thrilling Test match",
    "Dozens of goats made an escape. Doorcam catches what they did next",
    "Jamie Grill/The Image Bank RF/Getty Images",
    "401(k) plans have never been hotter. That’s changing the stock market",
    "Fed Chair Powell is heading to Capitol Hill. Here’s what to expect",
    "Yes, inflation is coming down. That doesn’t mean goods and services will be cheaper",
    "It could take 131 years for the world to close the gender gap, report shows",
    "News organizations are struggling to cover media figures and politicians peddling delusions",
    "Qantas reveals economy seats for 19-hour NYC-Sydney ultra long-haul flights",
    "A world in three islands on the Mediterranean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "He ran out of countries to visit, so he created his own",
    "One of the world’s fastest athletes is without a country to run for",
    "Meet the photographer redefining how we view the world of chess",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "He was one of the world’s top surfers but grew up scared of the ocean",
    "Could these air purification towers tackle India’s pollution problem?",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Miriam Margolyes poses nude for British Vogue",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Environment activists smear red paint on Monet artwork at Stockholm museum",
    "Gavriil Grigorov/Sputnik/Reuters",
    "A sign Putin is losing ground",
    "This is bigger than just the US and China",
    "As a father, I’ll be sure my Black daughters get ‘The Talk’",
    "Why I flew to Jamaica to take magic mushrooms … on camera",
    "A plane crash, a miracle rescue, and the balm we were all looking for",
    "The city of love has a plan for its rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "NASA/JPL-Caltech/SwRI/MSSS",
    "NASA spacecraft captures image of ghostly lightning on Jupiter",
    "Study: How much contact you have with people could be a risk factor for early death",
    "Remembering Sally Ride’s historic 1983 spaceflight",
    "Heavy drinkers really don’t ‘handle their liquor,’ study says",
    "Early humans left Africa and reached Asia earlier than thought, fossil discovery reveals",
    "Bernie Sanders launches Senate probe into Amazon warehouse safety conditions",
    "YouTube removed video of Robert F. Kennedy, Jr. for violating vaccine misinformation policy",
    "Alibaba names new chairman and CEO in major shakeup",
    "Italy ties China’s hands at Pirelli over fears about chip technology",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’",
    "Video shows the moment after multiple British soldiers collapsed due to extreme heat"
]