[
    "Unknown Rembrandt portraits",
    "Home bulldozed after viral video",
    "Milan Kammermayer/AFP/Getty Images\n\n\n\n\n\n•Live Updates",
    "Analysis:\nPrigozhin’s fate remains unclear and it signals more trouble in Russia",
    "‘They would love to kill him’: Putin critic explains Prigozhin raid",
    "Analysis:\nPrigozhin has been cast out into the cold",
    "Andre Luis Alves/Anadolu Agency/Getty Images\n\n\n\n\n\n•Analysis",
    "The US is expected to give Ukraine a controversial weapon banned in over 100 countries",
    "Retired Maj. Gen. explains the damage cluster munitions can do",
    "Jenin incursion was meant to weaken militant groups, but has made Palestinian fighters defiant",
    "Michael Cohen has warning for Donald Trump aide Walt Nauta",
    "Lyft driver who fled Taliban fatally shot in Washington, DC, police say",
    "Dozens trapped on one of the highest cable car systems after technical failure",
    "India bulldozes home of man who allegedly urinated on tribal member",
    "‘The world can’t look away’ from abuses against the Rohingya: ICC official",
    "‘The masses are suffering,’ Nigerians lament high cost of living",
    "Threads explained: Twitter rival pits Zuckerberg against Musk",
    "Global shipping industry climate pledge slammed as a ‘wishy washy’ compromise",
    "See one of the worst summer storms to hit the Netherlands in 50 years",
    "Andy Murray’s Wimbledon match against Stefanos Tsitsipas ends on cliffhanger",
    "Marble head unearthed during works in Rome piazza",
    "Man reported missing as teen 8 years ago was at home with his mom: police",
    "Real Madrid sign 18-year-old soccer sensation dubbed ‘Turkish Messi’",
    "Arnold Jerocki/Getty Images",
    "Shakira’s ‘No’ jacket relays the message loud and clear",
    "Bomberos de Quito\n\n\n\n\n\n•Video",
    "Video shows people trapped in one of world’s highest cable cars",
    "Sumo retirees play for laughs from tourists flooding back to Japan",
    "Ruby Princess cruise ship crashes into San Francisco pier",
    "Russian 16-year-old Mirra Andreeva, trailed by Netflix cameras, reaches Wimbledon third round",
    "Killer jaguar and grieving elephant among award-winning photos",
    "Unknown Rembrandt portraits found in private collection fetch $14.2 million",
    "Christian Petersen/Getty Images",
    "Sha’Carri Richardson runs the fastest women’s 100m time of the year",
    "Yagi Studio/Digital Vision/Getty Images",
    "What do chefs say about prewashing rice?",
    "Chris Jackson/Getty Images",
    "Royal destinations you need to visit in the UK",
    "Paramount Pictures/Twitter",
    "A trailer for the Bob Marley biopic has dropped. Here’s what we know",
    "L.E. Baskow/Las Vegas Review-Journal/AP\n\n\n\n\n\n•Video",
    "See Las Vegas’ newest record-breaking entertainment venue",
    "The US economy can’t function smoothly without UPS. That’s why a strike will hurt",
    "The US labor market cooled off in June, adding just 209,000 jobs",
    "Some investors are shunning Wall Street’s tech frenzy",
    "China’s export curbs on raw materials are concerning, Yellen says on Beijing trip",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "She stuffed a bra with clothes before boarding a plane. Here’s why",
    "Marcelo Hernandez/Getty Images South America/Getty Images",
    "Soccer players and fans left perplexed after ball crosses the line … but no goal is awarded",
    "What Roger Federer did next",
    "The ‘world’s fastest accountant’ is taking track and field by storm",
    "Mystery of North Korean player who stunned the soccer world – then disappeared",
    "Summer transfer window: The biggest moves so far as Saudi Arabia becomes major factor",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Barely visible ‘Louis Vuitton’ handbag sells for over $63,000",
    "Robot takes podium as orchestra conductor in South Korea",
    "Life in limbo: Photographer documents ‘Kafka-esque’ migrant experience",
    "Alex Chan Tsz Yuk/SOPA/Shutterstock",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Lab-grown meat is an expensive distraction from reality",
    "When ‘free speech’ becomes a bully’s free pass",
    "I was the most senior Islamic leader to visit Auschwitz. Here’s what I know about peace",
    "John Bazemore/AP\n\n\n\n\n\n•Analysis",
    "Two very different points of view on nuclear energy in the US",
    "House Freedom Caucus voted to remove Greene before July Fourth break, congressman says",
    "Analysis:\n‘Race neutral’ replaces affirmative action. What’s next?",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Samsung flags massive drop in quarterly profit as chip glut drags on",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Meta officially launches Twitter rival Threads. 30 million have joined already",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Levon Biss/American Museum of Natural History",
    "Extraordinary close-up images show insects as you’ve never seen them before",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Jean-Christophe Verhaegen/AFP/Getty Images",
    "These animals went extinct in the wild. Scientists brought them back",
    "The icy patience of an Arctic photographer",
    "Oliver Rossi/Stone RF/Getty Images",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Art-loving Helsinki deputy mayor caught graffitiing the city",
    "At least 48 dead in road accident in western Kenya, officials say",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Migrant who died in ICE custody was held for months, despite recommendation for release, SPLC says",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean"
]