[
    "Missing Titanic submersible",
    "Man tries to open plane door",
    "OceanGate Expeditions/AP/File\n\n\n\n\n\n•Live Updates",
    "How the Titanic-exploring submersible could be rescued",
    "Last images of submersible crew before descent to Titanic wreckage",
    "Billionaire explorer and Titanic tour company founder among those on board",
    "See inside of submersible typically used for Titanic expedition",
    "Mandel Ngan/AFP/Getty Images\n\n\n\n\n\n•Analysis",
    "CNN Poll: Trump’s GOP support appears to soften post-indictment",
    "Serhii Nuzhnenko/Radio Free Europe/Radio Liberty/Reuters\n\n\n\n\n\n•Live Updates",
    "Russia moving resources to front line in south, Ukraine says",
    "Ukrainian pilots say this would be a game-changer in the fight against Russia",
    "Opinion: A sign Putin is losing ground",
    "Flight crew uses lasso rope to stop South Korean man trying to open plane door",
    "Pentagon says Ukraine accounting error revealed last month is much bigger than previously stated",
    "Survivors give horrific accounts of ‘parade’ of sexual abuse at Catholic high school",
    "Analysis: How Modi went from being banned to embraced by the US",
    "Hunter Biden to plead guilty to two minor federal tax charges",
    "Carlos Ghosn sues Nissan for $1 billion in Lebanon",
    "Andrew Tate indicted on human trafficking and rape charges in Romania",
    "Andrew Surma/SIPAPRE/Sipa USA/AP",
    "New Zealand-Qatar match stopped at halftime after racial abuse claim",
    "North Atlantic experiencing a ‘totally unprecedented’ marine heat wave",
    "Dozens die in single district in northern India amid severe heatwave",
    "Sources: Stoltenberg increasingly likely to be asked to stay on as NATO chief",
    "Alibaba replaces its chairman and CEO in the biggest shakeup of its history",
    "Shark ruins $3.5 million payday for fishermen",
    "ROSLAN RAHMAN/AFP/Getty Images",
    "The world’s best airline for 2023 revealed",
    "Rubens painting ‘lost’ for centuries could sell for $7.7 million",
    "Lillian Suwanrumpha/AFP/Getty Images",
    "This country charges a $200 a day tourist tax. Now there’s a way to save money",
    "Courtesy Alex Treadway/ICIMOD",
    "Tara Moore/Digital Vision/Getty Images",
    "Daytime naps may be good for our brains, study says",
    "Design Pics Inc/Shutterstock",
    "The secret mission that led to Titanic wreck’s discovery",
    "AFP/Getty Images\n\n\n\n\n\n•Video",
    "Church submerged for 60 years reappears in Mexico",
    "Estonia legalizes same-sex marriage and adoption",
    "Square where Julius Caesar was killed opens to the public in Rome",
    "The future of travel: 10 concepts that will change the way we experience the world",
    "Giant airships could revolutionize transport",
    "He dreams of competing at the Olympics but has no country to race for",
    "Stallone says Adele made keeping Rocky statue a deal breaker in buying his house",
    "This dance cost a teen her diploma on stage at graduation",
    "Record-breaking Kylian Mbappé scores 54th goal of the season",
    "Bud Light is ‘coming back’ but controversy is a ‘wake-up call,’ Anheuser-Busch exec says",
    "Rivian joins Ford and GM in turning to Tesla chargers",
    "Your boss has a plan to get you back to the office",
    "US home construction surged in May by the fastest pace in more than a year",
    "Domino’s will deliver your next pizza without an address",
    "aapsky/iStockphoto/Getty Images",
    "A world in three islands on the Mediterranean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "He ran out of countries to visit, so he created his own",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "Maria Emelianova/Chess.com",
    "Meet the photographer redefining how we view the world of chess",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "After retiring at 28, ex-tennis star avoided ‘big black hole of depression’",
    "He was one of the world’s top surfers but grew up scared of the ocean",
    "Could these air purification towers tackle India’s pollution problem?",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Miriam Margolyes poses nude for British Vogue",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Environment activists smear red paint on Monet artwork at Stockholm museum",
    "Michael Webb/Hulton Archive/Getty Images",
    "The ‘fifth Beatle’ isn’t who you might think",
    "Trump, the hoarder in chief",
    "DeSantis and Pence want to bring back Fort Bragg",
    "How prepared is Russia for the counteroffensive?",
    "Why I flew to Jamaica to take magic mushrooms … on camera",
    "A plane crash, a miracle rescue, and the balm we were all looking for",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "NASA/JPL-Caltech/SwRI/MSSS",
    "NASA spacecraft captures image of ghostly lightning on Jupiter",
    "Study: How much contact you have with people could be a risk factor for early death",
    "Remembering Sally Ride’s historic 1983 spaceflight",
    "Heavy drinkers really don’t ‘handle their liquor,’ study says",
    "Early humans left Africa and reached Asia earlier than thought, fossil discovery reveals",
    "YouTube removed video of Robert F. Kennedy, Jr. for violating vaccine misinformation policy",
    "The largest newspaper publisher in the US sues Google, alleging online ad monopoly",
    "Italy ties China’s hands at Pirelli over fears about chip technology",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’",
    "Video shows the moment after multiple British soldiers collapsed due to extreme heat"
]