[
    "Analysis: Russia’s elite get taste of the war right in their luxurious neighborhoods",
    "Member of Russia’s parliament calls attack ‘new reality we will have to recognize’",
    "See what Moscow buildings looked like after drone attack",
    "Readying the counteroffensive, Ukrainians ‘know how to deal with the enemy’",
    "Cecilie_Arcurs/E+/Getty Images",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "Here’s what’s in the debt ceiling deal agreed by Biden and House GOP",
    "Biden and McCarthy scramble to sell debt deal to hard-liners",
    "‘She lay there lifeless’: Public killing of teen girl in India angers father",
    "Why did ethnic Serbs attack NATO peacekeepers in Kosovo? What we know",
    "Italian secret service agents among victims of Lake Maggiore boat accident",
    "Thousands of ethnic minority Muslims defy China authorities in mosque defense",
    "One Vietnam War POW spent 10 months in a ‘tiger cage.’ His commander rotted in a ‘hell hole’",
    "Ex-Putin ally breaks down what Russia’s strategy reveals about Putin’s mindset",
    "Elizabeth Holmes set to report to prison",
    "A snorkeler was bitten on the head by a crocodile. This is what he did next",
    "TikTok dad challenging masculinity stereotypes goes viral",
    "Former US first lady Rosalynn Carter has dementia, Carter Center says",
    "4 kids still missing in Colombian jungle",
    "Venice authorities discover why canal turned fluorescent green",
    "Air New Zealand to weigh passengers before they board the airplane",
    "bymuratdeniz/E+/Getty Images",
    "Weight-loss surgery is becoming more common among children and teens, new research shows",
    "Dominika Zarzycka/NurPhoto/Getty Images",
    "Malaysian Maritime Enforcement Agency/Facebook",
    "Emmanuel Dunand/AFP/Getty Images",
    "Novak Djokovic makes political statement about Kosovo after first-round French Open win",
    "Arnold Schwarzenegger has a lot of love for Bruce Willis",
    "Jorgen Ree Wiig/Norwegian Directorate of Fisheries/Sea Surveillance Service",
    "Alleged Russian ‘spy’ whale now in Swedish waters",
    "‘Emergency summit’ organized following 12 horse deaths at Churchill Downs",
    "Solar trees with a seven-meter canopy could soon be charging your car",
    "Lionel Messi: What next for arguably the greatest player in history?",
    "Taipei’s hottest new menu item is a 14-legged crustacean",
    "Michael Reaves/Getty Images",
    "After cancer battle, baseball pitcher makes emotional return",
    "Jamie McCarthy/Getty Images",
    "Sarah Snook may have just introduced her new baby in the cutest way",
    "See adventurous eaters try this 14-legged crustacean dish",
    "Amr Abdallah Dalsh/Reuters",
    "Ancient tombs and mummification workshops unearthed",
    "31 billionaires are worth more than the US Treasury has in cash",
    "How crypto is dealing with the debt ceiling turmoil",
    "Corporate America celebrates debt ceiling deal and urges Congress to quickly pass legislation",
    "State Farm stops home insurance sales in California, citing wildfire risks",
    "Dare to bare: 20 of the world’s best nude beaches",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "Daniel Pockett/Getty Images",
    "How identical twins became tennis’ greatest double act",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Liverpool great in tears after final match at Anfield",
    "Cate Blanchett’s bare feet make the ultimate style statement",
    "The mourning dress codes of ‘Succession’",
    "By recreating old photos, children of immigrants step into their parents’ shoes",
    "Could these air purification towers tackle India’s pollution problem?",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Lunar lander likely fell 3 miles before crashing into moon in historic attempt",
    "Ancient toilets unearthed in Jerusalem reveal a debilitating disease",
    "New unprecedented images reveal what’s happening on the sun",
    "What to know about body dysmorphia, the condition affecting Megan Fox",
    "Advice from a ‘divorce whisperer’ on reclaiming yourself",
    "The diet that can lower ‘bad’ cholesterol",
    "China urges Japan to end curbs on chip exports",
    "The world’s biggest ad agency is going all in on AI with Nvidia’s help",
    "Elon Musk says Twitter has ‘no actual choice’ about government censorship requests",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "Microsoft executive calls for faster AI regulation",
    "Billionaire entrepreneur’s space tourism company pulls off high-stakes crewed test flight",
    "World’s highest building could be surrounded by a giant ring",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]