[
    "Ukraine’s plea to join NATO",
    "Attack outside Chinese kindergarten",
    "UNESCO site allegedly defaced",
    "Getty Images/Wagner/Anadolu Agency/File\n\n\n\n\n\n•Live Updates",
    "Biden met with British PM Sunak in London on eve of crucial NATO summit",
    "Analysis:\nWhy Ukraine’s plea to join NATO is a profound dilemma",
    "Explained:\nWhy NATO is so significant in the west’s relationship with Russia",
    "Leaked details of Putin’s secret luxury train expose Russian leader’s ‘paranoia’",
    "Sanchit Khanna/Hindustan Times/Getty Images",
    "New Delhi records wettest July day in decades as deadly floods hit northern India",
    "The planet is getting hotter fast. What happens to your body in extreme heat",
    "What’s driving record-breaking temperatures around the world?",
    "She dreamed of defending Japan. Instead, her fellow soldiers sexually assaulted her",
    "Knife attack outside kindergarten in China city kills 6",
    "Canadian teen questioned for allegedly defacing UNESCO-listed temple in Japan",
    "Trump seemingly baffled by ‘blizzards’ at Dairy Queen campaign stop",
    "Dutch PM Mark Rutte to leave politics after government collapses",
    "Analysis:\nDarling of US conservatives in Iran may face an uncertain future",
    "Japan to release treated radioactive water sparking seafood concerns",
    "Shock Wimbledon win for 16-year-old",
    "BBC suspends presenter following sexual misconduct allegations",
    "Belarusian Azarenka: ‘Wasn’t fair’ to be booed at Wimbledon after facing Ukrainian player",
    "Rheinmetall will build and repair tanks in Ukraine, says CEO",
    "Luis Suárez Miramontes, one of Spain’s greatest footballers, has died aged 88",
    "Video shows massive protests in Tel Aviv ahead of key vote",
    "Thames Water secures $962 million from investors but says it will need more",
    "Harry Styles hit in eye with object while performing on stage at Vienna concert",
    "China’s factory gate prices fall at fastest pace in 7 years",
    "OsakaWayne Studios/Moment RF/Getty Images",
    "Nicolas Micolani/iStockphoto/Getty Images",
    "The US drinking age is on the high end. Here are the legal drinking ages elsewhere",
    "When it comes to misbehaving tourists in Bali, this woman has seen and heard it all",
    "Photo Illustration: Jason Lancaster/CNN/Adobe Stock/Getty Images",
    "Gonzalo Fuentes/Reuters\n\n\n\n\n\n•Analysis",
    "Elon Musk is the gift that keeps on giving to Mark Zuckerberg",
    "‘This is what is holding these vehicles back’: 3 reasons we won’t see flying cars soon",
    "Michael M. Santiago/Getty Images\n\n\n\n\n\n•Opinion",
    "This is the real reason Ron DeSantis is struggling in the polls",
    "Netherlands to return nearly 500 looted objects to Indonesia and Sri Lanka",
    "This river is so polluted that it now has layer of toxic foam",
    "Tomasz Klejdysz/iStockphoto/Getty Images/File",
    "Spider mite males ‘undress’ their partners to mate ASAP",
    "Construction workers unearth ‘intact’ marble head",
    "‘I cannot explain what is happening in my head.’ Underarm serve backfires",
    "Ionut Groza/500px/Getty Images",
    "Savor the Mediterranean way of cooking",
    "Elton John says goodbye to over 50 years of touring",
    "OLI SCARFF/AFP/AFP via Getty Images\n\n\n\n\n\n•Video",
    "Hear what music legend told fans at his final concert",
    "Qilai Shen/Bloomberg/Getty Images",
    "China fines Jack Ma’s Ant Group nearly $1 billion",
    "The US economy can’t function smoothly without UPS. That’s why a strike will hurt",
    "Some investors are shunning Wall Street’s tech frenzy",
    "China’s export curbs on raw materials are concerning, Yellen says on Beijing trip",
    "Courtesy Chutatip \"Nok\" Suntaranon and Ziv Katalan",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "Sebastien Bozon/AFP/Getty Images",
    "Jamaica’s Shericka Jackson becomes joint-fifth fastest woman of all time",
    "Megan Rapinoe announces she will retire at the end of the season",
    "An emotional Michelle Wie West enjoys magical ending to her career",
    "Netherlands soccer great in intensive care following bleed around brain",
    "Killer jaguar and distressed elephant among award-winning environmental photos",
    "Architect Sir David Adjaye steps back from multiple projects amid sexual misconduct allegations",
    "Blue body paint and beaded jeans: The top moments from Paris Haute Couture Week",
    "Gabriela Hearst to step down as creative director of Chloé",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Mikhail Tereshchenko/Sputnik/AFP/Getty Images/FILE",
    "Putin faces a challenging task that threatens his power",
    "Whatever happened to Mutually Assured Destruction?",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Trump’s enthusiasm for bringing back Michael Flynn is a revealing sign",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Spencer Platt/Getty Images\n\n\n\n\n\n•Analysis",
    "Why Trump’s Republican rivals should focus on New Hampshire, not Iowa",
    "Analysis:\nHow Michael Flynn went down the conspiracy theory rabbit hole",
    "Grace Napolitano, longtime California congresswoman, announces her retirement",
    "Rep. Alexandria Ocasio-Cortez supports Biden’s reelection bid",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Samsung flags massive drop in quarterly profit as chip glut drags on",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Meta officially launches Twitter rival Threads. 30 million have joined already",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Levon Biss/American Museum of Natural History",
    "Extraordinary close-up images show insects as you’ve never seen them before",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Jean-Christophe Verhaegen/AFP/Getty Images",
    "These animals went extinct in the wild. Scientists brought them back",
    "The icy patience of an Arctic photographer",
    "Ben Stansall/AFP/Getty Images",
    "Britain’s water industry crisis: Sewage spills, huge leaks and crushing debts",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Rescuers free dozens trapped on one of world’s highest cable car systems",
    "Helsinki’s deputy mayor caught spray-painting graffiti in a train tunnel",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’"
]