[
    "In pictures: Canadian wildfires impact US air quality",
    "Live Video: See the air quality in NYC",
    "FAA issues ground stop at major New York City airport due to smoke",
    "Intense smoke fills NYC and forces a ‘code red’ in Philadelphia",
    "See timelapse of NYC disappearing into cloud of wildfire smoke",
    "Jodie Comer halts matinee of Broadway’s ‘Prima Facie’ due to difficulty breathing",
    "PLANET LABS PBC/Reuters\n\n\n\n\n\n•Live Updates",
    "Ukrainian troops saw Russian soldiers swept away by floodwaters",
    "Zelensky: This is ‘an environmental bomb of mass destruction’",
    "Video captured moment a house floated away after dam collapse",
    "Joly Victor/ABACA/Shutterstock\n\n\n\n\n\n•Breaking News",
    "Lionel Messi says he’s going to MLS club Inter Miami",
    "Lionel Messi’s life in pictures",
    "In a country that expects women to be ‘wafer thin’, demand for Ozempic soars",
    "CNN Chairman and CEO Chris Licht is out",
    "Paleoanthropologist explains amazing discovery about ancient human species",
    "Analysis: Prince Harry’s cross-examination is over. How did he fare?",
    "Brutal killings of girls show one of India’s biggest problems getting worse, advocates say",
    "Analysis: What Turkey’s new cabinet says about where country is headed",
    "Dramatic video shows bridge collapse",
    "Multiple insomnia symptoms raise stroke risk in people under 50, study says",
    "Tennis star blames sleeping pills and naps for French Open defeat",
    "Authorities raise alert level as Kilauea volcano erupts",
    "See the moment Kilauea volcano erupts in Hawaii",
    "Egypt bans Dutch archaeology team due to museum’s ‘Afrocentric’ exhibition",
    "Rivalry between Meta and Apple is moving to a new playing field",
    "London Food and Drink Photography/Decanter World Wine Awards 2023/Nic Crilly-Hargrave",
    "This country has the best wines in the world for 2023",
    "Illustration/NASA/Johns Hopkins APL/Steve Gribben",
    "Solar probe flies near enough to the sun’s surface to make a key discovery",
    "Cruise ship with gigantic solar sails is set to launch",
    "Instagram@drewbarrymore\n\n\n\n\n\n•Video",
    "Andrew Caballero-Reynolds/AFP/Getty Images/File\n\n\n\n\n\n•Opinion",
    "Eric Espada/Getty Images\n\n\n\n\n\n•Analysis",
    "Gregg DeGuire/FilmMagic/Getty Images",
    "Shannen Doherty reveals cancer has spread to her brain",
    "Stanislav Kogiku/SOPA/LightRocket/Getty Images",
    "ChatGPT’s responses to suicide, addiction, sexual assault crises raise questions in new study",
    "Prehistoric cave paintings discovered in Spain using drones",
    "Muhammed Enes Yildirim/Anadolu Agency/Getty Images",
    "Russia’s war in Ukraine undermining global efforts to tackle climate crisis: report",
    "Economy class airplane bunk beds get seal of approval as launch moves closer",
    "Kyle Hunter/Tourism and Events Queensland",
    "Australia’s popular Fraser Island reverts to its traditional name",
    "Pope Francis undergoes abdominal surgery in latest health concern",
    "Rare North American dinosaur named for two-faced Roman god",
    "One of France’s most impressive monuments turns 1,000",
    "Doucefleur/iStockphoto/Getty Images",
    "Fight hot flashes with these expert-approved methods",
    "Samuel Fosso/Courtesy JM Patras, Paris",
    "‘Man with a thousand faces’ wins prestigious photography prize",
    "Michael M. Santiago/Getty Images",
    "They said we were getting a recession. Instead, we’re getting a bull market",
    "Coca-Cola’s newest flavor is aimed at gamers",
    "Martha Stewart says America will ‘go down the drain’ if people don’t return to office",
    "Jamie Dimon told House Democrats that Congress should ‘get rid of’ the debt ceiling, source says",
    "How much should you have saved for retirement at your age? It’s complicated",
    "The double-decker airplane seat is back. Here’s what it looks like now",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "She got a job on a superyacht. Here’s what happened next",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Why an empty plot of sand has sold for a record $34M",
    "Novak Djokovic breaks Rafael Nadal record as he progresses to  French Open quarterfinals",
    "Lewis Hamilton lauds ‘amazing result’ for Mercedes",
    "One game from greatness. Manchester City beats Manchester United in FA Cup",
    "Barcelona secures dramatic Women’s Champions League victory",
    "Coco Gauff defeats tennis’ rising star in the battle of the teenagers",
    "Police make 31 arrests as animal rights protesters plan to disrupt horse race",
    "Terry O'Neill/iconicimagesgallery.com",
    "Why this morning-after portrait of Faye Dunaway became an iconic Hollywood moment",
    "Hong Kong’s famous rubber duck returns — and now there are two",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "See how they turned Margot Robbie into a Barbie doll",
    "Trove of 750 looted artifacts returned to Italy from disgraced British dealer",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Breaking with Trump and DeSantis, Haley made case for Ukraine in CNN town hall",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Mark Thiessen/National Geographic",
    "Ancient species buried dead and carved symbols long before humans",
    "Webb telescope detects organic molecules in distant galaxy",
    "Nonsurgical cat contraception could help curb overpopulation, study says",
    "Study: How long you breastfeed may impact your child’s test scores later",
    "A beloved man died by suicide. Here’s what his widow wants others to know",
    "Justin Sullivan/Getty Images\n\n\n\n\n\n•Video",
    "Apple unveils $3,500 mixed-reality headset",
    "Tucker Carlson launches first episode of low-budget Twitter show after Fox News firing",
    "SEC files motion for restraining order to freeze Binance US assets",
    "Former NBCU exec Linda Yaccarino prepares to take over Twitter CEO role from Elon Musk",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Courtesy Adrien Giret\n\n\n\n\n\n•Gallery",
    "Architects are planning for a flooded future",
    "An abandoned airport is becoming Europe’s biggest coastal park",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]