[
    "Dam destruction sparks fears for large-scale devastation",
    "Destruction of the dam is ‘catastrophic’, senior Ukrainian official says",
    "Reporter explains significance of the breached dam for the war",
    "CNN Exclusive: Ukraine cultivated agents in Russia to stage attacks, sources say",
    "Daniel Leal/AFP/Getty Images\n\n\n\n\n\n•Live Updates",
    "Prince Harry arrives in court to testify in phone hacking trial",
    "Here’s what you need to know about Prince Harry’s phone hacking trial",
    "Pilot of unresponsive private jet that crashed and killed 4 was seen slumped over, source says",
    "Hear sonic boom from US fighters scrambling to unresponsive aircraft",
    "A bridge under construction in India has collapsed - for the second time",
    "CNN Exclusive: Mar-a-Lago pool flood raises suspicions among prosecutors",
    "‘The Little Mermaid’ tanks in China and South Korea amid racist backlash",
    "Despair and anguish stalk hospitals as India reels from devastating train crash",
    "Chinese Defense Minister blasts the US after near collision in Taiwan strait",
    "5 takeaways from Apple’s biggest product event in years",
    "Nearly 80 students, mostly girls, poisoned in Afghanistan",
    "sportinfoto/DeFodi Images/Getty Images",
    "Top soccer players could form union to tackle racist abuse, Romelu Lukaku says",
    "Sprinter Jim Hines, once the world’s fastest man, dies at 76",
    "Mysterious species buried their dead  100,000 years before humans",
    "At least 42 dead and thousands displaced in Haiti after flooding",
    "It’s the 14th day of French pension reform strikes. Why do French protest so much?",
    "Starbucks is bringing its controversial olive oil coffee to more cities",
    "Child dangling from government truck sparks outrage in Dominican Republic",
    "Courtesy AllRightsReserved",
    "Giant inflatable ‘rubber duck’ returns to Hong Kong — this time with a friend",
    "Space-starved Singapore will end 180-years of horse racing to make way for housing",
    "Anton Petrus/Moment RF/Getty Images",
    "The stunning Mediterranean coastline with hardly any tourists",
    "Charlie Neibergall/AP\n\n\n\n\n\n•Analysis",
    "A couple set off on a motorbike world tour with their beloved dog. Then tragedy struck",
    "ViktorCap/iStockphoto/Getty Images",
    "Vaping helps fuel huge rise in bad behavior on planes",
    "Dimitrios Kambouris/Getty Images\n\n\n\n\n\n•Analysis",
    "CNN chief apologizes to staff after embarrassing profile, vows to win back trust",
    "Courtesy of Warner Bros. Pictures",
    "‘World ran out of pink’: ‘Barbie’ set led to global shortage of pink paint, designer says",
    "Deb Lindsey/The Washington Post/Getty Images",
    "The 2023 James Beard Award winners are…",
    "Photographer documents the unseen life of ‘Humaliens’",
    "‘Like entering a forest’: Inside Asia’s largest timber building",
    "Sthanlee B. Mirador/SIPPL Sipa USA/AP",
    "Arnold Schwarzenegger explains how he told his wife about his secret son",
    "Christian Petersen/Getty Images\n\n\n\n\n\n•Opinion",
    "Rose Zhang is a reminder to sports fans — anything can happen",
    "Andrew Caballero-Reynolds/AFP/Getty Images\n\n\n\n\n\n•Video",
    "NFL star draws laughter at the White House for podium prank",
    "‘School of grandmothers’ made this chef a superstar",
    "Case for 2023 US recession is crumbling",
    "Markets may be overly optimistic about the Fed",
    "Oil prices jump after Saudi Arabia vows to cut production again",
    "How much should you have saved for retirement at your age? It’s complicated",
    "Bank of America CEO says the Fed’s biggest challenge is power of US consumer",
    "She got a job on a superyacht. Here’s what happened next",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "Novak Djokovic breaks Rafael Nadal record as he progresses to  French Open quarterfinals",
    "Lewis Hamilton lauds ‘amazing result’ for Mercedes",
    "One game from greatness. Manchester City beats Manchester United in FA Cup",
    "Barcelona secures dramatic Women’s Champions League victory",
    "Coco Gauff defeats tennis’ rising star in the battle of the teenagers",
    "Police make 31 arrests as animal rights protesters plan to disrupt horse race",
    "Steve Jennings/WireImage/Getty Images",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "See how they turned Margot Robbie into a Barbie doll",
    "Trove of 750 looted artifacts returned to Italy from disgraced British dealer",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "The world’s largest architecture exhibition mounts a radical new show",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Breaking with Trump and DeSantis, Haley made case for Ukraine in CNN town hall",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Seth Shostak/SETI Institute",
    "Alien-like message sent to Earth in a test to prepare for the real thing",
    "Webb telescope spies massive plume erupting from Saturn’s moon Enceladus",
    "Boeing mission to send NASA astronauts to space station faces more lengthy delays",
    "Study: Sleep apnea linked to smaller brain volume",
    "The diet that can lower ‘bad’ cholesterol",
    "Rafael Henrique/SOPA/LightRocket/Getty Images",
    "Apple is about to hold its most highly anticipated product event in years",
    "China’s answer to Boeing and Airbus isn’t as ‘homegrown’ as it seems. Here’s why",
    "3D-printing concrete in Dubai",
    "How to protect yourself from getting hacked, according to a Yale professor",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Courtesy Adrien Giret\n\n\n\n\n\n•Gallery",
    "Architects are planning for a flooded future",
    "An abandoned airport is becoming Europe’s biggest coastal park",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]