[
    "@taniakovba/Twitter/Reuters\n\n\n\n\n\n•Live Updates",
    "Analysis: NATO races to save itself from a major embarrassment",
    "Meet the oligarch who’s stealing the limelight from Putin in Ukraine",
    "Anger in Kyiv as 3 killed trying to get into closed bomb shelter",
    "See the scene of the latest Russian strike in Kyiv",
    "Anna Moneymaker/Getty Images",
    "US Senate passes debt limit deal to avert default",
    "Watch Schumer speak about deal",
    "Ukraine war hasn’t changed China’s thinking around possible attack on Taiwan, report says",
    "Banker’s disappearance sends chill through China’s tech industry",
    "See before-and-after photos of forced mosque alteration in China",
    "Part of Taiwan but close to China, this island is torn between two worlds",
    "Gelje Sherpa/Handout/Reuters",
    "Sherpa who saved climber in Everest death zone says it was hardest rescue ‘in my life’",
    "With no more Covid restrictions, Asia’s drug cartels are thriving, UN report warns",
    "How could 4 children survive plane crash in Amazon? New report offers clues",
    "US court to hear challenge over Prince Harry’s visa following drug revelations",
    "Video shows moment Biden trips",
    "Analysis: Trump on tape: Here’s what it means and what’s next",
    "Jordan royals marry into Saudi family with ties to MBS",
    "‘The Office’ gets an Australian reboot with a female boss",
    "White House says Biden is fine after tripping on stage at commencement",
    "Djokovic stands by Kosovo remarks",
    "Trump and DeSantis escalate feud in dueling campaign events",
    "‘I don’t want reality’: Senator’s gaffe draws laughs during hearing",
    "Claims about red light and sleep abound. Here’s what experts say",
    "Former Playboy model accuses Bill Cosby of rape",
    "She got a job on a superyacht. Here’s what happened next",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "Steve Jennings/WireImage/Getty Images",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "Eric Thayer/Bloomberg/Getty Images",
    "Wang Gang/VCG/Getty Images",
    "Volkswagen of America, Inc.",
    "Volkswagen reboots its groovy 60s-era VW Bus. This time it’s faster, roomier and electric",
    "Trash monsters are highlighting the nightmare of waste",
    "Tim Clayton/Corbis/Getty Images",
    "Russian teen continues meteoric rise by advancing to French Open third round",
    "Key demographic pulling back at big chains could be red flag for US economy",
    "Seth Shostak/SETI Institute",
    "This message from outer space is an unprecedented test",
    "Europe is investing 20 million euros in these ‘forgotten villages.’ See what they’re like",
    "Alberto Pizzoli/AFP/Getty Images",
    "The Italian beaches putting a daily cap on visitors this summer",
    "Vianney Le Caer/Invision/AP",
    "Harrison Ford does not need anybody’s help getting off a horse",
    "Courtesy Warner Bros. Pictures",
    "Ryan Gosling has hilarious response to those who say he’s ‘too old’ to play Ken",
    "Jay Leno shows Chris Wallace his new ear after accident",
    "Why this year’s NBA Finals will be historic, no matter the result",
    "Justin Sullivan/Getty Images",
    "The Fed can’t figure out what’s happening with the job market",
    "China’s small and medium-sized factories post surprise growth, easing market anxiety",
    "The global economy has likely been spared a US debt default. It still faces a mountain of risks",
    "Right-wing media figures are waging an anti-LGBTQ war on businesses over Pride Month",
    "Macy’s and Costco sound a warning about the economy",
    "Dare to bare: 20 of the world’s best nude beaches",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "Meet ‘the most overlooked superstar in the history of baseball’",
    "How identical twins became tennis’ greatest double act",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Liverpool great in tears after final match at Anfield",
    "Vera Hartmann/13 Photo/Redux",
    "The husband-and-wife forgers who fooled the art market — and made millions",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "The world’s largest architecture exhibition mounts a radical new show",
    "Chinese actor steals spotlight at Cannes in a series of show-stopping looks",
    "Cate Blanchett’s bare feet make the ultimate style statement",
    "By recreating old photos, children of immigrants step into their parents’ shoes",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Top Democrats say Biden should make this year’s ‘craziness’ the last debt limit fight ever",
    "Alien-like message sent to Earth in a test to prepare for the real thing",
    "Webb telescope spies massive plume erupting from Saturn’s moon Enceladus",
    "Boeing mission to send NASA astronauts to space station faces more lengthy delays",
    "Study: Sleep apnea linked to smaller brain volume",
    "The diet that can lower ‘bad’ cholesterol",
    "Smith Collection/Gado/Getty Images",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "Meta threatens to pull news content in California if bill to pay publishers passes",
    "What’s next in 3D-printing?",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "World’s highest building could be surrounded by a giant ring",
    "Mandie Kotze\n\n\n\n\n\n•Gallery",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "@visualsbypreet\n\n\n\n\n\n•Gallery",
    "Photographer captures the unseen side of Dubai",
    "ICON/Bjarke Ingels Group\n\n\n\n\n\n•Gallery",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]