[
    "Unknown Rembrandt portraits",
    "Home bulldozed after viral video",
    "Anadolu Agency/Getty Images\n\n\n\n\n\n•Analysis",
    "Live Updates:\nDeath toll rises to 10 in Lviv missile strike",
    "Analysis:\nPrigozhin’s fate remains unclear and it signals more trouble in Russia",
    "Retired general explains what raid on Prigozhin’s home means",
    "Andre Luis Alves/Anadolu Agency/Getty Images\n\n\n\n\n\n•Analysis",
    "Why are the cluster munitions the US is expected to supply Ukraine so controversial?",
    "Tanbir Miraj/AFP/Getty Images",
    "Efforts to bring justice to Rohingya must be accelerated, ICC chief prosecutor says",
    "‘Heartbreaking’ scene in Rohingya camps",
    "IAEA chief ‘convinced’ it’s safe to release treated Fukushima nuclear wastewater",
    "India bulldozes home of man who allegedly urinated on tribal member",
    "Rescuers work to free dozens trapped on one of world’s highest cable car systems",
    "Beijing may be facing one of its hottest summers on record",
    "See rare European summer storm hit the Netherlands",
    "From Texas Center for the Missing",
    "Man reported missing as a teen 8 years ago has been at home with his mom all along: police",
    "Airline passenger finds plane floor soaked in blood",
    "Five arrested by Hong Kong police after bounty placed on 8 dissidents",
    "NYC mayor in spotlight over report questioning his photo of fallen officer",
    "Indonesia pulls out of hosting World Beach Games after Israel controversy",
    "Michael Cohen has warning for Donald Trump aide Walt Nauta",
    "Drena De Niro says fentanyl killed her son",
    "Killer jaguar and grieving elephant among award-winning photos",
    "Arnold Jerocki/Getty Images",
    "Shakira’s ‘No’ jacket relays the message loud and clear",
    "Tomasz Klejdysz/Alamy Stock Photo",
    "Bedbugs are a nasty nuisance. Here’s how to avoid bringing them home from your travels",
    "L.E. Baskow/Las Vegas Review-Journal/AP",
    "Research Group ATLAS from University of Sevilla",
    "‘Ivory Lady’ discovery may force many to reconsider views about prehistory",
    "Visual China Group/Getty Images",
    "‘Powerful, bright, bold’ singer and actress CoCo Lee dies at 48",
    "Tourist who allegedly carved names into the Colosseum speaks",
    "How one of the world’s most common metals could be key to clean energy",
    "Watch: The moment this fashion designer turned the tables on his celebrity guests",
    "AsiaVision/E+/Getty Images",
    "Short sleep negates benefits of exercise for the brain, study says",
    "Unknown Rembrandt portraits found in private collection fetch $14.2 million",
    "Yagi Studio/Digital Vision/Getty Images",
    "What do chefs say about prewashing rice?",
    "Mattel; Chung Sung-Jun/Getty Images",
    "Margot Robbie isn’t breaking character with her Barbie press looks",
    "TikTok/Nikki Kundanmal\n\n\n\n\n\n•Video",
    "Brave dog protects owner from winged intruder. See the chaotic moment",
    "Naomi Baker/The FA/Getty Images",
    "From PE teacher to coaching one of the World Cup favorites",
    "Win McNamee/Getty Images/FILE",
    "Does the Fed have the labor market all wrong?",
    "Former CIA chief: US needs to ‘tighten the screws’ on Russia’s economy",
    "June jobs report preview: Growth but gradual cooling expected",
    "Savers should be cheering higher interest rates. So why are they unhappy?",
    "Here’s what Americans say they need to earn to feel rich, or even just financially secure",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "She stuffed a bra with clothes before boarding a plane. Here’s why",
    "Clive Brunskill/Getty Images Europe/Getty Images",
    "What Roger Federer did next",
    "The ‘world’s fastest accountant’ is taking track and field by storm",
    "Mystery of North Korean player who stunned the soccer world – then disappeared",
    "Summer transfer window: The biggest moves so far as Saudi Arabia becomes major factor",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Barely visible ‘Louis Vuitton’ handbag sells for over $63,000",
    "Robot takes podium as orchestra conductor in South Korea",
    "Life in limbo: Photographer documents ‘Kafka-esque’ migrant experience",
    "Alex Chan Tsz Yuk/SOPA/Shutterstock",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Lab-grown meat is an expensive distraction from reality",
    "When ‘free speech’ becomes a bully’s free pass",
    "I was the most senior Islamic leader to visit Auschwitz. Here’s what I know about peace",
    "John Bazemore/AP\n\n\n\n\n\n•Analysis",
    "Two very different points of view on nuclear energy in the US",
    "House Freedom Caucus voted to remove Greene before July Fourth break, congressman says",
    "Analysis:\n‘Race neutral’ replaces affirmative action. What’s next?",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Susan Walsh/AP\n\n\n\n\n\n•Analysis",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Federal judge blocks Biden administration officials from communicating with social media companies",
    "China just played a trump card in the chip war. Are more export curbs coming?",
    "AI is already linked to layoffs in the industry that created it",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Oliver Rossi/Stone RF/Getty Images",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Art-loving Helsinki deputy mayor caught graffitiing the city",
    "At least 48 dead in road accident in western Kenya, officials say",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Migrant who died in ICE custody was held for months, despite recommendation for release, SPLC says",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean"
]