[
    "Kirill Kudryavtsev/AFP/Getty Images\n\n\n\n\n\n•Analysis",
    "Ukraine denies involvement in Moscow drone attack",
    "Member of Russia’s parliament calls attack ‘new reality we will have to recognize’",
    "See what Moscow buildings looked like after drone attack",
    "Readying the counteroffensive, Ukrainians ‘know how to deal with the enemy’",
    "North Korea says launch of military reconnaissance satellite has failed, plans to try again",
    "Video shows Chinese jet unsafely intercepting US spy plane",
    "US says Chinese jet conducted ‘unnecessarily aggressive maneuver’ intercepting US spy plane",
    "Brutal murder of teen girl in busy public alleyway sparks outrage",
    "US debt limit deal clears key hurdle after GOP infighting and threat to McCarthy",
    "Thousands of ethnic minority Muslims defy China authorities in mosque defense",
    "A snorkeler was bitten on the head by a crocodile. This is what he did next",
    "China’s factory production hits lowest level since the end of zero-Covid policy",
    "Ex-Putin ally breaks down what strategy reveals about Putin’s mindset",
    "World’s best airline for 2023 named by AirlineRatings.com",
    "Kent Smith/NBAE/Getty Images",
    "Michael Jordan was ‘horrible player’ and ‘horrible to play with’: former teammate",
    "What Elizabeth Holmes’ life in prison could look like",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "Why did ethnic Serbs attack NATO peacekeepers in Kosovo? What we know",
    "Former US first lady Rosalynn Carter has dementia, Carter Center says",
    "Natalee Holloway murder suspect ‘severely’ beaten in prison: ABC News",
    "TikTok dad challenging masculinity stereotypes goes viral",
    "Air New Zealand to weigh passengers before they board the airplane",
    "This could be the world’s largest ocean restoration project",
    "Venice authorities discover why canal turned fluorescent green",
    "Stephen Maturen/Getty Images/File",
    "Justin Tang/The Canadian Press/AP/FILE",
    "Vincenzo Pinto/AFP/Getty Images",
    "Racism, activism and climate crisis are on the agenda at the Venice Architecture Biennale",
    "One Vietnam War POW spent 10 months in a ‘tiger cage.’ His commander rotted in a ‘hell hole’",
    "Jorgen Ree Wiig/Norwegian Directorate of Fisheries/Sea Surveillance Service",
    "Alleged Russian ‘spy’ whale now in Swedish waters",
    "Colombia's Armed Forces Press Office/AP",
    "Four children are missing in Amazon. Critics blame Colombia’s government",
    "In photos: The best crowd looks at Beyoncé’s ‘Renaissance’ tour",
    "Solar trees with a seven-meter canopy could soon be charging your car",
    "Taipei’s hottest new menu item is a 14-legged crustacean",
    "‘Kendall Roy’ reveals alternate take in final scene of ‘Succession’",
    "Arnold Schwarzenegger has a lot of love for Bruce Willis",
    "Lionel Messi looks set to leave PSG. Many clubs are fighting for his signature",
    "Julian Finney/Getty Images",
    "World No. 172 stuns Russian star Daniil Medvedev in French Open upset",
    "31 billionaires are worth more than the US Treasury has in cash",
    "How crypto is dealing with the debt ceiling turmoil",
    "Corporate America celebrates debt ceiling deal and urges Congress to quickly pass legislation",
    "Experts warn AI could pose ‘extinction’ risk for humanity",
    "State Farm stops home insurance sales in California, citing wildfire risks",
    "Dare to bare: 20 of the world’s best nude beaches",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "Daniel Pockett/Getty Images",
    "How identical twins became tennis’ greatest double act",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Liverpool great in tears after final match at Anfield",
    "Vittorio Zunino Celotto/Getty Images",
    "Chinese actor steals spotlight at Cannes in a series of show-stopping looks",
    "Cate Blanchett’s bare feet make the ultimate style statement",
    "By recreating old photos, children of immigrants step into their parents’ shoes",
    "Air purification ‘tower’ trialed in one of world’s most polluted cities",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Lunar lander likely fell 3 miles before crashing into moon in historic attempt",
    "Ancient toilets unearthed in Jerusalem reveal a debilitating disease",
    "New unprecedented images reveal what’s happening on the sun",
    "What to know about body dysmorphia, the condition affecting Megan Fox",
    "Advice from a ‘divorce whisperer’ on reclaiming yourself",
    "The diet that can lower ‘bad’ cholesterol",
    "China urges Japan to end curbs on chip exports",
    "The world’s biggest ad agency is going all in on AI with Nvidia’s help",
    "Elon Musk says Twitter has ‘no actual choice’ about government censorship requests",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "Microsoft executive calls for faster AI regulation",
    "Billionaire entrepreneur’s space tourism company pulls off high-stakes crewed test flight",
    "World’s highest building could be surrounded by a giant ring",
    "Mandie Kotze\n\n\n\n\n\n•Gallery",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "@visualsbypreet\n\n\n\n\n\n•Gallery",
    "Photographer captures the unseen side of Dubai",
    "ICON/Bjarke Ingels Group\n\n\n\n\n\n•Gallery",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]