[
    "Tom Brenner for CNN\n\n\n\n\n\n•CNN Exclusive",
    "Ukraine appears to claim responsibility for Crimea bridge blast",
    "‘We took an oath’: Azovstal leaders vow to return to the battlefield",
    "OsakaWayne Studios/Moment RF/Getty Images",
    "China fines Jack Ma’s Ant Group nearly $1 billion",
    "Gonzalo Fuentes/Reuters\n\n\n\n\n\n•Analysis",
    "Elon Musk is the gift that keeps on giving to Mark Zuckerberg",
    "Mark Zuckerberg concealed his kids’ faces on Instagram. Should you?",
    "Tired of Elon Musk? Here are the Twitter alternatives you should know about",
    "Tim Clayton/Corbis Sport/Getty Images",
    "Shock Wimbledon win for 16-year-old qualifier",
    "BBC suspends presenter following sexual misconduct allegations",
    "Here we go again: Harry Styles hit in eye with object while performing on stage at Vienna concert",
    "US says drones harassed by Russian aircraft killed ISIS leader in Syria",
    "How extreme heat affects the body",
    "The huge blob of seaweed headed for Florida has shrunk by 75%",
    "At least 22 killed in airstrike in Sudan",
    "5 members of Jehovah’s Witnesses congregations charged with child sexual abuse in Pennsylvania",
    "Geoffroy Van der Hasselt/AFP/Getty Images",
    "France bans fireworks sales amid fears of violence over Bastille Day weekend",
    "At least 22 officers injured in the German town of Giessen following unrest – police",
    "River is so polluted that it now has layer of toxic foam",
    "The world is big enough for US and China, Yellen says",
    "The high-rise homes for the dead in the world’s priciest property market",
    "Photo by GillianHunterPhotography.com",
    "She was once one of the world’s best freestyle skiers, then she nearly died in an accident",
    "Tomasz Klejdysz/iStockphoto/Getty Images/File",
    "Spider mite males ‘undress’ their partners to mate ASAP",
    "Nicolas Micolani/iStockphoto/Getty Images",
    "Newbie at the nude beach? Here’s what you need to know before you take your towel off",
    "Idrees Mohammed/EPA-EFE/Shutterstock",
    "Meta’s Threads upends social media in less than 48 hours",
    "Japanese star leads US Women’s Open as she bids to win first major title",
    "Ionut Groza/500px/Getty Images",
    "Savor the Mediterranean way of cooking",
    "Francisco Seco/AP\n\n\n\n\n\n•Gallery",
    "Research Group ATLAS from University of Sevilla",
    "Ancient regal tomb in Spain belonged to a revered female leader, archaeologists reveal",
    "Elton John says goodbye to over 50 years of touring with last show on his farewell tour",
    "‘I cannot explain what is happening in my head.’ Underarm serve backfires",
    "Paul Bersebach/MediaNews Group/Orange County Register/Getty Images",
    "With home improvement projects down, it’s Ikea’s moment",
    "Nail salon robbery goes awry as customers completely ignore demands",
    "Qilai Shen/Bloomberg/Getty Images",
    "The US economy can’t function smoothly without UPS. That’s why a strike will hurt",
    "Some investors are shunning Wall Street’s tech frenzy",
    "China’s export curbs on raw materials are concerning, Yellen says on Beijing trip",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "She stuffed a bra with clothes before boarding a plane. Here’s why",
    "Marco M. Mantovani/Getty Images",
    "Jamaica’s Shericka Jackson becomes joint-fifth fastest woman of all time",
    "Megan Rapinoe announces she will retire at the end of the season",
    "An emotional Michelle Wie West enjoys magical ending to her career",
    "Soccer players and fans left perplexed after ball crosses the line … but no goal is awarded",
    "‘I don’t know.’ Andy Murray says he’s unsure he’ll play at Wimbledon again",
    "Netherlands soccer great in intensive care following bleed around brain",
    "Rodin Eckenroth/FilmMagic/Getty Images",
    "Ryan Gosling says Margot Robbie mandated a pink day dress code on ‘Barbie’ movie set",
    "Gabriela Hearst to step down as creative director of Chloé",
    "Blue body paint and beaded jeans: The top moments from Paris Haute Couture Week",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Mikhail Tereshchenko/Sputnik/AFP/Getty Images/FILE",
    "Putin faces a challenging task that threatens his power",
    "Whatever happened to Mutually Assured Destruction?",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Trump’s enthusiasm for bringing back Michael Flynn is a revealing sign",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Anna Moneymaker/Getty Images",
    "Rep. Alexandria Ocasio-Cortez supports Biden’s reelection bid",
    "DOJ has spent over $9 million investigating Trump since special counsel was appointed",
    "Biden wants to roll back Trump’s expansion of short-term health insurance plans",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Samsung flags massive drop in quarterly profit as chip glut drags on",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Meta officially launches Twitter rival Threads. 30 million have joined already",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Levon Biss/American Museum of Natural History",
    "Extraordinary close-up images show insects as you’ve never seen them before",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Jean-Christophe Verhaegen/AFP/Getty Images",
    "These animals went extinct in the wild. Scientists brought them back",
    "The icy patience of an Arctic photographer",
    "Ben Stansall/AFP/Getty Images",
    "Britain’s water industry crisis: Sewage spills, huge leaks and crushing debts",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Rescuers free dozens trapped on one of world’s highest cable car systems",
    "Helsinki’s deputy mayor caught spray-painting graffiti in a train tunnel",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’"
]