[
    "Analysis: The battle for Bakhmut might not be over yet",
    "Russia accuses Ukraine of mounting ‘sabotage’ attack across border",
    "Video purportedly shows Russian groups fighting the Kremlin",
    "Analysis: Why Kyiv faces big hurdles in using US-made F-16 fighter jets",
    "Battle for Bakhmut: CNN embeds with Ukrainian unit under fire",
    "Samsul Said/Bloomberg/Getty Images",
    "Global temperature rise may see billions live where human life doesn’t flourish, study says",
    "Hundreds of newly discovered species under threat in Southeast Asia",
    "Some scientists are saying we are entering a ‘sixth mass extinction’",
    "Trump’s legal dramas overshadow his campaign as GOP field grows",
    "Prince Harry loses legal bid to pay for police protection while in UK",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems",
    "China boycotts G20 meeting held by India in Kashmir region",
    "See moment F-18 fighter jet crashes during training",
    "Millions in Mexico warned to prepare for evacuation as volcano spews ash",
    "Four arrested for allegedly hanging effigy of Vinícius Jr. off bridge: Spanish police",
    "See fake image of an ‘explosion’ near the Pentagon that caused confusion",
    "Police to carry out a new search for Madeleine McCann based on recent tip",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "‘RRR’ and ‘Thor’ actor dead at 58",
    "LeBron James considers future after Los Angeles Lakers swept by Denver Nuggets",
    "Three days of national mourning after 19 children killed in ‘horrific’ Guyana fire",
    "Erdogan backed by 3rd-place candidate",
    "Video shows officials wrangle 10-foot gator they believe bit man",
    "Mount Etna eruption grounds flights",
    "Why an empty sand plot in Dubai sold for a record $34 million",
    "These museums showcase the future, not the past",
    "John Coletti/The Image Bank RF/Getty Images",
    "This underrated capital city was the first to become a UNESCO site",
    "Bureau of Fire Protection (BFP)/Facebook",
    "Meeko Media/iStockphoto/Getty Images",
    "Summer sunscreens for 2023, ranked for safety and effectiveness",
    "Stefano Guidi/Getty Images",
    "Juventus docked 10 points in Serie A, then suffers 4-1 defeat against Empoli",
    "Frazao Studio Latino/Getty Images",
    "The good, bad and ugly about BMI",
    "HPV vaccine: Some studies say one and done might be better",
    "Cannes red carpet looks 2023: All the fashion from the 76th film festival",
    "Bikash Karki/AFP/Getty Images",
    "He summited Mount Everest for the 27th time last week. This week, he broke his own world record",
    "20 classic French dishes everyone needs to try",
    "Caitlin Bensel/The Mediterranean Dish Cookbook (Clarkson Potter, 2022)",
    "How to season food the Mediterranean way",
    "Macall Polay/HBO/Warner Bros. Discovery",
    "‘Sexy funeral lady’: The mourning attire of ‘Succession’",
    "Loic Venance/AFP/Getty Images",
    "DiCaprio and Scorsese’s new film gets standing ovation at Cannes",
    "See why this couple’s marriage dispute is causing a social media storm",
    "Vachira Vachira/NurPhoto/Getty Images",
    "Apple got rich in China. But these markets offer the next ‘golden opportunity’",
    "Warren Buffett’s Berkshire Hathaway sells entire stake in TSMC",
    "US Virgin Islands subpoenas Elon Musk as part of lawsuit into Jeffrey Epstein sex trafficking ring",
    "3M chief business officer fired for inappropriate conduct",
    "Biden administration to buy 3 million barrels of oil to begin replenishing emergency oil stockpile",
    "South Africa’s most epic hiking trails",
    "Inside Maldives’ only multi-island destination",
    "Tourist hot spot erects fence to deter selfie-takers",
    "Airline reveals price of new economy class sleep pods",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Vinícius Jr. is being racially abused during LaLiga matches. Why is nobody being punished?",
    "Liverpool great in tears after final match at Anfield",
    "Brittney Griner embraces Vice President Kamala Harris",
    "Manchester City wins Premier League title as Arsenal suffers shock loss",
    "Ukrainian tennis player refuses to shake Russian opponent’s hand after semifinal victory",
    "Kyle Lui/Courtesy the subject",
    "By recreating old photos, these children of immigrants step into their parents’ shoes",
    "Cannes 2023 is a showcase for African cinema",
    "Could these air purification towers tackle India’s pollution problem?",
    "Lego is heading back to the ’80s with a 2,651-piece model ‘Pac-Man’ arcade cabinet",
    "Kurt Cobain’s smashed-up guitar sells for almost $600,000—nearly 10 times the auction estimate",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Alan Dyer/VW Pics/Universal Images Group/Getty Images",
    "Here’s when you can see the moon in the Da Vinci glow",
    "Rushing rivers may have raced across ancient Mars",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Bezos-founded Blue Origin lands major NASA moon lander project",
    "Size of a Jurassic sea giant found due to fossil discovery, study says",
    "Justin Sullivan/Getty Images",
    "Amazon is changing its deliveries behind the scenes to cut shipping times",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "Apparent cyberattack forces Philadelphia Inquirer office to close ahead of mayoral primary",
    "EU approves Microsoft’s deal to buy Activision Blizzard",
    "The agony and ecstasy of scoring last-minute face value Taylor Swift tickets",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Teacher feared dead after shark attack off South Australia",
    "Biden picks cancer surgeon Monica Bertagnolli to be next NIH director",
    "Robert De Niro welcomes his 7th child at 79",
    "Ten lions killed in Kenya as conflict between humans and wild animals worsens",
    "County with high rate of overdose deaths doesn’t use opioid settlement funds for addiction program",
    "Buckingham Palace releases official coronation portraits",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Americans’ debt surpasses $17 trillion for the first time",
    "Tom Hanks responds to reviews of his debut novel",
    "World’s most beautiful castles"
]