[
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990 06.13.2023",
    "The best MacBooks for 2023: How to pick the best Apple laptop 06.13.2023",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing a day ago",
    "The Morning After: Is the 15-inch MacBook Air any good? 06.13.2023",
    "Anker's new Solix home energy storage includes a modular solar battery system",
    "McDonald's just released a Grimace Game Boy Color game",
    "My quest for the perfect productivity mouse",
    "‘Armored Core VI Fires of Rubicon’ first look: Fast battles with customizable mechs",
    "Zwift launches dedicated game controllers for its bike-based fitness platform",
    "UPS tentatively agrees to add air conditioning to its trucks",
    "By W. Shanklin, 12 minutes ago",
    "All the big tech layoffs of 2023",
    "By J. Fingas, 21 minutes ago",
    "By J. Conditt, 26 minutes ago",
    "‘Dead Cells’ is getting an animated series in 2024",
    "By L. Bonk, 41 minutes ago",
    "Sonos lays off 7 percent of its workforce",
    "Google Search can now help detect skin conditions and show how clothes look on AI models",
    "By S. Fielding, an hour ago",
    "The best VPN services for 2023",
    "Meta is expanding its bonus program that pays creators for Facebook posts",
    "Amazon's Freevee is adding free MGM and Warner Bros. Discovery channels",
    "Amazon's Echo Dot comes with a smart plug for less than the speaker on its own",
    "The best Apple Watch accessories for 2023",
    "By V. Palladino, 4 hours ago",
    "EU could breakup Google’s ad business over antitrust violations",
    "Vodafone and Three plan to merge into the UK's largest mobile network",
    "By S. Fielding, 5 hours ago",
    "Shark's self-emptying robot vacuum with a 30-day capacity base is 45 percent off",
    "The Morning After: OpenAI and Microsoft aren’t happy",
    "Google Home's new script editor can make smart device automations even more powerful",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]