[
    "Amazon's Fire HD 10 tablet is 50 percent off in early Prime Day sale 06.28.2023",
    "‘Final Fantasy XVI’ has already sold over 3 million copies 20 hours ago",
    "Amazon's latest Echo Buds fall to a new all-time low of $35 in early Prime Day deal 06.28.2023",
    "The best smartphones you can buy right now 06.27.2023",
    "Kia EV9 first drive: Adding a third row to the EV market",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Researchers reconstruct 3D environments from eye reflections",
    "By W. Shanklin, 16 hours ago",
    "Nintendo Switch Online gets four classic Genesis games, including Ghouls ’n Ghosts",
    "I consider myself a patient person, but 'The Password Game' might break me",
    "By I. Bonifacic, 19 hours ago",
    "The best PlayStation 5 games for 2023",
    "By Engadget, 39 minutes ago",
    "The Morning After: Google stops plans to build its own augmented reality glasses",
    "Women’s soccer teams are coming to Football Manager in 2024",
    "'World of Warcraft Classic Hardcore' brings permadeath to Blizzard's MMO",
    "By I. Bonifacic, 17 hours ago",
    "PlayStation Plus free July games include ‘CoD: Black Ops Cold War’ and ‘Alan Wake Remastered’",
    "By W. Shanklin, 18 hours ago",
    "The best music streaming services in 2023",
    "Film director Roland Emmerich is creating a shared universe of TV, gaming and Web3 tomfoolery",
    "North America’s first hydrogen-powered train debuts in Canada",
    "By W. Shanklin, 19 hours ago",
    "Venmo now supports tap to pay on Android phones",
    "By J. Fingas, 19 hours ago",
    "Vizio's redesigned TV interface helps you quickly find shows",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "Bloober Team is done making psychological horror games",
    "By J. Conditt, 20 hours ago",
    "‘Final Fantasy XVI’ has already sold over 3 million copies",
    "Microsoft is already offering a generative AI certification program",
    "By W. Shanklin, 20 hours ago",
    "Android TV's new Shop tab lets you buy movies from different providers",
    "By S. Fielding, 20 hours ago",
    "The best DACs for Apple Music Lossless in 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]