[
    "The best Nintendo Switch game deals for Prime Day 2023 14 hours ago",
    "Samsung adds an 83-inch set to its 'affordable' OLED TV lineup 19 hours ago",
    "Apple Watch Series 8 falls to $280 for Prime Day a day ago",
    "Blue Origin is investigating why a rocket engine exploded during testing 11 hours ago",
    "The best Amazon Prime Day deals for 2023",
    "Tesla reportedly suspected Musk was using company funds to build a literal glass house",
    "By J. Fingas, 13 hours ago",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "By J. Fingas, 17 hours ago",
    "Intel will stop making its own NUC mini PCs",
    "New ‘Star Wars: Ahsoka’ trailer teases a full-on ‘Star Wars: Rebels’ reunion",
    "Discord bans teen dating servers and the sharing of AI-generated CSAM",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023",
    "By A. Skorheim, 10 hours ago",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "The best Amazon Prime Day Apple deals on AirPods, MacBooks and more for 2023",
    "By A. Skorheim, 11 hours ago",
    "The best gaming deals for Amazon Prime Day 2023",
    "Blue Origin is investigating why a rocket engine exploded during testing",
    "By J. Fingas, 11 hours ago",
    "The best Amazon Prime Day TV deals for 2023",
    "The best Amazon Prime Day headphone deals for 2023",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, 13 hours ago",
    "Meta now lets you make video calls using a cartoon avatar",
    "The best Nintendo Switch game deals for Prime Day 2023",
    "By W. Shanklin, 14 hours ago",
    "You can now move your Netflix profile to an existing account",
    "Microsoft and UK regulators agree to pause legal fight to negotiate Activision acquisition",
    "By I. Bonifacic, 15 hours ago",
    "The best Amazon Prime Day laptop deals for 2023",
    "The best Prime Day deals you can get at Walmart and other retailers",
    "By A. Skorheim, 16 hours ago",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "By A. Tarantola, 16 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]