[
    "The next Nintendo Direct will take place on June 21st 3 hours ago",
    "The best midrange smartphones for 2023 3 hours ago",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’ 06.18.2023",
    "Apple Watch Series 8 is back on sale for $329 06.19.2023",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Panasonic S5 IIX review: Power and value in one vlogging package",
    "Philips Hue lights are getting brightness balancing and better motion sensor automations",
    "Sennheiser's first over-the-counter hearing aids come with a modern charging case",
    "By J. Fingas, 13 hours ago",
    "Anker's charging accessories are up to 44 percent off in Amazon sale",
    "EA's 'Immortals of Aveum' is delayed until August 22nd",
    "By K. Holt, 13 minutes ago",
    "The best immersion blenders you can buy in 2023",
    "By S. Rutherford, an hour ago",
    "How do you prevent an AI-generated game from losing the plot?",
    "By A. Tarantola, an hour ago",
    "News publishing giant Gannett sues Google for monopolizing ad tech",
    "By W. Shanklin, an hour ago",
    "Cruise launches an Android app for its self-driving taxis",
    "Chrome on iOS can now show maps and create calendar items without switching apps",
    "Lawmakers seek 'blue-ribbon commission' to study impacts of AI tools",
    "By A. Tarantola, 3 hours ago",
    "The next Nintendo Direct will take place on June 21st",
    "The best midrange smartphones for 2023",
    "Domino's can now deliver pizza almost anywhere using GPS pins",
    "Rivian owners will be able to use Tesla Superchargers starting in 2024",
    "Cadillac teases the electric Escalade IQ ahead of an August 9th reveal",
    "The best budget gaming laptops for 2023",
    "By D. Hardawar, 5 hours ago",
    "Spotify may finally be ready to debut a premium HiFi audio tier",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, 6 hours ago",
    "Trevor Noah is launching a weekly talk show podcast on Spotify",
    "By S. Fielding, 7 hours ago",
    "The Morning After: The verdict on Google’s Pixel Tablet",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]