[
    "The best tablets for 2023 06.07.2023",
    "Samsung's 1TB 980 Pro SSD falls to a new all-time low 06.07.2023",
    "The best wireless workout headphones for 2023 06.07.2023",
    "Apple's new 15-inch MacBook Air is already $49 off at Amazon 06.07.2023",
    "Summer Game Fest 2023 and the stagnant state of the industry",
    "By J. Conditt, 5 hours ago",
    "'Sonic Superstars' gives classic gameplay another modern makeover",
    "By W. Shanklin, an hour ago",
    "United is putting 4K displays and Bluetooth on its planes",
    "How to choose the best pizza oven in 2023",
    "The best photography gifts for dads",
    "Fortnite's next season features Transformers and rideable raptors",
    "‘Alto’s Adventure’ devs announce new game, and it's all about sheep herding",
    "By L. Bonk, 13 minutes ago",
    "Watch Devolver Digital’s Summer Game Fest stream here at 6PM ET",
    "By K. Holt, 13 minutes ago",
    "‘Like A Dragon Gaiden’ revives Kiryu on November 9th 2023",
    "By M. Smith, 23 minutes ago",
    "Mark Zuckerberg says generative AI is coming to ‘every single one of our products’",
    "By K. Bell, 26 minutes ago",
    "'John Carpenter's Toxic Commando' brings a co-op apocalypse to PS5, PC and Xbox",
    "By A. Tarantola, 36 minutes ago",
    "‘Spider-Man 2’ launches on October 20th",
    "By W. Shanklin, 40 minutes ago",
    "'Alan Wake II' gameplay shows newcomer Saga battling a resurrected murder victim",
    "The best soundbars for 2023",
    "'Sand Land' is a new adventure game based on a manga by Dragon Ball creator Akira Toriyama",
    "You can play a demo of the goth Pinocchio game 'Lies of P' right now",
    "By J. Conditt, an hour ago",
    "Watch Summer Game Fest's Day of the Devs livestream here at 5PM ET",
    "'Prince of Persia: The Lost Crown' is a Metroidvania-style platformer coming in 2024",
    "By S. Buckley, 2 hours ago",
    "Reddit CEO will host an AMA on API changes as thousands of subreddits plan to 'go dark'",
    "The best mirrorless cameras for 2023",
    "Third-party Reddit app Apollo will shut down on June 30th",
    "Students create robot death machine for invasive spotted lanternflies",
    "Nest WiFi Pro routers are down to record low prices in a Google smart home sale",
    "By A. Skorheim, 4 hours ago",
    "Watch Summer Game Fest 2023 here at 3PM ET",
    "By J. Conditt, 4 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]