[
    "Samsung adds an 83-inch set to its 'affordable' OLED TV lineup 3 hours ago",
    "Apple Watch Series 8 falls to $280 for Prime Day 6 hours ago",
    "The best iPads for 2023: How to pick the best Apple tablet for you a day ago",
    "The best Amazon Prime Day TV deals for 2023 23 minutes ago",
    "The best Amazon Prime Day deals for 2023",
    "Rolls-Royce won't let customers buy another car if they sell its new EV for a profit",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "NASA expands developers' contracts for its next-gen spacesuits",
    "‘Twisted Metal’ trailer basks in post-apocalyptic extravagance",
    "By W. Shanklin, 19 hours ago",
    "The best Prime Day deals you can get at Walmart and other retailers",
    "By A. Skorheim, 7 minutes ago",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "By A. Tarantola, 18 minutes ago",
    "The best Amazon Prime Day TV deals for 2023",
    "By J. Dunn, 23 minutes ago",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, 28 minutes ago",
    "Intel will stop making its own NUC mini PCs",
    "By J. Fingas, 33 minutes ago",
    "Microsoft's Activision acquisition moves ahead as judge rejects FTC injunction request",
    "The best Amazon Prime Day Apple deals on AirPods, MacBooks and more for 2023",
    "By A. Skorheim, an hour ago",
    "The best Amazon Prime Day air fryer deals for 2023",
    "By V. Palladino, an hour ago",
    "New Family Center tool gives parents better insight into their teen's Discord usage",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023",
    "The best Amazon Prime Day monitor deals for 2023",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "Meta's Quest 2 headset comes with a free $50 Amazon gift card for Prime Day 2023",
    "Logitech keyboards, mice and accessories are up to 50 percent off for Prime Day",
    "The best Google Prime Day deals on Pixel phones, Nest gadgets and more",
    "By S. Fielding, 2 hours ago",
    "The best gaming deals for Amazon Prime Day 2023",
    "Samsung adds an 83-inch set to its 'affordable' OLED TV lineup",
    "The best fitness tech for college students",
    "By A. Skorheim, 3 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]