[
    "The best Nintendo Switch controllers for every player level 05.30.2023",
    "‘Diablo IV’ review: A mechanically perfect romp through a shallow world a day ago",
    "AI presents 'risk of extinction' on par with nuclear war, industry leaders say 05.30.2023",
    "Sony's new WH-CH720N wireless headphones drop to $128 at Amazon a day ago",
    "Logitech MX Anywhere 3S hands-on: A nearly ideal travel mouse",
    "By S. Rutherford, 7 hours ago",
    "Garmin reveals high-end smartwatches for explorers with deep pockets",
    "Google has officially stopped supporting the first-gen Chromecast",
    "By S. Fielding, 4 hours ago",
    "Razer's new gaming earbuds include a low-latency dongle",
    "By J. Fingas, 20 hours ago",
    "The best projectors you can buy in 2023, plus how to choose one",
    "The best Father's Day tech gift ideas",
    "By D. Cooper, 18 minutes ago",
    "WD_Black SSDs are up to 56 percent off right now",
    "By S. Dent, 25 minutes ago",
    "The Morning After: Industry leaders say AI presents 'risk of extinction' on par with nuclear war",
    "Uber's One subscription swaps ride discounts for cashback rewards",
    "Microsoft releases a temporary fix for Surface Pro X camera bug",
    "Google's Pixel Watch 2 will reportedly have significantly improved battery life",
    "By J. Fingas, 17 hours ago",
    "Twitter is testing Community Notes for images",
    "Apple Music’s dedicated classical app arrives on Android",
    "By W. Shanklin, 20 hours ago",
    "By K. Malone, 21 hours ago",
    "Amazon ditches Alexa’s celebrity voices and will issue refunds upon request",
    "'Ratchet and Clank: Rift Apart' is coming to PC on July 26th",
    "‘Diablo IV’ review: A mechanically perfect romp through a shallow world",
    "By I. Bonifacic, a day ago",
    "The best mobile microphones for 2023",
    "Sony's new WH-CH720N wireless headphones drop to $128 at Amazon",
    "The best Nintendo Switch controllers for every player level",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]