[
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement 05.28.2023",
    "Portugal considers banning Huawei from national 5G networks 05.28.2023",
    "NVIDIA's next DGX supercomputer is all about generative AI 05.29.2023",
    "Meta’s Quest 3 headset could feature color cameras for more lifelike pass-through video 05.28.2023",
    "NASA's SLS rocket is $6 billion over budget and six years behind schedule",
    "ARM's latest CPUs push Android phone makers toward 64-bit only devices",
    "By J. Fingas, 13 hours ago",
    "WhatsApp test brings screen sharing to Android phones",
    "By S. Fielding, 16 hours ago",
    "NVIDIA's generative AI lets gamers converse with NPCs",
    "Japan will try to beam solar power from space by 2025",
    "By I. Bonifacic, 05.28.2023",
    "NVIDIA's G-Sync ULMB 2 aims to minimize motion blur in games",
    "Tesla will open its Supercharger network to other EVs in Canada",
    "By J. Fingas, 15 hours ago",
    "Microsoft's Xbox Elite Series 2 controller is $35 off right now",
    "By S. Fielding, 18 hours ago",
    "The Morning After: Japan will try to beam solar power from space by 2025",
    "NVIDIA's next DGX supercomputer is all about generative AI",
    "Portugal considers banning Huawei from national 5G networks",
    "A lawyer faces sanctions after he used ChatGPT to write a brief riddled with fake citations",
    "Meta’s Quest 3 headset could feature color cameras for more lifelike pass-through video",
    "Hitting the Books: Renee Descartes had his best revelations while baked in an oven",
    "By A. Tarantola, 05.28.2023",
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement",
    "Apple’s free My Photo Stream service will shut down on July 26th",
    "By I. Bonifacic, 05.27.2023",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Twitter pulls out of EU’s voluntary Code of Practice against disinformation",
    "iRobot's Roomba j7+ Combo vacuum is $300 off right now",
    "By A. Skorheim, 05.27.2023",
    "Japan's ispace says Hakuto-R crashed because it got confused by a crater rim",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]