[
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice 5 hours ago",
    "Apple’s free My Photo Stream service will shut down on July 26th 3 hours ago",
    "The best DACs for Apple Music Lossless in 2023 05.26.2023",
    "The Morning After: Ford and Tesla sign EV-charging pact 05.26.2023",
    "Tesla leak reveals thousands of Autopilot safety complaints",
    "After a rocky start, Formula E’s Gen3 car is living up to its potential",
    "YouTube will allow unlimited simultaneous streams for NFL Sunday Ticket",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "By A. Tarantola, 05.25.2023",
    "Samsung's Galaxy Tab S8+ falls to an all-time low in Amazon sale",
    "By S. Fielding, 05.26.2023",
    "With ‘Final Fantasy XVI’, the series tries a new direction",
    "'Project Q' is a dedicated PS5 streaming device due later this year",
    "Comcast launches $20 live TV streaming service with 60 channels",
    "Lego's new 2,650-piece Pac-Man arcade set includes a mechanical crank",
    "iOS 17 will reportedly turn your locked iPhone into a smart display",
    "Apple’s free My Photo Stream service will shut down on July 26th",
    "By I. Bonifacic, 3 hours ago",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "By I. Bonifacic, 5 hours ago",
    "Twitter pulls out of EU’s voluntary Code of Practice against disinformation",
    "By I. Bonifacic, 6 hours ago",
    "iRobot's Roomba j7+ Combo vacuum is $300 off right now",
    "By A. Skorheim, 11 hours ago",
    "Japan's ispace says Hakuto-R crashed because it got confused by a crater rim",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Google fined $32.5 million for infringing on Sonos patent",
    "By N. Ingraham, 05.26.2023",
    "Naughty Dog says its Last of Us multiplayer game needs more time in the oven",
    "Bluesky now lets you choose your own algorithm",
    "How to watch the Summer Games Done Quick 2023 speedrun marathon",
    "The best Memorial Day tech sales we could find",
    "Swiss researchers use a wireless BCI to help a spinal injury patient walk more naturally",
    "By A. Tarantola, 05.26.2023",
    "The best DACs for Apple Music Lossless in 2023",
    "Apple's AirPods Max are $99 off at Amazon",
    "By V. Palladino, 05.26.2023",
    "The best gaming mouse in 2023",
    "Engadget Podcast: Microsoft’s Panos Panay on bringing AI to Windows 11",
    "By D. Hardawar, 05.26.2023",
    "LG and Hyundai are building a $4.3 billion EV battery cell factory in the US",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]