[
    "The best iPads for 2023: How to pick the best Apple tablet for you 16 hours ago",
    "Google is testing its medical AI chatbot at the Mayo Clinic a day ago",
    "The best early Prime Day deals for 2023 6 hours ago",
    "The best laptops for gaming and schoolwork 21 hours ago",
    "The best Amazon Prime Day deals for 2023",
    "What we bought: The last gamepad I’ll need to buy for Switch and PC",
    "Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "By I. Bonifacic, 16 hours ago",
    "This EV is basically an RC car hit with a growth ray",
    "Hulu debuts hub for adult animation and anime",
    "The best Amazon Prime Day TV deals for 2023",
    "Samsung’s entire Galaxy S23 lineup is cheaper than ever for Prime Day",
    "By I. Bonifacic, 9 minutes ago",
    "The best Amazon Prime Day camera and drone deals for 2023",
    "By S. Dent, 15 minutes ago",
    "The best Amazon Fire tablet deals for Prime Day 2023",
    "By V. Palladino, 24 minutes ago",
    "Sony's WH-1000XM5 headphones drop to a record low of $328 for Prime Day",
    "By K. Holt, 30 minutes ago",
    "The Google Pixel 7 Pro is on sale for $649 during Prime Day",
    "By K. Holt, 38 minutes ago",
    "The best Amazon Prime Day Fire Stick deals for 2023",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, an hour ago",
    "The best deals on Echo Dots for Amazon Prime Day 2023",
    "By A. Skorheim, 2 hours ago",
    "The best Amazon Prime Day Kindle deals for 2023",
    "By A. Skorheim, 3 hours ago",
    "NASA expands developers' contracts for its next-gen spacesuits",
    "The best early Prime Day deals for 2023",
    "Tumblr's building a TikTok inspired feed in bid to grow its user base",
    "New privacy deal allows US tech giants to continue storing European user data on American servers",
    "By I. Bonifacic, 13 hours ago",
    "‘Twisted Metal’ trailer basks in post-apocalyptic extravagance",
    "By W. Shanklin, 13 hours ago",
    "People who don't use TikTok think it's a national security threat",
    "By J. Fingas, 14 hours ago",
    "Sega of America workers overwhelmingly vote to unionize",
    "Massachusetts weighs outright ban on selling user location data",
    "By W. Shanklin, 15 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]