[
    "The best Nintendo Switch game deals for Prime Day 2023 2 hours ago",
    "Samsung adds an 83-inch set to its 'affordable' OLED TV lineup 7 hours ago",
    "Apple Watch Series 8 falls to $280 for Prime Day 10 hours ago",
    "NASA expands developers' contracts for its next-gen spacesuits 15 hours ago",
    "The best Amazon Prime Day deals for 2023",
    "By Engadget, 10 minutes ago",
    "Tesla reportedly suspected Musk was using company funds to build a literal glass house",
    "By J. Fingas, 42 minutes ago",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "Intel will stop making its own NUC mini PCs",
    "New ‘Star Wars: Ahsoka’ trailer teases a full-on ‘Star Wars: Rebels’ reunion",
    "The best Amazon Prime Day TV deals for 2023",
    "The best Amazon Prime Day Apple deals on AirPods, MacBooks and more for 2023",
    "By A. Skorheim, 8 minutes ago",
    "The best Amazon Prime Day headphone deals for 2023",
    "By J. Dunn, 32 minutes ago",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023",
    "By A. Skorheim, an hour ago",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, an hour ago",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "Meta now lets you make video calls using a cartoon avatar",
    "The best gaming deals for Amazon Prime Day 2023",
    "The best Nintendo Switch game deals for Prime Day 2023",
    "By W. Shanklin, 2 hours ago",
    "You can now move your Netflix profile to an existing account",
    "Microsoft and UK regulators agree to pause legal fight to negotiate Activision acquisition",
    "By I. Bonifacic, 3 hours ago",
    "The best Amazon Prime Day laptop deals for 2023",
    "The best Prime Day deals you can get at Walmart and other retailers",
    "By A. Skorheim, 4 hours ago",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "By A. Tarantola, 4 hours ago",
    "Microsoft's Activision acquisition moves ahead as judge rejects FTC injunction request",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]