[
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service 06.04.2023",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 4 hours ago",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app an hour ago",
    "Apple WWDC 2023: Live updates",
    "Apple finally announces the 15-inch MacBook Air for $1,299",
    "By N. Ingraham, an hour ago",
    "iPadOS 17 gets a customizable lock screen, interactive widgets and Apple Health",
    "By N. Ingraham, 28 minutes ago",
    "Apple refreshes the Mac Pro with its new M2 Ultra chip",
    "By A. Menegus, 44 minutes ago",
    "Even the cheapest Tesla Model 3 now qualifies for the full $7,500 tax credit",
    "Apple WWDC 2023: Live updates on iOS 17, macOS, iPad OS, the 15-inch MacBook Air, Mac Pro and more",
    "Apple’s Adaptive Audio for AirPods tunes ANC and transparency to your environment",
    "By W. Shanklin, 4 minutes ago",
    "The Apple Watch embraces widgets again in watchOS 10",
    "macOS Sonoma brings widgets to the desktop",
    "By J. Conditt, 11 minutes ago",
    "Hideo Kojima's 'Death Stranding: Director's Cut' is coming to the Mac",
    "By J. Fingas, 18 minutes ago",
    "15-inch laptops compared: Apple MacBook Air 15, Dell XPS 15 and ASUS ZenBook Pro 15",
    "By A. Skorheim, 29 minutes ago",
    "Apple’s new ‘Journal’ app will help you kickstart a daily diary habit",
    "By K. Bell, 32 minutes ago",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "Apple’s upgraded Mac Studio includes the M2 Max or M2 Ultra chip",
    "By W. Shanklin, an hour ago",
    "Apple announces M2 Ultra chip with double the CPU and GPU cores",
    "By T. O'Brien, an hour ago",
    "Apple WWDC 2023 keynote: Watch it here at 1PM ET",
    "Binance faces SEC charges for allegedly mishandling funds and dodging rules",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "Reddit communities are 'going dark' to protest changes that would hurt third-party apps",
    "All the big tech layoffs of 2023",
    "Apple’s third-gen AirPods have dropped back down to $149",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]