[
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack 06.25.2023",
    "The best Nintendo Switch OLED accessories for 2023 5 hours ago",
    "The best Xbox Series X and Series S accessories in 2023 7 hours ago",
    "Virgin Galactic will start commercial spaceflight on June 29th 10 hours ago",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "By S. Rutherford, 6 hours ago",
    "The best free games for 2023",
    "Urtopia's Chord e-bike is a little overkill for a city ride and that's okay",
    "Lucid will power Aston Martin's future EVs",
    "The Biden administration’s $42 billion broadband program is finally getting underway",
    "Congress is reportedly limiting staff use of AI models like ChatGPT",
    "Sci-fi thriller ‘Fort Solis’ arrives on PlayStation 5, PC and Mac on August 22nd",
    "By I. Bonifacic, 4 hours ago",
    "The best Nintendo Switch OLED accessories for 2023",
    "Lithium-ion battery creator John Goodenough dies at 100",
    "The best Xbox Series X and Series S accessories in 2023",
    "By D. Hardawar, 7 hours ago",
    "Meta’s Quest+ subscription offers two VR titles per month",
    "Qualcomm introduces new Snapdragon 4 Gen 2 chipsets for budget-friendly phones",
    "The best smart displays you can buy",
    "Virgin Galactic will start commercial spaceflight on June 29th",
    "By J. Fingas, 10 hours ago",
    "Amazon will use small businesses to help deliver packages in the US",
    "A 5G deadline could ground some US flights starting July 1st",
    "By S. Fielding, 11 hours ago",
    "The best work-from-home and office essentials for graduates",
    "The Morning After: NASA is recycling 98 percent of astronaut pee on the ISS into drinkable water",
    "Samsung's latest Pokémon-themed Galaxy Buds are too cute",
    "By S. Fielding, 12 hours ago",
    "Netflix is removing its 'basic' plan in Canada",
    "By S. Fielding, 14 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]