[
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990 16 hours ago",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing 9 hours ago",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard 06.12.2023",
    "92Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros 06.12.2023",
    "Toyota claims its future EVs will have a range over 600 miles",
    "By S. Fielding, 16 hours ago",
    "Instant Pot parent company files for bankruptcy",
    "By J. Fingas, 11 hours ago",
    "Reddit's CEO reportedly told staff that the community's API protest will blow over",
    "Watch the trailer for the second season of Apple TV+ series 'Foundation'",
    "By S. Fielding, 13 hours ago",
    "The best MacBooks for 2023: How to pick the best Apple laptop",
    "By A. Skorheim, 13 hours ago",
    "Google's 'Katamari Damacy' easter egg lets you roll up your search results",
    "Fast-paced platformer 'Neon White' is coming to Xbox",
    "Pandemic-era hit 'Phasmophobia' is coming to consoles this August",
    "Popular subreddits plan to extend API protests indefinitely",
    "By W. Shanklin, 6 hours ago",
    "The best kitchen gadgets for 2023",
    "'33 Immortals' first look: Defying a god is more fun with friends",
    "'Forza Motorsport' wants you to drive forever",
    "By A. Souppouris, 9 hours ago",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing",
    "By W. Shanklin, 9 hours ago",
    "Spotify has been fined $5.4 million for violating GDPR data rules",
    "Google's Pixel Watch now offers overnight blood oxygen tracking",
    "By S. Fielding, 10 hours ago",
    "Pixel phones receive a slew of new features like improved car crash detection",
    "Moog acquired by conglomerate inMusic, joining Akai and Alesis",
    "GM and Samsung SDI are building a $3 billion EV battery cell plant in Indiana",
    "By W. Shanklin, 11 hours ago",
    "Watch the Xbox Games Showcase Extended here at 1PM ET",
    "Crucial SSDs are up to 48 percent off right now",
    "By I. Bonifacic, 11 hours ago",
    "The more powerful 2024 Polestar 2 starts at $49,900",
    "By J. Fingas, 12 hours ago",
    "Instagram adds music and translation to its Notes feature",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]