[
    "Twitter has reportedly refused to pay its Google Cloud contract 06.11.2023",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard a day ago",
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990 5 hours ago",
    "The best laptops for 2023 06.12.2023",
    "Toyota claims its future EVs will have a range over 600 miles",
    "By S. Fielding, 6 hours ago",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "By N. Ingraham, 06.12.2023",
    "Watch the trailer for the second season of Apple TV+ series 'Foundation'",
    "By S. Fielding, 2 hours ago",
    "Paul McCartney is using AI to create a final song for The Beatles",
    "The best MacBooks for 2023: How to pick the best Apple laptop",
    "By A. Skorheim, 2 hours ago",
    "Watch the Xbox Games Showcase Extended here at 1PM ET",
    "By K. Holt, 13 minutes ago",
    "Crucial SSDs are up to 48 percent off right now",
    "By I. Bonifacic, 28 minutes ago",
    "The more powerful 2024 Polestar 2 starts at $49,900",
    "Instagram adds music and translation to its Notes feature",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Meta's Horizon Worlds is getting a text-based 'world chat' feature",
    "The best smart plugs in 2023",
    "By A. Skorheim, 3 hours ago",
    "Nothing will reveal the Phone 2 on July 11th",
    "Skullcandy's $100 ANC earbuds promise a comfortable fit and custom EQ",
    "Amazon's Echo Studio smart speaker is $40 off right now",
    "The Morning After: Is the 15-inch MacBook Air any good?",
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Ace Attorney games with Apollo Justice are coming to newer consoles in early 2024",
    "Capcom's Kunitsu-Gami: Path of the Goddess is an action game with traditional Japanese aesthetics",
    "Capcom's Pragmata has been delayed for a second time",
    "By S. Buckley, 16 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]