[
    "The best iPads for 2023: How to pick the best Apple tablet for you 12 hours ago",
    "Google is testing its medical AI chatbot at the Mayo Clinic 20 hours ago",
    "The best laptops for gaming and schoolwork 17 hours ago",
    "Massachusetts weighs outright ban on selling user location data 11 hours ago",
    "Lotus' Eletre SUV shows the company has finally grown up",
    "What we bought: The last gamepad I’ll need to buy for Switch and PC",
    "Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "By I. Bonifacic, 12 hours ago",
    "This EV is basically an RC car hit with a growth ray",
    "The best early Prime Day deals for 2023",
    "NASA expands developers' contracts for its next-gen spacesuits",
    "By M. Moon, 37 minutes ago",
    "Tumblr's building a TikTok inspired feed in bid to grow its user base",
    "New privacy deal allows US tech giants to continue storing European user data on American servers",
    "By I. Bonifacic, 9 hours ago",
    "‘Twisted Metal’ trailer basks in post-apocalyptic extravagance",
    "By W. Shanklin, 9 hours ago",
    "People who don't use TikTok think it's a national security threat",
    "By J. Fingas, 10 hours ago",
    "Sega of America workers overwhelmingly vote to unionize",
    "Massachusetts weighs outright ban on selling user location data",
    "By W. Shanklin, 11 hours ago",
    "Hulu debuts hub for adult animation and anime",
    "The best iPads for 2023: How to pick the best Apple tablet for you",
    "The best budget robot vacuums for 2023",
    "By V. Palladino, 15 hours ago",
    "EA is making a single-player Black Panther game",
    "The best laptops for gaming and schoolwork",
    "By D. Hardawar, 17 hours ago",
    "Google's Pixel 7a drops to a new low of $449",
    "By J. Fingas, 17 hours ago",
    "How AI could help local newsrooms remain afloat in a sea of misinformation",
    "By A. Tarantola, 17 hours ago",
    "The best smart scales for 2023",
    "By D. Cooper, 19 hours ago",
    "The Morning After: Meta's Threads tops 100 million users in under a week",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]