[
    "'Mortal Kombat 1' reboots the series on September 19th 05.18.2023",
    "Apple releases iOS 16.5 with easier access to sports news 21 hours ago",
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th 05.17.2023",
    "YouTube TV had major issues at the worst possible time last night 05.18.2023",
    "'BlackBerry' review: The comedy and tragedy of the innovator's dilemma",
    "By D. Hardawar, 2 hours ago",
    "Hyundai will pay $200 million after a TikTok challenge exposed a huge security flaw",
    "The Supreme Court’s Warhol decision could have huge copyright implications for ‘fair use’",
    "'Futurama' returns July 24th as a Hulu original after a 10-year hiatus",
    "How to choose the best TV for gaming right now",
    "Fellow Tally hands-on: A slick scale for precise pour-overs",
    "By S. Rutherford, 32 minutes ago",
    "NASA picks Blue Origin to build the Artemis V Moon landing system",
    "By J. Fingas, 37 minutes ago",
    "Google's Nest Learning Thermostat is on sale for $144 right now",
    "Solo Stove has up to 45 percent off site-wide for Memorial Day",
    "By W. Shanklin, 3 hours ago",
    "Engadget Podcast: How Apple and Google are highlighting accessibility",
    "By D. Hardawar, 3 hours ago",
    "Google's account purge will spare YouTube channels with videos",
    "Google's Pixel 8 Pro could have a built-in thermometer",
    "The Morning After: ChatGPT has an official iPhone app",
    "Apple may have restricted employee use of ChatGPT due to privacy concerns",
    "Twitter reportedly accuses Microsoft of violating its data use policy",
    "TikTok creators sue Montana over statewide ban of the app",
    "PlayStation Plus bug warns that games will expire in 15 minutes",
    "By W. Shanklin, 19 hours ago",
    "Apple TV adds multiview for live sports",
    "By W. Shanklin, 20 hours ago",
    "Vinfast's first EV is almost ready for the world",
    "By R. Baldwin, 21 hours ago",
    "‘Layers of Fear’ remake is launching on day one for Mac",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]