[
    "The Morning After: Sphere tests its giant LED video dome in Las Vegas 21 hours ago",
    "The best iPad accessories for 2023 07.04.2023",
    "The best laptops for 2023 20 hours ago",
    "The best wireless earbuds for 2023 15 hours ago",
    "Audi's updated Q8 E-Tron focuses on luxury over performance",
    "By R. Baldwin, 18 hours ago",
    "The modular Fairphone 4 arrives in the US for the first time",
    "Fisker gives the best look yet at its 600-mile range Ronin EV",
    "Sphere testing its giant LED video dome in Las Vegas",
    "The best early Prime Day deals for 2023",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "By M. Moon, 43 minutes ago",
    "Samsung will unveil its new foldables on July 26th",
    "By I. Bonifacic, 9 hours ago",
    "Meta’s Threads app is here to challenge Twitter",
    "OpenAI is forming a team to rein in superintelligent AI",
    "By I. Bonifacic, 10 hours ago",
    "Spotify stops accepting payments that were set up through Apple's App Store",
    "The best wireless earbuds for 2023",
    "By B. Steele, 15 hours ago",
    "Tidal adds hi-res FLAC streaming for HiFi Plus subscribers",
    "Early Amazon Prime Day deal knocks half off the new Echo Show 5",
    "By S. Fielding, 16 hours ago",
    "OnePlus Nord 3 delivers a 120Hz screen and 80W fast charging",
    "By J. Fingas, 16 hours ago",
    "Amazon's Echo Dot drops to an all-time low of $23 in early Prime Day deal",
    "By S. Fielding, 17 hours ago",
    "8BitDo’s modernized Neo Geo CD controller offers 35-hour battery life and wireless connectivity",
    "The best projectors you can buy in 2023, plus how to choose one",
    "Capcom's 'Exoprimal' is coming to Xbox Game Pass soon",
    "By J. Fingas, 17 hours ago",
    "Twitter quietly backtracks on requiring users to log in to see tweets",
    "The best budget wireless earbuds for 2023",
    "Meta Threads briefly went live earlier than planned",
    "By S. Fielding, 20 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]