[
    "'Mortal Kombat 1' reboots the series on September 19th 05.18.2023",
    "Apple releases iOS 16.5 with easier access to sports news 05.18.2023",
    "YouTube TV had major issues at the worst possible time last night 05.18.2023",
    "How to choose the best TV for gaming right now 7 hours ago",
    "'BlackBerry' review: The comedy and tragedy of the innovator's dilemma",
    "By D. Hardawar, 7 hours ago",
    "Hyundai will pay $200 million after a TikTok challenge exposed a huge security flaw",
    "Disney’s pricey, immersive Star Wars hotel is shutting down",
    "NASA picks Blue Origin to build the Artemis V Moon landing system",
    "Solo Stove fire pits are up to 45 percent off, plus the rest of this week's best tech deals",
    "By A. Skorheim, 3 hours ago",
    "'Until Dawn' developer Supermassive is making a ‘Dead by Daylight’ spin-off",
    "Meta’s rumored Twitter competitor could launch as early as next month",
    "Disney is reportedly laying the groundwork for its standalone ESPN streaming service",
    "Get three months of Hulu for only $6 starting today",
    "By V. Palladino, 5 hours ago",
    "Fellow Tally hands-on: A slick scale for precise pour-overs",
    "By S. Rutherford, 6 hours ago",
    "Google's Nest Learning Thermostat is on sale for $144 right now",
    "How to choose the best TV for gaming right now",
    "Solo Stove has up to 45 percent off site-wide for Memorial Day",
    "By W. Shanklin, 8 hours ago",
    "Engadget Podcast: How Apple and Google are highlighting accessibility",
    "By D. Hardawar, 8 hours ago",
    "Google's account purge will spare YouTube channels with videos",
    "Google's Pixel 8 Pro could have a built-in thermometer",
    "The Morning After: ChatGPT has an official iPhone app",
    "The Supreme Court’s Warhol decision could have huge copyright implications for ‘fair use’",
    "Apple may have restricted employee use of ChatGPT due to privacy concerns",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]