[
    "BMW reveals three new EVs for its summer 2023 lineup 20 hours ago",
    "With ‘Final Fantasy XVI’, the series tries a new direction 05.22.2023",
    "14 relaxing video games to help you destress 05.22.2023",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET 05.21.2023",
    "Watch the Microsoft Build keynotes here, starting at 12PM ET",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "By D. Hardawar, 2 hours ago",
    "Dyson says its 360 Vis Nav has 'twice the suction' of any other robot vacuum",
    "Adobe adds generative AI editing to Photoshop",
    "By W. Shanklin, 6 hours ago",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Uber will offer Waymo robotaxi rides and deliveries in Phoenix starting later this year",
    "By I. Bonifacic, 4 minutes ago",
    "Chrome makes it easier to customize your browser's look",
    "By J. Fingas, 37 minutes ago",
    "The Arturia KeyLab Essential mk3 is full-featured, eco-friendly and reasonably priced",
    "By T. O'Brien, an hour ago",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsoft confirms 365 Co-Pilot AI will be 'natively integrated' into Edge",
    "By A. Tarantola, 2 hours ago",
    "Windows 11 is getting better live captions and Bluetooth LE audio support",
    "By S. Buckley, 2 hours ago",
    "Bing Search is coming to ChatGPT",
    "By S. Fielding, 2 hours ago",
    "Binance reportedly mixed customer funds with company revenue at a US bank",
    "Apple strikes 'multibillion-dollar' deal with Broadcom for 5G parts",
    "The best E Ink tablets for 2023",
    "By V. Palladino, 2 hours ago",
    "Moog celebrates 70th anniversary with musical web app",
    "You can now use Flipboard to browse Bluesky",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "AMD's new Ryzen and Athlon chips for Chromebooks promise big battery improvements",
    "By S. Rutherford, 4 hours ago",
    "NVIDIA RTX 4060 Ti (8GB) review: Better 1080p ray tracing for $399",
    "By D. Hardawar, 4 hours ago",
    "Amazon's latest Fire tablet is a $230 Android-powered 2-in-1",
    "Samsung's new Sensor OLED display can read fingerprints anywhere on the screen",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]