[
    "The best budget laptops for 2023 07.07.2023",
    "James Webb telescope captures the most distant active supermassive black hole yet 18 hours ago",
    "Meta restores Instagram and Threads account that tracked Elon Musk's private jet 07.07.2023",
    "The best mirrorless cameras for 2023 07.07.2023",
    "BMW’s CE 02 electric scooter sets sights on urban mobility",
    "Jony Ive's first post-Apple hardware project is a $60,000 turntable",
    "All the questions we still have about Threads, Meta’s Twitter killer",
    "Canadian judge rules the thumbs up emoji counts as a contract agreement",
    "Sony’s new spatial sound system is actually portable",
    "Fisker gives the best look yet at its 600-mile range Ronin EV",
    "Audi's updated Q8 E-Tron focuses on luxury over performance",
    "The best early Prime Day deals for 2023",
    "Twitter threatens to sue Meta over the new Threads app",
    "Sphere testing its giant LED video dome in Las Vegas",
    "The old, good version of TweetDeck is back",
    "By I. Bonifacic, 11 hours ago",
    "Hayao Miyazaki's final film will be Studio Ghibli's first IMAX release",
    "By I. Bonifacic, 13 hours ago",
    "Apple will stream the first episode of 'Foundation' on YouTube",
    "By I. Bonifacic, 15 hours ago",
    "Twitch is finally adding Stories and a feed for discovering new streamers to watch",
    "By I. Bonifacic, 17 hours ago",
    "James Webb telescope captures the most distant active supermassive black hole yet",
    "Pick up a Google Nest Hub (2nd gen) for just $55",
    "Google Calendar allows users to indicate their location at specific times of the day",
    "Miffed ‘Rainbow Six Seige’ player sentenced for swatting Ubisoft Montreal’s offices",
    "By W. Shanklin, 07.07.2023",
    "Xbox Game Pass Ultimate $1 deal is back for new users",
    "Meta launches a Threads beta program for Android",
    "Casetify’s ‘Evangelion’ series lets you put AirPods in the robot",
    "Sonic the Hedgehog co-creator Yuji Naka receives suspended prison sentence for insider trading",
    "Mercedes will use Tesla's EV charging standard on North American cars",
    "The first drug that slows Alzheimer's has finally received FDA approval",
    "Meta restores Instagram and Threads account that tracked Elon Musk's private jet",
    "The best budget laptops for 2023",
    "By V. Palladino, 07.07.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]