[
    "Microsoft says China installed malware in US systems in Guam 05.24.2023",
    "Meta is laying off employees for the third time in less than three months 05.24.2023",
    "Pegasus spyware found on phones of Mexican president's close ally 05.24.2023",
    "iOS 17 will reportedly turn your locked iPhone into a smart display 05.24.2023",
    "Tesla leak reveals thousands of Autopilot safety complaints",
    "Microsoft appeals for a new US agency to regulate AI",
    "By S. Fielding, 2 hours ago",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "By A. Tarantola, 11 hours ago",
    "Twitch is raising prices for its ad-free Turbo service",
    "The best gaming handhelds in 2023",
    "The Morning After: Ford and Tesla sign EV-charging pact",
    "By D. Cooper, 17 minutes ago",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Sci-fi strategy game 'Homeworld 3' has been delayed to February 2024",
    "Ford EV drivers will get access to 12,000 North American Tesla Superchargers next spring",
    "By A. Tarantola, 13 hours ago",
    "Twitter says startups can 'experiment' with its data for $5,000 a month",
    "By W. Shanklin, 15 hours ago",
    "TikTok is testing an AI chatbot for content discovery",
    "Google begins opening access to generative AI in search",
    "By W. Shanklin, 18 hours ago",
    "MoviePass relaunches nationwide with a new pricing model",
    "YouTube Stories are going away on June 26th",
    "Virgin Galactic completes its final VSS Unity flight test before space tourism debut",
    "By J. Fingas, 19 hours ago",
    "The best passive bookshelf speakers for most people",
    "By T. O'Brien, 21 hours ago",
    "The second-gen Apple Pencil is once again on sale for $85",
    "Google Play Games for PC is now available in Europe and New Zealand",
    "The best fitness trackers for 2023",
    "By V. Palladino, a day ago",
    "Samsung's HW-Q900C premium soundbar launches today for $1,400",
    "Abode's entry-level Smart Home Security Kit only costs $160 but drops HomeKit support",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]