[
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th 21 hours ago",
    "After two years of updates, the HomePod mini is actually pretty good 05.16.2023",
    "The best SSD for your PS5 05.16.2023",
    "The best Xbox games for 2023 05.16.2023",
    "US adults are spending less time on Twitter since Elon Musk took over",
    "The first episode of 'The Expanse: A Telltale Series' will arrive on July 27th",
    "BMW’s all-electric luxury boat comes with a custom Hans Zimmer soundtrack",
    "Astronomers identify volcano-covered planet that could have water on its surface",
    "By I. Bonifacic, 18 hours ago",
    "Montana's governor signs bill banning TikTok",
    "‘Gears 5’ is the first Xbox-exclusive to come to GeForce Now",
    "By D. Cooper, 9 minutes ago",
    "Google details its next steps for wiping out Chrome tracking cookies",
    "By W. Shanklin, 9 minutes ago",
    "Technics' new flagship earbuds have larger drivers for improved sound quality",
    "NVIDIA's $299 GeForce RTX 4060 is the cheapest 40-series card yet",
    "By J. Fingas, 9 minutes ago",
    "YouTube is bringing 30-second unskippable ads to its TV apps",
    "The Morning After: You can now call an Uber like a normal taxi",
    "Sony's 'Project Leonardo' PS5 peripheral is now the 'Access controller'",
    "By S. Fielding, 2 hours ago",
    "Take-Two hints that 'Grand Theft Auto VI' is coming in 2024",
    "Watch a trailer for 'The Creator,' another film with an AI gone rogue",
    "Twitter faces lawsuit for allegedly getting a Saudi dissident imprisoned",
    "You can preorder Analogue’s TurboGrafx-inspired Duo console this Friday",
    "BlizzCon returns as an in-person event later this year",
    "Nicolas Cage is coming to ‘Dead by Daylight’",
    "By W. Shanklin, 19 hours ago",
    "The best Chromebooks you can buy in 2023",
    "By N. Ingraham, 20 hours ago",
    "The New York Times built a standalone app for audio journalism",
    "By I. Bonifacic, 20 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]