[
    "‘Star Trek: Strange New Worlds’ finds the limit of what a prequel can say 06.22.2023",
    "The best iPhone accessories for 2023 06.22.2023",
    "Google's Duet AI can generate custom templates in Sheets 06.22.2023",
    "EPA creates youth council to advise the agency on climate change policy 18 hours ago",
    "'Simpler Times' is the coziest game I've played in a long time",
    "By J. Conditt, 17 hours ago",
    "Pocono Raceway’s ‘jet drier’ credited with keeping I-95’s reopening on time",
    "By W. Shanklin, 06.22.2023",
    "A Reddit transcription community will shut down over a 'lack of trust' in the platform",
    "The original 'Call of Duty: Warzone' battle royale will shut down in September",
    "The best Amazon Prime Day early access deals for 2023",
    "Get ready for a Zuck vs Musk cage fight",
    "‘Star Trek: Strange New Worlds’ finds the limit of what a prequel can say",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "Final Fantasy XVI review: A welcome dramatic turn for the series",
    "Moto Razr+ review: Finally some real competition for Samsung’s Flip foldables",
    "Fossil finally gets Google Assistant on its Wear OS 3 smartwatches",
    "By J. Fingas, 14 hours ago",
    "YouTube fan accounts will soon need a disclosure in the channel name or handle",
    "The best 60 percent keyboards in 2023",
    "By K. Naudus, 16 hours ago",
    "iFixit teardown reveals ASUS' ROG Ally is easier to pry open than the Steam Deck",
    "By J. Fingas, 17 hours ago",
    "EPA creates youth council to advise the agency on climate change policy",
    "By J. Fingas, 18 hours ago",
    "The best robot vacuums for 2023",
    "By V. Palladino, 19 hours ago",
    "Natural Language Programming AIs are taking the drudgery out of coding",
    "By A. Tarantola, 20 hours ago",
    "The best video streaming services in 2023",
    "Google Pixel 7a bundle with Pixel Buds A-Series is $100 off at Amazon",
    "By J. Fingas, 21 hours ago",
    "Engadget Podcast: Reviewing the Moto Razr+ and Pixel Tablet",
    "Solo Stove fire pits and accessories are up to 50 percent off for July 4th",
    "NFC tech could get faster and go fully contactless within the next five years",
    "The best WiFi extenders in 2023",
    "By V. Palladino, a day ago",
    "US lawyers fined $5,000 after including fake case citations generated by ChatGPT",
    "The Morning After: Zuckerberg v. Musk, the cage fight?",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]