[
    "Astronomers identify volcano-covered planet that could have water on its surface 12 hours ago",
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th 15 hours ago",
    "After two years of updates, the HomePod mini is actually pretty good 05.16.2023",
    "Apple's Mac Mini M2 falls back to an all-time low of $500 05.16.2023",
    "Beats Studio Buds + review: A little bit better in every way",
    "By B. Steele, 17 hours ago",
    "The first episode of 'The Expanse: A Telltale Series' will arrive on July 27th",
    "You can preorder Analogue’s TurboGrafx-inspired Duo console this Friday",
    "Theranos founder Elizabeth Holmes fails in bid to stay out of prison during appeal",
    "What we bought: Are touch-activated faucets smart or silly?",
    "By S. Rutherford, 16 hours ago",
    "Twitter faces lawsuit for allegedly getting a Saudi dissident imprisoned",
    "Montana's governor signs bill banning TikTok",
    "US adults are spending less time on Twitter since Elon Musk took over",
    "BMW’s all-electric luxury boat comes with a custom Hans Zimmer soundtrack",
    "Astronomers identify volcano-covered planet that could have water on its surface",
    "By I. Bonifacic, 12 hours ago",
    "BlizzCon returns as an in-person event later this year",
    "Nicolas Cage is coming to ‘Dead by Daylight’",
    "By W. Shanklin, 13 hours ago",
    "The best Chromebooks you can buy in 2023",
    "By N. Ingraham, 14 hours ago",
    "The New York Times built a standalone app for audio journalism",
    "By I. Bonifacic, 14 hours ago",
    "Panic and Sony drop trailer for unique soccer game with a narrative twist",
    "Logitech joins the growing list of companies with self-repair programs",
    "By W. Shanklin, 15 hours ago",
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th",
    "By J. Fingas, 15 hours ago",
    "Five Nights At Freddy's movie teaser shows off murderous animatronics",
    "The best Nintendo Switch OLED accessories for 2023",
    "By K. Naudus, 16 hours ago",
    "Montreal's iconic brutalist building has finally been finished inside Unreal Engine",
    "By J. Fingas, 16 hours ago",
    "Uber will start rolling out teen accounts with safety features next week",
    "You can now call an Uber like a normal taxi",
    "By S. Fielding, 16 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]