[
    "Biden administration announces $930 million in grants to expand rural internet access 06.18.2023",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’ 06.18.2023",
    "The best E Ink tablets for 2023 a day ago",
    "The Pixel 8 Pro could feature a flat display 06.18.2023",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Sennheiser's first over-the-counter hearing aids come with a modern charging case",
    "WhatsApp can now automatically silence unknown callers",
    "Terraform Labs founder Do Kwon handed four month sentence in Montenegro",
    "By S. Fielding, 2 hours ago",
    "Apple Watch Series 8 is back on sale for $329",
    "Anker's charging accessories are up to 44 percent off in Amazon sale",
    "By M. Moon, 20 minutes ago",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, 38 minutes ago",
    "Trevor Noah is launching a weekly talk show podcast on Spotify",
    "By S. Fielding, an hour ago",
    "The Morning After: The verdict on Google’s Pixel Tablet",
    "Philips Hue lights are getting brightness balancing and better motion sensor automations",
    "Vimeo's new AI-powered editing tools are designed for beginners",
    "Opera's generative AI-infused browser is ready for the masses",
    "The best E Ink tablets for 2023",
    "By V. Palladino, a day ago",
    "Samsung brings its self-repair program to the UK",
    "The best smart scales for 2023",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "By S. Fielding, 06.19.2023",
    "The Morning After: All the cool things Netflix showed off over the weekend",
    "The FCC is preparing to take a 'fresh look' at internet data caps",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’",
    "By I. Bonifacic, 06.18.2023",
    "The Pixel 8 Pro could feature a flat display",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]