[
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan 05.20.2023",
    "Disney is reportedly laying the groundwork for its standalone ESPN streaming service 05.19.2023",
    "iMessage Contact Key Verification could arrive with iOS 16.6 17 hours ago",
    "How to choose the best TV for gaming right now 05.19.2023",
    "'BlackBerry' review: The comedy and tragedy of the innovator's dilemma",
    "By D. Hardawar, 05.19.2023",
    "Hyundai will pay $200 million after a TikTok challenge exposed a huge security flaw",
    "Disney’s pricey, immersive Star Wars hotel is shutting down",
    "NASA picks Blue Origin to build the Artemis V Moon landing system",
    "Solo Stove fire pits are up to 45 percent off, plus the rest of this week's best tech deals",
    "By A. Skorheim, 05.19.2023",
    "James Webb telescope finds water around a comet in the main asteroid belt",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "After two years of updates, the HomePod mini is actually pretty good",
    "Spacetop is an ‘augmented reality laptop’ for remote working on the go",
    "The first episode of 'The Expanse: A Telltale Series' will arrive on July 27th",
    "HP OfficeJet printers are bricking following a recent software update",
    "By I. Bonifacic, 14 hours ago",
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs",
    "By I. Bonifacic, 15 hours ago",
    "iMessage Contact Key Verification could arrive with iOS 16.6",
    "By I. Bonifacic, 17 hours ago",
    "Apple rejected 1,679,694 App Store submissions in 2022",
    "By I. Bonifacic, 19 hours ago",
    "Ooni pizza ovens are up to 30 percent off for Memorial Day",
    "By I. Bonifacic, 21 hours ago",
    "DoorDash faces lawsuit accusing it of charging iPhone users more for delivery",
    "The tech industry's accessibility-related products and launches this week",
    "San Francisco is reportedly investigating Twitter over possible building code violations",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "‘Overwatch 2’ director explains why hero missions were canceled",
    "By W. Shanklin, 05.19.2023",
    "Disney+ and Hulu will remove a slew of titles on May 26th",
    "'Until Dawn' developer Supermassive is making a ‘Dead by Daylight’ spin-off",
    "Meta’s rumored Twitter competitor could launch as early as next month",
    "Disney is reportedly laying the groundwork for its standalone ESPN streaming service",
    "Get three months of Hulu for only $6 starting today",
    "By V. Palladino, 05.19.2023",
    "Fellow Tally hands-on: A slick scale for precise pour-overs",
    "By S. Rutherford, 05.19.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]