[
    "BMW reveals three new EVs for its summer 2023 lineup 11 hours ago",
    "14 relaxing video games to help you destress 17 hours ago",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET 05.21.2023",
    "The best sleep apps and gadgets for a better night's sleep 19 hours ago",
    "'Star Wars Jedi: Survivor' and the year of disappointing PC ports",
    "By I. Bonifacic, 18 hours ago",
    "With ‘Final Fantasy XVI’, the series tries a new direction",
    "What we bought: I’m ashamed of how much I love Sage’s Creatista Plus",
    "By D. Cooper, 19 hours ago",
    "Lego's new 2,650-piece Pac-Man arcade set includes a mechanical crank",
    "Roland SH-4D review: An overdue return to great synths for the masses",
    "By T. O'Brien, 18 hours ago",
    "The new Ableton Push is an MPE-enabled standalone music production powerhouse",
    "By T. O'Brien, 21 minutes ago",
    "Amazon's Kindle Scribe updates include support for direct on-page writing",
    "BMW reveals three new EVs for its summer 2023 lineup",
    "By W. Shanklin, 11 hours ago",
    "Xbox games will hit cloud gaming service Boosteroid for the first time in June",
    "TikTok is suing Montana over statewide ban",
    "By W. Shanklin, 12 hours ago",
    "The best WiFi extenders in 2023",
    "By V. Palladino, 14 hours ago",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "The best robot vacuums for 2023",
    "By V. Palladino, 16 hours ago",
    "You can now use Amazon’s palm-reading tech to buy alcohol",
    "Meta’s open-source speech AI recognizes over 4,000 spoken languages",
    "By W. Shanklin, 16 hours ago",
    "The first all-electric Escalade joins Cadillac’s EV lineup later this year",
    "By W. Shanklin, 17 hours ago",
    "WhatsApp finally lets you fix typos in sent messages",
    "14 relaxing video games to help you destress",
    "Apple’s 2022 iPad is on sale for $399",
    "LinkedIn starts rolling out new verification and anti-scam features",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, 19 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]