[
    "Nintendo Switch Online gets four classic Genesis games, including Ghouls ’n Ghosts 06.28.2023",
    "The best PlayStation 5 games for 2023 8 hours ago",
    "Amazon's Fire HD 10 tablet is 50 percent off in early Prime Day sale 06.28.2023",
    "The best cheap phones for 2023 6 hours ago",
    "It’s a good time to be a fighting-game fan",
    "By B. Quintana, 7 hours ago",
    "Razer’s new gaming mouse can seamlessly flip between five profiles",
    "Virgin Galactic completes its first commercial spaceflight",
    "ASUS' Zenfone 10 is yet another compact flagship phone",
    "I consider myself a patient person, but 'The Password Game' might break me",
    "By I. Bonifacic, 06.28.2023",
    "'Blade Runner 2033: Labyrinth' is a new game set between the two movies",
    "By L. Bonk, 40 minutes ago",
    "'Storyteller' is the latest hot indie game coming to Netflix",
    "By J. Conditt, an hour ago",
    "‘Thirsty Suitors’ pits you against pining exes on November 2nd",
    "By W. Shanklin, an hour ago",
    "Cyberpunk cat adventure 'Stray' heads to Xbox on August 10th",
    "By I. Bonifacic, an hour ago",
    "'to a T' is a coming-of-age game about a T-posing teenager",
    "Recursive puzzle adventure game 'Cocoon' will arrive on September 29th",
    "The best fitness trackers for 2023",
    "By V. Palladino, an hour ago",
    "Electrify America's charging network will support Tesla's NACS connector by 2025",
    "The Steam Deck is up to $130 off during the Steam Summer Sale",
    "‘Pokémon Go’ developer Niantic is laying off 230 employees",
    "By W. Shanklin, 2 hours ago",
    "Watch Annapurna Interactive's showcase here at 3PM ET",
    "Google will pull news links in Canada in response to new law",
    "The best smart speakers for 2023",
    "By N. Ingraham, 3 hours ago",
    "All the big tech layoffs of 2023",
    "How to buy a vlogging camera in 2023",
    "A self-emptying Shark robot vacuum is half off right now",
    "Polestar will join Volvo in switching to Tesla's EV charging standard",
    "Watch the launch of Virgin Galactic's first commercial spaceflight",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]