[
    "Twitter has reportedly refused to pay its Google Cloud contract 06.11.2023",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard 15 hours ago",
    "The best laptops for 2023 18 hours ago",
    "Ubisoft's open-world Star Wars game is 'Outlaws' and it's coming in 2024 06.11.2023",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "By N. Ingraham, 19 hours ago",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "By D. Hardawar, 15 hours ago",
    "Reddit suffers a major outage after thousands of subreddits temporarily shut down",
    "Samsung’s 49-inch curved OLED gaming display is $2,200",
    "'Alan Wake II' stands out in a sea of sequels",
    "By J. Conditt, 18 hours ago",
    "Ace Attorney games with Apollo Justice are coming to newer consoles in early 2024",
    "Capcom's Kunitsu-Gami: Path of the Goddess is an action game with traditional Japanese aesthetics",
    "Capcom's Pragmata has been delayed for a second time",
    "By S. Buckley, 8 hours ago",
    "Watch Ubisoft's Summer Game Fest event in 13 minutes",
    "By I. Bonifacic, 11 hours ago",
    "Watch Capcom’s Summer Game Fest showcase here at 6PM ET",
    "All the big tech layoffs of 2023",
    "By J. Fingas, 12 hours ago",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "By I. Bonifacic, 13 hours ago",
    "Grubhub lays off 15 percent of its employees",
    "First 'Star Wars Outlaws' gameplay trailer offers 10 minutes of scoundrel wish fulfillment",
    "'The Crew Motorfest' brings open-world racing to Hawaii on September 14th",
    "By J. Fingas, 14 hours ago",
    "Ubisoft confirms holiday release for ‘Assassin’s Creed: Nexus VR’",
    "Netflix's ‘Captain Laserhawk: A Blood Dragon Remix’ is an anime love letter to the '90s",
    "By W. Shanklin, 14 hours ago",
    "'Skull and Bones' is still alive, will apparently have a closed beta in August",
    "Ubisoft’s ‘Avatar: Frontiers of Pandora’ arrives on December 7th 2023",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard",
    "By J. Fingas, 15 hours ago",
    "Watch the Ubisoft Forward showcase at Summer Game Fest here at 1PM ET",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]