[
    "'Mortal Kombat 1' reboots the series on September 19th 05.18.2023",
    "YouTube TV had major issues at the worst possible time last night 05.18.2023",
    "Apple releases iOS 16.5 with easier access to sports news 05.18.2023",
    "How to choose the best TV for gaming right now a day ago",
    "'BlackBerry' review: The comedy and tragedy of the innovator's dilemma",
    "Hyundai will pay $200 million after a TikTok challenge exposed a huge security flaw",
    "Disney’s pricey, immersive Star Wars hotel is shutting down",
    "NASA picks Blue Origin to build the Artemis V Moon landing system",
    "Solo Stove fire pits are up to 45 percent off, plus the rest of this week's best tech deals",
    "By A. Skorheim, 19 hours ago",
    "James Webb telescope finds water around a comet in the main asteroid belt",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "After two years of updates, the HomePod mini is actually pretty good",
    "Spacetop is an ‘augmented reality laptop’ for remote working on the go",
    "The first episode of 'The Expanse: A Telltale Series' will arrive on July 27th",
    "San Francisco is reportedly investigating Twitter over possible building code violations",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "‘Overwatch 2’ director explains why hero missions were canceled",
    "By W. Shanklin, 15 hours ago",
    "Disney+ and Hulu will remove a slew of titles on May 26th",
    "'Until Dawn' developer Supermassive is making a ‘Dead by Daylight’ spin-off",
    "Meta’s rumored Twitter competitor could launch as early as next month",
    "Disney is reportedly laying the groundwork for its standalone ESPN streaming service",
    "Get three months of Hulu for only $6 starting today",
    "By V. Palladino, 21 hours ago",
    "Fellow Tally hands-on: A slick scale for precise pour-overs",
    "By S. Rutherford, a day ago",
    "Google's Nest Learning Thermostat is on sale for $144 right now",
    "How to choose the best TV for gaming right now",
    "Solo Stove has up to 45 percent off site-wide for Memorial Day",
    "Engadget Podcast: How Apple and Google are highlighting accessibility",
    "By D. Hardawar, 05.19.2023",
    "Google's account purge will spare YouTube channels with videos",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]