[
    "Biden administration announces $930 million in grants to expand rural internet access 16 hours ago",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’ 10 hours ago",
    "Leaked Samsung Galaxy Z Flip 5 render shows a bigger cover display 06.17.2023",
    "Google's designers on why the Pixel Fold isn't just another foldable",
    "By S. Rutherford, 06.16.2023",
    "The Reddit blackout is already forcing unexpected changes",
    "Google unexpectedly sells its domain-hosting business to Squarespace",
    "The best grills and grill accessories in 2023",
    "Summer Game Fest 2023: All the games announced",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’",
    "By I. Bonifacic, 10 hours ago",
    "The Pixel 8 Pro could feature a flat display",
    "By I. Bonifacic, 11 hours ago",
    "Microsoft confirms June Outlook and OneDrive outages were caused by DDoS attacks",
    "By I. Bonifacic, 14 hours ago",
    "Biden administration announces $930 million in grants to expand rural internet access",
    "By I. Bonifacic, 16 hours ago",
    "Hitting the Books: Why AI won't be taking our cosmology jobs",
    "By A. Tarantola, 16 hours ago",
    "Netflix offers a peek at ‘One Piece’ and ‘Avatar: The Last Airbender’ live-action adaptations",
    "By W. Shanklin, 06.17.2023",
    "Leaked Samsung Galaxy Z Flip 5 render shows a bigger cover display",
    "By I. Bonifacic, 06.17.2023",
    "Netflix’s ‘3 Body Problem’ first look confirms January 2024 premiere",
    "Netflix's 'Squid Game' reality competition show debuts this November",
    "Reddit’s average daily traffic fell during blackout, according to third-party data",
    "Binance reaches deal with SEC to avoid US asset freeze",
    "‘Black Mirror’ finds new life in our modern hellscape",
    "By D. Hardawar, 06.17.2023",
    "Sony Bravia TV owners can soon take Zoom calls from the couch",
    "By W. Shanklin, 06.16.2023",
    "Meta will lower the Quest headset's recommended age from 13 to 10",
    "Firefly Aerospace buys the final scraps of doomed Virgin Orbit",
    "Hulu is streaming Bonnaroo this weekend for the third year in a row",
    "Meta rolls back COVID-19 misinformation rules in many countries",
    "The best smartwatches for 2023",
    "Amazon's Echo Dot is down to $28, plus the rest of this week's best tech deals",
    "By A. Skorheim, 06.16.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]