[
    "The best Nintendo Switch controllers for every player level 05.30.2023",
    "‘Diablo IV’ review: A mechanically perfect romp through a shallow world 05.30.2023",
    "WD_Black SSDs are up to 56 percent off right now 3 hours ago",
    "AI presents 'risk of extinction' on par with nuclear war, industry leaders say 05.30.2023",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "By J. Fingas, 37 minutes ago",
    "Garmin reveals high-end smartwatches for explorers with deep pockets",
    "Logitech MX Anywhere 3S hands-on: A nearly ideal travel mouse",
    "By S. Rutherford, 10 hours ago",
    "Range Rover’s next luxury add-on: A car seat that vibrates to music",
    "The best Father's Day tech gift ideas",
    "‘Black Mirror’ drops a new trailer ahead of June 15th premiere",
    "Ransomware attack exposes sensitive data for nearly 9 million dental patients",
    "By J. Fingas, 22 minutes ago",
    "The best live TV streaming services in 2023",
    "By A. Skorheim, an hour ago",
    "Samsung's 2022 The Frame smart TVs are up to 33 percent off",
    "The best budget robot vacuums for 2023",
    "By V. Palladino, 2 hours ago",
    "WD_Black SSDs are up to 56 percent off right now",
    "The Morning After: Industry leaders say AI presents 'risk of extinction' on par with nuclear war",
    "Google has officially stopped supporting the first-gen Chromecast",
    "By S. Fielding, 7 hours ago",
    "Uber's One subscription swaps ride discounts for cashback rewards",
    "Microsoft releases a temporary fix for Surface Pro X camera bug",
    "Google's Pixel Watch 2 will reportedly have significantly improved battery life",
    "By J. Fingas, 20 hours ago",
    "Twitter is testing Community Notes for images",
    "The best projectors you can buy in 2023, plus how to choose one",
    "Apple Music’s dedicated classical app arrives on Android",
    "Razer's new gaming earbuds include a low-latency dongle",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]