[
    "BMW reveals three new EVs for its summer 2023 lineup 05.22.2023",
    "Comcast launches $20 live TV streaming service with 60 channels 17 hours ago",
    "With ‘Final Fantasy XVI’, the series tries a new direction 05.22.2023",
    "14 relaxing video games to help you destress 05.22.2023",
    "Watch the Microsoft Build 2023 keynote in under 10 minutes",
    "Sony says it sold 600,000 PS VR 2 units in six weeks",
    "The EOS R100 is Canon's cheapest R-series mirrorless camera yet",
    "Windows 11 finally gets native RAR support",
    "Amazon's Fire TV Cube falls to a new all-time low in streaming sale",
    "By S. Fielding, 2 hours ago",
    "Logitech's Pro X 2 gaming headset promises longer battery life",
    "SpaceX wants to join the FAA as defendant in environmental groups' Starship lawsuit",
    "Soundcloud will lay off eight percent of its staff in hopes of becoming profitable",
    "By S. Buckley, 14 hours ago",
    "The best iPhone cases for 2023",
    "By V. Palladino, 16 hours ago",
    "White House reveals its next steps toward 'responsible' AI development",
    "By A. Tarantola, 16 hours ago",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "By I. Bonifacic, 16 hours ago",
    "Netflix starts charging for account sharing in the US",
    "By J. Fingas, 16 hours ago",
    "Universal Music Group partners with Endel for AI-generated wellness soundscapes",
    "By W. Shanklin, 16 hours ago",
    "The best monitors for 2023",
    "Comcast launches $20 live TV streaming service with 60 channels",
    "Sony's ZV-1 II has a wide lens so you can fit your whole face in while vlogging",
    "US Surgeon General says social media can pose 'a profound risk' to teens' mental health",
    "The Backbone One PlayStation Edition controller finally arrives on Android",
    "Amazon again accused of breaking labor laws at unionized warehouse",
    "By W. Shanklin, 18 hours ago",
    "Ford will add AM radio to EVs following concerns over emergency alerts",
    "By J. Fingas, 18 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]