[
    "Pegasus spyware found on phones of Mexican president's close ally 7 hours ago",
    "Meta is laying off employees for the third time in less than three months 5 hours ago",
    "The best iPhone cases for 2023 05.23.2023",
    "Comcast launches $20 live TV streaming service with 60 channels 05.23.2023",
    "'Project Q' is a dedicated PS5 streaming device due later this year",
    "By I. Bonifacic, an hour ago",
    "First look at 'Spider-Man 2' gameplay shows Spidey in the Venom suit",
    "By N. Ingraham, an hour ago",
    "Microsoft says China installed malware in US systems in Guam",
    "iOS 17 will reportedly turn your locked iPhone into a smart display",
    "The EOS R100 is Canon's cheapest R-series mirrorless camera yet",
    "By I. Bonifacic, 8 minutes ago",
    "New Microsoft Surface Pro X bug causes camera to stop working",
    "'Ghostrunner 2' will bring together cyberpunk ninjas and motorbikes this year",
    "Bungie revives 'Marathon' as a multiplayer shooter",
    "The 'Resident Evil 4' remake will support PS VR2",
    "'Alan Wake II' will drop on October 17th for Xbox Series X, PS5 and PC",
    "By J. Conditt, an hour ago",
    "Assassin's Creed Mirage will arrive on October 12",
    "By S. Buckley, 2 hours ago",
    "'Sword of the Sea' is a fantasy surfing adventure from the creators of 'Abzû'",
    "‘The Talos Principle 2’ brings mind-bending puzzles to a new generation",
    "By W. Shanklin, 2 hours ago",
    "'Metal Gear Solid 3: Snake Eater' is being remade for modern platforms",
    "By I. Bonifacic, 2 hours ago",
    "'Neva' is the next gorgeous-looking game from 'Gris' developer Nomada Studio",
    "'Helldivers 2' is coming to PS5 and PC later this year",
    "'Fairgame$' looks like Payday and The Division with a Gen-Z twist",
    "By J. Conditt, 2 hours ago",
    "Google and the European Commission will collaborate on AI ground rules",
    "By W. Shanklin, 3 hours ago",
    "Watch the PlayStation Showcase here at 4PM ET",
    "All the big tech layoffs of 2023",
    "Meta is laying off employees for the third time in less than three months",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]