[
    "Apple's iOS 17 developer beta is available for free a day ago",
    "iOS 17 drops support for the iPhone 8 and X 06.05.2023",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 06.05.2023",
    "Volvo officially unveils the EX30, its compact electric SUV",
    "By S. Fielding, 2 hours ago",
    "Apple bought the AR company behind the tech in Nintendo’s ‘Mario Kart’ ride",
    "By W. Shanklin, 17 hours ago",
    "Samsung will focus on foldables in its upcoming July Unpacked event",
    "WD's first Xbox Series X/S storage cards start at $80",
    "By J. Fingas, 20 hours ago",
    "Amazon's Blink security cameras and bundles are up to 49 percent off",
    "Wordpress' Jetpack AI will write your blog posts for you",
    "The best Bluetooth trackers for 2023",
    "By A. Skorheim, an hour ago",
    "The Morning After: iOS 17 offers better protection for unsolicited images",
    "Reddit is reportedly cutting 5 percent of its workforce",
    "Samsung's 1TB 980 Pro SSD falls to a new all-time low",
    "By S. Fielding, 4 hours ago",
    "Engadget Podcast: Trying out Apple's Vision Pro headset",
    "By D. Hardawar, 15 hours ago",
    "Apple’s developer betas are now free to download and install",
    "Instagram may roll out its own AI chatbot in the near future",
    "The best gaming headsets for 2023",
    "Passkey support for 1Password arrives in beta today",
    "The best wireless earbuds for 2023",
    "By B. Steele, 20 hours ago",
    "Western Digital's first Xbox Series X/S storage cards start at $80",
    "Chinese startup says its new EV battery doesn’t lose range in the cold",
    "By W. Shanklin, 21 hours ago",
    "Ubisoft's Rocksmith+ guitar-learning app is finally coming to iOS and Android on June 9th",
    "Acura ZDX EV gets Android Auto and built-in Google apps",
    "Apple's 13-inch MacBook Air M2 drops to a record low of $999",
    "By A. Skorheim, 21 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]