[
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks a day ago",
    "The best iPads for 2023: How to pick the best Apple tablet for you 20 hours ago",
    "WD_Black SSDs are up to 56 percent off right now 05.31.2023",
    "Apple is reportedly testing high-end Mac PCs powered by its new M2 chips",
    "NVIDIA's Neuralangelo is an AI model that can generate 3D objects from 2D videos",
    "By M. Moon, 34 minutes ago",
    "Fiat's Topolino EV is an Italian twist on the Citroen Ami",
    "Faraday Future's FF 91 electric vehicles will cost as much as $309,000",
    "Orange Amps offers analog warmth with its first line of Bluetooth speakers",
    "BeReal is testing a direct messaging feature called RealChat",
    "Android can now 'remix' emojis and help with reading practice",
    "No Man's Sky arrives on Mac today",
    "By S. Fielding, 34 minutes ago",
    "The best Father's Day gift ideas under $50",
    "Polestar 2 update adds YouTube integration and new CarPlay features",
    "By S. Fielding, 2 hours ago",
    "The Morning After: What to expect from Apple’s WWDC 2023",
    "Apple is reportedly testing high-end Macs powered by its new M2 chips",
    "Roger Federer can now guide you on Waze in three languages",
    "Instagram explains its recommendations and 'shadowbanning'",
    "Reddit app developer says the site’s new API rules will cost him $20 million a year",
    "Amazon workers walk out to protest return to office mandates and the company's climate impact",
    "By S. Buckley, 18 hours ago",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "By J. Fingas, 18 hours ago",
    "GM’s auto emergency braking feature is now standard on its latest EVs",
    "By W. Shanklin, 18 hours ago",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "The best streaming devices you can buy in 2023",
    "You can watch the entire first season of 'Star Trek: Strange New Worlds’ for free on YouTube",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]