[
    "Twitter has reportedly refused to pay its Google Cloud contract 06.11.2023",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard 20 hours ago",
    "The best laptops for 2023 a day ago",
    "Ubisoft's open-world Star Wars game is 'Outlaws' and it's coming in 2024 06.11.2023",
    "Toyota claims its future EVs will have a range over 600 miles",
    "By S. Fielding, 3 hours ago",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "By N. Ingraham, 06.12.2023",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "By D. Hardawar, 20 hours ago",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "By I. Bonifacic, 18 hours ago",
    "Watch Ubisoft's Summer Game Fest event in 13 minutes",
    "By I. Bonifacic, 16 hours ago",
    "Nothing will reveal the Phone 2 on July 11th",
    "Skullcandy's $100 ANC earbuds promise a comfortable fit and custom EQ",
    "Amazon's Echo Studio smart speaker is $40 off right now",
    "The Morning After: Is the 15-inch MacBook Air any good?",
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Ace Attorney games with Apollo Justice are coming to newer consoles in early 2024",
    "Capcom's Kunitsu-Gami: Path of the Goddess is an action game with traditional Japanese aesthetics",
    "Capcom's Pragmata has been delayed for a second time",
    "By S. Buckley, 13 hours ago",
    "Watch Capcom’s Summer Game Fest showcase here at 6PM ET",
    "All the big tech layoffs of 2023",
    "By J. Fingas, 17 hours ago",
    "Grubhub lays off 15 percent of its employees",
    "First 'Star Wars Outlaws' gameplay trailer offers 10 minutes of scoundrel wish fulfillment",
    "'The Crew Motorfest' brings open-world racing to Hawaii on September 14th",
    "By J. Fingas, 19 hours ago",
    "Ubisoft confirms holiday release for ‘Assassin’s Creed: Nexus VR’",
    "Netflix's ‘Captain Laserhawk: A Blood Dragon Remix’ is an anime love letter to the '90s",
    "By W. Shanklin, 19 hours ago",
    "'Skull and Bones' is still alive, will apparently have a closed beta in August",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]