[
    "BMW reveals three new EVs for its summer 2023 lineup 05.22.2023",
    "With ‘Final Fantasy XVI’, the series tries a new direction 05.22.2023",
    "14 relaxing video games to help you destress 05.22.2023",
    "The best sleep apps and gadgets for a better night's sleep 05.22.2023",
    "Watch the Microsoft Build 2023 keynote in under 10 minutes",
    "Comcast launches $20 live TV streaming service with 60 channels",
    "Dyson says its 360 Vis Nav has 'twice the suction' of any other robot vacuum",
    "NVIDIA RTX 4060 Ti (8GB) review: Better 1080p ray tracing for $399",
    "By D. Hardawar, 14 hours ago",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Soundcloud will lay off eight percent of its staff in hopes of becoming profitable",
    "By S. Buckley, 6 hours ago",
    "The best iPhone cases for 2023",
    "By V. Palladino, 7 hours ago",
    "Windows 11 finally gets native RAR support",
    "White House reveals its next steps toward 'responsible' AI development",
    "By A. Tarantola, 7 hours ago",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "By I. Bonifacic, 7 hours ago",
    "Netflix starts charging for account sharing in the US",
    "Universal Music Group partners with Endel for AI-generated wellness soundscapes",
    "By W. Shanklin, 8 hours ago",
    "The best monitors for 2023",
    "Sony's ZV-1 II has a wide lens so you can fit your whole face in while vlogging",
    "US Surgeon General says social media can pose 'a profound risk' to teens' mental health",
    "The Backbone One PlayStation Edition controller finally arrives on Android",
    "Amazon again accused of breaking labor laws at unionized warehouse",
    "By W. Shanklin, 10 hours ago",
    "Ford will add AM radio to EVs following concerns over emergency alerts",
    "By J. Fingas, 10 hours ago",
    "Uber will offer Waymo robotaxi rides and deliveries in Phoenix starting later this year",
    "By I. Bonifacic, 10 hours ago",
    "Chrome makes it easier to customize your browser's look",
    "By J. Fingas, 11 hours ago",
    "The Arturia KeyLab Essential mk3 is full-featured, eco-friendly and reasonably priced",
    "By T. O'Brien, 11 hours ago",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "By D. Hardawar, 12 hours ago",
    "AI is headed to the Microsoft Store on Windows",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]