[
    "Apple's iOS 17 developer beta is available for free 06.06.2023",
    "The best wireless earbuds for 2023 06.06.2023",
    "Samsung's 1TB 980 Pro SSD falls to a new all-time low a day ago",
    "The best tablets for 2023 13 hours ago",
    "Volvo officially unveils the EX30, its compact electric SUV",
    "How to build a box fan air filter to escape the Canada wildfire smoke",
    "By A. Tarantola, 16 hours ago",
    "Where was all the AI at WWDC?",
    "By A. Tarantola, 17 hours ago",
    "Scientists develop remote-controlled pill-shaped camera to diagnose digestive issues",
    "Apple's new 15-inch MacBook Air is already $49 off at Amazon",
    "By A. Skorheim, 14 hours ago",
    "WhatsApp's new Channels feature lets accounts send one-way updates to followers",
    "FCC orders Avid Telecom to stop health insurance-related robocalls",
    "Reddit says some accessibility apps won’t have to pay for its API",
    "By S. Rutherford, 13 hours ago",
    "Amazon is reportedly planning an ad-supported tier for Prime Video",
    "Paradox Interactive will refund physical pre-orders for ‘Vampire: The Masquerade - Bloodlines 2’",
    "By W. Shanklin, 13 hours ago",
    "NYC sues Hyundai for negligence in wake of TikTok car thefts",
    "By S. Buckley, 14 hours ago",
    "The best smart light bulbs for 2023",
    "By V. Palladino, 14 hours ago",
    "Usagi Yojimbo will be playable in the upcoming DLC for 'TMNT: Shredder's Revenge'",
    "A Hideo Kojima documentary will take you behind the scenes of 'Death Stranding'",
    "Harvard’s synthetic heart valve is designed to grow in step with the human body",
    "By W. Shanklin, 15 hours ago",
    "The best wireless workout headphones for 2023",
    "By D. Wollman, 15 hours ago",
    "‘Star Wars: Ahsoka’ premieres August 23rd on Disney+",
    "Samsung's Galaxy S23 series is on sale for as low as $700 right now",
    "By A. Skorheim, 16 hours ago",
    "The best ereaders for 2023",
    "How to understand the Air Quality Index",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]