[
    "The next Nintendo Direct will take place on June 21st 22 minutes ago",
    "Biden administration announces $930 million in grants to expand rural internet access 06.18.2023",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’ 06.18.2023",
    "Apple Watch Series 8 is back on sale for $329 06.19.2023",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Panasonic S5 IIX review: Power and value in one vlogging package",
    "Philips Hue lights are getting brightness balancing and better motion sensor automations",
    "Sennheiser's first over-the-counter hearing aids come with a modern charging case",
    "By J. Fingas, 10 hours ago",
    "Anker's charging accessories are up to 44 percent off in Amazon sale",
    "The next Nintendo Direct will take place on June 21st",
    "By K. Holt, 22 minutes ago",
    "The best midrange smartphones for 2023",
    "Domino's can now deliver pizza almost anywhere using GPS pins",
    "By J. Fingas, 43 minutes ago",
    "Rivian owners will be able to use Tesla Superchargers starting in 2024",
    "Cadillac teases the electric Escalade IQ ahead of an August 9th reveal",
    "The best budget gaming laptops for 2023",
    "By D. Hardawar, 2 hours ago",
    "Spotify may finally be ready to debut a premium HiFi audio tier",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, 3 hours ago",
    "Trevor Noah is launching a weekly talk show podcast on Spotify",
    "By S. Fielding, 4 hours ago",
    "The Morning After: The verdict on Google’s Pixel Tablet",
    "Terraform Labs founder Do Kwon handed four month sentence in Montenegro",
    "By S. Fielding, 5 hours ago",
    "Vimeo's new AI-powered editing tools are designed for beginners",
    "WhatsApp can now automatically silence unknown callers",
    "Opera's generative AI-infused browser is ready for the masses",
    "The best E Ink tablets for 2023",
    "By V. Palladino, 06.19.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]