[
    "The best tablets for 2023 a day ago",
    "Samsung's 1TB 980 Pro SSD falls to a new all-time low 06.07.2023",
    "The best wireless workout headphones for 2023 06.07.2023",
    "Apple's new 15-inch MacBook Air is already $49 off at Amazon 06.07.2023",
    "Summer Game Fest 2023 and the stagnant state of the industry",
    "By J. Conditt, 4 hours ago",
    "Google Meet makes the picture-in-picture experience far more useful",
    "United is putting 4K displays and Bluetooth on its planes",
    "How to choose the best pizza oven in 2023",
    "The best photography gifts for dads",
    "'Sonic Superstars' gives classic gameplay another modern makeover",
    "By W. Shanklin, 6 minutes ago",
    "The best soundbars for 2023",
    "By B. Steele, 8 minutes ago",
    "'Sand Land' is a new adventure game based on a manga by Dragon Ball creator Akira Toriyama",
    "By M. Smith, 10 minutes ago",
    "You can play a demo of the goth Pinocchio game 'Lies of P' right now",
    "By J. Conditt, 11 minutes ago",
    "Watch Summer Game Fest's Day of the Devs livestream here at 5PM ET",
    "By K. Holt, 13 minutes ago",
    "'Prince of Persia: The Lost Crown' is a Metroidvania-style platformer coming in 2024",
    "By S. Buckley, 32 minutes ago",
    "Reddit CEO will host an AMA on API changes as thousands of subreddits plan to 'go dark'",
    "By K. Bell, 39 minutes ago",
    "The best mirrorless cameras for 2023",
    "Third-party Reddit app Apollo will shut down on June 30th",
    "Students create robot death machine for invasive spotted lanternflies",
    "Nest WiFi Pro routers are down to record low prices in a Google smart home sale",
    "By A. Skorheim, 3 hours ago",
    "Watch Summer Game Fest 2023 here at 3PM ET",
    "By J. Conditt, 3 hours ago",
    "Google's Chrome Password Manager gets new security and usability features",
    "By S. Fielding, 4 hours ago",
    "Fitbit's Inspire 3 fitness tracker is 20 percent off right now",
    "The best sous vide machines for 2023",
    "By S. Rutherford, 7 hours ago",
    "Uber is expanding availability of shared rides and other 'green' services",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]