[
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service 06.04.2023",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 5 hours ago",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "By S. Rutherford, 44 minutes ago",
    "Apple finally announces the 15-inch MacBook Air for $1,299",
    "By N. Ingraham, 2 hours ago",
    "Apple previews new accessibility features, including a way to clone your voice",
    "By K. Malone, 43 minutes ago",
    "Apple refreshes the Mac Pro with its new M2 Ultra chip",
    "By A. Menegus, 2 hours ago",
    "iPadOS 17 gets a customizable lock screen, interactive widgets and Apple Health",
    "By N. Ingraham, an hour ago",
    "How to order the 15-inch Apple MacBook Air",
    "By V. Palladino, 6 minutes ago",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "By A. Tarantola, 13 minutes ago",
    "Safari gets major privacy updates and the ability to put web apps in your dock",
    "By T. O'Brien, 34 minutes ago",
    "Apple announces kid-friendly features to reduce eye strain",
    "FaceTime is coming to Apple TV",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "By W. Shanklin, an hour ago",
    "The Apple Watch embraces widgets again in watchOS 10",
    "macOS Sonoma brings widgets to the desktop",
    "By J. Conditt, an hour ago",
    "Hideo Kojima's 'Death Stranding: Director's Cut' is coming to the Mac",
    "15-inch laptops compared: Apple MacBook Air 15, Dell XPS 15 and ASUS ZenBook Pro 15",
    "By A. Skorheim, an hour ago",
    "Apple’s new ‘Journal’ app will help you kickstart a daily diary habit",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "Apple’s upgraded Mac Studio includes the M2 Max or M2 Ultra chip",
    "By W. Shanklin, 2 hours ago",
    "Apple announces M2 Ultra chip with double the CPU and GPU cores",
    "By T. O'Brien, 2 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]