[
    "The best iPads for 2023: How to pick the best Apple tablet for you 19 hours ago",
    "Apple Watch Series 8 falls to $280 for Prime Day 3 hours ago",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023 an hour ago",
    "The best Amazon Prime Day TV deals for 2023 38 minutes ago",
    "The best Amazon Prime Day deals for 2023",
    "By Engadget, 13 minutes ago",
    "Rolls-Royce won't let customers buy another car if they sell its new EV for a profit",
    "Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "By I. Bonifacic, 19 hours ago",
    "NASA expands developers' contracts for its next-gen spacesuits",
    "‘Twisted Metal’ trailer basks in post-apocalyptic extravagance",
    "By W. Shanklin, 16 hours ago",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "Samsung adds an 83-inch set to its 'affordable' OLED TV lineup",
    "By J. Fingas, 23 minutes ago",
    "The best fitness tech for college students",
    "By A. Skorheim, 23 minutes ago",
    "The best Amazon Prime Day SSD and storage deals for 2023",
    "By Engadget, 23 minutes ago",
    "The best Amazon Prime Day TV deals for 2023",
    "By J. Dunn, 38 minutes ago",
    "Anker charging gear is up to 50 percent off for Prime Day",
    "By S. Dent, 39 minutes ago",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023",
    "By A. Skorheim, an hour ago",
    "The best Amazon Prime Day laptop deals for 2023",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, 2 hours ago",
    "The best Prime Day robot vacuum deals you can get for 2023",
    "The Morning After: The Amazon Prime Day deals worth your time and money",
    "The best Amazon Prime Day Apple deals on AirPods, MacBooks and more for 2023",
    "By A. Skorheim, 2 hours ago",
    "The best Amazon Prime Day headphone deals for 2023",
    "Apple Watch Series 8 falls to $280 for Prime Day",
    "Sony's WH-CH720N headphones are down to just $98 for Prime Day",
    "Elizabeth Holmes has her 11-year prison sentence cut by two years",
    "Samsung’s entire Galaxy S23 lineup is cheaper than ever for Prime Day",
    "By I. Bonifacic, 3 hours ago",
    "The best Amazon Prime Day camera and drone deals for 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]