[
    "The best cheap Windows laptops for 2023 06.20.2023",
    "Final Fantasy XVI review: A welcome dramatic turn for the series a day ago",
    "The best wireless headphones for 2023 06.21.2023",
    "The best tablets for 2023 a day ago",
    "Get ready for a Zuck vs Musk cage fight",
    "The Morning After: Popular subreddits welcomed adult content to protest Reddit changes",
    "Twitter has supposedly started paying its Google Cloud bill again",
    "By I. Bonifacic, 15 hours ago",
    "Discord (still) has a child safety issue",
    "Figma is now free for all US school students",
    "By S. Fielding, 2 hours ago",
    "The best travel gear for graduates",
    "By I. Bonifacic, 11 minutes ago",
    "DuckDuckGo's privacy-focused browser is now available for Windows",
    "YouTube TV's multiview streams now include non-sports options",
    "Researchers give robots roly-polies for hands",
    "By A. Tarantola, 13 hours ago",
    "Cellular satellite test successfully beams 4G data from space to a regular phone",
    "By I. Bonifacic, 16 hours ago",
    "‘EVE Online’s spreadsheets in space now integrate seamlessly with Microsoft Excel",
    "By W. Shanklin, 17 hours ago",
    "House and Senate bills aim to protect journalists' data from government surveillance",
    "By J. Fingas, 17 hours ago",
    "Microsoft is raising Xbox Series X and Game Pass prices in most countries",
    "Otter’s AI chatbot pays attention during meetings so you don’t have to",
    "Dropbox’s new tools reimagine the cloud service as your AI sidekick",
    "By W. Shanklin, 19 hours ago",
    "‘Metal Gear Solid: Master Collection Vol. 1’ heads to consoles and PC on October 24th",
    "By I. Bonifacic, 19 hours ago",
    "Get a Ring Video Doorbell with an Echo Pop for $40 as an early Prime Day deal",
    "'Batman: Arkham Trilogy' comes to Switch this fall",
    "By J. Fingas, 20 hours ago",
    "Nintendo's new WarioWare game wants you to move your whole body",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]