[
    "Microsoft says China installed malware in US systems in Guam 05.24.2023",
    "Meta is laying off employees for the third time in less than three months 05.24.2023",
    "Pegasus spyware found on phones of Mexican president's close ally 05.24.2023",
    "iOS 17 will reportedly turn your locked iPhone into a smart display 05.24.2023",
    "Tesla leak reveals thousands of Autopilot safety complaints",
    "Microsoft appeals for a new US agency to regulate AI",
    "By S. Fielding, 4 hours ago",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "By A. Tarantola, 13 hours ago",
    "Twitch is raising prices for its ad-free Turbo service",
    "The best gaming handhelds in 2023",
    "The best gaming mouse in 2023",
    "By J. Dunn, 18 minutes ago",
    "Formula E’s Gen3 car is living up to its potential after a rocky start",
    "By B. Steele, 33 minutes ago",
    "Engadget Podcast: Microsoft’s Panos Panay on bringing AI to Windows 11",
    "By D. Hardawar, an hour ago",
    "LG and Hyundai are building a $4.3 billion EV battery cell factory in the US",
    "Samsung's Galaxy Tab S8+ falls to an all-time low in Amazon sale",
    "By S. Fielding, 2 hours ago",
    "The Morning After: Ford and Tesla sign EV-charging pact",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Sci-fi strategy game 'Homeworld 3' has been delayed to February 2024",
    "Ford EV drivers will get access to 12,000 North American Tesla Superchargers next spring",
    "By A. Tarantola, 15 hours ago",
    "Twitter says startups can 'experiment' with its data for $5,000 a month",
    "By W. Shanklin, 17 hours ago",
    "TikTok is testing an AI chatbot for content discovery",
    "Google begins opening access to generative AI in search",
    "By W. Shanklin, 20 hours ago",
    "MoviePass relaunches nationwide with a new pricing model",
    "YouTube Stories are going away on June 26th",
    "Virgin Galactic completes its final VSS Unity flight test before space tourism debut",
    "By J. Fingas, 21 hours ago",
    "The best passive bookshelf speakers for most people",
    "The second-gen Apple Pencil is once again on sale for $85",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]