[
    "The best iPhone accessories for 2023 a day ago",
    "How to choose the best TV for gaming right now 20 hours ago",
    "The best SSD for your PS5 06.21.2023",
    "Google's Duet AI can generate custom templates in Sheets 21 hours ago",
    "Pocono Raceway’s ‘jet drier’ credited with keeping I-95’s reopening on time",
    "By W. Shanklin, 19 hours ago",
    "NFC tech could get faster and go fully contactless within the next five years",
    "‘Star Trek: Strange New Worlds’ finds the limit of what a prequel can say",
    "Sony plans to keep making smartphones for at least a few more years",
    "Solo Stove fire pits and accessories are up to 50 percent off for July 4th",
    "EPA creates youth council to advise the agency on climate change policy",
    "By J. Fingas, 33 minutes ago",
    "The best robot vacuums for 2023",
    "By V. Palladino, an hour ago",
    "Natural Language Programming AIs are taking the drudgery out of coding",
    "By A. Tarantola, 2 hours ago",
    "The best video streaming services in 2023",
    "Google Pixel 7a bundle with Pixel Buds A-Series is $100 off at Amazon",
    "The original 'Call of Duty: Warzone' battle royale will shut down in September",
    "Engadget Podcast: Reviewing the Moto Razr+ and Pixel Tablet",
    "The best WiFi extenders in 2023",
    "By V. Palladino, 4 hours ago",
    "US lawyers fined $5,000 after including fake case citations generated by ChatGPT",
    "By S. Fielding, 5 hours ago",
    "The Morning After: Zuckerberg v. Musk, the cage fight?",
    "Ford secures $9.2 billion loan from US Department of Energy to build EV battery factories",
    "By S. Fielding, 6 hours ago",
    "YouTube's new tool can automatically dub videos in other languages",
    "US calls upon volunteer experts to help address generative AI risks",
    "E3 2024 and 2025 aren't canceled (yet)",
    "By S. Buckley, 18 hours ago",
    "New Indiana Jones game became an Xbox exclusive after Microsoft bought ZeniMax",
    "By J. Fingas, 19 hours ago",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "By A. Tarantola, 20 hours ago",
    "How to choose the best TV for gaming right now",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]