[
    "The best iPads for 2023: How to pick the best Apple tablet for you 17 hours ago",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023 41 minutes ago",
    "Google is testing its medical AI chatbot at the Mayo Clinic 07.10.2023",
    "The best early Prime Day deals for 2023 7 hours ago",
    "The best Amazon Prime Day deals for 2023",
    "What we bought: The last gamepad I’ll need to buy for Switch and PC",
    "Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "By I. Bonifacic, 17 hours ago",
    "This EV is basically an RC car hit with a growth ray",
    "Hulu debuts hub for adult animation and anime",
    "The best Amazon Prime Day Apple deals on AirPods, MacBooks and more for 2023",
    "By A. Skorheim, 9 minutes ago",
    "The best Amazon Prime Day headphone deals for 2023",
    "By J. Dunn, 26 minutes ago",
    "Apple Watch Series 8 falls to $280 for Prime Day",
    "By L. Bonk, 35 minutes ago",
    "The best Amazon Prime Day Apple Watch and smartwatch deals for 2023",
    "By A. Skorheim, 41 minutes ago",
    "Sony's WH-CH720N headphones are down to just $98 for Prime Day",
    "Elizabeth Holmes has her 11-year prison sentence cut by two years",
    "The best Amazon Prime Day TV deals for 2023",
    "Samsung’s entire Galaxy S23 lineup is cheaper than ever for Prime Day",
    "By I. Bonifacic, an hour ago",
    "The best Amazon Prime Day camera and drone deals for 2023",
    "The best Amazon Fire tablet deals for Prime Day 2023",
    "By V. Palladino, an hour ago",
    "Sony's WH-1000XM5 headphones drop to a record low of $328 for Prime Day",
    "The Google Pixel 7 Pro is on sale for $649 during Prime Day",
    "The best Amazon Prime Day Fire Stick deals for 2023",
    "The best Amazon Prime Day iPad and tablet deals for 2023",
    "The best Amazon Prime Day AirPods deals for 2023",
    "By V. Palladino, 2 hours ago",
    "The best deals on Echo Dots for Amazon Prime Day 2023",
    "By A. Skorheim, 3 hours ago",
    "The best Amazon Prime Day Kindle deals for 2023",
    "By A. Skorheim, 4 hours ago",
    "NASA expands developers' contracts for its next-gen spacesuits",
    "The best early Prime Day deals for 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]