[
    "Apple accidentally released the iOS 17 developer beta to the public 2 hours ago",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 06.05.2023",
    "iOS 17 drops support for the iPhone 8 and X a day ago",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "By D. Hardawar, 12 hours ago",
    "Apple MacBook Air 15-inch preview: Portable power",
    "The best gaming gifts for dads this Father's Day",
    "Apple's Optic ID will let you log in to the Vision Pro headset with your eyes",
    "How to order the 15-inch Apple MacBook Air",
    "By V. Palladino, a day ago",
    "The best wireless earbuds for 2023",
    "Western Digital's first Xbox Series X/S storage cards start at $80",
    "Chinese startup says its new EV battery doesn’t lose range in the cold",
    "By W. Shanklin, 2 hours ago",
    "Ubisoft's Rocksmith+ guitar-learning app is finally coming to iOS and Android on June 9th",
    "Acura ZDX EV gets Android Auto and built-in Google apps",
    "Apple's 13-inch MacBook Air M2 drops to a record low of $999",
    "By A. Skorheim, 2 hours ago",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "The Apple Watch SE is back on sale for $219",
    "CNET's new guidelines for AI journalism met with union pushback",
    "By A. Menegus, 3 hours ago",
    "SEC sues Coinbase over alleged violations of securities laws",
    "The best budget laptops for 2023",
    "By V. Palladino, 3 hours ago",
    "The best multi-device wireless chargers for 2023",
    "Apple's iOS 17 expands protection against unsolicited nudes",
    "Study finds sleep coaching app can help recover an extra hour of rest",
    "Google brings its predictive smart compose feature to Chat",
    "The Morning After: Apple reveals its mixed reality headset, the Vision Pro",
    "Amazon Fire Kids tablets are up to 50 percent off right now",
    "By S. Fielding, 8 hours ago",
    "Meta’s Oversight Board says the company’s rules are (slowly) changing for the better",
    "Twitter's ad sales have reportedly dropped by 59 percent since last year",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]