[
    "Benzema's top 10 Real Madrid moments - ranked",
    "Every Chelsea player in the 2022-23 season - ranked",
    "Real Madrid ratings: Benzema signs off in style",
    "Where do you want your statue, Ilkay Gundogan?!",
    "Messi's miserable farewell sums up sorry PSG career",
    "Transfers LIVE: Chelsea & Newcastle in for Messi",
    "Surely De Gea can't stay as Man Utd's No.1?!",
    "UEFA Women's Champions League",
    "Give Guijarro her flowers! Barca star the UWCL final hero 🤩",
    "Hazard & Madrid's worst signings ever - ranked 👎",
    "USMNT stars set for summer transfers",
    "Barcelona ratings: Raphinha poor in final day loss",
    "Serie A top scorers 2022-23: Golden Boot race",
    "WATCH: Alderweireld seals league title with 94th-minute screamer",
    "Benzema exit decision was a 'surprise' - Ancelotti",
    "Golden Shoe 2022-23: European football's top scorers",
    "La Liga top scorers 2022-23: Who has the most goals?",
    "Man Utd '99' documentary: Release date & how to watch",
    "The power of Messi! PSG lose 800,000 Instagram followers",
    "Osimhen becomes first African player to win Serie A Golden Boot",
    "Henry: Messi 'didn't identify' with PSG",
    "Liga MX 2023-24: Apertura & Clausura dates",
    "Los Angeles FC vs Club Leon: Stream, TV channels & where to watch",
    "Man City Transfers LIVE: Cityzens want Raphael Guerreiro",
    "Chelsea agree €60m Ugarte deal but PSG still in race",
    "'I want to be important' - Fred hints at transfer away from Man Utd",
    "See allSee All Breaking News",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "'City will beat terrible United & win the treble' | Front Three",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "Spalletti confirms imminent exit as Napoli approach Luis Enrique",
    "Portugal Women's World Cup 2023 squad: Who's in & who's out?",
    "What a comeback! Barca win UWCL in an absolute thriller 🤯",
    "WATCH:  Bronze mistake gifts Wolfsburg lead in UWCL final",
    "How Wolfsburg take down brilliant Barca in the UWCL final",
    "Graham Hansen: We are lucky to have Walsh at Barca 🤩",
    "'F*ck those guys!' - Inside the NWSL's biggest & best rivalry",
    "Lucy Bronze: England's greatest-ever women's footballer?",
    "Gundogan is so clutch - City simply have to keep him",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "How the USMNT should line up in U20 World Cup quarter-final",
    "Eight reasons why it went wrong for Messi at PSG",
    "Keep, loan or sell? Players Liverpool should allow to leave",
    "All the top teams' 2023-24 football kits released so far",
    "Introducing the AC Milan 2023-24 home kit",
    "AC Milan 2023-24 kit: New home, away & third jersey details",
    "Introducing all the 2023 Women's World Cup kits",
    "Nike unveil PSG 2023-24 home kit",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "USMNT hopeful Balogun scores 21st Ligue 1 goal for Reims",
    "'Not very good' - USMNT stars blamed for Leeds relegation",
    "West Ham walk off from Dallas match over alleged racial slur",
    "Where to watch & stream CONCACAF Gold Cup",
    "Balogun gets USMNT call up for Nations League finals",
    "Getty Images/GOAL composite",
    "How many goals has Benzema scored in his career?",
    "UEFA Europa Conference League",
    "Explained: BT Sports to TNT rebrand",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Messi's crazy goalscoring stats in full",
    "Real Madrid want Havertz transfer done quickly as Benzema leaves",
    "Messi got Inter Miami offer involving adidas & Apple 'weeks ago'",
    "Cincinnati vs Chicago Fire",
    "FC Cincinnati makes MLS history after awesome start 👏",
    "Colorado Rapids vs San Jose Earthquakes: Stream, TV channels & where to watch",
    "St. Louis vs Houston Dynamo: Stream, TV channels & where to watch",
    "Austin vs Real Salt Lake: Stream, TV channels & where to watch",
    "Cincinnati vs Chicago: Stream, TV channels & where to watch",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]