[
    "How Man Utd were convinced to pay Rashford £19.5m-per-year",
    "Where Havertz will slot in at Arsenal",
    "Barca are about to spend €35m on Brazil's 'new Ronaldo'",
    "How the USWNT should line up at the World Cup",
    "Nine things to watch for as the USMNT go for Gold Cup glory",
    "Transfers LIVE: Mbappe to join Madrid in €250m deal",
    "Rice should join Arsenal - but City trophies could swing EPL saga",
    "Revealed: Morgan & Rapinoe's plan to inspire USWNT to glory",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Barca switch couldn't be a better move for Gundogan",
    "Man City & Milan giants face competition for USMNT's Robinson",
    "Neymar backs Ancelotti to be next Brazil boss",
    "Man City Transfers LIVE: Mateo Kovacic undergoing medical tests ahead of £25m City transfer",
    "Three Players to Watch in Each 1FF Team",
    "Revealed: How much Chiesa transfer will cost Liverpool",
    "USMNT's Pulisic discusses his future amid Chelsea exit talk",
    "The must-see NZ cities hosting the Women's World Cup 🇳🇿",
    "'It's clear I won’t be playing for England again' - Houghton",
    "Ranting Mourinho quits UEFA board after just two months!",
    "All completed Ligue 1 transfers in 2023-24",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "All completed La Liga transfers in 2023-24",
    "How many goals has Lukaku scored for Belgium?",
    "Barcelona told to pay €50m for Vitor Roque",
    "How many goals has Raul Jimenez scored for Mexico?",
    "See allSee All Breaking News",
    "Son aims sly dig at Ronaldo as he snubs Saudi Pro League",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Horan breaks Alex Morgan's transfer record with Lyon move",
    "USWNT star Morgan reveals slight 'surprise' at World Cup call",
    "WATCH: Superstars announce USWNT 2023 World Cup roster",
    "Canada Women's World Cup 2023 squad: Who's in & who's out?",
    "USWNT's Andonovski gives Rapinoe & Lavelle injury updates",
    "What a year for Alyssa Thompson! USWNT squad winners & losers",
    "Madueke thrills as England U21s earn opening Euros win",
    "Wrexham's unmissable matches in League Two next season 👀",
    "10 defenders Wrexham could sign this summer 💰",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "USMNT star Weah nears $13.2m Juventus transfer",
    "'Kiss her ass!' - Lalas slams critics after Berhalter hire",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "USMNT's Cowell taking U-20 World Cup confidence to Gold Cup",
    "Turner on Slonina: He's with USMNT to compete",
    "Lewandowski's crazy goalscoring stats in full",
    "Manchester City vs Internazionale",
    "UCL final ref waves cards at himself in front of mirror",
    "Ronaldo, Messi, Pele & the top scorers of all time",
    "Inside Cristiano Ronaldo's insane career goal scoring stats",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Saudi snub! Partey agrees personal terms with Juventus🤝",
    "Explained: Why Rice would prefer Arsenal to Man City",
    "Could Klopp leave Liverpool for Germany job?",
    "New Greenwood images show Man Utd forward training alone",
    "Orlando City vs Philadelphia Union",
    "🎥 | Martinez scores Roberto Carlos-esque 35-yard screamer",
    "Portland vs Chicago: Stream, TV channels & where to watch",
    "Los Angeles vs Seattle Sounders",
    "LAFC vs Seattle Sounders: Stream, TV channels & where to watch",
    "LA Galaxy vs Sporting KC: Stream, TV channels & where to watch",
    "Colorado vs Whitecaps: Stream, TV channels & where to watch",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]