[
    "Where it all went wrong for Barca flop Arda Turan",
    "How the USMNT should line up vs Canada",
    "USMNT star Aaronson joining Europe's most interesting club!",
    "USWNT legend Rapinoe makes shock retirement announcement",
    "Transfers LIVE: Bayern submit new £70m Kane bid",
    "GOAL grades the biggest transfers of the summer so far",
    "Exclusive: Mullin has barely seen any of Reynolds' films!",
    "Hit or Miss: USMNT stars in Eredivisie as Pepi signs for PSV",
    "Trafford the hero as England are crowned kings of Europe!",
    "Soccer Champions Tour: How to buy tickets",
    "USMNT & Arsenal striker Balogun back on RB Leipzig's radar",
    "Neymar drops major hint on where he will be playing next season",
    "Every Women's World Cup squad - listed",
    "Ronaldo makes Al-Nassr transfer call to Portugal team-mate Otavio",
    "USMNT star Reyna emerges as a target for Monchengladbach",
    "USMNT vs Canada: Stream, TV channels & where to watch",
    "Silva admits Dybala 'would be a massive signing' for Chelsea",
    "Cristiano Ronaldo & partner Georgina Rodriguez go parasailing",
    "Bronze reveals Lionesses' frustration over WWC bonuses",
    "Bayern lodge improved £70m Kane bid as Spurs star pushes for move",
    "'Fantastic player' - Thiago Silva backs Pulisic's Milan move",
    "Rashford makes embarrassing blunder in De Gea goodbye message",
    "USMNT star Aaronson seals loan move to Union Berlin from Leeds",
    "Guatemala vs Jamaica: Stream, TV channels & where to watch",
    "See allSee All Breaking News",
    "Big MatchUnited Stateslive0 - 0Match DetailsWales",
    "Pochettino got Chelsea job after bizarre Zoom meeting",
    "EXCLUSIVE: England's Stanway on Euros glory & inspiring a nation",
    "Xhaka joins Leverkusen in €25m move from Arsenal",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "There will be no Messi in the future - Martinez",
    "Zambia Women's World Cup 2023 squad: Who's in & who's out?",
    "Horan and Morgan named USWNT captains ahead of World Cup",
    "Netherlands WWC 2023 squad: Who's in & who's out?",
    "Morocco Women's World Cup 2023 squad: Who's in & who's out?",
    "'I want to be known as Lauren James' 🙌",
    "Denmark Women's World Cup 2023 squad: Who's in & who's out?",
    "Ruthless Ten Hag's right to get rid of De Gea",
    "Time for Foden to move back into Man City's midfield",
    "Eight big PSG problems Luis Enrique has to solve",
    "Pulisic can be a big hit at AC Milan",
    "Hit or Miss: USMNT stars in Serie A as Puli prepares to join Weah",
    "Two PL clubs join Dest hunt as Barca slash asking price",
    "Gerrard explains shock decision to manage Al-Ettifaq",
    "Second PL chance for McKennie? Interest from England remains",
    "More ‘mistakes’ after De Gea? Man Utd sent Onana warning",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Winless in 10! When will Messi’s new side Inter Miami snap run?",
    "MLS over Milan? Pulisic told he should’ve followed Messi",
    "LA Galaxy vs Philadelphia: Stream, TV channels & where to watch",
    "Los Angeles vs SJ Earthquakes: Stream, TV channels & where to watch",
    "Whitecaps vs Sounders: Stream, TV channels & where to watch",
    "All the top teams' 2023-24 football kits released so far",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "PSG's 10 greatest away & third kits - ranked",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Soccer cleats: latest releases in 2023",
    "Guess who's back? John Terry confirms return to Chelsea",
    "UEFA Europa Conference League",
    "When does TNT launch in the UK?",
    "Grealish Treble party is still going! City star back in Ibiza",
    "What is a 'Group of Death' in soccer?",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid"
]