[
    "WATCH: Gundogan's INSANE volley for fastest FA Cup final goal",
    "USMNT stars set for summer transfers",
    "Transfers LIVE: Real Madrid target Havertz as Chelsea want €100m",
    "GOAL's European Team of the Season",
    "Eight reasons why it went wrong for Messi at PSG",
    "'F*ck those guys!' - Inside the NWSL's biggest & best rivalry",
    "Jose Mourinho is a 'f*cking disgrace'!",
    "Keep, loan or sell? Players Liverpool should allow to leave",
    "Man Utd's Lindelof hit by object thrown from crowd in final",
    "Gundogan, Di Matteo and the fastest ever FA Cup final goals",
    "'A wonderful experience' - Messi's meek goodbye to PSG",
    "Sounders vs Portland: Stream, TV channels & where to watch",
    "WATCH:  Bronze mistake gifts Wolfsburg lead in UWCL final",
    "PSG considering move for Arsenal defender Gabriel",
    "Who are Manchester United's top 20 goalscorers of all-time?",
    "Man City topscorers: How long before Haaland catches Aguero?",
    "Inside Rashford's career goalscoring numbers",
    "How many goals has Haaland scored in his career?",
    "Oshoala OUT of Women's Champions League final",
    "River Plate vs Defensa Y Justicia: Stream, TV channels & where to watch",
    "NYCFC vs New England Rev: Stream, TV channels & where to watch",
    "Ighalo to leave Al-Hilal amid Messi rumours",
    "Man City vs Man Utd: Lineups & LIVE updates",
    "See allSee All Breaking News",
    "Big MatchMan Citylive2 - 1Match DetailsMan Utd",
    "Benzema to stay at Real Madrid despite Saudi Arabia offer",
    "'City will beat terrible United & win the treble' | Front Three",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "UEFA Women's Champions League",
    "How Wolfsburg take down brilliant Barca in the UWCL final",
    "Graham Hansen: We are lucky to have Walsh at Barca 🤩",
    "Lucy Bronze: England's greatest-ever women's footballer?",
    "GOAL's women's Team of the European Season",
    "Explained: Spain women's team 'mutiny'",
    "Will Barca star Putellas play at the World Cup?",
    "Lauren James signs new four-year Chelsea deal ✍️",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "How the USMNT should line up in U20 World Cup quarter-final",
    "Man City could soon have more fans than Man Utd",
    "Lingard's move to Forest was a DISASTER!",
    "Keep loan or sell? Players Arsenal should allow to leave",
    "This is how Man Utd can win the FA Cup final 👀",
    "All the top teams' 2023-24 football kits released so far",
    "Introducing the AC Milan 2023-24 home kit",
    "AC Milan 2023-24 kit: New home, away & third jersey details",
    "Introducing all the 2023 Women's World Cup kits",
    "Nike unveil PSG 2023-24 home kit",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "'Not very good' - USMNT stars blamed for Leeds relegation",
    "West Ham walk off from Dallas match over alleged racial slur",
    "Where to watch & stream CONCACAF Gold Cup",
    "Balogun gets USMNT call up for Nations League finals",
    "Feyenoord submit opening bid for USMNT forward Pepi",
    "Why Inter will have new shirt sponsor for Champions League final",
    "Haaland: Man City bought me to win the treble",
    "Getty/EA Sports/GOAL composite",
    "EA Sports FC: Release date, consoles & updates",
    "Ancelotti tells Real Madrid he wants to sign Kane",
    "Real Madrid confirm Asensio exit 👋",
    "Seattle Sounders vs Portland Timbers",
    "New York Red Bulls' Edelman wanted by European clubs",
    "Phil Neville sacked by Inter Miami after barren run",
    "Father’s Day gifting sorted with MobyFox x MLS",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]