[
    "Where Weah will play for Juve - and what it means for USMNT",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Exclusive: Messi's Miami move is a 'sensation', says LAFC star",
    "Transfers LIVE: Man Utd make Onana bid",
    "Martino reunited with Messi at Inter Miami",
    "Declan Rice: World-class or overhyped?",
    "Man Utd are right to make De Gea contract U-turn",
    "Chelsea's Saudi saviours rescuing Boehly's bloated Blues",
    "Where to watch & stream Liga MX games live",
    "Where to watch & stream MLS games live",
    "Kane builds mansion near Chelsea training ground 👀",
    "Arsenal & USMNT's Turner stuns MLB star in batting practice",
    "From Kante to Maddison - How Leicester made £500m",
    "From Havertz to Hazard - How Chelsea made over £1bn in sales",
    "Chelsea step up bid to beat Man Utd to Brighton's Caicedo",
    "Spurs snap up Maddison after swift negotiations ✅",
    "How Tottenham splashed £1.4b on Maddison, Richarlison & more",
    "From Havertz to Pepe - Inside Arsenal's record signings",
    "Havertz apologises to Chelsea for leaked Arsenal announcement",
    "St. Kitts & Nevis vs USMNT: Where to watch the game",
    "Where Havertz will slot in at Arsenal",
    "All completed Chelsea transfers so far in 2023-24",
    "All completed Arsenal transfers so far in 2023-24",
    "See allSee All Breaking News",
    "Big MatchSt. Kittslive0 - 4Match DetailsUnited States",
    "Revealed: Kovacic explains reason for Man City move",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Done deal! Al-Hilal confirm €25m signing of Koulibaly",
    "Another blow for Lionesses! Bright to miss Portugal clash",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "England Women's World Cup squad announced",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "Russo a future England captain? Striker on leading Lionesses",
    "Wrexham reward women's team with 10 semi-pro contracts",
    "Barcelona forward Geyse wanted by Man Utd to replace Russo",
    "Arsenal paying £65m for Havertz feels like a colossal waste of cash",
    "Madueke stars as England send Germany packing from U21 Euros",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Hit or miss? Italians in the EPL as Tonali joins Newcastle",
    "St. Kitts and Nevis vs United States",
    "Balogun eyed for Sanchez link-up at Marseille",
    "Morgan & Kelly star in Calvin Klein photoshoot ahead of WWC",
    "Leicester interested in USMNT star Steffen",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "WATCH: Messi makes acting debut in Los Protectores TV series",
    "Messi chills in the Bahamas with Antonela Roccuzzo",
    "Barca make Amrabat transfer call after failing to re-sign Messi",
    "Ex-USMNT boss Bradley fired by Toronto FC",
    "The 20 best football shirts to wear this summer",
    "All the top teams' 2023-24 football kits released so far",
    "Man Utd's 10 greatest home kits - ranked",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Champions League 23/24 group stage: All you need to know",
    "Manchester City vs Internazionale",
    "Exclusive: Inter deserved to beat Man City, says Milito",
    "Explained: Nkunku's balloon celebration",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶"
]