[
    "Man Utd will dodge a bullet if they miss out on Mount",
    "How versatile Timber will fit in to Arsenal's defence",
    "Pulisic sent Champions League transfer message by USMNT boss",
    "Transfers LIVE: West Ham reject City's bid for Rice",
    "Six midfielders who are better fits for Man Utd than Mount",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Barca switch the ideal move for world-class Gundogan",
    "Ballon d'Or 2023: Messi to claim eighth Golden Ball",
    "Russo a future England captain? Striker on leading Lionesses",
    "10 moments that prove Gundogan is a Man City legend",
    "'Doing big things' – Lingard responds to Saudi transfer talk",
    "Portugal vs Belgium: Stream, TV channels & where to watch",
    "Every Women's World Cup squad - listed",
    "England Women's World Cup squad announced",
    "Netherlands U21 vs Georgia U21: Stream, TV channels & where to watch",
    "USMNT star Musah transfer listed as Milan eye €20m swoop",
    "Glazers urged to end ‘unfair’ takeover ‘circus’ at Man Utd",
    "Man Utd fans stage Glazers protest at 2023-24 kit launch",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "‘No leadership skills’ – Liverpool star Van Dijk slammed",
    "Barca make Amrabat transfer call after failing to re-sign Messi",
    "USMNT star Tim Weah to seal $13.2m Juventus transfer",
    "Man Utd's 10 greatest home kits - ranked",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Arsenal tell Balogun to arrange transfer after contract snub",
    "See allSee All Breaking News",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Why West Ham's stadium has become a baseball field",
    "Sergio Busquets to Inter Miami is a done deal!",
    "United States to host expanded 32-team Club World Cup",
    "Wrexham reward women's team with 10 semi-pro contracts",
    "Barcelona forward Geyse wanted by Man Utd to replace Russo",
    "Home delivery almost saw Morgan miss England World Cup call",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Women's National League - Premier Division",
    "Newcastle make history as first pro team in women's third tier",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Soccer Cities 23: The best football destinations for fans",
    "The Irish youngster Wayne Rooney has tipped for superstardom",
    "Smith Rowe can't stop scoring for England U21s!",
    "Matt Turner saves the day! USMNT winners & losers",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "St. Kitts and Nevis vs United States",
    "USMNT's Busio on Venezia and Olympic dreams",
    "‘What makes football special’ – Neville enjoys Wrexham’s rise",
    "Explained: Nkunku's balloon celebration",
    "Man Utd live stream and TV channel broadcast info",
    "Will De Bruyne be fit for the start of 2023-24? Injury update",
    "Hope for Arsenal as Man City see £90m Rice bid rejected",
    "Mbappe to Liverpool is on?! £258m transfer claim made",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Man Utd Transfers LIVE: 13 players to leave the club!",
    "Ex-USMNT boss Bradley fired by Toronto FC",
    "'I'm very excited' - Messi raring to go with Inter Miami",
    "Messi shares family pictures as Inter Miami star turns 36",
    "NYRB vs Atlanta United: Stream, TV channels & where to watch",
    "Explained: Why Messi could take one year off Argentina duty",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]