[
    "Man Utd are making a mess of the transfer window... again",
    "Messi, Busquets & Martino reunion can transform Inter Miami",
    "Big bad Bryan Reynolds makes his mark for the USMNT",
    "Ferreira on fire as USMNT score six in Gold Cup thrashing",
    "Transfers LIVE: Man Utd make Onana bid",
    "Chelsea tell AC Milan how much to pay for Pulisic transfer",
    "Spurs have just made the signing of the summer so far",
    "Man Utd & Chelsea agree £60m Mount deal",
    "Arsenal paying £65m for Havertz feels like a colossal waste of cash",
    "Seven midfielders City should target after Rice disappointment",
    "Man Utd should've steered clear of £60m Mount deal",
    "Boca Juniors vs Monagas: Stream, TV channels & where to watch",
    "Which players have played for both Arsenal and Chelsea?",
    "Mead urges Russo to join Arsenal after Man Utd exit",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Man Utd takeover: Ratcliffe bid 'dead in the water'",
    "Record-breaking wonderkid Nwaneri commits future to Arsenal",
    "Explained: Why Spurs star Son is now officially a year younger",
    "PSG seal €50m deal for Lucas Hernandez",
    "Real Madrid Transfers LIVE: Guler to Madrid?",
    "Ex-Chelsea midfielder N'Golo Kante buys Belgian club",
    "Liverpool Transfers LIVE: Reds planning to submit £77m for Valverde",
    "Arsenal Transfers LIVE: Gunners agree record £105m Declan Rice deal",
    "Inside the Casablanca derby 🇲🇦",
    "Banned again! Mourinho handed 10-day touchline suspension",
    "See allSee All Breaking News",
    "Revealed: Kovacic explains reason for Man City move",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Done deal! Al-Hilal confirm €25m signing of Koulibaly",
    "Cloe Lacasse: Meet Arsenal's 'unorthodox' new signing",
    "Cloe Lacasse joins Arsenal from Benfica",
    "Ireland Women's World Cup 2023 squad: Who's in & who's out?",
    "Another blow for Lionesses! Bright to miss Portugal clash",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "England Women's World Cup squad announced",
    "Why Madrid, Barca & more want 'Turkish Messi' Arda Guler",
    "Where Havertz will slot in at Arsenal",
    "Madueke stars as England send Germany packing from U21 Euros",
    "Why Wrexham are no ‘little project’ for Reynolds & McElhenney",
    "St. Kitts and Nevis vs United States",
    "Callaghan hails Jesus Ferreira after Gold Cup hat-trick",
    "It’s a scarf! Wrexham find ingenious way around towel ban",
    "FIFA world ranking latest: Argentina stay on top, England leapfrogs Belgium",
    "‘Super’ Mullin wins back-to-back Wrexham POTY awards",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "Messi's Inter Miami debut will be 2023 Leagues Cup opener",
    "Will Lionel Messi play in MLS All-Star game vs Arsenal?",
    "Where to watch & stream MLS games live",
    "Martino reunited with Messi at Inter Miami",
    "WATCH: Messi makes acting debut in Los Protectores TV series",
    "The Everton 2023-24 home kit revealed",
    "The 20 best football shirts to wear this summer",
    "All the top teams' 2023-24 football kits released so far",
    "Man Utd's 10 greatest home kits - ranked",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Champions League 23/24 group stage: All you need to know",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶"
]