[
    "GOAL's European Team of the Season",
    "USMNT stars set for summer transfers",
    "Transfers LIVE: Real Madrid target Havertz as Chelsea want €100m",
    "UEFA Women's Champions League",
    "How Wolfsburg take down brilliant Barca in the UWCL final",
    "Eight reasons why it went wrong for Messi at PSG",
    "'F*ck those guys!' - Inside the NWSL's biggest & best rivalry",
    "Manchester City vs Manchester United",
    "Why Man City could soon be better supported than Man Utd",
    "Jose Mourinho is a 'f*cking disgrace'!",
    "Keep, loan or sell? Players Liverpool should allow to leave",
    "This is how Man Utd can win the FA Cup final 👀",
    "Chelsea willing to hold on to contract rebel Mount",
    "Gundogan in talks with Milan as City contract runs down",
    "Celtic vs Inverness: Stream, TV channels & where to watch",
    "New York Red Bulls' Edelman wanted by European clubs",
    "Al-Hilal set date for Messi announcement 📆",
    "Joao Felix drops MLS transfer hint as he chills in Madrid 🎾",
    "Why Inter will have new shirt sponsor for Champions League final",
    "Wrexham dumped out of The Soccer Tournament at last-16 stage",
    "Man City vs Man Utd: Stream, TV channels & where to watch",
    "Barcelona Women vs Wolfsburg Women: Where to watch the UWCL final",
    "Ancelotti staying at Real Madrid - but what about Benzema?",
    "Zlatan Ibrahimovic vows to play on next season",
    "Bellingham house hunting in Madrid 👀",
    "Barcelona Transfers LIVE: Barcelona wants to sign Brozovic",
    "Man Utd Transfers LIVE: Mctominay plus cash for Rice?",
    "See allSee All Breaking News",
    "Benzema to stay at Real Madrid despite Saudi Arabia offer",
    "'City will beat terrible United & win the treble' | Front Three",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "Graham Hansen: We are lucky to have Walsh at Barca 🤩",
    "Lucy Bronze: England's greatest-ever women's footballer?",
    "GOAL's women's Team of the European Season",
    "Explained: Spain women's team 'mutiny'",
    "Will Barca star Putellas play at the World Cup?",
    "Lauren James signs new four-year Chelsea deal ✍️",
    "The best Barca team ever? UWCL finalists can match Messi & co 🙌",
    "Lingard's move to Forest was a DISASTER!",
    "Keep loan or sell? Players Arsenal should allow to leave",
    "10 players most likely to join Man City this summer",
    "Why Liverpool are fighting to sign Khephren Thuram",
    "21 best players of the European season - ranked",
    "All the top teams' 2023-24 football kits released so far",
    "Introducing the AC Milan 2023-24 home kit",
    "AC Milan 2023-24 kit: New home, away & third jersey details",
    "Introducing all the 2023 Women's World Cup kits",
    "Nike unveil PSG 2023-24 home kit",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "'Not very good' - USMNT stars blamed for Leeds relegation",
    "West Ham walk off from Dallas match over alleged racial slur",
    "Where to watch & stream CONCACAF Gold Cup",
    "Balogun gets USMNT call up for Nations League finals",
    "Feyenoord submit opening bid for USMNT forward Pepi",
    "Arsenal Transfers LIVE: Odegaard to extend his contract",
    "Chelsea Transfers LIVE: Blues hold meeting to convinve Ugarte",
    "Haaland: Man City bought me to win the treble",
    "Getty/EA Sports/GOAL composite",
    "EA Sports FC: Release date, consoles & updates",
    "Who is Champions League final referee Szymon Marciniak?",
    "Phil Neville sacked by Inter Miami after barren run",
    "Father’s Day gifting sorted with MobyFox x MLS",
    "Copa Libertadores Play-off",
    "Football to watch in summer 2023: Competitions, leagues & TV channels",
    "Vancouver Whitecaps vs Houston Dynamo: Stream, TV channels & where to watch",
    "Seattle Sounders vs San Jose Earthquakes: Stream, TV channels & where to watch",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]