[
    "21 best signings of the EPL season - ranked",
    "Where are the USMNT U20 World Cup squad of 2019 now?",
    "WATCH: 15 best goals of the WSL season - ranked 🚀",
    "Transfers LIVE: Man Utd open Neymar talks with PSG",
    "USMNT star McKennie 'certain' to leave Leeds whatever happens",
    "Jorg Schmadtke: The man helping Klopp rebuild Liverpool",
    "'United 07-08 were scarier than this City team!' | Front Three",
    "Vini is right: La Liga is facilitating, not stopping, racism",
    "USWNT star Macario confirms she'll miss Women's World Cup 😔",
    "Vlahovic & Chiesa out? Six stars that could quit Juve",
    "Houston Dynamo vs Minnesota United: Stream, TV channels & where to watch",
    "Valencia identify fans that racially abused Vinicius Junior",
    "LAFC's Tillman joins brother Malik by switching to USMNT",
    "Inter Miami vs Nashville: Stream, TV channels & where to watch",
    "USWNT Women's World Cup roster: Who will be picked?",
    "Barcelona Transfers LIVE: Barca to miss out on Messi?",
    "Will Macario play for USWNT at the 2023 Women's World Cup?",
    "Man Utd monitoring Diaby but he could cost £69m",
    "Real Valldolid vs Barcelona: Lineups and LIVE updates",
    "New York Red Bulls vs Cincinnati: Stream, TV channels & where to watch",
    "FA considering bid for 2031 Women's World Cup",
    "Pogba agent speaks out on transfer rumours",
    "The reason Wrexham offered Liam McAlinden a new contract",
    "Bayern Munich 2023-24 kit: New home, away & third jersey details",
    "Guardiola issues Man City warning ahead of two finals",
    "See allSee All Breaking News",
    "Juventus hit with fresh 10-point deduction 😱",
    "Vini Jr racism: Federation chief admits Spain has 'problem'",
    "Xavi calls for games to be stopped amid La Liga racism storm",
    "Arteta: Arsenal are not at Man City's level",
    "Confirmed: Real will NOT sack Ancelotti despite City thrashing",
    "Chelsea set to win race for PSG defender Lawrence 🏁",
    "Revealed: Cost of Avram Glazer’s trip to Women’s FA Cup final",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Drama at the death sees Man Utd keep the WSL title race alive!",
    "The Juventus financial scandal explained 🤯",
    "USMNT's Gioacchini: I dream about the Champions League",
    "Bernardeschi is fed up with Toronto boss Bradley 😤",
    "Ballon d'Or 2023: Six City players in the top 20",
    "Catch City if you can: Which EPL team can take down the champs?",
    "All the top teams' 2023-24 football kits released so far",
    "Soccer cleats: latest releases in 2023",
    "Arsenal 2023-24 kit: New home, away & third jersey details",
    "adidas x Prada drop the football boot collab of the year",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "A lifeline for rec soccer? What to know about MLS GO",
    "USMNT and Valencia star Musah backs Vinicius Junior",
    "Ipswich fans rage at odd Ed Sheeran attack from Wrexham stars",
    "United States U20 vs Ecuador U20",
    "USMNT's Yedlin gives advice to U20 World Cup hero Gomez",
    "Man Utd Transfers LIVE: Red Devils monitoring €70m-rated Bundesliga speedster",
    "Caicedo & Mac Allister could leave Brighton, admits De Zerbi",
    "Arsenal Transfers LIVE: Saka signs new contract until 2027",
    "Mane flop explained & why Cancelo-Kimmich swap could happen",
    "Explained: Why Arsenal may benefit from Juve points penalty",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Messi's crazy goalscoring stats in full",
    "13 fun facts about Yunus Musah",
    "Busquets quizzed on whether his future is tied to Messi’s",
    "Cincinnati vs Columbus Crew",
    "WATCH: USMNT's Celentano pulls off stoppage-time wonder save",
    "WATCH: Klich copies Rooney's iconic boxing celebration  🥊",
    "Vela hails LAFC after going top of Western Conference",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates",
    "Mesut Ozil's Arsenal debut - Who played and where are they now?"
]