[
    "Messi in MLS: Beckham's Inter Miami revolution",
    "Winners & losers of the 2022-23 European season",
    "Cowell and Slonina headline USMNT Gold Cup squad",
    "Can Inter Miami survive until Messi arrives?",
    "Every Man City player in the 2022-23 season - ranked",
    "Transfers LIVE: Chelsea demand £68.4m from Man Utd for Mount",
    "PSG consider selling Mbappe after contract bombshell 💣",
    "Rain on Man City's parade! Weather dampens treble party",
    "Guardiola's next job could be in MLS with NYCFC - Twellman",
    "Berlusconi: Most divisive & successful football president",
    "Ex-USMNT boss Berhalter makes shortlist for Eredivisie job",
    "Germany Women's World Cup 2023 squad: Who's in & who's out?",
    "Chelsea ready to break the bank for Maignan or Onana 💰",
    "WATCH: Haaland pours drink on Grealish's head 🤣",
    "MLS manager Arena 'could live with' Messi rule exception",
    "Lewandowski: I see Saudi trend, but it's not for me",
    "Messi's arrival to MLS doesn't scare Carlos Vela",
    "Jota: Time for Liverpool to create new history",
    "Chelsea outcast Aubameyang wanted by four Saudi clubs",
    "Dani Alves denied jail exit after being ruled a 'flight risk'",
    "Wrexham apologise to fans after kit launch debacle",
    "Real Madrid Transfers LIVE: Modric to stay at Madrid!",
    "Putellas back just in time for Spain as WWC squad revealed",
    "Man City Transfers LIVE: Cityzens eyeing Josko Gvardiol",
    "Timber keeps transfer door ajar for Man Utd & Liverpool",
    "See allSee All Breaking News",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Benzema explains key reason behind Al-Ittihad move",
    "EXCLUSIVE: Alexander-Arnold talks Messi, Salah and Liverpool",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "England's Women's World Cup send-off friendly is confirmed ✅",
    "When are England Women's fixtures in 2023?",
    "Will Macario play for USWNT at the 2023 Women's World Cup?",
    "USWNT star Macario is perfect for Chelsea - despite the risks",
    "From the Pope to prostitutes: Berlusconi's most famous quotes",
    "Messi rejecting Barca is a blessing for Xavi's team",
    "Ballon d'Or 2023: Did Haaland do enough to catch Messi?",
    "Pep's masterpiece: How Man City won the treble",
    "Man City - and Abu Dhabi - finally realise their European destiny",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Quiz: How well do you recall the Premier League 2022-23?",
    "London or Miami? Romeo Beckham in future talks with Brentford",
    "WATCH: Mullin’s stunning solo effort wins Goal of the Season",
    "Who else? Neymar expects more talent to follow Messi to MLS",
    "Revealed: Conditions that allowed Foster to stay at Wrexham",
    "Guardiola compares City Treble to Messi World Cup win",
    "Manchester City vs Internazionale",
    "'Ever won the Treble? Have you f*ck!' - Grealish leads chant",
    "Man City fans share horror stories from Champions League final",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Tell us: Who should Madrid sign to replace Benzema? 🤔",
    "Manchester City vs Manchester United",
    "Debate: Would any Man Utd players get in Man City's team?",
    "Getty/GOAL/IG:jackgrealish",
    "De Jong disappointed to be denied Messi reunion at Barca",
    "Messi walking into a disaster zone! Inter Miami extend losing run",
    "WATCH: Zelarayan scores outrageous goal from inside his own half",
    "St. Louis vs LA Galaxy: Stream, TV channels & where to watch",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Soccer cleats: latest releases in 2023",
    "adidas launch all-new X Crazylight boot",
    "All the top teams' 2023-24 football kits released so far",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]