[
    "Leonardo is right: PSG must sell Mbappe now!",
    "Pulisic's final chance: USMNT star MUST shine in Milan",
    "WATCH: Arsenal star Turner involved in USMNT-Canada brawl",
    "Man Utd - the worst negotiators in world football",
    "Transfers LIVE: Chelsea enquire about €80m Vlahovic",
    "Matheus Franca: The £21m talent who could be Chelsea-bound",
    "Man Utd's biggest flop signings of the Glazer era - ranked",
    "Rodman expects 'ruthless' USWNT to win third successive World Cup",
    "Why haven't Wrexham signed anyone yet this summer?",
    "EXCLUSIVE: Chelsea's Buchanan & Fleming star in Kitbag",
    "Liverpool fan Paul Mullin reveals he would've played for Man Utd",
    "Oldest professional player Kazuyoshi Miura extends contract at 56!",
    "How to watch Wimbledon: channels & streaming options",
    "Reynolds sends support to Tozer after his father's death",
    "How many points do you need to win FPL 2023/24 season?",
    "'Family' - Messi and Antonela pose in clear Caribbean sea 🏖️",
    "How are assists calculated in FPL?",
    "Chelsea flop Felix made to train with Atletico academy players",
    "Mudryk snaps back at fan after 'learn to make 360 turns' jibe",
    "Ronaldo still among 'best in the world', says new Al-Nassr boss",
    "'No way' - Man Utd outcast Telles rules out one possible transfer",
    "Lukaku to ignore Poch's order to return for Chelsea pre-season",
    "'Solo was my idol' - Portugal's Pereira excited to face USWNT 🤩",
    "Mbappe could remarkably accept BENCH role at PSG",
    "USMNT forward Vazquez in line for €10m Monchengladbach transfer",
    "See allSee All Breaking News",
    "Spurs boss Postecoglou offers Kane update amid Bayern interest",
    "Exclusive: Mullin has barely seen any of Reynolds' films!",
    "USWNT legend Rapinoe makes shock retirement announcement",
    "Pochettino got Chelsea job after bizarre Zoom meeting",
    "Spain & Netherlands slammed for mocking Maori haka",
    "'I always felt Trump loved me' - USWNT icon Rapinoe",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Rodman dominates to make USWNT World Cup statement",
    "Bronze reveals Lionesses' frustration over WWC bonuses",
    "Zambia Women's World Cup 2023 squad: Who's in & who's out?",
    "Soccer Cities 23: The best football destinations for fans",
    "Milan the perfect stage for Pulisic to prove himself",
    "Who should be Chelsea's new captain? The candidates ranked",
    "Jones' assist of dreams proves USMNT newcomer is for real!",
    "Turner the shootout hero as USMNT win Canada thriller",
    "Chelsea loan Fofana to Union as striker links up with Aaronson",
    "USMNT star Balogun backed to give Arsenal 'something different'",
    "USMNT star Matt Turner pays tribute to teenager cancer patient",
    "USMNT & Arsenal striker Balogun back on RB Leipzig's radar",
    "Quiz: Only a true fan can name these Liverpool legends",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "Kane set for new £400,000 per week Spurs deal if he snubs Bayern",
    "Chelsea make Vlahovic enquiry as Juventus set minimum price tag",
    "Debate: Have Chelsea dropped the best kit of 2023-24?",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Getty/GOAL/IG-victoriabeckham",
    "Beckham whitens Messi's teeth on HUGE mural in Miami 😅",
    "Winless in 10! When will Messi’s new side Inter Miami snap run?",
    "MLS over Milan? Pulisic told he should’ve followed Messi",
    "LA Galaxy vs Philadelphia: Stream, TV channels & where to watch",
    "Haaland, Vini Jr, Kerr & more star in EA Sports FC 24 teaser",
    "Juventus unveil 2023-24 away kit inspired by the mountain",
    "All the top teams' 2023-24 football kits released so far",
    "Umbro unveil the all-new West Ham 2023-24 home kit",
    "Chelsea's 10 greatest home kits - ranked 🦁",
    "EA Sports/Getty/GOAL composite",
    "EA Sports FC: Release date, consoles & updates",
    "2009 Barcelona vs 2023 Man City: Yaya Toure has his say",
    "Man Utd live stream and TV channel broadcast info",
    "Guess who's back? John Terry confirms return to Chelsea",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid"
]