[
    "The USMNT has conquered CONCACAF again - now what?",
    "Why Chelsea are paying £35m to sign Villarreal star Jackson",
    "Soccer Cities 23: The best football destinations for fans",
    "USMNT stars Reyna and Balogun put the world on notice!",
    "USMNT ratings: Reyna and Balogun dazzle for CONCACAF kings",
    "Simon shines as Spain clinch Nations League crown",
    "WATCH: Balogun scores first USMNT goal",
    "Transfers LIVE: Man City want to extend Walker's stay",
    "Injury-hit USMNT star Reyna transfer listed by Dortmund",
    "Why Chelsea must go all out to sign £80m Caicedo",
    "Man Utd fan banned for offensive Hillsborough shirt",
    "Antony's ex sheds light on domestic abuse allegations",
    "Walker deals blow to Bayern's transfer hopes",
    "Messi-less Argentina wasteful in win over Indonesia",
    "‘Stockport Iniesta’ Foden joins Salah & Messi in mural club",
    "All completed La Liga transfers in 2023-24",
    "Inside the tournament breeding future footballers",
    "Havertz tells Chelsea he won't sign new contract",
    "Every Women's World Cup squad - listed",
    "Chelsea Transfers LIVE: Blues to trigger Jackson release clause",
    "Did City block Cancelo move to Barca? Pep responds to Xavi",
    "Juventus set asking price for USMNT star McKennie",
    "Why Barca stars aren't in Spain Women's World Cup squad",
    "Guardiola offers Gundogan update amid Barcelona interest",
    "Turkey vs Wales: Stream, TV channels & where to watch",
    "See allSee All Breaking News",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "Dias was sick in Grealish’s mum’s handbag after two shots! 🤮",
    "Batlle returns to Barca as Man Utd offer arrives too late",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "'Stuck with me' - Toone's message to Russo after Man Utd exit",
    "Brazil Women's World Cup 2023 squad: Who's in & who's out?",
    "USWNT Women's World Cup roster: Who will be picked?",
    "Argentina Women's World Cup 2023 squad: Who's in & who's out?",
    "GOAL grades the biggest deals of the summer so far",
    "5 Wonderkids in One Future Football",
    "10 midfielders Wrexham could sign this summer",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Pulisic explains USMNT lessons from Nations League win",
    "Reynolds & McElhenney count the cost of Wrexham storm",
    "WATCH: USMNT stars use Pulisic as champagne bowling ball",
    "‘Won't go on loan’ – Balogun sends Arsenal transfer message",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Norway boss glad Haaland didn't party in 'the Grealish way'",
    "One Future Football clubs unveil 12 jaw-dropping kits for Season One",
    "Grealish sent partying warning after treble celebrations",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "Will Smith Rowe stay at Arsenal? Exit talk addressed",
    "Messi told to expect 'intense' MLS competition by Almada",
    "Griezmann reveals MLS 'dream' after Messi's Miami move",
    "Hazard on retirement talk: 'I've been resting for three years!'",
    "Alba agrees contract to be reunited with Messi in Miami",
    "Nashville SC vs St. Louis City",
    "'World class' - Mukhtar hailed by Nashville coach",
    "New Premier League ball released for 2023-24 season",
    "Barcelona's 10 greatest home kits - ranked",
    "Barcelona 2023-24 home kit inspired by women's team",
    "All the top teams' 2023-24 football kits released so far",
    "Barcelona 2023-24 kit: New home, away & third jersey details",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]