[
    "Man Utd will dodge a bullet if they miss out on Mount",
    "Where Weah will play for Juve - and what it means for USMNT",
    "Christmas has come early for Kovacic with City move 🎄",
    "How the USMNT should line up vs St. Kitts & Nevis",
    "USMNT star Ricardo Pepi agrees €10m transfer to PSV",
    "Transfers LIVE: Kane agrees terms with Bayern",
    "How versatile Timber will fit in to Arsenal's defence",
    "Cher Ndour: PSG are signing 'the next Pogba' 🤩",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Six midfielders who are better fits for Man Utd than Mount",
    "Shakira recalls finding out Pique had 'betrayed' her",
    "Exclusive: Inter deserved to beat Man City, says Milito",
    "Rashford & Malacia pictured in New York!",
    "MLS All-Stars vs Arsenal 2023: Date & where to watch",
    "River Plate vs The Strongest: Stream, TV channels & where to watch",
    "No Messi! MLS confirms All-Star squad to face Arsenal",
    "'Manchester City don't want to sign Declan Rice'",
    "Canada vs Guadeloupe: Stream, TV channels & where to watch",
    "Arsenal title 'choke' blamed on not signing CR7",
    "Arsenal have days to agree Nwaneri contract",
    "Done deal! Man City confirm £25m signing of Mateo Kovacic",
    "Leicester interested in USMNT star Steffen",
    "Man Utd summer transfer budget capped by FFP",
    "Liverpool record-breaker Max Thompson dies aged 66",
    "Nike Zoom Mercurial Vapor Elite boot review",
    "See allSee All Breaking News",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Done deal! Al-Hilal confirm €25m signing of Koulibaly",
    "Why West Ham's stadium has become a baseball field",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "England Women's World Cup squad announced",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "Russo a future England captain? Striker on leading Lionesses",
    "Wrexham reward women's team with 10 semi-pro contracts",
    "Barcelona forward Geyse wanted by Man Utd to replace Russo",
    "Home delivery almost saw Morgan miss England World Cup call",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "10 moments that prove Gundogan is a Man City legend",
    "Soccer Cities 23: The best football destinations for fans",
    "The Irish youngster Wayne Rooney has tipped for superstardom",
    "Ballon d'Or 2023: Messi to claim eighth Golden Ball",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Reynolds and McElhenney’s Alpine deal branded 'preposterous'",
    "USMNT star Musah transfer listed as Milan eye €20m swoop",
    "USMNT star Tim Weah to seal $13.2m Juventus transfer",
    "Arsenal tell Balogun to arrange transfer after contract snub",
    "Manchester City vs Internazionale",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Explained: Nkunku's balloon celebration",
    "Man Utd live stream and TV channel broadcast info",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Grealish & Attwood plan stunning upgrade to £5.6m mansion",
    "Revealed: Why De Gea still has no new deal as Man Utd change offer",
    "Barca make Amrabat transfer call after failing to re-sign Messi",
    "Ex-USMNT boss Bradley fired by Toronto FC",
    "'I'm very excited' - Messi raring to go with Inter Miami",
    "Messi shares family pictures as Inter Miami star turns 36",
    "NYRB vs Atlanta United: Stream, TV channels & where to watch",
    "Man Utd's 10 greatest home kits - ranked",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]