[
    "Where it all went wrong for Barca flop Arda Turan",
    "Turner the shootout hero as USMNT win Canada thriller",
    "Milan the perfect stage for Pulisic to prove himself",
    "Rodman dominates to make USWNT World Cup statement",
    "Jones' assist of dreams proves USMNT newcomer is for real!",
    "Chelsea unveil 2023-24 home kit inspired by the '90s",
    "Exclusive: Mullin has barely seen any of Reynolds' films!",
    "Transfers LIVE: Tottenham won't accept Bayern's new £70m Kane bid",
    "Who should be Chelsea's new captain? The candidates ranked",
    "USMNT star Aaronson joining Europe's most interesting club!",
    "Liverpool Transfers LIVE: Klopp keen on signing Thuram",
    "Liverpool's Salah wanted at 2024 Olympics by Egypt boss",
    "Man Utd Transfers LIVE: Red Devils set to part ways with Maguire",
    "Hojlund names ex-Man Utd defender as his toughest opponent",
    "Every Women's World Cup squad - listed",
    "Wrexham boss Parkinson sends out strong League Two message",
    "Pochettino identifies two new attacking targets for Chelsea",
    "'I always felt Trump loved me' - USWNT icon Rapinoe",
    "Reece James' dad was 'gobsmacked' to learn of Real interest",
    "Colwill sends strong message to Chelsea amid Liverpool links",
    "Real Madrid Transfers LIVE: Xabi Alonso eyed as Ancelotti replacement",
    "Dybala responds after Silva tells forward to join Chelsea",
    "Juventus unveil 2023-24 away kit inspired by the mountain",
    "How to watch Wimbledon: channels & streaming options",
    "Too much? Man Utd slap hefty price tag on Harry Maguire",
    "See allSee All Breaking News",
    "USWNT legend Rapinoe makes shock retirement announcement",
    "Pochettino got Chelsea job after bizarre Zoom meeting",
    "EXCLUSIVE: England's Stanway on Euros glory & inspiring a nation",
    "Xhaka joins Leverkusen in €25m move from Arsenal",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Bronze reveals Lionesses' frustration over WWC bonuses",
    "Zambia Women's World Cup 2023 squad: Who's in & who's out?",
    "Horan and Morgan named USWNT captains ahead of World Cup",
    "Netherlands WWC 2023 squad: Who's in & who's out?",
    "Morocco Women's World Cup 2023 squad: Who's in & who's out?",
    "Soccer Cities 23: The best football destinations for fans",
    "Ruthless Ten Hag's right to get rid of De Gea",
    "Trafford the hero as England are crowned kings of Europe!",
    "How the USMNT should line up vs Canada",
    "Time for Foden to move back into Man City's midfield",
    "USMNT star Matt Turner pays tribute to teenager cancer patient",
    "USMNT & Arsenal striker Balogun back on RB Leipzig's radar",
    "USMNT star Reyna emerges as a target for Monchengladbach",
    "USMNT vs Canada: Stream, TV channels & where to watch",
    "'Fantastic player' - Thiago Silva backs Pulisic's Milan move",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Getty/GOAL/IG-victoriabeckham",
    "Beckham whitens Messi's teeth on HUGE mural in Miami 😅",
    "Winless in 10! When will Messi’s new side Inter Miami snap run?",
    "MLS over Milan? Pulisic told he should’ve followed Messi",
    "LA Galaxy vs Philadelphia: Stream, TV channels & where to watch",
    "Los Angeles vs SJ Earthquakes: Stream, TV channels & where to watch",
    "Umbro unveil the all-new West Ham 2023-24 home kit",
    "Chelsea's 10 greatest home kits - ranked 🦁",
    "All the top teams' 2023-24 football kits released so far",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "Man Utd live stream and TV channel broadcast info",
    "Guess who's back? John Terry confirms return to Chelsea",
    "UEFA Europa Conference League",
    "When does TNT launch in the UK?",
    "Grealish Treble party is still going! City star back in Ibiza",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid"
]