[
    "Man Utd must go all out to sign ideal goalkeeper Onana",
    "What a year for Alyssa Thompson! USWNT squad winners & losers",
    "USWNT Women's World Cup roster: Who is in?",
    "USMNT winners & losers of Berhalter's controversial return",
    "Kovavic has won the lottery with £25m Man City move 👏",
    "Transfers LIVE: Saudi clubs eyeing €40m Partey",
    "Gundogan's great, but not the right fit for Barca",
    "Lindsey Horan announces engagement to Tyler Heaps",
    "21 top talents to watch at the U21 Euros",
    "PSG managerial chaos a clear sign of a broken club",
    "'Get yourself a new shirt!' - Haaland teases Man Utd fan",
    "'They want to take over' - Carragher slams Saudi transfers",
    "Portland vs Chicago: Stream, TV channels & where to watch",
    "LAFC vs Seattle Sounders: Stream, TV channels & where to watch",
    "LA Galaxy vs Sporting KC: Stream, TV channels & where to watch",
    "Patrick Vieira in pole position to be named next Leeds boss",
    "Back to Benfica! Messi to miss out on Miami Di Maria reunion",
    "Colorado vs Whitecaps: Stream, TV channels & where to watch",
    "Messi offered brutally honest MLS advice by Gareth Bale",
    "UEFA bans West Ham United fans for violent conduct",
    "Lewandowski, Lato & Poland's greatest strikers",
    "Everton flop Dele Alli dyes his hair blue",
    "Houston vs SJ Earthquakes: Stream, TV channels & where to watch",
    "Austin vs FC Dallas: Stream, TV channels & where to watch",
    "St. Louis vs Salt Lake: Stream, TV channels & where to watch",
    "See allSee All Breaking News",
    "Son aims sly dig at Ronaldo as he snubs Saudi Pro League",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "USWNT star Morgan reveals slight 'surprise' at World Cup call",
    "WATCH: Superstars announce USWNT 2023 World Cup roster",
    "Canada Women's World Cup 2023 squad: Who's in & who's out?",
    "USWNT's Andonovski gives Rapinoe & Lavelle injury updates",
    "Will Press play for the USWNT at the 2023 Women's World Cup?",
    "Will Heath play for the USWNT at the 2023 Women's World Cup?",
    "Nearly a third of players in WWC qualification were not paid",
    "Havertz to Arsenal makes zero sense - he's not good enough!",
    "Richarlison's misery continues in Brazil defeat 😬",
    "Ronaldo rides to Portugal's rescue on dream 200th cap",
    "Another attacker?! Where Nkunku best fits for Chelsea 🧩️",
    "USMNT Power Rankings: Who'll make the 2026 World Cup squad?",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Dempsey, Donovan & USMNT's all-time leading goalscorers",
    "How many goals has Christian Pulisic scored for USA?",
    "Pulisic told 'Bundesliga fits him best' amid Dortmund links",
    "CONCACAF GOLD CUP 2023 squads: All 16 team rosters",
    "Bayern cancel Rangers' buy-option on Tillman",
    "Lewandowski's crazy goalscoring stats in full",
    "Ronaldo, Messi, Pele & the top scorers of all time",
    "Inside Cristiano Ronaldo's insane career goal scoring stats",
    "Ronaldo vs Messi: Who is the GOAT in football?",
    "Wrexham's Tozer jokes rule change will 'ruin my career!'",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Gundogan set to join Barcelona on free transfer from Man City",
    "Inside Harry Kane's impressive goal scoring stats",
    "Los Angeles vs Seattle Sounders",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "New Premier League ball released for 2023-24 season",
    "Barcelona's 10 greatest home kits - ranked",
    "Barcelona 2023-24 home kit inspired by women's team",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]