[
    "Ballon d'Or 2023: Messi to claim eighth Golden Ball",
    "Six midfielders who are better fits for Man Utd than Mount",
    "Matt Turner saves the day! USMNT winners & losers",
    "Martino confirms Inter Miami talks on Messi's return to Newell’s",
    "Ted Lasso creators praised for 'significant' gay player storyline",
    "Barca switch the ideal move for world-class Gundogan",
    "WATCH: Turner saves USMNT by keeping out Bailey penalty",
    "Transfers LIVE: Man Utd make contact with Rabiot",
    "Getty/GOAL/Twitter-@philaunion",
    "WATCH: Inter Miami fan throws Messi banner after '1,200-mile' trip",
    "Another hat-trick! Sophia Smith makes NWSL history 🔥",
    "Boost for Man Utd as Chelsea refuse to pay £80m for Caicedo",
    "Revealed: When Man Utd will table €50m bid for Onana",
    "Real Madrid Transfers LIVE: Modric extends with Madrid until 2024",
    "Liverpool Transfers LIVE: Osimhen on Red's radar",
    "Chelsea Transfers LIVE: Milan targeting Loftus-Cheek",
    "Man City Transfers LIVE: Cityzens looking to send Rice's bid",
    "Real Madrid leaving Benzema’s No.9 shirt free for Mbappe",
    "Chelsea's Ruben Loftus-Cheek a 'priority target' for AC Milan",
    "Barcelona forward Geyse wanted by Man Utd to replace Russo",
    "Former Scotland manager Craig Brown dies aged 82",
    "Liverpool to join race for Napoli's Victor Osimhen",
    "Ex-Spurs & Leeds striker Keane named new Maccabi boss",
    "Man Utd to miss out? Rabiot agrees new Juve contract",
    "Why Man Utd should steer clear of mediocre Mount",
    "Man Utd live stream and TV channel broadcast info",
    "See allSee All Breaking News",
    "Why West Ham's stadium has become a baseball field",
    "Sergio Busquets to Inter Miami is a done deal!",
    "United States to host expanded 32-team Club World Cup",
    "Kovacic undergoes Man City medical ahead of £25m move",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Home delivery almost saw Morgan miss England World Cup call",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Women's National League - Premier Division",
    "Newcastle make history as first pro team in women's third tier",
    "'It's clear I won’t be playing for England again' - Houghton",
    "Horan breaks Alex Morgan's transfer record with Lyon move",
    "How the USWNT should line up at the World Cup",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "10 moments that prove Gundogan is a Man City legend",
    "The Irish youngster Wayne Rooney has tipped for superstardom",
    "Soccer Cities 23: The best football destinations for fans",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "‘What makes football special’ – Neville enjoys Wrexham’s rise",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Arsenal set Balogun price amid Crystal Palace interest",
    "Man Utd could be boosted by Martinez return for U.S. tour",
    "Arsenal sent Balogun transfer warning by Ramsey",
    "Will De Bruyne be fit for the start of 2023-24? Injury update",
    "Man City launch three hot air balloons to show off treble success",
    "Lewandowski's crazy goalscoring stats in full",
    "Should Man Utd give up on Mason Mount?",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "'I'm very excited' - Messi raring to go with Inter Miami",
    "Messi shares family pictures as Inter Miami star turns 36",
    "NYRB vs Atlanta United: Stream, TV channels & where to watch",
    "Explained: Why Messi could take one year off Argentina duty",
    "Rooney savagely shuts down Lingard to D.C. United talk 😳",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]