[
    "Man Utd must go all out to sign ideal goalkeeper Onana",
    "USMNT winners & losers of Berhalter's controversial return",
    "USMNT Power Rankings: Who'll make the 2026 World Cup squad?",
    "Kovavic has won the lottery with £25m Man City move 👏",
    "USWNT Women's World Cup roster: Who will be picked?",
    "Transfer LIVE: Man Utd's swap-deal plan to land Rice",
    "EXCLUSIVE: USWNT star Davidson on the World Cup & more",
    "PSG managerial chaos a clear sign of a broken club",
    "Lindsey Horan announces engagement to Tyler Heaps",
    "21 top talents to watch at the U21 Euros",
    "Carrasco says Belgium squad are 'disappointed' with Courtois",
    "England all-time top goalscorer: Kane leaves Rooney behind",
    "How many goals has Kane scored for England?",
    "Inside Harry Kane's impressive goal scoring stats",
    "Inside Rashford's career goalscoring numbers",
    "Victor Osimhen's impressive career stats in full",
    "Man City's move for Rice could see Phillips head to West Ham",
    "How many goals has Haaland scored in his career?",
    "Dempsey, Donovan & USMNT's all-time leading goalscorers",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Are Chelsea making a huge £90m mistake?",
    "Mbappe vs Haaland: Who is the future GOAT?",
    "How to watch UFC and Bellator MMA: channels & streaming options",
    "How many goals has Christian Pulisic scored for USA?",
    "Will Wrexham lose Tom O'Connor? Phil Parkinson speaks out",
    "See allSee All Breaking News",
    "Son aims sly dig at Ronaldo as he snubs Saudi Pro League",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "Nearly a third of players in WWC qualification were not paid",
    "Women's World Cup 2023: Ticket prices & where to buy",
    "'I pretended I was a boy to play football' - England icon Yankey",
    "Why Barca stars aren't in Spain Women's World Cup squad",
    "Batlle returns to Barca as Man Utd offer arrives too late",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Havertz to Arsenal makes zero sense - he's not good enough!",
    "Richarlison's misery continues in Brazil defeat 😬",
    "Ronaldo rides to Portugal's rescue on dream 200th cap",
    "Another attacker?! Where Nkunku best fits for Chelsea 🧩️",
    "Seven midfielders Barca should target to replace Busquets",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Pulisic told 'Bundesliga fits him best' amid Dortmund links",
    "CONCACAF GOLD CUP 2023 squads: All 16 team rosters",
    "Bayern cancel Rangers' buy-option on Tillman",
    "Pep's savage dig at Lukaku after Champions League final miss",
    "Any regrets? Grealish reacts to ‘once in a lifetime’ party",
    "Man Utd lodge second Mount bid - but Chelsea table counter-offer",
    "Arsenal to sign Kai Havertz for £65m",
    "Kovacic to complete £30m Man City transfer",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Arsenal & adidas suspend 2023-24 shirt sales after design blunder",
    "Haaland posts hilarious towel selfie after Norway win 🤣",
    "Inter Miami chants: The most popular Vice City songs",
    "Messi’s new Inter Miami team-mate hospitalised after spider bite",
    "When will Messi make his Inter Miami & MLS debuts?",
    "Kluivert explains why Messi has risen above Maradona & Pele",
    "Right move? Guardiola reacts to Messi's Inter Miami transfer",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "New Premier League ball released for 2023-24 season",
    "Barcelona's 10 greatest home kits - ranked",
    "Barcelona 2023-24 home kit inspired by women's team",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]