[
    "USMNT Power Rankings: Who'll make the 2026 World Cup squad?",
    "EXCLUSIVE: USWNT star Davidson on the World Cup & more",
    "Havertz to Arsenal makes zero sense - he's not good enough!",
    "21 top talents to watch at the U21 Euros",
    "Transfers LIVE: Kane hoping for Man Utd move",
    "Inter Miami owner teases HUGE triple transfer",
    "Boehly finally gets one right with Chelsea's £53m Nkunku move",
    "Lindsey Horan announces engagement to Tyler Heaps",
    "Portugal ratings: Ronaldo enjoys dream 200th cap!",
    "Seven midfielders Barca should target to replace Busquets",
    "Man Utd Transfers LIVE: Red Devils agree to sell academy wonderkid",
    "Phillips reveals plans for crunch City talks with Pep",
    "All completed Premier League transfers in 2023-24",
    "Explained: Why Scotland vs Georgia was suspended",
    "Brazil player ratings: Richarlison's misery continues 😬",
    "All completed La Liga transfers in 2023-24",
    "Neymar is desperate to return to Barcelona!",
    "Son aims sly dig at Ronaldo as he snubs Saudi Pro League",
    "Wrexham could move for former Man Utd man",
    "Revealed: When Broja is expected to play for Chelsea again",
    "Man City submit £25m bid for Chelsea's Kovacic",
    "CONCACAF GOLD CUP 2023 squads: All 16 team rosters",
    "'Devil Baby' who stalked Mount & Chilwell spared jail",
    "Explained: Why West Ham rejected Arsenal's £90m Rice bid",
    "Brighton among PL clubs considering Adams move",
    "See allSee All Breaking News",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "Dias was sick in Grealish’s mum’s handbag after two shots! 🤮",
    "Women's World Cup 2023: Ticket prices & where to buy",
    "'I pretended I was a boy to play football' - England icon Yankey",
    "Why Barca stars aren't in Spain Women's World Cup squad",
    "Batlle returns to Barca as Man Utd offer arrives too late",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "'Stuck with me' - Toone's message to Russo after Man Utd exit",
    "Another attacker?! Where Nkunku best fits for Chelsea 🧩️",
    "The must-see NZ cities hosting the Women's World Cup",
    "England Power Rankings: Alexander-Arnold on the rise",
    "Have Man Utd found their very own Erling Haaland?!",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Bayern cancel Rangers' buy-option on Tillman",
    "‘His dad’s David Beckham!’ - Hickey on bromance with Romeo",
    "‘Squeaky bum time’ – Reynolds learning important phrases",
    "USMNT star Musah 'wasn't shocked' by racist abuse of Vinicius",
    "Pep's savage dig at Lukaku after Champions League final miss",
    "Any regrets? Grealish reacts to ‘once in a lifetime’ party",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Norway boss glad Haaland didn't party in 'the Grealish way'",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "When will Messi make his Inter Miami & MLS debuts?",
    "Kluivert explains why Messi has risen above Maradona & Pele",
    "Right move? Guardiola reacts to Messi's Inter Miami transfer",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "Aguero encourages Messi to join his Kings League team",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "New Premier League ball released for 2023-24 season",
    "Barcelona's 10 greatest home kits - ranked",
    "Barcelona 2023-24 home kit inspired by women's team",
    "All the top teams' 2023-24 football kits released so far",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]