[
    "Jose Mourinho is a 'f*cking disgrace'!",
    "USMNT stars set for summer transfers",
    "Transfers LIVE: Real Madrid target Havertz as Chelsea want €100m",
    "This is how Man Utd can win the FA Cup final 👀",
    "Keep loan or sell? Players Arsenal should allow to leave",
    "'F*ck those guys!' - Inside the NWSL's biggest & best rivalry",
    "21 best players of the European season - ranked",
    "Lingard's move to Forest was a DISASTER!",
    "Messi's doomed PSG move driven by nothing but money",
    "UEFA Women's Champions League",
    "Lucy Bronze: England's greatest-ever women's footballer?",
    "Guardiola warns Man City fans to have 'right portion of beer'",
    "The strange reason Bari reached Serie B play-off final",
    "Ruthless Ten Hag tells snubbed FA Cup players: 'Deal with it'",
    "Ramos follows Messi out of PSG after disappointing spell",
    "Lingard jets off to Barbados following Forest release",
    "Haaland: Man City bought me to win the treble",
    "Debate: Would any Man Utd players get in Man City's team?",
    "WATCH: Klopp, Salah & Liverpool stars bid farewell to Firmino",
    "13 fun facts about Joshua Kimmich",
    "Maguire praises fans ahead of potential final Man Utd game",
    "Chelsea Transfers LIVE: Blues hold meeting to convinve Ugarte",
    "Casemiro confirms he texted agent vowing to 'fix' Man Utd",
    "Arsenal Transfers LIVE: Gunners interested in PSV star",
    "Casemiro: I've never argued with Bruno Fernandes",
    "Weghorst: I'm saving my goals for Man City!",
    "See allSee All Breaking News",
    "Benzema to stay at Real Madrid despite Saudi Arabia offer",
    "'City will beat terrible United & win the treble' | Front Three",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "Graham Hansen: We are lucky to have Walsh at Barca 🤩",
    "GOAL's women's Team of the European Season",
    "Explained: Spain women's team 'mutiny'",
    "Will Barca star Putellas play at the World Cup?",
    "Lauren James signs new four-year Chelsea deal ✍️",
    "The best Barca team ever? UWCL finalists can match Messi & co 🙌",
    "21 best women's players in Europe this season - ranked",
    "10 players most likely to join Man City this summer",
    "Why Liverpool are fighting to sign Khephren Thuram",
    "Benzema's top 10 Real Madrid moments - ranked",
    "GOAL's U23 Team of the Season",
    "Combined XI: The treble winners vs the treble chasers",
    "All the top teams' 2023-24 football kits released so far",
    "Introducing the AC Milan 2023-24 home kit",
    "AC Milan 2023-24 kit: New home, away & third jersey details",
    "Introducing all the 2023 Women's World Cup kits",
    "Nike unveil PSG 2023-24 home kit",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "'Not very good' - USMNT stars blamed for Leeds relegation",
    "West Ham walk off from Dallas match over alleged racial slur",
    "Where to watch & stream CONCACAF Gold Cup",
    "Balogun gets USMNT call up for Nations League finals",
    "Feyenoord submit opening bid for USMNT forward Pepi",
    "Getty/EA Sports/GOAL composite",
    "EA Sports FC: Release date, consoles & updates",
    "Who is Champions League final referee Szymon Marciniak?",
    "WATCH: Pep fulfils ‘dream’ of seeing Elton John live 🕺",
    "Manchester City vs Internazionale",
    "When did Inter last win the Champions League?",
    "Liverpool Transfers LIVE: Adrian set to continue at Anfield",
    "Chelsea-linked Rafael Leao is going nowhere!",
    "Phil Neville sacked by Inter Miami after barren run",
    "Father’s Day gifting sorted with MobyFox x MLS",
    "Copa Libertadores Play-off",
    "Football to watch in summer 2023: Competitions, leagues & TV channels",
    "Vancouver Whitecaps vs Houston Dynamo: Stream, TV channels & where to watch",
    "Seattle Sounders vs San Jose Earthquakes: Stream, TV channels & where to watch",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]