[
    "It's time for PSG to sell Kylian Mbappe",
    "Soccer Cities 23: The best football destinations for fans",
    "Cowell and Slonina headline USMNT Gold Cup squad",
    "Messi in MLS: Beckham's Inter Miami revolution",
    "Winners & losers of the 2022-23 European season",
    "Transfers LIVE: Chelsea set to register Mbappe interest",
    "Can Inter Miami survive until Messi arrives?",
    "Every Man City player in the 2022-23 season - ranked",
    "Lukaku to join CR7 in Saudi? Al-Hilal move for Chelsea striker",
    "Rain on Man City's parade! Weather dampens treble party",
    "‘Zlatan was bleeding a lot!’ - Klopp’s ruthless side exposed",
    "Rashford spotted bringing 'Big Booty' lecturer back to Miami hotel",
    "Could Garnacho still ditch Messi & Argentina for Spain?",
    "Man Utd shares skyrocket amid Sheikh Jassim takeover claims",
    "Barcelona Transfers LIVE: Barca to sell multiple big names!",
    "Liverpool Transfers LIVE: Reds want Ward-Prowse",
    "Chelsea Transfers LIVE: Koulibaly to Saudi Arabia?",
    "Revealed: Role of ‘spiritual leader’ Ronaldo in Al-Nassr training",
    "adidas release limited edition Italy 125 anniversary kit",
    "Zidane talks up 'logical' prospect of becoming France manager",
    "Explained: Why Brooks is not in USMNT Gold Cup squad",
    "Struggling Mudryk impresses Poch with shock U21 decision",
    "Explained: Why Carlo Ancelotti has sued Everton in high court",
    "WATCH: 'Don't go' - Grealish begs Bernardo to stay at Man City",
    "Wrexham’s U.S. tour includes Philly homecoming for McElhenney",
    "See allSee All Breaking News",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Benzema explains key reason behind Al-Ittihad move",
    "EXCLUSIVE: Alexander-Arnold talks Messi, Salah and Liverpool",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "Germany Women's World Cup 2023 squad: Who's in & who's out?",
    "Putellas back just in time for Spain as WWC squad revealed",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "England's Women's World Cup send-off friendly is confirmed ✅",
    "When are England Women's fixtures in 2023?",
    "Will Macario play for USWNT at the 2023 Women's World Cup?",
    "USWNT star Macario is perfect for Chelsea - despite the risks",
    "Berlusconi: Most divisive & successful football president",
    "From the Pope to prostitutes: Berlusconi's most famous quotes",
    "Messi rejecting Barca is a blessing for Xavi's team",
    "Ballon d'Or 2023: Did Haaland do enough to catch Messi?",
    "Pep's masterpiece: How Man City won the treble",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Quiz: How well do you recall the Premier League 2022-23?",
    "Ex-USMNT boss Berhalter makes shortlist for Eredivisie job",
    "London or Miami? Romeo Beckham in future talks with Brentford",
    "WATCH: Mullin’s stunning solo effort wins Goal of the Season",
    "Who has qualified for Champions League 2023-24?",
    "Guardiola compares City Treble to Messi World Cup win",
    "Manchester City vs Internazionale",
    "'Ever won the Treble? Have you f*ck!' - Grealish leads chant",
    "Man City fans share horror stories from Champions League final",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Tell us: Who should Madrid sign to replace Benzema? 🤔",
    "Getty/GOAL/IG-@6ourt@marcusrashford",
    "MLS manager Arena 'could live with' Messi rule exception",
    "Messi's arrival to MLS doesn't scare Carlos Vela",
    "Guardiola's next job could be in MLS with NYCFC - Twellman",
    "De Jong disappointed to be denied Messi reunion at Barca",
    "Who else? Neymar expects more talent to follow Messi to MLS",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Soccer cleats: latest releases in 2023",
    "adidas launch all-new X Crazylight boot",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]