[
    "Balogun leads the line! Who the USMNT should start vs Mexico",
    "The new USMNT: Balogun's debut and Reyna in midfield?!",
    "The Saudi Pro League: A new power or a retirement league?",
    "Where next for Pulisic? USMNT star's best landing spots",
    "The summer transfer window is open! 50 players to watch",
    "BBC & ITV finally agree Women's World Cup broadcast deal",
    "Transfers LIVE: Chelsea contact Brighton over Caicedo move",
    "Could Bellingham come to regret Real Madrid move? 👀",
    "Why Messi won't play for Argentina vs Indonesia - explained",
    "Mourinho rejects approach from Saudi side Al-Ahli",
    "Man City Transfers LIVE: Gvardiol likely to join Cityzens this summer",
    "Lalas on 'orgasmic' goal vs England that changed his career",
    "Premier League fixtures leaked - or is it an elaborate hoax?",
    "Newcastle edging towards stunning £50m deal for Barella",
    "Netherlands vs Croatia : Lineups and LIVE updates",
    "Man Utd make their move! Chelsea reject £40m bid for Mount",
    "Manchester United DROP Harry Kane interest",
    "Grealish reacts as England cricketer Stokes copies iconic pose",
    "Wrexham announce 'incredible' season ticket renewal rate",
    "China Women's World Cup 2023 squad: Who's in & who's out?",
    "Arsenal launch unexpected bid for Chelsea's Havertz",
    "All completed PSG transfers so far in 2023-24",
    "Ben Foster urges ex-Man Utd star Nani to join Wrexham",
    "See allSee All Breaking News",
    "Big MatchNetherlandslive1 - 1Match DetailsCroatia",
    "One Future Football Launches World’s First Global, Digital Football League",
    "Camavinga would be 'very happy' to have Mbappe at Madrid 👀",
    "'Hang it in the Loooouvre' – Treble party never ends for Grealish",
    "Former Milan president Berlusconi passes away at age of 86",
    "£33,000 for a drink with Messi! Chinese fans warned of scams",
    "Explained: Spain women's team 'mutiny'",
    "Spain Women's World Cup 2023 squad: Who's in & who's out?",
    "Italy Women's World Cup 2023 squad: Who's in & who's out?",
    "Germany Women's World Cup 2023 squad: Who's in & who's out?",
    "Putellas back just in time for Spain as WWC squad revealed",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "Bellingham, Beckham & English stars to wear Madrid white ⚪",
    "Madrid's midfield headache: Should Bellingham even start?!",
    "Rosicky, Nedved & Prague's football legends 🇨🇿",
    "Soccer Cities guide to the Prague derby",
    "Chelsea's summer clear-out has gotten off to a terrible start",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Ex-USMNT coach Berhalter contacted by Club America",
    "Aaronson focused on USMNT duty amid transfer rumors",
    "WATCH: Balogun struggles at golf - but impresses USMNT anyway",
    "USMNT legend Lalas opens up on ‘the hurricane of Beckham’ 🌀",
    "Still hungover, Jack?! Grealish & treble-winners join England",
    "Mbappe bemoans PSG 'shortcomings'",
    "'Sh*tty feeling' - Lukaku's emotional message to Inter fans",
    "Who has qualified for Champions League 2023-24?",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Chelsea Transfers LIVE: Pochettino wants Kepa to stay",
    "Alba has 'clear conscience' over Barca exit & hints at PL move",
    "Messi's World Cup announcement was 'logical' - Scaloni",
    "Messi loses Inter Miami strike partner as Jean suffers ACL blow",
    "'I will be booed' - Wrexham's McElhenney on Philly homecoming",
    "Messi & Alba reunion?! Inter Miami contact Barca defender",
    "Messi reveals two players who inspired free-kick technique",
    "All the top teams' 2023-24 football kits released so far",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "Real Madrid 2023-24 kit: New home, away & third jersey details",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "adidas release limited edition Italy 125 anniversary kit",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]