[
    "Where it all went wrong for Barca flop Arda Turan",
    "Turner the shootout hero as USMNT win Canada thriller",
    "Milan the perfect stage for Pulisic to prove himself",
    "Rodman dominates to make USWNT World Cup statement",
    "Jones' assist of dreams proves USMNT newcomer is for real!",
    "Who should be Chelsea's new captain? The candidates ranked",
    "Exclusive: Mullin has barely seen any of Reynolds' films!",
    "Transfers LIVE: Bayern submit new £70m Kane bid",
    "Ruthless Ten Hag's right to get rid of De Gea",
    "USMNT star Aaronson joining Europe's most interesting club!",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Real Madrid Transfers LIVE: Xabi Alonso eyed as Ancelotti replacement",
    "Explained: Two reasons why Barcelona ruled out Neymar move",
    "Offer made! Liverpool ace Thiago holds talks with Galatasaray",
    "Man Utd Transfers LIVE: Red Devils to submit bid for Onana this week",
    "USMNT star Matt Turner pays tribute to teenager cancer patient",
    "Maguire training with Ricardo Carvalho to win place back at Man Utd",
    "Pogba to reunite with Kante & Benzema at Al-Ittihad?",
    "Man Utd live stream and TV channel broadcast info",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Mbappe told to leave PSG in shocking Leonardo rant",
    "Beckham whitens Messi's teeth on HUGE mural in Miami 😅",
    "Timber's brother appears to confirm Arsenal transfer 👀",
    "Soccer Champions Tour: How to buy tickets",
    "USMNT & Arsenal striker Balogun back on RB Leipzig's radar",
    "See allSee All Breaking News",
    "USWNT legend Rapinoe makes shock retirement announcement",
    "Pochettino got Chelsea job after bizarre Zoom meeting",
    "EXCLUSIVE: England's Stanway on Euros glory & inspiring a nation",
    "Xhaka joins Leverkusen in €25m move from Arsenal",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "Bronze reveals Lionesses' frustration over WWC bonuses",
    "Zambia Women's World Cup 2023 squad: Who's in & who's out?",
    "Horan and Morgan named USWNT captains ahead of World Cup",
    "Netherlands WWC 2023 squad: Who's in & who's out?",
    "Morocco Women's World Cup 2023 squad: Who's in & who's out?",
    "'I want to be known as Lauren James' 🙌",
    "Trafford the hero as England are crowned kings of Europe!",
    "How the USMNT should line up vs Canada",
    "Time for Foden to move back into Man City's midfield",
    "Eight big PSG problems Luis Enrique has to solve",
    "Pulisic can be a big hit at AC Milan",
    "USMNT star Reyna emerges as a target for Monchengladbach",
    "USMNT vs Canada: Stream, TV channels & where to watch",
    "'Fantastic player' - Thiago Silva backs Pulisic's Milan move",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Getty/GOAL/IG-victoriabeckham",
    "Winless in 10! When will Messi’s new side Inter Miami snap run?",
    "MLS over Milan? Pulisic told he should’ve followed Messi",
    "LA Galaxy vs Philadelphia: Stream, TV channels & where to watch",
    "Los Angeles vs SJ Earthquakes: Stream, TV channels & where to watch",
    "All the top teams' 2023-24 football kits released so far",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "PSG's 10 greatest away & third kits - ranked",
    "Soccer cleats: latest releases in 2023",
    "PSG 2023-24 kit: New home, away & third jersey details",
    "Guess who's back? John Terry confirms return to Chelsea",
    "UEFA Europa Conference League",
    "When does TNT launch in the UK?",
    "Grealish Treble party is still going! City star back in Ibiza",
    "What is a 'Group of Death' in soccer?",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid"
]