[
    "The Guardian - Back to home",
    "President signs debt ceiling bill after months-long standoff, avoiding default",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to state's shoreline",
    "Brazil river where illegal fishing threatens lives",
    "Passengers tell of India train crash horror after 288 killed and 803 injured",
    "Trump-appointed judge says anti-drag law is unconstitutional",
    "Florida governor thanks then attacks heckler who called him a fascist",
    "PM under fire as ‘stupid’ Eat Out to Help Out scheme to be focus of Covid inquiry",
    "Makers of Lightyear flop among job cuts by Disney",
    "New drug combination offers breakthrough",
    "Gisele Barreto Fetterman, wife of US senator, hits out",
    "How the largest US power firm avoided a trial for a deadly wildfire",
    "The nightly vigil to sanctify January 6 rioters",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Modi has spent billions on rail but safety is biggest need",
    "English pubs forced to close after owners demand full rent for lockdown",
    "Here’s what AI doomsday would look like",
    "Noosa’s nude beach crackdown reveals uncomfortable trend for Australia's naturists",
    "School district that banned Bible considers removing Book of Mormon",
    "‘I don’t believe a writer should just keep writing as long as they’re alive’",
    "How the placenta project is unlocking the secrets of our cells",
    "The Indigenous forager reconnecting Native Americans with their roots",
    "Seaside community unites to restore vandalised statue of Black woman",
    "Zelenskiy says Ukraine ready to launch counteroffensive",
    "Pro-Kyiv forces ‘still fighting in Belgorod’ despite Moscow claims",
    "What we know on day 465 of the invasion",
    "Fatigue and frayed nerves grip Kyiv as city shelters from nightly Russian raids",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Buff billionaires are latest sign that bulk is now beautiful for male body image",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "What draws US tourists to Slovenia? Surely not the ill-fated Venus de Melania",
    "Twitter’s rightwing takeover is complete. Why are liberals still on it?",
    "A lawyer got ChatGPT to do his research, but he isn’t AI’s biggest fool",
    "Gauff banks on experience to score comeback win against Andreeva",
    "Breaking down a most unexpected Stanley Cup final",
    "Football Daily Get our free and funny email. OK, our free email",
    "Manchester City beat Manchester United to win Double",
    "Verstappen on pole as Russell and Hamilton clash",
    "Kipyegon smashes 1500m world record in Florence",
    "Manager facing touchline ban after Uefa charge for referee abuse",
    "McLaren's move for Marshall shows will to win intelligence war",
    "Taylor caught in Mourinho’s toxic trail but problem runs deeper",
    "Can Mediterranean holidays survive?",
    "Chemical giant Syngenta secretly pushed to bury a weedkiller’s link to Parkinson’s disease",
    "Top US chemical firms to pay $1.2bn to settle water contamination lawsuits",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Teacher Tasered by LAPD died from enlarged heart and cocaine use",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "How Amazon and Google fund anti-abortion lawmakers",
    "Man arrested and charged with death threat to US senator",
    "Tiananmen massacre museum opens despite fear of Beijing backlash",
    "Lawyers demand judge in New York hush-money case step aside",
    "Protest over assembly at LA school turns violent",
    "Georgia gun shop owner to close store as US reels from mass killings",
    "US air quality as far south as Virginia affected",
    "US won’t stand for Beijing's ‘bullying’, Lloyd Austin tells conference",
    "Police detain eight people on eve of Tiananmen anniversary",
    "Holdout tenant halts developer’s push to force her out",
    "Why two luxury London homes are at the centre of the country's turmoil",
    "Irish town unites in smartphone ban for young children",
    "President Recep Tayyip Erdoğan announces new cabinet",
    "Thousands rally in Belgrade against government and culture of violence",
    "Government endorsed e-cigarette firm accused of fuelling underage vaping",
    "One dead and two missing as thousands urged to evacuate in Japan",
    "Humpback whale freed after gruelling eight-hour rescue mission",
    "Imran Khan’s political games leave him isolated as army destroys party",
    "How Beyoncé’s gigs are the new designer catwalk",
    "Paul McCartney on his lost photos of Beatlemania",
    "A history of Hollywood’s favourite queer character",
    "A dizzying, dazzling sequel",
    "The rise of the menopause novel",
    "How podcasts took over the world in 20 years",
    "‘If there’s wine on the table, sex is absolutely happening’",
    "Yotam Ottolenghi’s picnic and camping recipes",
    "My life as a barrister in badly behaved Britain",
    "How I turned the page after getting divorced in my 30s",
    "We lived in different cities but even in the same room, I missed him",
    "‘We seem to have slipped into another time’: a walking holiday on the Scilly Isles",
    "People are going homeless in this Victorian getaway spot. Could an Airbnb tax be the answer?",
    "The truth about our electronic waste",
    "The British Vogue editor who keeps pushing boundaries",
    "Optimism is high for Bangkok Pride after Thai elections",
    "The multinational companies that industrialised the rainforest",
    "Why were Italian and Israeli secret service agents on a boat in northern Italy?",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Russian airstrikes in Kyiv, a shaky ceasefire in Sudan and protests in Senegal",
    "Milky Way photographer of the year 2023",
    "From owl chicks to hungry brown bear cubs",
    "Pastel-coloured homes for sale",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Wailing for help’: passengers and bystanders tell of India train crash horror",
    "‘Extra Trumpy’: Atlantic profile of CNN chief Licht details town hall disaster",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "Ron DeSantis thanks then attacks heckler who called him a fascist",
    "‘Suddenly, we were in Wonderland’: Paul McCartney on his lost photos of Beatlemania",
    "US man eats McDonald’s three times a day for 100 days – and the weight falls off",
    "‘I’m not used to seeing sex that kinky’: Is The Idol the most shocking TV of the year?",
    "California woman finds foot-long ancient mastodon tooth on beach"
]