[
    "The Guardian - Back to home",
    "Ukraine A visual guide to the collapse of Nova Kakhovka dam",
    "Full report Thousands flee homes as dam collapse is blamed on Russia",
    "'Catastrophe' Dam breach could be Ukraine’s ‘worst ecological disaster since Chornobyl’",
    "Russia-Ukraine war: Zelenskiy says dam attack an ‘environmental bomb of mass destruction’",
    "Explained Nova Kakhovka dam: everything you need to know",
    "As flood waters rise around them, Kherson residents cast blame for destroyed dam on Moscow",
    "‘A biblical deluge’: people along Dnipro river wake up to catastrophe",
    "Devastation from dam collapse could take decades to heal",
    "Live Chris Christie files papers to run for US president ahead of official campaign launch tonight",
    "Ex-New Jersey governor launches 2024 presidential run",
    "Biden ‘knew of Ukrainian plan to attack it’ three months before explosion",
    "Trump and Mickelson praise LIV-PGA merger as 9/11 families hit back",
    "US urged to reveal evidence after claim that it has intact alien vehicles",
    "LGBTQ+ Americans living in state of emergency, group warns",
    "Britain’s government and press at rock bottom, royal tells court",
    "Painter and muse to Picasso dies at 101",
    "Group listed as ‘anti-government’ by extremism watchdog",
    "Republican ordered to reveal identities of mystery bond guarantors",
    "Walking and yoga ‘can cut risk of cancer spreading or returning’",
    "The LGBTQ+ families fleeing red states",
    "PGA’s ‘merger’ with LIV can’t be seen as anything other than a Saudi victory",
    "What you need to know about the Binance and Coinbase lawsuits",
    "Apple’s Vision Pro VR is incredible technology but is it useful?",
    "Is Hannah Gadsby’s Picasso exhibition really that bad?",
    "From the gents to the witness box – Harry has little to say",
    "Astrud Gilberto, The Girl from Ipanema singer",
    "America is obsessed with striving. Is it time to redefine it?",
    "Ezra Miller’s doppelganger-superhero is a gurning, smirking mess",
    "Why an independent abortion clinic is suing Planned Parenthood",
    "25 years of Sex and the City nailing life as a single woman",
    "At 12, I was in Auschwitz. My parents and seven siblings were murdered. Here is how I built a life",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "States haven’t stopped spying on their citizens, post-Snowden – they’ve just got sneakier",
    "Ukraine’s counteroffensive: even success has a cost",
    "Climate risks have made California uninsurable. When will we wake up?",
    "AI bots chatting up matches on dating apps? This won’t end well",
    "Golf PGA, LIV and DP World Tour agree to make shock merger",
    "‘An awesome day’ Mickelson's joy but 9/11 families hit back",
    "PGA Tour Hovland beats McCarthy in Memorial playoff",
    "Sabalenka denies backing Belarus dictator after reaching semi-final",
    "Inter Miami would be a dubious landing spot for Messi",
    "Benzema leaves Real Madrid with legacy secure",
    "Djokovic roars into last four with victory over Khachanov",
    "The brutal realities of life in MLR",
    "Kanté offered annual salary of up to $106m to join Saudi club",
    "Golden Knights put seven past Panthers for 2-0 lead",
    "Too late now to save summer ice, scientists find",
    "First steps agreed on plastics treaty after breakthrough at Paris talks",
    "Carbon capture and storage is ‘no free lunch’, warns climate chief",
    "Microplastics found in every sample of water taken",
    "Sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "City approves funding to build ‘Cop City’ despite fierce opposition",
    "US founder of ‘orgasmic meditation’ startup indicted on forced labor charges",
    "Harvard affirmative action challenge partly based on Holocaust denier’s work",
    "SEC accuses cryptocurrency exchange of breaking US regulations",
    "‘Sharp and broad decline’ in US rate, research shows",
    "Actor settles New York rape lawsuit, averting trial",
    "Man to be executed for killing two jailers in failed escape plot",
    "Black woman in Florida shot dead through front door by white neighbor",
    "Son of late CIA director cautions against growing extremism in the US",
    "China begins drilling one of world’s deepest holes in hunt for discoveries deep inside the Earth",
    "Singer of German band accused of recruiting fans for sex",
    "Pope Francis visits hospital in Rome for tests",
    "Tehran claims to have created long-range hypersonic missile",
    "Syphilis cases at highest level for 75 years last year",
    "Poorest countries are biggest losers from economic shocks, says World Bank",
    "Reintroduction of endangered vulture in Spain paused over planned windfarm",
    "Rightwing governor of Lazio region withdraws backing for pride parade",
    "Businessman hit with €121,000 speeding fine",
    "Election of Delfina Gómez as governor of Mexico state signals decline of PRI",
    "What is the UK government hiding from the Covid inquiry?",
    "Listen to previous episodes",
    "The Girl from Ipanema singer dies aged 83",
    "The best albums of 2023 so far",
    "Giant woodland gateau is an absurd slice of joy",
    "Limp, lifeless robot sequel",
    "Arnold Schwarzenegger expresses regret over groping claims",
    "The thrilling Icelandic soundscapes of Anna Thorvaldsdottir",
    "Is the Vision Pro more than just another tech toy for the rich?",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "The ultimate panacea – or wildly overhyped?",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Why it is time to embrace your quilt – without the guilt",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "George Floyd's uncle on three years of heartbreak and fighting for justice",
    "AI boosts climate information translation drive",
    "How my father’s dementia echoed my own alcoholism",
    "Judgment against Australia SAS soldier shows few have ever fallen so far",
    "Father of teen killed in Alabama mass shooting speaks out",
    "Prince Harry at court and D-day ceremonies",
    "50th World Environment Day",
    "Life under the Sicilian mafia",
    "The church at the end of the world – photo essay",
    "The everyday art of glassware",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Biden ‘knew of Ukrainian plan to attack Nord Stream’ three months before explosion",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Russia-Ukraine war live: Zelenskiy says dam attack an ‘environmental bomb of mass destruction’",
    "Texas sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "Singer of German band Rammstein accused of recruiting fans for sex",
    "Britain’s government and press at rock bottom, Prince Harry tells court"
]