[
    "The Guardian - Back to home",
    "Nike may have misclassified workers and could face over $530m in tax fines",
    "Pentagon’s cleanup budget falls ‘dramatically’ short",
    "Conspiracy theorists to address House subcommittee, watchdog warns",
    "‘Duke (and Duchess) of hazard’ How US and UK press covered the Harry and Meghan car chase story",
    "Security ‘should have been properly stage-managed’",
    "Russia-Ukraine war: Wagner chief accuses Russian army of leaving his troops exposed in Bakhmut",
    "At least nine dead and 20,000 homeless in worst flooding in 100 years",
    "Deutsche Bank agrees to pay $75m to settle lawsuit",
    "Japan PM prepares push in Hiroshima for G7 pledge",
    "Doctors depart as attorney general investigates hospital’s gender-affirming care",
    "Top five hoard $9bn tax-free for retirement as workers face limits",
    "Schiff ‘not backing down’ in face of Republican bid to expel him",
    "US child killings have risen rapidly – why are more states pushing for joint custody laws?",
    "Montana State becomes first in US to ban TikTok",
    "Why has it happened and will it work?",
    "Dancers at club to become the US’s only unionized strippers",
    "Blues singer gets high school diploma decades after being expelled for his hair",
    "Residents on life in Mariupol a year since Russian occupation",
    "What we know on day 449 of the invasion",
    "Moscow court orders arrest of Oscar-nominated film producer for criticism of war",
    "Mercenary who fought for Russia in Ukraine jailed",
    "Taco Bell battles to ‘liberate’ trademarked phrase",
    "Increasingly sophisticated and deadly",
    "RK Russell on coming out in the male world of football",
    "The everlasting appeal of giant art panoramas",
    "How to start dating again after heartbreak",
    "Convoluted but charming Netflix teen series",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "It’s time to guarantee healthcare to all Americans as a human right",
    "The US debt ceiling crisis is more proof of Republicans’ cynicism and bad faith",
    "Let’s teach children about slavery properly by connecting it to our present",
    "If Macron doesn’t know why he’s despised, he hasn’t been listening",
    "I have unsavoury habits in the kitchen – but don’t we all?",
    "Assad’s regime took my father. Normalising relations feels like an attempt to rewrite history",
    "The fall of Rudy Giuliani, once the toast of New York, continues unabated",
    "I left my party lifestyle behind for a week in a nunnery – and began to see the light",
    "Heat strike first against Celtics in East finals behind Butler’s masterclass",
    ": RK Russell on coming out in the male world of football",
    "Man City 4-0 Real Madrid (agg: 5-1) Silva leads march into Champions League final",
    "Manchester City’s destruction of Real Madrid has the feel of an era-defining triumph",
    "Enciso, Almirón and the clash captivating a country",
    "Blue Jays’ Jackson says he was tipping pitches against Yankees’ Judge",
    "The San Antonio Spurs won the draft lottery. So did Victor Wembanyama",
    "LIV rebels can shake up Ryder Cup reckoning",
    "Power lies with two superteams. But that’s not necessarily a bad thing",
    "World likely to breach 1.5C climate threshold by 2027, scientists warn",
    "Climate breakdown made southern Asia heatwave at least 2C hotter, study finds",
    "Pollution could be slashed by 80% by 2040, UN says",
    "EPA finally wakes up with stiff new climate rules",
    "Can Imran Khan really take on the Pakistani army and win?",
    "Listen to previous episodes",
    "It’s the genuine escape we all need",
    "Stephen ‘Jorbs’ Flavall speaks out on the dark side of Twitch streaming",
    "How one woman raised $100,000 for cancer treatment she never needed",
    "Johnny Depp on comeback trail amid criticism of festival organisers",
    "What the hell is going on with this bizarre editing of Sly’s life?",
    "Ari Aster sends Joaquin Phoenix on an odyssey to nowhere",
    "Russia orders arrest of Oscar-nominated producer for criticism of war",
    "Pedro Pascal and Ethan Hawke sizzle in Almodóvar’s queer cowboy short",
    "Beatriz Milhazes’s carnivalesque odes to nature",
    "I’ve struggled to make friends since moving abroad – and it’s making me lonely",
    "Sweden’s winner, Sunak’s losers and Toyah’s guitar hero",
    "Falling in love with Albania",
    "A brutal attack ended my dreams of being a boxer – but I found a new passion",
    "Cracking modular PC gets all-round upgrade",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "House Republicans sidestep effort to expel fabulist from Congress",
    "Pentagon leaks suspect was warned off viewing classified material – prosecutors",
    "Noam Chomsky and Bard College president had financial dealings with sex offender",
    "Man indicted for stealing Dorothy’s ruby slippers from Wizard of Oz",
    "Avian flu vaccine for California condors approved amid fears of extinction",
    "Conservative judges signal support for anti-abortion plaintiffs in lawsuit",
    "Man sues Trump adviser for false arrest after ‘pat’ on back led to assault charge",
    "US cyclist who taunted fascist group wins plaudits",
    "School district sued for violating first amendment rights with book bans",
    "Walgreens reaches $230m settlement with city over opioids crisis",
    "Injectable HIV-prevention drug to be made in South Africa for the first time",
    "Westpac bans transfers to world’s largest crypto exchange",
    "Iron age roundhouse rises from the ashes on shores of lake",
    "Man arrested and charged with arson after fatal Wellington hostel fire",
    "Assad to attend Arab League summit as west opposes rehabilitation",
    "Imran Khan and Lahore police remain in tense standoff",
    "German carmakers join calls for changes to trade deal",
    "Renovation of Brussels park ignites debate on decolonisation",
    "Indefinite curfew after radio journalist is shot dead",
    "Mishandled baggage rate almost doubled globally in 2022 as airlines scrambled after Covid",
    "Maybe so, but new parents in Iceland are holding out for better",
    "The frantic search for Sudan’s missing",
    "G7 wrestles with how to prosecute one war and prevent another",
    "Could a new brain-based treatment cure hot flushes?",
    "They moved to a Buddhist retreat in rural America. Have they found happiness?",
    "The Texas Democrat fighting for gun control and abortion rights",
    "Navajo cowboys impersonating John Wayne: Roswell Angier’s best photograph",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Harry and Meghan security ‘should have been properly stage-managed’",
    "Schiff ‘not backing down’ in face of Republican bid to expel him from Congress",
    "Top five US executives hoard $9bn tax-free for retirement as workers face limits",
    "Women drinking beer clothed: why are rightwingers melting down over Miller Lite?",
    "Texas doctors depart as attorney general investigates hospital’s gender-affirming care",
    "Conspiracy theorists to address US House subcommittee, watchdog warns",
    "The Family Stallone review – what the hell is going on with this bizarre editing of Sly’s life?"
]