[
    "The Guardian - Back to home",
    "US House adjourns for holiday weekend without deal",
    "Founder of far-right militia sentenced to 18 years over January 6 attack",
    "Moscow moving nuclear warheads to Belarus, says Lukashenko",
    "Romeo and Juliet movie child abuse lawsuit to be thrown out by judge",
    "Ex-guard charged with 95 counts of sexual abuse in women’s prison",
    "Scientists use AI to discover new antibiotic to treat deadly superbug",
    "Republican heads to early primary states after disastrous Twitter launch",
    "Hibernation artificially triggered in potential space travel breakthrough",
    "Rightwing group takes aim at retailer for offering Pride merchandise",
    "Ancient books in northern Italy frozen to salvage them from flood damage",
    "Rwandan war criminal tracked to South Africa",
    "Public weed ban begins in Amsterdam",
    "Full story Cities to pay $80m to people injured in protests",
    "People injured by 2020’s police violence speak out",
    "Man who debunked Mike Lindell’s ‘blatantly bogus’ data wants his $5m",
    "Goodbye to the defining show of the Trump era",
    "‘My guide dog could have gone up to anyone in the pub but he picked Gayle’",
    "Through pain and joy, Tina Turner wrote herself into pop history again and again",
    "I’ve met a man and want to start a family – but I’m scared of penetration",
    "Why have people stopped trusting in science?",
    "The Haitians who built a community in Tijuana – but are still stranded",
    "The strange survival of Guinness World Records",
    "Take our ultimate Succession quiz!",
    "Dutch prosecutors seize land owned by Vladimir Putin’s former son-in-law",
    "US imposes sanctions on leader of Wagner group in Mali",
    "UK to keep assets frozen until Russia pays compensation to Ukraine",
    "WHO members vote to move Moscow office and urge country to stop hospital attacks",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The NAACP says Florida isn’t safe for Black people. Unfortunately, they’re right",
    "Toxins hidden in plastics are the industry’s dirty secret – recycling is not the answer",
    "Orcas are ramming yachts off the Spanish coast – is the whale world rising up?",
    "Is it a triumph for women that Martha Stewart, 81, is a swimsuit star?",
    "What is going on with Elon Musk and Ron DeSantis?",
    "Now’s the time to think about just how bad a DeSantis presidency would be",
    "Premier League United's Champions League joy – reaction",
    "Karen Carney Survival scrap is a watershed moment for trio",
    "Football Daily Guardiola, Lasso and Manchester booze history",
    "Clinical United seal Champions League return",
    "Nascar opens investigation into driver’s hacked radio channel",
    "White-hot USA blank Czech Republic to reach semi-finals at worlds",
    "Holger Rune 'If everybody was the same, it would be a bit boring'",
    "Djokovic and Alcaraz could meet in semi-final as draw is made",
    "Folarin Balogun chose the US over England. He may have created a 2026 contender",
    "Hamilton says he is close to signing new Mercedes deal",
    "How Tina Turner helped changed the face of the game",
    "A’s and Nevada reach tentative deal for $1.5bn ballpark on Vegas strip",
    "Average number of storms predicted despite El Niño",
    "Invasion of Ukraine ‘has fuelled funding boom for clean energy’",
    "Slowing ocean current caused by melting ice could have drastic climate impact, study says",
    "The contentious tool US immigration uses to get your data from tech firms",
    "US supreme court shrinks clean water protections in siding with Idaho couple",
    "Teen dies while climbing bridge in apparent social media stunt",
    "Minority groups warn America of danger from ‘dictator’ DeSantis",
    "Panel hears allegations of years of misconduct by state attorney general",
    "House Democrats laugh off call for ‘decorum’",
    "Utah toddler struck in head by stray bullet at day care while playing outside",
    "Winnie-the-Pooh book teaches kids to ‘run, hide, fight’ in a shooting",
    "Deepfakes are biggest AI concern, says Microsoft president",
    "Park officials kill baby bison after man picked up animal",
    "Man arrested after car crashes into gates of Downing Street",
    "Juror jailed for causing rape trial to collapse by researching defendant online",
    "Disgust over Brazilian mobile phone slavery game",
    "Docking points from clubs would deter racist fans, suggests La Liga president",
    "Three people killed in shooting and knife attack in Nagano",
    "Over 5,000 new species discovered in Pacific deep-sea mining hotspot",
    "Outcry as congress moves to gut environment and Indigenous ministries",
    "Noodle vendor who parodied Salt Bae jailed for ‘anti-state propaganda’",
    "Material found in Portugal search sent for analysis",
    "United Nations official and others in Armenia hacked by NSO Group spyware",
    "How a killing on the New York subway exposed a broken system",
    "Listen to previous episodes",
    "A flawed reminder of when Star Wars was still an event",
    "Wim Wenders explores a quiet life in Tokyo",
    "Evil-hippy horror looks for chills in desert",
    "Could AI write super-intelligent video game characters?",
    "Style-hopping indie duo find focus in chaos",
    "My husband and I are separating – but he doesn’t want anyone to know",
    "Why men lose their friends – and how they can make more",
    "Dua Lipa designs first collection for Versace",
    "South Australian cabernet sauvignon selling for $40 named best in world",
    "Ice-cream with gherkins! Mash sandwiches! Maltesers in wine!",
    "‘She thinks there shouldn’t be private schools - but banning them would be authoritarian’",
    "How his ‘sordid’ diplomacy in Africa fuelled war in Angola and prolonged apartheid",
    "Inside the Thai clinic taking on westerners’ gaming addictions",
    "Will America’s first ‘right to sleep outside’ actually help people?",
    "‘I sat on Diana Dors’s knee and she said: “Aren’t you lovely!”’",
    "How former UK prime minister took full advantage of grace and favour country house",
    "Domestic abuse survivors praise Tina Turner’s bravery",
    "A road trip from Texas to LA",
    "Sexual subcultures, fetish on film and banned books",
    "Mexico’s Popocatépetl volcano spews ash and smoke",
    "Alpine wall art and drones in Morocco",
    "A magic moment and psychedelic rock",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "More than 5,000 new species discovered in Pacific deep-sea mining hotspot",
    "Russia moving nuclear warheads to Belarus, says country’s leader",
    "Manchester United 4-1 Chelsea: Premier League – live reaction",
    "US supreme court shrinks clean water protections in ruling siding with Idaho couple",
    "Far-right Oath Keepers founder sentenced to 18 years over January 6 attack"
]