[
    "The Guardian - Back to home",
    "At a glance What we know on day 451 of the invasion",
    "Barack Obama Ex-president among 500 banned from Russia in retaliation for US sanctions",
    "G7 summit Ukraine’s Zelenskiy arrives in Japan as he bids to boost western support for Kyiv",
    "Russia-Ukraine war: Kyiv says situation in Bakhmut ‘critical’ after Wagner claims control of city",
    "Politicians face pressure to vote against giving $31m to ‘Cop City’",
    "Vigilante fears as Republicans push for special unit to detain migrants",
    "Russian mercenaries behind slaughter of 500 in Mali village, UN report finds",
    "Mother of girl who died in US border patrol custody says agents ignored her",
    "Truck driver in crash that killed seven arrested on suspicion of drunk driving",
    "Boy who saved sister by hitting would-be kidnapper with slingshot speaks: ‘I had to’",
    "Fears looted Nazi art still hanging in Belgian and British galleries",
    "Brittney Griner shines in emotional WNBA return",
    "Bureau broke own rules in January 6 and BLM intelligence search, court finds",
    "At Bilderberg’s bigwig bash two things are guaranteed: Kissinger and secrecy",
    "Scientists look to clean up Antarctica",
    "Horses restaurant draws a crowd despite allegations against chefs",
    "Black Brazilians claim prime time as telenovelas finally reflect diversity",
    "US to back fighter jet training for pilots, official says",
    "Catch up with the must-read news and analysis",
    "Arrest order for British ICC prosecutor issued after Putin warrant",
    "Foreign minister steps up threat to block EU weapons aid for Ukraine",
    "What many women face when reporting rape",
    "'She sets a timer for sex and my job is just to enjoy what she’s doing to me’",
    "Chris Cillizza on presidents at play",
    "How India’s sari is taking over the world",
    "An immovable fixture in American life with a complex legacy",
    "What my privileged start in life taught me about the British class system",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Depp comes up smelling of roses despite defamation trial’s catalogue of misogyny",
    "When the tech boys start asking for new regulations, you know something’s up",
    "It’s easy to see white supremacy as the thinking of extremists. We know that’s not true",
    "Artificial intelligence holds huge promise – and peril. Let’s choose the right path",
    "Vice and BuzzFeed were meant to be the future of news. What happened?",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "$209bn a year is what fossil fuel firms owe in climate reparations. We want that paid",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "Griner shines in emotional WNBA return",
    "Tottenham 1-3 Brentford Mbeumo scores twice as Spurs fans voice anger at Levy",
    "Bournemouth v Manchester United, Liverpool v Aston Villa: clockwatch",
    "Jim Brown All-time NFL great and social activist dies aged 87",
    "Simply the best? City have hit greatness without friction",
    "Guardian readers on Manchester City",
    "Celtics fall apart late as Heat take 2-0 lead in East finals",
    "Rose blooms while Scheffler, Conners and Hovland share lead",
    "All-time NFL great running back and social activist dies aged 87",
    "Rybakina beats Ostapenko to reach Italian Open final",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "The new marine sanctuary for the super-rich LA coast",
    "‘As a child, seeing a black Ariel would have changed my life’",
    "From Depp to Godard, the chaotic circus rolls on",
    "Natasha Lyonne’s perfect detective show turns up the fun-o-meter until it explodes",
    "More overcranked nonsense with Vin Diesel and co",
    "Senegalese village love story with echoes of Romeo and Juliet",
    "Free speech comedy clubs and the battle over onstage offence",
    "A spangled supernova of joy",
    "Fluffy sex comedy with a dark underbelly",
    "Brio and unforced gravitas",
    "Cocaine Bear and the best ‘so bad they’re good’ films",
    "Orange and feta, tofu and shiitake: Yotam Ottolenghi’s ways with lettuce",
    "‘I banged my head on the table I was laughing so hard’",
    "The continuing rise of the waistcoat",
    "The hell of teenage shopping with your mum",
    "35 of the best restaurants",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Family of teen shooter who killed three says he struggled with mental illness",
    "Legislature passes 12-week abortion ban after bitter struggle",
    "Talks briefly resume as US default deadline creeps closer",
    "Parents of trans children seek to block state ban on gender-affirming care",
    "All-time NFL great and social activist dies aged 87",
    "Florida governor says only he can beat Biden in 2024 presidential election",
    "Jordan Neely was ‘screaming for help’, Al Sharpton says in funeral eulogy",
    "Hyundai and Kia settle lawsuit worth $200m over vehicle theft due to TikTok",
    "‘Taylor Swift bill’ aims to make ticket prices transparent",
    "Asylum seekers ‘abused and intimidated by staff in Home Office hotels’",
    "Interview ‘I lost my mojo. I wasn’t so sparky. I was suffering with PTSD’",
    "London mayor says he has PTSD caused by death threats",
    "Life in New Zealand’s boarding houses",
    "Primrose Hill to close gates at night after row that divided locals",
    "Silvio Berlusconi released from Milan hospital after six weeks",
    "Couple get payout after water buffaloes fall into Essex swimming pool",
    "Ex-chief of Indigenous agency charged over murders of pair",
    "Country's elite backed death squads, former paramilitary commander says",
    "Drug for hot flushes will transform treatment, doctors say",
    "Toddlers’ gut bacteria may predict future obesity, study suggests",
    "The inside story of a €1.6m wine heist",
    "Elections in UK and US at risk from AI-driven disinformation, say experts",
    "The woozy, not-dreadful experience of being a life model",
    "How leaving EU came back to bite Tories",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "Montana TikTok users denounce ban",
    "‘I liked how her expressiveness matches her bold hair’",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Trump’s not a good sport’: Chris Cillizza on presidents at play",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "Bournemouth 0-1 Manchester United, Liverpool v Aston Villa: clockwatch – live",
    "LA’s Horses restaurant draws a crowd despite allegations against chefs",
    "Phillip Schofield to leave This Morning ‘with immediate effect’",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast"
]