[
    "The Guardian - Back to home",
    "'Roast and Ride' Republican primary revs up with bikers, BBQs and a Trump-shaped hole",
    "Republicans Chris Christie just wants to ‘bludgeon’ Trump, Fox News’s Hannity complains",
    "Ron DeSantis Florida governor thanks then attacks heckler who called him a fascist",
    "Florida taxpayers pick up bill for governor’s culture war lawsuits",
    "China’s defence minister hits out at US during Singapore summit",
    "Analysis Billions spent to modernise but safety is biggest need",
    "‘Wailing for help’ Passengers tell of India train crash horror",
    "Deadly rail India's 10 worst disasters",
    "Signal fault blamed as wreckage cleared from track",
    "Traffic cop sues city over ‘get-out-of-jail-free’ cards for NYPD friends and family",
    "Events in Brazil and UK to celebrate lives of Dom Phillips and Bruno Pereira",
    "School offers yearbook reprints after objections to LGBTQ+ content",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to state's shoreline",
    "Australian and Chinese defence ministers meet after Beijing refused talks with US's Lloyd Austin",
    "Trump-appointed judge says anti-drag law is unconstitutional",
    "Makers of Lightyear flop among job cuts by Disney",
    "New drug combination offers breakthrough",
    "‘Spymania’ grips Russian security services amid sharp rise in treason cases",
    "How the largest US power firm avoided a trial for a deadly wildfire",
    "The nightly vigil to sanctify January 6 rioters",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Jay Rayner 'My bacon and egg years'",
    "Breakfasting with the stars How the famous got their day going",
    "Wake up! It’s time for breakfast The best cafés and restaurants to start your day",
    "What Mishal Husain, Jamie Oliver and Andi Oliver eat for breakfast",
    "The lone renter in ‘David and Goliath’ row with Montreal developers",
    "Why we just can’t get her out of our heads",
    "The artists bringing creation out of Beirut’s chaos",
    "Life and war inside rebel-held Myanmar",
    "The doctor treating the mental scars of Gaza’s children",
    "Here’s what AI doomsday would look like",
    "Noosa’s nude beach crackdown reveals uncomfortable trend for Australia's naturists",
    "At a glance What we know on day 466 of the Russian invasion",
    "Russia-Ukraine war: girl, 2, dies in Dnipro blast as Kyiv fends off air attack",
    "Two-year-old girl killed in Russian missile attack on Dnipro",
    "Ukraine repels wave of Russian air attacks on Kyiv after explosion hits Dnipro",
    "Zelenskiy says Ukraine ready to launch counteroffensive",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Fairytales have always reflected the morals of the age. It’s not a sin to rewrite them",
    "So what if Biden trips up? On the political stage his footwork is the fanciest seen in decades",
    "Succession wasn’t about the Murdochs? Surely it’s how they’d like to see themselves",
    "Europe’s lurch to the right rolls on. Only unity on the left can stop it",
    "The EU pays Africa’s brutal militias to lock up migrants. Britain wants to follow suit",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "Vegas fight back to beat Florida in Stanley Cup final opener",
    "Shields coasts past Cornejo to defend undisputed crown",
    "Novak Djokovic, Elise Mertens and Alcaraz in action",
    "Gündogan’s instant moment of beauty shows worth",
    "Man City 2-1 Man Utd Guardiola sets sights on historic treble",
    "River Plate football match abandoned after fan falls from stand and dies",
    "Ronaldo’s topsy-turvy Saudi sideshow upstaged by power of Nuno",
    "Verstappen on pole as Russell and Hamilton clash",
    "Messi bows out as Paris Saint-Germain slump",
    "Can Mediterranean holidays survive?",
    "Chemical giant Syngenta secretly pushed to bury a weedkiller’s link to Parkinson’s disease",
    "Top US chemical firms to pay $1.2bn to settle water contamination lawsuits",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Teacher Tasered by LAPD died from enlarged heart and cocaine use",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "How Amazon and Google fund anti-abortion lawmakers",
    "School district that banned Bible considers removing Book of Mormon",
    "Man arrested and charged with death threat to US senator",
    "Tiananmen massacre museum opens despite fear of Beijing backlash",
    "Lawyers demand judge in New York hush-money case step aside",
    "Protest over assembly at LA school turns violent",
    "Georgia gun shop owner to close store as US reels from mass killings",
    "US air quality as far south as Virginia affected",
    "Spain’s ‘safe pair of hands’ faces fine balancing act to deal with far-right Vox",
    "Police detain eight people on eve of Tiananmen anniversary",
    "Uganda says 54 African Union peacekeepers killed in gunfight",
    "Albanian Kosovans blame Belgrade for violence",
    "Holdout tenant halts developer’s push to force her out",
    "PM under fire as ‘stupid’ Eat Out to Help Out scheme to be focus of Covid inquiry",
    "Why two luxury London homes are at the centre of the country's turmoil",
    "Irish town unites in smartphone ban for young children",
    "President Recep Tayyip Erdoğan announces new cabinet",
    "Thousands rally in Belgrade against government and culture of violence",
    "‘I work on canvases for years. It’s like making really good wines’",
    "The Supermajority review: How the supreme court trumped America",
    "An illustrious feelgood duet party",
    "‘I don’t believe a writer should just keep writing as long as they’re alive’",
    "Nick Drake: The Life by Richard Morton Jack review – folk’s fragile man of mystery",
    "Rodney Smith channels the spirit of Magritte",
    "My husband and daughter won’t speak to each other",
    "Hearts are back in fashion – and there’s so much to love",
    "‘If there’s wine on the table, sex is absolutely happening’",
    "Yotam Ottolenghi’s picnic and camping recipes",
    "My life as a barrister in badly behaved Britain",
    "How I turned the page after getting divorced in my 30s",
    "We lived in different cities but even in the same room, I missed him",
    "People are going homeless in this Victorian getaway spot. Could an Airbnb tax be the answer?",
    "The truth about our electronic waste",
    "The British Vogue editor who keeps pushing boundaries",
    "Optimism is high for Bangkok Pride after Thai elections",
    "The multinational companies that industrialised the rainforest",
    "Why were Italian and Israeli secret service agents on a boat in northern Italy?",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Russian airstrikes in Kyiv, a shaky ceasefire in Sudan and protests in Senegal",
    "Milky Way photographer of the year 2023",
    "From owl chicks to hungry brown bear cubs",
    "Pastel-coloured homes for sale",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Fires, floods and disappearing beaches: can Mediterranean holidays survive?",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "Russia-Ukraine war at a glance: what we know on day 466 of the invasion",
    "Chris Christie just wants to ‘bludgeon’ Trump, Fox News’s Hannity complains",
    "‘Roast and Ride’: Republican primary revs up with bikers, BBQs and a Trump-shaped hole",
    "Buff billionaires are latest sign that bulk is now beautiful for male body image"
]