[
    "The Guardian - Back to home",
    "Ocasio-Cortez Progressive says she will vote against debt deal",
    "Full report Republican hard-right vows to ‘do everything in our power’ to oppose bill",
    "Chris Christie Former New Jersey governor will reportedly announce 2024 presidential bid next week",
    "US debt ceiling: House to vote on bill as AOC says she will vote against it",
    "Dollar General safety violations alarm workers",
    "Outrage as law threatening Indigenous lands advances in congress",
    "Gerrymandered districts set stage for 2024 Republican wins",
    "US warned it might suspend ties with Australian special forces over war crime allegations",
    "Ex-president reiterates pledge to scrap birthright citizenship",
    "UK should play leading role in developing AI global guidelines, Sunak to tell Biden",
    "Family of 11-year-old boy shot by officer sue police and authorities",
    "Librarians sue state over law banning them from giving ‘obscene’ books to children",
    "Hundreds were killed. Are we already forgetting them?",
    "The farmers dealing with water shortages even before historic Colorado River deal",
    "End of the boom for Birmingham’s Balti Triangle",
    "Defamation case pitting the media against Victoria Cross soldier",
    "How Succession ranks among TV’s great endings",
    "The side hustle that keeps a literary author’s career afloat",
    "Punchier, bolder, hotter and sweatier than ever",
    "My life as a hotelier in badly behaved Britain",
    "How to regain your sense of self, hope and happiness",
    "Reiner Riedler’s best photograph",
    "What US job will shrink the most in the next decade?",
    "Crazily frantic sequel with full-spin energy",
    "Moscow not planning to declare martial law after drone attacks, says Kremlin",
    "Macron to call for European ‘strategic awakening’ following invasion",
    "Who was behind the Moscow drone attacks?",
    "What we know on day 462 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Frilly dresses and white supremacy: welcome to the weird, frightening world of ‘trad wives’",
    "Conservatives are bullying pro-LGBTQ+ companies, just in time for Pride Month",
    "Across Europe, the far right is rising. That it seems normal is all the more terrifying",
    "UK Labour’s oil and gas ban shows it’s ready to fight the next election on climate issues",
    "How bench players can tilt the NBA finals",
    "Bass sorry for anti-LGBTQ post as Kershaw backs Christian Faith Day",
    "How can the languishing National Spelling Bee regain its sting?",
    "Kosovo Olympic authorities urge IOC to take action against player",
    "Our predictions versus reality",
    "French Open day four – Tsitsipas and Svitolina in action, Pegula wins",
    "Hudson quits as manager as second interim hired amid search",
    "Liverpool mull Koné move but reject Leipzig’s Carvalho bid",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Asian Americans do not have access to information, survey finds",
    "Restaurant manager died after getting trapped inside a freezer, lawsuit says",
    "Staffer who accused Joe Biden of sexual assault defects to Russia",
    "Rare white bison born in Wyoming is first in park’s 32-year history",
    "Purdue can shield wealthy Sackler family from opioid lawsuits, court rules",
    "Five people still unaccounted for after apartment building collapse",
    "Debt ceiling deal clears first hurdle and advances for debate",
    "Republican hopeful says he will ‘destroy leftism’ in US if elected president",
    "Firefighting goats could be furloughed due to employment law",
    "California appeals court votes for parole for Manson follower",
    "President says he would support peace agreement with cartels",
    "Sale of Hitler memorabilia to go ahead despite outcry",
    "Outrage after teenage girl killed in Delhi street",
    "Doctor who criticised army for diverting aid is arrested",
    "Under-fire PM said he would consider early elections in north if violence ends",
    "Don’t blame 2024 Olympics for France’s social problems, says sports minister",
    "Black people were three times more likely to receive Covid fines in England and Wales",
    "Court widens war crimes convictions of former Serbian security officers",
    "Mountaineer Luis Stitzinger found dead near Himalayan peak",
    "Adventurers reach Rockall in bid to live on north Atlantic islet for 60 days",
    "Tracking down Ukraine’s abducted children",
    "Listen to previous episodes",
    "Jess Williamson on fate, Plains and her breakout fifth album",
    "Pop singer and film-maker announces she is on autism spectrum",
    "After half a century, still having the time of his life",
    "How the ‘nice’ comedy became utterly dreadful television",
    "Succession’s Jeremy Strong tried to jump into a river during final scene",
    "Books about connecting with nature",
    "Four ways to find love – without the apps",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "Airbnb is in denial over concerns we raised about our host",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The dating trend that is unlikely to improve your love life",
    "Plight of migrants as slums razed in French territory of Mayotte",
    "40 years of the Smiths’ Peel Sessions",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "‘People wanted to believe the fairytale’",
    "Growing debate over vape regulation",
    "Beyoncé and World Parrot Day",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Ball of fluff’: rare white bison born in Wyoming is first in park’s 32-year history",
    "US debt ceiling: Republican hard-right vows to ‘do everything in our power’ to oppose bill",
    "Good riddance, Ted Lasso: how the ‘nice’ comedy became utterly dreadful television",
    "Tara Reade, who accused Joe Biden of sexual assault, defects to Russia",
    "‘One of the blasts shook our house’: Russians wake up to war at home",
    "Donald Trump reiterates pledge to scrap birthright US citizenship",
    "Thelma and Louise review – punchier, bolder, hotter and sweatier than ever",
    "Stop dumping your cast-offs on us, Ghanaian clothes traders tell EU"
]