[
    "The Guardian - Back to home",
    "Ukraine EU mulls levy on frozen Russian assets to support reconstruction",
    "Germany Wagner mutiny has weakened Putin, says chancellor",
    "Russia General who may have known about mutiny goes missing",
    "White House issues warning to US firms interested in acquiring Israeli surveillance tech",
    "Elections official downplays cybersecurity threats despite report",
    "Group hacks agencies in US states attacking gender-affirming care",
    "Muslims vow to continue call to prayer despite rise in mosque attacks",
    "Yankees pitcher Domingo Germán hurls 24th perfect game in baseball history",
    "Museum faces backlash for hosting group with ‘oppressive views’",
    "Sweetener to be declared possible cancer risk by WHO, say reports",
    "Milwaukee plant to close after 100 years and send jobs abroad",
    "Magazine reportedly lays off its last staff writers",
    "Canada fires force US crews to shift strategy",
    "What’s driving anti-LGBTQ+ hate in America?",
    "MLB’s pace-of-play rules are showing that less is more",
    "Rising seas have flooded this town three times. It may not survive a fourth",
    "What we know on day 491 of the invasion",
    "EU mulls levy on frozen Russian assets to support reconstruction",
    "Ukraine defence minister expects Nato guarantee for after war",
    "Alliance ready to face threat from ‘Moscow or Minsk’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "The people who taxidermy their pets",
    "This duo serves a segment that the big brands ignore",
    "Bowie bids farewell to an icon in legendary gig",
    "I’ve visited 300 grounds – should I be proud or embarrassed?",
    "Are they destroying our gut health?",
    "Henry Cavill’s pulse-quickening last stand as an anti-heroic hunk",
    "People think it’s harder to make new friends after a certain age. We prove it’s possible",
    "Sign up to the US opinion email",
    "The failed Wagner coup shows Vladimir Putin’s regime remains stubbornly strong",
    "I am cursed to wear compression socks. Spare a thought for me this summer",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "Yankees pitcher throws 24th perfect game in MLB history",
    "Blackhawks tab ‘generational prospect’ Bedard with No 1 pick",
    "Jesús Ferreira scores hat-trick as USA put six past St Kitts",
    "Teenage security guards stuck in Qatar after World Cup",
    "How Wimbledon and apartheid South Africa blocked a teen’s dream",
    "Havertz is a risk but offers Arsenal endless possibilities",
    "Inter Miami hire Tata Martino as coach, confirming Messi reunion",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "Texas Record-setting heat sends hundreds to emergency rooms",
    "Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Presumed human remains recovered from within wreckage, US Coast Guard says",
    "Joshua Trees win long-term protection in environmental victory",
    "Yusef Salaam declares victory in city council primary",
    "Trump trial could be delayed until spring 2024",
    "Highest-ranking trans elected official in US to run for Congress",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "Nasa aims to mine resources on moon in next decade",
    "US paramedic saves lives of two people in one family",
    "‘Witch-hunt’ What Johnson’s allies said about the inquiry",
    "Boris Johnson allies launched ‘unprecedented’ campaign to undermine privileges committee",
    "Teenage security guards stuck in Gulf state after World Cup",
    "Broadcaster reprimanded over ‘graphic’ dolphin mating scene",
    "Operations against UK leftwing groups unjustified, judge finds",
    "Protesters gather in Helsinki over ministers’ far-right links",
    "Alexis Tsipras to step down as Syriza leader after election rout",
    "Oversight board orders firm to take down video by Cambodian leader",
    "Ambassador calls Australia ‘vindictive’ after dead possum thrown onto disputed embassy site",
    "China on course to hit wind and solar power target five years ahead of time",
    "Supplements may cut risk of heart attacks, trial suggests",
    "Guards at Del Monte pineapple farm in Kenya accused of killings",
    "Listen to previous episodes",
    "I wanted to play but my hand wouldn’t move",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Rapper charged with domestic violence",
    "People still do not want women to succeed or be equal. While that is true, you need Virago",
    "Singer's tour postponed after she suffers ‘serious’ bacterial infection",
    "He made me realise I’m woke – I thought it was a negative thing",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "Stag do mishaps, pizza origins, and a very ugly dog",
    "The married couple competing to have the biggest and best facial hair",
    "10 ways to be much more confident at parties",
    "10 famous food rules you can absolutely ignore",
    "Skin disease in cetaceans off North American coast concerns scientists",
    "How Wimbledon and apartheid South Africa blocked a teen’s tennis dream",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "Food relief thefts in Ethiopia leave those in need with nothing",
    "Mike Figgis on Julian Sands",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Celebrating diversity and equality in photography",
    "Clashes rage over police shooting",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "National Geographic reportedly lays off its last staff writers",
    "‘It burns wild and free up there’: Canada fires force US crews to shift strategy",
    "Rightwingers say ‘pink-haired liberals’ are killing New York pizza. Here’s what’s really happening",
    "Master Lock’s Milwaukee plant to close after 100 years and send jobs abroad",
    "Russian general who may have known about Wagner mutiny goes missing",
    "The truth about emulsifiers: are they destroying our gut health?",
    "‘We are literally erased’: what does it mean to be intersex?",
    "‘Not for employee use’: why are US retail workers being denied chairs?"
]