[
    "The Guardian - Back to home",
    "Supreme court DeSantis envisions ‘quarter-century’ of far-right majority",
    "Florida NAACP issues travel warning saying state is ‘actively hostile’ to minorities",
    "Police DeSantis’s $13.5m program lures officers with violent records to Florida",
    "Ron DeSantis to launch presidential campaign on Twitter with Elon Musk",
    "US regulators launch investigation into worker death at Amazon warehouse",
    "Hush money trial set for March 2024 during Republican primaries",
    "JP Morgan claims US Virgin Islands ‘complicit’ in sex offender's crimes",
    "Police solve 48-year-old case of teenager’s rape and murder using DNA",
    "State senate considers six-week abortion ban amid heated debate",
    "Harlan Crow refuses to cooperate with Democrats’ inquiry on Clarence Thomas",
    "CEO of biggest carbon credit certifier to resign after claims offsets worthless",
    "Company expands crackdown on password sharing around the world",
    "Special rapporteur rules out inquiry into Chinese interference claims",
    "Dodgers re-invite drag nuns to Pride Night after cutting them",
    "Southern plain-talk or Foghorn Leghorn shtick?",
    "Why are there no affordable cars?",
    "A reporter looks back on the 16-year mystery of a three-year-old's disappearance",
    "Court extends detention of Evan Gershkovich to August",
    "EU discusses earmarking €1bn for Ukraine",
    "Moscow claims attack on Russian soil by Ukraine-aligned units ‘repelled’",
    "At a glance What we know so far on day 454 of Russian invasion",
    "The Russian region being dragged into Putin’s war on Ukraine",
    "Auction offers unseen items showing new side to star",
    "Fury as Maya train nears completion in Mexico",
    "Wes Anderson’s 1950s sci-fi is an exhilarating triumph of pure style",
    "Rewatching the defining ensemble film of the 1980s",
    "How far would you go to save your cat? For me, it started with a contraband drug",
    "From children’s entertainer to convicted criminal",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "A debt default would be catastrophic for the US – and Biden’s re-election chances",
    "We are closer than ever to arresting Putin, but the US must play its part",
    "Who says clothes aren’t a matter of life or death? In Succession they’re both",
    "Make way for Westminster’s biggest celebrity: Suella ‘three points’ Braverman",
    "Spare a thought for Britain’s new persecuted minority: the privately educated",
    "True crime can be an unedifying business, so why am I drawn to writing about it?",
    "As a columnist I have learned that honesty is timeless and self-importance gets you nowhere",
    "Guardiola calls for quick verdicts on Manchester City charges",
    "James casts doubt over NBA future after loss",
    "USWNT star confirms she will miss World Cup with ACL injury",
    "Cleveland rookie kills bird with 100mph line drive",
    "Nuggets sweep aside Lakers to reach first finals in team’s 56-year history",
    "Perhaps one day this whole soccer era will need an asterisk",
    "Carmelo’s flawed genius hit different because I saw his faults in myself",
    "Thomas regains lead as Almeida takes stage 16",
    "Maine plans removal of PFAS from sewage sludge used as fertilizer",
    "Recycling can release huge quantities of microplastics, study finds",
    "Heavy rains offer relief from wildfires but could lead to flooding",
    "AGM disrupted by protests as it tries to to reject new emissions targets",
    "From pollution to policing – can Sadiq Khan clean up London?",
    "Listen to previous episodes",
    "Broadway legend Chita Rivera on Chicago, West Side Story – and her love of sumo wrestling",
    "Chas Newby, one-time Beatles bassist, dies at 81",
    "Chaz Jankel, the man who made the Blockheads funky",
    "Marco Bellocchio’s antisemitism drama is a classic in the making",
    "This is now the museum where art goes to sleep",
    "International Booker prize announces first ever Bulgarian winner",
    "You will want only good things for these kind, gentle mermaids",
    "Scrupulous look at the exploitation of a natural wonder",
    "Lesser yet passable animated prequel",
    "Where Xbox is looking for its next big hit",
    "Why restaurants are ditching QR codes",
    "‘I was a 17-year-old versus a 600lb grizzly bear. I was going to die’",
    "Eco-designer shows off biodegradable wedding dress at flower show",
    "Why does my cooking chocolate split into an oily mess?",
    "50 years of Olivia, the lesbian cruise company",
    "Republicans bid to rewrite Ohio’s abortion rules",
    "Facebook owner sells Giphy at a loss of more than $260m",
    "US surgeon general issues advisory on ‘profound’ risks of child social media use",
    "US border agents kill man on tribal reservation",
    "Nearly 2,000 children abused by Catholic clergy over 70-year period",
    "Truck driver charged with threatening president after crash near White House",
    "Parents of US man killed by police during mental health crisis to get $19m",
    "Author files for new damages after Donald Trump’s CNN town hall remarks",
    "Historic Colorado River deal is not enough to stave off long-term crisis, experts say",
    "Governor's $13.5m police program lures officers with violent records to Florida",
    "Homeless families to be moved out of London hotel during Beyoncé tour",
    "Rolf Harris, entertainer who was convicted of child abuse, dies aged 93",
    "Partygate What could come next for Boris Johnson after new allegations?",
    "Former PM referred to police over allegedly hosting friends at Chequers in lockdown",
    "Oldest woman shares her secrets to enjoying life on her 109th birthday",
    "Civil servants ‘have to fact-check’ home secretary’s claims to cabinet",
    "Police begin searching reservoir for Madeleine McCann, who went missing aged three in 2007",
    "Duke of Sussex loses legal fight to be able to pay for police protection in UK",
    "Erdoğan gains endorsement of third-placed 'kingmaker' for runoff",
    "Hongkongers opt out of organ registry ‘amid fear of Chinese donations’",
    "Ex-chief at Genoa bridge firm says he knew about risk of collapse",
    "Guy Pearce on the ‘disturbing’ true story behind The Clearing",
    "Out of our minds: opium’s part in imperial history",
    "Governor steps up his battle against bears in Trentino region",
    "The warnings were greatly exaggerated – until now",
    "How training dogs to chase bears might just save a grizzly or two",
    "Sri Lanka’s tea pickers say they go hungry and live in squalor",
    "A baroque ball and Nato jets",
    "The best red carpet looks so far",
    "Almost 400 species discovered in Greater Mekong region",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Trump hush money trial set for March 2024 during Republican primaries",
    "‘It destroys democracy’: Republicans bid to rewrite Ohio’s abortion rules",
    "Asteroid City review – Wes Anderson’s 1950s sci-fi is an exhilarating triumph of pure style",
    "How solar farms took over the California desert: ‘An oasis has become a dead sea’",
    "‘Few options that are cheap’: why are there no affordable cars in the US?",
    "Ron DeSantis ‘to announce presidential run on Twitter with Elon Musk’ – as it happened",
    "The Guardian view on Ukraine’s counteroffensive: keeping up momentum"
]