[
    "The Guardian - Back to home",
    "Ukraine counteroffensive has begun, says top official",
    "Wave of lawsuits against firearm makers raises hope of end to mass shootings",
    "US priest’s sentence offer for molesting child too lenient, says accuser in case",
    "Ken Paxton Attorney general urges supporters to protest ahead of impeachment vote",
    "Impeachment proceedings against attorney general to begin",
    "Recycled and reused food contact plastics are ‘vectors’ for toxins, study finds",
    "Talks continue into weekend amid signs deal is close",
    "Nun’s body intact four years after death draws people to monastery",
    "Insurance giant halts sale of new home policies in state due to wildfires",
    "Fierce beast attacking residents revealed as domestic cat with attitude",
    "Official suspended after draining reservoir to retrieve phone",
    "How a Belarus dissident became an apologist for the regime",
    "Barcelona’s working-class, leftwing mayor Ada Colau fights for third term",
    "Up to 70% of beaches could disappear by end of the century",
    "Candidate’s limp start to 2024 race delights Trump but battle is not over",
    "The vintage radio enthusiasts prepping for disaster",
    "My cheating boyfriend told me he was a sex addict. Was it a disorder – or just an excuse?",
    "The tragedy and beauty of Nick Drake, by those closest to him",
    "'People imagine that the guilt of an affair makes the sex more exciting’",
    "Squirrel haggis and Japanese knotweed reach UK menus as invasive species trend grows",
    "True story of family and the civil rights struggle",
    "Inside the world’s longest-running mermaid gathering",
    "‘We are not done with Covid, not even close’",
    "What we know on day 458 of the invasion",
    "Former UK PM Boris Johnson tried to persuade ex-president to back Ukraine on US tour",
    "Catch up with the must-read news and analysis",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Henry Kissinger turns 100 this week. He should be ashamed to be seen in public",
    "Should Taylor Swift speak up now on Matty Healy’s controversies?",
    "Red tape can’t be allowed to hold up the Holocaust memorial any longer",
    "AI will be everywhere, but its rise will be mundane not apocalyptic",
    "Coventry City v Luton Town – Championship playoff final",
    "Renowned US mountaineer climbs rare Everest region ‘triple crown’",
    "Bayern win title after wild final day as Dortmund denied",
    "Bill would see Nevada pay $380m for Athetics’ stadium on Vegas strip",
    "Why tennis players are backing off so far on serve",
    "Hopkins cut loose by Cardinals as team absorbs $22.6m dead cap hit",
    "Jason Roy’s Stateside jaunt the inevitable endgame for cricket as we know it",
    "How the Savannah Bananas became the greatest show in sports",
    "Stars could be invisible within 20 years as light pollution brightens night skies",
    "Just Stop Oil protesters invade pitch and stop play at Twickenham rugby final",
    "Cutting parking spaces 'could solve New York rat crisis and create more green spaces'",
    "Fear and fury as the last spotted owl in Canada fights for survival",
    "Florida governor appears to back woman who led Amanda Gorman poem school ban",
    "Litter of kittens provides hope for Los Angeles mountain lions after dreadful year",
    "Black bear takes 60 cupcakes from US bakery, scaring staff",
    "‘Massive’ data leak reveals thousands of alleged safety complaints – report",
    "Sailor’s death stemmed from ‘near perfect storm’ of Seal training failures",
    "Oath Keeper sentenced to eight and a half years for role in January 6",
    "Donald Jr confuses his father with DeSantis",
    "Former Maryland trash hauler graduates from Harvard Law School",
    "US to give away free lighthouses as GPS makes them unnecessary",
    "Prosecutors have evidence ex-president showed classified papers to people, report says",
    "Rows over Eta and racism loom large as holds local elections",
    "Man who opened plane door before landing says he wanted out ‘quickly’",
    "English queen heavily influenced by loss of mother Anne Boleyn at young age",
    "Prominent pro-democracy Civic party votes to disband",
    "Boris Johnson calls diary checks for evidence of Covid breach ‘nonsensical’",
    "Refugees seriously injured on fence UK built to keep asylum seekers out of EU",
    "TikToker Mizzy charged with breaching criminal behaviour order",
    "Army calls on former soldiers to re-enlist as fighting persists through ceasefire",
    "Pope Francis returns to work after taking day off with fever",
    "Why New Zealand is obsessed with its native birds",
    "‘Your earlobes are thick and chewy, like barnacle meat!’ Succession’s all-time best zingers",
    "‘Would it have landed the same way without the mad bum-rush of Trump’s presidency?’",
    "What happens if your partner doesn’t like your writing?",
    "Paul Murray: ‘I just dumped all my sadness into the book’",
    "Ruby Wax says Donald Trump didn’t make a pass at her as she is ‘too clever’",
    "Week two roundup – still a country for old men?",
    "‘A teacher telling me I was a “reasonably intelligent girl” drove me crazy’",
    "My life as a pub manager in badly behaved Britain",
    "Style languages combine in a Dublin home",
    "‘She asked if I’d Googled her before the date. I said of course’",
    "Why the ‘cacophonous and intoxicating’ Italian city is a must-see",
    "Chantelle Nicholson’s recipe for grilled spring onions with roast garlic and chickpea mash",
    "The US professor living underwater for 100 days",
    "Who was the woman who jumped to her death?",
    "How Phillip Schofield’s exit unfolded – and what next for This Morning?",
    "Is Binance capable of being regulated?",
    "Supermassive black hole at heart of ancient galaxy ‘far larger than expected’",
    "How body hair went out of fashion in the UK",
    "Imaginary spaces rendered in fabric",
    "I’d never seen a woman riding a motorcycle in a dress",
    "10 years of its best photography",
    "The week around the world in 20 pictures",
    "Statesman or war criminal? His troubled legacy",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US debt ceiling talks continue into weekend amid signs deal is close",
    "Three abandoned children, two missing parents and a 40-year mystery",
    "Fierce beast attacking Florida residents revealed as domestic cat with attitude",
    "‘The intensity is increasing’: Ukraine says first steps in counteroffensive have begun",
    "This is how we do it: ‘People imagine that the guilt of an affair makes the sex more exciting’",
    "‘Caste is anti-Asian hate’: the activists fighting ‘less visible’ discrimination in the US",
    "Immunologist Akiko Iwasaki: ‘We are not done with Covid, not even close’",
    "‘It’s hell’: life under the American mobile home king who calls himself a ‘grave dancer’"
]