[
    "The Guardian - Back to home",
    "Live Over 80m people under air quality alerts as extreme heat and smoke spreads across US",
    "Climate crisis Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Canada 2023 wildfires have released record 160m tonnes of carbon – and it's only June",
    "Solar helps Texas carry energy load as heatwave puts power grid to test",
    "Top Georgia official to meet special counsel investigators over Trump’s 2020 election plot",
    "Ukraine Defence minister expects Nato ‘guarantee’ after war",
    "Nato Alliance ready to face threat from ‘Moscow or Minsk’",
    "Russia-Ukraine war: Kramatorsk strike death toll rises to 11; Biden says Putin is a ‘pariah’",
    "Manuscript sheds new light on creation of Capote’s In Cold Blood",
    "Trump trial could be delayed until spring 2024",
    "Macron says killing of teenager ‘inexcusable’",
    "Saudi leader trying to avoid ‘pariah’ status with LIV-PGA merger, says campaigner",
    "Amazon facing ‘urgent’ crime crisis after gutting of protections, says drugs tsar",
    "Highest-ranking trans elected official in US to run for Congress",
    "Human gene identified that prevents most bird flu viruses moving to people",
    "Pilot dumps drugs over remote region when pursued by fighter jet",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are sea lions and dolphins dying along California’s coast?",
    "Why are US retail workers being denied chairs?",
    "Nuns and Native women heal polluted New York waters using kelp",
    "What we know on day 490 of the invasion",
    "US targets mercenary force by sanctioning gold companies suspected of funding it",
    "UN says Russian forces have tortured and executed civilians in Ukraine",
    "Four children among 10 killed in missile strike on pizza restaurant",
    "Guardian Today US: Get the headlines & more in a daily email",
    "10 ways to be much more confident at parties",
    "What does it mean to be intersex?",
    "10 famous food rules you can absolutely ignore",
    "Meghan and Harry’s trainwreck podcast career",
    "Idris Elba makes this beautifully daft plane thriller soar",
    "Frederic Forrest, consummate character actor",
    "How Kylie and Fleetwood Mac found new young fans",
    "The married couple competing to have the biggest and best facial hair",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. I have a plan to fix it",
    "The supreme court denied a wild election theory. But don’t relax yet",
    "The key to wedded bliss is a joint bank account? I don’t buy it",
    "The Russian coup-that-wasn’t fell flat. The next one might not",
    "Julian Sands: a hypnotically exotic actor full of style and extravagance",
    "Brittney Griner’s triumphant return to the WNBA",
    "Ohtani becomes sixth with two homers and 10 strikeouts since 1893",
    "Declan Rice Arsenal clear for $133.3m deal after City pull out",
    "How good are Brazil and how far can they go?",
    "Tour de France Fear casts shadow after Mäder’s death",
    "Stage-by-stage guide to this year’s race",
    "Former NFL quarterback dies in apparent drowning aged 35",
    "Brief grass season creates huge challenge for players to be ready for Wimbledon",
    "Eddie Hearn on boxing and big ambitions",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "What happens to a people when their land disappears",
    "Walt Nauta Trump valet arraignment delayed after losing Florida lawyer over fees dispute",
    "Former president sues E Jean Carroll for defamation over rape comments",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "Airbnb to offer pink Malibu mansion",
    "US paramedic saves lives of two people in one family",
    "Rapper accused of antisemitic abuse by former business partner",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Human remains found in California mountains confirmed as British actor",
    "Supreme court ruling on stalking cases sparks alarm",
    "Ryan Seacrest to take over as host as Pat Sajak exits",
    "Former PM and ex-parliamentarian investigated by police",
    "Video of apparent neo-Nazi handing out balloons at nursery sparks outrage",
    "Two street artists claim responsibility for hoax Banksy",
    "Changing skin pattern while asleep may show they dream, research shows",
    "Chaos at feral cat hunting contest as video of children chanting with dead animals emerges",
    "Citizens become a year or two younger as country changes system for counting ages",
    "Labour leader beaten to death while trying to resolve dispute",
    "Beaver spotted ambling around garden in broad daylight",
    "Actor arrives at court in London for sexual assault trial",
    "Outcry after tourist carves name on wall at Colosseum",
    "The oil company CEO running the next UN climate change summit",
    "Listen to previous episodes",
    "Idris Elba: racist backlash made speculation over James Bond ‘disgusting’",
    "A polar bear theatre in Rotterdam zoo",
    "Julian Sands in A Room With a View: the soulful heart of a brilliantly romantic film",
    "Top 10 summer love stories",
    "How American Football became indie legends against the odds",
    "Rights to Argentinian writer’s work go to his wife’s nephews",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "10 of the weirdest sporting events in the UK",
    "The surprising culinary advice of one of the world’s best chefs",
    "Barbecue sides that will steal the show",
    "I moved my date’s hand off my breast and he took it badly. Should I have said something instead?",
    "The author under attack for doubting Shakespeare",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Guardian readers’ best films of 2023 so far",
    "How volcano magma could help meet green economy’s demand for metal",
    "New Zealand boatshed sells for record $2m despite housing market crash",
    "The London gig venue at the heart of the fight against gentrification",
    "Mountain basketball and an earthquake wedding",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Four children among 11 killed in missile strike on Ukraine pizza restaurant",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "The End of Sex review – couple’s sexual misadventures aim to relight fading fires",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "‘I have that friend back’: Sergio García reveals end to Rory McIlroy rift",
    "A moment that changed me: I was gay, disabled, alienated. With seven kind words, my life began",
    "Pompeii fresco find possibly depicts 2,000-year-old form of pizza",
    "Never drink red wine with fish! 10 famous food rules you can absolutely ignore"
]