[
    "The Guardian - Back to home",
    "Jordan Neely was ‘screaming for help’, Al Sharpton says in funeral eulogy",
    "Elite backed death squads, former paramilitary commander says",
    "Barack Obama Ex-president among 500 banned from Russia in retaliation for US sanctions",
    "Explainer How could F-16s make the difference for Ukraine in the war against Russia?",
    "US to back fighter jet training for pilots, official says",
    "Trudeau’s wide-stance pose with Korean politician splits critics",
    "US debt ceiling talks hit bump as White House says ‘real differences’ remain",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Villages evacuated as ‘very large’ wildfire ravages south-west",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Florida governor says only he can beat Biden in 2024 presidential election",
    "City is sinking due to weight of its skyscrapers, research finds",
    "Naloxone has been hailed as life-saving. Why isn’t it given to those who need it?",
    "Actor’s return to Cannes exposes French split over #MeToo",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "Arrest order for British ICC prosecutor issued after Putin warrant",
    "Foreign minister steps up threat to block EU weapons aid for Ukraine",
    "Dreams shattered as war scatters Ukraine documentary’s teenage stars",
    "Cate Blanchett’s boozy nun indulges possible second coming in woozy wartime saga",
    "The miracle and tragedy of Tasmania’s Blythe Star shipwreck",
    "Andy Rourke's distinctive melodic style was central to the Smiths",
    "An education in consent for 24 hour party people",
    "How leaving EU came back to bite Tories",
    "He voted for the first time in 2020. Then came the criminal charges",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "$209bn a year is what fossil fuel firms owe in climate reparations. We want that paid",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "They’re openly saying it: Brexit has failed. But what comes next may be very dark indeed",
    "Andy Rourke was the other melodic genius in the Smiths: spry, funky and masterful",
    "Does the west really want Ukraine to win the war? If so, increase military support",
    "My students are using AI to cheat. Here’s why it’s a teachable moment",
    "Speak now: why pop stars must do more to defend LGBTQ+ fans",
    "Tom Kim Golfer's accidental mud bath on first day goes viral",
    "PGA Championship – second round updates",
    "MLS San Diego to receive 30th franchise ahead of 2025 debut",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Mage faces tough Preakness challenge as First Mission scratched",
    "Taylor braced for ‘hardest fight of career’ against Cameron",
    "Arsenal bottled it? That’s just a quick, cheap narrative",
    "Ten things to look out for this weekend",
    "Nuggets two wins from finals after Murray’s 23-point fourth tames Lakers",
    "Caruana edges Bucharest while Ding narrowly avoids finishing bottom",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Weather disasters suggest climate crisis is at Europe's gates",
    "The new marine sanctuary for the super-rich LA coast",
    "National Conservatism: a Tory fringe or the party’s future?",
    "Listen to previous episodes",
    "Harrison Ford reduced to tears in Cannes over Indiana Jones’s return",
    "Wanda Sykes, the uncancellable standup superstar",
    "Caligula finally comes to Cannes",
    "Author makes first public appearance since attack, praising ‘heroes’ who saved him",
    "French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Company cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "Cha cha cha! Eurovision stars dominate UK Top 10 after record-breaking final",
    "Is The Creator the first (or last) in a new wave of sci-fi movies about AI?",
    "The spellbinding singer on anger, empathy and trans rights",
    "Rishi Sunak and Akshata Murty take careful approach at G7",
    "Turn off your email, get the packing right – and never, ever play Monopoly",
    "Ravneet Gill’s recipe for strawberry and custard tart",
    "Daisy Jones & the Six is a blueprint for delicious holiday style",
    "I can’t get past how empty I feel since my best friend died",
    "I’ve got the best memory in the world",
    "Prosecutor signals charges in 2020 election inquiry may come end of July",
    "Couple ‘demand agency hand over car chase images’",
    "Airline ‘sincerely apologizes’ to family over Puerto Rico passport error",
    "Groom remembers bride killed in wedding night crash as ‘amazing human’",
    "Creators sue to block Montana’s ban on app",
    "California city to name street after rapper",
    "City names first drag laureate as LGBTQ+ rights under attack in US",
    "Gun violence is top public health concern for quarter of Americans – poll",
    "Eight-year-old girl dies after being detained by border patrol",
    "Man accused of stabbing app founder Bob Lee pleads not guilty",
    "Iran executes three men accused over anti-government protests",
    "Bashar al-Assad tells Arab League he hopes his return marks new era of peace",
    "Imran Khan alleges ‘reign of terror’ as supporters face trial in military courts",
    "King’s College London cuts ties over opioid crisis",
    "Government under fire after video shows ‘pushback’ of asylum seekers",
    "Court acquits tycoon in retrial over 2018 killing of journalist and fiancee",
    "Former PM and wife Carrie expecting third child in ‘just a few weeks’",
    "Police detain woman for supporting comedian who joked about military",
    "UN denied access to Rohingya refugee camps after Cyclone Mocha",
    "Beijing aims to subordinate the west, claims US politician on UK visit",
    "Montana TikTok users denounce ban",
    "Ukrainian punks Death Pill take fury on tour",
    "The Sicilian town trying to break free of its mobster past",
    "The daredevil group bringing ropewalking and climbing to the theatre",
    "Younger Britons more likely to believe in eternal damnation, study finds",
    "I may have fallen in love with a sex worker I am paying. Could it be real?",
    "G7 summit and water buffaloes",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "‘An irresistible mix of art and genitals’: Caligula finally comes to Cannes",
    "Hungary steps up threat to block EU weapons aid for Ukraine",
    "US debt ceiling talks hit bump as White House says ‘real differences’ remain – live",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast",
    "The US debt ceiling crisis is more proof of Republicans’ cynicism and bad faith"
]