[
    "The Guardian - Back to home",
    "First Thing House could be recalled to vote on deal if agreement reached",
    "Deal within sight as Biden and Republicans continue to negotiate",
    "Founder of far-right militia sentenced to 18 years over January 6 attack",
    "Asia Pacific North Korea slams ‘sinister’ South and allies as live-fire exercises with US begin",
    "Joe Biden’s advisers say he doesn’t want to drag Pacific allies into ‘headlong clash’",
    "Lost story by ‘poet of the tabloid murder’ discovered in Congress library",
    "Russia-Ukraine war: at least one person dead and 15 injured in Russian attack on Dnipro clinic",
    "Tom Hanks gives keynote speech and receives honorary degree from Harvard",
    "FBI files reveal plot to kill queen during US trip in 1983",
    "Elon Musk’s brain implant company approved for in-human study",
    "Europe’s Turkish diaspora split as large numbers vote in election runoff",
    "Seaweed could avert food crisis caused by extreme weather",
    "Police investigate after plane door opened mid-flight",
    "The contentious tool US immigration uses to get your data from tech firms",
    "More than 5,000 new species discovered in deep-sea mining hotspot",
    "Public weed ban begins in Amsterdam",
    "Full story Cities to pay $80m to people injured in protests",
    "People injured by 2020’s police violence speak out",
    "‘Older straight men hated my films with a vengeance’",
    "‘An inspiration to women around the world’ Readers remember Tina Turner",
    "Singer, diva, fashion icon, trailblazer, dancer",
    "Why is Betelgeuse glowing so brightly and behaving so strangely?",
    "My ex rang me and now I feel the love for my new wife fading fast. What can I do?",
    "Goodbye to the defining show of the Trump era",
    "Will Republicans get behind Tim Scott? – podcast",
    "At a glance What we know on day 457 of the invasion",
    "At least one person dead and 15 injured in Russian attack on Dnipro hospital",
    "The film-maker who drove 400 Ukrainians to safety",
    "Moscow moving nuclear warheads to Belarus, says Lukashenko",
    "US imposes sanctions on leader of Wagner group in Mali",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "‘Farming good, factory bad’, we think. When it comes to the global food crisis, it isn’t so simple",
    "No, Succession’s antiheroes don’t have a good side: that’s what makes it so compelling",
    "The NAACP says Florida isn’t safe for Black people. Unfortunately, they’re right",
    "Toxins hidden in plastics are the industry’s dirty secret – recycling is not the answer",
    "Orcas are ramming yachts off the Spanish coast – is the whale world rising up?",
    "Is it a triumph for women that Martha Stewart, 81, is a swimsuit star?",
    "Celtics roll Heat in Game 5 to inch closer to historic comeback",
    "How the Savannah Bananas became the greatest show in sports",
    "Weekend countdown WSL, Premier League and Bundesliga finales, plus playoff finals",
    "Man Utd 4-1 Chelsea Clinical United seal Champions League return",
    "Premier League: 10 things to look out for on day of drama",
    "Holger Rune 'If everybody was the same, it would be a bit boring'",
    "Djokovic and Alcaraz could meet in semi-final as draw is made",
    "Epic 211-shot rally delights fans at doubles match in Malaysia",
    "Nascar opens investigation into driver’s hacked radio channel",
    "White-hot USA blank Czech Republic to reach semi-finals at worlds",
    "Folarin Balogun chose the US over England. He may have created a 2026 contender",
    "How seaweed could avert food crisis caused by extreme weather",
    "Average number of storms predicted despite El Niño",
    "Invasion of Ukraine ‘has fuelled funding boom for clean energy’",
    "Slowing ocean current caused by melting ice could have drastic climate impact, study says",
    "Florida mother behind ban on Amanda Gorman poem has links to far-right group",
    "Panel recommends impeaching state attorney general Ken Paxton",
    "Ron DeSantis Republican heads to early primary states",
    "Florida Governor sued over law banning drag performances",
    "Minority groups warn America of danger from ‘dictator’ DeSantis",
    "US supreme court shrinks clean water protections in siding with Idaho couple",
    "Ex-guard charged with 95 counts of sexual abuse in women’s prison",
    "Teen dies while climbing bridge in apparent social media stunt",
    "Man who debunked Mike Lindell’s ‘blatantly bogus’ data wants his $5m",
    "Rightwing group takes aim at retailer for offering Pride merchandise",
    "House Democrats laugh off call for ‘decorum’",
    "Utah toddler struck in head by stray bullet at day care while playing outside",
    "Winnie-the-Pooh book teaches kids to ‘run, hide, fight’ in a shooting",
    "British man, 85, ‘shot and wife starves to death’ after being left in Sudan",
    "Security guards still jailed in Qatar after dispute over unpaid wages",
    "Man arrested after car crashes into gates of Downing Street",
    "Kabuki actor found collapsed at home alongside parents",
    "Material found in Portugal search sent for analysis",
    "Juror jailed for causing rape trial to collapse by researching defendant online",
    "Disgust over Brazilian mobile phone slavery game",
    "Rwandan war criminal tracked to South Africa",
    "Typhoon Mawar tears through island, leaving most without power",
    "Suspect detained after four killed in shooting and stabbing attack in Nagano",
    "Conspiracy theories and chaos: a week watching GB News",
    "Listen to previous episodes",
    "Romeo and Juliet movie child abuse lawsuit to be thrown out by judge",
    "The reader interview Post your questions for Brian Cox",
    "Am I the only gamer who has no interest in Zelda: Tears of the Kingdom?",
    "Is Nicolas Cage finally getting his turn in the Superman suit?",
    "A flawed reminder of when Star Wars was still an event",
    "Wim Wenders explores a quiet life in Tokyo",
    "'I’m Britain’s ‘dullest woman’",
    "Should my fiance start drying his hands instead of letting them drip dry?",
    "My husband and I are separating – but he doesn’t want anyone to know",
    "Dua Lipa designs first collection for Versace",
    "I’ve met a man and want to start a family – but I’m scared of penetration",
    "South Australian cabernet sauvignon selling for $40 named best in world",
    "Scientists use AI to discover new antibiotic to treat deadly superbug",
    "Hibernation artificially triggered in potential space travel breakthrough",
    "How his ‘sordid’ diplomacy in Africa fuelled war in Angola and prolonged apartheid",
    "Will America’s first ‘right to sleep outside’ actually help people?",
    "Inside the Thai clinic taking on westerners’ gaming addictions",
    "‘I sat on Diana Dors’s knee and she said: “Aren’t you lovely!”’",
    "Statesman or war criminal? His troubled legacy",
    "A road trip from Texas to LA",
    "Sexual subcultures, fetish on film and banned books",
    "Mexico’s Popocatépetl volcano spews ash and smoke",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US cities to pay record $80m to people injured in 2020 racial justice protests",
    "Florida mother behind ban on Amanda Gorman poem has Proud Boys links",
    "FBI files reveal plot to kill Queen Elizabeth during US trip in 1983",
    "‘It’s new territory’: why is Betelgeuse glowing so brightly and behaving so strangely?",
    "Queensland girl, 12, leaps from Mega Drop show ride after harness malfunction",
    "The week in wildlife – in pictures"
]