[
    "The Guardian - Back to home",
    "Russia-Ukraine war: evacuations under way near Kherson after Kyiv accuses Moscow of destroying dam",
    "Ukraine accuses Russia of blowing up Nova Kakhovka dam",
    "The collapse of Ukraine’s Nova Kakhovka dam",
    "Everything you need to know",
    "City approves funding to build ‘Cop City’ despite fierce opposition",
    "‘An awesome day’ LIV’s Mickelson and Koepka celebrate merger with PGA",
    "PGA Tour, LIV Golf and DP World Tour agree to make shock merger",
    "Prince Harry Britain’s government and press at rock bottom, royal tells court",
    "Harvard affirmative action challenge partly based on Holocaust denier’s work",
    "Black woman in Florida fatally shot through front door by white neighbor",
    "Sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "Too late now to save Arctic summer ice, scientists find",
    "The Girl from Ipanema singer dies aged 83",
    "Actor settles New York rape lawsuit, averting trial",
    "America is obsessed with striving. Is it time to redefine it?",
    "Why an independent abortion clinic is suing Planned Parenthood",
    "How my father’s dementia echoed my own alcoholism",
    "George Floyd's uncle on three years of heartbreak and fighting for justice",
    "The LGBTQ+ families fleeing red states",
    "25 years of Sex and the City nailing life as a single woman",
    "At 12, I was in Auschwitz. My parents and seven siblings were murdered. Here is how I built a life",
    "Limp, lifeless robot sequel",
    "The best albums of 2023 so far",
    "Is the Vision Pro more than just another tech toy for the rich?",
    "Astrud Gilberto, The Girl from Ipanema singer",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Americans want to join unions. The supreme court doesn’t like that",
    "Climate risks have made California uninsurable. When will we wake up?",
    "I’m a trans teen in Missouri. Why is the state trying to take away my healthcare?",
    "Golf PGA Tour, LIV and DP World Tour agree to merge",
    "LIV’s Mickelson and Koepka celebrate merger with PGA",
    "Inter Miami would be a dubious landing spot for Messi",
    "The brutal realities of life in MLR",
    "French Open: Djokovic v Khachanov; Sabalenka powers into semi-finals",
    "Kanté offered annual salary of up to $106m to join Saudi club",
    "Golden Knights put seven past Panthers for 2-0 lead",
    "Zlatan was more than a cocky Swede who did not follow the rules",
    "Tottenham confirm Postecoglou’s appointment as manager",
    "Microplastics found in every sample of water taken",
    "Rich countries with high greenhouse gas emissions could pay $170tn by 2050",
    "Countries must put aside national interests for climate crisis, UN says",
    "Rich nations undermining work to help poor countries, research suggests",
    "Son of late CIA director cautions against growing extremism in the US",
    "Man to be executed for killing two jailers in failed escape plot",
    "Family furious after coroner says death of Tasered man is ‘unexplained’",
    "SEC accuses cryptocurrency exchange of breaking US regulations",
    "California to set electricity bills based on people’s income",
    "Home Depot is selling house kits for less than $50,000",
    "Apple to tweak autocorrect that replaces one of the most common expletives",
    "Protesters demand that governor issue order banning all guns",
    "Philosopher announces US presidential campaign with People’s party",
    "Wolverine spotted for the second time ever in California in the last 100 years",
    "China begins drilling one of world’s deepest holes in hunt for discoveries deep inside the Earth",
    "Pope Francis visits hospital in Rome for tests",
    "Tehran claims to have created long-range hypersonic missile",
    "Syphilis cases at highest level for 75 years last year",
    "Poorest countries are biggest losers from economic shocks, says World Bank",
    "Reintroduction of endangered vulture in Spain paused over planned windfarm",
    "Rightwing governor of Lazio region withdraws backing for pride parade",
    "Businessman hit with €121,000 speeding fine",
    "Election of Delfina Gómez as governor of Mexico state signals decline of PRI",
    "Half of big international firms to cut office space in next three years – survey",
    "What is the UK government hiding from the Covid inquiry?",
    "Listen to previous episodes",
    "Giant woodland gateau is an absurd slice of joy",
    "Arnold Schwarzenegger expresses regret over groping claims",
    "The shocking story of Hollywood’s con queen",
    "Typically explosive end to rock’s silliest band",
    "The ultimate eco building – made of salt, sunflowers and recycled urine",
    "Light bondage and heavy sleaze make for the ultimate try-hard TV",
    "The ultimate panacea – or wildly overhyped?",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Why it is time to embrace your quilt – without the guilt",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "Can sleeping apart help a relationship?",
    "De La Soul were my first music love – something my dad always understood",
    "Judgment against Australia SAS soldier shows few have ever fallen so far",
    "Father of teen killed in Alabama mass shooting speaks out",
    "AI boosts climate information translation drive",
    "UK recorder fans warn instrument heading for extinction",
    "Seven steps to save the Amazon",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Prince Harry at court and D-day ceremonies",
    "50th World Environment Day",
    "Life under the Sicilian mafia",
    "The church at the end of the world – photo essay",
    "The everyday art of glassware",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "The truth about ‘local’ food in US supermarkets: ‘It’s a marketing gimmick’",
    "Astrud Gilberto, bossa nova singer of The Girl from Ipanema, dies aged 83",
    "‘Forget all the excuses’: Arnold Schwarzenegger expresses regret over groping claims",
    "Texas sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "Richer people pay more: California to set electricity bills based on people’s income",
    "Home Depot is selling tiny homes you can build yourself for less than $50,000"
]