[
    "The Guardian - Back to home",
    "Titanic sub search ‘Underwater noises’ picked up by Canadian plane, US coast guard says",
    "Titanic mini-sub Documents reveal multiple safety concerns",
    "Best and worst case scenarios Analysing Titan’s disappearance",
    "Canadians detect underwater noises in Titanic sub search area, says US Coast Guard",
    "Biden's verdict on Xi Jinping, day after Blinken visit aimed at easing China tensions",
    "Benzene levels emitted above secondhand smoke, US study finds",
    "Judge strikes down state ban on gender-affirming care for transgender minors",
    "Forty-one women killed in Honduras prison riot",
    "Macron and world leaders call on private finance to help reduce global poverty",
    "President's son to plead guilty to misdemeanor tax charges",
    "Bernie Sanders launches investigation into working conditions",
    "Iceland suspends annual hunt in move that likely spells end to controversial practice",
    "Groundbreaking youth-led climate trial comes to an end",
    "Largest study in decades upends myths",
    "Republicans crying wolf have hurt their own cause",
    "A priest confessed to abusing children. He returned to work and was never charged",
    "Best and worst case scenarios to explain loss of contact with surface",
    "Joanna Lumley on acting, travel – and her hatred of sex scenes",
    "The allure of extreme expeditions",
    "Glastonbury 2023 prepares to open gates",
    "France tells its 37m visitors where to go",
    "Harry Gesner’s California creation up for sale",
    "The eternal flame of The Wicker Man soundtrack",
    "Why are so many women still suffering with endometriosis?",
    "Has France treated Françoise Gilot worse than Picasso did?",
    "Russia threatens Ukraine’s ‘decision-making centres’ if Kyiv uses western arms",
    "At a glance What we know on day 483 of the invasion",
    "Extra $6bn in arms for Ukraine after ‘accounting error’",
    "Casualties mount as Ukraine’s forces inch south hamlet by hamlet",
    "Ukraine West needs strategy tying aid to corruption progress – thinktank",
    "Ukraine lacks capacity to process huge sums in aid, official admits",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "I am an oncologist. Can ChatGPT help me deliver bad news to a patient?",
    "Canada is on fire, and big oil is the arsonist",
    "My friend Harvey Milk celebrated hope. This Pride month, unions provide it",
    "So daytime naps can boost your brain power? No wonder I’m a crossword genius",
    "David Cameron left Britain exposed to the pandemic – where’s the outrage?",
    "I wasn’t shocked by the racist abuse of Vinícius",
    "$60m a year Messi set to make debut on 21 July",
    "Paul discovered he had been traded in text from 14-year-old son",
    "French police search Games HQ in Paris",
    "Australia beat old rivals England in thrilling series opener",
    "FA urges Fifa action after walk-off in match over alleged racism",
    "West Ham expected to reject Arsenal’s new £90m Rice bid",
    "Watson says PGA has ignored ‘moral issue’ in deal with LIV",
    "Country to shut down climate protest group citing public safety risks",
    "Debt relief urgent for poor countries hit by climate shocks, says IMF chief",
    "Rewetting England’s lowland peat could help meet emissions target, says study",
    "Nature at risk of breakdown if Cop15 pledges not met, world leaders warned",
    "New Orleans archdiocese concealed serial child molester for years",
    "Republican’s non-profit paid PR firm that also represents her for-profit work",
    "What to know and what it means",
    "Search for missing actor scaled back",
    "Three men including ex-NYPD officer convicted of harassing Chinese exile",
    "Texas lawmaker will ‘carry out’ duties in husband’s impeachment trial",
    "Ex-president to face trial in mid-August over classified documents charges",
    "Gay rights are going backwards in the US, says Elton John",
    "Unique Miami dialect traced to Cuban influence",
    "EPA sued over reapproval of toxic herbicides using Agent Orange chemical",
    "Privacy trial judge asks why ex-tabloid editor has not given evidence",
    "At least four people killed by Palestinian gunman",
    "Three more bodies found by authorities after shipwreck",
    "Legendary site of dictator’s murder now open to Rome tourists",
    "Tabloid Bild to replace range of editorial jobs with AI",
    "Dame Sally Davies apologises to Covid bereaved in emotional hearing",
    "The student turning the tide on diversity in surfing",
    "Tropical Storm Bret forecast to strengthen into hurricane",
    "Advocate for separate Sikh state in India shot dead",
    "Short daytime naps may keep brain healthy as it ages, study says",
    "Held v Montana: the young people fighting for the climate in court",
    "Listen to previous episodes",
    "Apple TV+ remake of sci-fi classic Metropolis cancelled",
    "The composer who wrote a concerto during 12 lots of chemo",
    "Actor Natalie Morales on the end of Roe",
    "20 of the best upcoming video games",
    "The family life of a Nobel prizewinner caught on film",
    "Translator alleges work on Chinese radical ‘plagiarised’",
    "'I talked a man out of jumping off a bridge – and it made me confront a harsh reality'",
    "How I found joy in life without children of my own",
    "The Nordic countries on a budget – send us a tip and you could win a holiday voucher",
    "Recipe for roast carrots, garlic and orzo",
    "Biotech pioneer Lindy Durrant",
    "What’s the best way to store and use spices?",
    "Kenyan rape survivors find help hard to find",
    "After a cash grab and a brutal blackout, will it ever be the same?",
    "Why mosses are superheroes of the plant world",
    "How he became a weapon in Reddit’s civil war",
    "Celebrities are smoking again",
    "Protest in Gaza and cyclone in Brazil",
    "Beach bodies in 1970s Los Angeles",
    "Archives of the Windrush generation",
    "The human costs of Iraq’s oil",
    "What the models, stylists and tailors wore to fashion week in Florence",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Titanic sub search: underwater noises picked up by Canadian plane, US Coast Guard says",
    "Who’s unhoused in California? Largest study in decades upends myths",
    "Best and worst case scenarios to explain Titan’s loss of contact with surface",
    "Bernie Sanders launches investigation into working conditions at Amazon",
    "Republicans crying wolf over Hunter Biden have hurt their own cause",
    "Extra $6bn in US arms for Ukraine after ‘accounting error’"
]