[
    "The Guardian - Back to home",
    "Analysis Ukraine counter-attack looks imminent as troops search for Russian weaknesses",
    "Ukraine Significant escalation in fighting reported in Donetsk and Zaporizhzhia",
    "Wagner group Mercenaries capture Russian commander as Prigozhin feud with army escalates",
    "Moscow claims to have repelled ‘major’ Donetsk attack, claiming 250 Ukrainian troops killed",
    "Trump critics warn of ‘deep decline of rule of law’ if he wins second term",
    "Rethink, reform, rebuild Seven steps to save the Amazon",
    "Colleagues to complete slain reporter’s book",
    "Trump-era officials under fire as nuclear fund for Bikini islanders is squandered",
    "Footage released of near miss between Chinese warship and US destroyer",
    "Police open criminal negligence case",
    "Prince Harry not in court for phone-hacking trial ‘due to daughter’s birthday’",
    "Saudi Arabia warns users that ‘insulting’ regime is a criminal offense",
    "US jets pursue light aircraft over capital before it crashes in Virginia",
    "Sleeping apart due to snoring could improve relationships, scientist says",
    "Colossal data centers are taking over the US countryside",
    "How a copyright dispute over FBoy Island is consuming world of reality TV",
    "The ultimate panacea – or wildly overhyped?",
    "A woman’s 10-year fight for justice against gang-rapists",
    "Father of teen killed in Alabama mass shooting speaks out",
    "Are cats really domesticated?",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Italy’s ‘new Michelangelo’ bringing sculpture into 21st century",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "‘People were horrified. Then David Bowie bought it’",
    "How Ghana became fast fashion’s dumping ground",
    "Was Brian Cox written out of Succession too soon?",
    "War brings urgency to fight for LGBT rights in Ukraine",
    "What we know on day 467 of the invasion",
    "Pro-Ukraine group of partisans captures Russian soldiers",
    "Two-year-old girl killed in Russian missile attack on Dnipro",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Five things the US debt-ceiling deal suggests about the future",
    "For better or for worse: is the decline in marriage actually good for relationships?",
    "Spain’s snap election could kill its housing revolution before it even gets started",
    "What even is El Niño? To be honest nobody really understands or cares any more",
    "Royal but redundant: why the Disney prince is an endangered species",
    "You can get Sad in summer – as I know only too well",
    "Heat’s fourth-quarter rally upsets Nuggets in Game 2",
    "León beat LAFC to continue Mexican dominance",
    "Liverpool poised to sign Mac Allister from Brighton",
    "Woods hails Zhang as 20-year-old wins on pro debut",
    "Spurs agree contract with Postecoglou to make him manager",
    "French Open: Jabeur through, Rune and Ruud in fourth-round action",
    "Manchester United exposed at Wembley as a club stuck in the past",
    "Hamilton hints he will be staying with Mercedes",
    "Rich nations undermining work to help poor countries, research suggests",
    "Why we need to respect Earth’s last great wilderness",
    "Can Mediterranean holidays survive?",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Migrants flown from Texas to California and left outside church were ‘lied to’",
    "Directors union reaches tentative deal with studios as writers strike",
    "Florida taxpayers pick up bill for governor's culture war lawsuits",
    "Family confirms missing resident found deceased in building collapse",
    "Chuck Todd to leave Meet the Press after nearly 10 years",
    "Traffic cop sues city over ‘get-out-of-jail-free’ cards for NYPD friends and family",
    "School offers yearbook reprints after objections to LGBTQ+ content",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Gisele Barreto Fetterman, wife of US senator, hits out",
    "Brazil police charge alleged mastermind behind murders",
    "Officials fear for historical artefacts threatened by fighting",
    "Film required so much pink paint it contributed to worldwide shortage",
    "Judge releases scathing full judgment on Ben Roberts-Smith",
    "Airlines on course for near-record revenues of $803bn in 2023, says Iata",
    "Fighting escalates after breakdown in ceasefire talks",
    "Signal fault identified as cause, says minister",
    "Woman pardoned after 20 years in jail over deaths of her four children",
    "Brent crude price rises after Saudi Arabia agrees to cut output",
    "Hundreds of thousands march against rightwing populist government",
    "Our critics’ guide to a summer of music, movies and culture",
    "Listen to previous episodes",
    "Wild skateboarding doc heads for Turkey",
    "Is Nick Cave a conservative? Depends what kind of conservative you mean",
    "Has the era of prestige TV just ground to a halt?",
    "‘Reading Camus led to psychedelic exploration with a shaman’",
    "The rise of perfectionism – and the harm it’s doing us all",
    "De La Soul were my first music love – something my dad always understood",
    "My life as a pedestrian in badly behaved Britain",
    "Why Britain’s curry houses are in decline",
    "Can you use a pasta strainer instead of a hairdryer diffuser?",
    "Should I worry about them?",
    "Hongkongers defy attempts to forget Tiananmen",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Revisiting the strange story of Natalia Grace",
    "Events in Brazil and UK to celebrate lives of Dom Phillips and Bruno Pereira",
    "What’s at stake for royal as he gives evidence in phone-hacking trial?",
    "The church at the end of the world – photo essay",
    "Strawberry moon and Lightsaber lessons",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Russian airstrikes in Kyiv, a shaky ceasefire in Sudan and protests in Senegal",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Wagner captures Russian commander as Prigozhin feud with army escalates",
    "‘It’s like a death pit’: how Ghana became fast fashion’s dumping ground",
    "Ben Roberts-Smith and four key witnesses were not honest or reliable, judge says in full verdict",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "US jets pursue light aircraft over Washington DC before it crashes in Virginia",
    "Taiwan Strait: footage released of near miss between Chinese warship and US destroyer",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped"
]