[
    "The Guardian - Back to home",
    "South Carolina Judge halts abortion ban",
    "PFAS levels in ground and air could be higher than expected, research suggests",
    "Donald Trump Workers at Mar-a-Lago moved boxes of papers day before FBI visit – report",
    "Donald Jr confuses his father with DeSantis",
    "US to give away free lighthouses as GPS makes them unnecessary",
    "Incarcerated people use TikTok videos to expose Alabama’s prison conditions",
    "Russia-Ukraine war: two people dead and 30 injured in Russian attack on Dnipro clinic",
    "Singer cancels tour dates as a result of neurological disorder",
    "Doctor won’t lose license after speaking out about child rape victim who had abortion, board rules",
    "Family demands officer be charged for shooting 11-year-old who called 911",
    "Berlin police investigate Roger Waters over Nazi-style uniform at concert",
    "How to improve US cities and tackle the climate crisis? Get rid of parking spaces",
    "Voters in Turkey’s quake zone backing Erdoğan in runoff",
    "Will Ron DeSantis’s culture war with Disney threaten his White House run?",
    "The people leaving everything behind to seek refuge in US",
    "Walkable community is a shining example for the few with access to it",
    "The best and worst Westminster insider novels",
    "The man who lives in Maradona’s head: opening a window on the new Naples",
    "Progressive Portland takes a hard turn on homelessness",
    "Lake Tahoe resort plan sparks outcry",
    "My life as a makeup artist in badly behaved Britain",
    "We can’t all be Martha Stewart. Here are my tips on buying a swimsuit",
    "How Yellowjackets has taken survival horror to new heights",
    "Russian attack on outpatient clinic in Dnipro kills two people",
    "Russian weapons manufacturers hosted at Riyadh trade event",
    "The film-maker who drove 400 Ukrainians to safety",
    "The Ukrainian app used to do taxes … and report Russian soldiers",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "My white colleagues keep asking to touch my braided hair. How do I tell them it’s not OK?",
    "‘Farming good, factory bad’, we think. When it comes to the global food crisis, it isn’t so simple",
    "David Attenborough’s new series at last shows dinosaurs in all their feathered glory",
    "No, Succession’s antiheroes don’t have a good side: that’s what makes it so compelling",
    "Netflix ends password-sharing – but I’m close to bailing anyway",
    "How the Savannah Bananas became the greatest show in sports",
    "Mourinho Manager has feelings for former clubs – except Spurs",
    "Premier League: 10 things to look out for on day of drama",
    "Celtics roll Heat in Game 5 to inch closer to historic comeback",
    "Ivan Toney FA finds player repeatedly bet on own club",
    "Toney found to be ‘betting on himself’; season climaxes loom – soccer news",
    "Epic 211-shot rally delights fans at doubles match in Malaysia",
    "Djokovic and Alcaraz could meet in semi-final as draw is made",
    "Nascar opens investigation into driver’s hacked radio channel",
    "Carlsen prevails in Poland after eventful early loss",
    "Fear and fury as the last spotted owl in Canada fights for survival",
    "First cheetah cubs born in more than seven decades die in heatwave",
    "US supreme court shrinks clean water protections in siding with Idaho couple",
    "Seaweed could avert food crisis caused by extreme weather",
    "Florida mother behind ban on Amanda Gorman poem has links to far-right group",
    "FBI files reveal plot to kill queen during US trip in 1983",
    "US veterans defrauded by for-profit universities fight to restore benefits",
    "Joe Biden’s advisers say he doesn’t want to drag Pacific allies into ‘headlong clash’",
    "Elon Musk’s brain implant company approved for in-human study",
    "Panel recommends impeaching state attorney general Ken Paxton",
    "Founder of far-right militia sentenced to 18 years over January 6 attack",
    "Ex-guard charged with 95 counts of sexual abuse in women’s prison",
    "Teen dies while climbing bridge in apparent social media stunt",
    "Rightwing group takes aim at retailer for offering Pride merchandise",
    "Police seize 58kg of cocaine bearing pictures of Nazi flag",
    "Iran Supporters of jailed journalists call for trial to be held in public",
    "Belgium aid worker freed in prisoner swap with diplomat jailed for bomb plot",
    "Police re-arrest TikToker Mizzy who filmed himself entering stranger’s home",
    "Ex-fraternity members found guilty over death of student",
    "PC barred over Wayne Couzens inquiry says she’s been ‘thrown under a bus’",
    "British man, 85, ‘shot and wife starved to death’ after being left in Sudan",
    "Pontiff misses Friday audiences because of a fever, Vatican says",
    "Couple jailed for ‘savage’ Christmas Day murder of baby son",
    "Police investigate after plane door opened mid-flight",
    "Sunak takes helicopter to Yorkshire – via stopoff just two miles from an airport",
    "Conspiracy theories and chaos: a week watching GB News",
    "Listen to previous episodes",
    "Stand-up comedian makes for limp movie star",
    "Verdict and prize predictions for Cannes 2023",
    "Alice Rohrwacher’s uproarious adventure teems with life",
    "James M Cain: lost story by ‘poet of the tabloid murder’ discovered in Congress library",
    "‘Older straight men hated my films with a vengeance’",
    "Palates are ready to welcome cuisine like mine in France",
    "'I’m Britain’s ‘dullest woman’",
    "Biting the skin off my fingers feels like self-harm – but I can’t stop",
    "Cannes fuses film and glamour in unofficial fashion week",
    "Should my fiance start drying his hands instead of letting them drip dry?",
    "Readers’ cultural highlights in Europe",
    "Meet the Londoner who lives among billionaires for £200 a week",
    "How body hair went out of fashion in the UK",
    "What is it and why were 100 UK families seeking compensation?",
    "Inside Hollywood’s battle over artificial intelligence",
    "Europe’s Turkish diaspora split as large numbers vote in election runoff",
    "Singer, diva, fashion icon, trailblazer, dancer",
    "Statesman or war criminal? His troubled legacy",
    "K9 handler and George Floyd protests",
    "A road trip from Texas to LA",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Trump has the charisma of a mortician’: Donald Jr confuses dad with DeSantis",
    "‘Stick over carrot’: progressive Portland takes a hard turn on homelessness",
    "‘It’s new territory’: why is Betelgeuse glowing so brightly and behaving so strangely?",
    "Florida mother behind ban on Amanda Gorman poem has Proud Boys links",
    "‘I feel safe here’: the people leaving everything behind to seek refuge in US",
    "Indiana abortion doctor who spoke out about child rape victim can keep license",
    "Middle East and north Africa"
]