[
    "The Guardian - Back to home",
    "Key takeaways Divisions were revealed as both sides claim a win",
    "US House passes bill just days before default",
    "Ex-president regretted not declassifying retained military document in recording",
    "Sudan At least 60 children die trapped in Khartoum orphanage amid conflict",
    "19 killed in shelling of market in poor area south of Khartoum",
    "Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Three die in early morning attack by Russia",
    "Woman jailed in Tehran calls for environmentalists’ release",
    "11.6m graduates face a jobs market with no jobs",
    "Star of That ’70s Show found guilty of rape",
    "Utility avoids trial for 2020 wildfire that killed four",
    "Australian researchers make world-first breakthrough",
    "How a Mexican state siphoned off millions – and a reporter risked her life to expose it",
    "Hundreds were killed. Are we already forgetting them?",
    "The farmers dealing with shortages even before historic Colorado River deal",
    "The side hustle that keeps a literary author’s career afloat",
    "The backlash: how slavery research came under fire",
    "‘To the class of 2023, I say three words: you poor bastards’",
    "The untold story of women in American journalism",
    "Your verdicts on the Succession finale",
    "Inside a revealing Paul Newman and Joanne Woodward auction",
    "After half a century, still having the time of his life",
    "What US job will shrink the most in the next decade?",
    "Crazily frantic sequel with full-spin energy",
    "Weapons US announces $300m arms package for Ukraine – with a caveat",
    "Russia-Ukraine war: fresh air raid sirens in Kyiv after Russian strikes kill three including child",
    "The Ukrainian soldiers training to retake Bakhmut",
    "Macron Negotiating with Putin may have to take priority over war crimes trial",
    "What we know on day 463 of the invasion",
    "Dashcam footage shows falling missile debris hitting busy Kyiv road, narrowly missing cars",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Frilly dresses and white supremacy: welcome to the weird, frightening world of ‘trad wives’",
    "Across Europe, the far right is rising. That it seems normal is all the more terrifying",
    "Step aside David Brent and Michael Scott: why The Office Australia could be great",
    "Conservatives are bullying pro-LGBTQ+ companies, just in time for Pride Month",
    "Women's singles Garcia loss to Blinkova ends biggest French hope",
    "Djokovic defiant despite warning not to repeat political message",
    "As it happened Read Barry Glendenning's MBM report",
    "Montiel kick claims seventh Europa League triumph",
    "Bass sorry for anti-LGBTQ post as Kershaw backs Christian Faith Day",
    "How can the languishing National Spelling Bee regain its sting?",
    "McIlroy sticks with stance on European LIV rebels",
    "How bench players can tilt the NBA finals",
    "Our predictions versus reality",
    "Hudson quits as manager as second interim hired amid search",
    "Foggy future for Arctic shipping as sea ice melts",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Special counsel examining Trump’s firing of cybersecurity official",
    "Corporate workers walk out over climate goals and return to office",
    "Value down two-thirds since Musk takeover, says investor",
    "Actor will not face sexual assault charges in Los Angeles case",
    "Rapper accuses drinks giant Diageo of racism in US lawsuit",
    "Gas station owner charged with murder after teen killed",
    "Trump reiterates pledge to scrap right",
    "US eating disorder helpline takes down AI chatbot over harmful advice",
    "Barclays CEO Jes Staley contradicts JP Morgan chief’s claim they never discussed sex offender",
    "Governor Justice suggests coal empire lawsuit is political attack",
    "Here’s proof fishing bans leave plenty to eat, says study of Mexico marine park",
    "Marineland theme park charged over its handling of black bears",
    "Week after Typhoon Mawar, most of Guam still without basic services",
    "Analysis Battle to withhold Covid messages is about much more than Boris Johnson",
    "Boris Johnson hands over WhatsApps and notes to Cabinet Office after row",
    "Leftists jailed for string of violent attacks on neo-Nazis",
    "Firefighters tackle Highlands wildfire that may become UK’s largest ever",
    "‘Unprecedented’ Nova Scotia wildfires expected to worsen, officials warn",
    "Spies to be investigated over claims they were complicit in torture of CIA prisoner",
    "Man admits freezing leg of alleged ‘eunuch maker’ who was accused of broadcasting live castrations",
    "Official fined after draining reservoir in search of mobile phone",
    "Sofas, smiles – and scandal: what’s going on at ITV’s This Morning?",
    "Listen to previous episodes",
    "Kim Cattrall to return in And Just Like That",
    "How Succession ranks among TV’s great endings",
    "Reiner Riedler’s best photograph",
    "Books about connecting with nature",
    "Pop singer and film-maker announces she is on autism spectrum",
    "Jess Williamson on fate, Plains and her breakout fifth album",
    "Four ways to find love – without the apps",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "Airbnb is in denial over concerns we raised about our host",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The dating trend that is unlikely to improve your love life",
    "Dollar General safety violations alarm workers",
    "Outrage as law threatening Indigenous lands advances in congress",
    "Plight of migrants as slums razed in French territory of Mayotte",
    "40 years of the Smiths’ Peel Sessions",
    "‘People wanted to believe the fairytale’",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "Beyoncé and World Parrot Day",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "China’s 11.6m graduates face a jobs market with no jobs",
    "US House passes bill to raise debt ceiling just days before default",
    "Trump regretted not declassifying retained military document in recording",
    "Good riddance, Ted Lasso: how the ‘nice’ comedy became utterly dreadful television",
    "Danny Masterson, star of That ’70s Show, found guilty of rape",
    "US announces $300m arms package for Ukraine – with a caveat",
    "Amazon’s Ring doorbell was used to spy on customers, FTC says in privacy case",
    "House passes debt ceiling bill just days before deadline – as it happened"
]