[
    "The Guardian - Back to home",
    "Air quality Tens of millions under alerts as fire smoke drifts south",
    "Canada ‘Out of control’ fires burn as poor air quality set to persist",
    "At a glance What you need to know about fires and smoky skies",
    "Canada wildfire smoke: millions in the US under air quality alerts",
    "Russia Chaos on frontlines as war threatens to come home",
    "Russia-Ukraine war: counteroffensive not yet launched, says senior Kyiv official",
    "Pence Former VP officially enters 2024 presidential race",
    "Historic challenge Can Trump’s deputy become his nemesis?",
    "Mike Pence about to give presidential campaign launch speech in Iowa",
    "Star spurns Barcelona and Saudi Arabia to join Inter Miami in MLS",
    "Chief Chris Licht to leave cable news giant days after Atlantic profile",
    "Multiple witnesses subpoenaed in Florida in Mar-a-Lago case",
    "Host peddles conspiracy theories on Twitter debut from barn",
    "High school student and father killed in graduation shooting",
    "UN talks might avoid fossil fuel phase-out, says Cop28 official",
    "Duke has no proof newspaper journalists hacked phone, court told",
    "Scientists record first known ‘virgin birth’ in female crocodile",
    "Is eating local produce actually better for the planet?",
    "What are Minnesota’s new labor laws?",
    "Jeff Monson’s journey from American MMA muscle to Russian propagandist",
    "What does golf’s blockbuster ‘merger’ mean for the game and its players?",
    "The man who thought his parents killed his sister",
    "What’s really changed 10 years after the Snowden revelations?",
    "Our writers on their favorite LGBTQ+ songs",
    "A new system recasts gun violence as a public health concern. It’s saving lives",
    "The Groundhogs’ Tony McPhee will remain a hero for the musically adventurous",
    "Martin McDonagh on why casting Lily Allen in The Pillowman makes it even more electrifying",
    "Why Jess McDonald quit her job – and decided to tell all",
    "The news from a Mozambique landfill site",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Anyone who goes to a beach already has a ‘beach body’. Don’t strive for an illusion",
    "Autocorrect can be ‘ducking’ annoying, but we’ll miss its accidental poetry when it’s gone",
    "My home is cosy and comfortable, and there’s a kettle. Why would I want a night out?",
    "States haven’t stopped spying on their citizens, post-Snowden – they’ve just got sneakier",
    "Messi spurns Barcelona and Saudi Arabia to join Inter Miami",
    "McIlroy says there must be no way back for rebels",
    "A journey from American MMA muscle to Russian propagandist",
    "Swiatek sweeps past Gauff to reach semi-finals",
    "Europa Conference League final: Fiorentina v West Ham",
    "Club seal initial €100m deal to buy Bellingham from Dortmund",
    "Spanish rider Raul Torras Martinez dies in crash",
    "Texas ace set for season-ending surgery after inking $185m deal",
    "Chemical industry used big tobacco’s tactics to conceal evidence of PFAS risks",
    "Spate of US lawsuits calls big oil to account for climate crisis",
    "UAE state oil firm able to read Cop28 climate summit emails",
    "Fifa misled fans over ‘carbon-neutral Qatar' tournament, regulator finds",
    "Mega-donor faces new subpoena threat over gifts to Clarence Thomas",
    "North Dakota governor Doug Burgum announces Republican presidential bid",
    "Woman accused of shooting neighbor through front door arrested",
    "State confirms it was behind flights that left asylum seekers in California",
    "What you need to know about Canada wildfires and smoky US skies",
    "US urged to reveal evidence after claim that it has intact alien vehicles",
    "Ex-New Jersey governor launches 2024 bid",
    "Man executed for killing two jailers in failed escape plot",
    "Richer people pay more: dramatic change to electricity bills",
    "Sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "Ex-prime minister and health minister cleared of Covid culpability",
    "Pontiff has undergone intestinal surgery, says Vatican",
    "Labour on course for landslide election victory, megapoll suggests",
    "Italian F1 commentators suspended after sexist remarks on air",
    "Heat health alert issued for England this weekend",
    "Oldest carved piece of wood to be found in Britain dates back 6,000 years",
    "Briton tells of harassment in French bridle path dispute",
    "Police cancel plan to grant extra days off for migrant arrests on border",
    "Five police accused of torturing migrants and homeless people",
    "France opposed to opening of liaison office in Japan, official says",
    "How to develop artificial super-intelligence without destroying humanity",
    "Listen to previous episodes",
    "Subversive spirit shines through John Waters’ high-camp 80s musical",
    "Maggie Smith film that took 20 years to make to get premiere",
    "Actor announces debut thriller to be published in November",
    "The best games of 2023 so far",
    "French painter whose book about Picasso relationship became a bestseller",
    "Neglected 18th-century Black virtuoso finally gets his due",
    "10 ways to be more confident on dating apps",
    "Have you stopped washing your clothes or wash them less often?",
    "How a younger generation warmed to 80s style rules",
    "How to recognise it – and feed your cravings healthily",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "The ultimate panacea – or wildly overhyped?",
    "Which brands are supporting Pride in the wake of backlash?",
    "How the leak of the century came to be published",
    "How have you been affected by the Canada wildfires and the smoke in the US?",
    "Share your experiences of US abortion care with us",
    "A crypto obsession and early Crocs investment lie behind this outsider's success",
    "The father of ChatGPT on whether AI will save humanity – or destroy it",
    "A jubilee celebration and a grizzly bear",
    "Lunch mates and Brazilian beauty",
    "Icons shot by Richard Avedon in pictures",
    "Ukraine’s Kakhovka dam disaster",
    "Replastering Mali’s Great Mosque of Djenné",
    "Prince Harry at court and D-day ceremonies",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Multiple witnesses subpoenaed in Florida in Trump Mar-a-Lago case",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Tucker Carlson peddles conspiracy theories on Twitter debut from barn",
    "Kakhovka dam flooding before and after: satellite images reveal extent of disaster in Ukraine",
    "Tina Turner to Cindy Crawford: icons shot by Richard Avedon – in pictures",
    "CNN chief Chris Licht to leave cable news network days after Atlantic profile",
    "Biden ‘knew of Ukrainian plan to attack Nord Stream’ three months before explosion",
    "Lionel Messi spurns Barcelona and Saudi Arabia to join Inter Miami in MLS",
    "Chaos on frontlines as Ukraine war threatens to come home for Russia"
]