[
    "The Guardian - Back to home",
    "Donald Trump Ex-president regretted not declassifying retained military document in recording",
    "Months of distrust inside Trump legal team led to top lawyer’s departure",
    "Key takeaways Divisions were revealed as both sides claim a win",
    "US House passes bill just days before default",
    "Keith Ellison on the lessons of George Floyd",
    "Air force general convicted of abusive sexual contact losing ranking on retiring",
    "Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Plastic containers still distributed across the US are a potential health disaster",
    "19 die in shelling of market south of Khartoum after army quits ceasefire",
    "Three die in early morning attack by Russia",
    "Australian loses defamation case with judge finding ex-SAS soldier committed war crimes",
    "Star of That ’70s Show found guilty of rape",
    "Researchers make world-first breakthrough",
    "The Ukrainian soldiers training to retake Bakhmut",
    "The murders and war crimes at the heart of a seismic defamation battle",
    "Critics say ‘absolutely no change’ despite scandals",
    "Why 11.6m graduates face a jobs market with no jobs",
    "The backlash: how slavery research came under fire",
    "To the class of 2023, I say three words: you poor bastards",
    "Republicans love to make up fake crises. Here are five of the biggest",
    "Samantha Jones was the show’s best character. Here are 10 of her finest moments",
    "Why the Smiths are eternally influential",
    "Nuggets or Heat? Our writers share their picks",
    "The untold story of women in American journalism",
    "Swimming now has a wave of diversity to drown out Little Mermaid protests",
    "President pleads for ‘security guarantees’ for Ukraine and Moldova",
    "US announces $300m arms package for Ukraine – with a caveat",
    "What we know on day 463 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "US and China are on a collision course that could risk conflict",
    "Elizabeth Holmes’ big con deserved prison time – so why do I feel sorry for her?",
    "Gay and trans people deserve to live without persecution in the US. Why is that so hard?",
    "Africa will be transformed by the potential of AI and data – if we can get investment",
    "I’d love to laugh like a baby again. But the best I can hope for is a big sneeze",
    "Men's singles Kokkinakis gives Kyrgios perfect wake-up call with win",
    "Novak Djokovic Serb defiant despite warning not to repeat political message",
    "Women's singles Garcia loss to Blinkova ends biggest French hope",
    "French Open day five: Rybakina and Ruud in early action – live updates",
    "Europa League final Sevilla beat Roma on penalties",
    "José Mourinho swears at referee Taylor and calls him ‘disgrace’ in car park rant",
    "Bass sorry for anti-LGBTQ post as Kershaw backs Christian Faith Day",
    "How can the languishing National Spelling Bee regain its sting?",
    "McIlroy sticks with stance on European LIV rebels",
    "How bench players can tilt the NBA finals",
    "The farmers dealing with shortages even before historic Colorado River deal",
    "Foggy future for Arctic shipping as sea ice melts",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Special counsel reportedly examining firing of cybersecurity official",
    "Utility avoids trial for 2020 wildfire that killed four",
    "Corporate workers walk out over climate goals and return to office",
    "Value down two-thirds since Musk takeover, says investor",
    "Actor will not face sexual assault charges in Los Angeles case",
    "Rapper accuses drinks giant Diageo of racism in US lawsuit",
    "Gas station owner charged with murder after teen killed",
    "Trump reiterates pledge to scrap right",
    "US eating disorder helpline takes down AI chatbot over harmful advice",
    "Barclays CEO Jes Staley contradicts JP Morgan chief’s claim they never discussed sex offender",
    "Nepali sherpa saves climber in rare ‘death zone’ rescue",
    "Grant Shapps urges No 10 to hand over Boris Johnson’s WhatsApps",
    "Here’s proof fishing bans leave plenty to eat, says study of Mexico marine park",
    "Non-EU workers outnumber EU ones in various UK sectors in post-Brexit shift",
    "Man accused of starting hostel fire faces five murder charges",
    "Marineland theme park charged over its handling of black bears",
    "Week after Typhoon Mawar, most of Guam still without basic services",
    "Leftists jailed for string of violent attacks on neo-Nazis",
    "Firefighters tackle Highlands wildfire that may become UK’s largest ever",
    "‘Unprecedented’ Nova Scotia wildfires expected to worsen, officials warn",
    "Sofas, smiles – and scandal: what’s going on at ITV’s This Morning?",
    "Listen to previous episodes",
    "Gays on Broadway by Ethan Mordden – book review",
    "Kim Cattrall to return in And Just Like That",
    "Orwell by DJ Taylor review – a very English socialist",
    "Newly unearthed writing draft reveals original title for Queen hit",
    "Katie Cuddon’s sculptural explorations of motherhood",
    "Your verdicts on the Succession finale",
    "Everyone thought we were dating. It’s rare for two men to be so close",
    "Stolen cupcakes, strange space things and a sudden holiday",
    "I’ve come to love Chișinău: my home city in Moldova deserves the spotlight",
    "Four ways to find love – without the apps",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "How a Mexican state siphoned off millions – and a reporter risked her life to expose it",
    "Woman jailed in Tehran calls for environmentalists’ release",
    "The side hustle that keeps a literary author’s career afloat",
    "Hundreds were killed. Are we already forgetting them?",
    "What US job will shrink the most in the next decade?",
    "Dollar General safety violations alarm workers",
    "Beyoncé and World Parrot Day",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Perfect storm of chaos’: A week after Typhoon Mawar, most of Guam still without basic services",
    "‘To the class of 2023, I say three words: you poor bastards’: the year’s best graduation speeches",
    "Trump regretted not declassifying retained military document in recording",
    "US air force general convicted of abusive sexual contact losing ranking on retiring",
    "Australian researchers make world-first endometriosis breakthrough",
    "Amazon’s Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Danny Masterson, star of That ’70s Show, found guilty of rape"
]