[
    "The Guardian - Back to home",
    "Full report US supreme court strikes down affirmative action",
    "Reaction Ruling shows ‘willful ignorance of our reality’, critics say",
    "Opinion Scotus blow to affirmative action is no coincidence",
    "Biden condemns ruling against race-conscious admissions: ‘This is not a normal court’",
    "Extreme heatwaves continue to grip US as millions under heat and air quality alerts",
    "‘There’s so much anger’ France braces for more rioting over police shooting",
    "France Boy shot dead by police was ‘well-liked kid’ with ‘real potential’",
    "Officer charged as Macron tries to put lid on anger",
    "Artificial sweetener to be declared possible cancer risk by WHO, say reports",
    "Former vice-president meets with Volodymyr Zelenskiy during Ukraine visit – report",
    "Unhoused population reaches 75,000 amid humanitarian crisis",
    "Suspect charged in hate-motivated stabbing in university gender issues class",
    "Republican says as US president he would eliminate IRS and other agencies",
    "Three charged with insider trading over ex-president's social media company merger",
    "Catholic church ‘dying painful death’ as 500,000 leave in a year",
    "Microscopic ‘Louis Vuitton’ bag sells for more than $60,000",
    "How does extreme heat affect the body and what can you do about it?",
    "Canada fires force US crews to shift strategy",
    "What’s driving anti-LGBTQ+ hate in America?",
    "MLB’s pace-of-play rules are showing that less is more",
    "Kremlin quiet on fate of Russian general with links to Wagner boss",
    "Exiles’ hopes dashed as Lukashenko boasts of saving Putin",
    "EU mulls levy on frozen Russian assets to support reconstruction",
    "Wagner mutiny has weakened Putin, says chancellor",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "Get set for the Barbie-Oppenheimer smackdown",
    "Are they destroying our gut health?",
    "Hollywood’s fascination with fake pop songs",
    "Artists examine importance of inheritance",
    "Bowie bids farewell to an icon in legendary gig",
    "This duo serves a segment that the big brands ignore",
    "Henry Cavill’s pulse-quickening last stand as an anti-heroic hunk",
    "Sign up to the US opinion email",
    "The supreme court’s blow to US affirmative action is no coincidence",
    "Biden has reminded us yet again that he’s a weak and lukewarm ally of abortion rights",
    "I am cursed to wear compression socks. Spare a thought for me this summer",
    "The failed Wagner coup shows Vladimir Putin’s regime remains stubbornly strong",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "League suspends three players indefinitely for violating gambling policy",
    "Domingo Germán Yankee throws 24th-ever perfect game",
    "'Netting saves lives' Mäder’s death prompts new safety calls",
    "Full team-by-team guide and the riders to watch",
    "Wimbledon Grass schedule creates surface tension",
    "Wimbledon made me and Wimbledon saved me",
    "Wozniacki comes out of retirement and will play at US Open",
    "Blackhawks tab ‘generational prospect’ Bedard with No 1 pick",
    "Hamilton urges fans to avoid repeat of abusive scenes at Austrian GP",
    "Jesús Ferreira scores hat-trick as USA put six past St Kitts",
    "Rising seas have flooded this town three times. It may not survive a fourth",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Why are sea lions and dolphins dying along California’s coast?",
    "Climate crisis linked to rising domestic violence, study finds",
    "Milwaukee plant to close after 100 years and send jobs abroad",
    "White House issues warning to US firms interested in acquiring Israeli surveillance tech",
    "US travelers face cancelled and delayed flights ahead of Fourth of July holiday",
    "Museum faces backlash for hosting group with ‘oppressive views’",
    "Group hacks agencies in US states attacking gender-affirming care",
    "State’s first-in-nation reparations taskforce to release final report",
    "Muslims vow to continue call to prayer despite rise in mosque attacks",
    "Elections official downplays cybersecurity threats despite report",
    "Presumed human remains recovered from within wreckage, US Coast Guard says",
    "Man gets prison time for years-long cow dung scam",
    "‘Witch-hunt’ What Johnson’s allies said about the inquiry",
    "Boris Johnson allies launched ‘unprecedented’ campaign to undermine privileges committee",
    "Company to fly customers to edge of space at up to $450,000 per ticket",
    "Many without power as deadly heat leads to strain on grid",
    "Teenage security guards stuck in Gulf state after World Cup",
    "Protesters breach Sweden’s embassy over Qur’an burning",
    "Broadcaster reprimanded over ‘graphic’ dolphin mating scene",
    "Protesters gather in Helsinki over ministers’ far-right links",
    "Operations against UK leftwing groups unjustified, judge finds",
    "Oversight board orders firm to take down video by Cambodian leader",
    "Alexis Tsipras to step down as Syriza leader after election rout",
    "Guards at Del Monte pineapple farm in Kenya accused of killings",
    "Listen to previous episodes",
    "‘Songs tumble out like dreams – you can’t control them’",
    "Peter Ustinov art goes on sale",
    "I wanted to play but my hand wouldn’t move",
    "Rapper charged with domestic violence",
    "Singer's tour postponed after she suffers ‘serious’ bacterial infection",
    "He made me realize I’m woke – I thought it was a negative thing",
    "Pet owners find new ways to process grief",
    "People think it’s harder to make new friends after a certain age. We prove it’s possible",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "Stag do mishaps, pizza origins, and a very ugly dog",
    "The married couple competing to have the biggest and best facial hair",
    "What has affirmative action achieved?",
    "Skin disease in cetaceans off North American coast concerns scientists",
    "How Wimbledon and apartheid South Africa blocked a teen’s tennis dream",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "Mike Figgis on Julian Sands",
    "Celebrating diversity and equality in photography",
    "Clashes rage over police shooting",
    "Kusama and a kiss from Putin",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "DeSantis says as US president he would eliminate IRS and other agencies",
    "Biden condemns ruling against race-conscious admissions: ‘This is not a normal court’ – live",
    "‘It burns wild and free up there’: Canada fires force US crews to shift strategy",
    "Aspartame sweetener to be declared possible cancer risk by WHO, say reports",
    "US supreme court rules against affirmative action in Harvard and UNC cases",
    "National Geographic reportedly lays off its last staff writers",
    "German Catholic church ‘dying painful death’ as 520,000 leave in a year"
]