[
    "The Guardian - Back to home",
    "Nike may have misclassified workers and could face over $530m in tax fines",
    "Eight-year-old girl dies after being detained by border patrol",
    "Full story DeSantis expected to formally enter 2024 race",
    "US politics Conspiracy theorists to address House subcommittee, watchdog warns",
    "US Congress Schiff ‘not backing down’ in face of Republican bid to expel him",
    "Ron DeSantis reportedly on verge of officially launching 2024 presidential bid",
    "‘Duke (and Duchess) of hazard’ How US and UK press covered the Harry and Meghan car chase story",
    "Security ‘should have been properly stage-managed’",
    "Russia-Ukraine war: Wagner chief accuses Russian army of leaving his troops exposed in Bakhmut",
    "At least nine dead and 20,000 homeless in worst flooding in 100 years",
    "Deutsche Bank agrees to pay $75m to settle lawsuit",
    "Pentagon’s cleanup budget falls ‘dramatically’ short",
    "Stellantis demands billions in subsidies to keep planned battery plant",
    "Doctors depart as attorney general investigates hospital’s gender-affirming care",
    "Top five hoard $9bn tax-free for retirement as workers face limits",
    "Montana State becomes first in US to ban TikTok",
    "Why has it happened and will it work?",
    "Dancers at club to become the US’s only unionized strippers",
    "US child killings have risen rapidly – why are more states pushing for joint custody laws?",
    "Blues singer gets high school diploma decades after being expelled for his hair",
    "Residents on life in Mariupol a year since Russian occupation",
    "What we know on day 449 of the invasion",
    "Moscow court orders arrest of Oscar-nominated film producer for criticism of war",
    "Mercenary who fought for Russia in Ukraine jailed",
    "The new marine sanctuary for the super-rich LA coast",
    "Increasingly sophisticated and deadly",
    "Taco Bell battles to ‘liberate’ trademarked phrase",
    "I’ve struggled to make friends since moving abroad – and it’s making me lonely",
    "Harrison Ford’s 20 best performances",
    "RK Russell on coming out in the male world of football",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "It’s time to guarantee healthcare to all Americans as a human right",
    "The US debt ceiling crisis is more proof of Republicans’ cynicism and bad faith",
    "Let’s teach children about slavery properly by connecting it to our present",
    "If Macron doesn’t know why he’s despised, he hasn’t been listening",
    "I have unsavoury habits in the kitchen – but don’t we all?",
    "Assad’s regime took my father. Normalising relations feels like an attempt to rewrite history",
    "The fall of Rudy Giuliani, once the toast of New York, continues unabated",
    "I left my party lifestyle behind for a week in a nunnery – and began to see the light",
    "Heat strike first against Celtics in East finals behind Butler’s masterclass",
    "Book extract: former NFL player RK Russell on coming out",
    "PGA Championship: first round begins",
    "Man City 4-0 Real Madrid (agg: 5-1) Silva leads march into Champions League final",
    "Manchester City’s destruction of Real Madrid has the feel of an era-defining triumph",
    "The clash captivating football fans in Paraguay",
    "Blue Jays’ Jackson says he was tipping pitches against Yankees’ Judge",
    "The San Antonio Spurs won the draft lottery. So did Victor Wembanyama",
    "LIV rebels can shake up Ryder Cup reckoning",
    "Global heating has likely made El Niños and La Niñas more ‘frequent and extreme’",
    "Quarter of a million Somalis flee flooded homes",
    "Climate breakdown made southern Asia heatwave at least 2C hotter, study finds",
    "World likely to breach 1.5C climate threshold by 2027, scientists warn",
    "Can Imran Khan really take on the Pakistani army and win?",
    "Listen to previous episodes",
    "The everlasting appeal of giant art panoramas",
    "Comedy remake fumbles the shot",
    "Russia orders arrest of Oscar-nominated producer for criticism of war",
    "What the hell is going on with this bizarre editing of Sly’s life?",
    "It’s the genuine escape we all need",
    "How one woman raised $100,000 for cancer treatment she never needed",
    "Convoluted but charming Netflix teen series",
    "Beatriz Milhazes’s carnivalesque odes to nature",
    "Hits and grit from the new pope of mope",
    "Stephen ‘Jorbs’ Flavall speaks out on the dark side of Twitch streaming",
    "‘She is a big conspiracy theorist – I came out thinking, what was that?’",
    "Falling in love with Albania",
    "Sweden’s winner, Sunak’s losers and Toyah’s guitar hero",
    "How to start dating again after heartbreak",
    "A brutal attack ended my dreams of being a boxer – but I found a new passion",
    "Cracking modular PC gets all-round upgrade",
    "Trust in court fell to lowest in 50 years after abortion decision, poll reveals",
    "Ron DeSantis expected to formally enter race next week",
    "Schiff ‘not backing down’ in face of Republican bid to expel him",
    "Conspiracy theorists to address House subcommittee, watchdog warns",
    "Pentagon leaks suspect was warned off viewing classified material – prosecutors",
    "House Republicans sidestep effort to expel fabulist from Congress",
    "Walgreens reaches $230m settlement with city over opioids crisis",
    "Noam Chomsky and Bard College president had financial dealings with sex offender",
    "Man indicted for stealing Dorothy’s ruby slippers from Wizard of Oz",
    "Avian flu vaccine for California condors approved amid fears of extinction",
    "Japan PM prepares push in Hiroshima for G7 pledge",
    "Iron age roundhouse rises from the ashes on shores of lake",
    "Westpac bans transfers to world’s largest crypto exchange",
    "Man arrested and charged with arson after fatal Wellington hostel fire",
    "Renovation of Brussels park ignites debate on decolonisation",
    "German carmakers join calls for changes to trade deal",
    "Injectable HIV-prevention drug to be made in South Africa for the first time",
    "Indefinite curfew after radio journalist is shot dead",
    "Imran Khan and Lahore police remain in tense standoff",
    "Assad to attend Arab League summit as west opposes rehabilitation",
    "Maybe so, but new parents in Iceland are holding out for better",
    "G7 wrestles with how to prosecute one war and prevent another",
    "The frantic search for Sudan’s missing",
    "Could a new brain-based treatment cure hot flushes?",
    "They moved to a Buddhist retreat in rural America. Have they found happiness?",
    "The Texas Democrat fighting for gun control and abortion rights",
    "What motherhood looks like",
    "Australian fashion week and flooding in Italy",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Schiff ‘not backing down’ in face of Republican bid to expel him from Congress",
    "Harry and Meghan security ‘should have been properly stage-managed’",
    "Top five US executives hoard $9bn tax-free for retirement as workers face limits",
    "Texas doctors depart as attorney general investigates hospital’s gender-affirming care",
    "Conspiracy theorists to address US House subcommittee, watchdog warns",
    "Women drinking beer clothed: why are rightwingers melting down over Miller Lite?",
    "Deutsche Bank agrees to pay $75m to settle Jeffrey Epstein lawsuit",
    "‘Duke (and Duchess) of hazard’: how US and UK press covered the Harry and Meghan car chase story",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich LA coast"
]