[
    "The Guardian - Back to home",
    "The deal What has to happen now to get it passed?",
    "‘An egregious act’ Debt deal imperils environment, critics say",
    "‘Whatever it takes’ The tense journey to debt deal",
    "Important first hurdle cleared with House panel and advances for debate",
    "Russia-Ukraine war: Russian oil refinery in Krasnodar on fire; Belgorod shelled, says governor",
    "Exclusive Trump lawyer said to have been waved off searching office for secret records",
    "Ex-president reiterates pledge to scrap birthright citizenship",
    "Staffer who accused Joe Biden of sexual assault defects to Russia",
    "Restaurant manager died after getting trapped inside a freezer, lawsuit says",
    "First spy satellite launch ends in failure, and promise to send up another",
    "Purdue can shield wealthy Sackler family from opioid lawsuits, court rules",
    "Chinese pilot performed ‘aggressive maneuver’ near US plane, military says",
    "Rare white bison born in Wyoming is first in park’s 32-year history",
    "Adventurers reach Rockall in bid to live on north Atlantic islet for 60 days",
    "‘People wanted to believe the fairytale’",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "Russians wake up to war at home",
    "Philip O’Ferrall on his vision for media venture Outernet",
    "How the ‘nice’ comedy became utterly dreadful television",
    "A punchier, bolder, hotter and sweatier than ever",
    "Succession’s Jeremy Strong tried to jump into a river during final scene",
    "Jess Williamson on fate, Plains and her breakout fifth album",
    "The TV show so good it beats the Succession finale hands down",
    "Plight of migrants as slums razed in French territory of Mayotte",
    "Manuscripts shed light on how medieval minstrels skewered society",
    "Are you an eagle, dog, bear or reptile? The trend that is unlikely to improve your love life",
    "Macron to call for European ‘strategic awakening’ following invasion",
    "Woman trying to reach godson detained in Russia and deported to Belarus",
    "Who was behind the Moscow drone attacks?",
    "What we know on day 462 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Dangerous lab leaks happen far more often than the public is aware",
    "Running out of battery: how post-Brexit Britain is failing to set up a future-focused economy",
    "Demanding Taylor Swift dump Matty Healy? Fan culture is out of control",
    "Tunisia was the hope of the Arab spring. Now my father could face the death penalty for his words",
    "Will AI free us from drudgery – or leave us jobless and hungry?",
    "How bench players can tilt the NBA finals",
    "Djokovic ‘raising tensions’ of Serbia and Kosovo after statement",
    "The Heat brutally ended the Celtics’ season of living dangerously",
    "Hudson quits as manager as second interim hired amid search",
    "Our writers pick their best and worst",
    "Inside year one of the Boehly era at Chelsea",
    "Spartak's Promes prosecuted for alleged trafficking of 1,360kg of cocaine",
    "Wild sends Medvedev crashing out of French Open",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Five people still unaccounted for after apartment building collapse",
    "Republican hopeful says he will ‘destroy leftism’ in US if elected president",
    "Connecticut exonerates victims of 17th-century trials",
    "Firefighting goats could be furloughed due to employment law",
    "California appeals court votes for parole for Manson follower",
    "Wife of 39th US president diagnosed with dementia",
    "Digital road sign hacked to display white supremacist messages",
    "Consumer watchdog says KOS protein powder contains toxic chemicals",
    "End-of-term decisions could transform key areas of public life",
    "Black teen raises money for traumatic brain injuries weeks after shooting",
    "Trial begins of female journalist who covered Mahsa Amini’s death",
    "Woman detained over Twitter and Snapchat posts promoting reform",
    "Radio broadcaster shot dead in latest killing of a journalist, say police",
    "South Korea’s first ever same-sex marriage bill goes to parliament",
    "China targeted me in election, says 2021 rival to Justin Trudeau",
    "Pyongyang launches ‘space vehicle’ amid military spy satellite plans",
    "Sunak accused of trying to cover up ministers’ actions during pandemic",
    "No 10 accused of cover-up after denying it has Boris Johnson Covid messages",
    "Centre-right Citizens party says it will not run in general election",
    "Italian and Israeli agents among four dead after boat capsizes in Lake Maggiore",
    "Tracking down Ukraine’s abducted children",
    "Listen to previous episodes",
    "Ex-Soviet conceptual artist dies aged 98",
    "The Bee Sting by Paul Murray review – a tragicomic triumph",
    "You’ll give up on Woody Harrelson’s Watergate drama after one episode",
    "An Uneasy Inheritance by Polly Toynbee review – living up to high ideals",
    "Why Jeremy Strong shaved his head – and Werner Herzog jumped into a cactus patch",
    "How sculpting saved a reverend from heroin and sex work",
    "The employees working under surveillance",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The dating trend that is unlikely to improve your love life",
    "Backpacking in the Himalayas, I found the courage to change my life",
    "What’s the best cheese for melting?",
    "Six questions to ask before buying that cardigan",
    "Stop dumping your cast-offs on us, Ghanaian clothes traders tell EU",
    "Growing debate over vape regulation",
    "Astronomers see 6,000-mile water vapor plume blasting from Saturn moon",
    "Risk of extinction should be ‘global priority’, say tech experts",
    "Rare Italian deer make long journey to survival",
    "Latest one-of-a-kind store is ‘like an Indigenous-futurist version of Warhol’s Factory’",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Protests in Senegal and a Comic-Con dinosaur",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Getxophoto festival, Basque Country, Spain",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘One of the blasts shook our house’: Russians wake up to war at home",
    "Good riddance, Ted Lasso: how the ‘nice’ comedy became utterly dreadful television",
    "Tara Reade, who accused Joe Biden of sexual assault, defects to Russia",
    "Donald Trump reiterates pledge to scrap birthright US citizenship",
    "North Korea’s first spy satellite launch ends in failure and promise to send up another",
    "Who was behind Moscow drone attacks and what do they mean for Ukraine war?",
    "Ron DeSantis says he will ‘destroy leftism’ in US if elected president",
    "Large-scale drone attack hits Moscow for first time in Ukraine war",
    "Macron to call for European ‘strategic awakening’ after Ukraine invasion"
]