[
    "The Guardian - Back to home",
    "Full story Trump classified documents indictment unsealed",
    "Five revelations in indictment Nuclear secrets in the bathroom",
    "Explainer What do the charges mean and what’s next?",
    "Analysis Could Trump go to prison?",
    "Full text of federal indictment",
    "Full story Johnson resigns as MP over Partygate report",
    "Johnson's statement in full ‘It is sad to be leaving … for now’",
    "Analysis Johnson’s hopes for a comeback must surely now be futile ones",
    "Parts of volcano ‘stretched nearly to breaking point’, study finds",
    "Mercenaries accused of stoking ‘anarchy’ on Russia’s frontlines",
    "St Louis Catholic archdiocese to pay $1m to settle sexual abuse lawsuit",
    "Millions still under air quality warnings in US as weather eases Canada wildfires",
    "12m Americans believe violence is justified to restore Trump to power",
    "Disney’s Little Mermaid flops in China amid racist backlash over casting",
    "Outcry as Texas to install ‘buoy barrier’ in Rio Grande to deter border crossings",
    "France salutes ‘backpack hero’ who challenged knife attacker",
    "How some US cities are trying to keep roofs over people’s heads",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Republicans turn on their own in attorney general impeachment scandal",
    "Four controversial doctors helping Republicans attack trans healthcare",
    "A visual guide to the Canada blazes and US smoke pollution",
    "My friend talks nonstop about herself. How can I get her to listen to me?",
    "Manchester City Fans pour into Istanbul ready to see off ‘City-itis’",
    "The only thing City miss is the Champions League – why I am here",
    "If it follows six rules, perhaps",
    "A tame attempt at manufacturing outrage",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "A grief-stricken masterpiece",
    "Annecy locals try to make sense of knife attack on children",
    "Seismic data adds to evidence that Kakhovka dam was blown up",
    "The collapse of Ukraine’s Nova Kakhovka dam",
    "What we know on day 471 of the invasion",
    "Zelenskiy steps up criticism of International Red Cross over inaction at Kakhovka dam",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Trump once led chants of ‘lock her up’. Now he’s been indicted on seven counts",
    "The charges mount, but Trump’s not worried. He’s just the guy to make jail great again",
    "Why did the right-leaning supreme court hand Democrats a victory?",
    "After the destruction of the Kakhovka dam, another threat lies on Ukraine’s horizon: Donald Trump",
    "The global backlash against The Little Mermaid proves why we needed a Black Ariel",
    "The dismal story of modern football can be summed up in two words: Manchester City",
    "Udonis Haslem is Miami's doyen of grit and keeper of the flame",
    "Report Djokovic outlasts cramping Alcaraz to reach final",
    "French Open Ruud books place opposite Djokovic in final",
    "Alcaraz admits semi-final cramps were caused by nerves",
    "Guardiola the GOAT? Beyond the billions he has changed world football",
    "An 'obsession' Pep says City are driven on by European thirst",
    "Internazionale Inzaghi targets ‘writing history’",
    "Jonathan Wilson How Inter can hurt Manchester City",
    "Soccer, golf … will the NBA and NFL be next?",
    "The Stanford golf star toppling Tiger Woods’ records",
    "Swiatek on way to greatness but Muchova stands in path",
    "Chelsea legend Cech signs for Oxford City Stars",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "Visualized How Alabama discriminated against Black voters",
    "Surprise US supreme court ruling could help Democrats take House",
    "Wildfire smoke brings climate crisis home to Americans",
    "Hotel workers vote to authorize strike in California",
    "Facebook owner to push ahead with plans to launch Twitter rival",
    "Republicans rally behind Trump after indictment",
    "Mercedes-Benz beats Tesla for approval of automated driving tech",
    "Trump likely to surrender to authorities on Tuesday",
    "Man assaulted by cleric as a child launches program to turn ‘pain into power’",
    "Real cost of ‘Cop City’ under question after state approves $67m for project",
    "New York therapists see surge in eco-anxiety as smoke fills skies",
    "US extradition ‘dangerously close’ after losing latest legal appeal",
    "Smoke from Canadian blazes hits Norway and flows to southern Europe",
    "Former Italian PM back in hospital",
    "Podemos and leftist alliance Sumar agree to run jointly in snap election",
    "Qantas allows attendants of any gender to wear flat shoes, make-up and have long hair",
    "Sunak approves Boris Johnson honours list including aides linked to Partygate",
    "Sinn Féin MP urged not to attend IRA commemoration",
    "Chain sues viral food vandal for damages",
    "A prince’s day in court: Harry against the Mirror",
    "Listen to previous episodes",
    "Just as we’ve fallen in love with digi-Luke, is Mark Hamill really retiring from Star Wars?",
    "Influential British blues guitarist and singer with the rock band the Groundhogs",
    "Under-seasoned Cheetos biopic sticks to the formula",
    "Iron Maiden, Metallica and more on 20 years of Download",
    "How sex-tech firms are reinventing the vibrator",
    "Why dressing for dinner out is my favourite kind of look",
    "I built a house of cards 50 storeys high",
    "Ravneet Gill’s recipe for cherry muffin cake",
    "Readers’ favourite retreats in the UK and Europe",
    "Why you still can’t buy wine in New York supermarkets",
    "Why is Sunak putting up with it?",
    "Is the government ready to regulate crypto?",
    "The week around the world in 20 pictures",
    "Gigantic rubber ducks and the first AI sculpture",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Trump expected to surrender to Miami authorities on Tuesday after indictment",
    "Novak Djokovic outlasts cramping Alcaraz to race into French Open final",
    "Wagner group accused of stoking ‘anarchy’ on Russia’s frontlines",
    "Can pornography be healthy? If it follows six rules, perhaps",
    "Nuclear weapon secrets in the bathroom: five revelations from Trump’s unsealed indictment"
]