[
    "The Guardian - Back to home",
    "Georgia Trump to make first speech since federal indictment",
    "'Defend our movement' Trump uses legal woes to plead for money",
    "Five revelations Nuclear weapon secrets in the bathroom",
    "Indictment is stress test for US democracy as Republicans rally round",
    "Aileen Cannon Who is the judge assigned in Mar-a-Lago case?",
    "Trump left with few defenses for hoarding top secret documents",
    "Man City Owner Sheikh Mansour to attend final",
    "Internazionale Inzaghi targets ‘writing page of history’",
    "Manchester City v Inter - Champions League final",
    "Ted Kaczynski, 81, dies in US prison cell",
    "Boris Johnson ally becomes third Tory MP to resign within 24 hours",
    "'Miracle' children found alive 40 days after Amazon jungle plane crash",
    "Zelenskiy appears to confirm counteroffensive during Trudeau visit",
    "Shooting leaves nine wounded after ‘targeted’ incident",
    "South Carolina woman shops passenger to police with silent message",
    "EPA sued over pesticide-coated seeds’ ‘devastating impacts’ on US wildlife",
    "Dutch town tells nude sunbathers to put a lid on lust",
    "What’s behind John Roberts’s surprise supreme court voting rights ruling?",
    "Microfarms push back against ‘food apartheid’",
    "Anger and anxiety as Florida governor's asylum-seeker flights return to US skies",
    "What’s happening with US loan relief and the payment pause?",
    "‘I was told I’d never not be Ron Swanson’",
    "How Russian is gaining ground in Poland’s capital",
    "How to avoid a civil war, by the man who predicted Trump",
    "I re-read my teenage diaries hoping for a dose of nostalgia – instead I was horrified",
    "James Comey: ‘I’d like to take readers inside the White House’",
    "The people who sell images of their unlikely body parts online",
    "Living my life was more important than being in movies",
    "Four ‘miracle’ child survival stories",
    "Exiled Russians dare to dream of Putin’s fall",
    "Impunity is Putin’s middle name. Now he must pay for his crimes",
    "Mercenaries accused of stoking ‘anarchy’ on Russia’s frontlines",
    "What we know on day 472 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "It took me a long time, but I’ve finally fallen in love with being gay",
    "Boris Johnson scuttles away from his flagrant crimes, like a whingeing guilty schoolboy",
    "Trump once led chants of ‘lock her up’. Now he’s been indicted on seven counts",
    "After the destruction of the Kakhovka dam, another threat lies on Ukraine’s horizon: Donald Trump",
    "The charges mount, but Trump’s not worried. He’s just the guy to make jail great again",
    "For Miami’s resilient underdogs, Jokić and the Nuggets are a bridge too far",
    "Denver 108-95 Miami Nuggets close on title after Game 4 win",
    "As it happened Read Sarah Rendell's game-by-game report",
    "Men's singles Ruud an underdog who hopes to have his day",
    "Reaction Alcaraz admits semi cramps caused by nerves",
    "Swiatek digs deep to overcome Muchova in thrilling final",
    "Nascar takes on Le Mans as LeBron James gets centenary race under way",
    "Taylor and López out to jump-start stalled ascents in Garden scrap",
    "Udonis Haslem is Miami's doyen of grit and keeper of the flame",
    "Girma and Kipyegon set world records at Paris Diamond League",
    "49ers' investment arm taking over English club after relegation",
    "Greta Thunberg takes part in her last school strike for climate",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Reversal of social media guardrails could prove disastrous for 2024 elections",
    "California family finds over 1m copper pennies",
    "A man with dwarfism says he went to police after a sexual assault. The case went nowhere",
    "FDA advisers say new drug lecanemab slows cognitive decline",
    "St Louis Catholic archdiocese to pay $1m to settle sexual abuse lawsuit",
    "Outcry as Texas to install ‘buoy barrier’ in Rio Grande to deter border crossings",
    "Hotel workers vote to authorize strike in California",
    "Wildfire smoke brings climate crisis home to Americans",
    "Surprise US supreme court ruling could help Democrats take House",
    "Mercedes-Benz beats Tesla for approval of automated driving tech",
    "Exhausted crews battle wildfires as experts issue climate warning",
    "Boy, 16, charged with attempted murder after Devon school attack",
    "Wildlife-rich rainforest being planted in Devon in UK",
    "Pope advised not to give Sunday blessing from hospital balcony",
    "Five people killed in blast at military explosives factory",
    "Labour has clear lead over Tories in more than 100 battleground seats, poll finds",
    "Crispin Odey leaves Odey Asset Management after misconduct allegations",
    "Official investigating Chinese election ‘meddling’ resigns abruptly",
    "Government ‘fanning culture war’ over free speech, says UK’s first LGBTQ+ history professor",
    "Special forces storm Turkish cargo ship after attempted hijack",
    "I’m just cruel. What can I tell you?",
    "From Gellhorn to Abramson, the women who changed US journalism",
    "One to watch: Ezra Williams",
    "A tame attempt at manufacturing outrage",
    "Tove Jansson’s unseen sketches to go on show in Paris",
    "Mel B: ‘I’ve still got PTSD. Abuse never really leaves you’",
    "I guessed she was Canadian – she’s from Glasgow",
    "David del Rosario Dávila’s best phone picture",
    "Picnic and camping recipes",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "If it follows six rules, perhaps",
    "Why the kingdom can afford to play a long game in bid to control sport",
    "Survive the smoke-pocalypse Californians advise New Yorkers",
    "A visual guide to the Canada blazes and US smoke pollution",
    "Germans the best in Europe, finds poll. Italians? Not so much",
    "Dubai hotelier launches £10k-an-hour ‘party jet’",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Annecy locals try to make sense of knife attack on children",
    "The week around the world in 20 pictures",
    "A homage to New York’s independent shops – in pictures",
    "Gigantic rubber ducks and the first AI sculpture",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Three months ago, this wasn’t possible’: exiled Russians dare to dream of Putin’s fall",
    "‘Help me’: South Carolina woman shops passenger to police with silent message",
    "Who is Aileen Cannon, the judge assigned in Trump’s Mar-a-Lago case?",
    "San Francisco shooting leaves nine wounded after ‘targeted’ incident",
    "Donald Trump uses his legal woes to plead for money from supporters – again",
    "Anger and anxiety as DeSantis’s asylum-seeker flights return to US skies",
    "Kyiv reports advances as UK says Russian lines breached in some areas – as it happened"
]