[
    "The Guardian - Back to home",
    "Wildfires smoke: people urged to wear masks as toxic air quality alerts continue",
    "Smoke could linger over parts of US for days, officials warn",
    "The Canadian village incinerated by record temperatures",
    "Live Supreme court rulings: Alabama voting district decision is big win for voting rights",
    "Kevin McCarthy Republican hardliners revolt against their own speaker",
    "US Capitol attack Bob’s Burgers actor arrested on charges of joining mob",
    "Alabama discriminated against Black voters, court rules",
    "Religious broadcaster dies aged 93",
    "Fossil fuels Protesters to march on White House as anger mounts over Appalachia pipeline",
    "Pregnancy ‘Forever chemicals’ exposure can lead to low birth weight and obesity in later life",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Tucker Carlson lawyer hits back at claim of contract breach",
    "Actor to make West End debut with husband Matthew Broderick",
    "Joe Biden marks Pride month with high-profile support of community",
    "Russia-Ukraine war live: Russian troops accused of shelling civilians during flood evacuations",
    "Climate crisis leading to more turbulence during flights, says study",
    "Republican states send national guard troops to Texas border in show of force",
    "Four children and two adults injured in knife attack in French Alps",
    "House of Representatives to hold hearing on whistleblower’s claims",
    "So she’ll speak here instead.",
    "As the industry booms, what toll will it take on the environment?",
    "Former governor says he’s anti-Trump. But did he score a presidential pardon for a crony?",
    "The murder of Collette Gallacher – and her sisters’ fight for justice",
    "Ozempic has won, body positivity has lost. And I want no part of it",
    "Wild horse deaths in sierra show a delicate ecosystem off balance",
    "How Love Island bored away millions of viewers",
    "I’m not a bad packer – but I’m a horrible folder",
    "Nikola Jokić is making the NBA finals his masterpiece",
    "Anselm Kiefer on the nightmares he can’t escape",
    "A couple makes a killer podcast in fun, flimsy series",
    "Why Rowan Atkinson is wrong about electric vehicles",
    "Russian forces accused of blocking evacuation efforts",
    "Maps show how dam collapse threatens Ukraine’s bread basket",
    "Zelenskiy rejects claim of Ukraine plot to destroy pipeline",
    "Drone footage shows extent of flooding from Ukraine dam collapse",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The CNN chief messed up in many ways. Only one of them was fatal",
    "Your partner wants the truth? They can’t handle the truth! At least, according to film and TV",
    "Prince Harry is not wrong to feel injustice, but he won’t find vindication in a court of law",
    "People call me brave for going through cancer treatment – but the scary bit starts now",
    "Michael Caine’s novel will most likely be rubbish, but I’m glad he’s found his happy ending",
    "Anyone who goes to a beach already has a ‘beach body’. Don’t strive for an illusion",
    "Jokić is making the NBA finals his masterpiece",
    "Messi has the power to realize soccer’s potential in the US",
    "No winners in the Women’s World Cup broadcast fiasco",
    "French Open semi-final: Muchova v Sabalenka",
    "McIlroy says there must be no way back for rebels",
    "Liverpool confirm Mac Allister signing from Brighton for £35m",
    "Arsenal confident of signing West Ham's Rice for $112m",
    "West Ham fans clash with Czech riot police",
    "Greenhouse gas emissions at all-time high, study finds",
    "Best Seascape stories of the past year",
    "Chemical industry used big tobacco’s tactics to conceal evidence of PFAS risks",
    "Spate of US lawsuits calls big oil to account for climate crisis",
    "Lawyers told he is target in Mar-a-Lago documents investigation",
    "Taskforce to combat trade of child sex abuse materials after damning report",
    "Outrage as anti-LGBTQ+ protest at school board turns violent",
    "Jodie Comer stops stage performance because of New York air",
    "Republican enters 2024 race with speech denouncing ‘reckless’ Trump",
    "90210 actor reveals breast cancer has spread to her brain",
    "Media push for release of records over US priest accused of abusing children",
    "Mega-donor faces new subpoena threat over gifts to Clarence Thomas",
    "North Dakota governor Doug Burgum announces Republican presidential bid",
    "Self-driving car kills dog amid increasing concern over robotaxis",
    "Whistleblower warns surveillance technology is much more intrusive today",
    "People with sleep problems at greater risk, study suggests",
    "Student convicted after posting protests video on WeChat",
    "Poland criticises ‘unacceptable’ proposed charge for refusing migrants",
    "Japan court falls short of calling ban unconstitutional",
    "Dozens of Chinese warplanes enter air defence zone",
    "Russian man who claimed to have been FSB officer deported",
    "Less than half in Britain back gender-affirming care for teenagers",
    "Ukraine and Myanmar make 2022 most violent year in a decade for medical staff",
    "Boris and Carrie Johnson ‘hosted friend at Chequers during Covid restrictions’",
    "The destruction of the Kakhovka dam",
    "Listen to previous episodes",
    "The best movies of 2023 so far",
    "Janelle Monáe: The Age of Pleasure review – hot-girl-summer hedonism",
    "Not only did I warm to his drawls, I became obsessed",
    "Assured mixed-race, mixed-politics romance",
    "Tom Holland and Amanda Seyfried’s new drama drags on and on (and on)",
    "Tom Holland taking year off from acting after latest role ‘did break me’",
    "When wedding proposals go hilariously wrong",
    "'Most things he said were anecdotal, whereas I was trying to present stats’",
    "‘Only 11 other people have completed it’ Cycling the 7,600km European Divide",
    "He moved in after a month together to care for me – then he kept being amazing",
    "A speeding fine, a baby donkey and a tram ride",
    "10 ways to be more confident on dating apps",
    "Have you stopped washing your clothes or wash them less often?",
    "The lives lost in India’s train disaster",
    "Can Trump’s loyal deputy become his nemesis?",
    "Why Jess McDonald quit her job – and decided to tell all",
    "Is eating local produce actually better for the planet?",
    "What’s really changed 10 years after the Snowden revelations?",
    "How have you been affected by the Canada wildfires and the smoke in the US?",
    "Earth Photo 2023 shortlist",
    "Smoke engulfs American north-east",
    "Flip-flop boats, ‘trashion’ and the Bag Monster: the art of discarded plastic",
    "The news from a Mozambique landfill site",
    "Lunch mates and Brazilian beauty",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Canada: wildfires rage across British Columbia – video",
    "Fact check: why Rowan Atkinson is wrong about electric vehicles",
    "Republican hardliners’ revolt against Kevin McCarthy shuts down US House of Representatives",
    "Religious broadcaster Pat Robertson dies aged 93",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Alabama discriminated against Black voters, US supreme court rules",
    "Chaos on frontlines as Ukraine war threatens to come home for Russia",
    "How we met: ‘He moved in after a month together to care for me – then he kept being amazing’"
]