[
    "The Guardian - Back to home",
    "George Monbiot The hard right and climate catastrophe are intimately linked. This is how",
    "Fears of hottest year on record as global temperatures spike",
    "Governor Greg Abbott sends ‘1st bus’ of migrants to Los Angeles",
    "‘Very serious allegations’ 2024 rivals react",
    "Aileen Cannon Trump-appointed judge faces scrutiny",
    "E Jean Carroll Writer ‘looks forward’ to $10m Trump defamation case, lawyer says",
    "Trump turns 77 under shadow of charges – with threat of more to come",
    "Anna Bateson All bets are off: why the Guardian has decided to reject gambling advertising",
    "The Guardian bans all gambling advertising",
    "US military will have ‘unimpeded’ access to Papua New Guinea bases under new security deal",
    "Google earned $10m from ads misdirecting women to ‘pregnancy crisis centres’",
    "Synthetic human embryos created in groundbreaking advance",
    "Rolls-Royce boss unable to see secret UK documents on its submarines business",
    "Sarah Palin denies then seems to confirm that Trumpism is a cult",
    "Fox News explains away ‘wannabe dictator’ chyron during Trump speech",
    "Empty seats at US graduations reveal toll of gun violence",
    "How Russia’s wealthy profited from exit of western brands",
    "Nightclub owner and London crime kingpin Ronnie Knight",
    "Massive strike pits African fishers against ‘superprofitable’ EU firms",
    "10 spectacular salads to help you eat 30 plants a week",
    "‘Drought is on the verge of becoming the next pandemic’",
    "Prepare to convulse in horror on the sofa",
    "How Turkish musicians welcomed Syrian refugees",
    "Trump court sketches varied wildly",
    "‘Ukraine earned its hardcore status’",
    "Get Out meets Scary Movie in whipsmart horror satire",
    "Why did it leave Australians in tears and Americans puzzled?",
    "At a glance What we know on day 477 of the invasion",
    "Russia-Ukraine war: conflict in Ukraine ‘marathon not a sprint’ US tells Nato",
    "Putin sides with military chiefs over placing Wagner under direct control",
    "Ukraine’s failed Mala Tokmachka assault lays bare counteroffensive challenges",
    "Ukraine urges clampdown after western parts found in Russian missiles",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The hard right and climate catastrophe are intimately linked. This is how",
    "All bets are off: why the Guardian has decided to reject gambling advertising",
    "From the oceans to ‘net zero’ targets, we’re in denial about the climate crisis",
    "The US debt-ceiling ‘deal’ was a giant exercise in bipartisan class warfare",
    "Drinking alcohol is bad for you – end of. Ignore the headlines that claim otherwise",
    "Donald Trump’s arrest is ugly but it’s also democracy in action",
    "Athletics’ stadium deal wins final legislative approval in Nevada",
    "20 things I learned from the NBA playoffs",
    "Luis Arráez and the quest for baseball’s elusive .400 barrier",
    "US Open has no time for Hollywood stars as golf directs a melodrama",
    "Organisers ‘failed to protect workers,’ claims Amnesty",
    "Manchester United pull out of Kane chase as cost proves out of reach",
    "At 91, Don King still longs for the spotlight. But it is shining elsewhere",
    "Athletes should avoid total rest after mild blow, say experts",
    "Climate activist faces jail for fake letter to oil execs saying their meeting was cancelled",
    "Indigenous traditions hit by fruit scarcity, climate trial hears",
    "Not phasing out fossil fuels is ‘death sentence’ for world’s poor, says activist",
    "Energy company drops target to cut oil production as CEO guns for higher profits",
    "Governor issues budget veto threat in Republican campus fight",
    "Federal Reserve delays hike but suggests more increases to come",
    "Theranos founder objects to $250 monthly payments to victims",
    "Pyrex and Instant Pot maker files for bankruptcy protection in US",
    "US mother gets call from ‘kidnapped daughter’ – but it’s really an AI scam",
    "Synagogue shooting survivor says her mother was killed by her side",
    "Conservationist and popularizer of whale song dies age 88",
    "US government toughens rules on chemicals used to break up oil slicks",
    "Ex-NSA employee sentenced to two weeks",
    "At least 78 people drown as refugee boat sinks off Greece",
    "Nine killed as ethnic clashes continue in Manipur state",
    "Protest anthem Glory to Hong Kong starts to vanish from online sites as government seeks ban",
    "Ottawa freezes ties with Chinese bank AIIB over claim it is ‘dominated by Communist party’",
    "Outrage as crusading journalist given six-year prison term",
    "More than 100,000 evacuated in India and Pakistan as storm nears",
    "Athletes should avoid total rest after mild concussion, say experts",
    "Six charged over seizure of $1.7bn worth of drugs allegedly en route to Australia",
    "World Cup organizers ‘failed to protect workers,’ claims Amnesty",
    "Man who allegedly yelled anti-trans hate at girl banned from school sports",
    "Is it time to decriminalise abortion in the UK?",
    "Listen to previous episodes",
    "Weeds actor on fame, Botox and rumors of a reboot",
    "So much of David Attenborough’s new show is just astonishing",
    "How The Idol has single-handedly resurrected torture porn",
    "‘His work will sing down the centuries’",
    "The inside story of Merseybeat, the UK’s early pop explosion",
    "Concert in Stockholm blamed for unexpectedly high Swedish inflation",
    "Why men are now shaving – and women are doing whatever they like",
    "The missile alert promised sudden death. That awful hour taught me how to live",
    "Is this the best way to de-stress in the office?",
    "10 ways to be much more confident at work",
    "How much salt is too much salt?",
    "The Mont-Blanc Express from Switzerland to France",
    "The sound ecologist capturing a disappearing world",
    "Kevin McCarthy says documents are safer in bathrooms than garages. Is he right?",
    "A beautifully humane documentary about a dying man’s last days",
    "Māori ancestral remains and mummified heads returned from Germany",
    "Anguish as rape survivors unable to access vital medication",
    "Share your experiences with us",
    "Christopher Makos’s best photograph",
    "Magical images of childhood",
    "Colombia’s Tomato Fight festival",
    "The best of Photo Basel 2023",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Texas governor Greg Abbott sends ‘1st bus’ of migrants to Los Angeles",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "Woman accused of posing as a male found guilty of sexual assault by kissing",
    "Greg Abbott signs law banning diversity offices in Texas higher education"
]