[
    "The Guardian - Back to home",
    "Incarcerated people use TikTok videos to expose Alabama’s prison conditions",
    "Russia-Ukraine war: at least one person dead and 15 injured in Russian attack on Dnipro clinic",
    "Asia Pacific North Korea slams ‘sinister’ South and allies as live-fire exercises with US begin",
    "Joe Biden’s advisers say he doesn’t want to drag Pacific allies into ‘headlong clash’",
    "FBI files reveal plot to kill queen during US trip in 1983",
    "James M Cain: lost story by ‘poet of the tabloid murder’ discovered in Congress library",
    "Deal within sight as Biden and Republicans continue to negotiate",
    "Police seize 58kg of cocaine bearing pictures of Nazi flag",
    "Police investigate after plane door opened mid-flight",
    "First cheetah cubs born in more than seven decades die in heatwave",
    "Tom Hanks gives keynote speech and receives honorary degree from Harvard",
    "Why millions are leaving everything behind to seek refuge in US",
    "Will Ron DeSantis’s culture war with Disney threaten his White House run?",
    "US veterans defrauded by for-profit universities fight to restore benefits",
    "Europe’s Turkish diaspora split as large numbers vote in election runoff",
    "Lake Tahoe resort plan sparks outcry",
    "Progressive Portland takes a hard turn on homelessness",
    "Why is Betelgeuse glowing so brightly and behaving so strangely?",
    "Jennifer Lawrence in step with trends by wearing flip-flops at Cannes",
    "Inside Hollywood’s battle over artificial intelligence",
    "How Yellowjackets has taken survival horror to new heights",
    "‘Older straight men hated my films with a vengeance’",
    "Russian weapons manufacturers hosted at Riyadh trade event",
    "The film-maker who drove 400 Ukrainians to safety",
    "The Ukrainian app used to do taxes … and report Russian soldiers",
    "What we know on day 457 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "‘Farming good, factory bad’, we think. When it comes to the global food crisis, it isn’t so simple",
    "No, Succession’s antiheroes don’t have a good side: that’s what makes it so compelling",
    "David Attenborough’s new series at last shows dinosaurs in all their feathered glory",
    "Netflix ends password-sharing – but I’m close to bailing anyway",
    "The NAACP says Florida isn’t safe for Black people. Unfortunately, they’re right",
    "Toxins hidden in plastics are the industry’s dirty secret – recycling is not the answer",
    "Celtics roll Heat in Game 5 to inch closer to historic comeback",
    "How the Savannah Bananas became the greatest show in sports",
    "Weekend countdown WSL, Premier League and Bundesliga finales, plus playoff finals",
    "Man Utd 4-1 Chelsea Clinical United seal Champions League return",
    "Premier League: 10 things to look out for on day of drama",
    "Holger Rune 'If everybody was the same, it would be a bit boring'",
    "Djokovic and Alcaraz could meet in semi-final as draw is made",
    "Epic 211-shot rally delights fans at doubles match in Malaysia",
    "Nascar opens investigation into driver’s hacked radio channel",
    "White-hot USA blank Czech Republic to reach semi-finals at worlds",
    "Folarin Balogun chose the US over England. He may have created a 2026 contender",
    "US supreme court shrinks clean water protections in siding with Idaho couple",
    "Guam narrowly avoids worst of Typhoon Mawar",
    "Average number of storms predicted despite El Niño",
    "Seaweed could avert food crisis caused by extreme weather",
    "Florida mother behind ban on Amanda Gorman poem has links to far-right group",
    "Founder of far-right militia sentenced to 18 years over January 6 attack",
    "Elon Musk’s brain implant company approved for in-human study",
    "Panel recommends impeaching state attorney general Ken Paxton",
    "Minority groups warn America of danger from ‘dictator’ DeSantis",
    "Ex-guard charged with 95 counts of sexual abuse in women’s prison",
    "Teen dies while climbing bridge in apparent social media stunt",
    "Man who debunked Mike Lindell’s ‘blatantly bogus’ data wants his $5m",
    "Rightwing group takes aim at retailer for offering Pride merchandise",
    "House Democrats laugh off call for ‘decorum’",
    "British man, 85, ‘shot and wife starved to death’ after being left in Sudan",
    "Social media users mock ‘magnificent makeover’ of disputed capital for G20 summit",
    "Cities cut public lighting to save energy amid heatwave",
    "The civilian toll of fighting in Sudan",
    "World Cup security guards still jailed after dispute over unpaid wages",
    "Scientists use AI to discover new antibiotic to treat deadly superbug",
    "Kabuki actor found collapsed at home alongside parents",
    "Business: UK chancellor backs interest rate hikes even if they cause recession",
    "Man arrested after car crashes into gates of Downing Street",
    "Material found in Portugal search sent for analysis",
    "Conspiracy theories and chaos: a week watching GB News",
    "Listen to previous episodes",
    "Romeo and Juliet movie child abuse lawsuit to be thrown out by judge",
    "'There’s nothing more comforting than Seinfeld scripts’",
    "‘An inspiration to women around the world’ Readers remember Tina Turner",
    "Singer, diva, fashion icon, trailblazer, dancer",
    "‘My dystopian novel became real’",
    "Burning Questions by Margaret Atwood audiobook review – reflections on a world in crisis",
    "The duo who took Britney Spears to the Yorkshire seaside",
    "'I’m Britain’s ‘dullest woman’",
    "Cannes fuses film and glamour in unofficial fashion week",
    "Should my fiance start drying his hands instead of letting them drip dry?",
    "My husband and I are separating – but he doesn’t want anyone to know",
    "My ex rang me and now I feel the love for my new wife fading fast. What can I do?",
    "Dua Lipa designs first collection for Versace",
    "The contentious tool US immigration uses to get your data from tech firms",
    "More than 5,000 new species discovered in deep-sea mining hotspot",
    "Goodbye to the defining show of the Trump era",
    "People injured by 2020’s police violence speak out",
    "Public weed ban begins in Amsterdam",
    "Statesman or war criminal? His troubled legacy",
    "K9 handler and George Floyd protests",
    "A road trip from Texas to LA",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US cities to pay record $80m to people injured in 2020 racial justice protests",
    "Florida mother behind ban on Amanda Gorman poem has Proud Boys links",
    "FBI files reveal plot to kill Queen Elizabeth during US trip in 1983",
    "‘It’s new territory’: why is Betelgeuse glowing so brightly and behaving so strangely?",
    "The week in wildlife – in pictures",
    "Queensland girl, 12, leaps from Mega Drop show ride after harness malfunction",
    "‘I had no option’: why millions are leaving everything behind to seek refuge in US",
    "‘Stick over carrot’: progressive Portland takes a hard turn on homelessness",
    "Middle East and north Africa"
]