[
    "The Guardian - Back to home",
    "Solar helps Texas carry energy load as heatwave puts power grid to test",
    "Trump trial could be delayed until spring 2024",
    "Ukraine Defence minister expects Nato ‘guarantee’ after war",
    "Nato Alliance ready to face threat from ‘Moscow or Minsk’",
    "Kramatorsk strike death toll rises to eight; Nato to strengthen eastern defences",
    "Manuscript sheds new light on creation of Capote’s In Cold Blood",
    "Saudi leader trying to avoid ‘pariah’ status with LIV-PGA merger, says rights group",
    "Amazon facing ‘urgent’ drug crisis after gutting of protections, says narcotics chief",
    "Highest-ranking trans elected official in US to run for Congress",
    "Rapper accused of antisemitic abuse by former business partner",
    "US paramedic saves lives of two people in one family",
    "Man accused of killing Jordan Neely with chokehold due in court",
    "Man gets prison time for years-long cow dung scam",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are US retail workers being denied chairs?",
    "Nuns and Native women heal polluted New York waters using kelp",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "What we know on day 490 of the invasion",
    "US targets mercenary force by sanctioning gold companies suspected of funding it",
    "UN says Russian forces have tortured and executed civilians in Ukraine",
    "Deadly Russian missile strike on busy pizza restaurant",
    "Guardian Today US: Get the headlines & more in a daily email",
    "10 famous food rules you can absolutely ignore",
    "Idris Elba makes this beautifully daft plane thriller soar",
    "The married couple competing to have the biggest and best facial hair",
    "How Kylie and Fleetwood Mac found new young fans",
    "Meghan and Harry’s trainwreck podcast career",
    "Julian Sands in A Room With a View: the soulful heart of a brilliantly romantic film",
    "How volcano magma could help meet green economy’s demand for metal",
    "Guardian readers’ best films of 2023 so far",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. I have a plan to fix it",
    "The supreme court denied a wild election theory. But don’t relax yet",
    "The Russian coup-that-wasn’t fell flat. The next one might not",
    "What’s behind Saudi Arabia’s answer to Glastonbury? The power of popwashing",
    "Brittney Griner’s triumphant return to the WNBA",
    "Former NFL quarterback dies in apparent drowning aged 35",
    "Arsenal clear to seal $133.3m Rice signing after Man City pull out",
    "How good are Brazil and how far can they go?",
    "Eddie Hearn on boxing and big ambitions",
    "García reveals end to McIlroy rift",
    "How Jordan Lyles made a $50m career out of the art of losing",
    "Country has made ‘no progress’ on climate plan, say government’s own advisers",
    "Current heatwave across US south made five times more likely by human-caused heating",
    "2023 wildfires have released record 160m tonnes of carbon – and it's only June",
    "Swift parrot slowly losing critical habitat as Tasmania logs native forest",
    "Walt Nauta Trump valet arraignment delayed after losing Florida lawyer over fees dispute",
    "Former president sues E Jean Carroll for defamation over rape comments",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Airbnb to offer pink Malibu mansion",
    "New federal law provides workplace accommodations to pregnant people",
    "Human remains found in California mountains confirmed as British actor",
    "Justices rule against fringe legal theory in voting rights case",
    "Suicide blamed on jail’s ‘negligence and misconduct’",
    "US intelligence ignored warnings of violence, Senate panel finds",
    "Ryan Seacrest to take over as host as Pat Sajak exits",
    "US subjects detainees to ‘cruel, inhuman and degrading’ treatment, UN says after visit",
    "Former PM and ex-parliamentarian investigated by police",
    "Citizens become a year or two younger as country changes system for counting ages",
    "Trial for sexual offences due to begin in London",
    "Chaos at feral cat hunting contest as video of children chanting with dead animals emerges",
    "Outcry after tourist carves name on wall at Colosseum",
    "Gustav Klimt’s Lady with a Fan sells for £85.3m, breaking European record",
    "New Zealand boatshed sells for record $2m despite housing market crash",
    "Woman killed at opposition party HQ during elections",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Tensions mount in Paris after boy, 17, fatally shot by police officer",
    "The oil company CEO running the next UN climate change summit",
    "Listen to previous episodes",
    "Idris Elba: racist backlash made speculation over James Bond ‘disgusting’",
    "Rights to Argentinian writer’s work go to his wife’s nephews",
    "Top 10 summer love stories",
    "Pushing Buttons: Why Sonic and Mario duelling it out in 2D again will be a spectacle",
    "Julian Sands: a hypnotically exotic actor full of style and extravagance",
    "Frederic Forrest, consummate character actor",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "The surprising culinary advice of one of the world’s best chefs",
    "Barbecue sides that will steal the show",
    "I moved my date’s hand off my breast and he took it badly. Should I have said something instead?",
    "Aubergines with herb cream on sourdough",
    "One American classroom’s struggle with daily gun violence",
    "The author under attack for doubting Shakespeare",
    "Lebanon and Turkey step up deportations of Syrian refugees",
    "What happens to a people when their land disappears",
    "The London gig venue at the heart of the fight against gentrification",
    "Bottlenose mothers use ‘baby-talk’ with their calves, recordings show",
    "Impersonators, wearable arms and Putin",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Inside three generations of Iranian female photography",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Pompeii fresco find possibly depicts 2,000-year-old form of pizza",
    "Deadly Russian missile strike on busy pizza restaurant in Kramatorsk",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "The End of Sex review – couple’s sexual misadventures aim to relight fading fires",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "Trump sues E Jean Carroll for defamation over rape comments",
    "A moment that changed me: I was gay, disabled, alienated. With seven kind words, my life began",
    "Julian Sands confirmed dead after human remains identified"
]