[
    "The Guardian - Back to home",
    "Live Canada wildfire smoke: millions under air quality alerts",
    "Tens of millions under air quality alerts in US as Canada fire smoke drifts south",
    "Counteroffensive not yet launched, says Ukraine official; urgent call for Kherson drinking water",
    "Live Mike Pence releases video announcing presidential run",
    "Historic challenge Can Trump’s deputy become his nemesis?",
    "Mike Pence officially enters 2024 Republican presidential race",
    "CEO Chris Licht reportedly to leave cable news giant within 48 hours",
    "UAE state oil firm able to read Cop28 climate summit emails",
    "Multiple witnesses subpoenaed in Florida in Mar-a-Lago case",
    "High school student and father killed in graduation shooting",
    "Woman accused of shooting neighbor through front door arrested",
    "Prince Harry appears to fight back tears in phone hacking trial",
    "Host peddles conspiracy theories on Twitter debut from barn",
    "Mega-donor faces new Senate subpoena threat over gifts to Clarence Thomas",
    "Is eating local produce actually better for the planet?",
    "What are Minnesota’s new labor laws?",
    "Jeff Monson’s journey from American MMA muscle to Russian propagandist",
    "What does golf’s blockbuster ‘merger’ mean for the game and its players?",
    "A crypto obsession and early Crocs investment lie behind this outsider's success",
    "What’s really changed 10 years after the Snowden revelations?",
    "Our writers on their favorite LGBTQ+ songs",
    "A new system recasts gun violence as a public health concern. It’s saving lives",
    "Icons shot by Richard Avedon in pictures",
    "Why Jess McDonald quit her job – and decided to tell all",
    "The news from a Mozambique landfill site",
    "The best games of 2023 so far",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Anyone who goes to a beach already has a ‘beach body’. Don’t strive for an illusion",
    "Autocorrect can be ‘ducking’ annoying, but we’ll miss its accidental poetry when it’s gone",
    "Cram them into a shoebox: that’s Britain’s new anti-migrant strategy – and it won’t work",
    "States haven’t stopped spying on their citizens, post-Snowden – they’ve just got sneakier",
    "Golf What does ‘merger’ mean for the game and players?",
    "Ewan Murray 'Merger’ with LIV can only be seen as Saudi victory",
    "‘Victory for sportswashing’ Old truths will haunt golf’s new dawn",
    "LIV’s DeChambeau says Saudis ‘trying to do good for world’ amid PGA merger",
    "A journey from American MMA muscle to Russian propagandist",
    "French Open quarter-finals: Swiatek beat Gauff; Zverev v Etcheverry",
    "Club seal initial €100m deal to buy Bellingham from Dortmund",
    "Star signings could be Saudis' most effective tool",
    "Spanish rider Raul Torras Martinez dies in crash",
    "Texas ace set for season-ending surgery after inking $185m deal",
    "Man Utd make Napoli’s Kim top target in defence",
    "Chemical industry used big tobacco’s tactics to conceal evidence of PFAS risks",
    "Spate of US lawsuits calls big oil to account for climate crisis",
    "Fifa misled fans over ‘carbon-neutral Qatar' tournament, regulator finds",
    "Too late now to save summer ice, scientists find",
    "Two killed and five injured after high school graduation",
    "North Dakota governor Doug Burgum announces Republican presidential bid",
    "US urged to reveal evidence after claim that it has intact alien vehicles",
    "State confirms it was behind flights that left asylum seekers in California",
    "Ex-New Jersey governor launches 2024 bid",
    "Man executed for killing two jailers in failed escape plot",
    "Richer people pay more: dramatic change to electricity bills",
    "Sheriff files criminal case over DeSantis flights to Martha’s Vineyard",
    "City approves funding to build ‘Cop City’ despite fierce opposition",
    "Republican ordered to reveal identities of mystery bond guarantors",
    "Duke of Sussex has no proof Mirror Group journalists hacked phone, court told",
    "Pontiff to undergo intestinal surgery",
    "Five police accused of torturing migrants and homeless people",
    "Scientists record first known ‘virgin birth’ in female crocodile in Costa Rica",
    "Oldest carved piece of wood to be found in Britain dates back 6,000 years",
    "Meta ordered to offer mental health care to moderators in Kenya",
    "Italian F1 commentators suspended after sexist remarks on air",
    "Country to ban Nazi symbols but not the salute, says Mark Dreyfus",
    "France opposed to opening of liaison office in Japan, official says",
    "Communist party accessed protesters’ TikTok data, former executive says",
    "How to develop artificial super-intelligence without destroying humanity",
    "Listen to previous episodes",
    "Subversive spirit shines through John Waters’ high-camp 80s musical",
    "Maggie Smith film that took 20 years to make to get premiere",
    "Actor announces debut thriller to be published in November",
    "French painter whose book about Picasso relationship became a bestseller",
    "Neglected 18th-century Black virtuoso finally gets his due",
    "Why pop is so heavily plundering the past",
    "10 ways to be more confident on dating apps",
    "Have you stopped washing your clothes or wash them less often?",
    "How a younger generation warmed to 80s style rules",
    "How to recognise it – and feed your cravings healthily",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "The ultimate panacea – or wildly overhyped?",
    "Which brands are supporting Pride in the wake of backlash?",
    "How the leak of the century came to be published",
    "Share your experiences of US abortion care with us",
    "The father of ChatGPT on whether AI will save humanity – or destroy it",
    "Is Hannah Gadsby’s Picasso exhibition really that bad?",
    "The LGBTQ+ families fleeing red states",
    "A jubilee celebration and a grizzly bear",
    "Lunch mates and Brazilian beauty",
    "Ukraine’s Kakhovka dam disaster",
    "Replastering Mali’s Great Mosque of Djenné",
    "Prince Harry at court and D-day ceremonies",
    "50th World Environment Day",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Multiple witnesses subpoenaed in Florida in Trump Mar-a-Lago case",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Kakhovka dam flooding before and after: satellite images reveal extent of disaster in Ukraine",
    "Tina Turner to Cindy Crawford: icons shot by Richard Avedon – in pictures",
    "Biden ‘knew of Ukrainian plan to attack Nord Stream’ three months before explosion",
    "Russia floundering in ‘mud of lies’ over Kakhovka dam destruction, Ukraine tells UN",
    "CNN CEO Chris Licht reportedly to leave cable news giant within 48 hours",
    "‘Absolute scandal’: UAE state oil firm able to read Cop28 climate summit emails"
]