[
    "The Guardian - Back to home",
    "Live House to vote on bill amid opposition from Republicans and Democrats",
    "The deal What has to happen now to get it passed?",
    "Republican hard-right vows to sink deal hours before vote expected",
    "Gerrymandered districts set stage for 2024 Republican wins",
    "Exclusive Trump lawyer said to have been waved off searching office for secret records",
    "Ex-president reiterates pledge to scrap birthright citizenship",
    "US warned it might suspend ties with Australian special forces over war crime allegations",
    "President says he would support peace agreement with cartels",
    "Former New Jersey governor will reportedly announce 2024 presidential bid next week",
    "Librarians sue state over law banning them from giving ‘obscene’ books to children",
    "Asian Americans do not have access to information, survey finds",
    "Sale of Hitler memorabilia to go ahead despite outcry",
    "Hundreds were killed. Are we already forgetting them?",
    "The farmers dealing with water shortages even before historic Colorado River deal",
    "End of the boom for Birmingham’s Balti Triangle",
    "Defamation case pitting the media against Victoria Cross soldier",
    "The side hustle that keeps a literary author’s career afloat",
    "How to regain your sense of self, hope and happiness",
    "A punchier, bolder, hotter and sweatier than ever",
    "Four ways to find love – without the apps",
    "Succession’s Jeremy Strong tried to jump into a river during final scene",
    "How the ‘nice’ comedy became utterly dreadful television",
    "Plight of migrants as slums razed in French territory of Mayotte",
    "What US job will shrink the most in the next decade?",
    "Moscow not planning to declare martial law after drone attacks, says Kremlin",
    "Macron to call for European ‘strategic awakening’ following invasion",
    "Who was behind the Moscow drone attacks?",
    "What we know on day 462 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Frilly dresses and white supremacy: welcome to the weird, frightening world of ‘trad wives’",
    "Across Europe, the far right is rising. That it seems normal is all the more terrifying",
    "UK Labour’s oil and gas ban shows it’s ready to fight the next election on climate issues",
    "Healing nature will help us all. So why are MEPs fighting a key new restoration law?",
    "Running out of battery: how post-Brexit Britain is failing to set up a future-focused economy",
    "How bench players can tilt the NBA finals",
    "Bass sorry for anti-LGBTQ post as Kershaw backs Christian Faith Day",
    "How can the languishing National Spelling Bee regain its sting?",
    "Our predictions versus reality",
    "French Open day four – Tsitsipas and Svitolina in action, Pegula wins",
    "Kosovo Olympic authorities urge IOC to take action against player",
    "Hudson quits as manager as second interim hired amid search",
    "Liverpool mull Koné move but reject Leipzig’s Carvalho bid",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Staffer who accused Joe Biden of sexual assault defects to Russia",
    "Restaurant manager died after getting trapped inside a freezer, lawsuit says",
    "Purdue can shield wealthy Sackler family from opioid lawsuits, court rules",
    "Rare white bison born in Wyoming is first in park’s 32-year history",
    "Five people still unaccounted for after apartment building collapse",
    "Debt ceiling deal clears first hurdle and advances for debate",
    "Republican hopeful says he will ‘destroy leftism’ in US if elected president",
    "Firefighting goats could be furloughed due to employment law",
    "Chinese pilot performed ‘aggressive maneuver’ near US plane, military says",
    "Connecticut exonerates victims of 17th-century trials",
    "Outrage after teenage girl killed in Delhi street",
    "Doctor who criticised army for diverting aid is arrested",
    "Under-fire PM said he would consider early elections in north if violence ends",
    "Mountaineer Luis Stitzinger found dead near Himalayan peak",
    "Adventurers reach Rockall in bid to live on north Atlantic islet for 60 days",
    "UN experts express ‘grave concern’ over detention of Jimmy Lai",
    "Stop dumping your cast-offs on us, clothes traders tell EU",
    "Royal fever sweeps ahead of crown prince's wedding",
    "Boy, 3, found dead in Sydney unit alongside injured 45-year-old man",
    "Tracking down Ukraine’s abducted children",
    "Listen to previous episodes",
    "Jess Williamson on fate, Plains and her breakout fifth album",
    "Crazily frantic sequel with full-spin energy",
    "After half a century, still having the time of his life",
    "Pushing Buttons: Why I don’t worry about ‘completing’ games",
    "Books about connecting with nature",
    "Manuscripts shed light on how medieval minstrels skewered society",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "Airbnb is in denial over concerns we raised about our host",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The employees working under surveillance",
    "The dating trend that is unlikely to improve your love life",
    "40 years of the Smiths’ Peel Sessions",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "‘People wanted to believe the fairytale’",
    "Growing debate over vape regulation",
    "Rare Italian deer make long journey to survival",
    "Beyoncé and World Parrot Day",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘One of the blasts shook our house’: Russians wake up to war at home",
    "‘Ball of fluff’: rare white bison born in Wyoming is first in park’s 32-year history",
    "US debt ceiling: Republican hard-right vows to sink deal hours before vote expected",
    "Good riddance, Ted Lasso: how the ‘nice’ comedy became utterly dreadful television",
    "Tara Reade, who accused Joe Biden of sexual assault, defects to Russia",
    "Donald Trump reiterates pledge to scrap birthright US citizenship",
    "Thelma and Louise review – punchier, bolder, hotter and sweatier than ever",
    "Ron DeSantis says he will ‘destroy leftism’ in US if elected president",
    "Stop dumping your cast-offs on us, Ghanaian clothes traders tell EU",
    "Who was behind Moscow drone attacks and what do they mean for Ukraine war?"
]