[
    "The Guardian - Back to home",
    "Explainer What’s going to happen when Trump shows up at court?",
    "Indictment who's who A guide to everyone mentioned in the charges",
    "The charges against Trump Full text of federal indictment",
    "Trump finds no new lawyers for court appearance in Mar-a-Lago case",
    "Donald Trump ‘won’t be handcuffed’ at Miami court",
    "Ex-president to make unwanted history – again – in Miami courtroom",
    "US prices rose 4% over the last year as Fed considers pause in rate hikes",
    "Visitors warned away from Texas beach after thousands of dead fish wash up",
    "Nine injured in shooting after Nuggets win NBA title",
    "US halts appointments using phone app at Texas border crossing",
    "Romanian authorities charge TikTok influencer with more serious human trafficking charge",
    "Prolific character actor dies in motorcycle crash aged 71",
    "Twenty-two troops injured in helicopter ‘mishap’, US military says",
    "Pat Sajak to step down as host after more than 40 years",
    "Mixed reactions after Elizabeth Gilbert pulls Russia-set novel",
    "The harm from AI is already here. What can the US do to protect us?",
    "What is all the fighting in the UK Tory party about – and how is Boris Johnson involved?",
    "Israeli women fear loss of rights in legal overhaul",
    "Only the world-famous cellist Yo-Yo Ma!",
    "Queer influencers in the US say brands have gone quiet",
    "Denver and the improbable, inevitable Jokić are an NBA dynasty in-waiting",
    "How much salt is too much salt?",
    "Ngũgĩ wa Thiong’o: three days with a giant of African literature",
    "The cyclist who raced men across America … and won",
    "Kickboxer thriller looks like ad for Amsterdam tourist board",
    "I can only climax in one position. Why do my lovers try to talk me out of it?",
    "What is it like to do standup at a music festival?",
    "Russia launches deadly missile attack on Kryvyi Rih, says mayor",
    "What we know on day 475 of the invasion",
    "Skulls left scattered after dam breach may be from second world war",
    "Ukrainian mayor sees opportunity amid dam chaos",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "America is facing a mental health crisis",
    "A mother jailed for procuring her own miscarriage. Is that what we want in 21st-century Britain?",
    "The US holds its nose over Saudi Arabia’s human rights record – when the price is right",
    "Whisper it, but the boom in plastic production could be about to come to a juddering halt",
    "The nutritionist made a lot of sense – until her perplexing advice about raw chicken",
    "NBA Denver and the improbable Jokic are a dynasty in-waiting",
    "Nuggets' late surge delivers first title in team's 47-year history",
    "Mbappé stuns PSG with formal decision not to renew contract",
    "Why Jack Grealish is having the best week of his life",
    "Former Olympic champion died in childbirth, according to autopsy",
    "Saudi golf takeover is blueprint for what they want to do everywhere else",
    "Zinchenko will not be silenced over war in Ukraine",
    "Sweden players had to show genitalia to doctor at 2011 World Cup, says Fischer",
    "Young people testify at historic US climate trial",
    "Young residents bring climate change case to court for first time ever",
    "Illegal reintroductions of rare butterflies to UK ‘a risk to other species’",
    "India and Pakistan keep close eye on tropical cyclone",
    "Company hires boy, 14, who became youngest graduate at California university",
    "Queens of the Stone Age frontman reveals cancer treatment",
    "Republican official appears to have moved $1.3m from nonprofit to own law firm",
    "Police chief Keechant Sewell quits after 18 months",
    "California governor Gavin Newsom backs Joe Biden on Fox News",
    "Affleck and Damon condemn use of audio in campaign video",
    "Westfield mall firm gives up San Francisco center as Nordstrom closes",
    "US regulators move to block Microsoft’s $69bn Activision Blizzard deal",
    "Cruise robotaxi appears to hinder emergency crews after mass shooting",
    "Top Broadway star likens Ron DeSantis to Klan grand wizard",
    "Most early-stage breast cancer patients will be long-term survivors – study",
    "Full report Man arrested after three people killed in Nottingham",
    "UK: three people dead and three in hospital after ‘major incident’ in Nottingham",
    "‘Incredibly rare’ tomb unearthed near London Bridge station",
    "India threatened to shut down Twitter, co-founder Jack Dorsey says",
    "Country moves towards plugging massive methane leaks",
    "Thousands of tonnes of rock break off summit of mountain",
    "Call to overhaul ‘out of date’ UK laws after woman jailed",
    "Relatives battle over custody of children",
    "‘Dead’ woman bangs on coffin during her own wake",
    "Australian hiker, 24, missing in Canadian bear country",
    "The long shadows of Boris Johnson and Nicola Sturgeon",
    "Listen to previous episodes",
    "Graham Norton on drag, dreams, death and desire",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Ezra Miller makes first public appearance to promote The Flash at the film’s premiere",
    "Wes Anderson says misconduct allegations won’t affect their working relationship",
    "Post-internet artist on refusing honours, buying her work back – and fighting big tech",
    "A real university challenge",
    "Don’t underestimate the humble box grater",
    "Rachel Roddy’s recipe for fried polenta with cheese",
    "Max Mara’s Scandi show signals shift in fashion zeitgiest",
    "More than one in 10 women struggle to bond with their newborn baby, survey shows",
    "Rosie Sykes’ recipes with frozen peas",
    "Blossom the sheep was struggling to give birth – and the vet wanted my help",
    "Ex-F1 champion Nico Rosberg on his sustainable entrepreneurship",
    "UK’s rewilding gurus bring out their bible",
    "Why was Nicola Sturgeon arrested and what does it mean for Scottish independence?",
    "Why is a great painter who lived to 101 still defined by a man she left in the 1950s?",
    "What your grip says about your health – and how you can improve it",
    "The powerful yearning of what might be 2023’s best movie",
    "Corsica protesters and an early morning hare",
    "Colombia’s Tomato Fight festival",
    "Local designers show their collections at Fiji fashion week 2023",
    "The best of Photo Basel 2023",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Dead’ woman bangs on coffin during her own wake in Ecuador",
    "Treat Williams, prolific character actor, dies in motorcycle crash aged 71",
    "‘My life and my home’: young people start to testify at historic US climate trial",
    "‘They’re caving to bullies’: queer influencers in the US say brands have gone quiet",
    "SpaceX hires boy, 14, who became youngest graduate at California university"
]