[
    "The Guardian - Back to home",
    "Dom Phillips and Bruno Pereira  Last images found on recovered phone",
    "Alessandra Sampaio My husband was killed for exposing the Amazon’s plunder. But his work lives on",
    "Murdered protecting the Amazon Remembering Bruno Pereira and Dom Phillips – video",
    "Amazon at risk of being taken over by mafia, ex-police chief warns",
    "A year later their Indigenous allies risk death to carry on the work",
    "One year after their deaths, Bruno and Dom's work must go on",
    "Donald Trump Ex-president regretted not declassifying retained military document in recording",
    "Months of distrust inside Trump legal team led to top lawyer’s departure",
    "Plastic containers still distributed across the US are a potential health disaster",
    "US debt ceiling explained Key takeaways from the vote",
    "Republicans Senator told expert ‘I don’t want reality’ in hearing on race and eduction",
    "US debt ceiling bill heads for Senate as both House sides claim victory over vote",
    "Truck driver held after spilled potatoes cause chaos on bridge",
    "Air force general convicted of abusive sexual contact losing ranking on retiring",
    "Researchers make world-first breakthrough",
    "E Jean Carroll co-writes romance novel with ex-president’s niece Mary Trump",
    "Failed Republican candidate charged with shootings at lawmakers’ homes",
    "Decision will be known as ‘historic economic error’, says former US treasury secretary",
    "Recordings lost in New York Public Library will finally be heard",
    "Victory helps Biden boost image as an apostle of bipartisanship",
    "Attorney general who secured Derek Chauvin conviction on the lessons of George Floyd",
    "How Illinois changed the law to provide halal and kosher meals to schoolchildren",
    "The murders and war crimes at the heart of a seismic defamation battle",
    "Elizabeth Taylor’s 20 best performances",
    "Thirteen secret signals all cat owners need to know – from a quivering tail to aeroplane ears",
    "The backlash: how slavery research came under fire",
    "To the class of 2023, I say three words: you poor bastards",
    "‘She made me see working mothers from a different perspective’",
    "A raw, unapologetic act of mourning",
    "Everyone thought we were dating. It’s rare for two men to be so close",
    "My partner is kind, affectionate and emotionally open. I want to break up with him",
    "Three die in early morning attack by Russia",
    "President pleads for ‘security guarantees’ for Ukraine and Moldova",
    "US announces $300m arms package for Ukraine – with a caveat",
    "What we know on day 463 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Gay and trans people deserve to live without persecution in the US. Why is that so hard?",
    "The debt ceiling fight was never about debt. It was about Republican power",
    "Elizabeth Holmes’ big con deserved prison time – so why do I feel sorry for her?",
    "Republicans love to make up fake crises. Here are five of the biggest",
    "US and China are on a collision course that could risk conflict",
    "Acting, sexiness and late babies: why Pacino v De Niro is the daddy of all rivalries",
    "French Open day five: Day shocks Keys, Ruud and Sinner in action",
    "Nuggets or Heat? Our writers share their picks",
    "Critics say ‘absolutely no change’ despite scandals",
    "Mourinho swears at referee Taylor and labels him ‘disgrace’ in car park",
    "Raducanu splits from coach amid injury layoff",
    "Djokovic defiant over political message",
    "Manchester United agree personal terms with Mount",
    "Drive To Survive commentator fired over ‘inappropriate behavior’",
    "Here’s proof fishing bans leave plenty to eat, says study of Mexico marine park",
    "The farmers dealing with shortages even before historic Colorado River deal",
    "Foggy future for Arctic shipping as sea ice melts",
    "Climate change to blame for up to 17 deaths, experts say",
    "US House passes bill just days before default",
    "Utility avoids trial for 2020 wildfire that killed four",
    "Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Special counsel reportedly examining firing of cybersecurity official",
    "Corporate workers walk out over climate goals and return to office",
    "Value down two-thirds since Musk takeover, says investor",
    "Actor will not face sexual assault charges in Los Angeles case",
    "Rapper accuses drinks giant Diageo of racism in US lawsuit",
    "Gas station owner charged with murder after teen killed",
    "Trump reiterates pledge to scrap right",
    "Australian loses defamation case with judge finding ex-SAS soldier committed war crimes",
    "19 die in shelling of market south of Khartoum after army quits ceasefire",
    "Nepali sherpa saves climber in rare ‘death zone’ rescue",
    "Government outlaws criticism of administration before August elections",
    "Canadian socialite Jasmine Hartin fined over killing of police officer",
    "Non-EU workers outnumber EU ones in various UK sectors in post-Brexit shift",
    "Grant Shapps urges No 10 to hand over Boris Johnson’s WhatsApps",
    "Items found in search related to missing child not confirmed as evidence, say officials",
    "Man accused of starting hostel fire faces five murder charges",
    "Marineland theme park charged over its handling of black bears",
    "Sofas, smiles – and scandal: what’s going on at ITV’s This Morning?",
    "Listen to previous episodes",
    "A powerful, humanist spectacular",
    "Samantha Jones was the show’s best character. Here are 10 of her finest moments",
    "Film subjected to ‘review bombing’ with mass negative reactions posted by bots",
    "Why the Smiths are eternally influential",
    "Gays on Broadway by Ethan Mordden review",
    "Stolen cupcakes, strange space things and a sudden holiday",
    "I’ve come to love Chișinău: my home city in Moldova deserves the spotlight",
    "Four ways to find love – without the apps",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "How a Mexican state siphoned off millions – and a reporter risked her life to expose it",
    "Woman jailed in Tehran calls for environmentalists’ release",
    "The side hustle that keeps a literary author’s career afloat",
    "Hundreds were killed. Are we already forgetting them?",
    "What US job will shrink the most in the next decade?",
    "Dollar General safety violations alarm workers",
    "Beyoncé and World Parrot Day",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘To the class of 2023, I say three words: you poor bastards’: the year’s best graduation speeches",
    "Sudan: 19 killed in shelling of market in poor area south of Khartoum",
    "US air force general convicted of abusive sexual contact losing ranking on retiring",
    "Republican senator says ‘I don’t want reality’ in hearing on race and eduction",
    "Australian researchers make world-first endometriosis breakthrough",
    "‘Perfect storm of chaos’: A week after Typhoon Mawar, most of Guam still without basic services"
]