[
    "The Guardian - Back to home",
    "US deal narrowly passes Senate averting catastrophic federal default",
    "Kyiv shoots down more than 30 missiles and drones in early morning strikes",
    "Fox News Town hall plays it safe with Trump as network faces lawsuit",
    "Trump repeats his usual lies – but the big lie is missing",
    "Air force drone controlled by AI killed its operator during simulated test",
    "President trips and falls at Air Force Academy graduation ceremony",
    "Tesla chief accused of insider trading in Dogecoin lawsuit",
    "Outcry after leading climate activist arrested, accused of tax evasion",
    "Actor is accused of drugging and sexually assaulting woman in 1969",
    "US deal could plug Turkmenistan’s colossal methane emissions",
    "Engineer’s report indicated risk of imminent crumbling",
    "Couple team up to save life of fellow passenger on Southwest flight",
    "A year on, their Indigenous allies risk death to carry on the work",
    "Twitter and Tesla’s interests at odds in quiet China visit",
    "Apostle of bipartisanship: why US debt ceiling deal was a victory for Joe Biden",
    "Minnesota's top attorney on how he won justice for George Floyd’s family",
    "A reality TV family and the dangers of fundamentalism",
    "Campaigner Brianna Craft on the struggle smaller countries face",
    "The 12 clues that foreshadowed Succession’s ultimate winner",
    "Why do they eat grass? And when is it not safe for them?",
    "My partner and I are about to move to my home country. What’s the best approach?",
    "Author to write a book about being stabbed on stage",
    "How 2023’s most wildly entertaining TV is all about female private eyes",
    "‘I hated the way major labels made my music sound’",
    "Anti-Putin partisans shell town four miles from Ukraine border",
    "What we know on day 464 of the invasion",
    "President hails ‘powerful support’ for Ukraine at Moldova summit",
    "Ukrainian sanctions on media tycoon revealed",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "One year after their deaths, Bruno and Dom's work must go on",
    "Alessandra Sampaio My husband was killed for exposing the Amazon’s plunder. But his work lives on",
    "Republicans love to make up fake crises. Here are five of the biggest",
    "Elizabeth Holmes’ big con deserved prison time – so why do I feel sorry for her?",
    "Gay and trans people deserve to live without persecution in the US. Why is that so hard?",
    "Boris Johnson’s messages are just the start of it: the UK government is run on WhatsApp",
    "The debt ceiling fight was never about debt. It was about Republican power",
    "As it happened Read Hunter Felt's rolling report of Game 1",
    "Imperious Jokić shines as Nuggets roll to Game 1 win over Heat",
    "Complete player ratings from the Nuggets' Game 1 win",
    "Emma Raducanu  British player splits from coach Sachs",
    "Rybakina harnesses power to continue push for title",
    "Beckham makes ‘tough decision’ as he sacks Neville at Inter Miami",
    "UK soccer must finally take a stand against antisemitism",
    "Mourinho fights the bad fight and ends up losing",
    "Final referee ‘spoke at event with far-right leader’",
    "Red Bull could be first team to win every race, says Verstappen",
    "How disinfecting an old US mineshaft saved a colony of little brown bats",
    "Here’s proof fishing bans leave plenty to eat, says study of Mexico marine park",
    "The farmers dealing with shortages even before historic Colorado River deal",
    "Foggy future for Arctic shipping as sea ice melts",
    "Supreme court ruling makes it easier for companies to sue striking workers",
    "Company threatens to pull news content in California if law to pay publishers passes",
    "Rescuers amputated woman’s leg to pull her from building collapse",
    "Jamie Dimon claims he had never heard of Epstein before arrest",
    "Conspiracy theorist and Democrat says he has ‘conversations with dead people’",
    "Trump accuser writes romance novel with ex-president’s niece",
    "Websites taken down after buyers fall for fake currency",
    "Upstate village’s cherished swan stolen and eaten by three teens",
    "Doctor accused of using own sperm to impregnate patients dies in air crash",
    "Aide who alleged sexual harassment details payments to staffer",
    "Facebook founder completes extreme fitness challenge in 44lb vest",
    "Plastic containers still distributed across the US are a potential health disaster",
    "Woman charged in court for having abortion",
    "Country swelters through record temperatures, putting pressure on power grids",
    "Taiwan hails ‘comprehensive’ trade deal with US as China issues warning",
    "Woman in coma becomes 16th victim of 2001 suicide bombing",
    "US fines airline $1.1m for ‘failing to refund’ Covid cancellations",
    "Fears extreme heat and strong winds could worsen Nova Scotia fires",
    "Crown prince cements status with glitzy wedding to Saudi architect",
    "Last images found on recovered phone",
    "Commission exposes injustices against Indigenous people",
    "Sonic the Hedgehog co-creator may face jail over alleged insider trading",
    "Is Manchester City’s dominance of English football fair?",
    "Listen to previous episodes",
    "Singer-songwriter to end Madison Square Garden residency in 2024",
    "Actor’s daughter says family ascribed his dementia to ‘Hollywood hearing loss’",
    "Our writers pick their favourite Stephen King movies",
    "Acting, sexiness and late babies: why Pacino v De Niro is the daddy of all rivalries",
    "Elizabeth Taylor’s 20 best performances",
    "Trump election reframed TV version of book, says Atwood",
    "My partner is kind, affectionate and emotionally open. I want to break up with him",
    "Everyone thought we were dating. It’s rare for two men to be so close",
    "I’ve come to love Chișinău: my home city in Moldova deserves the spotlight",
    "Stolen cupcakes, strange space things and a sudden holiday",
    "Four ways to find love – without the apps",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "How Illinois changed the law to provide halal and kosher meals to schoolchildren",
    "The murders and war crimes at the heart of a seismic defamation battle",
    "To the class of 2023, I say three words: you poor bastards",
    "Covid inquiry v Cabinet Office: who is ahead now deadline has passed?",
    "What US job will shrink the most in the next decade?",
    "How a Mexican state siphoned off millions – and a reporter risked her life to expose it",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "AI-controlled US military drone ‘kills’ its operator in simulated test",
    "Trump repeats his usual lies in Fox News town hall – but the big lie is missing",
    "Republican senator says ‘I don’t want reality’ in hearing on race and education",
    "Badly behaved theatregoers: ‘A woman urinated in a stairwell adjacent to where we were sitting’",
    "Socialite Jasmine Hartin fined after killing Belize police officer",
    "Why do dogs eat grass? And when is it not safe for them?",
    "US debt ceiling deal narrowly passes senate averting catastrophic federal default",
    "Biden trips and falls at Air Force Academy graduation ceremony"
]