[
    "The Guardian - Back to home",
    "Texas Record-setting heat sends hundreds of people to emergency rooms",
    "Climate crisis Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Renewable energy Solar helps Texas carry energy load as heatwave puts power grid to test",
    "Over 80m people under air quality alerts as extreme heat and smoke spreads across US",
    "Joe Biden to unveil ‘Bidenomics’ plan in speech setting up re-election campaign",
    "Ukraine Defence minister expects Nato ‘guarantee’ after war",
    "Nato Alliance ready to face threat from ‘Moscow or Minsk’",
    "Russia-Ukraine war: Kramatorsk strike death toll rises to 11; Biden says Putin is a ‘pariah’",
    "Debris returned to land after fatal implosion",
    "Nasa aims to mine resources on moon in next decade",
    "Yusef Salaam declares victory in city council primary",
    "Trump trial could be delayed until spring 2024",
    "Highest-ranking trans elected official in US to run for Congress",
    "Athlete returning to gymnastics in first meet since 2020 Tokyo Olympics",
    "Human gene identified that prevents most bird flu viruses moving to people",
    "Pilot dumps drugs over remote region when pursued by fighter jet",
    "Manuscript sheds new light on creation of Capote’s In Cold Blood",
    "Why are sea lions and dolphins dying along California’s coast?",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are US retail workers being denied chairs?",
    "What we know on day 490 of the invasion",
    "US targets mercenary force by sanctioning gold companies suspected of funding it",
    "UN says Russian forces have tortured and executed civilians in Ukraine",
    "Four children among 11 killed in missile strike on pizza restaurant",
    "Guardian Today US: Get the headlines & more in a daily email",
    "What does it mean to be intersex?",
    "10 ways to be much more confident at parties",
    "Mike Figgis on Julian Sands",
    "Meghan and Harry’s trainwreck podcast career",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Frederic Forrest, consummate character actor",
    "10 famous food rules you can absolutely ignore",
    "The married couple competing to have the biggest and best facial hair",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Everything has turned grey – cars, clothes, kitchens, carpets. I can’t take it any more",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "The key to wedded bliss is a joint bank account? I don’t buy it",
    "South Korea has turned back time and made its people younger – sign me up",
    "Gymnastics star returning to competition in first meet since 2020 Olympics",
    "Tennessee State to become first HBCU to add ice hockey",
    "Brittney Griner’s triumphant return to the WNBA",
    "Ohtani becomes sixth with two homers and 10 strikeouts since 1893",
    "How good are Brazil and how far can they go?",
    "Stage-by-stage guide to this year’s race",
    "Former NFL quarterback dies in apparent drowning aged 35",
    "Saudi leader trying to avoid ‘pariah’ status with LIV-PGA merger, says campaigner",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "Walt Nauta Trump valet arraignment delayed after losing Florida lawyer over fees dispute",
    "Former president sues E Jean Carroll for defamation over rape comments",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "Airbnb to offer pink Malibu mansion",
    "US paramedic saves lives of two people in one family",
    "Rapper accused of antisemitic abuse by former business partner",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Human remains found in California mountains confirmed as British actor",
    "Supreme court ruling on stalking cases sparks alarm",
    "Ryan Seacrest to take over as host as Pat Sajak exits",
    "Amazon facing ‘urgent’ crime crisis after gutting of protections, says drugs tsar",
    "Former PM and ex-parliamentarian investigated by police",
    "Video of apparent neo-Nazi handing out balloons at nursery sparks outrage",
    "Changing skin pattern while asleep may show they dream, research shows",
    "Chaos at feral cat hunting contest as video of children chanting with dead animals emerges",
    "Beaver spotted ambling around garden in broad daylight",
    "Fury as Sweden allows Qur’an burning risks further delays to Nato bid",
    "Citizens become a year or two younger as country changes system for counting ages",
    "Labour leader beaten to death while trying to resolve dispute",
    "Actor arrives at court in London for sexual assault trial",
    "The oil company CEO running the next UN climate change summit",
    "Listen to previous episodes",
    "Hijack review Idris Elba makes this beautifully daft plane thriller soar",
    "Idris Elba: racist backlash made speculation over James Bond ‘disgusting’",
    "Two street artists claim responsibility for hoax Banksy",
    "Twitter rips into Jeremy Corbyn’s poetry – except it’s actually by Shelley",
    "Julian Sands in A Room With a View: the soulful heart of a brilliantly romantic film",
    "Top 10 summer love stories",
    "A polar bear theatre in Rotterdam zoo",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "10 of the weirdest sporting events in the UK",
    "The surprising culinary advice of one of the world’s best chefs",
    "Barbecue sides that will steal the show",
    "I moved my date’s hand off my breast and he took it badly. Should I have said something instead?",
    "The author under attack for doubting Shakespeare",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Outcry after tourist carves name on wall at Colosseum",
    "How Kylie and Fleetwood Mac found new young fans",
    "New Zealand boatshed sells for record $2m despite housing market crash",
    "Mountain basketball and an earthquake wedding",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "Four children among 11 killed in missile strike on Ukraine pizza restaurant",
    "The End of Sex review – couple’s sexual misadventures aim to relight fading fires",
    "‘It gets worse every day’: why are sea lions and dolphins dying along California’s coast?",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "Over 80m people under air quality alerts as extreme heat and smoke spreads across US – live",
    "A moment that changed me: I was gay, disabled, alienated. With seven kind words, my life began"
]