[
    "The Guardian - Back to home",
    "Washington threatens to disrupt PGA Tour’s merger with Saudi-funded LIV",
    "Greg Abbott decision to bus migrants to LA condemned as ‘despicable stunt’",
    "Live Biden and Haaland hail decision to uphold protections",
    "Full story Native American children's protections upheld",
    "Native American tribes hail supreme court ruling",
    "Church hands over ‘voluminous documents’ about accused US ex-priest",
    "Up to 100 children were below deck, survivors say",
    "Nusrat Jahan Choudhury confirmed as first Muslim woman to be federal judge",
    "Blinken visit seeks to ease fraught US relationship with China",
    "Pilots being trained to fly F-16 jets, says Nato",
    "Man dies in jail ahead of trial for murder of his mother on fishing trip",
    "US man held after fatal attack near Neuschwanstein Castle",
    "Music publishers sue company for $250m citing Musk’s copyright stance",
    "What if your attacker became your lawyer – and you didn’t know it?",
    "Boris Johnson's parting shot speech analysed",
    "Hope fades among relatives of missing after Greek shipwreck",
    "Billions stolen in wage theft from US workers",
    "The singers lifting economies with their vocals",
    "The rise and fall of Milli Vanilli",
    "Plain ‘white people food’ goes viral in China",
    "How Glenda Jackson brought class to cinema",
    "Meet the Los Angeles sisters taking the design world by storm",
    "Shipwreck disaster exposes Europe’s deadly failure",
    "Get an iron, go to a gallery and try ‘cuff-stacking’",
    "‘Keep your reparations. It’s about access to capital, and we’re being shut out’",
    "Western firms snub event as its prestige evaporates",
    "Putin sides with military chiefs over placing Wagner under direct control",
    "Ukraine’s failed Mala Tokmachka assault lays bare counteroffensive challenges",
    "What we know on day 477 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "What do you know, Boris Johnson lied. But the carnival of crazy has just begun",
    "Elizabeth Gilbert is pulling a novel set in Russia from publication. That’s unsettling",
    "The hard right and climate catastrophe are intimately linked. This is how",
    "Snarls and smears from disgraced Boris Johnson, readying his troops for civil war",
    "Extreme websites peddle conspiracies, but what about the mainstream outlets that do it too?",
    "20 things I learned from the NBA playoffs",
    "McGregor denies allegation he sexually assaulted woman at NBA finals",
    "Jokić’s magnificent indifference to NBA glory",
    "PGA Tour’s controversial merger with LIV faces new threat",
    "Luis Arráez and the quest for baseball’s elusive .400 barrier",
    "Bellingham makes pitch-perfect start to epic Madrid adventure",
    "Manchester City open at Burnley, Liverpool open at Chelsea",
    "Fossil fuel lobbyists will have to identify themselves when registering for conference",
    "‘Drought is on the verge of becoming the next pandemic’",
    "Fears of hottest year on record as global temperatures spike",
    "Just Stop Oil protesters interrupt opera at Glyndebourne festival",
    "Air quality US midwest braces for smoky skies as Canadian wildfires rage on",
    "US east coast cities warned to draft air quality plans similar to those in the west",
    "Rightwing radio host scolds Pence for not saying he’d pardon Trump",
    "Bill de Blasio on dropping groundhog that later died",
    "Four indicted over ‘appalling’ theft of body parts from Harvard Medical School",
    "New game raises eyebrows in UK over similarity to Only Connect",
    "US Southern Baptist Convention upholds expulsion of churches over female pastors",
    "Sarah Palin denies then seems to confirm that Trumpism is a cult",
    "Actor sued by nine more women in Nevada over sexual assault allegations",
    "LGBTQ+ nightclub shooting suspect expected to take plea deal",
    "Gallup survey shows support in US remains strong",
    "Boris Johnson Key findings from report into lockdown partying",
    "Analysis Boris Johnson goes down fighting but runs head first into Partygate reality",
    "Ex-PM deliberately misled parliament over Partygate, damning report finds",
    "Benjamin Netanyahu suffers rebellion in vote linked to judicial overhaul",
    "Wildcats to be released in secret sites in effort to avoid extinction",
    "Over 500 dolphins killed since hunt resumed in May",
    "Double Oscar-winning actor and British politician dies aged 87",
    "Paramilitary forces blamed for assassination of West Darfur governor",
    "Police officer in hospital after swallowing extorted banknotes",
    "Sexual assault allegations against Till Lindemann to be investigated",
    "Boy killed in crash reportedly involving YouTubers filming in Lamborghini",
    "Glum graduates go viral with pictures of misery amid jobs anxiety",
    "Is it time to decriminalise abortion in the UK?",
    "Listen to previous episodes",
    "Why multiplex multiverses are destined to fail",
    "The dark brilliance of Cormac McCarthy",
    "The 25 best stunts in cinema",
    "Chris Hemsworth action sequel most interested in extracting cash",
    "The quest for music’s most extreme sounds",
    "The 24-year-old with a brain tumour filming his family’s reaction",
    "We put it to the taste test",
    "My shopping bags were too heavy. Could I embrace the obvious solution?",
    "10 spectacular salads to help you eat 30 plants a week",
    "Is it adultery if you cheat with an AI companion?",
    "'I saw a beautiful Black woman – and we shared an instant connection’",
    "‘She worried that 16- to 25-year-olds don’t have the maturity to make life-changing decisions’",
    "Bodies lie in the sand in Niger while Europe pours millions into blocking migration route",
    "TikTok’s new trend of ‘canon events’",
    "Trump court sketches varied wildly",
    "How Turkish musicians welcomed Syrian refugees",
    "Empty seats at US graduations reveal toll of gun violence",
    "The sound ecologist capturing a disappearing world",
    "Just Stop Oil in London and protest in Peru",
    "The 10th BigPicture Natural World photography competition",
    "Christopher Makos’s best photograph",
    "Magical images of childhood",
    "Colombia’s Tomato Fight festival",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Native American tribes hail ‘major victory’ after supreme court ruling",
    "Greece shipwreck: up to 100 children were below deck, survivors say",
    "Vermont man dies in jail ahead of trial for murder of his mother on fishing trip",
    "‘Lunch of suffering’: plain ‘white people food’ goes viral in China",
    "Western firms snub ‘Russian Davos’ as its prestige evaporates",
    "Synthetic human embryos created in groundbreaking advance",
    "US man held after fatal attack near Neuschwanstein Castle in Germany",
    "‘I need to go home’: Nikola Jokić’s magnificent indifference to NBA glory",
    "Glum Chinese graduates go viral with pictures of misery amid jobs anxiety"
]