[
    "The Guardian - Back to home",
    "Japan PM prepares push in Hiroshima for nuclear weapons pledge",
    "Nike may have misclassified workers and could face over $530m in tax fines",
    "14th amendment  Democrats to urge Biden to use powers",
    "Biden ‘confident’ of reaching deal with McCarthy to avoid US debt default",
    "Pentagon leaks suspect was warned off viewing classified material – prosecutors",
    "Westpac bans transfers to world’s largest crypto exchange",
    "Top five US executives hoard $9bn tax-free for retirement as workers face limits",
    "House Republicans sidestep effort to expel fabulist from Congress",
    "Conservative judges signal support for anti-abortion plaintiffs in lawsuit",
    "Man sues Trump adviser for false arrest after ‘pat’ on back led to assault charge",
    "State becomes first in US to ban TikTok",
    "Doctors depart as attorney general investigates hospital’s gender-affirming care",
    "Dancers at club to become the US’s only unionized strippers",
    "Blues singer gets high school diploma decades after being expelled for his hair",
    "History can have lasting effects on mental health, study finds",
    "Man indicted for stealing Dorothy’s ruby slippers from Wizard of Oz",
    "Ukraine officials decry ‘unprecedented’ Russian missile strikes; one person dies in Odesa attack",
    "What we know on day 449 of the invasion",
    "Mercenary who fought for Russia in Ukraine jailed",
    "Beijing tells foreign embassies to remove ‘politicised propaganda’",
    "RK Russell on coming out in the male world of football",
    "Maybe so, but new parents in Iceland are holding out for better",
    "The everlasting appeal of giant art panoramas",
    "What’s on the menu when the G7 meets in Japan",
    "Pedro Pascal and Ethan Hawke sizzle in Almodóvar’s queer cowboy short",
    "US cyclist who taunted fascist group wins plaudits",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Assad’s regime took my father. Normalising relations feels like an attempt to rewrite history",
    "The fall of Rudy Giuliani, once the toast of New York, continues unabated",
    "If Macron doesn’t know why he’s despised, he hasn’t been listening",
    "I took my kids to the playground without bringing my phone – and it was a revelation",
    "I left my party lifestyle behind for a week in a nunnery – and began to see the light",
    "Heat strike first against Celtics in East finals behind Butler’s masterclass",
    "Jonathan Liew City’s inexorable hard power crushes Real Madrid",
    "Silva leads march into Champions League final",
    "Enciso, Almirón and the clash captivating a country",
    "Blue Jays’ Jackson says he was tipping pitches against Yankees’ Judge",
    "The San Antonio Spurs won the draft lottery. So did Victor Wembanyama",
    "LIV rebels can shake up Ryder Cup reckoning",
    "Power lies with two superteams. But that’s not necessarily a bad thing",
    "Off-key Djokovic bundled out of Italian Open by Rune",
    "World likely to breach 1.5C climate threshold by 2027, scientists warn",
    "Climate breakdown made southern Asia heatwave at least 2C hotter, study finds",
    "Pollution could be slashed by 80% by 2040, UN says",
    "EPA finally wakes up with stiff new climate rules",
    "Can Imran Khan really take on the Pakistani army and win?",
    "Listen to previous episodes",
    "Monster review Hydra of modern morals and manners",
    "Anselm review Wim Wenders’ reverent 3D portrait of artist Anselm Kiefer",
    "Tiger Stripes review Coming-of-age body horror releases the monster inside",
    "Johnny Depp on comeback trail amid criticism of festival organisers",
    "What the hell is going on with this bizarre editing of Sly’s life?",
    "Russia orders arrest of Oscar-nominated producer for criticism of war",
    "Convoluted but charming Netflix teen series",
    "Beatriz Milhazes’s carnivalesque odes to nature",
    "Naomi Klein investigates ‘conspiracy theory culture’ that has shaken her life",
    "Stupidly entertaining sequel offers more of the same",
    "A first-ever look at the making of the Rorschach test",
    "Steve McQueen’s moving meditation on wartime Amsterdam",
    "Falling in love with Albania",
    "A brutal attack ended my dreams of being a boxer – but I found a new passion",
    "Cracking modular PC gets all-round upgrade",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "Gucci show reaffirms Seoul’s status as capital of pop culture",
    "Recipe for apricots with French toast and pistachio mascarpone",
    "The Texas Democrat fighting for gun control and abortion rights",
    "Allies attempt to undermine prosecutors endangering 2024 bid",
    "Couple in ‘near catastrophic car chase with paparazzi’",
    "Missing girl featured in Netflix series Unsolved Mysteries found",
    "School district sued for violating first amendment rights with book bans",
    "Alligator relaxes at Alabama beach",
    "Avian flu vaccine for California condors approved amid fears of extinction",
    "Law aims to stop funding of illegal Israeli settlements in West Bank",
    "Intruder at home of Biden adviser bypassed Secret Service agents",
    "Trump wins proxy battle with DeSantis over governor pick",
    "Police to begin removing bodies from Wellington hostel two days after fire",
    "Renovation of Brussels park ignites debate on decolonisation",
    "Injectable HIV-prevention drug to be made in South Africa for the first time",
    "Digital scan of Titanic wreck could reveal its secrets",
    "Local elections could influence Stormont stalemate",
    "Nicolas Sarkozy must wear electronic tag, appeals court rules",
    "Devastating floods claim lives and leave thousands homeless",
    "Embattled president dissolves congress in bid to avoid impeachment",
    "Spanish climber, 84, injured in bid to be oldest to scale world’s 14 highest peaks",
    "Former world leaders urge G7 to get nuclear arms control back on track",
    "They moved to a Buddhist retreat in rural America. Have they found happiness?",
    "How drug became a target of the US anti-abortion movement",
    "Could a new brain-based treatment cure hot flushes?",
    "Quest to save family plot of land led from Guatemala to death at US border",
    "This 9/11 suspect and ‘torture prop’ has been there 20 years. Is he nearing a deal with the US?",
    "Could Guyana’s Exxon ruling scare big oil off risky exploration?",
    "What will happen if debt ceiling isn't raised?",
    "Navajo cowboys impersonating John Wayne: Roswell Angier’s best photograph",
    "A selection of the winning images",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Women drinking beer clothed: why are rightwingers melting down over Miller Lite?",
    "Texas doctors depart as attorney general investigates hospital’s gender-affirming care",
    "‘You wear Walmart khakis’: US cyclist who taunted fascist group wins plaudits",
    "Montana becomes first US state to ban TikTok",
    "Russia-Ukraine war at a glance: what we know on day 449 of the invasion"
]