[
    "The Guardian - Back to home",
    "Full story Trump charged on seven counts in documents case",
    "Explainer What is the case about and why is it significant?",
    "Jack Smith Veteran counsel at center of investigations",
    "Trump indicted over alleged retention of documents at Mar-a-Lago",
    "Intense fighting reported as forces go on attack south of Zaporizhzhia",
    "Surviving the smoke Californians offer advice to New Yorkers",
    "Wildfires Smoke could linger over parts of US for days",
    "Canada Country battles wildfires as smoke chokes cities",
    "Air pollution in US from smoke is worst in recent recorded history",
    "Visualized How Alabama discriminated against Black voters",
    "Alabama discriminated against Black voters, court rules",
    "Struggling Meta showcases new AI tools at company meeting",
    "Rishi Sunak and Joe Biden sign ‘Atlantic declaration’ but hope of trade deal ends",
    "10-year-old girl survives 24 hours in ‘rugged and remote’ Cascade mountains",
    "Five killed in shooting at car wash near Nazareth amid wave of violence",
    "US lawyer who alerted school to priest’s sexual misconduct seeks damages",
    "China reportedly reaches secret deal with Havana to host spy base on island",
    "Common energy drink ingredient taurine ‘may slow ageing process’",
    "French Alps city shocked by knife attack on young children in park",
    "So she’ll speak here instead.",
    "The Canadian village incinerated by record temperatures",
    "Pat Robertson, television evangelist",
    "The celebs go to space show we didn’t know we needed",
    "Ozempic has won, body positivity has lost. And I want no part of it",
    "Wild horse deaths in sierra show a delicate ecosystem off balance",
    "Here are the shows to help scratch that itch",
    "As the industry booms, what toll will it take on the environment?",
    "Janelle Monáe: The Age of Pleasure review – hot-girl-summer hedonism",
    "Nikola Jokić is making the NBA finals his masterpiece",
    "I’m not a bad packer – but I’m a horrible folder",
    "Zaporizhzhia Cooling pond at plant at risk after dam collapse",
    "What we know on day 471 of the invasion",
    "Dam collapse a global problem as waters may poison Black Sea, Zelenskiy says",
    "Villagers flee flooding after dam attack",
    "Kakhovka dam collapse unlikely to hurt Ukraine counteroffensive but will have long-term impact",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The CNN chief messed up in many ways. Only one of them was fatal",
    "People call me brave for going through cancer treatment – but the scary bit starts now",
    "Leader of the unappetising pack",
    "Prince Harry is not wrong to feel injustice, but he won’t find vindication in a court of law",
    "Your partner wants the truth? They can’t handle the truth! At least, according to film and TV",
    "Michael Caine’s novel will most likely be rubbish, but I’m glad he’s found his happy ending",
    "Jokić is making the NBA finals his masterpiece",
    "Hochul says Triple Crown race will only happen if air quality improves",
    "Bellingham is 19 and ready to be Real Madrid’s everything",
    "Djokovic and Alcaraz ready to serve up feast for the ages",
    "Messi has the power to realize soccer’s potential in the US",
    "Muchova stuns Sabalenka to set up final with Swiatek",
    "Power of Man City can reinforce Premier League dominance",
    "No winners in the Women’s World Cup broadcast fiasco",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "New York’s essential workers bear the brunt of poor air quality",
    "Donald Trump Lawyer for valet in Mar-a-Lago documents case alleges misconduct",
    "Trump requests reduced damages or new trial",
    "Republican hardliners revolt against their own speaker",
    "House of Representatives to hold hearing on whistleblower’s claims",
    "Tucker Carlson lawyer hits back at claim of contract breach",
    "Dog toy cannot mimic Jack Daniel’s, US supreme court rules",
    "Religious broadcaster dies aged 93",
    "Republican states send national guard troops to Texas border in show of force",
    "Joe Biden marks Pride month with high-profile support of community",
    "‘Forever chemicals’ exposure can lead to low birth weight and obesity in later life",
    "Whistleblower warns surveillance technology is much more intrusive today",
    "Dutch murderer extradited to US over Natalee Holloway disappearance",
    "People with sleep problems at greater risk, study suggests",
    "British child among French Alps stabbing victims, says foreign secretary",
    "Swiss billionaire jailed over asbestos-related deaths in Piedmont",
    "Russian man dies after being mauled by shark off Red Sea resort",
    "Activists take environment minister to court in fight to save northern spotted owl",
    "Palestinian journalist hit in head by bullet during raid on terror suspect’s home",
    "Hedge fund cuts ties with Crispin Odey after sexual assault allegations",
    "A prince’s day in court: Harry against the Mirror",
    "Listen to previous episodes",
    "The best movies of 2023 so far",
    "Actor to make West End debut with husband Matthew Broderick",
    "How Love Island bored away millions of viewers",
    "The song of the summer has arrived",
    "Anselm Kiefer on the nightmares he can’t escape",
    "Post your questions for Ice Cube",
    "When wedding proposals go hilariously wrong",
    "'Most things he said were anecdotal, whereas I was trying to present stats’",
    "‘Only 11 other people have completed it’ Cycling the 7,600km European Divide",
    "He moved in after a month together to care for me – then he kept being amazing",
    "A speeding fine, a baby donkey and a tram ride",
    "Have you stopped washing your clothes or wash them less often?",
    "10 ways to be more confident on dating apps",
    "Why America’s lesbian bars must be saved",
    "Why Rowan Atkinson is wrong about electric vehicles",
    "Former governor says he’s anti-Trump. But did he score a presidential pardon for a crony?",
    "The murder of Collette Gallacher – and her sisters’ fight for justice",
    "Readers on Canada wildfires smoke",
    "The lives lost in India’s train disaster",
    "Earth Photo 2023 shortlist",
    "Smoke engulfs American north-east",
    "Flip-flop boats, ‘trashion’ and the Bag Monster: the art of discarded plastic",
    "The news from a Mozambique landfill site",
    "Lunch mates and Brazilian beauty",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Lawyer for Trump valet in Mar-a-Lago documents case alleges misconduct",
    "Donald Trump charged with illegal retention of classified documents",
    "Trump indicted over alleged retention of documents at Mar-a-Lago – live",
    "Air pollution in US from wildfire smoke is worst in recent recorded history",
    "Teenage girl who pretended to be boy for sex duped second girl, court told",
    "Intense fighting reported as Ukrainian forces go on attack south of Zaporizhzhia",
    "‘They hate us so much’: villagers flee flooding after dam attack",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Canada: wildfires rage across British Columbia – video"
]