[
    "The Guardian - Back to home",
    "US supreme court US supreme court upholds protections for Native American children",
    "Supreme court: student loan debt relief and affirmative action could be among latest decisions",
    "World Bank Vast fossil fuel and farming subsidies causing ‘environmental havoc’",
    "Fears of hottest year on record as global temperatures spike",
    "Analysis Greek shipwreck highlights divided Libya’s inability to stem flow of refugees",
    "Search continues with hundreds missing and at least 78 dead",
    "Donald Trump Sarah Palin denies then seems to confirm that Trumpism is a cult",
    "Rightwing radio host scolds Pence for not saying he’d pardon Trump",
    "Power companies quietly pushed $215m into US politics via dark money groups",
    "Double Oscar-winning actor and British politician dies aged 87",
    "Man attacks two women near Neuschwanstein Castle, killing one",
    "Actor sued by nine more women in Nevada over sexual assault allegations",
    "Former New York mayor says he ‘100%’ has regrets over holding groundhog that later died",
    "What if your attacker became your lawyer – and you didn’t know it?",
    "Billions stolen in wage theft from US workers",
    "Inside a camp for Iraqis returned from Syrian detention",
    "‘Drought is on the verge of becoming the next pandemic’",
    "Meet the Los Angeles sisters taking the design world by storm",
    "The 25 best stunts in cinema",
    "The quest for music’s most extreme sounds",
    "Michael Billington Glenda Jackson was piercingly intelligent and unafraid to take risks",
    "How Glenda Jackson brought class to cinema",
    "Is it adultery if you cheat with an AI companion?",
    "Prepare to convulse in horror on the sofa",
    "Readers on golf’s Saudi takeover",
    "We put it to the taste test",
    "Putin sides with military chiefs over placing Wagner under direct control",
    "What we know on day 477 of the invasion",
    "Ukraine’s failed Mala Tokmachka assault lays bare counteroffensive challenges",
    "Ukraine urges clampdown after western parts found in Russian missiles",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Elizabeth Gilbert is pulling a novel set in Russia from publication. That’s unsettling",
    "The hard right and climate catastrophe are intimately linked. This is how",
    "The west has broken its promises to developing countries – and we’re all paying the price",
    "Extreme websites peddle conspiracies, but what about the mainstream outlets that do it too?",
    "All bets are off: why the Guardian has decided to reject gambling advertising",
    "#BarefootBoySummer has arrived – but really it’s just another seasonal hashtag to sell us stuff",
    "20 things I learned from the NBA playoffs",
    "Luis Arráez and the quest for baseball’s elusive .400 barrier",
    "Ewan Murray No time for Hollywood amid golf melodrama",
    "‘Where is the integrity?’ Readers on golf’s Saudi takeover",
    "Athletics’ stadium deal wins final legislative approval in Nevada",
    "Manchester City open at Burnley, Liverpool open at Chelsea",
    "At 91, Don King still longs for the spotlight. But it is shining elsewhere",
    "Organisers ‘failed to protect workers,’ claims Amnesty",
    "Manchester United pull out of Kane chase as cost proves out of reach",
    "Climate activist faces jail for fake letter to oil execs saying their meeting was cancelled",
    "Key EU law makes next stage despite rebellion from MEPs",
    "Indigenous traditions hit by fruit scarcity, climate trial hears",
    "US government toughens rules on chemicals used to break up oil slicks",
    "Greg Abbott Governor signs law banning diversity offices in Texas higher education",
    "Governor Greg Abbott sends ‘1st bus’ of migrants to Los Angeles",
    "Mayor of Miami Francis Suarez enters Republican presidential race",
    "LGBTQ+ nightclub shooting suspect expected to take plea deal",
    "WE Soda boss says New York would be ‘credible alternative’ for flotation",
    "Google earned $10m from ads misdirecting women to ‘pregnancy crisis centres’",
    "Governor issues budget veto threat in Republican campus fight",
    "Fox News explains away ‘wannabe dictator’ chyron during Trump speech",
    "Theranos founder objects to $250 monthly payments to victims",
    "US mother gets call from ‘kidnapped daughter’ – but it’s really an AI scam",
    "Former marine indicted over chokehold death of Jordan Neely",
    "Conservatives Boris Johnson allies voice fury at ‘vindictive’ Partygate report",
    "Boris Johnson Key findings from report into lockdown partying",
    "Interactive How No 10’s alleged parties took place as UK Covid death toll rose",
    "Former British PM deliberately misled parliament over lockdown parties, report finds",
    "Benjamin Netanyahu suffers rebellion in vote linked to judicial overhaul",
    "Show officially authorised by elusive street artist to open in Glasgow",
    "Glum graduates go viral with pictures of misery amid jobs anxiety",
    "US military will have ‘unimpeded’ access to Papua New Guinea bases under new security deal",
    "The Guardian bans all gambling advertising",
    "Wrestling federation chief charged with sexual harassment",
    "Synthetic human embryos created in groundbreaking advance",
    "Ottawa freezes ties with Chinese bank AIIB over claim it is ‘dominated by Communist party’",
    "Six charged over seizure of $1.7bn worth of drugs allegedly en route to Australia",
    "Is it time to decriminalise abortion in the UK?",
    "Listen to previous episodes",
    "Chris Hemsworth action sequel most interested in extracting cash",
    "The dark brilliance of Cormac McCarthy",
    "The 24-year-old with a brain tumour filming his family’s reaction",
    "Bridget Christie on comedy, TV and the menopause",
    "‘Ukraine earned its hardcore status’",
    "Weeds actor on fame, Botox and rumors of a reboot",
    "My shopping bags were too heavy. Could I embrace the obvious solution?",
    "'I saw a beautiful Black woman – and we shared an instant connection’",
    "10 spectacular salads to help you eat 30 plants a week",
    "Get an iron, go to a gallery and try ‘cuff-stacking’",
    "‘She worried that 16- to 25-year-olds don’t have the maturity to make life-changing decisions’",
    "A witch mural and a giant inflatable duck",
    "Bodies lie in the sand in Niger while Europe pours millions into blocking migration route",
    "TikTok’s new trend of ‘canon events’",
    "Trump court sketches varied wildly",
    "How Turkish musicians welcomed Syrian refugees",
    "Empty seats at US graduations reveal toll of gun violence",
    "The sound ecologist capturing a disappearing world",
    "Just Stop Oil in London and protest in Peru",
    "Christopher Makos’s best photograph",
    "Magical images of childhood",
    "Colombia’s Tomato Fight festival",
    "The best of Photo Basel 2023",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "Texas governor Greg Abbott sends ‘1st bus’ of migrants to Los Angeles",
    "Drinking alcohol is bad for you – end of. Ignore the headlines that claim otherwise",
    "Sarah Palin denies then seems to confirm that Trumpism is a cult",
    "Glum Chinese graduates go viral with pictures of misery amid jobs anxiety",
    "‘I have not seen one cent’: billions stolen in wage theft from US workers",
    "‘Pretty disrespectful’: rightwing radio host scolds Pence for not saying he’d pardon Trump",
    "Glenda Jackson, fearless actor and politician, dies aged 87"
]