[
    "The Guardian - Back to home",
    "Drought deal US states agree breakthrough pact to prevent river from drying up",
    "Wooly mammoths What's impeding America’s big shift to green energy?",
    "Global heating Crisis will push billions outside ‘human climate niche’",
    "Historic Colorado River deal is not enough to stave off long-term crisis, experts say",
    "Parents of US man killed by police during mental health crisis to get $19m",
    "Russia-Ukraine war: Kremlin says ‘Ukrainian militants’ still active in border region of Belgorod",
    "Nazi swastika flag found after truck crashes near White House",
    "US border agents kill man on tribal reservation",
    "Homeless families to be moved out of London hotel during Beyoncé tour",
    "Author files for new damages after Donald Trump’s CNN town hall remarks",
    "RRR, Thor and Star Wars actor dies aged 58",
    "Facebook owner sells Giphy at a loss of more than $260m",
    "Ohioans are trying to make abortion a right. So Republicans want to rewrite the rules",
    "Southern plain-talk or Foghorn Leghorn shtick?",
    "Why are there no affordable cars?",
    "Out of our minds: opium’s part in imperial history",
    "Belgorod residents told not to return to homes after drone strikes",
    "The Russian region being dragged into Putin’s war on Ukraine",
    "What we know so far on day 454 of Russian invasion",
    "Anti-Putin militia claims to have overrun border village",
    "Human-wildlife conflict How training dogs to chase bears might just save a grizzly or two",
    "‘I was a 17-year-old versus a 600lb grizzly bear. I was going to die’",
    "Fury as Maya train nears completion in Mexico",
    "The warnings were greatly exaggerated – until now",
    "Where Xbox is looking for its next big hit",
    "Indigenous journalist quits over ‘unrelenting’ abuse",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "We are closer than ever to arresting Putin, but the US must play its part",
    "Who says clothes aren’t a matter of life or death? In Succession they’re both",
    "True crime can be an unedifying business, so why am I drawn to writing about it?",
    "AI will take some jobs, but mass unemployment isn’t inevitable",
    "The Greek election: the new hegemony",
    "I stripped myself of clothes and shame. Then – on stage – I started to dance",
    "Nuggets sweep aside Lakers to reach first finals in team’s 56-year history",
    "James casts doubt over NBA future after loss",
    "Perhaps one day this whole soccer era will need an asterisk",
    "Carmelo’s flawed genius hit different because I saw his faults in myself",
    "Cleveland rookie kills bird with 100 mph line drive in ‘unfortunate sacrifice’",
    "Manchester City winning the Premier League again",
    "Police make arrests over ‘hate crimes’ targeting Vinícius Júnior",
    "NFL great set to become minority owner of Las Vegas Raiders",
    "Why rising sea levels pose existential threat to the island – extract",
    "Big polluters’ share prices fall after climate lawsuits, study finds",
    "Meet the activists trying to save the seabed",
    "After the flood, storms lie ahead in race to hit carbon zero",
    "From pollution to policing – can Sadiq Khan clean up London?",
    "Listen to previous episodes",
    "Black Out nights at the theatre are vital to centre and celebrate Black audiences",
    "Chaz Jankel, the man who made the Blockheads funky",
    "Scrupulous look at the exploitation of a natural wonder",
    "Visually striking account of Siberian wildfires leans towards abstraction",
    "How to live on water, Issey Miyake and the best of the biennales",
    "Foo Fighters roar back with new drummer",
    "Halle Bailey goes full mermaidcore in Disney’s CGI remake",
    "Jude Law wore bespoke blood, sweat and faeces perfume to play Henry VIII",
    "How Martin Amis made everyone up their game",
    "Eco-designer shows off biodegradable wedding dress at flower show",
    "50 years of Olivia, the lesbian cruise company",
    "Timnit Gebru on her sacking by Google, AI’s dangers and big tech’s biases",
    "I spent thousands on Ruby the guinea pig’s hysterectomy – and I don’t regret a penny",
    "It’s time to get ready for Barefoot-Boy Summer",
    "What to eat when you’re in the comfort zone",
    "Governor's $13.5m police program lures officers with violent records to Florida",
    "Biden and McCarthy hold talks but no deal yet as deadline looms",
    "Unhoused man hailed as an ‘angel’ after rescuing a family from an apartment fire",
    "Body of four-year-old boy found in river day after sister found dead",
    "Company suspends diversity chief over ‘Don’t Call Me Karen’ events",
    "Trump was warned about retaining classified documents, notes reveal",
    "Man charged over killing says ‘I’m not a white supremacist’",
    "Company sues Montana after app is banned in state",
    "Republican witness faces questions over whether he lied under oath to key panel",
    "Woman reunited with ring after 13 years",
    "The fight against Erdoğan Can Turkey’s opposition bridge enthusiasm gap before runoff vote?",
    "Erdoğan gains endorsement of third placed 'kingmaker' for runoff",
    "Outcry as World Health Organization locks out Taiwan under pressure from China",
    "Police begin searching reservoir for Madeleine McCann, who went missing aged three in 2007",
    "Rolf Harris, convicted sex offender and former musician, dies aged 93",
    "Narendra Modi receives rock-star reception in Sydney as Anthony Albanese hails ‘rich friendship’",
    "Oldest woman shares her secrets to enjoying life on her 109th birthday",
    "UK special forces have operated secretly in 19 countries since 2011",
    "H5N1 virus in Brazil wild birds prompts animal health emergency",
    "IMF says country no longer heading for recession but urges against tax cuts",
    "Sri Lanka’s tea pickers say they go hungry and live in squalor",
    "‘You don’t even know what misogyny is until you’ve been a woman running for president’",
    "A hostage negotiator reveals the secrets that can transform your life",
    "‘We can’t breathe! We can’t see! We can’t hear!’",
    "Papua New Guinea’s security deal with the US is a win for Washington – for now",
    "The best red carpet looks so far",
    "Almost 400 species discovered in Greater Mekong region",
    "A Welshman’s view of Arizona",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "DeSantis’s $13.5m police program lures officers with violent records to Florida",
    "Ireland to introduce world-first alcohol health labelling policy",
    "Republican John Kennedy: southern plain-talk or Foghorn Leghorn shtick?",
    "Ray Stevenson – RRR, Thor and Star Wars actor – dies aged 58",
    "How solar farms took over the California desert: ‘An oasis has become a dead sea’",
    "‘Few options that are cheap’: why are there no affordable cars in the US?",
    "Uber suspends diversity chief over ‘Don’t Call Me Karen’ events"
]