[
    "The Guardian - Back to home",
    "US Capitol attack 12m Americans believe violence is justified to restore Trump to power",
    "Could Trump go to jail? Federal charges over classified docs show momentum is building",
    "First Thing Donald Trump summoned to court next week",
    "Donald Trump indicted for illegal retention of classified documents",
    "Visualized How Alabama discriminated against Black voters",
    "US supreme court ruling could upend maps in boost for Democrats",
    "Video Footage from space shows Canada wildfires smoke reaching Pennsylvania",
    "Surviving the smoke Californians offer advice to New Yorkers",
    "Canada Country battles wildfires as smoke chokes cities",
    "New York therapists see surge in eco-anxiety as smoke fills skies: ‘Every client addresses it’",
    "Real cost of ‘Cop City’ under question after state approves $67m for project",
    "US extradition ‘dangerously close’ after losing latest legal appeal",
    "Man assaulted by cleric as a child launches health program to turn ‘pain into power’",
    "Binance.US prepares to suspend US dollar deposits and withdrawals from exchange",
    "Struggling Meta showcases new AI tools at company meeting",
    "Beijing plans new rules to regulate file sharing services like Airdrop and Bluetooth",
    "Qantas allows attendants of any gender to wear flat shoes, make-up and have long hair",
    "Japanese chain sues viral food vandal for damages",
    "Republicans turn on their own in attorney general impeachment scandal",
    "Is rent control making a comeback in America?",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Four controversial doctors helping Republicans attack trans healthcare",
    "Why you still can’t buy wine in New York supermarkets",
    "Claire Denis on rum, Africa and rethinking MeToo",
    "Ozempic has won, body positivity has lost. And I want no part of it",
    "Just as we’ve fallen in love with digi-Luke, is Mark Hamill really retiring from Star Wars?",
    "A beer with Mike Pence to figure out what his deal is? Possibly …",
    "The celebs go to space show we didn’t know we needed",
    "Here are the shows to help scratch that itch",
    "As the industry booms, what toll will it take on the environment?",
    "‘They hate us so much’ Villagers flee flooding after dam attack",
    "Russia-Ukraine live: Kyiv claims it has proof Russia blew up Kakhovka dam",
    "What we know on day 471 of the invasion",
    "Zelenskiy steps up criticism of International Red Cross over inaction at Kakhovka dam",
    "Kakhovka dam collapse unlikely to hurt Ukraine counteroffensive but will have long-term impact",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Why did the right-leaning supreme court hand Democrats a victory?",
    "As Russia’s armed forces fight among themselves, it’s hard to know who’s in control",
    "The global backlash against The Little Mermaid proves why we needed a Black Ariel",
    "Atlantic declaration shows Sunak and Biden’s willingness to simply make do",
    "Leader of the unappetising pack",
    "People call me brave for going through cancer treatment – but the scary bit starts now",
    "Panthers take Game 3 on Verhaeghe’s overtime winner",
    "Opinion The dismal story of modern football can be summed up in two words: Manchester City",
    "Kingdom has bought into football and golf. Will NBA and NFL be next?",
    "Djokovic and Alcaraz ready to serve up feast for the ages",
    "The US college golf star toppling Tiger Woods’ records",
    "Hochul says Triple Crown race will only happen if air quality improves",
    "Jokić is making the NBA finals his masterpiece",
    "Bellingham is 19 and ready to be Real Madrid’s everything",
    "Messi has the power to realize soccer’s potential in the US",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "New York’s essential workers bear the brunt of poor air quality",
    "Donald Trump Lawyer for valet in Mar-a-Lago documents case alleges misconduct",
    "Trump requests reduced damages or new trial",
    "10-year-old girl survives 24 hours in ‘rugged and remote’ Cascade mountains",
    "Republican hardliners revolt against their own speaker",
    "US lawyer who alerted school to priest’s sexual misconduct seeks damages",
    "House of Representatives to hold hearing on whistleblower’s claims",
    "Tucker Carlson lawyer hits back at claim of contract breach",
    "Dog toy cannot mimic Jack Daniel’s, US supreme court rules",
    "Religious broadcaster dies aged 93",
    "Republican states send national guard troops to Texas border in show of force",
    "Macron to visit Annecy knife attack victims as two children remain critical",
    "Rishi Sunak and Joe Biden sign ‘Atlantic declaration’ but hope of trade deal ends",
    "Five killed in shooting at car wash near Nazareth amid wave of violence",
    "Hedge fund founded by ‘does not recognise’ picture painted of firm",
    "China reportedly reaches secret deal with Havana to host spy base on island",
    "Hope for Syrian cancer patients as cross-border treatment resumes in Turkey",
    "Dutch murderer extradited to US over Natalee Holloway disappearance",
    "Swiss billionaire jailed over asbestos-related deaths in Piedmont",
    "Russian man dies after being mauled by shark off Red Sea resort",
    "Activists take environment minister to court in fight to save northern spotted owl",
    "A prince’s day in court: Harry against the Mirror",
    "Listen to previous episodes",
    "A grief-stricken masterpiece",
    "The best movies of 2023 so far",
    "Actor to make West End debut with husband Matthew Broderick",
    "How Love Island bored away millions of viewers",
    "The song of the summer has arrived",
    "Anselm Kiefer on the nightmares he can’t escape",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "Why dressing for dinner out is my favourite kind of look",
    "I built a house of cards 50 storeys high",
    "Readers’ favourite retreats in the UK and Europe",
    "When wedding proposals go hilariously wrong",
    "'Most things he said were anecdotal, whereas I was trying to present stats’",
    "Why America’s lesbian bars must be saved",
    "Why Rowan Atkinson is wrong about electric vehicles",
    "Former governor says he’s anti-Trump. But did he score a presidential pardon for a crony?",
    "The murder of Collette Gallacher – and her sisters’ fight for justice",
    "Readers on Canada wildfires smoke",
    "The lives lost in India’s train disaster",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Smoke engulfs American north-east",
    "Flip-flop boats, ‘trashion’ and the Bag Monster: the art of discarded plastic",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Russia-Ukraine war live: Kyiv claims it has proof Russia blew up Kakhovka dam",
    "Lawyer for Trump valet in Mar-a-Lago documents case alleges misconduct",
    "Donald Trump charged with illegal retention of classified documents",
    "Teenage girl who pretended to be boy for sex duped second girl, court told",
    "Air pollution in US from wildfire smoke is worst in recent recorded history",
    "‘They hate us so much’: villagers flee flooding after dam attack",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles"
]