[
    "Uniform Civil Code and the infinite variety of custom",
    "The long road to finding true peace in Yemen",
    "Spotlight | Are women paying the price as work shifts back to office space?",
    "Centre holds back-door talks with Kuki groups in New Delhi",
    "Rahul defamation case | How definite is ‘Modi’ as a ‘collection of persons’?",
    "Dutch PM resigns, paving way for new elections",
    "West Bengal panchayat elections | Voting underway amid violence, deaths",
    "Amarnath Yatra halted for second successive day due to rain",
    "No decision yet on alliance with JJP, says Haryana BJP chief",
    "2023-07-08T10:49:51+05:30\n-\nTechnology\nAI robots at UN reckon they could run the world better",
    "Ominous signs: On attacks by pro-Khalistan elements on Indian interests",
    "India must calibrate its public diplomacy on Khalistan issue to better effect",
    "Truce treaty: On brokering peace in the Congress in Rajasthan",
    "The Congress seems to have bought peace in Rajasthan by taking Pilot on board",
    "Mumbai\nWhy the Garo tribe of West Bengal’s Alipurduar feels betrayed by the ballot",
    "WorldSCO Summit | Missed opportunity for India?",
    "Technology\nRobots say they won’t steal jobs, rebel against humans",
    "India\nWatch | Fault lines in the Opposition unity",
    "IndustryMcDonald’s India franchisee puts tomato off the menu amid price rise",
    "Movies\n‘Sweet Kaaram Coffee’ review: A feel-good series on soul-searching and introspection",
    "Kochi\nManchester City fans in Kerala on a high as club announces ‘Treble Trophy Tour’ in September",
    "Sobriety after the euphoria of the U.S. state visit",
    "Due process clause or basic structure doctrine?",
    "On the draw — July 8, 2023",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Gujarat High Court dismisses Rahul Gandhi’s plea against his conviction in defamation case",
    "Indian Medical Association seeks a relook at proposed exit exam for MBBS students",
    "Capturing the universe’s hum: Researchers find evidence of ultra-low frequency gravitational waves",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "All you wanted to know about Instagram Threads (so far)",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]