[
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "A relentless drive for greatness has catapulted conqueror Dhoni into a common man’s hero",
    "Manoj Misra | The Defender of Yamuna",
    "Data | The effects of more than two decades of Erdogan’s rule",
    "Why is PM Modi mum on parade hailing Indira Gandhi’s assassination, asks Congress",
    "OTT tobacco warnings: industry mulls resistance to surprise move",
    "Man accused of dismembering live-in partner sent to police custody",
    "CBI to probe if violence in Manipur was pre-planned",
    "Filed false complaint against WFI chief due to anger over match: minor wrestler’s father",
    "Monsoon sets in over Kerala after 7-day delay",
    "Not clear if Sengol was presented to Mountbatten, says Thiruvavaduthurai Adheenam head",
    "2023-06-09T04:30:00+05:30\n-\nBusiness\nExplained | Daily limit on UPI transactions",
    "2023-06-09T04:15:00+05:30\n-\nOther States\nDiamond worker, wife and children commit suicide in Surat",
    "Another low: On the latest provocation by Canadian Sikh separatist groups in Canada",
    "Canada is doing very little to address India’s concerns on Sikh extremism",
    "Economic emphasis: On India-Nepal ties",
    "The focus was on trade and development ties during the Nepali PM’s visit",
    "Podcast\nDo production-linked incentives for manufacturing work? | The Hindu Parley Podcast",
    "Environment\nWorld Oceans Day | What ails our oceans, and how to protect them",
    "India\n‘Soul of Steel’ Himalayan endurance challenge enters final phase",
    "Telangana\nGalwan Valley hero’s statue unveiled in Kodad in Telangana",
    "ScienceSci-Five | The Hindu Science quiz: On climatic zones",
    "Internet\nWhatsApp introduces Channels: what is it",
    "VideosWatch | Odisha train tragedy | ‘Not a mosque’ - ISKCON temple staff debunk fake news",
    "Technology\nHow an AI bot plays Minecraft by itself using GPT-4",
    "Getting railway safety back on track after Odisha",
    "The importance of small talk",
    "Do production-linked incentives for manufacturing work?",
    "Green Humour by Rohan Chakravarty",
    "Bridging the growing trust deficit in Manipur",
    "Ashok Gehlot tries out his welfare card",
    "Explained | Daily limit on UPI transactions",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Air India flight carrying stranded passengers, crew members from Russia lands at San Francisco",
    "Deadly billboards: On billboards and their regulation",
    "Lionel Messi joins Inter Miami, rejects Barcelona return",
    "NIIT completes demerger of company",
    "IPO screener: IKIO Lighting issue closes today",
    "1947 ‘sengol’ story just fiction based on manufactured lies: N. Ram",
    "When can Messi play his first match for Inter Miami?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]