[
    "World\nTitan submersible | Deep sea tragedy",
    "Tennis\nIs it the beginning of a new era in women’s tennis?",
    "BooksPride Month 2023 | Queering the narrative",
    "Open Page\nAccidents in war and life",
    "Assam floods | As situation remains grim, Amit Shah assures Centre’s help to Himanta",
    "12 cadres of banned Manipur extremist group released after mob stops Army",
    "The cadres belonged to Kanglei Yaol Kanba Lup (KYKL), a proscribed Meitei outfit.",
    "One dead, over 35 injured after ammonia gas leaked in dairy factory in Bihar’s Hajipur",
    "PM Modi meets Egypt's Grand Mufti, discusses countering extremism, radicalisation",
    "2023-06-25T12:02:03+05:30\n-\nCricket\nIndia’s 1983 World Cup victory...40 years on",
    "Cricket\nIndia’s 1983 World Cup victory...40 years on",
    "ScienceDo dead stars crash with the light of 500 million suns?",
    "India\nGita Press | God’s own publisher",
    "Art\nThe artist x artisan conundrum",
    "Society\nPride Month | Of allies like Ujjal Dosanjh",
    "WorldMicron Technology | Rebalancing portfolio",
    "Environment\nJumbo translocation | Addressing the elephant in the room",
    "World\nExplained | Does the China-Pakistan nuclear deal flout global rules?",
    "IndiaExplained | Why is the U.S.-India fighter jet deal important?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Gita Press | God’s own publisher",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Hamish G.L. Harding | The Titan submersible was the last expedition of a life-long explorer",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "Google will open global fintech centre in Gujarat: CEO Sundar Pichai after meeting PM Modi",
    "Putin vows to crush ‘armed mutiny’ as rebel Wagner chief tries to oust top military brass",
    "Russian mercenaries halt advance on Moscow, easing power challenge to Putin",
    "Index Outlook: Nifty 50, Sensex: Ripe for a correction?",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]