[
    "Kohli and Root — two contemporary greats and their different approaches",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "The Science Quiz | On the abyssal zone",
    "COVID-19 genomics body INSACOG has not put out weekly bulletin since March 27",
    "Florida Governor DeSantis to enter 2024 race in Twitter event with Musk",
    "Punjab, Delhi Congress units wary of backing AAP",
    "PM Modi raises concerns over attacks on temples in Australia with Anthony Albanese",
    "Update NPR to enumerate self during next Census",
    "Trinamool, CPI, AAP to skip inauguration of new Parliament building",
    "IPL 2023 | I have 8-9 months to decide: Dhoni on retirement after CSK reaches 10th final",
    "2023-05-24T10:49:17+05:30\n-\nMarkets\nStock markets fall in early trade on weak global trends",
    "2023-05-24T10:20:01+05:30\n-\nMarkets\nRupee rises 8 paise to 82.77 against U.S. dollar",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "The Congress in Karnataka must now focus on governance",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "EconomyExchange of ₹2,000 notes | Small queues, confusion on Day 1",
    "Athletics\nThe individual 400m win at London meant the world to me: Sanya Richards-Ross",
    "India\nThe View From India | The importance of Modi’s Indo-Pacific Tour",
    "Movies\n‘Sirf Ek Bandaa Kaafi Hai’ movie review: Manoj Bajpayee steps up in court",
    "GadgetsMotorola launches Edge 40 with 144Hz refresh rate",
    "Movies\nRajinikanth emotionally recalls actor Sarath Babu’s ‘quit smoking’ advice to him",
    "Gadgets\nNokia launches budget smartphone C32 in India",
    "MoviesRay Stevenson, of 'RRR' and 'Thor' movies, dies at 58",
    "Technology\nHow to get the best out of a free audio transcription service",
    "Justice that also makes space for the animal world",
    "Redrawing the poll strategy in Bihar",
    "The paradox of BRICS, its new pathway",
    "It’s time to ensure safer skies",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedFilmi-ness: Kunal Basu on writing and cinema MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "PM Modi meets prominent Australian business leaders in Sydney; invites investments in India",
    "Wrestlers accept Brij Bhushan’s demand for a narco test under Supreme Court supervision",
    "U.S. signs new security pact with Papua New Guinea amid competition with China",
    "No need to make a dash for ₹2,000 swaps, says RBI Governor Shaktikanta Das",
    "Adani stocks rally up to 19% after clean chit from SC panel",
    "Unity SFB: An uncommon communion with an unusual task",
    "EPFO: How to find your UAN?",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]