[
    "Kerala Spotlight | Higher education in low spirits",
    "Spreading Hindi for more than a century in a State opposed to its imposition",
    "Telangana Spotlight | The Green Metro Line blues",
    "Andhra Pradesh Spotlight | Defenders of the creek",
    "All set for Opposition meet as Patna to be the first battleground before 2024",
    "Extend deadline for higher pension, simplify application process, employers tell EPFO",
    "Obama says India may ‘pull apart’ over minority rights",
    "At joint session of U.S. Congress, PM Modi calls for action against sponsors of terrorism",
    "2023-06-23T10:28:54+05:30\n-\nMarkets\nSensex, Nifty decline in early trade",
    "2023-06-23T09:38:11+05:30\n-\nKerala\nTop Kerala news developments today",
    "Unedifying row: On panchayat polls in West Bengal and security",
    "Shadow of poll violence justifies court orders for using central forces in West Bengal",
    "Spiralling violence: On the West Bank",
    "Without a freeze on Israeli settlements, violence in West Bank will continue",
    "India\nDelhi Spotlight | Small hill towns, big plain aspirations",
    "BengaluruDid mission decongestion in Bengaluru work?",
    "Podcast\nWill a shorter medical course solve rural doctor shortages? | The Hindu Parley Podcast",
    "DataData | UPI payments: relief for users, a headache for banks",
    "India\nDevrani sisters conferred National Florence Nightingale award",
    "Sci-TechSci-Five | The Hindu Science Quiz: On biologists",
    "Chennai\nTamil Nadu’s women cops turn sailors, complete 1000-kilometre expedition off Chennai coast",
    "An organised counter to organised hate",
    "The challenges of reporting on an ethnic conflict",
    "Can a shorter medical course solve rural doctor shortages?",
    "Green Humour by Rohan Chakravarty",
    "A doorway to an entrepreneurial university",
    "Rethink the retention of sedition",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "FeaturedPride Month | Of allies like Ujjal Dosanjh SocietySandip RoyREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Barack Obama says India may ‘pull apart’ over minority rights",
    "Govt. likely to pay assured pensions for its employees, say officials",
    "Pilot and passengers of missing Titan submersible are believed to be dead, says OceanGate",
    "US-India ties will be most defining of 21st century: Joe Biden",
    "PM Modi’s gift to US First Lady: ‘Made in India’ 7.5 carat Green Diamond",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]