[
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Technology\nExplained | What is the India, U.S. initiative on future tech?",
    "IndiaKukis | Fight for land and identity",
    "Health\nExplained | How can India tackle its diabetes burden?",
    "Wrestlers’ protest | Babita Phogat has tried to weaken our protest, says Sakshi Malik",
    "Badminton | India's Rankireddy and Shetty triumph in Indonesia Open, create history",
    "The Indians, who were also Asian champions, defeated the current world champions in 43 minutes.",
    "Emergency dark era in country's history: PM Modi",
    "Society\nIndia | How queer are our public spaces?",
    "EnvironmentHumans’ groundwater extraction has affected the earth’s rotation: study",
    "Photos\nIn Frames | Sacred Spaces",
    "Tamil Nadu\nTeacher takes students to school in autorickshaw to prevent dropouts near Vellore",
    "ScienceGoogle Doodle celebrates Indian biochemist Kamala Sohonie’s 112th birthday",
    "Tamil Nadu\nV. Senthilbalaji | From villain to anti-hero",
    "TechnologyExplained | What is the India, U.S. initiative on future tech?",
    "Science\nChandrayaan-3 | ISRO’s Space Physics Laboratory gears up for big moment",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Explained | How can India tackle its diabetes burden?",
    "Explained | What is the India, U.S. initiative on future tech?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why the traffic is no longer an issue in Bengaluru",
    "CBI books senior BSNL officials for graft; searches 25 locations",
    "Pakistan receives $1 billion from China",
    "Guyana’s oil discovery, a game changer",
    "LIC announces relaxations for victims of cyclone Biparjoy",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "ODI World Cup Qualifiers 2023: Format, rules, squads, schedule",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]