[
    "Recep Tayyip Erdogan | Turkey’s republican monarch",
    "Political Line | Saffron designs for 2024",
    "Menstrual health is a public health issue",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "ISRO’s GSLV-F12 successfully places navigation satellite NVS-01 into intended orbit",
    "Wrestlers will be allowed to protest at any suitable place other than Jantar Mantar: Delhi Police",
    "Rajasthan political crisis | Decision will be taken in party’s interest: Kharge",
    "A day after spurt in clashes, situation calm in Manipur",
    "CBI registers case against Rolls Royce in alleged corruption case",
    "PM Modi flags off Assam's first Vande Bharat Express",
    "2023-05-29T13:54:27+05:30\n-\nWorld\nHeavy clashes in Sudan's capital as truce set to expire",
    "Alarming turn: On the situation in Manipur",
    "A return to normalcy in Manipur requires concerted action by government and civil society",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Women in civil service have a challenging and exciting task before them",
    "World\nNepal honours Sherpa guides, climbers to mark 70th anniversary of Mount Everest conquest",
    "MusicDaily Quiz | On life and works of American singer Tina Turner",
    "Other States\nDecorated American officer’s last remains to head home from Darjeeling after 58 years",
    "Technology\n Can China’s Micron ban benefit Samsung and SK Hynix?",
    "Tamil Nadu\nBitten by snake, tribal girl carried on foot to Anaicut hospital, dies on the way",
    "TechnologyA lawyer uses ChatGPT for research, cites non-existent cases",
    "India\nAn opulent House: art lines ₹200-crore interiors",
    "Visakhapatnam\nVizag mountaineer scales new heights, conquers 6,001-m peak",
    "ScienceA Foucault pendulum swings inside the new Parliament",
    "Cricket\nIndian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement",
    "A belligerence towards Beijing that is unsettling",
    "On the Draw — May 29, 2023",
    "At Hiroshima, Japan’s moment to reinforce partnerships",
    "A fountainhead of the people’s hopes and aspirations",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A new House, again in red sandstone",
    "IPL final moved to reserved day due to persistent rains",
    "Recep Tayyip Erdogan wins historic Turkey runoff vote",
    "Annadurai questioned the motive behind head of mutt giving Sengol to Nehru",
    "New parliament building: Here’s a timeline, costs incurred and more",
    "Go First offers retention allowance to pilots",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]