[
    "‘For my dad Sylvester daCunha, the brand was always bigger than the individual’: Rahul daCunha",
    "Data | Uneven progress: Stark inter-district disparities in Tamil Nadu",
    "Prachanda used his India visit to his political benefit, parry domestic criticism",
    "Explained | What is Karnataka vs. Centre row over free rice scheme?",
    "India removed from UNSG report on impact of armed conflict on children",
    "Never spoke about rotational CM post in Chhattisgarh: Singh Deo",
    "Totally unacceptable, shatters all democratic norms: Cong on stopping Rahul’s convoy in Manipur",
    "France unrest | Riots spread, police officer charged with shooting teenager dead",
    "Lokayukta police arrest K. R. Puram Tahsildar Ajith Kumar Rai",
    "Keep it simple: On opting for higher pension",
    "EPFO must simplify process for members to avail higher pension.",
    "Played in India: On India as cricket’s World Cup host",
    "The World Cup is an opportunity for ODIs to regain prominence",
    "Movies\nAK vs ARK: Anil Kapoor, Aditya Roy Kapur on the conclusion to ‘The Night Manager’",
    "Sci-Tech\nSci-Five | The Hindu Science Quiz: On Bones",
    "Movies\nKajol on ‘Lust Stories 2’ and ‘running around trees no more’",
    "Movies\n‘Lust Stories 2’ movie review: A lacklustre anthology, with one stunner",
    "Society\nNo retirement for the helicopter parent",
    "HealthHealth Matters | How much money is too much money for vaccines?",
    "Other States\nOdisha’s Debrigarh Sanctuary freed from human settlement",
    "Manifestly arbitrary, clearly unconstitutional",
    "Rankings, and the realities of higher education",
    "V.K. Pandian, Odisha’s influential bureaucrat",
    "Green Humour by Rohan Chakravarty",
    "Mahalanobis in the era of Big Data and AI",
    "A row over rice in Karnataka",
    "Explained | IMF’s view on cryptocurrency in Latin America",
    "India takes first step to remove animals from drug-testing process",
    "Explained | Global tropical primary forest cover continued decline in 2022: study",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "BJP has ‘forgotten’ poor and middle class: Rahul Gandhi",
    "Spring cleaning: On medical education in India",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "SEBI to bring fresh consultation on total expense ratio for MFs",
    "Stock market holiday pushed to June 29 from June 28",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "What is really behind the violence in Manipur?",
    "ODI World Cup Qualifiers, Super Sixes: Qualification rules, teams, format, points table",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]