[
    "Why the Indian museum makeover is important",
    "Li Shangfu | The General’s warning",
    "News in Frames | Maximum damage",
    "WFI chief Brij Bhushan Singh says will contest 2024 polls",
    "PM’s anti-Delhi Ordinance infringes upon tenets of democracy: Kejriwal",
    "Ex-Scottish First Minister Nicola Sturgeon released without charge after funding probe arrest",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren’s presence",
    "French Open final | Novak Djokovic wins his 23rd Grand Slam title by beating Casper Ruud",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "Sachin Pilot vows to fight for youth, farmers, says he won’t back off from his demands",
    "2023-06-12T03:19:00+05:30\n-\nWorld\nIndigenous upbringing helped children survive Amazon ordeal",
    "2023-06-12T02:23:00+05:30\n-\nIndustry\nBillionaire George Soros hands control of empire to son Alex",
    "Telltale signs: On Maharashtra and a pattern of sustained polarisation",
    "Low-intensity communal violence in Maharashtra could take a dangerous turn",
    "Miles to go: On the state of the Indian economy",
    "The economy is better poised but still needs deft steering and mindful reforms",
    "Tamil Nadu\nNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "ScienceMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "World\nUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "FootballManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "WorldPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Manipur, a rude reminder of northeast tensions",
    "The Telangana BJP is in a bind",
    "Governors cannot indefinitely hold back Bills",
    "The importance of small talk",
    "Amplify the subject of adolescent girl nutrition",
    "A pragmatic approach, for better India-Nepal ties",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Indian Army’s Air Defence widens wings",
    "Stop, look, proceed: Railway order for trains coming after signal repair",
    "Lokayukta files suo motu case over water crisis in Whitefield",
    "Pakistan's PM orders authorities to take emergency measures for Cyclone Biparjoy",
    "Moody's sees India's GDP expanding 6-6.3% in Q1, flags fiscal slippage risks",
    "Movers & Shakers: Stocks that will see action this week",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Militancy returns to Jammu after 15 years of relative peace",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]