[
    "Unlocking secrets of the honeybee dance language",
    "Iron fortification: health risks of excessive iron intake",
    "What we lose when we work with a ‘giant AI’ like ChatGPT",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Jantar Mantar protest site cleared minutes after wrestlers’ detention",
    "New Parliament building is dotted with installations, murals and artworks",
    "Malaysia Masters badminton | Prannoy claims maiden BWF World Tour title",
    "Erdogan wins historic Turkey runoff vote",
    "Victory in the historic vote extends Mr. Erdogan’s 20-year rule until 2028",
    "IPL final moved to reserved day due to persistent rains",
    "40 extremists killed in encounters: Manipur Chief Minister",
    "Centre fiercely neutral in Manipur, says Assam CM",
    "2023-05-29T01:17:00+05:30\n-\nOther States\nOpposition meeting may take place in Patna on June 12",
    "2023-05-29T00:56:32+05:30\n-\nWorld\nErdogan's priorities for last term as Turkey President",
    "Alarming turn: On the situation in Manipur",
    "A return to normalcy in Manipur requires concerted action by government and civil society",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Women in civil service have a challenging and exciting task before them",
    "Cricket\nIndian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement",
    "PhotosIn Frames | Off the hook",
    "Tamil Nadu\nAnnadurai questioned the motive behind head of mutt giving ‘Sengol’ to Nehru",
    "Open Page\nA display of human ingenuity",
    "Health\nGummies and fizzies for wellness? | We need to talk about nutraceuticals",
    "DataData | Exports and imports shrink across many nations for most items in 2023",
    "Society\nEverest: 70 years later",
    "IndiaSengol | A symbol of virtue",
    "India\nExplained | How can citizens file Census details online?",
    "A belligerence towards Beijing that is unsettling",
    "Menstrual health is a public health issue",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "On the Draw — May 29, 2023",
    "At Hiroshima, Japan’s moment to reinforce partnerships",
    "A fountainhead of the people’s hopes and aspirations",
    "What is the Foucault pendulum in the new Parliament building?",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Annadurai questioned the motive behind head of mutt giving Sengol to Nehru",
    "Only six religion options make it to next Census form",
    "A new House, again in red sandstone",
    "New parliament building: Here’s a timeline, costs incurred and more",
    "Know your minister: A look at the 24 MLAs sworn in to the Karnataka cabinet today",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]