[
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "A relentless drive for greatness has catapulted conqueror Dhoni into a common man’s hero",
    "Manoj Misra | The Defender of Yamuna",
    "Data | The effects of more than two decades of Erdogan’s rule",
    "RBI retains FY24 GDP growth forecast at 6.5%, keeps repo rate unchanged",
    "DRDO successfully flight-tests New Generation Ballistic Missile ‘Agni Prime’ off Odisha",
    "IMD declares arrival of monsoon in Kerala",
    "Four children injured in knife attack in French town of Annecy",
    "Mumbai man kills live-in-partner, chops body into pieces; detained by police",
    "BJP mulls new alliances, Lok Sabha polls in mind",
    "2023-06-08T18:24:06+05:30\n-\nIndia\nBJP mulls new alliances, Lok Sabha polls in mind",
    "2023-06-08T18:19:46+05:30\n-\nIndia\nOTT tobacco warnings: industry mulls resistance to surprise move",
    "End the debate: On the Law Commission’s recommendation on sedition",
    "The retention of sedition goes against the grain of current thinking",
    "Deadly billboards: On billboards and their regulation",
    "Despite frequent accidents, there is no political will to regulate billboards",
    "TelanganaGalwan Valley hero’s statue unveiled in Kodad in Telangana",
    "Science\nSci-Five | The Hindu Science quiz: On climatic zones",
    "Internet\nWhatsApp introduces Channels: what is it",
    "Gadgets\nRealme 11 Pro+ 5G and Realme 11 Pro 5G launched in India",
    "Videos\nWatch | Odisha train tragedy | ‘Not a mosque’ - ISKCON temple staff debunk fake news",
    "Technology\nHow an AI bot plays Minecraft by itself using GPT-4",
    "MoviesInterviewing Spider-Man: Tom Holland on his great powers, and greater responsibilities",
    "Music\nThe Gipsy Kings come to Bengaluru",
    "Sedition — illogical equation of government with state",
    "Ashok Gehlot tries out his welfare card",
    "Tackling the human-dog conflict",
    "Green Humour by Rohan Chakravarty",
    "Nigeria’s new President faces old problems",
    "Seeing India’s energy transition through its States",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Explained | What is the Kosovo-Serbia conflict all about? Why have tensions flared again?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Make MVA fall and trap Eknath Shinde’: Amruta Fadnavis in Whatsapp chat",
    "Protest over social media message turns violent in Kolhapur city; curfew imposed",
    "Monetary Policy Committee continues status quo on repo rate at 6.5%",
    "Cabinet approves ₹89,000-cr revival package for BSNL",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]