[
    "Political Line | Cashing in on cows",
    "Manipur, a rude reminder of northeast tensions",
    "Amplify the subject of adolescent girl nutrition",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren’s presence",
    "WTC Final 2023: Experienced batters couldn’t get big runs and that cost us, says Rohit",
    "Senior Telangana BJP leaders’ ‘secret’ meeting reflects ‘dissent’ again",
    "Cyclone Biparjoy live updates | High tides hit Gujarat coast; PM Modi holds review meeting",
    "Democratisation of technology important tool to help bridge data divide: PM Modi",
    "Former Italian PM Silvio Berlusconi passes away",
    "2023-06-12T14:34:32+05:30\n-\nIndia\nHealth Ministry yet to respond to massive CoWIN data breach",
    "Telltale signs: On Maharashtra and a pattern of sustained polarisation",
    "Low-intensity communal violence in Maharashtra could take a dangerous turn",
    "Miles to go: On the state of the Indian economy",
    "The economy is better poised but still needs deft steering and mindful reforms",
    "Andhra Pradesh\nWith new changes by TTD, a record number of devotees have darshan at Tirumala",
    "Tamil NaduNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "Science\nMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "TechnologyExplained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "World\nUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "FootballManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "Governors cannot indefinitely hold back Bills",
    "The Telangana BJP is in a bind",
    "The importance of small talk",
    "A pragmatic approach, for better India-Nepal ties",
    "Explained | The Hiroshima process that takes AI governance global",
    "Explained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren Singh’s presence",
    "Cyclone Biparjoy set to hit Kutch; Gujarat begins preparations",
    "IndiGo flight enters Pakistan airspace amid bad weather; returns safely",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "As rupee reserves grow, Russia may have to invest more in India",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC 2023-2025: India full schedule, tours, matches list",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]