[
    "Andhra Pradesh spotlight | Whose Polavaram is it anyway?",
    "A fight for the right to protest in Bengaluru",
    "Kerala Spotlight | Big biz on Net comes with riders",
    "Will appeal court’s decision to strike down Rwanda policy, says Rishi Sunak",
    "T.S. Singh Deo’s elevation a message to Bhupesh Baghel to take everyone along",
    "PM Modi ‘uneasy’ as Opposition plans next meet in Bengaluru on July 13, 14, says Sharad Pawar",
    "T.N. Governor backtracks on dismissal of Senthilbalaji from Cabinet",
    "After lull of 16-days, two killed in Manipur as rioters fire at army",
    "Uttarakhand does not allow hatred because our culture is not like that, says CM Dhami",
    "Appointing authority is also dismissing authority, said SC in M. Karunanidhi vs Union of India",
    "2023-06-30T09:26:25+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-06-30T08:09:43+05:30\n-\nOther States\nFire breaks out at SAIL's Bokaro Steel plant",
    "Spiralling food prices: on the build-up of underlying inflation pressures",
    "Policymakers must guard against inflation to ensure sustainable growth",
    "Greek recovery: on the road ahead for Kyriakos Mitsotaki",
    "Mitsotakis made the best of bad times to emerge stronger in Greece",
    "Health\nExplained | Leptospirosis, a disease that surges in the monsoon months",
    "MoviesAK vs ARK: Anil Kapoor, Aditya Roy Kapur on the conclusion to ‘The Night Manager’",
    "Sci-Tech\nSci-Five | The Hindu Science Quiz: On Bones",
    "Movies\nKajol on ‘Lust Stories 2’ and ‘running around trees no more’",
    "Movies\n‘Lust Stories 2’ movie review: A lacklustre anthology, with one stunner",
    "SocietyNo retirement for the helicopter parent",
    "Health\nHealth Matters | How much money is too much money for vaccines?",
    "Between two books, a revelatory social history",
    "Has the Bhadralok culture in Bengal faded?",
    "Green Humour by Rohan Chakravarty",
    "Beleaguered community — being a Muslim in new India",
    "Rankings, and the realities of higher education",
    "Explained | IMF’s view on cryptocurrency in Latin America",
    "Explained | What is Karnataka vs. Centre row over free rice scheme?",
    "India takes first step to remove animals from drug-testing process",
    "Explained | Global tropical primary forest cover continued decline in 2022: study",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "BJP has ‘forgotten’ poor and middle class: Rahul Gandhi",
    "Played in India: On India as cricket’s World Cup host",
    "India removed from UNSG report on impact of armed conflict on children",
    "Tamil Nadu Governor R.N. Ravi backtracks on dismissal of Senthilbalaji from Cabinet",
    "Go First to delay salary payment for June",
    "Credit card spending above ₹7 lakh in foreign currency domestically to attract TCS",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "What is really behind the violence in Manipur?",
    "India ranked 100 in FIFA Rankings: Indian Football returns to top 100 after five years",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]