[
    "India\nGandhi Peace Prize 2021 to be conferred on Gita Press",
    "India\nWrestlers protest | Sakshi Malik, Babita Phogat engage in a war of words",
    "Other SportsBadminton | India's Rankireddy and Shetty triumph in Indonesia Open, create history",
    "Manipur CM asks Mizoram counterpart to protect Meiteis; BJP MLAs in New Delhi to meet PM",
    "Mizoram bears burden of drug trade after unrest in Manipur",
    "Contraband worth ₹78.19 crore has been seized in Mizoram since May 3",
    "Indian drugs at the centre of a medical storm in Sri Lanka",
    "WB Governor sets up control room for panchayat poll grievances",
    "2023-06-18T22:33:11+05:30\n-\nDelhi\nBJP perpetuated strife among Kukis and Meitis: AAP",
    "2023-06-18T22:18:29+05:30\n-\nDelhi\nTwo sisters shot dead in high-security RK Puram; three arrested",
    "2023-06-18T21:49:00+05:30\n-\nIndia\nGovernment to consult practitioners on MCA-21 glitches",
    "2023-06-18T21:42:03+05:30\n-\nEconomy\nNet Direct Tax receipts up 11.2%",
    "2023-06-18T21:21:33+05:30\n-\nFood\nEat this giant 12-kg samosa in Meerut, win ₹71,000",
    "Tamil Nadu\n‘Tamil Nadu’ | On the wrong side of history and law: a fraud exposed",
    "KarnatakaNoted cinematographer Navroze Contractor killed in a bike accident",
    "Movies\n‘Adipurush’ dialogue writer says they will revise dialogues that hurt sentiments",
    "India\nUniform Civil Code | What is the Law Commission’s new move ?",
    "Society\nIndia | How queer are our public spaces?",
    "EnvironmentHumans’ groundwater extraction has affected the earth’s rotation: study",
    "Tamil Nadu\nTeacher takes students to school in autorickshaw to prevent dropouts near Vellore",
    "Tamil NaduV. Senthilbalaji | From villain to anti-hero",
    "Technology\nExplained | What is the India, U.S. initiative on future tech?",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Explained | How can India tackle its diabetes burden?",
    "Explained | What is the India, U.S. initiative on future tech?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why the traffic is no longer an issue in Bengaluru",
    "Adipurush kicks off political storm; Chhattisgarh ready to ban film on public demand",
    "CBI books senior BSNL officials for graft; searches 25 locations",
    "Guyana’s oil discovery, a game changer",
    "LIC announces relaxations for victims of cyclone Biparjoy",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "ODI World Cup Qualifiers 2023: Format, rules, squads, schedule",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]