[
    "Explained | Abaucin, the potential new antibiotic found with machine-learning",
    "How the old found sanctuary and the new blossomed in CSK",
    "75 years of peacekeeping: India’s contribution to U.N.’s peace missions",
    "‘A passenger boarding Air India must be pleasantly surprised’: CEO Wilson",
    "Top AI CEOs, experts raise 'risk of extinction' from AI",
    "OTT shows must carry anti-tobacco warnings: Health Ministry",
    "35 lakh Class 10 students fail or drop out, unable to make it to Class 11: Education Ministry",
    "NIA raids 16 locations linked to banned Popular Front of India in Karnataka",
    "BJP 'threatening' people and 'misusing' government agencies: Rahul Gandhi in U.S.",
    "Vivekananda Reddy murder case | Telangana HC grants anticipatory bail to Avinash Reddy",
    "Punjab cabinet expanded; two more MLAs inducted, Minister Nijjer quits",
    "2023-05-31T12:55:39+05:30\n-\nIndia\nMP John Brittas flags Aadhaar-based ‘financial fraud’",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "CSK’s win over Titans showcased the best and the latest of IPL",
    "IndiaDaily Quiz | On Chief Ministers",
    "Karnataka\nFree bus travel for women in Karnataka after June 1: Transport Minister",
    "Delhi\nIn a first since 2014, Delhi experiences heatwave-free May",
    "Cricket\nSai Sudharsan — all class and confidence",
    "IndiaPurana Qila excavations reveal pre-Mauryan era settlement",
    "Science\nIndian scientists discover new exoplanet with mass 13 times that of Jupiter",
    "KeralaWatch | What was the Vaikom Satyagraha all about?",
    "Other States\nRow over gifting of make-up kits with condoms at mass wedding in Madhya Pradesh",
    "The short history of a large note",
    "Using Buddhism as a tool of soft power",
    "Rethinking alliances in Andhra",
    "The BJP outreach to Saivites",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "From Master of the Roster to Master of all Judges?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Wrestlers defer plan to immerse medals",
    "IPL 2023 Final | Chennai Super Kings beats Gujarat Titans by five wickets to win fifth title",
    "Faster, stronger: on India and its supercomputer use",
    "Adani Transmission Q4 net profit jumps 85% to ₹439.60 crore",
    "Heavy rain seen for Kerala, Karnataka but monsoon not in sight yet",
    "CBI books BAE Systems, Rolls Royce for corruption in Hawk aircraft deal",
    "Advani called it ‘the Congressisation of the BJP’",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]