[
    "‘For my dad Sylvester daCunha, the brand was always bigger than the individual’",
    "Data | Uneven progress: Stark inter-district disparities in Tamil Nadu",
    "Prachanda used his India visit to his political benefit, parry domestic criticism",
    "Explained | What is Karnataka vs. Centre row over free rice scheme?",
    "Will appeal court’s decision to strike down Rwanda policy, says Rishi Sunak",
    "T.S. Singh Deo’s elevation a message to Bhupesh Baghel to take everyone along",
    "PM Modi ‘uneasy’ as Opposition plans next meet in Bengaluru on July 13, 14, says Sharad Pawar",
    "T.N. Governor backtracks on dismissal of Senthilbalaji from Cabinet",
    "After lull of 16-days, two killed in Manipur as rioters fire at army",
    "State government will implement UCC as soon as it gets panel report, says Uttarakhand CM Dhami",
    "U.S. Supreme Court strikes down university race-conscious admissions policies",
    "2023-06-30T03:21:00+05:30\n-\nWorld\nAppeal court rules U.K. govt's Rwanda asylum plan unlawful",
    "2023-06-30T02:40:00+05:30\n-\nWorld\nIsraeli PM says key judicial reform clause 'out'",
    "Spiralling food prices: on the build-up of underlying inflation pressures",
    "Policymakers must guard against inflation to ensure sustainable growth",
    "Greek recovery: on the road ahead for Kyriakos Mitsotaki",
    "Mitsotakis made the best of bad times to emerge stronger in Greece",
    "Movies\nAK vs ARK: Anil Kapoor, Aditya Roy Kapur on the conclusion to ‘The Night Manager’",
    "Sci-Tech\nSci-Five | The Hindu Science Quiz: On Bones",
    "Movies\nKajol on ‘Lust Stories 2’ and ‘running around trees no more’",
    "Movies\n‘Lust Stories 2’ movie review: A lacklustre anthology, with one stunner",
    "Society\nNo retirement for the helicopter parent",
    "HealthHealth Matters | How much money is too much money for vaccines?",
    "Other States\nOdisha’s Debrigarh Sanctuary freed from human settlement",
    "Between two books, a revelatory social history",
    "Has the Bhadralok culture in Bengal faded?",
    "Green Humour by Rohan Chakravarty",
    "Beleaguered community — being a Muslim in new India",
    "Rankings, and the realities of higher education",
    "Explained | IMF’s view on cryptocurrency in Latin America",
    "India takes first step to remove animals from drug-testing process",
    "Explained | Global tropical primary forest cover continued decline in 2022: study",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "BJP has ‘forgotten’ poor and middle class: Rahul Gandhi",
    "Played in India: On India as cricket’s World Cup host",
    "Folk singer, Warehousing Corporation chairman Saichand passes away",
    "Nationwide surge in food prices shows retail inflation far from tamed",
    "Stopped from travelling by road, Rahul Gandhi flies to violence-hit Manipur district",
    "Credit card spending above ₹7 lakh in foreign currency domestically to attract TCS",
    "Data Patterns order book exceeds ₹1,000 cr as company secures significant contracts",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "‘It is a global war’: Meitei leader Pramot Singh on Manipur violence",
    "India ranked 100 in FIFA Rankings: Indian Football returns to top 100 after five years",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]