[
    "Other Sports\nMalaysia Masters badminton | Prannoy claims maiden BWF World Tour title",
    "World\nTurkey polls close with Recep Tayyip Erdogan favourite to extend 20-year rule",
    "ScienceUnlocking secrets of the honeybee dance language",
    "Science\nIron fortification: health risks of excessive iron intake",
    "Two killed, 12 injured in firing, clashes in Manipur: police",
    "New Parliament building is dotted with installations, murals and artworks",
    "Jantar Mantar protest site cleared minutes after wrestlers’ detention",
    "Assam has had the best two years of harmony and progress: Himanta Biswa Sarma",
    "Cricket\nIndian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement",
    "PhotosIn Frames | Off the hook",
    "Tamil Nadu\nAnnadurai questioned the motive behind head of mutt giving ‘Sengol’ to Nehru",
    "Open Page\nA display of human ingenuity",
    "Health\nGummies and fizzies for wellness? | We need to talk about nutraceuticals",
    "DataData | Exports and imports shrink across many nations for most items in 2023",
    "Society\nEverest: 70 years later",
    "IndiaSengol | A symbol of virtue",
    "India\nExplained | How can citizens file Census details online?",
    "What is the Foucault pendulum in the new Parliament building?",
    "Explained | Will AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Only six religion options make it to next Census form",
    "Annadurai questioned the motive behind head of mutt giving Sengol to Nehru",
    "A new House, again in red sandstone",
    "Unlocking secrets of the honeybee dance language",
    "New parliament building: Here’s a timeline, costs incurred and more",
    "BL Explainer: All about the raging Sengol controversy",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]