[
    "Indian students, doing is the new learning",
    "Migrating on the Coromandel Express",
    "How Tamil Nadu is isolating, eliminating chronic ailments using door-to-door screening",
    "How queer are our public spaces?",
    "Nehru Memorial Museum and Library renamed sans Nehru, triggers political war of words",
    "Raghuram Rajan’s paper lacks understanding of economics: Rajeev Chandrasekhar",
    "Cyclone Biparjoy Live Updates | No power in hundreds of villages, roads, houses damaged",
    "Fresh clashes between Rapid Action Force and riotous mob in Imphal",
    "Senthilbalaji sent to eight-day ED custody",
    "Focus on illegal immigration from Punjab after Canada’s recent deportation threat",
    "Post-Godhra riots cases | Gujarat court acquits 35, slams ‘pseudo-secular media and politicians’",
    "2023-06-16T20:17:41+05:30\n-\nIndia\n2023 vs 2018: Opposition unity 2.0",
    "Code red: On the 22nd Law Commission and a uniform civil code",
    "The push for a uniform civil code should not become a divisive tool",
    "Culture shift: On the U.S.’s UNESCO re-entry",
    "UNESCO must get strict with nations exiting and re-entering on frivolous grounds",
    "Life & Style\nWatch | Turning agro-waste into cutlery and crockery",
    "Books\nA dictionary on Kambaramayanam with 22,000 words and phrases launched",
    "Movies‘I Love You’ movie review: Rakul Preet Singh is trapped in an inane thriller",
    "Gadgets\nLenovo launches new Legion Slim series for gamers and creators",
    "Movies\n‘Jee Karda’ series review: Tamannaah Bhatia anchors a glib affair",
    "Movies\n‘Extraction 2’ movie review: Chris Hemsworth ups the ante in blazing, action-fuelled sequel",
    "Reflections on Artificial Intelligence, as friend or foe",
    "Indian students must be taught that doing is the new learning",
    "A media war with no winners",
    "Strengthening the Integrated Child Development Services scheme",
    "Is the Indian Railways stretched beyond its capacity?",
    "Jumpstarting the next phase of U.S.-India defence ties",
    "Explained | Are non-communicable diseases increasing in India?",
    "EXPLAINED | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Free bus for women sees 41.34 lakh passengers on Monday",
    "After Manipur, Kuki groups caught in Myanmar civil war",
    "Base boost: On inflation and the consumer",
    "Guyana’s oil discovery, a game changer",
    "Trains need not be slowed down",
    "What is really behind the violence in Manipur?",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "Asia Cup 2023 dates: Matches start on August 31; Four in Pakistan, nine in Sri Lanka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]