[
    "When Roman merchants and soldiers came to Madurai to trade in pepper",
    "Data | One in seven Indian primary schools run by a lone teacher",
    "Twin reservoirs of Hyderabad shrivel in realty storm",
    "Systematic incitement plan in Maharashtra",
    "New Parliament building will make every Indian proud, says PM Modi",
    "Sengol row | Congress kept a sacred symbol as ‘walking stick’, says Amit Shah",
    "No Income Tax searches at my home, says Tamil Nadu Minister Senthilbalaji",
    "Only six religion options make it to next Census form",
    "Karnataka Cabinet expansion today; 9 to become Ministers for first time",
    "IPL 2023, Qualifier 2 | Sensational Shubman takes Gujarat Titans to second successive IPL final",
    "‘Souvenirs recorded Thiruvavaduthurai Adheenam’s handover of sceptre to Mountbatten’",
    "2023-05-27T02:02:00+05:30\n-\nOther States\nThousands of dead fish float on Dal Lake",
    "2023-05-27T01:24:09+05:30\n-\nIndia\nWas Advani invited for the inauguration: Sena (UBT)",
    "Mob and justice: On the Alwar lynching case verdict",
    "Alwar verdict flags need for stern steps to ensure justice in lynching cases",
    "A younger lot: On the 2023 French Open",
    "Without Nadal, there is no clear favourite at Roland-Garros",
    "Videos\nPM Modi in Australia | Do diaspora issues overshadow bilateral ties?",
    "KeralaTo sir, with love: from Kerala to Bhutan",
    "Movies\n‘Beau Is Afraid’ movie review: Ari Aster’s third film feels like a three-hour panic attack",
    "Sedition and its roots in rudeness as an offence",
    "A fountainhead of the people’s hopes and aspirations",
    "Understanding history is inevitable",
    "Green Humour by Rohan Chakravarty",
    "Should States revert to the Old Pension Scheme?",
    "Economics that looks at lower half of the pyramid",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "PM Modi to launch special ₹75 coin to mark inauguration of new Parliament",
    "For retirees, leave encashment now tax-free till ₹25 lakh",
    "Two more cheetah cubs die at Kuno Park, one unwell",
    "Akasa Air decides to withdraw services from Visakhapatnam",
    "Stocks to watch out today — May 25, 2023",
    "Ircon International Q4 results: Key takeaways for investors",
    "Future of HEC hangs in the balance as salaries remain unpaid for over a year",
    "Impact of election results to go beyond electoral politics in Karnataka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]