[
    "Kohli and Root — two contemporary greats and their different approaches",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "Mob vandalises Manipur Minister’s house",
    "GDP growth may cross 7% in 2022-23: RBI Governor",
    "G-20 delegates tour Srinagar city in an attempt to see ‘changed Kashmir situation’",
    "How a letter to PMO set off a search for the Sengol",
    "2023-05-25T06:52:00+05:30\n-\nHyderabad\nU.S. firm StemCures to set up manufacturing lab in Telangana",
    "2023-05-25T06:12:00+05:30\n-\nHockey\nIndia maul Chinese Taipei 18-0 in Junior Asia Cup hockey",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "The Narendra Modi visit to Australia adds to the bipartisan strength of growing bonds",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Republicans should not put partisan goals ahead of the greater public good",
    "Tamil Nadu\n‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "Music'Queen of rock 'n' roll' Tina Turner dies at 83",
    "Music\nTina Turner: five favourite songs",
    "India\nSatyajit Ray's family welcomes Delhi High Court order on copyright",
    "Technology\nIndia set to triple speed of its fastest supercomputers",
    "BusinessWill services once again come to the rescue of exports?",
    "Movies\nNetflix releases censored cut of Bheed, bucking usual practice",
    "MoviesWatch | In conversation with Hiphop Tamizha Adhi",
    "Movies\n‘Anupamaa’, ‘Khosla Ka Ghosla’ actor Nitesh Pandey dies of suspected cardiac arrest",
    "After Karnataka, more lessons for the BJP",
    "Industrial investments: The Kerala story",
    "A word of caution about India and the AI wagon",
    "Redrawing the poll strategy in Bihar",
    "The fundamental value of the rupee",
    "A ‘middle kingdom’ dawns on India’s west",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "U.P. court acquits Samajwadi Party leader Azam Khan in 2019 hate speech case",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "Women bag top four positions in Civil Service examinations",
    "Canara Bank’s CGM appointed Deputy MD at IDBI Bank",
    "ONGC and Oil India Q4 preview: Why the gas sector can add steam to results",
    "Kerala Christians are cosying up to the BJP, but at what cost?",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]