[
    "A Kannadiga communist who was at the vanguard of peasant movement in Tamil land",
    "Spotlight | Are women paying the price as work shifts back to office space?",
    "Moon, Mars and beyond: the UAE makes an ambitious foray into space",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Armed rebellion by Wagner chief Prigozhin underscores erosion of Russian legal system",
    "Canada always takes 'serious action' against terrorism: PM Trudeau on pro-Khalistan elements",
    "Karnataka budget live updates | Liquor to get dearer in State as govt proposes duty hike",
    "All eyes are on Karnataka Chief Minister Siddaramaiah as he presents the State budget on July 7",
    "Gujarat High Court dismisses Rahul Gandhi’s plea against his conviction in defamation case",
    "2023-07-07T14:08:17+05:30\n-\nOther Sports\nCanada Open Super 500 | Sindhu, Sen enter quarterfinals",
    "Momentum softens: On S&P Global’s survey",
    "Food inflation threatens to undermine efforts to ensure price stability",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Governments must focus on effective implementation of existing food security schemes",
    "Movies\n‘Sweet Kaaram Coffee’ review: A feel-good series on soul-searching and introspection",
    "IndiaSpotlight | Project Puri",
    "Art\nPeerless line artist Namboothiri passes away at 98",
    "Movies\n‘Insidious: The Red Door’ movie review: Some doors are better left shut",
    "Tamil NaduThreads that bind the once-migrant Saurashtrian populace with its homeland Gujarat",
    "Environment\nFor the third time this week, Earth sets a heat record",
    "Other Sports\nContinental Kings — the dark horses that shone the brightest in Global Chess League",
    "KarnatakaBJP MP Tejasvi Surya's phone number allegedly used to extort money, diamonds",
    "India\nExplained | Understanding dark patterns",
    "India needs a Uniform Civil Code",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Green Humour by Rohan Chakravarty",
    "Internationalising the rupee without the ‘coin tossing’",
    "An inclusive social policy for migrants",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "FeaturedExplained | Understanding dark patternsG.S. Bajpai,Ankit SrivastavaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Relief, again: On the Teesta Setalvad case",
    "‘Salaar: Part 1’ teaser: Prabhas is all fire in Prashanth Neel’s intense gangster drama",
    "Coimbatore Range DIG C. Vijayakumar ends life; CM Stalin expresses condolences",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "Stocks that will see action today (July 6)",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]