[
    "Data | Tamil Nadu ranks highest in suicides among government employees",
    "Uniform Civil Code and the infinite variety of custom",
    "The long road to finding true peace in Yemen",
    "‘I am neither tired nor retired’: NCP chief Sharad Pawar",
    "Lift Internet ban with safeguards: Manipur High Court",
    "Rahul defamation case | Gujarat HC mum on societal interest in averting expensive election",
    "Vande Bharat passengers to benefit as Railways to slash AC chair car, executive class fares",
    "West Bengal panchayat polls | 12 killed amid large-scale violence",
    "500 days of Ukraine war | Zelensky hails country’s soldiers from a Black Sea island",
    "2023-07-08T20:10:13+05:30\n-\nIndia\nBlighted harvest lays low king of fruits — mangoes",
    "2023-07-08T20:09:58+05:30\n-\nWorld\nDutch PM Rutte meets king to discuss caretaker government",
    "2023-07-08T20:08:47+05:30\n-\nWorld\nHundreds defy Paris protest ban a week after riots",
    "Ominous signs: On attacks by pro-Khalistan elements on Indian interests",
    "India must calibrate its public diplomacy on Khalistan issue to better effect",
    "Truce treaty: On brokering peace in the Congress in Rajasthan",
    "The Congress seems to have bought peace in Rajasthan by taking Pilot on board",
    "India\nMakerspaces enables kids in low resource settings break away from rote learning",
    "KeralaSarpa app helps bring down snakebite deaths in Kerala",
    "Movies\n‘72 Hoorain’ movie review: Nothing controversial about it",
    "Other StatesWhy the Garo tribe of West Bengal’s Alipurduar feels betrayed by the ballot",
    "Movies\n‘Adipurush’ writer Manoj Shukla issues public apology",
    "WorldSCO Summit | Missed opportunity for India?",
    "Sobriety after the euphoria of the U.S. state visit",
    "Due process clause or basic structure doctrine?",
    "On the Draw — July 8, 2023",
    "Should Internet shutdowns be used to maintain public order?",
    "Are science journalists scientists?",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Momentum softens: On S&P Global’s survey",
    "Karnataka Budget proposes new 37 km of Namma Metro line from Hebbal to Sarjapur in Bengaluru",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "Vedanta takes full ownership of semiconductor JV with Foxconn",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]