[
    "Explained | How KFON aims to bridge the digital divide in Kerala",
    "In Jerusalem, gay pride is conservative too",
    "Explained | The decade-long search for a rare Higgs boson decay",
    "It’s time to leave the ‘paleo diet’ in the past",
    "Former Vice President Mike Pence files paperwork launching 2024 Presidential bid",
    "Odisha train accident: NDRF ends operation, withdraws all nine teams",
    "3 killed, 4 injured in fresh violence in Manipur's Imphal West district",
    "Nirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Microsoft 365 down for thousands of users",
    "After Odisha tragedy, Railways to secure signalling equipment with double locks",
    "2023-06-05T22:36:20+05:30\n-\nTennis\nRuud roars, Jabeur races into French Open quarter-finals",
    "2023-06-05T21:44:00+05:30\n-\nWorld\nMicrosoft 365 down for thousands of users",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "Courts should be wary of incremental steps to alter status of places of worship",
    "A vote for change: On the result of the Thai parliamentary election",
    "The Generals should cede power without triggering chaos",
    "Videos\nWatch | Why did this Maharashtra temple town witness communal tension?",
    "MoviesTrailer of Anil Kapoor-Aditya Roy Kapur’s ‘The Night Manager Part 2’ out",
    "Technology\nU.S. SEC sues Binance, founder Zhao alleging securities law violations",
    "Karnataka\nThis Bengaluru-based start-up generates water from thin air",
    "Tamil Nadu\nAs more opt for their own private space, senior living real estate segment opens up",
    "TechnologyLinda Yaccarino to take over as Twitter CEO officially this week",
    "Movies\nVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "TechnologyHere Comes the AI: Fans rejoice in 'new' Beatles music",
    "Know Your English\nWhen are you planning to hit the road?",
    "Citizen activism that is missing from the wrestling ring",
    "How the reification of caste will not lead to a true politics of change and justice",
    "A model lab for secular governance?",
    "International trade has a carbon problem",
    "Spare the rod and change the law",
    "The Delhi ordinance is an unabashed power-grab",
    "Explained | What is the electronic interlocking system in railways?",
    "Explained | Why does North Korea want spy satellites?",
    "How genome sequences tracked down an ancient disease",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Days after the horrific accident in Balasore, another goods train derails in Odisha",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Odisha train accident death toll lowered to 275",
    "Power bills to be dearer by ₹2.89 per unit for Bescom consumers in June",
    "Under-construction bridge collapses in Bihar’s Bhagalpur; probe ordered",
    "Solar industry ‘rushing headlong’ into supply glut, cautions IEA report",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Odisha train tragedy raises questions about rail safety and signals system",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]