[
    "Other States\nHimachal explores possibility of growing cannabis",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "Other StatesNurse shortage ails U.P. health system",
    "India\nED searches 12 locations in money-laundering case against PMO ‘imposter’",
    "Quad leaders express deep concern over consequences of Ukraine war",
    "India will do its best to end the war, Modi tells Zelenksy",
    "BSF intercepts three Pakistani drones, seizes 2.60 kg drugs",
    "Top Sikh body extends support to protesting wrestlers",
    "2023-05-21T02:32:00+05:30\n-\nTechnology\nLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "2023-05-21T02:18:00+05:30\n-\nWorld\nNorth-South Transport Corridor | Connecting continents",
    "2023-05-21T02:06:00+05:30\n-\nIndia\nTop Sikh body extends support to protesting wrestlers",
    "2023-05-21T02:02:00+05:30\n-\nKarnataka Elections\nSiddaramaiah | An AHINDA leader’s new innings",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "WorldNorth-South Transport Corridor | Connecting continents",
    "Technology\nLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Movies\nAuschwitz drama 'Zone of Interest' marks director Glazer's first Cannes foray",
    "Tamil NaduTN boy braves disability, scores 437 in class X exam",
    "Kerala\nThe people and the government: the contemporary relevance of The Svadesabhimani",
    "EconomyRBI to pull out ₹2,000 notes from active circulation",
    "Movies\n‘Devara’ is the title of Jr NTR’s film with Koratala Siva; first-look poster out",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "New Parliament opening | Not inviting President is an insult, says Opposition",
    "Science for All | What is the Petermann Glacier?",
    "PM Modi holds meeting with Japanese counterpart Kishida",
    "First Solar’s investment in India: To ship solar modules from October",
    "Freebies promised by Congress in Karnataka may be hard to sustain",
    "Impact of election results to go beyond electoral politics in Karnataka",
    "A spymaster speaks: Review of ‘A Life in the Shadows’ by A.S. Dulat",
    "IPL 2023 Points Table updated after KKR vs LSG: Lucknow qualifies for Playoffs with one-run win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]