[
    "Explained | Understanding the Wagner mutiny",
    "Explained | The India-U.S. deal for 31 MQ-9B drones",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Science This Week | India joins Artemis Accords, the U.S. approves sale of lab-grown meat and more",
    "PM Modi must sack Manipur Chief Minister Biren Singh, says Mallikarjun Kharge",
    "Out of this world: ICC World Cup trophy sent to space",
    "Bengal panchayat polls | No democracy in State, says Sitaram Yechury",
    "Centre will ensure execution of SoO pact with Kuki groups, says Amit Shah",
    "EPFO extends deadline to apply for higher pension till July 11",
    "Assam will have fewer Muslim-majority constituencies, say Opposition",
    "Rajasthan Assembly elections | Pressure building up on Gehlot to field younger politicians",
    "2023-06-27T04:16:00+05:30\n-\nWorld\nMan killed by mob for alleged blasphemy in Nigeria",
    "2023-06-27T03:38:00+05:30\n-\nIndia\nTripura Government claims success in anti-drug campaign",
    "2023-06-27T02:22:00+05:30\n-\n World\nHezbollah says downed Israel drone in south Lebanon",
    "A grand revival: on India-Egypt ties",
    "India and Egypt have re-established close ties in recent years",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Valdimir Putin should bring the war to an end for stability at home",
    "TechnologyMeta to train 10 lakh traders with CAIT leveraging WhatsApp Business",
    "Motorsport\nRyan Reynolds, Rob McElhenney join group buying into Alpine F1",
    "Bengaluru\nA kg of tomato to likely cost over ₹100 soon",
    "India Open Market Sales Scheme | Now, Centre Vs State on foodgrains",
    "Cricket\nHasaranga becomes first ODI spinner to take three consecutive 5-wicket hauls",
    "Cricket\nIndia’s 1983 World Cup victory...40 years on",
    "KarnatakaIn Frames | Struggle for water",
    "Technology\nTwitter rival Bluesky publishes content moderation proposal",
    "The main chapter of how Hindutva sees the past",
    "A man of the times and ahead of it",
    "Reduced ceiling, increased anger",
    "Manipur — this is not a time for finger-pointing",
    "Laying the foundation for a future-ready digital India",
    "Joining the hunt: India and the Artemis Accords",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A new regime: On the Emergency Use Authorisation regime in India and clinical trials",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "Obama’s remarks about minority rights in India are surprising, says Nirmala Sitharaman",
    "Pakistan Army deploying new Chinese cannon on LoC, say officials",
    "PM Modi holds stocktaking meet on Manipur with senior Ministers",
    "Shree Cement share price tanks 10% on ₹23,000-crore tax evasion report",
    "Investment and vehicle registrations dip in electric two-wheeler segment",
    "Memory and desire: How movie-watching changed over time",
    "Monumental train disaster at Balasore puts issues plaguing Railways in focus",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]