[
    "Explained | Global tropical primary forest cover continued decline in 2022: study",
    "Lessons from cricket about the mind’s experience of time",
    "Explained | The problem with India’s new guidelines on genetically modified insects",
    "There was lightning in your kitchen today. Did you see?",
    "BJP has ‘forgotten’ poor and middle class: Rahul Gandhi",
    "Days after the Wagner mutiny, the spectres of ‘Black Saturday’ continue to haunt Russians",
    "Anna Bhagya scheme | Karnataka decides to pay ₹34 per kg rice",
    "Cash transfer is seen as a temporary measure till enough rice stock is raised through a tender",
    "Chandrayaan-3 launch scheduled for July 13",
    "Bhim Army chief Chandra Shekhar Azad shot at in Uttar Pradesh",
    "Cabinet approves PM-PRANAM to incentivise States to promote alternative fertilizers",
    "2023-06-28T18:52:06+05:30\n-\nIndia\nBhim Army chief Chandra Shekhar Azad shot at in Uttar Pradesh",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Bengaluru\nFrom Plates to Pals: The Koramangala Lunch Group’s 7-year weekly ritual",
    "IndiaDaily Quiz | On P.V. Narasimha Rao",
    "News\nIndian-origin man in U.S. sentenced to jail for smuggling Indians using Uber app",
    "Science\nThe Science Quiz | The Fibonacci series",
    "Music\nHow abuse and rejection led trans-woman Manjamma to seek refuge in Jogathi Nritya",
    "ScienceNASA sees moon lunar mining trial within the next decade",
    "Karnataka\nTranswomen turn entrepreneurs following training by NGO",
    "Environment\nSri Lanka scraps proposal to export monkeys to China",
    "EntertainmentActor Julian Sands died while hiking on California mountain, authorities confirm",
    "Gadgets\nInsta360 Go 3 launches compact action camera",
    "Tracing the arc of American ‘exception-ism’ for India",
    "A model for quality and inclusive education",
    "A row over rice in Karnataka",
    "Reduced ceiling, increased anger",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "There are houses for rent in Bengaluru, but too many conditions apply",
    "Explained | Understanding the Wagner mutiny",
    "2019 MBBS batch will be the first batch to shift to NExT pattern",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "India has to do lot of homework to compete with China in mobile manufacturing: Yuqing Xing",
    "What is really behind the violence in Manipur?",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "ICC ODI World Cup 2023 schedule: Full list of matches, dates, venues, timings",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]