[
    "TB testing stuck in the previous century, and waiting for change",
    "Inside Jharkhand’s single-teacher schools",
    "Substance abuse in Kerala | On a high, at a social cost",
    "Telangana Spotlight | Not the end of the road",
    "Pakistan anti-terrorism court grants pre-arrest bail to Imran Khan",
    "Prime accused in Khadikul bomb explosion Bhanu Bag succumbs to injuries",
    "NCM team visits Arunachal Pradesh to study Buddhist shrine-Gurdwara row",
    "Mamata Banerjee to skip Siddaramaiah swearing-in, to send representative",
    "PM Modi leaves for Japan in first leg of three-nation visit",
    "2023-05-19T13:39:23+05:30\n-\nWorld\nNew Caledonia lifts tsunami warning after 7.7-magnitude quake",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "The Congress must demonstrate the success of its inclusive vision in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "India must invest in infrastructure that boosts defence against disasters",
    "TechnologyQuirky things Apple does that make little sense",
    "Bengaluru\nControversies surrounding bike taxis refuse to die in Bengaluru",
    "Technology\nWill writers and publishers accept the ChatGPT poet?",
    "Movies\nNow, a ‘Kerala story’ of a Muslim woman and her Hindu children",
    "PodcastCan an integrated system of medicine work? | The Hindu Parley Podcast",
    "Other States\nIn strife-torn Manipur, Kuki-Meitei villagers stick together near Myanmar border",
    "Delhi\nBGMI unbanned: Popular PUBG successor allowed to resume operations, developer says",
    "WorldAndy Warhol violated a photographer's copyright on image of Prince, Supreme Court rules",
    "A long-drawn test for India’s diplomatic skills",
    "Explained | What are RBI regulations on green deposits?",
    "‘Three capitals’ in Andhra Pradesh",
    "Can an integrated system of medicine work?",
    "Money is about more than just survival",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "Office searched at 3 a.m.; sensitive files photocopied: Vigilance official",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "Pichai sells Chennai home where Sundar grew up",
    "Telangana Cabinet to withdraw the GO 111",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]