[
    "India\nIndian Army’s Air Defence widens wings",
    "World\n‘Unabomber’ ‘Ted’ Kaczynski found dead in U.S. prison",
    "Other StatesOdisha train tragedy survivor reunites with father at AIIMS, Bhubaneswar",
    "History & Culture\nThe great Indian museum makeover",
    "Will participate in Asian Games only if issues are resolved: Sakshi Malik",
    "India looks at devising its own standards to assess socio-economic progress",
    "Assam CM sent as peacemaker to Manipur",
    "Gujarat ATS busts terror module linked to Islamic State",
    "2023-06-11T04:00:00+05:30\n-\nIndia\nGovernment sources dismiss Congress graft charge in Railways",
    "2023-06-11T03:09:00+05:30\n-\nWorld\nBlinken reschedules postponed Beijing visit for June 18",
    "Football\nManchester City win first Champions League title",
    "WorldLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil NaduBuckingham Canal | A waterway once is sewage-carrier now",
    "Science\nIIT-Madras generates hydrogen from seawater using solar energy",
    "Andhra Pradesh\nA.P. forest officials release 4.32 lakh Olive Ridley turtles into sea",
    "ChildrenWhen the Mercury space capsule was patented...",
    "Technology\nCryptocurrency donations | Is more transparency worth the risks?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Elderly woman among three killed in attack on Kuki village",
    "Three killed as illegal mine collapses in Dhanbad",
    "BSF shoots down another narcotics-laden Pakistan drone in Amritsar",
    "'Very severe' cyclone Biparjoy to intensify in next 24 hours: IMD",
    "Well-marked low-pressure area over Bay perks up monsoon flows",
    "TVS Credit raises ₹480 crore capital from Premji Invest",
    "Donald Trump in firm control of Republican Party, remains frontrunner for 2024",
    "M. Karunanidhi: A civilisational imagination to secure plurality",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]