[
    "A Kannadiga communist who was at the vanguard of peasant movement in Tamil land",
    "Spotlight | Are women paying the price as work shifts back to office space?",
    "Legal tangles to hamstring Atma Gaurva Bhavans in Telangana",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "State Election Commissioner responsible for corpses on the streets: West Bengal Governor",
    "Defamation case | Gujarat High Court to deliver verdict on Rahul’s plea today",
    "A stay on conviction would pave the way for Mr. Gandhi’s reinstatement as MP",
    "Rain inundates coastal Karnataka, brings parts of Kerala to a halt",
    "Freedom of expression being misused in Canada by anti-India elements: MEA",
    "As envoy says G-20 summit is key event for Russia, Putin visit now a possibility",
    "2023-07-07T09:18:30+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-07-07T09:09:50+05:30\n-\nKerala\nTop Kerala news developments today",
    "2023-07-07T08:02:21+05:30\n-\nTelangana\n‘Dharani Files’ will be released soon: Revanth Reddy",
    "Momentum softens: On S&P Global’s survey",
    "Food inflation threatens to undermine efforts to ensure price stability",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Governments must focus on effective implementation of existing food security schemes",
    "Andhra Pradesh\nCapital conundrum in A.P.",
    "TechnologyTwitter threatens to sue Meta over Threads: Report",
    "India\nExplained | Understanding dark patterns",
    "World\nOperator of Titanic sub that imploded suspends all expeditions",
    "Andhra PradeshSowing the seed of success on barren land",
    "Podcast\nWhy are Indian highways so unsafe? | In Focus podcast",
    "Cartoon\nIt rained in the city",
    "MoviesLeonardo DiCaprio, Robert De Niro’s ‘Killers of the Flower Moon’ trailer out",
    "Movies\nWatch | Amala Akkineni: Cinema is no longer about one person producing a masterpiece",
    "India needs a Uniform Civil Code",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Green Humour by Rohan Chakravarty",
    "Internationalising the rupee without the ‘coin tossing’",
    "An inclusive social policy for migrants",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Relief, again: On the Teesta Setalvad case",
    "‘Salaar: Part 1’ teaser: Prabhas is all fire in Prashanth Neel’s intense gangster drama",
    "Picture shot by Telangana girl makes it to Vogue Italia magazine",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "Capturing the universe’s hum: Researchers find evidence of ultra-low frequency gravitational waves",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]