[
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Political Line | Saffron designs for 2024",
    "Menstrual health is a public health issue",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "Congress leaders in Delhi and Punjab ask party high command to not support the AAP",
    "16-year-old stabbed to death by boyfriend in Delhi, accused arrested",
    "Hawk aircraft deal | CBI registers case against Rolls Royce in alleged corruption case",
    "IPL 2023 Final | Chennai Super Kings beat Gujarat Titans by five wickets to win fifth title",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Muslims lag behind Scheduled Castes and Scheduled Tribes in higher education",
    "Union Home Minister Amit Shah visits Manipur to plan for peace measures",
    "2023-05-30T04:17:00+05:30\n-\nIndia\nRajnath attends swearing-in of Nigerian President-elect",
    "Symbols and substance: on the inauguration of the new Parliament building and beyond",
    "Religious rituals at the opening of Parliament building defied propriety",
    "Faster, stronger: on India and its supercomputer use",
    "India must use its supercomputers beyond weather forecasts",
    "Science\nISRO’s GSLV-F12 successfully places navigation satellite NVS-01 into intended orbit",
    "Other StatesClimate of fear still lingers in Manipur",
    "Podcast\nWhat lies behind India’s missing wombs problem? | In Focus podcast",
    "World\nNepal honours Sherpa guides, climbers to mark 70th anniversary of Mount Everest conquest",
    "Music\nDaily Quiz | On life and works of American singer Tina Turner",
    "Other StatesDecorated American officer’s last remains to head home from Darjeeling after 58 years",
    "Technology\nCan China’s Micron ban benefit Samsung and SK Hynix?",
    "World\nRecep Tayyip Erdogan | Turkey’s republican monarch",
    "Tamil NaduBitten by snake, tribal girl carried on foot to Anaicut hospital, dies on the way",
    "Technology\nA lawyer uses ChatGPT for research, cites non-existent cases",
    "The indelible imprint of the Fifth Estate, in Karnataka",
    "The BJP outreach to Saivites",
    "From Master of the Roster to Master of all Judges?",
    "The Erdogan victory, a triumph for Ottoman glory",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Alarming turn: On the situation in Manipur",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Sengol bent on the very first day: Stalin",
    "IPL final moved to reserved day due to persistent rains",
    "CBI books BAE Systems, Rolls Royce for corruption in Hawk aircraft deal",
    "Sensex, Nifty open higher on US debt ceiling deal",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]