[
    "‘For my dad Sylvester daCunha, the brand was always bigger than the individual’: Rahul daCunha",
    "Explained | What is Karnataka vs. Centre row over free rice scheme?",
    "Data | Uneven progress: Stark inter-district disparities in Tamil Nadu",
    "‘Savarkar did not consider Hindutva as the equivalent of Hinduism’",
    "'Godfather of AI' urges governments to stop machine takeover",
    "Heavy rains pound Thane, Palghar in Maharashtra; 2 swept away in flood waters",
    "Nationwide surge in food prices shows retail inflation far from tamed",
    "India removed from UNSG report on impact of armed conflict on children",
    "Never spoke about rotational CM post in Chhattisgarh: Singh Deo",
    "2023-06-29T16:32:04+05:30\n-\nIndia\nIn pictures | Id celebrations across India",
    "2023-06-29T15:47:47+05:30\n-\nOther States\nOdisha’s Debrigarh Sanctuary freed from human settlement",
    "Keep it simple: On opting for higher pension",
    "EPFO must simplify process for members to avail higher pension.",
    "Played in India: On India as cricket’s World Cup host",
    "The World Cup is an opportunity for ODIs to regain prominence",
    "Society\nNo retirement for the helicopter parent",
    "HealthHealth Matters | How much money is too much money for vaccines?",
    "Other States\nOdisha’s Debrigarh Sanctuary freed from human settlement",
    "India\nINS Kirpan sets sail from Visakhapatnam to Vietnam",
    "Business\nWill this be the Chinese economy’s ‘lost decade’?",
    "BengaluruThis Hubballi startup is no second-stringer",
    "Cricket\nLessons from cricket about the mind’s experience of time",
    "India\nNDRF can now deploy vehicle equipped with WiFi, VHF",
    "BengaluruFrom Plates to Pals: The Koramangala Lunch Group’s 7-year weekly ritual",
    "India\nDaily Quiz | On P.V. Narasimha Rao",
    "Manifestly arbitrary, clearly unconstitutional",
    "Rankings, and the realities of higher education",
    "V.K. Pandian, Odisha’s influential bureaucrat",
    "Green Humour by Rohan Chakravarty",
    "Mahalanobis in the era of Big Data and AI",
    "A row over rice in Karnataka",
    "India takes first step to remove animals from drug-testing process",
    "Explained | Global tropical primary forest cover continued decline in 2022: study",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "BJP has ‘forgotten’ poor and middle class: Rahul Gandhi",
    "Spring cleaning: On medical education in India",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "SEBI to bring fresh consultation on total expense ratio for MFs",
    "India’s current account deficit narrows to 0.2% of GDP on moderation in trade deficit",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "What is really behind the violence in Manipur?",
    "ODI World Cup Qualifiers, Super Sixes: Qualification rules, teams, format, points table",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]