[
    "In Israel, diverse Jewish-Indian communities come together to build a Heritage Centre",
    "Maha Vikas Aghadi will win Mumbai civic polls, says Mumbai Congress chief Varsha Gaikwad",
    "Where anyone can be accused of sedition",
    "Nine killed in attack by armed village guards in Manipur",
    "Railway Board was aware of short-cut methods by signalling staff",
    "Supreme Court should have monitored wrestlers’ protest better, says Justice Lokur",
    "Law Commission seeks fresh suggestions on Uniform Civil Code",
    "Senthilbalaji remanded to judicial custody till June 28",
    "Gujarat on alert with Cyclone Biparjoy set to make landfall",
    "At least 79 dead after overcrowded migrant vessel sinks off Greece",
    "2023-06-15T03:30:00+05:30\n-\nWorld\nEU lawmakers approve plan on bloc's future AI rules",
    "2023-06-15T03:05:00+05:30\n-\nWorld\nXi hails establishment of 'China-Palestine strategic' ties",
    "Base boost: On inflation and the consumer",
    "Inflation should not be allowed to erode the purchasing power of the poor",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "Bipartisanship has been in short supply in the Trump era, especially after the indictments",
    "Business\nWhat does RBI pausing on rates mean for the Indian economy?",
    "CricketIndia’s Test losses: a result of stereotypes and the quest for balance",
    "Chennai\nNEET topper Prabanjan felicitated in Chennai, plans to join AIIMS Delhi",
    "Chennai\nStudents who worked on ‘AzaadiSAT’ communications satellite meet Tamil Nadu Governor",
    "Puducherry\nAn alternative armamentarium for the healthcare setting",
    "Movies\nNew on Amazon Prime Video this week: Tamannaah Bhatia’s ‘Jee Karda’, ‘Kandahar’, and more",
    "Technology\nWill be making more products for creators, Asus executive says",
    "The next Finance Commission will have a tough task",
    "Strengthening the Integrated Child Development Services scheme",
    "Selling hate through music",
    "On the Draw — June 15, 2023",
    "Male-centric medicine is affecting women’s health",
    "The JD(S) plan for resurrection",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Love all: On Djokovic’s latest feat",
    "Visakhapatnam: Senior Auditor, data entry operator and two others remanded in bribery case",
    "CBI arrests EPFO official for allegedly receiving Rs 12 lakh bribe",
    "Tata Motors to develop software to control its electric powertrains",
    "Two Sivakasi-based companies to acquire Narmada Gelatines for ₹148 crore",
    "Controversial arrest of TN Minister Senthil Balaji sparks outrage and political backlash",
    "Delhi ordinance: Trampling on the will of the people",
    "TNPL 2023: Schedule, venues, squads, rules & live streaming info - all you need to know",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]