[
    "Kohli and Root — two contemporary greats and their different approaches",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "G-20 delegates tour Srinagar city in an attempt to see ‘changed Kashmir situation’",
    "Manipur tribal body petitions for permanent political status",
    "Googlies over Tripura’s recognition for Ganguly",
    "How a letter to PMO set off a search for the Sengol",
    "New Parliament inauguration | BJP asks Opposition to rethink decision to boycott",
    "GDP growth may cross 7% in 2022-23: RBI Governor",
    "Global body keeps NHRC waiting over ‘political meddling’",
    "2023-05-25T00:25:17+05:30\n-\nMusic\n'Queen of rock 'n' roll' Tina Turner dies at 83",
    "2023-05-24T22:54:48+05:30\n-\nBusiness\nSEBI tightens reporting requirements for offshore funds",
    "2023-05-24T22:50:26+05:30\n-\nBusiness\nBSE, NSE put Adani Enterprises under short-term ASM framework",
    "2023-05-24T22:48:18+05:30\n-\nBusiness\nLIC Q4 net profit surges over 5-fold to ₹13,191 cr",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "The Narendra Modi visit to Australia adds to the bipartisan strength of growing bonds",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Republicans should not put partisan goals ahead of the greater public good",
    "Technology\nIndia set to triple speed of its fastest supercomputers",
    "BusinessWill services once again come to the rescue of exports?",
    "Tamil Nadu\n‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "Movies\nNetflix releases censored cut of Bheed, bucking usual practice",
    "Technology\nIndia’s PC market declines 30% in Q1 2023; premium laptop shipments worst hit",
    "Movies\nWatch | In conversation with Hiphop Tamizha Adhi",
    "Movies‘Anupamaa’, ‘Khosla Ka Ghosla’ actor Nitesh Pandey dies of suspected cardiac arrest",
    "After Karnataka, more lessons for the BJP",
    "A ‘middle kingdom’ dawns on India’s west",
    "Redrawing the poll strategy in Bihar",
    "It’s time to ensure safer skies",
    "The paradox of BRICS, its new pathway",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "16 new Karnataka MLAs skip oath-taking at Legislative Assembly",
    "How to text someone on WhatsApp without saving their number on your device",
    "Ray Stevenson, of 'RRR' and 'Thor' movies, dies at 58",
    "19 Opposition parties, including Congress, to boycott inauguration of new Parliament building",
    "Cotton prices crash as farmers release held back stocks",
    "Stock to buy today: Bandhan Bank (₹253.90)",
    "Failed ideas of Jawaharlal Nehru",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]