[
    "Manipur, a rude reminder of northeast tensions",
    "Amplify the subject of adolescent girl nutrition",
    "The Telangana BJP is in a bind",
    "Why the Indian museum makeover is important",
    "T.N. should elect over 25 NDA MPs as thanks for Sengol installation: Amit Shah",
    "WFI chief Brij Bhushan Singh says will contest 2024 polls",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren’s presence",
    "French Open final | Novak Djokovic wins his 23rd Grand Slam title by beating Casper Ruud",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "Sachin Pilot vows to fight for youth, farmers, says he won’t back off from his demands",
    "2023-06-12T10:06:10+05:30\n-\nTechnology\nTwitter is refusing to pay its Google Cloud bills: Report",
    "Telltale signs: On Maharashtra and a pattern of sustained polarisation",
    "Low-intensity communal violence in Maharashtra could take a dangerous turn",
    "Miles to go: On the state of the Indian economy",
    "The economy is better poised but still needs deft steering and mindful reforms",
    "Tamil Nadu\nNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "ScienceMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "Technology\nExplained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "WorldUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Football\nManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "WorldNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Governors cannot indefinitely hold back Bills",
    "The importance of small talk",
    "A pragmatic approach, for better India-Nepal ties",
    "Explained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Cyclone Biparjoy set to hit Kutch; Gujarat begins preparations",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren Singh’s presence",
    "IndiGo flight enters Pakistan airspace amid bad weather; returns safely",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Unwavering focus: On the Monetary Policy Committee’s approach to policy",
    "Specific insurance plans for surrogate mothers on the anvil",
    "As rupee reserves grow, Russia may have to invest more in India",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC 2023-2025: India full schedule, tours, matches list",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]