[
    "India’s Test losses: a result of stereotypes and the quest for balance",
    "Male-centric medicine is affecting women’s health",
    "Explained | What is the status of transgenic crops in India?",
    "In Israel, diverse Jewish-Indian communities come together to build a Heritage Centre",
    "Charges of ‘adjustment politics’ during Karnataka Assembly elections trigger political debate",
    "NIA arrests PFI’s ‘master weapons trainer’ in Nizamabad terror conspiracy case",
    "Railway Board was aware of short-cut methods by signalling staff",
    "‘Very Severe’ Cyclone Biparjoy to make landfall in Gujarat, red alert sounded in 6 districts",
    "Why is the Law Commission revisiting Uniform Civil Code now, asks Congress",
    "CET 2023 result announced in Karnataka",
    "2023-06-15T10:36:46+05:30\n-\nMarkets\nRupee falls 16 paise to 82.21 against U.S. dollar",
    "2023-06-15T10:27:00+05:30\n-\nMarkets\nSensex falls 158 points in early trade",
    "2023-06-15T10:02:01+05:30\n-\nTamil Nadu\nThree young men killed in road accident near Tirupattur",
    "2023-06-15T09:57:47+05:30\n-\nTechnology\nMusic publishers sue Twitter for allowing copyrighted songs",
    "Base boost: On inflation and the consumer",
    "Inflation should not be allowed to erode the purchasing power of the poor",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "Bipartisanship has been in short supply in the Trump era, especially after the indictments",
    "Bengaluru\nOnce a waste picker, Indumathi becomes community’s voice at Paris Plastic Treaty",
    "BengaluruBMTC buses run over two labourers",
    "India\nUAE astronaut Al-Neyadi captures pictures of Cyclone Biparjoy from space",
    "Business\nWhat does RBI pausing on rates mean for the Indian economy?",
    "CricketIndia’s Test losses: a result of stereotypes and the quest for balance",
    "Chennai\nNEET topper Prabanjan felicitated in Chennai, plans to join AIIMS Delhi",
    "Chennai\nStudents who worked on ‘AzaadiSAT’ communications satellite meet Tamil Nadu Governor",
    "PuducherryAn alternative armamentarium for the healthcare setting",
    "The next Finance Commission will have a tough task",
    "Strengthening the Integrated Child Development Services scheme",
    "Selling hate through music",
    "On the Draw — June 15, 2023",
    "The JD(S) plan for resurrection",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the govt. impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Student from Hyderabad murdered in London",
    "Tamil Nadu’s Prabanjan, A.P.’s Bora Varun top NEET (UG) with perfect scores",
    "Love all: On Djokovic’s latest feat",
    "Retaliatory strike by village guards leaves nine dead in Manipur",
    "Thailand comes to India’s rescue with crude palm oil exports",
    "Byju’s leap from frying pan into the fire",
    "Controversial arrest of TN Minister Senthil Balaji sparks outrage and political backlash",
    "What is really behind the violence in Manipur?",
    "India vs West Indies 2023 schedule announced: Full list of matches, dates, venues, fixtures",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]