[
    "India\nComing, women-only courts for alternative dispute resolution",
    "Science\nSangam-age stud, bead unearthed in Tamil Nadu",
    "HealthCentre adding more services to Ayushman Bharat health centres",
    "India\nRain, pests drain mangoes of colour, flavour in north India",
    "Pro-Khalistan protest outside Indian mission passes off without incident",
    "U.S. sends its top rights official to Delhi",
    "West Bengal panchayat polls | Political blame game over violence",
    "Lift Internet ban with safeguards: Manipur High Court",
    "2023-07-09T05:20:00+05:30\n-\nWorld\nBiden due to meet King Charles, PM Sunak during brief UK visit",
    "India\nAjit Pawar | The rebel who challenged the patriarch",
    "TechnologyThreads | A new digital town square",
    "India\nCluster munitions | Civilian killer",
    "Kerala\nSarpa app helps bring down snakebite deaths in Kerala",
    "World\nExplained | The U.S. Supreme Court ban on race-based admissions",
    "WorldExplained | Why is China limiting exports of raw materials?",
    "Economy\n Is India’s growing reliance on Russian supplies a long-term risk?",
    "Tamil Nadu\nData | Tamil Nadu ranks highest in suicides among government employees",
    "EnvironmentBritish lawmakers rally for the cause of elephants in India",
    "India\nMakerspaces enables kids in low resource settings break away from rote learning",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Rahul Gandhi defamation case | How definite is ‘Modi’ as a ‘collection of persons’?",
    "12 killed as violence mars panchayat polls in Bengal",
    "Uniform Civil Code and the infinite variety of custom",
    "HDFC Bank-HDFC merger: What should you do with the stock of HDFC Bank now",
    "FunctionUp offers BTech with job guarantee",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]