[
    "Rahul defamation case | How definite is ‘Modi’ as a ‘collection of persons’?",
    "Uniform Civil Code and the infinite variety of custom",
    "The long road to finding true peace in Yemen",
    "Ukraine's president hails the country's soldiers from a Black Sea island to mark 500 days of war",
    "No decision yet on alliance with JJP, says Haryana BJP chief",
    "Centre holds back-door talks with Kuki groups in New Delhi",
    "West Bengal panchayat polls | 12 killed amid large-scale violence",
    "‘Election must be through ballots and not bullets,’ said West Bengal Governor C.V. Ananda Bose",
    "Sharad Pawar on his tour: “I am neither tired, nor retired”",
    "Ominous signs: On attacks by pro-Khalistan elements on Indian interests",
    "India must calibrate its public diplomacy on Khalistan issue to better effect",
    "Truce treaty: On brokering peace in the Congress in Rajasthan",
    "The Congress seems to have bought peace in Rajasthan by taking Pilot on board",
    "Movies\n‘72 Hoorain’ movie review: Nothing controversial about it",
    "Other States\nWhy the Garo tribe of West Bengal’s Alipurduar feels betrayed by the ballot",
    "Movies‘Adipurush’ writer Manoj Shukla issues public apology",
    "World\nSCO Summit | Missed opportunity for India?",
    "Movies‘Sweet Kaaram Coffee’ review: A feel-good series on soul-searching and introspection",
    "Technology\nRobots say they won’t steal jobs, rebel against humans",
    "Sobriety after the euphoria of the U.S. state visit",
    "Due process clause or basic structure doctrine?",
    "On the Draw — July 8, 2023",
    "Should Internet shutdowns be used to maintain public order?",
    "Are science journalists scientists?",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Momentum softens: On S&P Global’s survey",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "Tata Motors sells 5 lakh units of Tiago, grabs 15% share of hatchback segment",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]