[
    "How are Indian languages faring in the age of AI and language models?",
    "The View from India | The reign of Erdogan continues",
    "Death of tuberculosis patient in Kerala throws up questions on gaps in healthcare",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "‘Manipur clashes primarily ethnic, nothing to do with counter-insurgency’: CDS Anil Chauhan",
    "Delhi teen murder case | Accused Sahil sent to 2-day police custody",
    "Manipur violence | Amit Shah meets civil society, women’s group in Imphal",
    "Go First now cancels all scheduled flights till June 4",
    "At least 10 Vaishno Devi pilgrims dead, 57 injured as bus falls down from bridge in Jammu",
    "Delhi HC rejects Manish Sisodia’s bail plea in Excise Policy case",
    "2023-05-30T16:18:54+05:30\n-\nWorld\nNATO soldiers on guard in Kosovo Serb town after clashes",
    "2023-05-30T16:17:01+05:30\n-\nBusiness\nGo First now cancels all scheduled flights till June 4",
    "Symbols and substance: on the inauguration of the new Parliament building and beyond",
    "Religious rituals at the opening of Parliament building defied propriety",
    "Faster, stronger: on India and its supercomputer use",
    "India must use its supercomputers beyond weather forecasts",
    "Kerala\nWatch | What was the Vaikom Satyagraha all about?",
    "ChennaiVummidi Bangaru Chetty family that made Sengol in 1947 felicitated at PM Modi’s residence",
    "Other States\nClimate of fear still lingers in Manipur",
    "Kerala\nLadakh has adventure bikers from Kerala in a thrall",
    "TechnologyWhatsApp is working on usernames, screen sharing over video features: Report",
    "Telangana\nGLSV F12 mission success has Hyderabad touch",
    "Other States\nKashmir’s fading Sufiyana Mausiki, Tchakri songs attract a spotlight",
    "IndiaMalala Yousafzai’s photo removed from Jharkhand school following controversy",
    "Podcast\nWhat lies behind India’s missing wombs problem? | In Focus podcast",
    "The indelible imprint of the Fifth Estate, in Karnataka",
    "From Master of the Roster to Master of all Judges?",
    "The BJP outreach to Saivites",
    "Menstrual health is a public health issue",
    "The Erdogan victory, a triumph for Ottoman glory",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "Explained | The SC ruling on jallikattu",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Recep Tayyip Erdogan wins historic Turkey runoff vote",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Muslims lag behind Scheduled Castes and Scheduled Tribes in higher education",
    "Demerging hotels business is back on ITC’s table",
    "CBI books BAE Systems, Rolls Royce for corruption in Hawk aircraft deal",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]