[
    "BJP dictatorial and opportunistic, says Uddhav Thackeray",
    "Study says cold-blooded animals grow larger, not smaller, in warmer waters",
    "These senior actors in Malayalam cinema have reinvented themselves",
    "Poetic passion: Celebrating the allure of Urdu shayari in the digital age",
    "SBI’s u-turn: No slip, ID proof needed to swap ₹2,000 notes",
    "No visible encroachment by China since 1962: Arunachal BJP team",
    "Kuki groups to press for separation from Manipur, equal political status",
    "Countries should respect each others’ sovereignty and territorial integrity: PM Modi",
    "Khap announces women’s panchayat in front of new Parliament building on May 28",
    "23-year-old techie meets tragic end after car gets submerged in flooded underpass in Bengaluru",
    "Capital quandary: On politics and Delhi’s administrative autonomy",
    "Judging jallikattu: On the Supreme Court verdict",
    "Supreme Court verdict upholds cultural sentiment, but animal rights and human safety matter too",
    "Cricket\nIPL 2023: RCB vs GT | RCB’s campaign ends after six-wicket loss to GT, MI through",
    "IndiaKarnataka Results 2023 | What it means for Congress, BJP and JD(S)",
    "Sci-Tech\nExplained | Understanding a human pangenome map",
    "Science\nHumans were using fire in Europe 50,000 years earlier than we thought",
    "Tamil NaduBihar CM to inaugurate Kalaignar Kottam in Tiruvarur on June 20",
    "Delhi\nThe people who build Delhi don’t stay to enjoy it’s infrastructure",
    "Tamil Nadu\nWatch | 125th flower show in Udhagamandalam",
    "ScienceNew technique welcomes calcium-41 to radiometric dating",
    "World\nNorth-South Transport Corridor | Connecting continents",
    "Manipur mayhem, a manufactured schism",
    "Controversies roil Telangana’s universities",
    "Hijacking G-20’s civil society forum",
    "India as a Quad-led biomanufacturing hub",
    "Tracking SDG progress the Bhopal way",
    "Explained | Are Neanderthals to blame for the long and short of the human nose?",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "FeaturedFair play, fair pay: The Indian music industry and royalties Music Saumya KaliaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Cashless treatment facilities now available to all CGHS beneficiaries at 6 AIIMS",
    "Ennu Swantham–Sreedharan: a Kerala story of a Muslim woman who raised three Hindu children",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "In first meeting, Karnataka Cabinet decides to implement 5 guarantees of Congress",
    "Six packaged drinking water units sealed in Chennai",
    "The making of Vande Bharat trains",
    "Movers & Shakers: Stocks that will see action this week",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023: RCB knocked out after loss to GT, Mumbai Indians qualifies for Playoffs",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]