[
    "In divided Turkey, Erdogan’s hold is weakened but not broken",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Kerala: an exemplary story in palliative care",
    "‘Three capitals’ in Andhra Pradesh",
    "Kiren Rijiju divested of Law portfolio, replaced by Arjun Ram Meghwal",
    "Tamil Nadu spurious liquor tragedy | CB-CID takes over probe",
    "The Kerala Story | SC stays Bengal ban, asks T.N. to provide security to theatres",
    "Karnataka government formation | Congress believes in consensus, not dictatorship: Party slams BJP",
    "Supreme Court upholds laws allowing Jallikattu, Kambala",
    "2023-05-18T17:11:37+05:30\n-\nIndustry\nSEBI issues ₹5.35-crore demand notice to Mehul Choksi",
    "Timely caution: On the Supreme Court’s exhortation to the Enforcement Directorate",
    "The top court has rightly cautioned probe agencies against crossing limits",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "Introspection will do India good in areas where it faces international criticism",
    "Movies\nSeth Rogen on ‘Platonic’ and whether men and women can truly stay friends",
    "Science\nSci-Five | The Hindu Science Quiz: on stars",
    "Movies\n‘Anni Manchi Sakunamule’ movie review: All that drama over coffee",
    "MoviesCannes 2023: Johnny Depp says he has no ‘further need for Hollywood’",
    "Other States\n383 girls and women missing from Mumbai in 3 months, show police data",
    "Karnataka\nWatch | Who are the Hakki Pikki tribes?",
    "Movies‘Mission Impossible 7’ trailer out; Tom Cruise returns as Ethan Hunt for a deadlier mission",
    "Science\nEarth-sized alien planet gripped by widespread volcanism",
    "Two judgments and the principle of accountability",
    "The rebooting of the Congress",
    "A desperate Israeli leader plays the security card",
    "The Dalit outreach of the BRS",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How methanol poisoning kills",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Tussle between DKS and Siddaramaiah crosses party lines and takes caste colour within BJP ranks",
    "Tripping trade: on India and its trade stance",
    "Congress hits back at BJP for questioning delay in deciding Karnataka CM",
    "Amazon Web Services to invest ₹1.06-lakh crore into cloud infrastructure in India",
    "Sensex, Nifty open lower on weak cues amid profit booking",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after PBKS vs DC: Delhi Capitals dents Punjab Kings’ playoff chances",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]