[
    "Data | The effects of more than two decades of Erdogan’s rule",
    "When bicycles were a luxury and avenue trees the norm in Bengaluru",
    "The Indian polity, a democratic diagnosis",
    "A global order as technology’s much needed pole star",
    "Centre hikes kharif crop MSPs, ₹143 increase for paddy",
    "Opposition meeting to be held in Patna on June 23",
    "Protest over social media message turns violent in Kolhapur city; curfew imposed",
    "Odisha train crash | 89 bodies await identification at AIIMS Bhubaneswar",
    "Wrestlers suspend protest on Minister’s assurance",
    "10 Manipur MLAs issued notice for ‘separatism’",
    "Third revival package for BSNL gets nod",
    "2023-06-08T03:15:00+05:30\n-\nTennis\nRohit Rajpal retained as Davis Cup team captain",
    "End the debate: On the Law Commission’s recommendation on sedition",
    "The retention of sedition goes against the grain of current thinking",
    "Deadly billboards: On billboards and their regulation",
    "Despite frequent accidents, there is no political will to regulate billboards",
    "Football\nLionel Messi joins Inter Miami, rejects Barcelona return",
    "IndiaGitanjali Aiyar, popular Doordarshan news anchor, passes away",
    "Business\nThe good and not-so-great takeaways from India’s macroeconomic numbers",
    "Technology\nGoogle Pay enables Aadhaar-based authentication for UPI activation",
    "Movies\nInterviewing Spider-Man: Tom Holland on his great powers, and greater responsibilities",
    "DataData | Most soldiers killed in action during UN missions were Indians",
    "Movies\nNew on Amazon Prime Video this week: ‘Creed III’, ‘The Lake’ Season 2, ‘Nanny’, and more",
    "Movies\n‘Adipurush’ final trailer: Prabhas, Saif Ali Khan do battle in CG spectacle",
    "IndustryIvan Menezes, India-born CEO of Diageo, passes away",
    "Movies\nPark Chan-wook sets up period thriller 'War and Revolt', his first project at Netflix",
    "Sedition — illogical equation of government with state",
    "Tackling the human-dog conflict",
    "Nigeria’s new President faces old problems",
    "On the Draw — June 7, 2023",
    "Seeing India’s energy transition through its States",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Explained | What is the Kosovo-Serbia conflict all about? Why have tensions flared again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Centre urged to allow takeover of Visakhapatnam Steel Plant by SAIL, says its Independent Director",
    "A climax at the summit: on the World Test Championship in London today",
    "Speculation rife about Sachin Pilot floating new party",
    "Odisha train accident probe team member now submits a note of disagreement",
    "Cabinet approves ₹89,000-cr revival package for BSNL",
    "Honeywell to launch Advanced Air Mobility Lab dedicated to drone- testing in Madurai",
    "Why are migratory birds giving India a miss?",
    "‘Savarkar did very little for India’s independence’",
    "IND vs AUS: Why Australian players are wearing black armbands",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]