[
    "Other States\nHimachal explores possibility of growing cannabis",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "Other StatesNurse shortage ails U.P. health system",
    "India\nED searches 12 locations in money-laundering case against PMO ‘imposter’",
    "Quad leaders express deep concern over consequences of Ukraine war",
    "India will do its best to end the war, Modi tells Zelenksy",
    "BSF intercepts three Pakistani drones, seizes 2.60 kg drugs",
    "Top Sikh body extends support to protesting wrestlers",
    "2023-05-21T02:18:00+05:30\n-\nWorld\nNorth-South Transport Corridor | Connecting continents",
    "2023-05-21T02:06:00+05:30\n-\nIndia\nTop Sikh body extends support to protesting wrestlers",
    "2023-05-21T02:02:00+05:30\n-\nKarnataka Elections\nSiddaramaiah | An AHINDA leader’s new innings",
    "2023-05-21T00:50:30+05:30\n-\nWorld\nMartin Amis, British writer of dark comedic novels, dies at 73",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "WorldNorth-South Transport Corridor | Connecting continents",
    "Movies\nAuschwitz drama 'Zone of Interest' marks director Glazer's first Cannes foray",
    "Tamil Nadu\nTN boy braves disability, scores 437 in class X exam",
    "KeralaThe people and the government: the contemporary relevance of The Svadesabhimani",
    "Economy\nRBI to pull out ₹2,000 notes from active circulation",
    "Movies‘Devara’ is the title of Jr NTR’s film with Koratala Siva; first-look poster out",
    "Technology\nThe accessibility gap on streaming in India",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Narayana Netralaya chairman Dr. Bhujang Shetty passes away",
    "Centre reverses Supreme Court order, gives Delhi Lieutenant Governor final say on bureaucrats",
    "RBI to pull out ₹2,000 notes from active circulation",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "Telangana can now build a city as big as Hyderabad next to it",
    "Pichai sells Chennai home where Sundar grew up",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023 Points Table update after PBKS vs RR match: Rajasthan moves to fifth, keeps hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]