[
    "The View from India | The significance of Blinken’s China visit",
    "A change of name for votes",
    "A rising India, in waltz dance steps with the U.S.",
    "The Ashes 2023 | Cummins leads Australia to thrilling victory over England",
    "PM Modi’s U.S. visit LIVE Updates | Modi-Biden talks to touch five broad areas of significance",
    "Childline to be merged with Emergency Response Support System in nine States and Union Territories",
    "Narendra Modi arrives in New York; to lead Yoga Day at United Nations",
    "Prime Minister Narendra Modi was received in New York by Taranjit Singh Sandhu and Ruchira Kamboj.",
    "Dozens of U.S. lawmakers ask Biden to raise democracy and human rights concerns with Modi",
    "Assam Rifles secures threatened supply route to Manipur’s hill districts",
    "More Assembly seats to be reserved for SCs, STs in Assam",
    "2023-06-20T23:51:31+05:30\n-\nIndia\nAround 2,300 adoptions happen in nine months under new policy",
    "A welcome step: on the Blinken-Xi meet in China",
    "The U.S. and China must continue to keep diplomatic channels open",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "American culture’s over-reliance on police to maintain order in public life is problematic",
    "Movies\nPride Month | Queer cinema’s shackles in the mainstream",
    "Other StatesFlood approaching; speed guns on highway along Kaziranga National Park out of order",
    "India\nExplained | Decoding the expert committee report on Adani",
    "World\nWhat we know about the missing Titanic sub",
    "India\nIndiGo announces 500 Airbus narrowbody aircraft order",
    "EntertainmentK-Drama fans fume as Netflix India waits for Hindi dub to release shows",
    "Authors\nAuthor Salman Rushdie awarded prestigious German prize for his literary work and resolve",
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Tamil NaduVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Gadgets\nViewSonic X2000 Projector Review | Upgrade only if you want a sleeker option",
    "A people of an emerald isle, waiting with doosras",
    "Semiconductor fab: the unfinished agenda",
    "A churning in Andhra Pradesh",
    "Rawalpindi gains the upper hand in troubled Pakistan",
    "Explained | Arctic Ocean could be ice-free in summer by 2030s, say scientists",
    "Byju’s woes: A timeline of the Indian edutech giant’s troubles at home and abroad",
    "Explained | Are phonons, particles of sound, quantum too?",
    "Get less oxygen, live longer? It’s true in ageing mice",
    "Explained | If Betelgeuse goes supernova, what would it look like?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Manjhi’s HAM (S) withdraws support to Nitish government",
    "U.K. MPs endorse report against Boris Johnson over ‘partygate’",
    "Manipur violence | SC refuses urgent hearing on plea seeking Army protection for Kuki tribals",
    "Assam floods | 31,000 people affected in 10 districts",
    "SEBI did not do a thorough investigation: Punit Goenka to SAT",
    "Stocks to watch today — June 20, 2023",
    "Why Pali lost out and Sanskrit received more than its due",
    "What place does a sceptre have in a democracy?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]