[
    "Kohli and Root — two contemporary greats and their different approaches",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "Indian-origin teen crashes truck into a White House barrier; says he wanted to kill Biden",
    "U.T. Khader unanimously elected Speaker of Karnataka Legislative Assembly",
    "PM Modi raises concerns over attacks on temples in Australia with Anthony Albanese",
    "New Parliament opening | Parliamentary Affairs Minister asks Opposition to reconsider boycott",
    "Violence erupts in Manipur; one killed, two injured in Bishnupur district",
    "U.P. court acquits Samajwadi Party leader Azam Khan in 2019 hate speech case",
    "2023-05-24T20:43:34+05:30\n-\nWorld\nChina appoints new envoy to U.S. in sign of thaw",
    "2023-05-24T20:37:39+05:30\n-\nOther States\nDahod mosque demolition: Gujarat HC directs status quo",
    "2023-05-24T20:31:21+05:30\n-\nOther States\nINSV Tarini returns to Goa after 188-day voyage",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "The Congress in Karnataka must now focus on governance",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "Tamil Nadu\n‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "MoviesNetflix releases censored cut of Bheed, bucking usual practice",
    "Technology\nIndia’s PC market declines 30% in Q1 2023; premium laptop shipments worst hit",
    "Movies\nWatch | In conversation with Hiphop Tamizha Adhi",
    "Movies\n‘Anupamaa’, ‘Khosla Ka Ghosla’ actor Nitesh Pandey dies of suspected cardiac arrest",
    "MoviesFilmi-ness: Kunal Basu on writing and cinema",
    "Food\nDaily Quiz | On mangoes",
    "Justice that also makes space for the animal world",
    "Redrawing the poll strategy in Bihar",
    "The paradox of BRICS, its new pathway",
    "It’s time to ensure safer skies",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "16 new Karnataka MLAs skip oath-taking at Legislative Assembly",
    "How to text someone on WhatsApp without saving their number on your device",
    "Ray Stevenson, of 'RRR' and 'Thor' movies, dies at 58",
    "19 Opposition parties, including Congress, to boycott inauguration of new Parliament building",
    "Cotton prices crash as farmers release held back stocks",
    "Stock to buy today: Bandhan Bank (₹253.90)",
    "Failed ideas of Jawaharlal Nehru",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]