[
    "Amid Centre’s Tamil outreach, historical claims come under scrutiny",
    "Astronomers find new clue about mysterious radio flashes in space",
    "Industrial investments: The Kerala story",
    "A ‘middle kingdom’ dawns on India’s west",
    "Will visit Manipur soon, says Amit Shah",
    "Bournvita maker defends sugar content, says marketing is legal",
    "Amid reports of milk shortage, FSSAI to conduct pan-India surveillance",
    "Sengol | Evidence thin on govt’s claims about the sceptre",
    "All-in-one policy plan to spread insurance in India",
    "Car crashes into London’s Downing Street gates, one arrested: Police",
    "New committee set up to oversee cheetah project",
    "2023-05-25T22:47:05+05:30\n-\nWorld\nRussia to shut Swedish consulate, expel five diplomats",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Tamil Nadu\nWhen Roman merchants and soldiers came to Madurai to trade in pepper",
    "MoviesWhere are the writers in Kannada cinema?",
    "Hyderabad\nMan dies of ‘heart attack’ soon after his daughter’s wedding at marriage hall",
    "Science\nSci-Five | The Hindu Science quiz: On migrating birds",
    "Movies\nDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "TechnologyEducation sector worst hit as ransomware attacks rise in India: Report",
    "Environment\nBrazil builds 'rings of carbon dioxide' to simulate climate change in the Amazon",
    "MusicTina Turner: five favourite songs",
    "Movies\n‘The Wheel Of Time’ gets season 2 premiere date",
    "An ordinance, its constitutionality, and scrutiny",
    "Should States revert to the Old Pension Scheme?",
    "Economics that looks at lower half of the pyramid",
    "The fundamental value of the rupee",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "How to text someone on WhatsApp without saving their number on your device",
    "New Parliament building opening | How a letter to PMO set off a search for the Sengol",
    "Fear of flooding forces Bengaluru techie to leave ₹1.08 crore villa and cough up rent in lakhs",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "Stocks to watch out today — May 25, 2023",
    "Ola Electric aims for IPO by 2023-end, hires Goldman, Kotak: Source",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]