[
    "News Analysis | Eight months on, ‘Team Kharge’ is a work in progress ahead of 2024 poll",
    "Data | With French Open win, Djoker holds all the cards now",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "A churning in Andhra Pradesh",
    "As India seeks new LNG supplies, speculation over possibility of reviving Trump-era deal",
    "Modi’s U.S. visit live updates | PM reaches Washington on 2nd leg of maiden State visit",
    "Meitei Tribes Union files plea to defer hearing on appeal against ST status order",
    "Manipur violence has left deep wound in nation’s conscience, says Sonia",
    "Former Bihar CM Manjhi’s HAM(S) to support NDA",
    "A welcome step: on the Blinken-Xi meet in China",
    "The U.S. and China must continue to keep diplomatic channels open",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "American culture’s over-reliance on police to maintain order in public life is problematic",
    "Business\nIs GDP the right way to measure a nation’s progress?",
    "Environment16 tigers dead in Uttarakhand since January",
    "India\nPM Modi-led Yoga session at UN creates Guinness World Record",
    "Internet\nSnapchat launches nicknames inspired AR lenses in India",
    "Movies\n‘Lust Stories 2’ trailer: Netflix anthology looks at love, sex and social class",
    "BooksThe Hindu on Books | Honours for Ramachandra Guha; talking to Romila Thapar and more",
    "Movies\n‘Challengers’ trailer: Zendaya and Luca Guadagnino bring spiky tennis romance",
    "A people of an emerald isle, waiting with doosras",
    "Semiconductor fab: the unfinished agenda",
    "Rawalpindi gains the upper hand in troubled Pakistan",
    "A change of name for votes",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "Explained | Was India’s hot summer of 2023 the first of many to come?",
    "FeaturedPride Month | Queer cinema’s shackles in the mainstreamMoviesBhuvanesh ChandarREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IndiGo announces 500 Airbus narrowbody plane order",
    "YES Bank eyes acquisition of microfinance company in FY24",
    "Mercury may fall 3-5℃ in next five days as monsoon enters East India, MP",
    "What is really behind the violence in Manipur?",
    "What place does a sceptre have in a democracy?",
    "India vs Pakistan Live Streaming Info: Preview, when and where to watch SAFF Championship?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]