[
    "Data | With French Open win, Djoker holds all the cards now",
    "A churning in Andhra Pradesh",
    "Semiconductor fab: the unfinished agenda",
    "Tesla looking at significant investment in India: Elon Musk after meeting PM Modi",
    "No immediate relief for ED in Senthilbalaji case, SC to wait for Madras High Court’s final orders",
    "We have to end contradictions through yoga, says PM Modi",
    "A welcome step: on the Blinken-Xi meet in China",
    "The U.S. and China must continue to keep diplomatic channels open",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "American culture’s over-reliance on police to maintain order in public life is problematic",
    "Music\nMeet musicians from Bengaluru making melodies on World Music Day",
    "IndiaIn Frames | International Day of Yoga 2023",
    "Mangaluru\n‘Enchi Crunchi’—now you can drink the beverage and eat the cup too",
    "Technology\nIndia improves on mobile download speed; fixed broadband drops: Report",
    "Health\nWhere the mind is without fear: What is anxiety and how can we beat it?",
    "InternetGoogle releases new features to enhance online shopping",
    "Gadgets\nSony Bravia X75L TV Review | A middling experience from a top TV maker",
    "Gadgets\nJBL launches Tune Buds and Beam earbuds with ANC",
    "ChennaiCrane stolen from Chennai Metro Rail project site found in A.P.’s Kalahasti",
    "India\nIndian Railways to make travel easier for unreserved passengers",
    "A people of an emerald isle, waiting with doosras",
    "Rawalpindi gains the upper hand in troubled Pakistan",
    "A change of name for votes",
    "Explained | Was India’s hot summer of 2023 the first of many to come?",
    "Explained | What is the contention between Coal India and CCI?",
    "Explained | Arctic Ocean could be ice-free in summer by 2030s, say scientists",
    "Byju’s woes: A timeline of the Indian edutech giant’s troubles at home and abroad",
    "Explained | Are phonons, particles of sound, quantum too?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Manjhi’s HAM (S) withdraws support to Nitish government",
    "President’s Rule ‘last option’ in Manipur, government to wait and watch",
    "YES Bank eyes acquisition of microfinance company in FY24",
    "Mercury may fall 3-5℃ in next five days as monsoon enters East India, MP",
    "What is really behind the violence in Manipur?",
    "What place does a sceptre have in a democracy?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]