[
    "History & Culture\nThe naked philosophers: the reason some Indian ascetics renounced their robes",
    "Society\nSatire | SOPEE for the airborne Indian male",
    "EconomyExplained | Will all overseas spends come under the tax net?",
    "Music\nFair play, fair pay: The Indian music industry and royalties",
    "Russia-Ukraine crisis an issue of humanity: PM Modi at G7 session",
    "Uttar Pradesh’s nursing crisis, and what the State is doing to mitigate the shortage",
    "Uttar Pradesh has just 1.38 lakh nurses and midwives for its population of over 23 crore",
    "Nitish Kumar meets Kejriwal after Congress' snub to AAP leader",
    "Compensate for usage or vacate: Gurdwara landowner in Arunachal tells Army",
    "2023-05-21T13:23:46+05:30\n-\nPuducherry\nNew DIG of Villupuram Range assumes office",
    "2023-05-21T13:19:51+05:30\n-\nWorld\nZelensky appears to confirm Bakhmut loss, saying 'nothing left'",
    "2023-05-21T13:10:36+05:30\n-\nIndia\nNitish Kumar meets Kejriwal after Congress' snub to AAP leader",
    "2023-05-21T12:44:21+05:30\n-\nCricket\nNot thinking about Team India selection yet: Rinku Singh",
    "Movies\nVeteran actor Kamal Haasan to be felicitated at IIFA 2023",
    "PhotosIn Frames | Turkey at a crossroads",
    "Luxury\nWhy quiet luxury in India is not quiet",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "Tamil NaduExplained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "World\nNorth-South Transport Corridor | Connecting continents",
    "TechnologyLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "383 girls and women missing from Mumbai in 3 months, show police data",
    "Science for All | What is the Petermann Glacier?",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "Probe involvement of 2 radical Meitei groups in Manipur pogrom: tribal student bodies",
    "The making of Vande Bharat trains",
    "Centre issues ordinance: New authority to decide transfer, postings in Delhi",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table updated after KKR vs LSG: Lucknow qualifies for Playoffs with one-run win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]