[
    "Explained | Abaucin, the potential new antibiotic found with machine-learning",
    "How the old found sanctuary and the new blossomed in CSK",
    "75 years of peacekeeping: India’s contribution to U.N.’s peace missions",
    "‘A passenger boarding Air India must be pleasantly surprised’: CEO Wilson",
    "NIA raids at three locations in Kashmir targets newly formed terror offshoots",
    "Punjab Cabinet expanded; two more MLAs inducted, Minister Nijjer quits",
    "Top AI CEOs, experts raise 'risk of extinction' from AI",
    "Manipur violence | Amit Shah visits border town Moreh, reviews security; meets community leaders",
    "Core sectors’ growth slips to six-month low of 3.5% in April",
    "BJP 'threatening' people and 'misusing' government agencies: Rahul Gandhi in U.S.",
    "Wrestlers’ protest | Naresh Tikait announces mahapanchayat in Muzaffarnagar on Thursday",
    "2023-05-31T17:57:14+05:30\n-\nGadgets\nAcer launches Google TV lineup in India",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "CSK’s win over Titans showcased the best and the latest of IPL",
    "Movies\nFrom ‘Lagaan’ to ‘Pathaan’: How YRF’s Sherry Bharda changed visual effects",
    "Technology\nXiaomi aims export and localised component manufacturing with Dixon in India",
    "Kerala\nA woman police officer in Kerala who fought many battles for gender equality",
    "India\nDaily Quiz | On Chief Ministers",
    "Karnataka\nMiraculous escape from cobra",
    "TechnologyHow to block ads in Chrome browser",
    "Internet\nHow to post your voice as a status update on WhatsApp",
    "The short history of a large note",
    "Using Buddhism as a tool of soft power",
    "Rethinking alliances in Andhra",
    "From Master of the Roster to Master of all Judges?",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "The BJP outreach to Saivites",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Wrestlers defer plan to immerse medals",
    "IPL 2023 Final | Chennai Super Kings beats Gujarat Titans by five wickets to win fifth title",
    "Heavy rain seen for Kerala, Karnataka but monsoon not in sight yet",
    "Modi’s Sengol masterstroke",
    "Advani called it ‘the Congressisation of the BJP’",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]