[
    "Data | Apathy of family and high costs hinder maternal healthcare",
    "BJP dictatorial and opportunistic, says Uddhav Thackeray",
    "Study says cold-blooded animals grow larger, not smaller, in warmer waters",
    "These senior actors in Malayalam cinema have reinvented themselves",
    "Delhi HC summons BBC in defamation suit over documentary on PM Modi",
    "FPI buying in Indian shares hits 6-month high in first half of May: NSDL",
    "Under duress, BJP leader in Uttarakhand calls off daughter’s wedding with Muslim man",
    "NCP’s Jayant Patil appears before ED in Mumbai, says suffering for being part of Opposition",
    "Kashmir G-20 meet | Delegates arrive in Srinagar for 3rd tourism working group meeting",
    "RBI expects return of most ₹2,000 currency notes in circulation by September 30: RBI Governor",
    "PM Modi underlines importance of free and open Indo-Pacific at FIPIC summit in Papua New Guinea",
    "Capital quandary: On politics and Delhi’s administrative autonomy",
    "Judging jallikattu: On the Supreme Court verdict",
    "Supreme Court verdict upholds cultural sentiment, but animal rights and human safety matter too",
    "Technology\nIs OpenAI fit to flag its own product’s plagiarism?",
    "Personal FinanceSafe Travels! In more ways than one…",
    "Tamil Nadu\nTwo die after consuming liquor in Thanjavur, cyanide poisoning suspected",
    "Kerala\nOver 100 women judges in Kerala seek permission to wear churidar in courts",
    "Delhi\nThe people who build Delhi don’t stay to enjoy its infrastructure",
    "CricketIPL 2023: RCB vs GT | RCB’s campaign ends after six-wicket loss to GT, MI through",
    "India\nKarnataka Results 2023 | What it means for Congress, BJP and JD(S)",
    "ScienceExplained | Understanding a human pangenome map",
    "Science\nHumans were using fire in Europe 50,000 years earlier than we thought",
    "Manipur mayhem, a manufactured schism",
    "Controversies roil Telangana’s universities",
    "Hijacking G-20’s civil society forum",
    "Explained | What are RBI regulations on green deposits?",
    "India as a Quad-led biomanufacturing hub",
    "Tracking SDG progress the Bhopal way",
    "Explained | What is the ‘Open Network for Digital Commerce’?",
    "Explained | Understanding a human pangenome map",
    "Explained | Are Neanderthals to blame for the long and short of the human nose?",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "FeaturedFair play, fair pay: The Indian music industry and royalties Music Saumya KaliaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "23-year-old techie meets tragic end after car gets submerged in flooded underpass in Bengaluru",
    "Unhappy with tussle in Congress, Jat leader Subhash Maharia rejoins BJP",
    "Cashless treatment facilities now available to all CGHS beneficiaries at 6 AIIMS",
    "The making of Vande Bharat trains",
    "Hindenburg saga: Four FPIs under SEBI scanner for Adani share price crash",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023: RCB knocked out after loss to GT, Mumbai Indians qualifies for Playoffs",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]