[
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "Explained | Abaucin, the potential new antibiotic found with machine-learning",
    "How the old found sanctuary and the new blossomed in CSK",
    "75 years of peacekeeping: India’s contribution to U.N.’s peace missions",
    "Nine years of BJP rule dedicated to people’s welfare, good governance: PM Modi",
    "PM Modi among those who think they know more than God, Rahul says at event in the U.S.",
    "India’s GDP expanded 6.1% in 2022-23’s last quarter",
    "16 parties confirm participation for the June 12 Opposition meet",
    "Eastern Ladakh row | India, China agree to hold next round of military talks soon",
    "Centre to provide air connectivity for Manipur’s hill areas",
    "NIA raids premises linked to PFI supporters in 3 States",
    "2023-06-01T01:28:07+05:30\n-\nTennis\nSabalenka powers into French Open third round",
    "2023-06-01T01:22:00+05:30\n-\nOther States\nShivraj lays foundation stone for Devi Lok in Sehore",
    "2023-06-01T00:17:00+05:30\n-\nIndia\nCentre to provide air connectivity for Manipur’s hill areas",
    "Uncertain showers: On monsoon information and the Indian farmer",
    "Farmers need to be given timely, accurate information on rainfall",
    "Status quo in Turkey: On the new term for Recep Tayyip Erdoğan",
    "Erdogan must right the wrongs of the past and offer a new inclusive beginning",
    "Movies\nFrom ‘Lagaan’ to ‘Pathaan’: How YRF’s Sherry Bharda changed visual effects",
    "Technology\nXiaomi aims export and localised component manufacturing with Dixon in India",
    "Kerala\nA woman police officer in Kerala who fought many battles for gender equality",
    "India\nDaily Quiz | On Chief Ministers",
    "Karnataka\nMiraculous escape from cobra",
    "TechnologyHow to block ads in Chrome browser",
    "Internet\nHow to post your voice as a status update on WhatsApp",
    "A parliamentary democracy or an executive democracy",
    "Biodiversity is us and we are biodiversity",
    "Using Buddhism as a tool of soft power",
    "The BJP outreach to Saivites",
    "Rethinking alliances in Andhra",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "Wrestlers defer plan to immerse medals",
    "IPL 2023 Final | Chennai Super Kings beats Gujarat Titans by five wickets to win fifth title",
    "Heavy rain seen for Kerala, Karnataka but monsoon not in sight yet",
    "Modi’s Sengol masterstroke",
    "Advani called it ‘the Congressisation of the BJP’",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]