[
    "India\nAdipurush kicks off political storm; Chhattisgarh ready to ban film on public demand",
    "Environment\nElephant habitat along Tamil Nadu-Kerala boundary faces threat",
    "AuthorsFor Hindutva, only the Hindu past is relevant, says Romila Thapar",
    "India\nMeghalaya’s new attendance app keeps proxy teachers away",
    "Manipur relief camps | From one eruption to another, day and night spread equal dread",
    "NIA takes over probe into attacks on Indian Missions in U.S., Canada",
    "Railways to review operations, to ensure ‘zero compromise’ on safety",
    "At least 41 killed in rebel attack on Ugandan school near Congo border",
    "2023-06-18T02:47:00+05:30\n-\nIndia\nKukis | Fight for land and identity",
    "Tamil Nadu\nV. Senthilbalaji | From villain to anti-hero",
    "WorldAsian Infrastructure Investment Bank | Banking on China",
    "India\nKukis | Fight for land and identity",
    "India\nNandi on Sengol inspired by royal symbol of Nolamba Pallavas: researcher",
    "Science\nChandrayaan-3 | ISRO’s Space Physics Laboratory gears up for big moment",
    "MoviesVijay meets and honours students; speech goes viral",
    "Movies\nDavid Attenborough’s ‘Our Planet II’ is a visual delight despite its sobering message",
    "Movies\n‘Black Mirror’ Season 6 review: Disturbing, disquieting, delicious",
    "Movies‘Shaitan’ web series review: Blood, gore and survival",
    "Tiruchirapalli\nNarikuravar teen from village in Perambalur district clears NEET",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "CBI books senior BSNL officials for graft; searches 25 locations",
    "Lulu Group opens its first project in T.N.",
    "American chipmaker Micron mulls large investment in India: source",
    "In the aftermath of cyclone Biparjoy, Gujarat grapples with destruction",
    "Daniel Ellsberg, who leaked Pentagon Papers exposing Vietnam War secrets, dies at 92",
    "Index Outlook: Nifty 50, Sensex: Crucial resistance ahead",
    "TCS, Transamerica end $2 billion contract due to macro environment",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "What is really behind the violence in Manipur?",
    "Leander Paes turns 50: My motivation was to prove that Indians are world-beaters",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]