[
    "The View from India | The significance of Blinken’s China visit",
    "A change of name for votes",
    "A rising India, in waltz dance steps with the U.S.",
    "Senthilbalaji to undergo surgery on June 21, says T.N. Health Minister",
    "Assam floods | 31,000 people affected in 10 districts",
    "Manipur violence | SC refuses urgent hearing on plea seeking Army protection for Kuki tribals",
    "EC releases Assam delimitation proposals; no change in number of LS, Assembly seats",
    "China blocks proposal at U.N. to blacklist Pak-based LeT terrorist and 26/11 accused Sajid Mir",
    "SC verdict opens doors for central security forces to enter West Bengal",
    "Zero tolerance on spurious medicines, 71 firms issued notices: Mandaviya on cough syrup row",
    "2023-06-20T19:57:22+05:30\n-\nTennis\nMartina Navratilova says she is clear of cancer after tests",
    "Grassroots peace: on the local body elections in West Bengal",
    "Free and fair elections to local bodies are not possible without peace",
    "Safety first: on Indian pharma products and drug safety",
    "India’s regulators must ensure quality and safety of drugs",
    "Movies\nPride Month | Queer cinema’s shackles in the mainstream",
    "Other StatesFlood approaching; speed guns on highway along Kaziranga National Park out of order",
    "India\nExplained | Decoding the expert committee report on Adani",
    "World\nWhat we know about the missing Titanic sub",
    "India\nIndiGo announces 500 Airbus narrowbody aircraft order",
    "EntertainmentK-Drama fans fume as Netflix India waits for Hindi dub to release shows",
    "Authors\nAuthor Salman Rushdie awarded prestigious German prize for his literary work and resolve",
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Tamil NaduVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Gadgets\nViewSonic X2000 Projector Review | Upgrade only if you want a sleeker option",
    "Emerging challenges to the Dravidian model",
    "Refugees as assets to their new countries",
    "T.N. Minister Senthilbalaji arrest | A case of propriety versus politics",
    "Explained | Arctic Ocean could be ice-free in summer by 2030s, say scientists",
    "Can the new Diet and Biomarker Survey trace the roots of India’s anaemia problem?",
    "Explained | Are phonons, particles of sound, quantum too?",
    "Get less oxygen, live longer? It’s true in ageing mice",
    "Explained | If Betelgeuse goes supernova, what would it look like?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "India and U.S. share democratic values on democracy, diversity: PM Modi ahead of state visit",
    "IndiGo announces 500 Airbus narrowbody plane order",
    "Wanted Khalistan Tiger Force chief Hardeep Singh Nijjar gunned down in Canadian city Surrey",
    "ACC clears SBI MD Swaminathan J’s appointment as RBI Deputy Governor",
    "Direct tax collection in April 1-June 17 rises 12.7%",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]