[
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "No. 3 is a crucial position and Shubman Gill is best suited for it",
    "There was lightning in your kitchen today. Did you see?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "EU to take one giant leap towards digital euro",
    "Lokayukta raids K.R. Puram Tahsildar in Bengaluru, seizes unaccounted cash",
    "Centre planning new Bill on stray dog issue",
    "TAPAS 201 UAV ready for user trials, says DRDO",
    "Yevgeny Prigozhin moved to Belarus; Russia won’t press charges for mutiny",
    "Canada to introduce new work permit for U.S. H-1B visa holders",
    "Centre allows Aadhaar authentication for registration of births and deaths",
    "2023-06-28T12:28:39+05:30\n-\nIndia\nTAPAS 201 UAV ready for user trials, says DRDO",
    "2023-06-28T12:18:10+05:30\n-\nScience\nNASA sees moon lunar mining trial within the next decade",
    "2023-06-28T12:10:30+05:30\n-\nEnvironment\nSri Lanka scraps proposal to export monkeys to China",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Podcast\nThe meaning of the Wagner Group’s march | The Hindu In Focus Podcast",
    "EntertainmentActor Julian Sands died while hiking on California mountain, authorities confirm",
    "Data\nData | Another tiger from Madras: The rise and rise of D. Gukesh",
    "Kerala\nDelving into the curious world of insects through brushstrokes",
    "India\nSeven products from U.P. get GI tag",
    "Other SportsParalympic champion Krishna Nagar trains his sights on Paris 2024 qualification",
    "Technology\nMeta Quest+ VR subscription service launched",
    "Cricket\nChepauk loses out as ODI World Cup semifinal goes to Eden Gardens",
    "ChennaiPolicing in Chennai goes hi-tech with GIS mapping, analytics of crime zones",
    "Movies\nTamannaah Bhatia on ‘Jailer’, ‘Jee Karda’, ‘Lust Stories 2’ and Vijay Varma",
    "Tracing the arc of American ‘exception-ism’ for India",
    "A row over rice in Karnataka",
    "A model for quality and inclusive education",
    "Reduced ceiling, increased anger",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "FeaturedPride Month | Lesbians through the looking glassMoviesTamma MokshaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Centre will ensure execution of SoO pact with Kuki groups, says Amit Shah",
    "There are houses for rent in Bengaluru, but too many conditions apply",
    "India has to do lot of homework to compete with China in mobile manufacturing: Yuqing Xing",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "ICC ODI World Cup 2023 schedule: Full list of matches, dates, venues, timings",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]