[
    "NCP’s Delhi meeting ‘expels’ Ajit Pawar, 11 others from party",
    "Data | Why Centre’s denial of rice through OMSS hits Karnataka the most",
    "Science for All | Why does observing gravitational waves matter?",
    "Yuki Bhambri’s doubles success will inspire many Indian players, says coach M. Balachandran",
    "Rain inundates coastal Karnataka, brings parts of Kerala to a halt",
    "As envoy says G-20 summit is key event for Russia, Putin visit now a possibility",
    "State Election Commissioner responsible for corpses on the streets: West Bengal Governor",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Pleas for restoring Internet to be heard in chambers: Manipur High Court",
    "Freedom of expression being misused in Canada by anti-India elements: New Delhi",
    "Defamation case | Gujarat HC to deliver verdict on Rahul’s plea today",
    "2023-07-07T00:58:38+05:30\n-\nTechnology\nTwitter threatens to sue Meta over Threads: Report",
    "2023-07-06T23:54:38+05:30\n-\nDelhi\nHC for closing contempt case against S. Gurumurthy",
    "Momentum softens: On S&P Global’s survey",
    "Food inflation threatens to undermine efforts to ensure price stability",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Governments must focus on effective implementation of existing food security schemes",
    "Technology\nTwitter threatens to sue Meta over Threads: Report",
    "PodcastWhy are Indian highways so unsafe? | In Focus podcast",
    "Cartoon\nIt rained in the city",
    "Movies\nLeonardo DiCaprio, Robert De Niro’s ‘Killers of the Flower Moon’ trailer out",
    "MoviesWatch | Amala Akkineni: Cinema is no longer about one person producing a masterpiece",
    "Telangana\nPicture shot by Telangana girl makes it to Vogue Italia magazine",
    "Karnataka\nMysuru’s public bicycle sharing system Trin Trin to get new technology",
    "EconomyIndia’s expanding middle class will bulge up to over 1 billion by 2047: PRICE study",
    "India needs a Uniform Civil Code",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Green Humour by Rohan Chakravarty",
    "Internationalising the rupee without the ‘coin tossing’",
    "An inclusive social policy for migrants",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "Explained | The changes to the Liberalised Remittance Scheme",
    "Explained | India’s diabetes epidemic is making India’s TB epidemic worse",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Problem of manual scavenging eliminated, claims Union Social Justice Ministry panel",
    "‘Chinese investments returning to India with greater opacity’",
    "Heavy rain and rough sea batter Kerala, Karnataka",
    "Muslim organisations divided on Uniform Civil Code",
    "Capturing the universe’s hum: Researchers find evidence of ultra-low frequency gravitational waves",
    "IOC board to meet on July 7 for rights issue",
    "Devoted and dull, ‘Adipurush’ is a flat work of worship",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]