[
    "Data | Retail price of tomatoes more than ₹100 a kg in over 50 cities",
    "Spotlight | Are women paying the price as work shifts back to office space?",
    "Moon, Mars and beyond: the UAE makes an ambitious foray into space",
    "Third LIGO will put India on the research map",
    "Southeast Asia reports a 69% reduction in COVID cases in 28 days: WHO update",
    "Deport Khalistan elements: National Security Adviser Ajit Doval tells U.K. counterpart Tim Barrow",
    "BJP appoints poll in-charges for four poll-bound States",
    "Congress to move SC after Gujarat HC refuses to stay Rahul’s conviction",
    "West Bengal set to vote in panchayat elections on July 8",
    "Balasore train accident | CBI makes first arrests, three railway staff held",
    "Amid NCP power tussle, Ajit Pawar faction questions right of working committee to expel rebels",
    "2023-07-07T21:31:42+05:30\n-\nWorld\nIsraeli forces kill two Palestinian gunmen in West Bank raid",
    "2023-07-07T21:19:49+05:30\n-\nOther States\nWest Bengal set to vote in panchayat elections on July 8",
    "2023-07-07T21:15:02+05:30\n-\nWorld\nThousands rally in Pakistan to condemn Koran burning",
    "Momentum softens: On S&P Global’s survey",
    "Food inflation threatens to undermine efforts to ensure price stability",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Governments must focus on effective implementation of existing food security schemes",
    "Technology\nRobots say they won’t steal jobs, rebel against humans",
    "IndiaWatch | Fault lines in the Opposition unity",
    "Industry\nMcDonald’s India franchisee puts tomato off the menu amid price rise",
    "Movies\n‘Sweet Kaaram Coffee’ review: A feel-good series on soul-searching and introspection",
    "India\nSpotlight | Project Puri",
    "Kochi\nManchester City fans in Kerala on a high as club announces ‘Treble Trophy Tour’ in September",
    "Movies‘Tarla’ movie review: A simplistic, flat narration dilutes a fascinating story",
    "Art\nPeerless line artist Namboodiri passes away at 98",
    "India needs a Uniform Civil Code",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Gujarat’s bridges to nowhere",
    "Internationalising the rupee without the ‘coin tossing’",
    "An inclusive social policy for migrants",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "FeaturedExplained | Understanding dark patternsG.S. Bajpai,Ankit SrivastavaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Coimbatore Range DIG C. Vijayakumar ends life; CM Stalin expresses condolences",
    "Relief, again: On the Teesta Setalvad case",
    "Size of Indian economy expected to be just short of $20 trillion: Bibek Debroy",
    "AP’s new pension scheme is attractive and viable",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]