[
    "Other States\nHimachal explores possibility of growing cannabis",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "Other StatesNurse shortage ails U.P. health system",
    "Quad leaders express deep concern over consequences of Ukraine war",
    "India will do its best to end the war, PM Modi tells Zelenksy",
    "BSF intercepts three Pakistani drones, seizes 2.6 kg drugs",
    "Top Sikh body extends support to protesting wrestlers",
    "2023-05-21T06:26:00+05:30\n-\nOther States\nWhat has been done to Delhi is a travesty: Omar Abdullah",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "Tamil NaduExplained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Health\nExplained | What is WHO’s advice on non-sugar sweeteners?",
    "Economy\nExplained | Will all overseas spends come under the tax net?",
    "World\nNorth-South Transport Corridor | Connecting continents",
    "TechnologyLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Movies\nAuschwitz drama 'Zone of Interest' marks director Glazer's first Cannes foray",
    "Tamil NaduTN boy braves disability, scores 437 in class X exam",
    "Kerala\nThe people and the government: the contemporary relevance of The Svadesabhimani",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Science for All | What is the Petermann Glacier?",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "Probe involvement of 2 radical Meitei groups in Manipur pogrom: tribal student bodies",
    "PM Modi holds meeting with Japanese counterpart Kishida",
    "The making of Vande Bharat trains",
    "Telangana can now build a city as big as Hyderabad next to it",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table updated after KKR vs LSG: Lucknow qualifies for Playoffs with one-run win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]