[
    "As vigilante groups thrive, interfaith couples try to survive",
    "World Test Championship final: Rohit Sharma’s India chases elusive glory in Oval showdown",
    "Puff the magic dragon: the myth of ‘safe’ e-cigarettes",
    "The big, booming business of child-bride trafficking in Gujarat",
    "Watch | The Telangana story, as told by The Hindu’s reporters",
    "Allahabad HC verifies whether rape victim is ‘mangalik’ as accused denies marriage on this ground",
    "Turkey’s Erdogan takes oath of office, ushering in his third Presidential term",
    "Odisha train accident | Ringing mobile phones help relatives find injured kin",
    "Reset time: On GST revenue growth",
    "The current revenue trajectory presents an opportunity to fix GST’s flaws",
    "Good and bad: On India and artificial intelligence",
    "India needs to harness the benefits of AI while avoiding adverse effects",
    "IndiaMural in new Parliament shows Ashoka empire: Government",
    "Data\nData | Clean energy funds rise, but mostly in China, Europe, U.S.",
    "World\nIndia-Nepal ties | The HITs and misses of PM Prachanda’s visit",
    "Life & StyleCyrus Broacha explains why men thought of the concept of marriage",
    "Movies\n‘Taj: Reign of Revenge’ series review: Mughal succession drama creaks and crumbles",
    "Comment\nChennai’s most famous adopted son will live on for eternity",
    "A critical juncture in Manipur",
    "International trade has a carbon problem",
    "Recasting the discourse on Muslim education",
    "Central Asian foreign policy multi-vectorism pays off",
    "Is there a clear north-south divide in Indian politics?",
    "Chennai’s most famous adopted son will live on for eternity",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Balasore train accident | Death toll increases to 261, many injured",
    "Pakistan hands over 200 Indian fishermen at Attari-Wagah border",
    "Govt. wants to make sedition law more draconian: Congress",
    "Intas gets USFDA ‘Import Alert’ but allowed to supply 24 critical drugs",
    "Sanjay Varma takes charge as MD of MRPL",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Thailand Open 2023: Lakshya Sen makes semifinals, Kiran George out",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]