[
    "Astronomers find new clue about mysterious radio flashes in space",
    "Industrial investments: The Kerala story",
    "A ‘middle kingdom’ dawns on India’s west",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "PM Modi lauds presence of ruling, Opposition members at Indian community event in Australia",
    "Gangster Lawrence Bishnoi shifted to Delhi's Mandoli Jail",
    "Dubai-bound IndiGo flight suffers bird hit at Mangaluru International Airport, aborts take-off",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Was the President invited, asks the plea",
    "Another 2 cheetah cubs born in Kuno National Park die from \"apparent dehydration and weakness\"",
    "DGCA asks Go First to submit a revival plan within 30 days",
    "Final call on Asia Cup venue to be taken after IPL final, says BCCI secretary Jay Shah",
    "2023-05-25T18:36:46+05:30\n-\nOther States\nArvind Kejriwal meets Sharad Pawar in Mumbai",
    "2023-05-25T17:33:56+05:30\n-\nMarkets\nRupee falls 7 paise to close at 82.75 against U.S. dollar",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "The Narendra Modi visit to Australia adds to the bipartisan strength of growing bonds",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Republicans should not put partisan goals ahead of the greater public good",
    "Movies\nWhere are the writers in Kannada cinema?",
    "HyderabadMan dies of ‘heart attack’ soon after his daughter’s wedding at marriage hall",
    "Movies\nDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "Science\nSci-Five | The Hindu Science quiz: On migrating birds",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "Environment\nBrazil builds 'rings of carbon dioxide' to simulate climate change in the Amazon",
    "Music\nTina Turner: five favourite songs",
    "Movies‘The Wheel Of Time’ gets season 2 premiere date",
    "Tamil Nadu\n‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "After Karnataka, more lessons for the BJP",
    "The fundamental value of the rupee",
    "The paradox of BRICS, its new pathway",
    "Redrawing the poll strategy in Bihar",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "How to text someone on WhatsApp without saving their number on your device",
    "New Parliament building opening | How a letter to PMO set off a search for the Sengol",
    "19 Opposition parties, including Congress, to boycott inauguration of new Parliament building",
    "Fear of flooding forces Bengaluru techie to leave ₹1.08 crore villa and cough up rent in lakhs",
    "Stocks to watch out today — May 25, 2023",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]