[
    "A journey with migrants on an unreserved coach of the Coromandel Express",
    "Data | Parsing the inflation story of the past year",
    "Explained | What is transcranial magnetic stimulation?",
    "India’s Test losses: a result of stereotypes and the quest for balance",
    "Armed drone deal with U.S. firm likely to be announced during PM’s visit",
    "Karnataka to scrap anti-conversion law, reverse textbook changes",
    "Cyclone Biparjoy | PM Modi speaks to Gujarat CM after cyclone landfall",
    "South Manipur cut off as women-led vigilante groups block arterial roads",
    "80 castes to be added to Central OBC list",
    "Madras HC allows arrested Senthilbalaji to shift to private hospital",
    "2023-06-16T03:23:00+05:30\n-\nOther States\nNashik police probing why lynching victim bought cattle",
    "2023-06-16T03:00:00+05:30\n-\nCricket\nCummins backs Warner to come good against Ashes nemesis Broad",
    "2023-06-16T02:17:00+05:30\n-\nOther States\nBonding with Fadnavis as firm as Fevicol: Shinde",
    "Code red: On the 22nd Law Commission and a uniform civil code",
    "The push for a uniform civil code should not become a divisive tool",
    "Culture shift: On the U.S.’s UNESCO re-entry",
    "UNESCO must get strict with nations exiting and re-entering on frivolous grounds",
    "Cricket\nHaving been a fine batter, maybe I should have never become a bowler: Ashwin",
    "PodcastIs the Indian Railways stretched beyond its capacity? | The Hindu Parley Podcast",
    "Movies\n‘The Flash’ movie review: Imperfect yet scintillating spectacle to end the DCEU storyline",
    "Movies\n‘Extraction 2’ movie review: Chris Hemsworth ups the ante in blazing, action-fuelled sequel",
    "Movies\n‘Jee Karda’ series review: Tamannaah Bhatia anchors a glib affair",
    "Tamil NaduLetter alerting British military about Marudu brothers’ Srirangam declaration discovered",
    "MoviesGuillermo del Toro states five of his projects have been turned down in the last two months",
    "Movies\n'The Penguin' and 'Daredevil: Born Again' stop productions due to writers' strike",
    "Reflections on Artificial Intelligence, as friend or foe",
    "A media war with no winners",
    "Is the Indian Railways stretched beyond its capacity?",
    "Green Humour by Rohan Chakravarty",
    "Jumpstarting the next phase of U.S.-India defence ties",
    "Strengthening the Integrated Child Development Services scheme",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "HC directs two Delhi Police officers to plant 100 trees after altercation with lawyer",
    "CET 2023 result announced in Karnataka",
    "Broadcom set to win EU nod for $61-bn VMware deal, sources say",
    "Nifty prediction today – June 15, 2023: Bulls charging ahead",
    "US Fed keeps rates unchanged but signals two more potential hikes this year",
    "1948: Assassination of Mahatma Gandhi",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "Asia Cup 2023 dates: Matches start on August 31; Four in Pakistan, nine in Sri Lanka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]