[
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Data | Another tiger from Madras: The rise and rise of D. Gukesh",
    "Manipur Governor meets Shah; Kuki groups reject CM’s outreach bid",
    "Rahul to visit Manipur on June 29, 30",
    "Elections to 10 Rajya Sabha seats on July 24",
    "Centre allows Aadhaar authentication for registration for births and deaths",
    "New deadline for Aadhaar-based rural jobs scheme wages",
    "White House, MEA decline to comment on Obama interview",
    "Centre planning new Bill on stray dog issue",
    "2023-06-28T11:41:23+05:30\n-\nTechnology\nMeta Quest+ VR subscription service launched",
    "2023-06-28T11:28:25+05:30\n-\nMarkets\nRupee gains 5 paise to 81.97 against U.S. dollar",
    "2023-06-28T11:22:56+05:30\n-\nMarkets\nSensex, Nifty touch all-time high levels in early trade",
    "2023-06-28T10:24:24+05:30\n-\nWorld\nCanada to introduce new work permit for U.S. H-1B visa holders",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Podcast\nThe meaning of the Wagner Group’s march | The Hindu In Focus Podcast",
    "EntertainmentActor Julian Sands died while hiking on California mountain, authorities confirm",
    "Kerala\nDelving into the curious world of insects through brushstrokes",
    "India\nSeven products from U.P. get GI tag",
    "Other Sports\nParalympic champion Krishna Nagar trains his sights on Paris 2024 qualification",
    "CricketChepauk loses out as ODI World Cup semifinal goes to Eden Gardens",
    "Chennai\nPolicing in Chennai goes hi-tech with GIS mapping, analytics of crime zones",
    "Internet\nFlipkart to let people exchange defunct electronic items for new products",
    "MoviesTamannaah Bhatia on ‘Jailer’, ‘Jee Karda’, ‘Lust Stories 2’ and Vijay Varma",
    "Internet\nTelegram to launch Stories in July",
    "Tracing the arc of American ‘exception-ism’ for India",
    "A row over rice in Karnataka",
    "A model for quality and inclusive education",
    "Reduced ceiling, increased anger",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "FeaturedPride Month | Lesbians through the looking glassMoviesTamma MokshaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Centre will ensure execution of SoO pact with Kuki groups, says Amit Shah",
    "2019 MBBS batch will be the first batch to shift to NExT pattern",
    "India has to do lot of homework to compete with China in mobile manufacturing: Yuqing Xing",
    "India’s current account deficit narrows to 0.2% of GDP on moderation in trade deficit",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "ICC ODI World Cup 2023 schedule: Full list of matches, dates, venues, timings",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]