[
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "Explained | Abaucin, the potential new antibiotic found with machine-learning",
    "How the old found sanctuary and the new blossomed in CSK",
    "75 years of peacekeeping: India’s contribution to U.N.’s peace missions",
    "Nine years of BJP rule dedicated to people’s welfare, good governance: PM Modi",
    "PM Modi among those who think they know more than God, Rahul says at event in the U.S.",
    "India’s GDP expanded 6.1% in 2022-23’s last quarter",
    "16 parties confirm participation for the June 12 Opposition meet",
    "Eastern Ladakh row | India, China agree to hold next round of military talks soon",
    "Centre to provide air connectivity for Manipur’s hill areas",
    "NIA raids premises linked to PFI supporters in 3 States",
    "2023-06-01T10:02:30+05:30\n-\nTechnology\nEU tech chief sees draft voluntary AI code within weeks",
    "2023-06-01T09:22:25+05:30\n-\nIndia\nDaily Quiz | On clock towers from across the world",
    "Uncertain showers: On monsoon information and the Indian farmer",
    "Farmers need to be given timely, accurate information on rainfall",
    "Status quo in Turkey: On the new term for Recep Tayyip Erdoğan",
    "Erdogan must right the wrongs of the past and offer a new inclusive beginning",
    "Movies\nFrom ‘Lagaan’ to ‘Pathaan’: How YRF’s Sherry Bharda changed visual effects",
    "Technology\nXiaomi aims export and localised component manufacturing with Dixon in India",
    "Kerala\nA woman police officer in Kerala who fought many battles for gender equality",
    "India\nDaily Quiz | On Chief Ministers",
    "Karnataka\nMiraculous escape from cobra",
    "TechnologyHow to block ads in Chrome browser",
    "Internet\nHow to post your voice as a status update on WhatsApp",
    "A parliamentary democracy or an executive democracy",
    "In Bengal, court orders dominate politics",
    "Is India missing the graphene bus?",
    "Rethinking alliances in Andhra",
    "Biodiversity is us and we are biodiversity",
    "Using Buddhism as a tool of soft power",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "Adani Transmission Q4 net profit jumps 85% to ₹439.60 crore",
    "Wrestlers’ protest | Naresh Tikait announces mahapanchayat in Muzaffarnagar on June 1",
    "Martin Scorsese meets Pope Francis, announces film about Jesus",
    "Wrestlers defer plan to immerse medals",
    "Yes Bank unveils new brand logo",
    "Adani Transmission, Adani Total Gas shares slump on MSCI exit",
    "1947 ‘sengol’ story just fiction based on manufactured lies: N. Ram",
    "What is really behind the violence in Manipur?",
    "UWW condemns wrestlers’ detention, threatens suspension of WFI",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]