[
    "Lessons from cricket about the mind’s experience of time",
    "Explained | The problem with India’s new guidelines on genetically modified insects",
    "A row over rice in Karnataka",
    "There was lightning in your kitchen today. Did you see?",
    "India ranked 67th on Energy Transition Index, Sweden on top: WEF",
    "Youths clash with police near Paris after teenager shot dead in traffic stop",
    "Days after the Wagner mutiny, the spectres of ‘Black Saturday’ continue to haunt Russians",
    "TAPAS 201 UAV ready for user trials, says DRDO",
    "Canada to introduce new work permit for U.S. H-1B visa holders",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Bengaluru\nFrom Plates to Pals: The Koramangala Lunch Group’s 7-year weekly ritual",
    "ScienceThe Science Quiz | The Fibonacci series",
    "Science\nNASA sees moon lunar mining trial within the next decade",
    "Music\nHow abuse and rejection led trans-woman Manjamma to seek refuge in Jogathi Nritya",
    "Karnataka\nTranswomen turn entrepreneurs following training by NGO",
    "EnvironmentSri Lanka scraps proposal to export monkeys to China",
    "Entertainment\nActor Julian Sands died while hiking on California mountain, authorities confirm",
    "Gadgets\nInsta360 Go 3 launches compact action camera",
    "PodcastThe meaning of the Wagner Group’s march | The Hindu In Focus Podcast",
    "Technology\nGoogle misled advertisers about video ads; did not meet quality standards: Report",
    "Tracing the arc of American ‘exception-ism’ for India",
    "A model for quality and inclusive education",
    "Reduced ceiling, increased anger",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "There are houses for rent in Bengaluru, but too many conditions apply",
    "Explained | Understanding the Wagner mutiny",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "India has to do lot of homework to compete with China in mobile manufacturing: Yuqing Xing",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "What is really behind the violence in Manipur?",
    "Marginalisation of Kukis the main reason behind Manipur violence",
    "ICC ODI World Cup 2023 schedule: Full list of matches, dates, venues, timings",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]