[
    "TB testing stuck in the previous century, and waiting for change",
    "Inside Jharkhand’s single-teacher schools",
    "Substance abuse in Kerala | On a high, at a social cost",
    "Telangana Spotlight | Not the end of the road",
    "CBI issues summons to Abhishek Banerjee in WB school job scam",
    "SC defers scientific survey to determine age of 'Shivling' found at Gyanvapi mosque",
    "PM Modi arrives in Hiroshima for G7 and Quad summits",
    "₹2,000 notes to be withdrawn from circulation, can be exchanged, deposited till Sept. 30",
    "Siddaramaiah, DKS in Delhi to discuss Cabinet formation, allocation of portfolios",
    "Annual spends upto ₹7 lakh exempted from tax on forex spends",
    "SEBI probe into Adani drew a blank: Supreme Court-appointed panel",
    "2023-05-19T20:24:22+05:30\n-\nIndia\nRailways to operate 380 special trains to deal with holiday rush",
    "2023-05-19T20:01:22+05:30\n-\nEconomy\nAnnual spends upto ₹7 lakh exempted from tax on forex spends",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "The Congress must demonstrate the success of its inclusive vision in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "India must invest in infrastructure that boosts defence against disasters",
    "Movies\n‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "MoviesCannes 2023: Aishwarya Rai Bachchan stuns in silver Sophie Couture gown",
    "Gadgets\nXiaomi launches Redmi A2 and A2 Plus smartphones into entry segment",
    "Hyderabad Eight-year-old boy mauled to death by stray dogs in Telangana’s Kazipet",
    "Movies\nHow Hollywood finally cracked the video game adaptation",
    "MoviesCannes 2023: India’s twin wins at the Oscars show we always dream big, says Khushbu",
    "Movies\nRajinikanth announces Kapil Dev’s cameo in ‘Lal Salaam’",
    "A long-drawn test for India’s diplomatic skills",
    "Explained | What are RBI regulations on green deposits?",
    "‘Three capitals’ in Andhra Pradesh",
    "Can an integrated system of medicine work?",
    "Money is about more than just survival",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "Timely caution: On the Supreme Court’s exhortation to the Enforcement Directorate",
    "Probe involvement of 2 radical Meitei groups in Manipur pogrom: tribal student bodies",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "383 girls and women missing from Mumbai in 3 months, show police data",
    "Pichai sells Chennai home where Sundar grew up",
    "Telangana Cabinet to withdraw the GO 111",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]