[
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Data | Another tiger from Madras: The rise and rise of D. Gukesh",
    "CAD narrows to 0.2% of GDP in Q4 FY23 on lower trade deficit, higher services exports",
    "Go First cancels all flights until June 30",
    "PCB unsure but ICC ‘confident’ Pakistan will travel to India for ODI World Cup",
    "Biennial polls to Rajya Sabha seats on July 24; Jaishankar, O'Brien among those retiring",
    "Putin says Russia paid $1 bn to Wagner group over last year",
    "PM’s pitch for UCC is along the same lines as Centre’s affidavit in Supreme Court",
    "Kerala has received 65% deficit rainfall so far during monsoon: IMD",
    "2023-06-27T21:02:12+05:30\n-\nIndia\n2019 MBBS batch will be the first batch to shift to NExT pattern",
    "A grand revival: on India-Egypt ties",
    "India and Egypt have re-established close ties in recent years",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Valdimir Putin should bring the war to an end for stability at home",
    "Internet\nFlipkart to let people exchange defunct electronic items for new products",
    "MoviesTamannaah Bhatia on ‘Jailer’, ‘Jee Karda’, ‘Lust Stories 2’ and Vijay Varma",
    "Internet\nTelegram to launch Stories in July",
    "Movies\nPride Month | Lesbians through the looking glass",
    "India\nEPFO extends deadline to apply for higher pension till July 11",
    "WorldDeepavali to be school holiday in New York City",
    "Coimbatore\nKamal Haasan gifts car to Coimbatore’s first woman bus driver",
    "Technology\nWhat happens when social media firms monetise key features?",
    "Internet\nFive points to keep personal data safe in Android smartphones",
    "The main chapter of how Hindutva sees the past",
    "A man of the times and ahead of it",
    "Reduced ceiling, increased anger",
    "Manipur — this is not a time for finger-pointing",
    "Laying the foundation for a future-ready digital India",
    "Joining the hunt: India and the Artemis Accords",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "Tenets of unity: On the Opposition meet in Patna",
    "Explained | Understanding the Wagner mutiny",
    "NMC withdraws Graduate Medical Education Regulations, 2023",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "HAL board to mull stock split",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "ICC ODI World Cup 2023 schedule: Full list of matches, dates, venues, timings",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]