[
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Political Line | Saffron designs for 2024",
    "Menstrual health is a public health issue",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "Wrestlers yet to meet after release from police detention, will soon contemplate next move",
    "Lone Congress MLA in Bengal defects to Trinamool, three months after victory",
    "ISRO’s GSLV-F12 successfully places navigation satellite NVS-01 into intended orbit",
    "16-year-old stabbed to death by boyfriend in Delhi, accused arrested",
    "Hawk aircraft deal | CBI registers case against Rolls Royce in alleged corruption case",
    "Terror funding case | Delhi HC issues notice to Yasin Malik on NIA plea seeking his death penalty",
    "2023-05-29T17:57:54+05:30\n-\nDelhi\nRain, overcast skies in Delhi; heat wave unlikely till June 4",
    "Alarming turn: On the situation in Manipur",
    "A return to normalcy in Manipur requires concerted action by government and civil society",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Women in civil service have a challenging and exciting task before them",
    "Podcast\nWhat lies behind India’s missing wombs problem? | In Focus podcast",
    "WorldNepal honours Sherpa guides, climbers to mark 70th anniversary of Mount Everest conquest",
    "Music\nDaily Quiz | On life and works of American singer Tina Turner",
    "Other States\nDecorated American officer’s last remains to head home from Darjeeling after 58 years",
    "Technology\nCan China’s Micron ban benefit Samsung and SK Hynix?",
    "WorldRecep Tayyip Erdogan | Turkey’s republican monarch",
    "Tamil Nadu\nBitten by snake, tribal girl carried on foot to Anaicut hospital, dies on the way",
    "Technology\nA lawyer uses ChatGPT for research, cites non-existent cases",
    "IndiaAn opulent House: art lines ₹200-crore interiors",
    "Science\nA Foucault pendulum swings inside the new Parliament",
    "A belligerence towards Beijing that is unsettling",
    "On the Draw — May 29, 2023",
    "At Hiroshima, Japan’s moment to reinforce partnerships",
    "A fountainhead of the people’s hopes and aspirations",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Only six religion options make it to next Census form",
    "A new House, again in red sandstone",
    "Annadurai questioned the motive behind head of mutt giving Sengol to Nehru",
    "Recep Tayyip Erdogan wins historic Turkey runoff vote",
    "New parliament building: Here’s a timeline, costs incurred and more",
    "Know your minister: A look at the 24 MLAs sworn in to the Karnataka cabinet today",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]