[
    "Political Line | When Modi goes to Atmanirbhar America",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Humans’ groundwater extraction has affected the earth’s rotation: study",
    "Kukis | Fight for land and identity",
    "Manipur CM asks Mizoram counterpart to protect Meiteis; BJP MLAs in New Delhi to meet PM",
    "Mizoram bears burden of drug trade after unrest in Manipur",
    "Cyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Bengal panchayat polls | SC to hear plea against deployment of Central forces on June 20",
    "Wanted in India, Khalistan Tiger Force chief Hardeep Singh Nijjar shot dead in Canada",
    "Heavy overnight rains lash many parts of Chennai and neighbouring districts",
    "2023-06-19T15:24:43+05:30\n-\nSport\nWatch | What is the sport of Padel?",
    "2023-06-19T14:21:17+05:30\n-\nIndia\nIPS officer Ravi Sinha appointed RAW chief",
    "Preparedness pays off: On Cyclone Biparjoy",
    "Massacre of innocents: On the attack on a school on the Uganda-Congo border",
    "Uganda and Congo must do more against Islamist militants",
    "Tamil Nadu\nFrom Kanniyakumari to California: Puppet artiste to perform in the U.S.",
    "Tamil NaduVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Tamil Nadu\n‘Tamil Nadu’ | On the wrong side of history and law: a fraud exposed",
    "Movies\nNoted cinematographer Navroze Contractor killed in a bike accident",
    "Technology\nExplained | How do Telegram bots function?",
    "Movies‘Adipurush’ dialogue writer says they will revise dialogues that hurt sentiments",
    "Technology\nElon Musk confirms Twitter video app for smart TVs",
    "Technology\nApple iPhone 15 Pro models may get massive price hike",
    "IndiaUniform Civil Code | What is the Law Commission’s new move ?",
    "Society\nIndia | How queer are our public spaces?",
    "What Indians should be saying to the U.S. on June 21",
    "T.N. Minister Senthilbalaji arrest | A case of propriety versus politics",
    "Emerging challenges to the Dravidian model",
    "Indian students must be taught that doing is the new learning",
    "Responsibility and the complexities of climate leadership",
    "The path to a new and imminent U.S.-Iran nuclear deal",
    "Explained | If Betelgeuse goes supernova, what would it look like?",
    "Explained | How do Telegram bots function?",
    "Explained | How can India tackle its diabetes burden?",
    "Explained | What is the India, U.S. initiative on future tech?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why the traffic is no longer an issue in Bengaluru",
    "RPower settles ₹925-cr debt of UP unit with funds from Varde Partners",
    "Direct tax collection in April 1-June 17 rises 12.7%",
    "What is really behind the violence in Manipur?",
    "Why Pali lost out and Sanskrit received more than its due",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]