[
    "Kerala’s troublemaking tusker Arikompan still comes for rice",
    "A fountainhead of the people’s hopes and aspirations",
    "Sedition and its roots in rudeness as an offence",
    "When Roman merchants and soldiers came to Madurai to trade in pepper",
    "ED attaches properties of Udhayanidhi Stalin Foundation",
    "Congress questions government on country’s economic health, national security",
    "PM Modi chairs NITI Aayog’s eighth Governing Council meet",
    "Army Chief in Manipur, to review situation on ground",
    "Army, Assam Rifles launch multiple search operations to track down armed insurgents",
    "96 years on, a new Parliament for India",
    "Karnataka Cabinet expansion | 24 legislators take oath as Ministers",
    "U.K.-India ties see thaw with Minister Tariq Ahmad’s visit",
    "2023-05-27T21:25:01+05:30\n-\nIndia\nOnly 9 out of 25 High Courts live stream proceedings",
    "2023-05-27T21:07:36+05:30\n-\nIndia\nU.K.-India ties see thaw with Minister Tariq Ahmad’s visit",
    "A younger lot: On the 2023 French Open",
    "Without Nadal, there is no clear favourite at Roland-Garros",
    "Mob and justice: On the Alwar lynching case verdict",
    "Alwar verdict flags need for stern steps to ensure justice in lynching cases",
    "India\nIn Frames | First look of new Parliament building to be inaugurated on May 28",
    "India‘Souvenirs recorded Thiruvavaduthurai Adheenam’s handover of sceptre to Mountbatten’",
    "Gadgets\nVivo X90 Review | The power and performance of Pro",
    "Videos\nPM Modi in Australia | Do diaspora issues overshadow bilateral ties?",
    "Kerala\nTo sir, with love: from Kerala to Bhutan",
    "Movies\n‘Beau Is Afraid’ movie review: Ari Aster’s third film feels like a three-hour panic attack",
    "Understanding history is inevitable",
    "Industrial investments: The Kerala story",
    "Should States revert to the Old Pension Scheme?",
    "Economics that looks at lower half of the pyramid",
    "Brass is copper and zinc, but better. How?",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Only six religion options make it to next Census form",
    "Temporary employment of Praveen Nettaru’s wife in Chief Minister Office withdrawn with others",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Sengol | Evidence thin on government’s claims about the sceptre",
    "India to push back against 'agenda-driven' global ranking firms: Sanjeev Sanyal",
    "RBI imposes ₹84.50 lakh penalty on Central Bank of India",
    "No, Nehru did not mishandle Kashmir",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]