[
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "NCP split a reminder of succession battles in regional parties",
    "New Supreme Court order puts Nepal one step closer to marriage equality",
    "The ‘Anna Bhagya’ fiasco and thinking beyond rice",
    "West Bengal panchayat elections: repolling begins in 696 booths across 18 districts",
    "Kerala to decide on holding socio-economic caste census to include more castes on OBC list",
    "SC Collegium reconsiders transfer of judge to M.P. HC, shifts him to Telangana",
    "Objections overruled, Forest Bill goes to House unchanged",
    "16 killed as heavy rain triggers landslips, floods in North India",
    "Indian shuttler Lakshya Sen wins Canada Open 2023",
    "Army officers say Army faces challenges in Manipur without AFSPA",
    "2023-07-10T10:37:27+05:30\n-\nWorld\nChina calls on U.S. to take 'practical actions' over sanctions",
    "2023-07-10T10:20:57+05:30\n-\nMarkets\nRupee rises 6 paise to 82.55 against U.S. dollar",
    "Dangerously fanciful: On the judiciary, Rahul Gandhi’s conviction and the defamation case",
    "The High Court has made defamation sound like a horrific crime",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "The U.S. decision to send cluster munitions to Ukraine blurs all moral lines",
    "World\nSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "EnvironmentIn Varanasi, turtles help clean the Ganga",
    "Tamil Nadu\n‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "Visakhapatnam\nAyurvedic education system faces neglect in Andhra Pradesh and Telangana",
    "Technology\nComedian and authors sue Meta, OpenAI for copyright infringement",
    "Kerala\nHardly any captive elephant in Kerala has a non-Hindu name",
    "TechnologyExplained | What should you know about Meta’s social media app Threads?",
    "Society\nNikita Sonavane: justice for all",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "On the draw — July 9, 2023",
    "Restoring the World Trade Organization’s crown jewel",
    "Due process clause or basic structure doctrine?",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | Why is China limiting exports of raw materials?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Pro-Khalistan protest outside Indian High Commission passes off without incident",
    "Financial due diligence underway at IDBI Bank",
    "Govt asks Google, FB, Microsoft, others to remove Blue Whale links",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Canada Open 2023: Lakshya Sen beats Shi Feng in final",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]