[
    "Amid Centre’s Tamil outreach, historical claims come under scrutiny",
    "Astronomers find new clue about mysterious radio flashes in space",
    "Industrial investments: The Kerala story",
    "A ‘middle kingdom’ dawns on India’s west",
    "New committee set up to oversee cheetah project",
    "Shah to visit Manipur soon to hold talks to restore peace",
    "Bournvita maker defends sugar content, says marketing is legal",
    "Sengol | Evidence thin on govt’s claims about the sceptre",
    "China constructing model villages opposite the LAC, say sources",
    "All-in-one policy plan to spread insurance in India",
    "Car crashes into London’s Downing Street gates, one arrested: Police",
    "2023-05-26T02:43:43+05:30\n-\nIndia\nCentre expects record production of rice, wheat",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Podcast\nShould States revert to the Old Pension Scheme? | The Hindu Parley Podcast",
    "AthleticsFor Neeraj Chopra, breaching the 90m is a target, not an obsession",
    "Tamil Nadu\nWhen Roman merchants and soldiers came to Madurai to trade in pepper",
    "Movies\nWhere are the writers in Kannada cinema?",
    "Tamil Nadu\nJallikattu — continuity of a tradition from Indus Valley to Keezhadi",
    "ScienceSci-Five | The Hindu Science quiz: On migrating birds",
    "Movies\nDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "Environment\nBrazil builds 'rings of carbon dioxide' to simulate climate change in the Amazon",
    "An ordinance, its constitutionality, and scrutiny",
    "Understanding history is inevitable",
    "Should States revert to the Old Pension Scheme?",
    "The fundamental value of the rupee",
    "Economics that looks at lower half of the pyramid",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Colombia-Panama border hit by 6.6-magnitude earthquake",
    "The Sengol — A historic sceptre with a deep Tamil Nadu connection",
    "AAP's Satyendar Jain collapses in Tihar Jail, shifted to ICU",
    "India is “absolutely” on Musk’s radar for setting up Tesla EV manufacturing unit",
    "Impact of election results to go beyond electoral politics in Karnataka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]