[
    "Kohli and Root — two contemporary greats and their different approaches",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "PM Modi raises concerns over attacks on temples in Australia with Anthony Albanese",
    "Update NPR to enumerate self during next Census",
    "IPL 2023 | I have 8-9 months to decide: Dhoni on retirement after CSK reaches 10th final",
    "19 Opposition parties to boycott inauguration of new Parliament building",
    "U.T. Khader unanimously elected Speaker of Karnataka Legislative Assembly",
    "2023-05-24T13:47:35+05:30\n-\nOther States\nAssam and Meghalaya CMs to discuss border disputes",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "The Congress in Karnataka must now focus on governance",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "FoodDaily Quiz | On mangoes",
    "Economy\nExchange of ₹2,000 notes | Small queues, confusion on Day 1",
    "Science\nThe Science Quiz | On the abyssal zone",
    "Athletics\nThe individual 400m win at London meant the world to me: Sanya Richards-Ross",
    "IndiaThe View From India | The importance of Modi’s Indo-Pacific Tour",
    "Movies\n‘Sirf Ek Bandaa Kaafi Hai’ movie review: Manoj Bajpayee steps up in court",
    "Gadgets\nMotorola launches Edge 40 with 144Hz refresh rate",
    "Technology\nHow to get the best out of a free audio transcription service",
    "Justice that also makes space for the animal world",
    "Redrawing the poll strategy in Bihar",
    "The paradox of BRICS, its new pathway",
    "It’s time to ensure safer skies",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedFilmi-ness: Kunal Basu on writing and cinema MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "16 new Karnataka MLAs skip oath-taking at Legislative Assembly",
    "How to text someone on WhatsApp without saving their number on your device",
    "PM Modi meets prominent Australian business leaders in Sydney; invites investments in India",
    "Wrestlers accept Brij Bhushan’s demand for a narco test under Supreme Court supervision",
    "Cotton prices crash as farmers release held back stocks",
    "Hindenburg saga: Four FPIs under SEBI scanner for Adani share price crash",
    "Failed ideas of Jawaharlal Nehru",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]