[
    "India\nAdipurush kicks off political storm; Chhattisgarh ready to ban film on public demand",
    "Environment\nElephant highway under threat at Anaikatti near Tamil Nadu-Kerala border",
    "AuthorsFor Hindutva, only the Hindu past is relevant, says Romila Thapar",
    "India\nMeghalaya’s new attendance app keeps proxy teachers away",
    "Manipur relief camps | From one eruption to another, day and night spread equal dread",
    "NIA takes over probe into attacks on Indian Missions in U.S., Canada",
    "Railways to review operations, to ensure ‘zero compromise’ on safety",
    "At least 41 killed in rebel attack on Ugandan school near Congo border",
    "2023-06-17T21:59:14+05:30\n-\nWorld\nSaudi Foreign Minister arrives in Tehran amid rapprochement",
    "India\nNandi on Sengol inspired by royal symbol of Nolamba Pallavas: researcher",
    "ScienceChandrayaan-3 | ISRO’s Space Physics Laboratory gears up for big moment",
    "Movies\nVijay meets and honours students; speech goes viral",
    "Movies\nDavid Attenborough’s ‘Our Planet II’ is a visual delight despite its sobering message",
    "Movies\n‘Black Mirror’ Season 6 review: Disturbing, disquieting, delicious",
    "Movies‘Shaitan’ web series review: Blood, gore and survival",
    "Tiruchirapalli\nNarikuravar teen from village in Perambalur district clears NEET",
    "Movies\n‘Bommai’ movie review: A fantastic SJ Suryah can’t save this mediocre story",
    "MusicGrammys: Only 'human creators' eligible to win, recording academy says response to AI",
    "Life & Style\nManga and anime characters speak Malayalam, thanks to enthusiasts in Kerala",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Lulu Group opens its first project in T.N.",
    "American chipmaker Micron mulls large investment in India: source",
    "In the aftermath of cyclone Biparjoy, Gujarat grapples with destruction",
    "Daniel Ellsberg, who leaked Pentagon Papers exposing Vietnam War secrets, dies at 92",
    "National Pension System: From government employees to all citizens",
    "Tamil Nadu’s EV manufacturing investments crosses ₹40,000 crore",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "Having been such a fine batter, maybe I should have never become a bowler: Ashwin",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]