[
    "When Roman merchants and soldiers came to Madurai to trade in pepper",
    "Data | One in seven Indian primary schools run by a lone teacher",
    "Twin reservoirs of Hyderabad shrivel in realty storm",
    "Systematic incitement plan in Maharashtra",
    "Nine years of Modi government | Congress asks PM nine questions",
    "PM Modi to launch special ₹75 coin to mark inauguration of new Parliament",
    "Income Tax dept. searches premises linked to Tamil Nadu Minister Senthilbalaji",
    "New Parliament building will make every Indian proud, says PM Modi",
    "SC rejects plea for inauguration of new Parliament building by President Murmu",
    "UPSC contemplates criminal action against two candidates for claiming selection in civil services",
    "NEET-UG to be held on any date between June 3-5; CUET-UG from June 5-8 in Manipur",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Science\nNavy, ISRO release training plan for Gaganyaan crew module",
    "Movies‘Beau Is Afraid’ movie review: Ari Aster’s third film feels like a three-hour panic attack",
    "India\nSengol | Evidence thin on govt’s claims about the sceptre",
    "TechnologyYouTube is removing Stories to focus on Shorts, long-form, and lives",
    "An ordinance, its constitutionality, and scrutiny",
    "Understanding history is inevitable",
    "Should States revert to the Old Pension Scheme?",
    "Green Humour by Rohan Chakravarty",
    "Economics that looks at lower half of the pyramid",
    "Industrial investments: The Kerala story",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Sengol | Evidence thin on government’s claims about the sceptre",
    "All-in-one policy plan to spread insurance in India",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Stocks that will see action on May 26, 2023",
    "Dairy war: Now, Tamil Nadu wants Amul to stop tapping Aavin milkshed area",
    "No, Nehru did not mishandle Kashmir",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]