[
    "History & Culture\nThe naked philosophers: the reason some Indian ascetics renounced their robes",
    "Society\nSatire | SOPEE for the airborne Indian male",
    "EconomyExplained | Will all overseas spends come under the tax net?",
    "Music\nFair play, fair pay: The Indian music industry and royalties",
    "No identity proof needed to exchange ₹2,000 notes: SBI",
    "Russia-Ukraine crisis an issue of humanity: PM Modi at G7 session",
    "Nitish Kumar meets Kejriwal after Congress' snub to AAP leader",
    "Uttar Pradesh’s nursing crisis, and what the State is doing to mitigate the shortage",
    "2023-05-21T14:19:12+05:30\n-\nNews\nNo identity proof needed to exchange ₹2,000 notes: SBI",
    "Movies\nVeteran actor Kamal Haasan to be felicitated at IIFA 2023",
    "PhotosIn Frames | Turkey at a crossroads",
    "Luxury\nWhy quiet luxury in India is not quiet",
    "Health\nExplained | What is WHO’s advice on non-sugar sweeteners?",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "Tamil Nadu\nExplained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "WorldNorth-South Transport Corridor | Connecting continents",
    "Technology\nLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "383 girls and women missing from Mumbai in 3 months, show police data",
    "Science for All | What is the Petermann Glacier?",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "Unhappy with tussle in Congress, Jat leader Subhash Maharia rejoins BJP",
    "The making of Vande Bharat trains",
    "₹2,000 note will continue to be legal tender post-Sept 30, govt clarifies",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table updated after KKR vs LSG: Lucknow qualifies for Playoffs with one-run win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]