[
    "Uniform Civil Code and the infinite variety of custom",
    "Spotlight | Are women paying the price as work shifts back to office space?",
    "Moon, Mars and beyond: the UAE makes an ambitious foray into space",
    "Third LIGO will put India on the research map",
    "Gita Press a living faith, no less than a temple, says PM Modi",
    "Balasore train accident | CBI makes first arrests, three railway staff held",
    "Ajit Pawar’s faction brushes off NCP working committee decision",
    "Centre holds back-door talks with Kuki groups in New Delhi",
    "West Bengal panchayat polls | Voting begins for 73,000 seats",
    "Rahul defamation case | How definite is ‘Modi’ as a ‘collection of persons’?",
    "Visva-Bharati calls Amartya Sen ‘a migrant traveller’",
    "2023-07-08T04:26:00+05:30\n-\nWorld\nAIIB says internal review found 'no evidence' of China influence",
    "Ominous signs: On attacks by pro-Khalistan elements on Indian interests",
    "India must calibrate its public diplomacy on Khalistan issue to better effect",
    "Truce treaty: On brokering peace in the Congress in Rajasthan",
    "The Congress seems to have bought peace in Rajasthan by taking Pilot on board",
    "WorldSCO Summit | Missed opportunity for India?",
    "Technology\nRobots say they won’t steal jobs, rebel against humans",
    "India\nWatch | Fault lines in the Opposition unity",
    "Industry\nMcDonald’s India franchisee puts tomato off the menu amid price rise",
    "Movies‘Sweet Kaaram Coffee’ review: A feel-good series on soul-searching and introspection",
    "KochiManchester City fans in Kerala on a high as club announces ‘Treble Trophy Tour’ in September",
    "Movies\n‘Tarla’ movie review: A simplistic, flat narration dilutes a fascinating story",
    "Sobriety after the euphoria of the U.S. state visit",
    "Due process clause or basic structure doctrine?",
    "The long road to finding true peace in Yemen",
    "On the draw — July 8, 2023",
    "Are science journalists scientists?",
    "Should Internet shutdowns be used to maintain public order?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "Explained | What are the provisions of the High Seas Treaty?",
    "Explained | Understanding dark patterns",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Limits of expansion: On the controversy over the Open Market Sale Scheme",
    "Gujarat High Court dismisses Rahul Gandhi’s plea against his conviction in defamation case",
    "Indian Medical Association seeks a relook at proposed exit exam for MBBS students",
    "Finance Minister Sitharaman calls up DGP after gang kidnaps two GST officers in Telangana",
    "Madras High Court declares 2019 election of Theni MP, P. Ravindhranath Kumar, null and void",
    "Capturing the universe’s hum: Researchers find evidence of ultra-low frequency gravitational waves",
    "BSE to buyback shares worth ₹375 cr",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "All you wanted to know about Instagram Threads (so far)",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]