[
    "Tennis\nFrench Open final | Novak Djokovic wins his 23rd Grand Slam title by beating Casper Ruud",
    "Other StatesSupriya Sule asks critics to assess performance before questioning her on nepotism",
    "History & Culture\nWhy the Indian museum makeover is important",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren’s presence",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "AAP ‘Maha Rally’ | Delhi CM Arvind Kejriwal says will oppose Centre’s ordinance and save democracy",
    "2023-06-11T22:46:17+05:30\n-\nIndia\nFirst national conference of tribal writers held in J&K",
    "2023-06-11T22:41:29+05:30\n-\nOther States\nTMC leader accuses BJP of desecrating holy Matua land",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "World\nUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Football\nManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "WorldNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil NaduBuckingham Canal | A waterway once is sewage-carrier now",
    "Science\nIIT-Madras generates hydrogen from seawater using solar energy",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Dear Deputy CM, nice thought, but an elite task force is not what Bengaluru needs’",
    "Cyclonic storm 'Biparjoy' likely to hit Gujarat on June 15",
    "Reservation for Muslims is against the Constitution, says Amit Shah",
    "Chaos and congestion in front of Bengaluru metro stations",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "How TVS ILP helped Ather Energy swiftly start production at Hosur plant",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]