[
    "Astronomers find new clue about mysterious radio flashes in space",
    "Industrial investments: The Kerala story",
    "A ‘middle kingdom’ dawns on India’s west",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Gangster Lawrence Bishnoi shifted to Delhi's Mandoli Jail",
    "Dubai-bound IndiGo flight suffers bird hit at Mangaluru International Airport, aborts take-off",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Was the President invited, asks the plea",
    "PM Modi lauds presence of ruling, Opposition members at Indian community event in Australia",
    "DGCA asks Go First to submit a revival plan within 30 days",
    "2023-05-25T16:40:38+05:30\n-\nIndia\nDGCA asks Go First to submit a revival plan within 30 days",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "The Narendra Modi visit to Australia adds to the bipartisan strength of growing bonds",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Republicans should not put partisan goals ahead of the greater public good",
    "Hyderabad\nMan dies of ‘heart attack’ soon after his daughter’s wedding at marriage hall",
    "MoviesDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "Environment\nBrazil builds 'rings of carbon dioxide' to simulate climate change in the Amazon",
    "Tamil Nadu‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "Music\nTina Turner: five favourite songs",
    "Gadgets\nPebble launches Cosmos Vault smartwatch in India",
    "Movies‘The Wheel Of Time’ gets season 2 premiere date",
    "Kerala\nAmazon Labour Union an inspiring starting point, says Justine Medina",
    "After Karnataka, more lessons for the BJP",
    "The fundamental value of the rupee",
    "The paradox of BRICS, its new pathway",
    "Redrawing the poll strategy in Bihar",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "How to text someone on WhatsApp without saving their number on your device",
    "New Parliament building opening | How a letter to PMO set off a search for the Sengol",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "U.P. court acquits Samajwadi Party leader Azam Khan in 2019 hate speech case",
    "India is “absolutely” on Musk’s radar for setting up Tesla EV manufacturing unit",
    "Stocks to watch out today — May 25, 2023",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]