[
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "NCP split a reminder of succession battles in regional parties",
    "Supreme Court seeks updates from Union, States on action taken against lynchings",
    "China protests Dalai Lama meeting with visiting U.S. officials",
    "Derek O'Brien, Saket Gokhale among 6 candidates named by TMC for Rajya Sabha polls",
    "Relentless rains continue to lash northern India; 17 killed in Himachal Pradesh",
    "SC to hear on July 31 Uddhav’s plea against EC order giving Shinde party name, symbol",
    "2023-07-10T17:01:43+05:30\n-\nDelhi\nSupreme Court seeks Centre, L-G responses on Delhi Ordinance",
    "Dangerously fanciful: On the judiciary, Rahul Gandhi’s conviction and the defamation case",
    "The High Court has made defamation sound like a horrific crime",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "The U.S. decision to send cluster munitions to Ukraine blurs all moral lines",
    "ScienceDaily Quiz | On lunar missions",
    "Environment\nRibbon dance in the heart of Bengaluru",
    "Gadgets\nOppo Reno10 Pro+ 5G and Reno10 Pro 5G launched in India",
    "WorldSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "Environment\nIn Varanasi, turtles help clean the Ganga",
    "Technology\nExplained | What should you know about Meta’s social media app Threads?",
    "Tamil Nadu‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "Visakhapatnam\nAyurvedic education system faces neglect in Andhra Pradesh and Telangana",
    "The ‘Anna Bhagya’ fiasco and thinking beyond rice",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "On the draw — July 9, 2023",
    "Restoring the World Trade Organization’s crown jewel",
    "Due process clause or basic structure doctrine?",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Objections overruled, Forest Bill goes to House unchanged",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "Financial due diligence underway at IDBI Bank",
    "Income Tax Department targets 50 cases per AO for survey and TDS verification",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Lakshya Sen staves off Li Shi Feng challenge to win Canada Open title",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]