[
    "It’s a tough road ahead for Channapatna’s toy makers",
    "Data | Why Centre’s denial of rice through OMSS hits Karnataka the most",
    "Science for All | Why does observing gravitational waves matter?",
    "Yuki Bhambri’s doubles success will inspire many Indian players, says coach M. Balachandran",
    "Prachanda's remark on India stirs up storm in Nepal; Opposition demands PM's resignation",
    "Supreme Court agrees to hear Delhi Government’s challenge to ordinance on July 10",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "SC Collegium proposes new Chief Justices to seven HCs",
    "Madhya Pradesh CM Chouhan washes feet of urination incident victim, apologises to him",
    "Madras High Court declares 2019 election of Theni MP, P. Raveendranath Kumar, null and void",
    "Wagner chief Prigozhin is in Russia, president of Belarus says",
    "2023-07-06T16:15:35+05:30\n-\nMarkets\nRupee falls 22 paise to close at 82.47 against U.S. dollar",
    "2023-07-06T15:39:36+05:30\n-\nAndhra Pradesh\nNHRC summons district officials in Dalit’s death case",
    "Diminishing returns: On India and its Shanghai Cooperation Organisation engagement",
    "Relief, again: On the Teesta Setalvad case",
    "No one should be denied limited respite from arrest to pursue legal remedies",
    "Cartoon\nIt rained in the city",
    "MoviesLeonardo DiCaprio, Robert De Niro’s ‘Killers of the Flower Moon’ trailer out",
    "Movies\nWatch | Amala Akkineni: Cinema is no longer about one person producing a masterpiece",
    "Telangana\nPicture shot by Telangana girl makes it to Vogue Italia magazine",
    "Economy\nIndia’s expanding middle class will bulge up to over 1 billion by 2047: PRICE study",
    "Movies\n‘Salaar: Part 1’ teaser: Prabhas is all fire in Prashanth Neel’s intense gangster drama",
    "Movies\nNetflix’s ‘Sex Education’ to end with Season 4; teaser out",
    "PodcastInside office cubicles | Work-mind Balance podcast Ep 1",
    "Striking a blow against affirmative action in America",
    "An inclusive social policy for migrants",
    "Gujarat’s bridges to nowhere",
    "Green Humour by Rohan Chakravarty",
    "Choose a new palette for India’s creative economy",
    "The Kerala BJP faces a massive roadblock",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "Explained | The changes to the Liberalised Remittance Scheme",
    "Explained | India’s diabetes epidemic is making India’s TB epidemic worse",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ph.D not compulsory for teaching jobs in colleges, universities: UGC",
    "Move to introduce Uniform Civil Code a bluff, linked to Hindu Rashtra: Amartya Sen",
    "Finance Minister calls up DGP after gang kidnaps two GST officers",
    "IT department turns lens on IVF clinics, designer clothing stores, NRI quota medical college seats",
    "AP’s new pension scheme is attractive and viable",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]