[
    "Data | Why Centre’s denial of rice through OMSS hits Karnataka the most",
    "Science for All | Why does observing gravitational waves matter?",
    "An inclusive social policy for migrants",
    "Choose a new palette for India’s creative economy",
    "No outsider being allotted land: J&K administration on Mehbooba's charges",
    "It’s a tough road ahead for Channapatna’s toy makers",
    "Problem of manual scavenging eliminated, claims Union Social Justice Ministry panel",
    "SC Collegium proposes new Chief Justices to seven HCs",
    "Madhya Pradesh CM Chouhan washes feet of urination incident victim, apologises to him",
    "Supreme Court agrees to hear Delhi Government’s challenge to ordinance on July 10",
    "2023-07-06T13:27:22+05:30\n-\nWorld\nSouth Korean doctors flee paediatrics as low birth rate bites",
    "2023-07-06T13:10:39+05:30\n-\nTechnology\nE.U. regulations keep Meta’s Threads out: report",
    "Diminishing returns: On India and its Shanghai Cooperation Organisation engagement",
    "Relief, again: On the Teesta Setalvad case",
    "No one should be denied limited respite from arrest to pursue legal remedies",
    "Cartoon\nIt rained in the city",
    "TechnologyZuckerberg-Musk fight is on: Meta launches 'Twitter Killer' Threads app",
    "Economy\nIndia’s expanding middle class will bulge up to over 1 billion by 2047: PRICE study",
    "Telangana\nPicture shot by Telangana girl makes it to Vogue Italia magazine",
    "Other States\nChinkara killing case | Pay half of fine to informer, says Rajasthan court",
    "IndiaJ&K launches India’s first chatbot for people in mental distress",
    "Agriculture\nThird unique farmers’ jackfruit variety identified for promotion",
    "Business\nCan surging corporate profits actually spur inflation?",
    "Striking a blow against affirmative action in America",
    "Gujarat’s bridges to nowhere",
    "The Kerala BJP faces a massive roadblock",
    "Lessons from the fracas over foodgrains",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks faced by Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "Explained | The changes to the Liberalised Remittance Scheme",
    "Explained | India’s diabetes epidemic is making India’s TB epidemic worse",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ph.D not compulsory for teaching jobs in colleges, universities: UGC",
    "44 overspeeding vehicles booked on Bengaluru-Mysuru Expressway",
    "Huge rush as Bengaluru’s Namma Metro services disrupted on Purple Line",
    "IT department turns lens on IVF clinics, designer clothing stores, NRI quota medical college seats",
    "India to insist on well-defined criteria for BRICS expansion",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]