[
    "Manipur unrest | The embers of Meitei-Kuki conflict still glow",
    "Under-reading and over-reading the Karnataka vote",
    "Fernando Alonso and Aston Martin: honeymoon period or marriage made in heaven?",
    "Tracking SDG progress the Bhopal way",
    "Himachal explores possibility of growing cannabis",
    "Kerala curios to take on Chinese souvenirs",
    "Nurse shortage ails U.P. health system",
    "Quad leaders express deep concern over consequences of Ukraine war",
    "In first meeting, Karnataka Cabinet decides to implement 5 guarantees",
    "Decisions that khaps will take for us could hurt nation, say protesting wrestlers",
    "ED searches 12 locations in money-laundering case against PMO ‘imposter’",
    "2023-05-20T23:01:50+05:30\n-\nFootball\nCasemiro strikes as Man United eye Champions League",
    "2023-05-20T22:46:50+05:30\n-\nIndia\nBSF intercepts three Pakistani drones, seizes 2.60 kg drugs",
    "2023-05-20T22:13:48+05:30\n-\nWorld\nWagner claims Bakhmut captured, Kyiv says fighting ongoing",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "The shifting of Kiren Rijiju from Law Ministry should end conflict with judiciary",
    "Among the elite: On India at the G-7 summit",
    "India’s presidency of G-20 gives it additional heft at G-7 summit",
    "MoviesAuschwitz drama 'Zone of Interest' marks director Glazer's first Cannes foray",
    "Tamil Nadu\nTN boy braves disability, scores 437 in class X exam",
    "Kerala\nThe people and the government: the contemporary relevance of The Svadesabhimani",
    "EconomyRBI to pull out ₹2,000 notes from active circulation",
    "Movies\n‘Devara’ is the title of Jr NTR’s film with Koratala Siva; first-look poster out",
    "Technology\nThe accessibility gap on streaming in India",
    "WorldPM Modi’s Indo-Pacific tour | Will Biden’s pullout be India’s gain?",
    "Movies\n‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "Explained | What are RBI regulations on green deposits?",
    "Political Line — May 20, 2023",
    "Can an integrated system of medicine work?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Narayana Netralaya chairman Dr. Bhujang Shetty passes away",
    "Centre reverses Supreme Court order, gives Delhi Lieutenant Governor final say on bureaucrats",
    "RBI to pull out ₹2,000 notes from active circulation",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "Telangana can now build a city as big as Hyderabad next to it",
    "Pichai sells Chennai home where Sundar grew up",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023 Points Table update after PBKS vs RR match: Rajasthan moves to fifth, keeps hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]