[
    "Mental health awareness month: how to cope in the age of anxiety",
    "Industrial investments: The Kerala story",
    "A ‘middle kingdom’ dawns on India’s west",
    "In Nepal, a fledgling political outfit gives traditional parties a run for their money",
    "Telangana EAMCET results declared; 80% qualify in engineering and 86% in agriculture stream",
    "AAP's Satyendar Jain collapses in Tihar Jail, hospitalised",
    "In a first, Kerala will frame Bill for protection of domestic workers’ rights: CM",
    "PM Modi lauds presence of ruling, Opposition members at Indian community event in Australia",
    "How a letter to PMO set off a search for the Sengol",
    "IPL 2023 | MI’s Madhwal equals Kumble’s cheapest five-for record",
    "2023-05-25T13:11:17+05:30\n-\nIndia\nGangster Lawrence Bishnoi shifted to Delhi's Mandoli Jail",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "The Narendra Modi visit to Australia adds to the bipartisan strength of growing bonds",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Republicans should not put partisan goals ahead of the greater public good",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "Tamil Nadu‘Sengol’ – a historic sceptre with a deep Tamil Nadu connection",
    "Music\nTina Turner: five favourite songs",
    "Kerala\nAmazon Labour Union an inspiring starting point, says Justine Medina",
    "IndiaSatyajit Ray's family welcomes Delhi High Court order on copyright",
    "Andhra Pradesh\nRoyal Photographic Society’s ‘associate’ tag for Guntur man",
    "Technology\nIndia set to triple speed of its fastest supercomputers",
    "BusinessShah Rukh Khan is now Realme’s new brand ambassador",
    "Business\nWill services once again come to the rescue of exports?",
    "After Karnataka, more lessons for the BJP",
    "The fundamental value of the rupee",
    "The paradox of BRICS, its new pathway",
    "Redrawing the poll strategy in Bihar",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "How to text someone on WhatsApp without saving their number on your device",
    "New Parliament building opening | How a letter to PMO set off a search for the Sengol",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "U.P. court acquits Samajwadi Party leader Azam Khan in 2019 hate speech case",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "India is “absolutely” on Musk’s radar for setting up Tesla EV manufacturing unit",
    "Canara Bank’s CGM appointed Deputy MD at IDBI Bank",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]