[
    "ISRO’s Chandrayaan 3: When did it start and when will it end?",
    "The strange story of how Anas lost his Asian Championships berth",
    "The View from India | Why the U.S. is sending cluster munitions to Ukraine",
    "Wimbledon 2023: Russian teenager Mirra Andreeva takes the tennis world by storm",
    "SC asks SEBI why law was tweaked to remove provisions prohibiting opacity in FPI ownership",
    "Centre’s view on life in J&K post-Article 370 has no bearing on challenge to abrogation: SC",
    "GST Council meet | 28% tax on online gaming, cancer-related drugs among exempted items",
    "GST rates have been reduced, clarified or regularised on some goods",
    "Himachal Pradesh’s battle with the ‘fury of nature’ is also a manmade disaster, say experts",
    "SC holds ‘piecemeal’ extensions given to ED Director illegal, invalid in law",
    "Ukraine turns heat on allies as NATO stalls on membership bid",
    "Second moonshot: on the Chandrayaan-3 mission on July 14",
    "Chandrayaan 3 speaks to the moon’s growing importance in scientific and political milieus",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Grassroots politics is now a high-stakes game of violence in West Bengal",
    "Personal Finance\nRBI Floating Rate Bonds offer 8.05 per cent interest: Should you invest?",
    "BusinessHyundai introduces entry-level SUV Exter",
    "Life & Style\nHow urban India is reclaiming spaces for its communities",
    "Technology\nTwitter rival Threads signs up 100 million users in five days",
    "Movies\nDhoni on producing Tamil film ‘LGM’: ‘I have a strong connection with Chennai’",
    "Gadgets\nOnePlus Nord 3 Review | Upgrading the Nord series",
    "AI’s disruptive economic impact, an India check",
    "Don’t waste the wastewater",
    "In Opposition without a leader",
    "On the Draw — July 11, 2023",
    "Women’s reproductive autonomy as the new catchword",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Readers Editor-Terms of Reference",
    "Bookstore & Special Publications",
    "Five Mexicans, Nepali pilot killed in helicopter crash near Mount Everest in Nepal",
    "Karnataka Dy. CM Shivakumar catches Indira Canteen staff fleecing customers",
    "Derek O'Brien, Saket Gokhale among 6 candidates named by TMC for Rajya Sabha polls",
    "Decoupling possible across and within markets: Allianz’s Mohamed El-Erian",
    "Canara Bank to sign ₹3,000 crore IT transformation deal",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]