[
    "View from India | Spotlight Indo-US",
    "Same-sex marriage: Morality vs equality",
    "It’s Mission Asian Cup for the Blue Tigers as coach Stimac prepares a blueprint for the road ahead",
    "E-education platforms, their Generative AI chapter",
    "Enforcement Directorate raids premises of T.N. Minister V. Senthilbalaji",
    "Poshan app allows migrant workers to access nurseries wherever they live",
    "While Nitish headlines Opposition meet, Lalu, Tejashwi lay the groundwork",
    "Cyclone Biparjoy | Gujarat to evacuate people living within 10 km from coast",
    "Manipur violence | Assam CM meets Kuki insurgent groups with peace plan",
    "2023-06-13T12:29:43+05:30\n-\nKarnataka\nTop news developments in Karnataka today",
    "The second-best: on India and the World Test Championship final",
    "India, after a hectic IPL, seemed unprepared for the WTC final",
    "Fall from grace: on the political trajectory of Boris Johnson",
    "The refusal of Boris Johnson to go quietly can damage the Tories",
    "Art\nThe many smells of Bengaluru captured in a book",
    "Tamil NaduTiruvarur village gets a ‘Taj Mahal’ tomb as tribute to a beloved mother",
    "Art\nHow Clyde D’Mello captures the concept of time through his art",
    "Science\nISRO, Norway and the ‘Svalbard mission’ of 1997",
    "Andhra Pradesh\nWith new changes by TTD, a record number of devotees have darshan at Tirumala",
    "Technology71% of Indian professionals want to delete workplace jargon: Report",
    "Podcast\nWhat does RBI’s current monetary policy mean for India’s economy? | In Focus podcast",
    "Tamil Nadu\nNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "ScienceMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "Videos\nWatch | Mumbai salon offers stigma-free space for transgender community",
    "Wrestlers’ protest and the shrinking space for dissent",
    "NCDs plague Keralites’ health",
    "The Telangana BJP is in a bind",
    "Governors cannot indefinitely hold back Bills",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Explained | The Hiroshima process that takes AI governance global",
    "Explained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Retail inflation cools again; down to 4.25% in May",
    "Thrissur youth wins gold at World Pro Wushu Sanda fight",
    "IndiGo flight enters Pakistan airspace amid bad weather; returns safely",
    "Specific insurance plans for surrogate mothers on the anvil",
    "May retail inflation, April factory output spring positive surprise",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC 2023-2025: India full schedule, tours, matches list",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]