[
    "Get up to 7%* p.a. with ActivMoney: Kotak Bank",
    "Democracy is in our DNA: PM on question about rights of Muslims, minorities at press meet",
    "All onboard missing Titanic submarine declared dead as debris found",
    "Australia's Fox Cricket calls Ollie Robinson 'villian no. 1', Stuart Broad responds",
    "54-member Indian team for Asian Athletics Championships announced",
    "Cameraman zooms into Ronaldo's face during interview, his reaction goes viral",
    "Middlesex record highest-ever successful run chase in T20 cricket history in England",
    "Talked to Musk & Zuckerberg, they're dead serious about cage fight: UFC President",
    "Which party leaders are likely to attend Opposition meet in Patna tomorrow?",
    "Mukesh Ambani, Sundar Pichai, Tim Cook among others attend state dinner hosted for PM Modi",
    "There has been momentous development in another AI, America and India: PM at US Congress",
    "I'm told 'Samosa Caucus' is the flavour of the House: PM on Kamala Harris at US Congress",
    "PM Modi, US President Biden raise a toast at state dinner; pic goes viral",
    "Passengers jump off Mumbai-bound train, run for lives as smoke in train creates panic",
    "PM Modi's reaction to US President Biden's 'no alcohol in glass' joke goes viral",
    "US politicians line up to take autograph, selfies with PM Modi; pics go viral",
    "Man drugs wife & films over 50 strangers raping her over 10 years in France",
    "Missing Titanic submarine's rear cover, landing frame among debris found: Rescue expert",
    "Risks were too high: UK millionaire who pulled out of Titanic submarine trip",
    "Men can overcome: Rajeev Khandelwal on facing casting couch",
    "50 days since Manipur burning, PM Modi still silent: Jairam Ramesh",
    "India-US to work together to democratise supply chains: PM Modi",
    "Armed men rob ₹27 lakh from bank in Bihar, fire at guard: Police",
    "Had a great time with PM Modi: US House Speaker McCarthy",
    "Indians' funds in Swiss banks down 11% to ₹30,000 crore in 2022",
    "Terms & conditions\nPrivacy Policies",
    "Contact For Any Other Query"
]