[
    "Jio Financial Services: Expected share price, record date, other details",
    "Jaiprakash Associates defaults on ₹4,044-crore loans",
    "‘Lost 60% overnight’, investors after Reliance Retail share capital reduction",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "West Bengal Election LIVE: Death toll at 24, TMC's big claim on poll violence",
    "Haridwar: Schools shut from 10-17 July due to Kanwar Mela",
    "This IIT-IIM alumnus emerges as Tata Group's ‘highest-paid’ CFO",
    "Maharashtra Political Crisis: Sharad Pawar commences statewide tour. 10 points",
    "‘Be careful’: Joe Biden warns China's Xi Jinping after Putin meeting",
    "Monsoon Rain LIVE: Bad weather forces second-day suspension of Amarnath Yatra",
    "Maharashtra News Live: ‘Shinde has been asked to resign’, Aaditya Thackeray says",
    "‘US has no role': Congress leader on Eric Garcetti's comments on Manipur",
    "‘SRK doesn’t know acting’: Pakistani actress gets trolled for comment",
    "Rajasthan Temple new dress code: No entry to visitors wearing ripped jeans",
    "West Bengal's panchayat election today. 10 updates",
    "How does Noida stand out amid sluggish real estate market? 5 factors explained",
    "Mumbai rain: IMD predicts moderate to heavy rainfall, many areas waterlogged",
    "Prince Harry's return to UK: It's not about the royal family, but...",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Elon Musk replies to his own parody Twitter account. Here's what he says …",
    "Amidst Maharashtra's political crisis, Aaditya Thackeray makes bold prediction",
    "Delhi's IG airport is all set to get India's first elevated cross taxiway",
    "A Lego-lover’s guide to preparing for the AI age",
    "Twitter accuses Meta Thread of trade secret theft, sparks potential legal battle",
    "PM Modi to inaugurate expressway section of Amritsar-Jamnagar economic corridor"
]