[
    "DGCA puts jet repossess request from Go First lessors on hold",
    "Sensex, Nifty rise for 4th straight day; mid, smallcap scale fresh 52-week highs",
    "Mint Explainer: America's debt-ceiling compromise",
    "India and Russia should join forces to build commercial aircraft",
    "How the angel tax harms Indian startups",
    "The speech police are coming for social media",
    "Don’t kill gaming with senseless taxation",
    "Get ready to pay more for your electric scooter",
    "Information overload: It’s everybody’s battle",
    "Banks finding novel ways to conceal stressed loans: RBI governor",
    "Apollo Hospitals Q4 earnings: Net profit up 50% to ₹146 Cr, Board declares 180% dividend",
    "Should you buy gold as prices hit over 2-month low?",
    "There are more ₹500 fake notes in circulation than ₹2000: RBI annual report",
    "Mutual Funds: These equity MFs gave over 40% returns in last three years",
    "Go First extends all flight cancellations till June 4",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "JAC Class 12th Result LIVE: Jharkhand Arts, Commerce results declared, link here",
    "Excise policy scam: Delhi High Court denies bail to AAP leader Manish Sisodia",
    "Sensex touches 63k intraday, closes 120 pts higher; ITC, HDFC Life shine",
    "Portfolio management: Why it is important to diversify your invesments?",
    "Elon Musk's jet lands in China, discussion with govt to focus on Tesla: Report",
    "Congress delegation urges President to seek judicial probe into Manipur incident",
    "Wrestlers protest: Sakshi Malik, and others plan to throw medal in Ganga river",
    "Maharashtra SSC Result 2023 Live",
    "NRIs Taxed on Property Sale",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Best companies for work in India 2023",
    "UPI Frauds: how users lose money through digital transactions",
    "Why Eureka Forbes share price rallied over 14% today?",
    "Samsung to unveil Galaxy F54 5G on June 6, pre-reservation starts today",
    "'Not a popular opinion' Suniel Shetty shares his take on work from office",
    "Myntra launches ChatGPT-powered search feature for enhanced product discovery | Mint Primer | Mint",
    "Gautam Adani back in top 20 billionaires list as net worth | Mint Primer | Mint"
]