[
    "Sensex, Nifty rise for 2nd straight session; investors richer by ₹2 lakh crore",
    "Byju's account books on radar as Centre orders inspection",
    "Foxconn share its future plans for India after parting ways with Vedanta",
    "Mint Explainer: Sweden set to join NATO after Turkey backs off",
    "India’s only listed drone-maker is flying high",
    "Bringing GST under PMLA could lead to tax terrorism",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Six people, including five Mexicans, die in helicopter crash in Nepal",
    "Tata Group could soon become the first Indian iPhone maker",
    "GST Council LIVE: FM Sitharaman chairs 50th Council meeting in Delhi",
    "Supreme Court says Centre's third extension of ED Director SK Mishra ‘illegal’",
    "TCS vs Infosys vs Wipro vs HCL Tech: Which IT stock to buy ahead of Q1 results?",
    "Abrogation of Article 370: SC to hear batch of plea from 2 August",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "Sensex jumps 275 pts, Nifty adds 80 pts; Sun Pharma, Eicher jump; UPL lags",
    "Helicopter with 6 foreign tourists crashes near Mount Everest in Nepal: Report",
    "Foxconn to pursue India plan without Vedanta, to apply for chip unit separately",
    "Reliance Industries shares hit 52-week high; experts expect more upside",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "Should you buy gold as US dollar index hits nine week low on de-dollarisation?",
    "Tata Motors shares extend rally; becomes 16th most valued automaker in the world",
    "Bengal Panchayat Poll Violence",
    "Adani Enterprises share price",
    "Shah Rukh Khan's Jawan has earned ₹250 crore before release. Here's how",
    "Apple opens store on China's WeChat platform",
    "PM Modi to be guest of honour for French military parade - What is Bastille Day?",
    "Mumbai gets 1st electric mobile pet cremation van; here's all you need to know",
    "Vijay Kedia raises stake in small-cap stock that has surged 125% in YTD",
    "Q1 results preview: Here's why speciality chemicals firms may see muted numbers",
    "Canada Express Entry: Over 60,000 invites issued in first half of 2022"
]