[
    "NCLT rejects IDBI Bank's insolvency plea against Zee Entertainment",
    "Nexus Select Trust share price jumps after positive listing. Buy, hold or exit?",
    "Supreme Court gets two new judges",
    "Gland Pharma share price locked at 20% lower circuit after weak Q4",
    "Stock Market LIVE: Sensex tops 61,500; Tata Motors, TechM shine; Tata Steel lags",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "The new consumption boom along India's highways",
    "SBI party may cool after Q4 thrill",
    "Devyani waits for a demand seasoning",
    "‘Rahul Gandhi called me’: DK Shivakumar on why he agreed to be deputy CM",
    "Gyanvapi Mosque Case Live: SC to hear Muslim side's plea against HC order",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "From stock analyst to business partner, what all ChatGPT can do after its update",
    "Tata group stock rebounds from intraday lows. Opportunity for bottom fishing?",
    "Mumbai to Navi Mumbai in 20 minutes: India's longest sea bridge to be ready soon",
    "Nexus Select Trust lists at premium: Stock surges 4% against IPO issue price",
    "Apple iOS 16.5 released: List of changes, and new features on your iPhone",
    "TN 10th Result 2023 Live: TNDGE SSLC Class 10 results out on tnresults.nic.in",
    "JNU seeks cancellation of discussion on Manipur violence, students go ahead",
    "Undervalued Gems: 3 Penny Stocks Hitting 52-Week Lows. Time to Take a look?",
    "Yadav calls out international community over ambiguity in climate finance",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PM Modi departs for three-nation visit",
    "‘His closed-door angry tirade’: Ex-US envoy on Pak Army chief for May 9 violence",
    "Amit Shah to chair 2nd 'Chintan Shivir' today; to evolve PM Modi's 'Vision 2047'",
    "IndiGo’s Q4 marred by soaring maintenance costs but yield outlook healthy",
    "Interglobe Aviation share price: Should you buy, sell or hold this airline stock",
    "Textile stock jumps 4% after announcement of ₹5.75 per share dividend",
    "The Clash of the Titans of Payments: Credit Card vs. Debit Card",
    "Shiv Nadar University student shoots woman classmate, kills self later",
    "How to Find Affordable Family Health Insurance Plans"
]