[
    "Mutual funds tweak you should do in rising stock markets. Explained in five ways",
    "Six banks offer up to 7% interest rates on savings accounts. Full list here",
    "Mint Explainer: Why did Canada halt ties with China's a ....",
    "Sooner or later, America’s financial system could seize up",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "Meta owned Facebook and Instagram now back after outage: Report",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday",
    "Mutual funds vs real estate: Which one is better for long-term investors",
    "Cyclone Biparjoy LIVE: Cyclone 'Biparjoy' weakens into 'deep depression'",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "How to make the perfect Father's Day Pizza? ChatGPT answers",
    "‘Situation in Manipur deteriorating’ Chhattisgarh CM slams Centre",
    "Google Doodle celebrates Iceland National Day with a special doodle",
    "RBI imposes ₹20 lakh penalty on Manappuram Finance. Details here",
    "Delhi Metro warns against making reels in coaches: ‘Open your camera, Na Na Na!’",
    "Tamil Nadu BJP state secretary arrested for tweet against Madurai MP",
    "BSE India website to become unavailable from today evening. Check details",
    "BJP attacks West Bengal government for violence in the state",
    "Putin says Russia put first nuclear weapons in Belarus",
    "Cyclone 'Biparjoy' weakens into 'deep depression', expected to weaken further",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "BGMI redeem codes for June 17, 2023: Unlock exciting gifts and free rewards!",
    "Fiscal policy in the rich world is mind-bogglingly reckless",
    "‘Manipur needs urgent attention at highest level’ ex-Army Chief",
    "'GenZs today is facing lack of awareness of what’s next': Viral Fission founder",
    "Garena Free Fire Max redeem codes for June 17, 2023: Get weapons, diamonds, more"
]