[
    "Delayed SFT filing attracts penalty: I-T department",
    "Rolls-Royce to cut thousands of jobs: Report says",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "Activist investors are needed more than ever",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Move Over, Mars. Elon Musk Turns His Attention to 2024 ....",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "How laddering, barbell can get you better returns from FDs",
    "CSK vs GT Live Score, IPL 2023 Final: Rains begin again, match to delay further",
    "India should reduce Direct Tax from 40% to 25%, suggests economist. Here's why",
    "Wrestlers' protest: Vinesh and Sangeeta Phogat, Sakshi Malik released | Watch",
    "From Adani Transmission to IRCTC here are corporate earnings to watch this week",
    "Guwahati-NJP Vande Bharat Express: Fare, timings, stoppages, other details",
    "Talks on supply chain agreement under IPEF substantially concludes: Govt",
    "Manipur Violence: 30 'terrorists' killed, several arrested, says CM Biren Singh",
    "Mallikarjun Kharge slams govt over action on wrestlers protests",
    "'IT cell people are spreading…': Bajrang Punia shares morphed pic of wrestlers",
    "Wrestlers' protest: Neeraj Chopra, Vijender Singh, Kejriwal, condemn Delhi cops",
    "New Parliament: Pawar says worried after seeing inauguration, asks if event was for limited people",
    "Arvind Kejriwal meets Satyendar Jain, calls him 'brave man'",
    "Turkey election: Erdogan seeks to extend two decades of rule",
    "IPL 2023: MS Dhoni set to create this record as he leads CSK in the final",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "Investing ₹10 Lakh in Small Saving Schemes",
    "US Debt Ceiling Crisis Affecting Gold Price",
    "IMD Yellow Alert Maharashtra",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PFC logs 13% growth in FY23 consolidated net profit",
    "Poll sees India’s Q4 GDP growth at 5%",
    "Info Edge’s near-term prospects tied to non-IT sector performance",
    "For LIC, a refuge in low valuations"
]