[
    "RBI's guv Shaktikanta Das expects disinflation process to be slow in India",
    "Adani Group in talks for first major debt refinancing of $3.8 billion: Report",
    "Accenture's AI practice to have 80,000 employees",
    "Mint Explainer: Will ghost offices soon haunt Hyderabad?",
    "Mint Explainer: What is Silvio Berlusconi’s legacy?",
    "Is the global housing slump over?",
    "Mint Explainer: Why Boris Johnson’s dramatic exit is ba ....",
    "How the new generation of weight-loss drugs work",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "US consumer inflation cools for 11th straight month in May, rises just by 0.1%",
    "Go First flight cancellation extended till 16 June, full refund assured",
    "Cyclone Biparjoy: Location of impact, damages expected, preparations and more",
    "Spotify fined $5.4 million for not informing users on data use",
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Rahul Gandhi's ‘truck trip' in US, coupled with Sidhu Moosewala songs | Watch",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Explained: How the US Fed rate hike will impact the Indian stock market",
    "'Joe Biden is thrilled…': US NSA on PM Modi's state visit",
    "Managers beware! US-based company replaces bosses to keep ‘employees happy’",
    "CM Stalin slams 'Hindi imposition' by New India Assurance. Explained",
    "Market wrap: Sensex, Nifty end higher; mid, smallcaps hit all-time high",
    "Kotak Bank, Asian Paints, Titan among top gainers, losers today",
    "‘Even children knew…’: Rakesh Tikait on ex-Twitter CEO Jack Dorsey’s claims",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "IEA chief pitches for ambitious G20 agenda on clean energy investment",
    "Haryana: Farmers end protest as govt agrees to increase MSP for Sunflower seeds",
    "Hero MotoCorp is speeding up on strategy, but there are hurdles",
    "BHEL, IEX, others under F&O ban on NSE on June 14; check details",
    "Centre reviews preparation for power supply, restoration ahead of cyclone Biparjoy",
    "Rozgar Mela has become new identity of present government, says PM Narendra Modi",
    "Amit Shah unveils ₹8,000 crore schemes to strengthen disaster management",
    "GRSE launches two warships and lays keel of third vessel on same day",
    "NEET UG Result OUT: Check direct link here, scorecard, toppers list here",
    "This large-cap stock turns ₹1 lakh investment into over ₹1 crore in 16 years"
]