[
    "Sensex, Nifty snap two-day losing run; investors richer by over a lakh crore",
    "CoWIN data leak! Aadhaar, PAN Card info of Covid vaccine receivers on Telegram",
    "Yuval Noah Harari argues that AI has hacked the operati ....",
    "Mint Explainer: A modest, not-too-populist hike in MSP",
    "In charts: Does your state face an inflation curse?",
    "Is doing business in China becoming impossible for foreigners?",
    "Small-, mid-caps rally may have steam left",
    "Impasse in free trade talks as Israeli concerns grow ov ....",
    "Understanding the challenges of foreign investments in ....",
    "How easy money killed the great housing dream",
    "Silvio Berlusconi, former Italian PM, dies at 86",
    "Tesla Power sends this small-cap company's share price in India soaring",
    "Children rescued from Amazon jungle after 40 days, here's how they survived",
    "SBI Life, HDFC Life are Nuvama's top picks in life insurance space; details here",
    "Cyclone Live: Kutch, Saurashtra on orange alert; schools in coastal areas closed",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "No two-wheeler Rapido, Uber bike-taxi in Delhi as SC stays HC permit order",
    "Govt prepares framework to ban THESE three types of games. Details here",
    "IT, Realty remain strong as Sensex, Nifty end in green; Infosys, HCL Tech shine",
    "IKIO Lighting IPO: Latest GMP, how to check allotment status online",
    "Netflix releases 'The Archies’ poster, draws mixed reactions",
    "Shubman Gill fined 115% of his match fees. Here's why",
    "PM Modi to become first Indian Prime Minister who will address US Congress twice",
    "PM Modi addresses G20 Development Ministers’ meet",
    "Adani Enterprises share price",
    "UBS sees nearly 21% upside on ABB India, upgrades stock to buy on 3 key factors",
    "Income tax rule on sale of house property received as alimony by a divorcee",
    "Centre bans over 150 ‘anti-India’ sites, YouTube news channels in 2 years",
    "Silvio Berlusconi dies: Who will take over ex-Italian PM’s business empire?",
    "Cases that defined Silvio Berlusconi, former Italian PM's legal troubles",
    "Key FMCG stocks to look at as consumer companies see rural recovery",
    "Hyundai Motor India signs Hardik Pandya as brand ambassador for Exter",
    "Volvo C40 Recharge EV India debut on June 14: Feature, expected price and more"
]