[
    "RBI approves FLDG framework that allows fintechs to partner with banks, NBFCs",
    "As Nifty eyes new highs, India’s valuations become a sore point",
    "Apple and the meaning of “spatial computing”",
    "How India can tackle dissenting voices in US policy circles",
    "RBI monetary policy: Your home-loan EMIs won’t increase",
    "Surging stockmarkets are powered by artificial intelligence",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Vedanta group's net falls 67% as input costs soar",
    "Nomura India's head of investment banking steps down: Report",
    "Yet another status quo from RBI! What will happen to your home loan EMIs?",
    "Byju's plans to cut more jobs to slash costs: Report",
    "RBI responds to Sanjiv Bajaj's statement for customers right to be 'forgotten'",
    "‘Ye kaisa ishq jo. . .': Smriti Irani on Rahul Gandhi's ‘Mohabbat ki Dukan’",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "HDFC may tap Kapil for mammoth mortgage business post merger",
    "Eurozone in recession at start of 2023, shrunk by 0.1%, says Eurostat",
    "Cyclone Biparjoy Live: Storm moves closer to coastline, set to intensify further",
    "IndiaBulls Housing Finance, Manappuram Finance under F&O ban. Details here",
    "PNB mulls to raise funds via Employee Stock Purchase Scheme",
    "‘Deliberately filed false case…’: Minor wrestler's father makes big revelation",
    "Bulk deals: Tips Films, Cartrade Tech Ltd, other exchange hands, check details",
    "Ritu Kalra named Harvard’s VP for finance and CFO",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "Bosses must distinguish harassment from leadership",
    "Monsoon sets over mainland; IMD sees advance over 48 hrs",
    "Half of all ₹2k notes returned",
    "Pause stays on interest rates; eyes on inflation",
    "Governance must keep pace with an increasingly unknown future",
    "Dark truth: Meta's battle against child-sex content on Instagram",
    "Canada wildfires spur US air purifier stocks higher - Here's what is happening",
    "OTT players, lobby groups to address anti-tobacco rules",
    "From TV to theatres, Japanese anime takes root in India"
]