[
    "Stocks to Watch: RIL, SBI, IdeaForge, TCS, Dabur, Titan, Infosys",
    "ideaForge IPO listing date today. Experts, GMP signal four digit debut of shares",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 7th July",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Small-cap funds are all the rage, but should you buy?",
    "India’s shield of privacy should reflect Article 21",
    "Define boundaries and state the fiscal costs of electio ....",
    "Gift Nifty, Asian markets, among other global cues for Indian stock market",
    "‘Modi surname’ case: Gujarat HC to pronounce verdict on Rahul Gandhi's plea",
    "PM Modi to unveil two Vande Bharat Express trains today; Check details here",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Monsoon Rain LIVE: Orange alert issued in 5 districts of Maharashtra today",
    "Jack Dorsey calls Threads ‘Twitter clone’",
    "Twitter threatens to sue Meta over Threads app: Report",
    "Karnataka govt finds a solution for Bengaluru's traffic issues | Details here",
    "Twitter competitor Threads amasses 30 million users in the first 18 hours",
    "Donald Trump's aide Marjorie Taylor Greene removed from US House Freedom Caucus",
    "Elon Musk hits out at Mark Zuckerberg as Threads seems 'Threat' to Twitter",
    "‘Washington wants healthy economic competition’: Janet Yellen on China visit",
    "India's 25 Vande Bharat Express trains on diverse routes. Details here",
    "'Nikhil Kamath is a better trader...': How Zerodha founders ‘built without VCs’",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "Garena Free Fire Max redeem codes for July 7, 2023: Get weapons, diamonds, more",
    "Nifty predictions July 7: Index faces resistance at 19,500",
    "Day trading guide for today: Six stocks to buy or sell on Friday — July 7",
    "Indusind Bank Share Price Live blog for 07 Jul 2023",
    "Bharti Airtel Share Price Live blog for 07 Jul 2023",
    "Wipro Share Price Live blog for 07 Jul 2023",
    "Dr Reddy Share Price Live blog for 07 Jul 2023",
    "Grasim Share Price Live blog for 07 Jul 2023",
    "Adani Ports Share Price Live blog for 07 Jul 2023",
    "Suzlon Share Price Live blog for 07 Jul 2023"
]