[
    "Stock Market LIVE: Sensex gains 200 pts, Reliance shines; IKIO Lighting to debut",
    "IKIO Lighting IPO listing date today. GMP, experts see 'fancy' debut of shares",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "The great Indian monsoon gamble",
    "Motilal MF’s new micro-cap index fund tests the limits",
    "Public safety as priority: Aim for a paradigm shift",
    "Companies can use a social girdle to reduce corporate p ....",
    "Cyclone Biparjoy LIVE: Cyclone weakens in Gujarat; power outage in 940 villages",
    "Nifty predictions June 16: Index may face resistance at 18,750",
    "Global market: SGX Nifty gain, Asian shares mixed ahead of BoJ rate decision",
    "Infosys implements strict no work-from-home policy for THESE employees",
    "Sakshi Malik flags concern over retraction by minor, says, 'there was threats'",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Monsoon tracker: IMD predicts heavy rainfall in these states. Details here",
    "Zara sells shirt with ‘Hindi words that make no sense’",
    "Manipur violence: Union minister RK Ranjan Singh’s residence set on fire",
    "Day trading guide for today: Six buy or sell stocks for Friday — June 16",
    "Oracle sacks hundreds of employees, cancels job offers: Report",
    "Electronics like mobiles, TVs, computers may cost less this festive season: Report",
    "Google warns its own staff about chatbots including Bard: Report",
    "Stocks to Watch: IKIO, Axis Bank, Reliance, IndiGo, Zee Ent, Wipro, Hero Moto",
    "'AI to destroy humanity in 5 years'",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "Volodymyr Zelenskiy speaks about Ukraine's counter-offensive against Russia",
    "Meta Platforms urges EU telecoms to seek alternatives before Big Tech subsidies",
    "Cyclone Biparjoy: 22 injured, power supply to around 930 villages affected",
    "Bengal Panchayat polls: Governor vows ‘effective' action against violence",
    "Rupee rises 21 paise to open at 81.96 against US dollar",
    "GST intelligence officers unearth 461 fake companies in ₹863 crore ITC fraud",
    "BlackRock files paperwork for spot bitcoin ETF: Report",
    "Wipro buyback record date today. Should you tender your shares?",
    "BGMI redeem codes for June 16, 2023: Unlock exciting rewards and free gifts!"
]