[
    "BPCL beats estimates in Q4 earnings, PAT zooms by 159% to ₹6,478 crore",
    "PB Fintech Q4: Firm narrows net loss to ₹9 cr, revenue up 60%",
    "Delhi under grip of blistering heatwave as temp touches 46 degrees Celsius",
    "Artists hope to turn selfies into comets",
    "Tax authorities don’t need TCS to catch evaders",
    "A forensic-accounting expert on how to treat the fraud epidemic",
    "It’s more multipolar, but love for dollar isn’t over",
    "Hunt for fake GST registration may turn heat on minnows ....",
    "Bleak week for funding as big deals go missing",
    "IndiGo flies high as rivals gather",
    "Landlords turn up the heat in India’s Silicon Valley",
    "Meta fined $1.3 billion by EU for sending user data to US: Report",
    "We did not stop Mohun Bagan fans from entering Eden Gardens: KKR",
    "AFSPA to be withdrawn completely from Assam? CM Himanta Biswa Sarma's big hint",
    "BPCL Q4 result: Firm declares dividend of ₹4, check details here",
    "Delhi, Maharashtra petrol pumps struggle as ₹2,000 note payments surge",
    "Adani stocks set for biggest gains since Hindenburg report",
    "Dhanlaxmi Bank records 63% YoY rise in Q4 PAT on sharp decline in provisions",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Shree Cements Q4: Net profit declines 15% to ₹546 crore, dividend declared",
    "‘Speculative’ says RBI Governor Shaktikanta Das on ₹1,000 notes coming back",
    "PM Modi says' Ho Jaye' as young kid sings a patriotic song in Sydney | Watch",
    "IMD predicts relief from severe heatwave from tomorrow. Forecast here",
    "Top gainers, losers in trade today: Adani Ent, Tech Mahindra, Gland: check list",
    "Why has RBI set Sept 30 deadline to exchange ₹2000 notes?",
    "Muthoot Finance Q4 Results",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Jim Farley says Ford will stop competing in over-served markets",
    "James Bullard expects two more Fed rate hike in 2023 to quell inflation",
    "5 Best ways to use ChatGPT with internet",
    "Fender Stratocaster guitar smashed by Kurt Cobain sells for nearly ₹5 crore",
    "Your Data Just Leaked. Here’s What Happens Next",
    "ITI wins ₹3,889 crore order from BSNL for 4G rollout"
]