[
    "Anil Agarwal-led Vedanta raises about $850 million via JPMorgan, Oaktree loan",
    "Stock Market LIVE: Sensex opens lower, Nifty below 18300 on weak cues",
    "PM Modi invites Australian PM Anthony Albanese to watch Cricket World Cup",
    "Check out the companies that will announce Q4 results today",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "India should adopt a tort law to strengthen its deliver ....",
    "Deadlier than COVID…, WHO chief warns threat of ‘another pandemic’ emerging",
    "Mahindra & Mahindra to sell 3.2% stake in Mahindra CIE Automotive: Report",
    "Go First’s lenders consider big four auditors for resolution professional: Report",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Indian drugs caused mass child deaths in Gambia: Panel",
    "Bengaluru to face power cuts today. Check list of areas affected here",
    "Pune in 90 minutes: Mumbai is all set to get India's longest sea bridge",
    "‘I can be an annoying captain because…,’ MS Dhoni after CSK reaches IPL final",
    "Rahul Gandhi's approval soars, emerging as strong contender with PM Modi: Report",
    "Govt mulling over to merge MRPL with HPCL: Report",
    "When is new parliament building inauguration? Check date, time and other details",
    "John Wick 4 OTT release date: Here's where you can watch Keanu Reeves' film",
    "Indian origin driver crashed truck into security barrier near White House",
    "Update Aadhaar Card Details Online",
    "RBSE 10th Result 2023 LIVE",
    "MP Board 10th, 12th Result Live",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Apple gears up for WWDC 2023, sends media invites. Everything we know so far",
    "Biocon shares rise 6% on positive Q4FY23 numbers: check details",
    "It’s bankruptcy that needs a rescue in India",
    "Pakistan's Bilawal Bhutto criticises India for exploiting G20 with Kashmir meet",
    "In pics: Simple One, India's longest electric range electric scooter unveiled. Have a look!",
    "PM Modi Australia LIVE: Modi invites Anthony Albanese to India for cricket WC",
    "Why is GQG's Rajiv Jain bullish on Adani stocks- Explained?",
    "Rupee opens 3 paise lower at 82.83 against US dollar",
    "Infosys stock plummets amidst market turmoil"
]