[
    "India market-cap touches record high in rupee terms, at ₹292 lakh crore",
    "Cyclone Biparjoy LIVE: Powerful cyclone 180 km away from Gujarat",
    "Stock Market LIVE: Sensex sheds 100 pts; IndusInd, Wipro drag; Maruti shines",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "Price of prestige: Exploring the allure of club members ....",
    "Overall stability is a key goal of monetary policy",
    "Indian official statistics could be revolutionized at t ....",
    "Flipkart and PhonePe could be $100 billion businesses in India, says Walmart CFO",
    "IKIO Lighting IPO: GMP signals strong debut of shares on listing date",
    "ED arrests M3M promoters, Basant and Pankaj Bansal, Hitender Rao",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Google Maps gets three new features: Glanceable directions, Immersive View, more",
    "Cyclone Biparjoy in Pakistan: Here's how Pak is preparing for cyclonic storm",
    "‘Anybody who wants..’ Congress in Karnataka open to Adani investments",
    "New issue of sovereign gold bond scheme to open next week. Key things to know",
    "Cyclone Biporjoy: High tide waves hit Gujarat, Maha as storm intensifies. Watch",
    "Who is Sheila Singh? MS Dhoni's mother-in-law, head of a business worth ₹800 cr",
    "Senthil Balaji case: Court hears pleas by DMK minister, ED; orders expected soon",
    "Bengaluru-Mysuru Expressway",
    "Adani Enterprises share price",
    "Trees to uproot, thatched houses to be wrecked…: IMD on cyclone Biparjoy",
    "Cyclone Biparjoy becomes cyclone with longest lifespan in Arabian Sea. Explained",
    "Cell Point India IPO opens today. GMP, review, other details. Apply or not?",
    "How to lock chats on WhatsApp",
    "BCCI has banned these brands from sponsoring Team India",
    "Midcaps, smallcaps at record high: 10 stocks that can give you healthy returns",
    "India's hydropower firm seeks ₹50 billion from Japanese banks",
    "TVS iQube gets a price hike in Delhi. Here's the new price.."
]