[
    "Tata Motors, TCS, Kotak Bank among nine stocks that analysts recommend buying",
    "PIL in Delhi HC against RBI, SBI over ₹2,000 note exchange without ID proof",
    "Stock Market LIVE: Sensex up, Nifty near 18300; Adani stocks, Tech Mahindra soar",
    "Tax authorities don’t need TCS to catch evaders",
    "It’s more multipolar, but love for dollar isn’t over",
    "Hunt for fake GST registration may turn heat on minnows ....",
    "Bleak week for funding as big deals go missing",
    "IndiGo flies high as rivals gather",
    "Landlords turn up the heat in India’s Silicon Valley",
    "Account aggregators see greater adoption by investment industry",
    "The 1.5° danger mark is glaring at the globe now",
    "PM Modi in US: Indian Americans make big plans to welcome NaMo",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "PhonePe gets an additional $100 million investment from General Atlantic",
    "FIPIC Summit: India's strategic engagement with Pacific Island countries",
    "PPF account: How to open SBI Public Provident Fund account online",
    "Odisha cabinet reshuffle: CM Naveen Patnaik re-inducts 3 ministers into cabinet",
    "Withdrawal of ₹2,000 bank notes part of currency management: RBI Governor",
    "Unclaimed deposits in bank savings accounts, FDs: How to get your money back?",
    "Balaji Amines stock price tanks 15% as CFO resigns",
    "Indian cricket team gets new kit sponsor - Adidas",
    "Australian PM Anthony Albanese welcomes PM Modi for two-day visit",
    "G20 tourism meeting: Srinagar bolsters security. Top ten highlights",
    "How Wall Street is preparing for possible US debt default",
    "Muthoot Finance Q4 Results",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "How to become rich: Top three investment options for you",
    "UK citizens 'moved beyond' my bank account: Rishi Sunak's crisp reply to critics",
    "iQoo Z7s launched in India with 4,500 mAh battery. Check price, specs and more!",
    "Beware of Fake ChatGPT Apps",
    "IPL 2023: Who’ll win Orange Cap?",
    "Dubai gears up to host global Energy Storage Forum ahead of COP28",
    "PhonePe receives $100 mn boost as General Atlantic doubles down on investment",
    "Sharjah explores Indian markets to strengthen business ties",
    "HUL, Genpact partner to launch accelerator programme"
]