[
    "LIC earns Q4 cons PAT of ₹13,191 crore, up 447.5% YoY; declared dividend",
    "Fed in May saw uncertainty about need for more rate hikes, shows meeting minutes",
    "Trident Q4 Results: Net profit declines 28% to ₹129 crore, dividend declared",
    "FDI flows plummets 16% in FY23 to USD 71 billion",
    "Oil India posts 10% rise in Q4 standalone PAT to ₹1,788 cr, dividend declared",
    "LIC reduces stake by over 2% in NHPC to 3.186% in tranches",
    "Humans shed genetic information everywhere they go",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "LIC declares 30% dividend for shareholders from net profit in FY23",
    "India's 2022-23 GDP growth may breach estimated 7 pc: RBI Governor",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "UK visa: International students not allowed to bring family anymore",
    "Adhir Ranjan defends 'Pagla Modi' remark over scrapping of ₹2000 notes",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "ICRA Q4: Net profit up 15% to ₹38.4 cr, dividend declared",
    "SBI S&P BSE Sensex Index Fund NFO closes today. Who should invest?",
    "Who is Sai Varshith Kandula, Indian-origin man charged for threatening Joe Biden",
    "SAD to attend inauguration ceremony on 28 May, says ‘matter of pride…’",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Be wary of the finfluencer mirage",
    "El Niño has cast a long shadow on the Indian economy",
    "Steady progress in doubling farmers’ income: Niti Aayog",
    "Voters pushing for change don’t always get enough of it",
    "India’s bankruptcy code might well be in need of a rescue too",
    "Fresh tax troubles brewing for FPIs",
    "Capital Foods sale: Nestle, ITC in last lap, deal at up to ₹5k cr",
    "Green bonds and guarantees: Key tools to contain global warming",
    "Remember Robert Lucas everytime expectations confound us"
]