[
    "Cyclone Biparjoy LIVE: Cyclone 80 kms away from Jakhau Port, says IMD",
    "Market wrap: Sensex, Nifty snap three-day winning streak on hawkish Fed",
    "RBI rule allowing banks to compromise with wilful defau ....",
    "Mint Explainer: Why the US Federal Reserve didn’t raise rates",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "India's May trade deficit widens to 5-month high of $22 billion; check details",
    "Forget US Fed rate cut, there may be two hikes; should you change your strategy?",
    "Karnataka HC threatens to close down Facebook",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Paytm shares up over 100% in seven months, turn multibagger; can they rise more?",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Small-cap stock below ₹50 jumps 13% in two days after Q4 results",
    "TCS, Infosys other IT stocks may see up to 40% downside, says JPMorgan",
    "May aviation data: Domestic air traffic jumps 36% on year; check details",
    "ITR filing: Income tax department releases ITR-3 Form online. Who should file?",
    "WFI chief Brij Bhushan faces sexual harassment charges, says Delhi Police",
    "SBI Mutual Fund sees rupee strengthening to 80 per US dollar by year-end",
    "Amazon Prime Lite membership launched in India at ₹999",
    "Formula 1 Canadian Grand Prix 2023: Details on schedule, timings and how to watch",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "North Korea fires ballistic missile after failed 'spy' satellite launch",
    "K-pop star Aoora set to perform in Mumbai. Check date, venue",
    "Top 3 Cryptocurrencies for June 2023: Bitcoin, TCRV, Polygon",
    "Oil retreats from lows after US Fed outcome; key triggers affecting crude prices",
    "Nestlé partners TVS Industrial & Logistics Parks to open Coimbatore warehouse",
    "Hindustan Power Exchange crosses 5 billion units trade within 11 months of launch",
    "Kamal Kishore Chatiwal appointed managing director IGL",
    "SAT refuses interim order on Sebi decision in Chandra, Goenka matter",
    "Gold drops by ₹550, silver falls by ₹900 as dollar strengthens on Fed pause",
    "K'taka CM says Centre trying to ‘fail’ rice supply scheme, Bommai slams ‘lame…'"
]