[
    "LIC reduces stake by over 2% in NHPC to 3.186% in tranches",
    "Oil India posts 10% rise in Q4 standalone PAT to ₹1,788 cr, dividend declared",
    "FDI flows plummets 16% in FY23 to USD 71 billion",
    "Nykaa Q4: Net profit declines 71% to ₹2.4 cr, revenue up 34%",
    "Trident Q4 Results: Net profit declines 28% to ₹129 crore, dividend declared",
    "Facebook owner Meta starts final round of layoffs",
    "Humans shed genetic information everywhere they go",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "India's 2022-23 GDP growth may breach estimated 7 pc: RBI Governor",
    "UK visa: International students not allowed to bring family anymore",
    "Adhir Ranjan defends 'Pagla Modi' remark over scrapping of ₹2000 notes",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "ICRA Q4: Net profit up 15% to ₹38.4 cr, dividend declared",
    "SBI S&P BSE Sensex Index Fund NFO closes today. Who should invest?",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "SAD to attend inauguration ceremony on 28 May, says ‘matter of pride…’",
    "Who is Sai Varshith Kandula, Indian-origin man charged for threatening Joe Biden",
    "Top gainers, losers today: Adani stocks, HDFC twins, Sun Pharma; check list here",
    "HDFC AMC gets SEBI's final approval for change in control due to merger",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "On hijab ban, Karnataka minister Priyank Kharge says THIS",
    "Goa Signs MoU with Uttarakhand to Strengthen Tourism Cooperation",
    "US debt ceiling: Yellen reiterates treasury may run out of cash soon as June 1",
    "Five Banks Unlawfully Shared Information on Government Bonds, U.K. Regulator Say",
    "Modi and Albanese talk temple attacks, trade and renewable energy",
    "Karnataka to review BJP govt’s laws 'against' public interest: Minister Kharge",
    "White House, Republicans to convene on US debt ceiling as deadline nears",
    "Goyal stresses quality as top priority for consumers"
]