[
    "Cyient DLM IPO listing date announced. GMP, experts signal strong debut",
    "Key triggers that may dictate stock market rally in near term",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Mercedes-Benz reveals the 2024 CLE, replaces C-Class and E-Class Coupes",
    "New debit credit card rules: How customers will benefit from this RBI proposal",
    "Dividend stock Hindustan Zinc declares ₹7 per share interim dividend",
    "West Bengal Election LIVE: ‘Most sacred day for democracy', says Guv on violence",
    "Monsoon Rain LIVE: Bad weather forces second-day suspension of Amarnath Yatra",
    "Manipur violence: Mob sets two vehicles on fire, intermittent firing reported",
    "'You're dead anyway,' said OceanGate CEO during Titan submersible test-dive",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "Explainer: Why did PM Mark Rutte-led Dutch government collapse?",
    "PM Modi inaugurates several infrastructure development projects in Warangal",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy next week",
    "Adipurush: Manoj Muntashir issues unconditional apology for hurting emotions",
    "DRDO scientist Kurulkar attracted to Pakistani agent, discussed missile systems",
    "Rishabh Pant’s ‘Dabangg’ entry on Threads: Check out",
    "‘Maha CM has been asked to resign,’ says Aaditya Thackeray amid political crisis",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Senco Gold IPO: What GMP, subscription status signal after closure of bidding",
    "West Bengal Panchayat Election: ‘TMC hooliganism crossed…’, BJP on poll violence",
    "Why are FPIs buying and DIIs selling Indian stocks? Will the trend continue?",
    "Indian diplomats in US, UK and Canada brace for the Khalistan protests on 8 July",
    "India to send men and women cricket teams to Asian Games",
    "China Controls Minerals That Run the World—and It Just Fired a Warning Shot",
    "In pics: 2024 Mercedes-Benz CLE revealed officially. Have a look!"
]