[
    "P&W must supply 5 engines per month to Go First: SIAC",
    "FM tells PSBs to boost deposits, farm credit",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "Long notice periods are back",
    "Maruti Suzuki India to double turnover to around ₹1.68 lakh crore by 2030-31",
    "Dabur to report high single digit growth in India business in Q1",
    "Maharashtra News Live: Rahul Gandhi meets Sharad Pawar in Delhi, extends support",
    "Gadkari approves draft notification to mandate AC installation in trucks",
    "Monsoon Rain LIVE: Heavy rain lashes Panaji, 'Red' alert for heavy rains issued",
    "Ahmedabad- Jodhpur Vande Bharat Express: Fare, timings, stoppages, other details",
    "NCLT approves RIL’s financial demerger",
    "Nippon India Smallcap Fund stops lump sum subscription from July 7; details here",
    "Meta stock edges higher after 10 million users sign up on Threads; check details",
    "HC order on Rahul's plea seeking stay on conviction in defamation case tomorrow",
    "As rebel Ajit fires uncle from NCP, Sharad Pawar asserts ‘I am president’",
    "HDFC Bank shares underperform Sensex post-merger; what should you do?",
    "UP govt notifies phase 3 expansion of Noida's Jewar Airport",
    "Chandrayaan-3 launch scheduled for July 14 from Sriharikota,",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "‘Coal export strategy in works; local lithium hunt gains pace’",
    "End of tax benefits worries French FPIs",
    "Will the rupee emerge as a global currency?",
    "India's tariffs on electronics inputs highest amongst competing economies",
    "Medical Commission to rate colleges",
    "Oil marketers’ shares hit 52-week highs on margin hopes",
    "Sebi holds ‘fit and proper’ rule",
    "‘Biocon Biologics ahead of plan in integrating Viatris’",
    "Bulk deals on July 06: Dish TV India, Eris Lifesciences, others exchange hands"
]