[
    "At 4.25%, retail inflation hits 25 month-low in May from 4.7% in April",
    "CoWIN data 'completely safe', reports of break ‘mischievous’: Govt",
    "India's GDP has touched $3.75 trillion-mark in 2023: Nirmala Sitharaman",
    "Yuval Noah Harari argues that AI has hacked the operati ....",
    "Mint Explainer: A modest, not-too-populist hike in MSP",
    "In charts: Does your state face an inflation curse?",
    "Is doing business in China becoming impossible for foreigners?",
    "Small-, mid-caps rally may have steam left",
    "Impasse in free trade talks as Israeli concerns grow ov ....",
    "Understanding the challenges of foreign investments in ....",
    "How easy money killed the great housing dream",
    "India's industrial production up 4.2% in April from 1.1% in March",
    "HCL Tech, Infosys, NTPC top gainers, losers today",
    "Children rescued from Amazon jungle after 40 days, here's how they survived",
    "Life insurers see 4% decline in new business premium to ₹23,477 cr in May",
    "Cyclone Live: Kutch, Saurashtra on orange alert; schools in coastal areas closed",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "No two-wheeler Rapido, Uber bike-taxi in Delhi as SC stays HC permit order",
    "Flipkart Big Saving Days: Apple iPhone 13 is selling with up to ₹11,000 off",
    "Silvio Berlusconi passes away - Know more about ex Italian president in 10 pts",
    "UBS completes Credit Suisse AG takeover, announces leadership changes",
    "As Biparjoy nears, PM Modi directs evacuation, uninterrupted essential services",
    "Silvio Berlusconi, former Italian PM, dies at 86",
    "Haryana farmers block Delhi-Chandigarh highway, seek MSP for sunflower seed",
    "Tesla Power sends this small-cap company's share price in India soaring",
    "Adani Enterprises share price",
    "U.S. to Allow South Korean, Taiwan Chip Makers to Keep Operations in China",
    "China asks last Indian journalist to leave nation this month amid media row",
    "Disney Star rejigs leadership team",
    "Bizotic Commercial IPO: Issue subscribed 37% on Day 1; check details",
    "Global Advertising Forecast to Speed Up After a Slower Start in 2023",
    "Explained: Why Delhivery stock price rallied over 14% today?",
    "Urban Enviro Waste Management IPO: Issue fully booked on Day 1 on retail demand",
    "India, UAE look to boost non-petroleum bilateral trade"
]