[
    "Byju's in talks with global investors who quit board to reconsider decision",
    "UPI to account for 90% of retail digital transactions in next 5 yrs: RBI",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "India's forex reserves rise by $2.35 billion to reach at $596 billion",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Opposition Meeting LIVE: Mallikarjun Kharge to chair next meet in Shimla",
    "Yes Bank to raise ₹25 billion in debt: Report",
    "Apple to launch its credit card in India",
    "PM Modi US visit Live: Antony Blinken raises toast to India-US relations",
    "Adani stocks, IndusInd, Tata Motors, Airtel, SBI among top gainers, losers today",
    "Nifty Bank down about a per cent in June; is the party over for bank stocks?",
    "Will US interest rate hike trigger FII selling in Indian markets?",
    "PM Modi's US visit: Empire State Building lights up in tri-colour | WATCH",
    "Govt introduces 2 changes as it amends Electricity Rules 2020",
    "Adani Enterprises share price",
    "‘MPC’s inaction may drive real rates over 1.5%’",
    "PM Modi meets top CEOs from the US and India as Washington visit concludes",
    "AI Isn’t Coming for Marketers’ Jobs—Not Yet, at Least",
    "Blacklist vendors who offer bribes, say recruiters",
    "Micron India plant to make chips next year",
    "Adani shares plunge on US probe news",
    "Forget the Cost of Living. What’s the Cost of Thriving in America?",
    "This Trading Card Is So Preciousss, It Could Be Worth Millions",
    "Sterling & Wilson RE to look for additional investments: Amit Jain",
    "Higher CPI, volatile stocks: RBI explains how OPEC decisions impact India"
]