[
    "HDFC Bank shares underperform Sensex post-merger; what should you do?",
    "As rebel Ajit Pawar kicks uncle out, Sharad asserts ‘I am president’: Top points",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "Tata to buy back Temasek’s stake in Pay TV platform: Report",
    "Maharashtra News Live: ‘I am president of NCP’ reminds Sharad Pawar after meet",
    "SBI rejigs senior leadership roles in bid to boost dominance",
    "Chandrayaan-3 launch scheduled for July 14 from Sriharikota,",
    "Monsoon Rain LIVE: IMD issues red alert for THESE districts, check details",
    "UP govt notifies phase 3 expansion of Noida's Jewar Airport",
    "FIIs pump in ₹2,641 cr in Indian stocks; DIIs offload ₹ 2,351 cr - July 06 trade",
    "Explainer: Understanding the 'ticket' for Threads on Instagram",
    "Adani Green Energy to raise ₹12,300 crore via QIP; shares edge higher",
    "Bitcoin hits 13-month high, trading at $31,500",
    "BSE approves share buyback up to ₹374.80 crore at ₹816 per share",
    "‘82 or 92…’: Sharad Pawar responds to nephew Ajit’s retirement jibe",
    "From S Jaishankar to Diljit Dosanjh: Who joined Meta's new Threads app on Day 1?",
    "Reliance Jio set to sign $1.7 bn deal with Nokia for 5G equipment: Report",
    "Eicher Motors erases about ₹10,700 crore mcap in 3 sessions; what should you do?",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "'There's no importance if Ajit Pawar says something', says Sharad Pawar",
    "Realme Buds Wireless 3 launched with up to 40 hours of battery life, priced at ..",
    "Bulls In Command; Sensex, Nifty Make New Highs; Investors Richer by ₹2 Lakh Cr | Details"
]