[
    "RBI withdraws ₹2000 note from circulation, to remain legal tender",
    "RBI to transfer ₹87,416 crore dividend payout to govt for FY23",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "JSW Steel Q4 Results: Net profit rises 13% to ₹3,664 crore, dividend declared",
    "SC panel report on Adani-Hindenburg row made public; Group's stocks rise",
    "Europe has led the global charge against big tech. But ....",
    "From high-speed rail to the Olympics, why do big projec ....",
    "Pinball is booming in America, thanks to nostalgia and ....",
    "G7 Summit: PM Modi arrives in Hiroshima, meets Indian diaspora | Watch",
    "Bandhan Bank Q4 result: Net profit decline 57% to ₹808 cr, dividend declared",
    "Zomato’s consol loss narrows in Q4; eyes profitability in next four quarters",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IIFL, Anand Rathi Commodities, Geofin Comtrade face heat in NSEL case",
    "RBI's decision to withdraw ₹2,000 note from circulation evokes meme fest",
    "Centre exempts tax at source on credit, debit card purchases upto ₹700,000",
    "Disney Scraps Plan for Florida Campus, Closes ‘Star Wars’ Hotel Amid DeSantis Fe",
    "Five Best: Novels Set in the 18th Century",
    "Tesla's Cybertruck has a ‘really ugly look’: Shark Tank's Kevin O'Leary",
    "A ‘New Normal’ for Rates? Not So Fast, Says New Fed Research",
    "RBI withdraws ₹2000 notes from circulation: Full text of announcement",
    "RBI website crashes after ₹2,000 notes withdrawn announcement",
    "Gulf Oil Lubricants rally over 4% on dividend announcement of 1250%"
]