[
    "Reliance Jio set to sign $1.7 bn deal with Nokia for 5G equipment: Report",
    "M&M, Tata Motors, HCL Tech, among top gainers, losers today; check full list",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "Adani Green Energy to raise ₹12,300 crore via QIP; shares edge higher",
    "Sensex, Nifty hit fresh record highs; investors richer by nearly ₹2 lakh crore",
    "BSE approves share buyback up to ₹374.80 crore at ₹816 per share",
    "Eicher Motors erases about ₹10,700 crore mcap in 3 sessions; what should you do?",
    "Bitcoin hits 13-month high, trading at $31,500",
    "Explainer: Understanding the 'ticket' for Threads on Instagram",
    "Maharashtra News Live: ‘I am president of NCP’ reminds Sharad Pawar after meet",
    "Monsoon Rain LIVE: IMD issues red alert for THESE districts, check details",
    "Reliance Industries Q1 net profit may fall on weak O2C business, says BofA",
    "MFs vs gold vs real estate: Which is better as stock market is at record high?",
    "'Staying at PM residence without a wife is wrong': Lalu takes jibe at PM Modi",
    "Tata Nexon, Hyundai Creta, Maruti Suzuki Brezza and 7 other top SUVs",
    "Has Indian stock market topped out after hitting life-time high — explained",
    "Missed to link PAN card with Aadhaar? Top ten money losses that you may face",
    "GST Council may define MUVs and XUVs for levy of 22% cess: Report",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "Ashok Gehlot summoned by court in defamation complaint by THIS Union Minister",
    "Sharad Pawar responds to nephew Ajit’s retirement jibe: ‘Still effective'",
    "Motorola signs Kriti Sanon as brand ambassador for Razr phones",
    "Chandrayaan-3 launch scheduled for July 14 from Sriharikota",
    "Rains over Southern Peninsula to ease starting Friday, says IMD",
    "New CM for Maharashtra amid NCP rift? Opposition leaders say Eknath Shinde will…",
    "French President’s diplomatic adviser calls on PM Modi",
    "Gold, Silver Price Today: Precious metals range-bound on easing dollar index",
    "FPIs net buyers in June quarter as inflows surge to 10-month high; check details"
]