[
    "Fresh tax troubles brewing for FPIs",
    "Reliance Industries softens hiring in retail, telecom, cuts duplication",
    "Can India become a developed nation by 2047?",
    "Breaking down India’s diesel plan, in 5 charts",
    "Strategic response: India's standardization efforts to ....",
    "Beyond inflation: Exploring the roadmap for global econ ....",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Invest long term, invest in India: Quant founder Sandeep Tandon",
    "The Centre must not become reliant on RBI payouts",
    "El Niño has cast a long shadow on the Indian economy",
    "Capital Foods sale: Nestle, ITC in last lap, deal at up to ₹5k cr",
    "Growth likely at 6.5% in FY24; war on inflation continues: Das",
    "Thatcher, Sunak and the politics of the supermarket",
    "Where did covid-19 come from?",
    "Humans shed genetic information everywhere they go",
    "In America climate hawks and Big Oil alike cheer geothe ....",
    "How the Iraq war bent America’s army out of shape",
    "Nineteen opposition parties vow to skip Parliament opening",
    "Govt to integrate MSME Global Mart with ONDC",
    "Generative AI Pilots Have Companies Reaching for the Guardrails",
    "America’s Biggest Bank Is Everywhere—and It Isn’t Done Growing",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "2 killed in shooting in Rhode Island, suspect shot dead by police",
    "Chinese hackers targeting critical US infrastructure, says Microsoft",
    "Tina Turner, rock legend, dies at 83",
    "India allows exports of broken rice to meet food security needs of other nations",
    "Digitisation unlatched emerging roadmaps in debts' collections: Credgenics",
    "Horoscope Today: Money astrological predictions for 25 May 2023",
    "Fed in May saw uncertainty about need for more rate hikes, shows meeting minutes",
    "Steady progress in doubling farmers’ income: Niti Aayog"
]