[
    "Phasing out ₹2000 denomination notes: five things you need to know",
    "Centre exempts tax at source on credit, debit card purchases upto ₹700,000",
    "RBI withdraws ₹2000 note from circulation, to remain legal tender",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "What happens to your ₹2000 note now? Read RBI's 15-point explainer here",
    "Zomato announces three top-level appointments",
    "Karnataka swearing-in ceremony on Saturday: Who's invited and who's not?",
    "RBI to transfer ₹87,416 crore dividend payout to govt for FY23",
    "Zomato’s consol loss narrows in Q4; eyes profitability in next four quarters",
    "JSW Steel Q4 Results: Net profit rises 13% to ₹3,664 crore, dividend declared",
    "Bandhan Bank Q4 result: Net profit decline 57% to ₹808 cr, dividend declared",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "RBI website crashes after ₹2,000 notes withdrawn announcement",
    "India prepared to protect its sovereignty and dignity: PM Modi on India-China",
    "'India will require 14 cr litre of SAF/annum to achieve 1% blending in jet fuel'",
    "Top gainers and losers in trade today: Adani Enterprises, NTPC ; Check list here",
    "Gyanvapi Case: SC stays HC order allowing scientific survey of ‘Shivling’",
    "Aryan Khan case: HC asks CBI not to take coercive action against Sameer Wankhede",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "ZEE5 unveils slate of 100 plus titles",
    "China’s Shein to have no equity investment in its tie up with Reliance Retail",
    "NGEL, HMEL join hands to explore opportunities in generation of GH",
    "IREDA urges proactive carbon capture storage and sequestration in Bangkok",
    "Centre bars pulses traders from holding imported stocks beyond a month"
]