[
    "Adani Green Energy to raise ₹12,300 crore via QIP; shares edge higher",
    "Sensex, Nifty hit fresh record highs; investors richer by nearly ₹2 lakh crore",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "BSE approves share buyback up to ₹374.80 crore at ₹816 per share",
    "Eicher Motors erases about ₹10,700 crore mcap in 3 sessions; what should you do?",
    "Bitcoin hits 13-month high, trading at $31,500",
    "Tata Nexon, Hyundai Creta, Maruti Suzuki Brezza and 7 other top SUVs",
    "Explainer: Understanding the 'ticket' for Threads on Instagram",
    "Maharashtra News Live: NCP meeting begins at Sharad Pawar's home",
    "MFs vs gold vs real estate: Which is better as stock market is at record high?",
    "Monsoon Rain LIVE: Red alert issued for Kerala, Goa, Coastal Karnataka",
    "Has Indian stock market topped out after hitting life-time high — explained",
    "Missed to link PAN card with Aadhaar? Top ten money losses that you may face",
    "GST Council may define MUVs and XUVs for levy of 22% cess: Report",
    "Ajit's associates acquired sugar cooperative assets at throwaway prices: Court",
    "Cyient DLM IPO: Share allotment declared. What GMP (grey market premium) signals",
    "After TCS, Tata Steel fires 38 employees for breaching its ‘code of conduct’",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "PM Narendra Modi to visit these four states on 7, 8 July",
    "OnePlus Nord 3 vs Motorola Edge 40",
    "Delhi Monsoon: Rains cause waterlogging, traffic jams in the national capital",
    "Small-cap stock hits life-time high after rallying 250% in two years",
    "HDFC Bank-HDFC merger: Top ten changes for FD, RD, and other depositors",
    "How women-led startups bridge the gender funding gap in India?"
]