[
    "IndiGo Q4 result: Net profit at ₹919.2 cr, revenue jumps 76%",
    "ITC Q4FY23 Results: Net profit up 22.7% to ₹5,225.02 crore, declares dividend",
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore; declares dividend",
    "Lessons from finance’s experience with artificial intelligence",
    "Mint Explainer: What's on the cards at the G7 Summit in ....",
    "Kissinger: for the safety of Europe, get Ukraine into NATO",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "The world could soon breach its 1.5°C target for global warming",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Supreme Court stays West Bengal govt ban on ‘The Kerala Story’",
    "Swiggy's food delivery business turns profitable: CEO",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Top gainers and losers in trade today: HCL Tech, Airtel, SBI; Check list here",
    "Siddaramaiah to be next Karnataka CM: How Congress stalwart made it to top?",
    "Realty, PSU Bank, FMCG, Pharma drag Sensex by 130 pts; Nifty down 50 pts",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "DK Shivakumar to be Karnataka's new Deputy CM: All you need to know",
    "PNG Housing Finance Q4 Results: Net profit up 64% to ₹279 crore, NII up 27%",
    "Banks credit to NBFCs sees robust growth, mutual funds pare exposure: Report",
    "Reduce GST rates on two-wheelers from 28% to 18%, FADA appeals to GST council",
    "GAIL Q4 result: Net profit at ₹603.52 cr, revenue up 21%",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Who is Arjun Ram Meghwal, the newly appointed law minister of India?",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "WhatsApp could redesign Android version's menu with these features. Details here",
    "The Health Tests You Need at Age 30, 40 and 50",
    "UPSC to recruit specialists from private sector on contract basis for 12 govt departments",
    "Google, Amazon, Meta are hiring low-paid H1B workers for specialized roles",
    "Android users switching to iPhones at 5-year high: Report",
    "Apple's new feature will allow you to clone your voice in 15 minutes"
]