[
    "Gold, silver price jumps as US dollar hits 5-week low. Good opportunity to buy?",
    "Sovereign Gold Bond: Scheme 2023-24 opens next week. Should you apply?",
    "Mint Explainer: Why did Canada halt ties with China's a ....",
    "Sooner or later, America’s financial system could seize up",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "Mutual Fund Investment: These ten mid-caps gave up to 45% return in one year",
    "Sensex, Nifty close to life-time high. Experts recommend these 10 stocks to buy",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Manipur news: Two injured as security forces, mobs clash in Imphal",
    "In pics: Mercedes-Benz Vision One-Eleven Concept with Gullwing doors unleashed",
    "Nitin Gadkari's responds to politician's advice on joining the Congress",
    "Mercedes-Benz unveils futuristic Vision One-Eleven Concept with Gullwing doors",
    "HDFC twins merger: RBI clarifies on HDFC Bank's commercial liabilities",
    "Cyclone Biparjoy LIVE: Amit Shah visits cyclone-affected areas of Gujarat",
    "Adipurush: Manoj Muntashir responds to Lord Hanuman's ‘jalegi tere..’ dialogue",
    "Cyclone Biparjoy: Amit Shah to visit cyclone-affected areas of Gujarat",
    "Assam CM condemns assault on Assamese delivery agent in Karnataka",
    "Ex-Goldman banker takes stand in risky denial of insider charges",
    "Heatwave alert: IMD predicts extreme high temperature in these states",
    "Ola Electric joins the 60-month loan trend, offers 6.99% interest rate at S1 range",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Instead of Advertising in Videogames, These Cos Asked: ‘Why Not Make Our Own?’",
    "₹500 notes worth ₹88,032.5 crore missing from Indian economy: Report",
    "Hindu Sena files writ petition in Delhi High Court against 'Adipurush'",
    "Kochi Metro offers commuters ride to any station at just ₹20 today. Here's why",
    "Defence minister to meet Vietnamese counterpart to boost bilateral ties",
    "What happens if you cut off sugar for a month?",
    "NIA to probe Khalistani elements' attacks on Indian High Commission in Canada,US"
]