[
    "MSCI rejig: Adani shares log worst week since Feb 2023. Loses $10 billion m-cap",
    "Karnataka oath-taking ceremony LIVE: Siddaramaiah sworn in as Karnataka CM",
    "Delhi services row: Centre moves SC seeking review of May 11 Constitution",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "How the scrapping of 2000-rupee note will affect Indian economy economy?",
    "Shankar Sharma reacts to ₹2000 notes withdrawal, 20% TCS",
    "PM Modi meets world leaders at G7 Summit 2023",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Siddaramaiah takes oath as Karnataka Chief Minister today",
    "Karnataka cabinet: G Parameshwara, KH Muniyappa, KJ George, MB Patil take oath",
    "₹2,000 notes withdrawal: Ex-CEA gives 5 reasons why decision is good",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — May 22",
    "Kapil Sibal criticises PM Modi's decision to phase out ₹2000 notes",
    "Sebi has this good news for mutual fund investors. Details inside",
    "Why FIIs are bullish on Indian stock market? Experts list out these top 5 reason",
    "How Will We Know When Self-Driving Cars Are Safe?",
    "Centre doing to stop Delhi govt's work: AAP on 'unconstitutional' ordinance",
    "JP Morgan optimistic on Rekha Jhunjhunwala-led banking stock; do you own any?",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PM Modi meets South Korean president on sidelines of G-7 Summit",
    "DK Shivakumar sworn in as Karnataka's Deputy Chief Minister",
    "Jerome Powell Keeps June Interest-Rate Pause in Play",
    "Instagram's new text based app could feature 500 characters word limit for users: Report",
    "Do this if you have ₹2000 notes"
]