[
    "'Foxconn withdrawal from Vedanta JV has no impact on India's semiconductorgoals'",
    "GST Council to meet on July 11: Online gaming tax, ITC claim key items on agenda",
    "India overtakes China to become most attractive emerging market for investing",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Fed likely to lift rates on July 26; how can it impact the market, rupee?",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Foxconn dumps $19.5 billion Vedanta chip plan in India, a look at timeline",
    "Four Indian-origin biz leaders in 2023 Forbes' 100 richest self-made women list",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Monsoon LIVE News: Indian Army moves to Zirakpur; to help 730 stranded students",
    "Tata Motors becomes 16th most valued automaker, beats Kia Corporation m-cap",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "Foxconn pulls out of semiconductor JV, Vedanta says other partners lined up",
    "Go First airline seeks investor interest as part of insolvency process",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Which is better?",
    "Mutual Funds: Small-cap fund inflows at record high of ₹5,472 crore in June",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Bitcoin, Coinbase Are Soaring Despite Obstacles Facing Spot Bitcoin ETFs",
    "Centre's direct tax collection rises 14.65% till mid-July",
    "Auction for sale (re-issue) of govt securities: Here’s what you need to know",
    "No question of amicable settlement with SpiceJet: Marans",
    "Putin met Wagner’s Prigozhin days after mutiny. Here's what they discussed",
    "The Country With the Highest Murder Rate Now Has the Highest Incarceration Rate",
    "Novak Djokovic left embarrassed after tripping over Wimbledon net: Watch",
    "What is Guillain-Barre syndrome? Peru declares national emergency amid surge in"
]