[
    "Nifty hits 19,000 for the first time; here's what fuelling market rally today",
    "Ideaforge IPO gets investors interested in primary market: Should you subscribe?",
    "Adani Stocks today: Adani Enterprises, Adani Ports among top gainers on Nifty",
    "The choice between a poorer today and a hotter tomorrow",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Can the Gupta siblings solve Lupin’s US puzzle?",
    "How to report foreign stocks in your income tax returns",
    "The TCS episode holds transparency lessons",
    "Share Market LIVE: Nifty touches 19000, Sensex hits 64k; Adani, NTPC jump",
    "Turmoil at Byju’s highlights hurdles for India startup scene",
    "ChatGPT iOS app users can now access the internet. Here's how",
    "Tata Motors trademarks 'Frest' nameplate. Is it for production-Curvv-based SUV?",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Mahindra XUV700 will now be available in 40 weeks, as waiting period reduced",
    "Sensex, Nifty hit record highs; Adani stocks, metals, banks soar",
    "Watch: Heated dispute starts over Eid goat in residential society",
    "QS World University Rankings 2024: Top 30 Universities in the World",
    "Uniform Civil Code EXPLAINER | What is UCC? What does Constitution say about it",
    "Tech Mahindra's CEO takes 50% pay cut in FY 2023. This is how much he earned..",
    "Jana Small Finance Bank raises ₹560 cr from Damani, Kacholia, others: Report",
    "Why Do Tata Group Stocks Continue to Rally?",
    "Byju's crisis: ‘Not all rags to riches stories are of honest..’, Hansal Mehta",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "America’s $800bn climate splurge is feeding a new lobbying ecosystem",
    "ChatGPT, Bard like AI tools to be used for job interviews in near future: Survey",
    "HDFC Bank may see $29 million inflows in NSE index rejig; Check full list here",
    "Sweden police grant permit for ‘Quran burning protest’ outside mosque",
    "Indians trim shopping budgets for wedding amid high inflation",
    "Mumbai: BMC cautions about heavy to very heavy rainfall in next 4-5 days",
    "Amazon Prime Day: Top deals on iQoo, realme, Motorola, boAt, Sony and more",
    "Cyient DLM IPO: Issue fully booked on Day 2; retail portion sees huge interest",
    "‘Meghan Markle not a great talent as an audio personality’"
]