[
    "Bank of Baroda shares up over 100% in last one year; is this stock still a buy?",
    "Fitch raises India's GDP forecast to 6.3% from 6% for FY24",
    "Lupin share price up 39% in last one year; can it rise more?",
    "How generative models could go wrong",
    "Is Indian aviation headed for a duopoly?",
    "Inflation is as corrosive to investing as it is to the ....",
    "Comeback on cards for distressed asset market",
    "Steady retail prices, easing crude lift margins of oil ....",
    "It’s déjà vu for cement investors as polls near",
    "Is it too late to revive BSNL?",
    "How beneficial are premium banking services for HNIs?",
    "Share Market LIVE: Sensex sheds 200 pts, Nifty down 50; Bajaj Finance, TaMo lag",
    "Shankar Sharma portfolio: Brightcom Group share price hits lower circuit",
    "Indian banks race to deploy QR codes at merchant locations: Report",
    "PM Modi US Visit LIVE: In a rare press conference, Modi to address 2 questions",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Titanic Submarine LIVE Updates: Rescuers hunt crew members; 5 hrs of oxygen left",
    "Higher pension from EPF: Why EPFO needs to extend the deadline again",
    "Need to improve sovereign debt restructuring process, says Janet Yellen",
    "Apple rolls out iOS 16.5.1 update, fixes ‘critical’ security flaw on iPhones",
    "Why are sugar stocks rising today?",
    "ITR filing: How salaried individuals can file their returns without Form 16",
    "Sri Lankan Navy arrests 22 Indian fishermen",
    "SBI extends these two special fixed deposit (FD) schemes. Check details here",
    "Mark Zuckerberg vs Elon Musk",
    "Tata Motors share price Today",
    "Adani Enterprises share price",
    "MS Dhoni vs Ravindra Jadeja: What CSK CEO said on ‘rift’ between the legends",
    "Insta loving GenZ prefer YouTube, shopping on Amazon, says survey",
    "Monsoon may gain momentum in next 3-4 days: IMD",
    "Lunch snacks to burn belly fat faster",
    "Small-cap stock below ₹25: Sugar stock hits 52-week high. Do you own?",
    "'Most Wanted' monkey captured after 20 attacks, ₹21,000 bounty claimed",
    "HMA Agro IPO: Issue subscribed 91% so far on Day 3; check details",
    "Want to buy Apple iPhone 14 under ₹40,000? You should not miss THIS deal on Flipkart",
    "Amazon.in’s 5G Revolution Sale smartphone offers: OnePlus 11 5G, Samsung S23 Ultra 5G",
    "Cyient DLM IPO to open on June 27, price band announced; check here"
]