[
    "Adani Group in talks for its first major debt refinancing of up to $3.8 billion",
    "Explained: How the US Fed rate hike will impact the Indian stock market",
    "Kotak Bank, Asian Paints, Titan among top gainers, losers today",
    "Mint Explainer: Will ghost offices soon haunt Hyderabad?",
    "Mint Explainer: What is Silvio Berlusconi’s legacy?",
    "Is the global housing slump over?",
    "Mint Explainer: Why Boris Johnson’s dramatic exit is ba ....",
    "How the new generation of weight-loss drugs work",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "‘Even children knew…’: Rakesh Tikait on ex-Twitter CEO Jack Dorsey’s claims",
    "Cosmic CRF IPO to open on June 14; Check details here",
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Cyclone Biparjoy: IMD issues flood alert in THESE Gujarat districts",
    "Rahul Gandhi's ‘truck trip' in US, coupled with Sidhu Moosewala songs | Watch",
    "Market wrap: Sensex, Nifty end higher; mid, smallcaps hit all-time high",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "BJP calls Dorsey's ‘govt pressure’ charge ‘white lie’, Oppn says ‘no reason'",
    "Tremors felt in Delhi: Earthquake of magnitude 5.7 in Jammu & Kashmir",
    "Income tax alert: Pay your first instalment of advance tax by this date",
    "Best Bakery Case: Mumbai Court acquits two accused",
    "Sensex tops 63000, Nifty ends 100 pts higher; Asian Paints, ITC, Titan gain",
    "Twitter to be 'world's most accurate real-time info source': CEO Linda Yaccarino",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "Signal failure disrupts train services on Mumbai’s Western Railway line",
    "Food secy asks state officials to ensure adherence to wheat stocking limits",
    "Adani Group's power project to be ready by December 2024: Sri Lankan minister",
    "Delhi court allows Karti Chidambaram to travel abroad",
    "Rajasthan news: BJP protests against Ashok Gehlot govt over ‘paper leak’",
    "BP Refinery Suffered Cascade of Malfunctions Before Fatal Explosion, Agency Says",
    "Manipur violence: Amid Kuki protest, Meitei too refuses to join peace talk",
    "Toyota EV Mimics Manual Transmission With Feel of Gear Shifts, Roaring Engine",
    "₹1 Lakh A Piece! MRF Becomes First Indian Stock To Touch 6 Digits | Details"
]