[
    "Dividend stock Hindustan Zinc declares ₹7 per share interim dividend",
    "New debit credit card rules: How customers will benefit from this RBI proposal",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy next week",
    "Jio Financial Services: Expected share price, record date, other details",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Kashmiri saffron costlier by 63% in one year after GI tag",
    "West Bengal Election LIVE: ‘Most sacred day for democracy', says Guv on violence",
    "‘Maha CM has been asked to resign,’ says Aaditya Thackeray amid political crisis",
    "Monsoon Rain LIVE: Bad weather forces second-day suspension of Amarnath Yatra",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "Rahul Gandhi drives tractor, sows seeds with farmers at fields in Haryana",
    "Elon Musk replies to his own parody Twitter account. Here's what he says …",
    "Delhi's IG airport is all set to get India's first elevated cross taxiway",
    "Rishabh Pant’s ‘Dabangg’ entry on Threads: Check out",
    "DRDO scientist Kurulkar attracted to Pakistani agent, discussed missile systems",
    "UCC draft report expected to be submitted to Uttarakhand govt by July 15",
    "Where To Watch 'Sound of Freedom' (2023) Free Online Streaming Here's How",
    "PM Modi to inaugurate expressway section of Amritsar-Jamnagar economic corridor",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Scenic train routes of South India",
    "Manipur violence: Mob sets two vehicles on fire, intermittent firing reported",
    "NATO’s New Focus on China Creates Internal Tension About Mission Creep",
    "Explainer: Why did PM Mark Rutte-led Dutch government collapse?",
    "'You're dead anyway,' said OceanGate CEO during Titan submersible test-dive",
    "Mercedes-Benz reveals the 2024 CLE, replaces C-Class and E-Class Coupes",
    "Veteran US actor John Deyle dies at 68",
    "Delhi: Video of two women pole dancing inside metro goes viral. Internet divided",
    "Monsoon Rain: Traffic movement halted on Jammu-Srinagar NH following landslides"
]