[
    "Elon Musk’s Neuralink gets nod to test brain implants in humans",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "We need just one big cluster to become an electronics hub",
    "A decade of reformist action has catalysed the emergenc ....",
    "Manipur violence: Amit Shah says those behind violence will not be spared",
    "New Parliament Inauguration LIVE: 25 political parties confirm their presence",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "Sony-Zee merger: NCLAT likely to hear Zee Entertainment’s petition today",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Which mutual funds can get cheaper post Sebi’s TER proposals?",
    "G20: Section 144 imposed in North-east Delhi to avert any riot-like situation",
    "Google Chrome unleashed personalisation power with new desktop customisations",
    "WhatsApp to soon introduce username feature. Here's how it will work",
    "Stocks to Watch: Reliance, Vodafone Idea, Emami, OIL, Zee Entertainment",
    "Global market: Asian shares rise following Wall Street tech rally",
    "Day trading guide for today: Five buy or sell stocks for Friday- May 26",
    "RBI presses work 24x7 to pump out ₹500 notes",
    "Gyanvapi case: Allahabad court to hear Waqf Board's petition today",
    "Virgin Galactic completes final test flight ahead of taking paying customers",
    "New Parliament Inauguration",
    "Update Aadhar Card Details",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Blockbuster takes a jibe at Netflix over new password-sharing policy",
    "'Jockey' maker Page Industries share price drops 10% on weak Q4 results",
    "‘Will force govt to change POSCO Act’: WFI chief",
    "Rupee opens flat at 82.73 against US dollar",
    "IT raids in 40 locations in Tamil Nadu linked to Minister Senthil Balaji",
    "Can Nifty 50 sustain the 18,300-levels in June F&O series?",
    "Bajaj Auto shares plummet on stock market"
]