[
    "NaBFID planning to offer takeout loans",
    "Irdai asks insurers to create ABHA IDs for policy seekers",
    "In charts: Does your state face an inflation curse?",
    "Small-, mid-caps rally may have steam left",
    "Impasse in free trade talks as Israeli concerns grow ov ....",
    "Understanding the challenges of foreign investments in ....",
    "How easy money killed the great housing dream",
    "The gift of inheritance: Should you sell the property o ....",
    "BSNL’s revival plan must be followed by reforms",
    "Ex-ante regulations can hurt the growth of India’s digi ....",
    "BAM Digital to set up 2nd data centre in Mumbai",
    "PVR Inox’s investors need more Pathaans, and soon enough",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Indian stock market delivered higher returns than US, China in last 123 yrs: DSP",
    "Sequoia Capital to sell 10.18% stake in Go Fashion via block deal: Report",
    "UAE emerges fourth largest investor in India during FY23; check FDI data",
    "TCS, Canara bank, Indian Bank, these 27 stocks to turn ex-dividend this week",
    "IndiGo Amritsar-Ahmedabad flight enters Pakistan amid bad weather",
    "Market cap of 6 of top-10 most valued firm fall by 1.84 lakh crore last week",
    "These 3 Tata Group stocks to trade ex-dividend this week. Do you own any?",
    "Wilmington Trust SP Services moves NCLT to initiate insolvency against SpiceJet",
    "Stock market triggers: US Fed policy, macro data, others may drive Sensex, Nifty",
    "IPOs this week: HMA Agro Industries, Bizotic Commercial, others. Details here",
    "Three points in WTC 2023 Final when Team India took the ‘wrong’ turn",
    "India's GDP expanding 6-6.3% in Q1: Moody's",
    "Adani Enterprises share price",
    "What is Espionage Act and what might it mean for Trump?",
    "Rodri named UEFA Champions League player of the season 2022-23",
    "As Fed signals rate pause, Powell will have to placate hawks",
    "Elon Musk's SpaceX hires new 14-year-old software engineer. Know more",
    "Horoscope Today: Money astrological predictions for 12 June 2023",
    "Sam Altman clarifies amid furore over remarks on India's ‘hopeless’ ChatGPT bid",
    "Netizens slam Anushka Sharma over WTC final, call her ‘panauti of Indian cricket",
    "Telcos push for secure smart meters with licensed spectrum",
    "RoCs crack whip on erring cos",
    "Indian companies suffer as Chinese steel floods market"
]