[
    "Banks' asset quality best in a decade, expected to improve further: RBI",
    "Indices end at record closing high, Nifty hits 19,000 for the first time",
    "Ideaforge IPO gets investors interested in primary market: Should you subscribe?",
    "India’s stock market rally should survive the coming Fe ....",
    "Talking about AI in human terms is natural—but wrong",
    "The choice between a poorer today and a hotter tomorrow",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Can the Gupta siblings solve Lupin’s US puzzle?",
    "Tata AIA introduces industry's first premium payment via WhatsApp and UPI",
    "IndiGo becomes India's leading airline to touch ₹1 lakh crore in market value",
    "Adani stocks, Tata Motors, HDFC Life among top gainers, losers today",
    "Karnataka govt to give money instead of 5 kg additional rice to BPL families",
    "ChatGPT, Bard like AI tools to be used for job interviews in near future: Survey",
    "ITR filing errors: Ten mistakes people do while filing their taxes",
    "Nifty hits 19,000 for the first time; here's what is fuelling market rally today",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Mahindra XUV700 will now be available in 40 weeks, as waiting period reduced",
    "ChatGPT iOS app users can now access the internet. Here's how",
    "Tata Motors trademarks 'Frest' nameplate. Is it for production-Curvv-based SUV?",
    "Adani Stocks today: Adani Enterprises, Adani Ports among top gainers on Nifty",
    "Turmoil at Byju’s highlights hurdles for India startup scene",
    "Sensex, Nifty achieve all-time closing highs; Adani stocks, RIL, TaMo shine",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Asia offers hope to Solana and Cardano, Tradecurve offers hope to traders",
    "Unveiling the Future of Tokenized Assets: Golteum (GLTM)",
    "Foods to boost immunity during monsoon",
    "Gold prices fall ₹300; silver prices down ₹350",
    "TVS Motors partners with Zomato to deploy EVs for last-mile deliveries",
    "AAP extends ‘in principle’ support to Uniform Civil Code",
    "Cabinet approves introduction of National Research Foundation Bill in Parliament",
    "Kerala female medicos seek 'surgical hoods' as alternative to hijab inside OT",
    "Cabinet approves ratification of Headquarters Agreement between India, CDRI"
]