[
    "Paytm shares: Morgan Stanley, BofA, Citi give 'buy' tag after 60% rally in YTD",
    "Dabur’s June quarter update is decent but fails to impress Street",
    "Share Market LIVE: Banks drag Sensex sub 65,500; Adani Ports, Powergrid shed",
    "Gujarat HC refuses to stay Rahul Gandhi's conviction",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Small-cap funds are all the rage, but should you buy?",
    "India’s shield of privacy should reflect Article 21",
    "A 445% price jump makes tomatoes more pricey than gasoline in India",
    "Karnataka budget 2023 Live Updates: CM Siddaramaiah presents budget in assembly",
    "No more NSFW? Reddit blocks access to porn, obscenity via third-party apps",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Who is Parth Pawar? Maharashtra's Pawar family power struggle divides NCP",
    "Byju’s crisis leads Blume Ventures shift strategy, cut ‘frivolous’ investments",
    "India books record Airbus orders in June 2023",
    "No tomato in McDonald's food as prices surge across India",
    "'Modi Surname' defamation case verdict: What happens next for Rahul Gandhi",
    "Massive fire engulfs three coaches of Falaknuma Express",
    "Sobha stock surges on robust quarterly sales, record high realisations",
    "Tomato prices reach ₹250 per kg in THIS state",
    "'...We have no choice but to rob the bank,' says Rajiv Bajaj of Bajaj Auto",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Karnataka Budget: Liquor prices to soar as CM Siddaramaiah proposes duty hike",
    "5 Interesting facts about 4th of July",
    "Watch: Drivers trapped in cars after hailstorm, flooding",
    "Modi guarantees ‘action against corruption’, says PM Modi",
    "Abusive words against Prime Minister derogatory, not seditious: Karnataka HC",
    "'Murder of democracy': DK Shivkumar's big attack after Gujarat HC verdict",
    "Paytm solidifies its merchant payments leadership; records 21 lakh devices deployed in 2023 so far",
    "SpaceX gets licenses in Mongolia to offer high-speed internet via Starlink Satellites",
    "UGC NET 2023: Provisional answer key out; raise objections till this date"
]