[
    "Second leg of new Parliament inauguration begins",
    "GDP, PMI data, auto sales, global trends to dictate Indian markets in week ahead",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "Activist investors are needed more than ever",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Move Over, Mars. Elon Musk Turns His Attention to 2024 ....",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "How laddering, barbell can get you better returns from FDs",
    "New Parliament inauguration LIVE: PM begins opening ceremony; Phogat detained",
    "Week Ahead | OPEC+ output, US debt ceiling: Key triggers for global oil market",
    "5.9 magnitude earthquake strikes Afghanistan; tremors felt in Delhi",
    "‘I’m happy I didn't go there': Sharad Pawar on new Parliament inauguration",
    "Here is why Dabur and Reliance are top technical bets",
    "Can Shubman Gill break Virat Kohli's 973 run record? Sunil Gavaskar opines",
    "Mann Ki Baat LIVE Updates: ‘PM Museum adding beauty to Delhi’, says PM Modi",
    "India facing `very complicated challenge' from China: Jaishankar on border issue",
    "Shah Rukh Khan faces online criticism with voice-over on new parliament building",
    "Navigating the debt ceiling: Selling the plan and making it a law",
    "Hrithik Roshan and Alia Bhatt win the award for best actor at IIFA 2023",
    "India bolsters cyber defenses in weeklong exercise amid growing threats",
    "PM Modi envisions new Parliament as a beacon of empowerment and dreams",
    "Mahapanchayat will certainly be held today, says wrestler Bajrang Punia",
    "Messi breaks Ronaldo's record for most goals scored in Europe's top five leagues",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "Investing ₹10 Lakh in Small Saving Schemes",
    "US Debt Ceiling Crisis Affecting Gold Price",
    "IMD Yellow Alert Maharashtra",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IPL 2023: Gujarat Titans vs Chennai Super Kings preview",
    "In pics: McLaren Artura makes a striking entry into India. Have a look!",
    "Mahila Samman Mahapanchayat: Scuffle between police, protesting wrestlers",
    "China jet to rival Airbus, Boeing makes first commercial flight",
    "PM Modi, LS Speaker, ministers pay tributes to Savarkar on his birth anniversary"
]