[
    "National Securities Depository Limited (NSDL) files DRHP with SEBI for IPO",
    "Sachin Pilot reveals BIG move involving CM Gehlot ahead of Rajasthan polls",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "HCL Tech, TCS, Wipro major Q1 results to look out for in July10-14 trading week",
    "FPIs invest ₹21,944 cr in first week of July in Indian stocks, here's why",
    "Up to 25% cut in train ticket prices by Indian Railways, including Vande Bharat",
    "West Bengal Election LIVE: Voting halted in Dinhata, Murshidabad; death toll- 12",
    "Adani buys 30% in online train ticket booking platform Trainman for ₹3.5 crore",
    "Monsoon Rain LIVE:Delhi witnesses season's first heavy spell of rain",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "'Na tired hu, na retired, I'm fire': Sharad Pawar quotes Vajpayee on retirement",
    "Delhi High Court turns down PepsiCo's appeal against revocation of potato patent",
    "RIL fixes record date for equity shares allotment, listing of Reliance Strategic",
    "MS Dhoni's unique birthday celebration is breaking internet: Here's a glimpse",
    "Russian fighter jets ‘harassing’ American MQ-9 drones over Syria: US",
    "Rohit, Kohli, Hardik, Jadeja to miss Asian Games; BCCI makes 5 announcements",
    "RailTel awarded 39.37 cr project for enhanced security in immigration Services",
    "India, Pak, PUBG: Husband seeks PM Modi's intervention, asks to send wife back",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "July third-quarter moon can be watched tonight. Here's all about it",
    "55 stocks to trade ex-dividend from July 10-14; LTIMindtree, Titan, M&M in list",
    "Kajol breaks silence after being trolled on social media, here's what SHE says",
    "In Battle With Microsoft, Google Bets on Medical AI Program",
    "Your Smartphone Can Have Two Lines. Here’s Why You’d Want That.",
    "Silvio Berlusconi left over ₹906.29 cr for his last girlfriend Marta Fascina",
    "‘Congress ka matlab hai loot ki dukan…:’ PM Modi kicks off Rajasthan campaign"
]