[
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday",
    "IKIO Lighting IPO: What GMP signals as focus shifts towards share allotment date",
    "Russia’s war on Ukraine is changing Europe",
    "Why Sequoia Capital is sawing off its Chinese branch",
    "Data recap: Rail crash, Apple’s headset, PMI",
    "Most train accidents due to human error, not sabotage",
    "Decade of dedication: 20% TCS staff celebrate 10th anniversary",
    "Pause by RBI, served with caution",
    "Dark truth: Meta's battle against child-sex content on Instagram",
    "How online bond platforms are leveraging Sebi-RBI regul ....",
    "Sharad Pawar hands big roles to Supriya Sule in presence of Ajit Pawar",
    "Sam Altman says India's ChatGPT attempt is ‘hopeless’. Tech Mahindra CEO reacts",
    "Mutual fund calculator: Monthly SIP you need to become a crorepati in 10 years",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Can India break THIS 121-year-old record to win the WTC 2023 Final?",
    "Ind vs Aus Day 4 LIVE Score, WTC Final 2023: Marnus Labuschagne departs for 41",
    "Cyclone Biparjoy: IMD issues heavy rain alert in 3 states for next 3 days",
    "Citi group to cut 50 London investment and corporate banking jobs",
    "Indian Navy showcases maritime power with twin-carrier operations in Arabian Sea",
    "Manipur violence: Centre constitutes committee to initiate peace process",
    "Army Chief reviews passing out parade at Indian Military Academy",
    "Wrestlers will inform about…: Bajrang Punia on discussion with the Centre",
    "Stronger El Nino dims monsoon prospects",
    "Adani Enterprises share price",
    "Discounts on Tata Tigor, Tiago, Altroz, Safari and more this June. Check it out",
    "Bizotic Commercial IPO opens next week. GMP, other details about BSE SME issue",
    "Monsoon may cover Kerala, some more parts of southern peninsula in next 24 hours",
    "Oil posts second weekly decline; what's overweighing Saudi output cut?",
    "NEET UG results 2023 to be declared next week. Details here",
    "Pandemic-induced consumption slowdown a thing of past: Chief Economic Advisor",
    "Manipur: 3 shot dead in Kuki village by assailants disguised in army uniforms",
    "J&K's Industrial Policy draws ₹2200 cr investment, 10,000 jobs in one year",
    "Wrestler Sakshi Malik threatens not to participate in Asian games",
    "Father's Day 2023: 5 tech gifts ideas"
]