[
    "HDFC - HDFC Bank merger to be effective July 1, says Deepak Parekh",
    "Air India-Vistara merger: Not so fast, says CCI",
    "Tata Technologies IPO gets Sebi nod",
    "Stock market holiday: NSE, BSE to remain closed on this date not on Wednesday",
    "ICC World Cup 2023 schedule live updates: India to play Pakistan on Oct 15",
    "Gautam Adani terms Hindenburg report as ‘targeted misinformation'",
    "An acrimonious debate about covid’s origins will rumble on",
    "A new class of drugs for weight loss could end obesity",
    "India’s IT industry must weed out corruption in hiring",
    "Americans love American stocks. They should look overseas",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Zudio's fashion finesse boosts Trent's growth plans",
    "Share Market LIVE: Sensex climbs 300 pts; HDFC Life jumps 5%; Cipla lags",
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "Portfolio management: Best investment options for your child. Read here",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Monsoon news LIVE: Several parts of Rajasthan receive light to moderate rain",
    "Surging India internet stocks trounce China peers, widening gap",
    "TCS names new head of hiring amid probe",
    "Cyient DLM IPO: GMP, subscription status, other details. Should you apply?",
    "PM Modi flags off five Vande Bharat Express from Bhopal",
    "Russia LIVE: Wagner chief's business jet landed in Belarus",
    "Adani Enterprises share price",
    "Central govt to release Tur dal from national buffer till imported stocks arrive",
    "From Instant line of credit to flexibility in repayment, here's what MSMEs want",
    "NYC to Move Forward With Congestion Toll",
    "HAL board approves stock split in 1:2 ratio, declares dividend, check details",
    "Belly fat exercises you can do in 10 minutes",
    "5 Tips to take care of oily skin in monsoon weather",
    "ICC World Cup 2023: Here's how to book tickets online"
]