[
    "ITC Q4FY23 Results: Net profit up 22.7% to ₹5,225.02 crore, declares dividend",
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore; declares dividend",
    "Supreme Court stays West Bengal govt ban on ‘The Kerala Story’",
    "Kissinger: for the safety of Europe, get Ukraine into NATO",
    "The world could soon breach its 1.5°C target for global warming",
    "Mint Explainer: What's on the cards at the G7 Summit in ....",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Swiggy's food delivery business turns profitable: CEO",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Siddaramaiah to be next Karnataka CM: How Congress stalwart made it to top?",
    "Realty, PSU Bank, FMCG, Pharma drag Sensex by 130 pts; Nifty down 50 pts",
    "GAIL Q4 result: Net profit at ₹603.52 cr, revenue up 21%",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Who is Arjun Ram Meghwal, the newly appointed law minister of India?",
    "ITC share price falls over 2% after Q4 results",
    "Multibagger specialty chemical stock recommends 500% dividend, FIIs stake up in Q4: Do you own?",
    "The Kerala Story: Art has to be provocative, says Harish Salve",
    "SC refuses to stay Patna HC order halting caste survey conducted by Bihar govt",
    "Instagram down for some users, facing glitch in Stories",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Less than a third of Indian businesses confident of ESG preparedness: Deloitte Survey",
    "Farmers block railway tracks after video of cop slapping woman surfaces: Watch",
    "India’s first elevated 8-lane access control road likely to be completed by April 2024: Gadkari",
    "Crucial Russia-Ukraine Grain Deal Extended; UN, U.S. Welcome The Move",
    "Amazon Doubles Down On Brand India; AWS To Invest $12.7 Bn By 2030"
]