[
    "Tata Motors Q4 results: Beats estimates, consolidated PAT rises to ₹5,408 cr",
    "CPI falls below RBI's upper tolerance limit for first time in 14 mnths, at 4.7%",
    "‘Will extend time for probe, but..’: What SC told SEBI on Adani-Hindenburg case",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Cipla Q4 results: Consolidated PAT at ₹526 cr, declares dividend",
    "Vedanta Q4 results: Net profit declines 56% to ₹2,634 crore, revenue down 5%",
    "FPIs bullish on Indian market since March; can the momentum sustain?",
    "DLF Q4 results: Net profit up 40% YoY, 200% dividend declared",
    "SC notice to West Bengal govt for ban on ‘The Kerala Story’ film",
    "Sameer Wankhede in CBI net in ₹25 cr bribery case for ‘not framing’ Aryan Khan",
    "Hindustan Aeronautics Q4 Results announced, net profit down 8.8%",
    "Factory output rises 1.10% in March, grows by 5.1% in FY23",
    "Imran Khan gets relief from Islamabad HC in corruption case, granted 2-week bail",
    "Manappuram Finance Q4: Net profit rises 58% to ₹429 crore, dividend declared",
    "Air India woman in cockpit case: DGCA imposes ₹30 lakh fine on carrier",
    "Cyclone Mocha LIVE: Hundreds of thousands to be evacuated in Bangladesh, Myanmar",
    "CBSE Class 10 result out: ‘No merit list to avoid unhealthy competition’",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Byju’s raises $250 million from Davidson Kempner as part of $1 billion round",
    "Congress won't form coalition govt with JD(S) in Karnataka, says Jairam Ramesh",
    "IMD alert: Heatwave, very heavy rainfall predicted till 15 May. Full forecast",
    "RBI imposes ₹2.92 Cr penalty on Canara Bank",
    "5 more Vande Bharat trains to be launched by June-end",
    "'If we don't work': Pilot draws parallel with K'taka, mounts pressure on Cong",
    "IPL 2023: MI vs GT Dream 11 fantasy team prediction today. Whom to choose?",
    "Midsize Bank Panic to Test Regulators’ Skepticism of Mergers"
]