[
    "Sensex, Nifty end higher on gains led by RIL; mid, smallcaps underperform",
    "Go First airline seeks investor interest as part of insolvency process",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Which is better?",
    "Mutual Funds: Small-cap fund inflows at record high of ₹5,472 crore in June",
    "SAT refuses to grant stay on order against Punit Goenka, Subash Chandra",
    "Hyundai Exter SUV launched in India at a starting price of ₹5,99,900!",
    "Bank of Baroda to PNB: These three banking stocks hit 52-week high",
    "Monsoon LIVE News: IMD issues red alert for Chandigarh, Panchkula and Mohali",
    "Sensex, Nifty ends marginally higher; RIL, Tata Steel jump; Titan, HCL drag",
    "Weather Alert: List of trains cancelled due to heavy rainfall. Details here",
    "No amicable settlement between SpiceJet and Maran: Sun Group",
    "Stocks to buy this week: Experts suggest these eight technical picks",
    "Energy drink under scrutiny for containing caffeine of 6 Coke cans, 2 Red Bulls",
    "Elon Musk to take over Meta for a day if he wins a cage fight against Mark Zuckerberg?",
    "Rajya Sabha polls: TMC announces six new candidates",
    "West Bengal Panchayat Polls",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Amazon Prime Day: Best deals on smartphones revealed!",
    "India top emerging market for investing in EM debt: Invesco Report",
    "Real estate sector likely to see net profit growth of 27% YoY in Q1FY24",
    "The world needs an international agency for artificial intelligence, say two AI experts",
    "Uber charged a US couple ₹24 lakh for a single ride. Here’s what happened next…",
    "Ordinance on control of services: SC notice to Centre on plea filed by Delhi govt",
    "David Warner to retire from Tests after Ashes 2023? Wife Candice drops big hint",
    "Vadilal Industries shares hit 52-week high, soar 18%; here's why",
    "Japan pivots back to nuclear power"
]