[
    "P&W must supply 5 engines per month to Go First: SIAC",
    "FM tells PSBs to boost deposits, farm credit",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "Dabur to report high single digit growth in India business in Q1",
    "Gadkari approves draft notification to mandate AC installation in trucks",
    "Meta stock edges higher after 10 million users sign up on Threads; check details",
    "Nippon India Smallcap Fund stops lump sum subscription from July 7; details here",
    "Maharashtra News Live: Rahul Gandhi meets Sharad Pawar in Delhi, extends support",
    "Monsoon Rain LIVE: Heavy rain lashes Panaji, 'Red' alert for heavy rains issued",
    "Ahmedabad- Jodhpur Vande Bharat Express: Fare, timings, stoppages, other details",
    "As rebel Ajit fires uncle from NCP, Sharad Pawar asserts ‘I am president’",
    "HDFC Bank shares underperform Sensex post-merger; what should you do?",
    "UP govt notifies phase 3 expansion of Noida's Jewar Airport",
    "Chandrayaan-3 launch scheduled for July 14 from Sriharikota,",
    "SBI rejigs senior leadership roles in bid to boost dominance",
    "Tata to buy back Temasek’s stake in Pay TV platform: Report",
    "FIIs pump in ₹2,641 cr in Indian stocks; DIIs offload ₹ 2,351 cr - July 06 trade",
    "Explainer: Understanding the 'ticket' for Threads on Instagram",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "NCLT approves demerger of financial services unit of Reliance Industries",
    "The waves come ashore, a few nanoseconds early",
    "Traffic woes, waterlogging cause loss of working hours in NCR: Survey",
    "India may permit Sri Lanka to repay debt over 12 years",
    "Input cost surge prompts automakers to raise prices",
    "Thali plates reflect spike in food prices",
    "KEC International hits new 52-week high with ₹1,042 crore order win"
]