[
    "IdeaForge share price falls 18% as profit-booking follows bumper listing",
    "Q1 Result preview: Oil companies' earnings may improve with Crude below $80/bbl",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "The rise of cyber threats in a digital dystopia",
    "Share Market LIVE: Sensex gains 450 pts; Maruti, HUL shine; UPL lags",
    "Vedanta share price drops almost 3%; here's why Foxconn decided to exit the JV",
    "Abrogation of Article 370: SC to hear batch of plea from 2 August",
    "GST Council LIVE: 50th Council meet to be held today; Here's what is expected",
    "Multibagger stock that has surged 650% in three years declares 1:1 bonus shares",
    "Delhi rains: Yamuna crosses danger mark, evacuation begins, old bridge closed",
    "Q1 results preview: Here's why pharma companies are expected to show improvement",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "New York floods leave one dead, rescue crew race into Vermont after heavy rain",
    "Barbie Premiere: Actors dazzle in Barbie-inspired outfits on the pink carpet",
    "J&K: Supreme Court to hear petitions challenging abrogation of Article 370 today",
    "Brij Bhushan ‘sexually harassed, molested and stalked wrestlers’: Delhi Police",
    "Senco Gold IPO allotment date today. Latest GMP, how to check status online",
    "Andhra Pradesh: 7 dead, 15 injured after bus fell into a canal",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "MS Dhoni calls Indian all-rounder 'a drug', says ‘won’t see him mature…'",
    "Tata Group close to an agreement on manufacturing iPhones in India",
    "Should you buy gold as US dollar index hits nine week low on de-dollarisation?",
    "Maruti Suzuki becomes number one player in ₹10 lakh to ₹20 lakh vehicle category",
    "Delhi rain updates: LG V K Saxena says lack of planning led to waterlogging",
    "L&T inks ship repair pact with US Navy",
    "Delhi HC denies bail to Sukesh Chandershekhar's wife in ₹200 cr extortion case",
    "'Joined Ajit Pawar's camp because...,' Chhagan Bhujbal responds to Sharad Pawar",
    "Premier Explosives shares hit 20% upper circuit on ₹552.26 crore order win"
]