[
    "IKIO Lighting IPO listing: Stock lists at a premium of 37.7% on NSE",
    "Cyclone Biparjoy LIVE: Cyclone weakens in Gujarat; power outage in 940 villages",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "The great Indian monsoon gamble",
    "Motilal MF’s new micro-cap index fund tests the limits",
    "Public safety as priority: Aim for a paradigm shift",
    "Companies can use a social girdle to reduce corporate p ....",
    "IKIO Lighting shares make dream debut at Indian stock market. Buy, sell or hold?",
    "Stock Market LIVE: Banks lift Sensex, Nifty; Bajaj Finserv, ITC jump; Wipro lags",
    "Govt likely to get record ₹63,000 crore dividend from listed PSUs: Report",
    "Gold price trades tepid despite US dollar hitting five week low. Should you buy?",
    "Cyclone Biparjoy LIVE tracking: Landfall, current Location and other details",
    "Bengal: TMC leader ready to give 'qurbaani' as violence erupts",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Can Adipurush, featuring Kriti Sanon-Prabhas, drive PVR-Inox's fortunes in Q1?",
    "Wipro buyback record date today. Should you tender your shares?",
    "US Congressman says India better suited for resolving Ukraine crisis, not China",
    "Cyclone Biparjoy batters Gujarat: 2 dead, 23 injured, power services disrupted",
    "Ramkrishna Forgings shares hit 52-week high on order win; check details",
    "Zara sells shirt with ‘Hindi words that make no sense’",
    "Meta Platforms urges EU telecoms to seek alternatives before Big Tech subsidies",
    "Nifty predictions June 16: Index may face resistance at 18,750",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "‘Manipur has totally failed,’ RK Ranjan Singh after mob torches his house",
    "Vodafone Idea abandons 25,000 retail partners as cost cutting measure: Report",
    "Earthquake of 4.8 magnitude hits Bangladesh",
    "West Bengal govt challenges deployment of central forces in Panchayat polls",
    "Heavy rain causes landslide on Mizoram's National Highway-6, disrupts traffic",
    "Father's Day 2023: 5 Last-minute electronics gift ideas. Have a look!",
    "PM Modi's bilateral visits to USA, Egypt to strengthen diplomatic relations",
    "PM Modi to lead yoga session at UN Headquarters on June 21",
    "Adipurush review: Fans praise Prabhas, Kriti Sanon starrer. Check reactions"
]