[
    "Cyclone Biparjoy LIVE: Cyclone about 30 km away from Jakhau Port, says IMD",
    "Go First looks to resume flights by end June; Shailendra Ajmera gets NCLT nod",
    "RBI rule allowing banks to compromise with wilful defau ....",
    "Mint Explainer: Why the US Federal Reserve didn’t raise rates",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "May aviation data: Domestic air traffic jumps 36% on year; check details",
    "At 3.25%, ECB hikes rates to 22-year high as it battles inflation; check details",
    "India's May trade deficit widens to 5-month high of $22 billion; check details",
    "Defence Ministry approves ‘predator drone’ deal ahead of PM Modi's US visit",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Wipro share buyback record date tomorrow; what should investors do?",
    "Oil retreats from lows after US Fed outcome; key triggers affecting crude prices",
    "Why has cryptocurrency market tumbled despite Fed pausing key rates?",
    "Forget US Fed rate cut, there may be two hikes; should you change your strategy?",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Zee Entertainment, Tata Chemicals, 7 others under F&O ban on NSE on June 16",
    "India gears up for $168 billion finance giant as HDFC merger gets closer",
    "Can Prabhas-Kriti Sanon starrer Adipurush drive PVR-Inox's fortunes in Q1FY24?",
    "India's debt level is likely to decline, says Moody's",
    "Beyoncé is the reason for high inflation in Sweden | Explained",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "IndiGo hits record market share in domestic aviation",
    "Health ID push sparks security concerns",
    "Audit firms must be truly independent: NFRA chairperson",
    "2023 to become hottest year ever? Global temperature rises by 1.5 degrees",
    "SAT directs Sebi to respond to Chandra, Goenka plea in 48 hrs",
    "Agrochem biz stares at China, demand issues",
    "The way of the water in tea, toilets",
    "Trade gap hits 5-month high as exports drop 10% in May",
    "SBI Chairman's ₹37 lakh salary in FY23 incomparable to private bank peers",
    "India considers lithium mining royalty at 3% of LME price- govt sources"
]