[
    "Adani Power to Adani Ports: Adani shares trade red. Market cap dips ₹52,000 cr",
    "Bribes-for-jobs scandal rocks TCS, four sacked for corruption",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Share Market LIVE: Sensex, Nifty in red; Adani stocks tumble, Airtel up",
    "IT stocks fall after Accenture cuts earnings growth guidance",
    "Opposition Meet LIVE: ‘War of ideology going on in India,’ says Rahul Gandhi",
    "Delhi CR Park firing: Masked men shoot at car, driver injured",
    "Titanic Submarine LIVE: Deep-sea robots find debris, search continues for bodies",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi US visit Live: ‘Not an era of war but of dialogue, diplomacy’, says Modi",
    "TikTok expands e-commerce reach with 'Trendy Beat' shopping section in the UK",
    "Small-cap FMCG stock BCL Industries declares 1:10 stock split, final dividend",
    "How OceanGate's Titan submersible imploded. Explained in 5 points",
    "HMA Agro Industries Ltd IPO: GMP, subscription status as subscription ends today",
    "Orchid Pharma shares hit 52-week high, rise 5% on launching QIP to raise funds",
    "HP launches Victus 16, Omen 16, Omen Transcend 16, new gaming laptops in India. All details",
    "Bizotic Commercial SME IPO lists at a premium but fail to sustain gains",
    "Banking stocks trade volatile; Nomura says banks in a sweet spot",
    "Adani Enterprises share price",
    "Eros International share price plunges over 17%, near 52-week low; here's why",
    "Adani Enterprises’ JV with EdgeConneX raises $213 million to build data center",
    "Infosys shares underperform BSE IT, Sensex in last one year; should you buy it?",
    "Govt introduces 2 changes as it amends Electricity Rules 2020",
    "Thanks Congress for announcing ‘can't defeat PM Modi alone,’ says Smriti Irani"
]