[
    "Day trading guide for today: Six buy or sell stocks for Thursday — June 22",
    "Stocks to Watch: Zee Entertainment, TCS, Delhivery, RIL, NTPC, PTC India",
    "PM Modi US Visit LIVE: US President, First Lady host intimate dinner for PM Modi",
    "Global market: Asian shares mixed as Powell hints more interest rate hikes",
    "Is Indian aviation headed for a duopoly?",
    "Comeback on cards for distressed asset market",
    "Steady retail prices, easing crude lift margins of oil ....",
    "It’s déjà vu for cement investors as polls near",
    "Is it too late to revive BSNL?",
    "How beneficial are premium banking services for HNIs?",
    "India-US ties have rarely had superior prospects",
    "The G20 can build a global bridge to a future of sustai ....",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 22nd June",
    "Powell signals higher interest rates, says inflation fight not over",
    "Two Tata stocks to turn ex-dividend today; key highlights here",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi urges global attention to food security at G20 ....",
    "IEA chief pitches for ambitious G20 agenda on clean ene ....",
    "G20: IFAD chief Alvaro Lario visits India to advocate f ....",
    "G20 Development Ministers' Meet: India releases 7-year ....",
    "G20 FWG meeting discusses global economic outlook, stra ....",
    "Modi for G20 action to attain sustainable development goals",
    "India to host G20 development ministers' meeting in Var ....",
    "Hyderabad to host G20 agriculture ministers meeting from 15 June",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "PM Modi's US visit: US to facilitate visa easing for skilled Indian",
    "From Marinated millet to stuffed mushroom; check menu for PM Modi's State Dinner",
    "Share Market LIVE: Sensex, Nifty to start with caution; SGX Nifty in red",
    "ICC, BCCI reject Pakistan’s request to change Indian venue",
    "World's largest Ramayan temple in Bihar to be completed by 2025: Report",
    "You can claim interest paid for home loan fully repaid before possession",
    "Google Doodle celebrates Dragon Boat Festival. Here's all you to know",
    "Paris blast: Over 37 injured, sniffer dogs pick up scent under rubble",
    "Delhi Metro reacts to viral photo of PDA at Huda City Centre",
    "Jagannath Rath Yatra 2023 LIVE",
    "International Yoga Day 2023 LIVE",
    "PM Modi US visit key highlights",
    "Hdfc Bank share price Today",
    "Adani Enterprises share price",
    "Karnataka Bandh today against abnormal hike in electricity charges",
    "PM Modi presents unique gifts to US President and First Lady",
    "Warren Buffett donates Berkshire stocks to Bill & Melinda Gates Foundation",
    "BGMI redeem codes for June 22, 2023: Unlock exciting rewards and free gifts!",
    "Nifty predictions June 22: A decisive move above 18,900 to open further upside",
    "Suzlon Share Price Live blog for 22 Jun 2023",
    "Hdfc Bank Share Price Live blog for 22 Jun 2023",
    "Ongc Share Price Live blog for 22 Jun 2023",
    "Itc Share Price Live blog for 22 Jun 2023",
    "Powergrid Share Price Live blog for 22 Jun 2023"
]