[
    "Beating estimates, India’s GDP expands 7.2% in FY23",
    "India reopens bids for $10-bn chip plan",
    "Explained: What drove India's GDP growth in FY23?",
    "Breaking boundaries: Insurance sector's promising shift",
    "Food security: India's ₹1-trillion scheme to boost coo ....",
    "JK Cement strikes the right note with investors",
    "How startups changed Thiruvananthapuram",
    "How a will can secure your legacy, and your family's inheritance",
    "EV makers should learn to survive sans support",
    "Mapping the climate transition by identifying policy in ....",
    "Sebi moves to deter promoters from misusing FPI route",
    "Core sector growth falls to 6-month low",
    "How the Iraq war became a threat to American democracy",
    "The fault lines in America’s China policy",
    "The real next big thing in business automation",
    "The revealing appeal of China’s cheapest city",
    "Old tyres can become a climate-friendly fuel",
    "What the latest FSA price hikes mean for Coal India investors",
    "Firm refining prospects add to confidence on OMC outlook",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Is It OK to Track Your Spouse’s Location?",
    "Finally, Can We Ask Who Really Colluded With Russia?",
    "Generative AI Pilots Have Companies Reaching for the Guardrails",
    "America’s Biggest Bank Is Everywhere—and It Isn’t Done Growing",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "Wrestlers Protest News Live",
    "Stock Market Investors News",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "World Milk Day: Know history and significance",
    "Theranos blood-testing hoax: Holmes enters Texas prison to serve 11-yr sentence",
    "Aviation ministry proposes draft aircraft bill to simplify regulations",
    "Global stock markets slump ahead of US debt deal vote",
    "Elizabeth Holmes’s Victims Likely Won’t Get Much Restitution for Theranos Fraud",
    "Diehards Still Mailing Newspaper Clips to Family and Friends",
    "Nearly 4 Million Kia Cars Have Potentially Explosive Air-Bag Inflators, Document",
    "Perovskite Solar Cells Push Bounds of Efficiency",
    "Amazon Turns to AI to Weed Out Damaged Goods"
]