[
    "Byju's in talks with global investors who quit board to reconsider decision",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Sensex, Nifty fall for 2nd straight session; investors lose nearly ₹3 lakh crore",
    "Apple to launch its credit card in India",
    "Adani Power to Adani Ports: Adani shares trade red. Market cap dips ₹52,000 cr",
    "Paytm share price jumps over 90% from life-time low. Is more steam left?",
    "Opposition Meeting LIVE: Mallikarjun Kharge to chair next meet in Shimla",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "BofA Securities raises target price on Paytm; do you own?",
    "Titanic Submarine LIVE: OceanGate co-founder hits back at James Cameron",
    "PM Modi US visit Live: ‘Not an era of war but of dialogue, diplomacy’, says Modi",
    "Maharashtra govt sets up SIT to probe ₹12,024 crore BMC corruption case",
    "Adani stocks, IndusInd, Tata Motors, Airtel, SBI among top gainers, losers today",
    "Govt introduces 2 changes as it amends Electricity Rules 2020",
    "PM Modi to come back with 300 seats: Amit Shah challenges the opposition",
    "MoS IT speaks on announcements in tech space during PM Modi's US visit",
    "How OceanGate's Titan submersible imploded. Explained in 5 points",
    "Adani Enterprises share price",
    "ESIC-run social security scheme adds over 13.5 lakh new members in April",
    "PM Modi's US visit: Empire State Building lights up in tri-colour | WATCH",
    "Micron & Applied Material Deals; Game Changer For India’s Chip Making Plans | Explained",
    "Uttarakhand Premier League to have talent from Mumbai Indians",
    "PM Modi Wins Over Top CEOs; India To Get Jet Engines, Semi Conductor Mfg., Investments | Details",
    "BPCL shares down 4% as it consider fund raising via rights issue on June 28",
    "Veefin Solutions IPO: Subscription status on Day 2 and other issue details",
    "Kamat Hotels India launches hotel management, leasing arm, Ira by Orchid Hotels",
    "Will US interest rate hike trigger FII selling in Indian markets?"
]