[
    "Midcaps, smallcaps at record high: 10 stocks that can give you healthy returns",
    "Cyclone Biparjoy LIVE: Powerful cyclone 170 km away from Jakhau port in Gujarat",
    "Stock Market LIVE: Bank, IT keep Sensex, Nifty in red; Divi's, M&M shine",
    "RBI rule allowing banks to compromise with wilful defau ....",
    "Mint Explainer: Why the US Federal Reserve didn’t raise rates",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "Price of prestige: Exploring the allure of club members ....",
    "Karnataka HC threatens to close down Facebook",
    "Adani Power to Adani Enterprises: Mutual funds sold these Adani shares in May 20",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Paytm shares up 100% in seven months, turn multibagger; can it rise more?",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Small-cap stock below ₹50 jumps 13% in two days after Q4 results",
    "TCS, Infosys other IT stocks may see up to 40% downside, says JPMorgan",
    "ITR filing: Income tax department releases ITR-3 Form online. Who should file?",
    "Railway Board expresses concern over unsafe signal reconnections",
    "Delhi Police recommends cancellation of case against WFI chief",
    "SBI Mutual Fund sees rupee strengthening to 80 per US dollar by year-end",
    "Amazon Prime Lite membership launched in India at ₹999",
    "Formula 1 Canadian Grand Prix 2023: Details on schedule, timings and how to watch",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "RBI rule allowing banks to compromise with wilful defaulters is misguided",
    "Want to buy Maruti Suzuki Jimny? You will have to wait for over 8 months",
    "Hotel company Accor signs Katrina Kaif for out of home, digital campaign",
    "Covid-19: India records 106 new cases",
    "juSTa Hotels’ parent Onora Hospitality launches new resorts"
]