[
    "IdeaForge Technology IPO: Issue fully booked on Day 1; check details",
    "‘Won't have any negative impact on…’ RBI Governor on ₹2,000 notes withdrawal",
    "Most Adani Group stocks rise in early trade; Adani Enterprises up over 2%",
    "Why Yes Bank share price is rising today — explained",
    "Share Market LIVE: Sensex, Nifty turn flat; Adani Ent, Cipla shine; NTPC sheds",
    "The meaning of Prigozhin’s short-lived mutiny",
    "Diabetes: The ticking time bomb",
    "A strange revolt in Russia: Is this the end of Putin?",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in ....",
    "Indian markets go with the FII flow",
    "Four surprising facets shaping mutual fund returns",
    "Should your retirement nest be far from the teeming crowd?",
    "India-US relations: Set for a strategic upgrade",
    "“We are bringing new vehicles that will run on ethanol,” says Nitin Gadkari",
    "ideaForge IPO fully subscribed on day one of bidding. GMP, review, apply or not?",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "ICC to announce World Cup 2023 schedule today",
    "Investing in ideaForge Technology IPO? Here are key risk factors to know",
    "MrBeast Titanic declined Titanic submersible expedition",
    "Jammu Srinagar national highway blocked for traffic due to landslides",
    "Infosys signs $454 million deal with Danske Bank; here's why",
    "Mercedes-Benz aims for 20% of total sales to be driven by pre-owned cars",
    "‘Hi-tech train cooling system’: Netizens slam Railways over water leakage video",
    "Assam floods: Situation still grim as heavy rainfall affects 5 lakh people in t",
    "ICICI Securities share price hits 52-week high as board to consider delisting",
    "Adani Enterprises share price",
    "Vivo Y36 vs Redmi Note 12 5G",
    "They Stopped Sharing Their Netflix Password. Is Family Therapy Next?",
    "Manali-Chandigarh highway blocked due to rainfall; restoration work underway",
    "The Reasons More People Are Working in Their 80s",
    "How small caps can outperform other segments in terms of wealth creation?",
    "Assam: Pilgrims throng Kamakhya temple on the occasion of Ambubachi Mela",
    "Junk-Rated Companies Accept Tougher Terms to Borrow",
    "Pill for Obesity Has Wall Street Salivating",
    "Penny stock fixes record date for 4:1 bonus shares after ₹77.50/share dividend"
]