[
    "Tata Motors shares hit record high driven by strong JLR sales",
    "Tata Motors, Titan, Powergrid, among top gainers, losers today; check full list",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "SEBI updates rules to ease the debt securities issuers' disclosure structure",
    "SC directs SpiceJet to pay entire arbitration award of ₹380 cr to Maran",
    "Govt in talks with industry on extension of FAME scheme, says official",
    "SBI, PNB, BoB to Canara Bank: Why experts are bullish on PSU bank shares",
    "Defamation law was misused, says Congress | LIVE",
    "Karnataka budget 2023 Live Updates: CM Siddaramaiah presents budget in assembly",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Sexual harassment charges: Delhi court summons Brij Bhushan Singh, Vinod Tomar",
    "Sensex, Nifty fall by almost a per cent; investors poorer by about ₹2 lakh crore",
    "Utkarsh Small Finance Bank IPO to open on July 12; check details",
    "Olectra makes 52-week high after receiving an order exceeding its market cap",
    "Cyient DLM IPO: GMP jumps as focus shift towards listing date",
    "First alzheimer’s drug Leqembi to slow disease progression gets FDA approval",
    "World’s richest cricketer is an Indian; can you guess who?",
    "'Speak Now' re-released, Swifties celebrate with ‘everything purple’. See here",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "US likely to supply Ukraine with deadly Cluster Bombs. All you need to know",
    "As Pankaja Munde denies quitting BJP, Fadnavis says ‘personal views'",
    "AccelerateBS India IPO: GMP, subscription status on day 2, and other key details",
    "‘Christians, tribals likely to be exempted from UCC’: Centre assures Nagaland",
    "NTPC Group’s total installed capacity touches 73,024 MW",
    "Samsung Galaxy M34 5G launched in India ₹16,999. Here’s features, specs, more",
    "Here's How To Watch Jujutsu Kaisen Season 2 Free Online"
]