[
    "PKH Ventures IPO opens today: GMP, price, other details. Apply or not?",
    "Share Market LIVE: Sensex, Nifty at new highs; IT, PSU Bank jump",
    "Why states are falling short on capital spending",
    "Data recap: Services trade, diabetes woes, and more",
    "P&G can set up plants in India for exports: India M ....",
    "Pigment of hope: Paint companies find some respite as costs ease",
    "Where have all the startup hedgehogs gone?",
    "Verified trading P&Ls are fine, but be wary of the loopholes",
    "India needs stronger statistical system for better policymaking",
    "Fiscal federalism needs a look-in by the 16th Finance Commission",
    "HDFC to vault into ranks of world’s most valuable banks after merger",
    "Monsoon Rains: Mumbai local train status to traffic snarls; Latest updates here",
    "PAN-Aadhaar linking deadline: Today is the last day. Ensure linkage, else…",
    "Explained: What is affirmative action, now banned in the US?",
    "‘Make in India’, visible effect on Indian economy,' says Russian President Putin",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Kasargod-Trivandrum Vande Bharat Express emerges as top performer",
    "Monsoon Rain: Badrinath highway reopened for traffic after 17 hours",
    "SGX Nifty up, Asian markets drop amid mixed cues",
    "Stocks to Watch: ICICI Bank, ICICI Sec, BPCL, Adani Total, RIL, Airtel, ONGC",
    "After tomatoes, onion prices likely to shoot up by THIS month",
    "Chaos over locker agreement update: Customers still confused about new rules",
    "Manipur Live Updates: ‘Peace has to be our only priority', says Rahul Gandhi",
    "NCP, BJP had meetings ahead of oath-taking in 2019, Sharad Pawar admits",
    "Day trading guide: Stocks to buy or sell, dividend stocks to watch on June 30",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Aspartame ‘probable carcinogen’ sweetener commonly used in Diet Coke, Mars Bar",
    "Manipur: Rahul Gandhi to visit violence-affected people in Moirang today",
    "France Protest LIVE: Hundreds arrested as unrest spreads over teen's killing",
    "Rupee opens 5 paise higher at 82.01 against the US dollar",
    "ideaForge IPO closes today: Latest GMP to subscription status. Apply or not?",
    "French riots spread in third night of unrest. Why people are protesting?",
    "Virgin Galactic completes first manned mission to space",
    "BGMI redeem codes for June 30, 2023: Unlock exciting rewards and free gifts!",
    "Apple shares may see another 30% upside, says Citi"
]