[
    "GST Council to meet on July 11: Online gaming tax, ITC claim key items on agenda",
    "Foxconn ending Vedanta JV has no impact on India's semiconductor goals: Govt",
    "SBI to divest its 2% equity stake in NSDL IPO via OFS",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "The rise of cyber threats in a digital dystopia",
    "India overtakes China to become most attractive emerging market for investing",
    "Fed likely to lift rates on July 26; how can it impact the market, rupee?",
    "US visa: VFS global to temporarily shut down application process on THESE dates",
    "Centre's direct tax collection rises 14.65% till mid-July",
    "India to surpass US to become world's 2nd largest economy by 2075: Goldman Sachs",
    "Foxconn dumps $19.5 billion Vedanta chip plan in India, a look at timeline",
    "Four Indian-origin biz leaders in 2023 Forbes' 100 richest self-made women list",
    "Monsoon LIVE News: IMD issues yellow alert for Delhi; expect heavy downpour",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "Tata Motors becomes 16th most valued automaker, beats Kia Corporation m-cap",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Massive shelf cloud appears in Haridwar amid heavy rains. Watch",
    "Global markets update: US stocks up marginally as investors await inflation data",
    "Climate Change: July began with world's hottest week on record, says UN",
    "Truck swept away by river as Himachal Pradesh reels amid torrential rain - Watch",
    "Prince Harry and Meghan Markle ‘very much in love’ and ‘happy together’",
    "Centre collects ₹4.75 trillion in net direct tax receipts so far this year",
    "Artificial intelligence lashes at the doorstep of films, entertainment",
    "Navantia, L&T sign pact to jointly bid for Navy's P75 (I) submarine programme"
]