[
    "Airtel Business rejigs its leadership team; CEO Ajay Chitkara resigns",
    "Goldman Sachs to layoff employees, including managing directors globally",
    "Wagner revolt could hasten end of Ukraine war",
    "Labour’s green industrial policy will not cure Britain’ ....",
    "Mint Explainer: New chip announcements represent baby steps",
    "Our early-adopters index examines how corporate America ....",
    "Modi’s US visit underlines India’s growing geopolitical heft",
    "The meaning of Prigozhin’s short-lived mutiny",
    "Diabetes: The ticking time bomb",
    "A strange revolt in Russia: Is this the end of Putin?",
    "UBS raises IndiGo share price target, sees 33% upside; here's why",
    "Maruti Suzuki, TCS, Cipla, Shree Cements top gainers, losers today",
    "ideaForge IPO: How Infosys may benefit from drone maker company's public issue?",
    "ideaForge IPO fully subscribed on day one of bidding. GMP, review, apply or not?",
    "Sensex, Nifty end flat; Adani Ent, Cipla shine; RIL, TCS drag",
    "UAE-based Lulu Group to invest ₹10,000 crore in India over 3 years",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "EPFO launches calculator for higher EPS pension additional contribution",
    "Adani Power commissions 2nd unit of Jharkhand's thermal plant, stock up 2.85%",
    "Market wrap: Sensex ends flat, Nifty settles below 18,700",
    "Himachal monsoon update: Landslide on NH-21 creates 15-km traffic jam,",
    "Maruti Suzuki Invicto's interior leaked. Here's what spy images suggest..",
    "Monsoon Update: Heavy rain alert in Kerala, yellow alert in 8 districts",
    "CUET UG Result 2023: Answer key to be out on this date. Check details here",
    "EPFO likely to extend deadline to apply for higher pension: Report",
    "Adani Enterprises share price",
    "Setback for KCR's party as over 12 former ministers, MLAs join Congress",
    "Greenchef Appliances IPO: Check subscription status on Day 2, and other details",
    "L&T Finance may sell its wholesale book to banks, NBFCs: Report",
    "Golteum (GLTM) Presale Launches As Ripple (XRP) Untangles From SEC Case",
    "XRP price maintains its resilience, ETH on path to hit 2K TCRV aims $1",
    "Pakistan has no locus standi in PoK: Rajnath Singh",
    "Here’s how much you may to wait if you are looking to buy Mahindra Thar SUV",
    "RailTel, mini Ratna telecom company, wins order worth ₹294 crore",
    "Centre approves ₹56,415 crore as interest-free, long-term capex loans to 16 states so far in FY24"
]