[
    "IndiGo Q4 result: Net profit at ₹919.2 cr, revenue jumps 76%",
    "ITC Q4FY23 Results: Net profit up 22.7% to ₹5,225.02 crore, declares dividend",
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore; declares dividend",
    "Kissinger: for the safety of Europe, get Ukraine into NATO",
    "The world could soon breach its 1.5°C target for global warming",
    "Mint Explainer: What's on the cards at the G7 Summit in ....",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Supreme Court stays West Bengal govt ban on ‘The Kerala Story’",
    "Swiggy's food delivery business turns profitable: CEO",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Top gainers and losers in trade today: HCL Tech, Airtel, SBI; Check list here",
    "Siddaramaiah to be next Karnataka CM: How Congress stalwart made it to top?",
    "Realty, PSU Bank, FMCG, Pharma drag Sensex by 130 pts; Nifty down 50 pts",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "DK Shivakumar to be Karnataka's new Deputy CM: All you need to know",
    "PNG Housing Finance Q4 Results: Net profit up 64% to ₹279 crore, NII up 27%",
    "Banks credit to NBFCs sees robust growth, mutual funds pare exposure: Report",
    "Reduce GST rates on two-wheelers from 28% to 18%, FADA appeals to GST council",
    "GAIL Q4 result: Net profit at ₹603.52 cr, revenue up 21%",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Who is Arjun Ram Meghwal, the newly appointed law minister of India?",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Apple's new feature will allow you to clone your voice in 15 minutes",
    "Weekend getaways in Maharashtra",
    "Quite a few young Americans plan to end their days as compost",
    "For Executives Only, CEOs Amass Billions in Savings With ‘Top Hat’ Plans",
    "AT&T Is Spending Billions to Wire U.S. for Fast Internet as Rivals Take Differen",
    "SP Singh Baghel moved from the Law Ministry to the Health Ministry",
    "International Museum Day: PM Modi inaugurates International Expo in Delhi"
]