[
    "HMA Agro Industries Ltd IPO: Latest GMP, subscription status. Should you apply?",
    "Share Market LIVE: Sensex, Nifty flat at open; Tata Steel shines; Infy drags",
    "Is Indian aviation headed for a duopoly?",
    "Comeback on cards for distressed asset market",
    "Steady retail prices, easing crude lift margins of oil ....",
    "It’s déjà vu for cement investors as polls near",
    "Is it too late to revive BSNL?",
    "How beneficial are premium banking services for HNIs?",
    "India-US ties have rarely had superior prospects",
    "The G20 can build a global bridge to a future of sustai ....",
    "What is green diamond that PM Modi gifted US First Lady Jill Biden | Photos",
    "Layoff drive: Uber to sack 200 employees from its recruitment division",
    "Mark Zuckerberg agrees to fight Elon Musk in a cage fight. Here's what he said..",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi US Visit LIVE: US President, First Lady host intimate dinner for PM Modi",
    "Titanic Submarine LIVE Updates: Hopes hinge on new 'banging' sound",
    "Weather update: IMD predicts heavy rainfall in these states till 26 June",
    "PM Modi presents unique gifts to US President and First Lady",
    "Ashish Kacholia buys stake in small-cap stock that has surged 140% in six months",
    "PM Modi's US visit: US to facilitate visa easing for skilled Indian",
    "Warren Buffett donates Berkshire stocks to Bill & Melinda Gates Foundation",
    "Monsoon tracker: IMD predicts light to moderate rains, thunder in these states",
    "Heatwave Alert: Mansukh Mandaviya calls for robust action plan",
    "What makes PM Narendra Modi the world's most popular leader? Read this to know",
    "From Marinated millet to stuffed mushroom; check menu for PM Modi's State Dinner",
    "Jagannath Rath Yatra 2023 LIVE",
    "International Yoga Day 2023 LIVE",
    "PM Modi US visit key highlights",
    "Hdfc Bank share price Today",
    "Adani Enterprises share price",
    "Modi’s Vision for India Rests On Six Giant Companies",
    "Karnataka bandh today: What is open, and what's closed | Complete list here",
    "Smallcap stock Greenpanel can rise about 33% from current levels, here's why",
    "CoWin data breach: Delhi Police nabs Bihar man and minor in probe",
    "Spectrum Talent Management SME IPO listing: Stock lists at a discount on NSE SME",
    "Mumbai broker arrested for 'dabba trading' worth ₹ 4,672 crore in 3 months",
    "Urban Enviro Waste Management lists with 41% premium at ₹141 per share",
    "Was Covid vaccine the reason behind Shane Warne's sudden death? Details here"
]