[
    "Markets evenly poised; expect high teens earnings growth, says Anand Rathi",
    "DCB Bank shares rally 8% as Tata AMC gets nod to raise stake in lender",
    "Share Market LIVE: Sensex gains 150 pts; Powergrid shines; Maruti, Eicher lag",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "ideaForge IPO listing date advanced. GMP, experts signal strong debut of shares",
    "Maharashtra News Live: ‘Wont be disqualified,’ claims Ajit Pawar camp",
    "‘Delhi’s first quarter GST collection increases by 15% from last year’, says CM",
    "Has Indian stock market topped out after hitting life-time high — explained",
    "Harley-Davidson X440 vs Royal Enfield Classic 350: A detailed comparison",
    "Kapil Sibal says Maha political crisis is ‘about loaves of power, not people’",
    "Monsoon Rain LIVE: Schools, colleges closed in Karnataka today",
    "Greenchef Appliances shares rise further, locked in 5% upper circuit at ₹109",
    "Essen Speciality shares extend gain post listing, locked in 5% upper circuit",
    "Elon Musk predicts Tesla self-driving cars may come 'later this year'",
    "Hindustan Zinc to consider interim dividend for FY24; share price rises over 3%",
    "Yes Bank shares extend gain on fifth day in a row. Should you buy in this rally?",
    "Tomatoes worth ₹2.5 lakhs stolen from Karnataka farmer",
    "First IIT campus beyond Indian borders finds its home in Tanzania: MEA",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "IRCTC tourism offers 5 nights 6 days tour to Bali. See price, itinerary here",
    "Cyient DLM IPO: Share allotment declared. What GMP (grey market premium) signals",
    "Google accuses CCI of protecting Amazon in Android case",
    "Maharashtra: Ajit Pawar's NCP camp claims ‘won't be disqualified’",
    "Covid-19: India reports 42 new cases, active caseload down at 1,452",
    "Are Airline Credit Cards Worth It?",
    "‘When are you going to..,’ Ajit Pawar questions Sharad Pawar's",
    "China needs foreign workers. So why won’t it embrace immigration?",
    "After TCS, Tata Steel fires 38 employees for breaching its ‘code of conduct’",
    "Apple releases iOS 17 Beta 3: Everything that is new"
]