[
    "Vodafone Idea shares gain over 2% as Q4 net loss narrows",
    "‘Only a matter of time’ Jefferies' Chris Wood on Sensex hitting 1 lakh",
    "Stock Market LIVE: Sensex tops 62k, Nifty up 50 pts; Reliance gains; Airtel lags",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "We need just one big cluster to become an electronics hub",
    "A decade of reformist action has catalysed the emergenc ....",
    "Elon Musk’s Neuralink gets nod to test brain implants in humans",
    "Manipur violence: Amit Shah says those behind violence will not be spared",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "New Parliament Inauguration LIVE: 25 political parties confirm their presence",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Which mutual funds can get cheaper post Sebi’s TER proposals?",
    "Praj Industries share price surges over 8% post Q4 numbers; details here",
    "Rahul Gandhi should not have a 10-year passport: Subramanian Swamy explains why",
    "PM Modi will become PM for third time in next election: Amit Shah",
    "Can Nifty 50 sustain the 18,300-levels in June F&O series?",
    "IT raids in 40 locations in Tamil Nadu linked to Minister Senthil Balaji",
    "'Jockey' maker Page Industries share price drops 10% on weak Q4 results",
    "Blockbuster takes a jibe at Netflix over new password-sharing policy",
    "Wrestlers' Protest: ‘Will force govt to change POCSO Act’: Brij Bhushan",
    "New Parliament Inauguration",
    "Update Aadhar Card Details",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Nine years of Modi government: How income tax rules changed in this period",
    "Loan app scam case: How police busted an international nexus in Andhra Pradesh",
    "MedPlus Health Services shares jump over 16% following robust Q4 numbers",
    "Manipur violence: Curfew relaxed in parts of the state for 7 hours. Check what",
    "Not a party event…: Sanjay Raut slams Centre over Parliament inauguration row",
    "India Q4 GDP data expected next week; here's what to expect",
    "IPL 2023 Q2 GT vs MI: Gujarat Titans vs Mumbai Indians preview",
    "Gold Price Today: Rates rise in early trade; should you buy or wait?",
    "Amid El Nino concerns, IMD to hold press conference on ‘Long Range Forecast’",
    "Meghalaya Board SSLC and HSSLC Result 2023 to be out today: Time, how to check"
]