[
    "Vedanta Limited adds semiconductors and display glass ventures to its portfolio",
    "Suzlon Energy board approves raising funds up to ₹2,000 crore; check details",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "HDFC Bank to replace HDFC on MSCI global standard index from July 13",
    "ED attaches ₹52-cr worth assets of arrested AAP leader Manish Sisodia, wife",
    "Act against extremists attacking diplomats: India to UK at NSA dialogue",
    "Reliance Retail to reduce equity share capital, cancelling non-promoter shares",
    "Odisha accident: 3 railway officials arrested for ‘actions that led to tragedy’",
    "Jaiprakash Associates defaults on ₹4,044-crore loans",
    "US unemployment rate falls to 3.6%; nonfarm payrolls rise to 2.09 lakh in June",
    "Maharashtra News Live: NCP has no split, claims Praful Patel",
    "India's forex reserves rise by $1.85 billion to $595.05 billion; check details",
    "Scientists reveal the reason behind huge gravity hole in Indian Ocean. Read here",
    "Ecuador: Dozens trapped in world's highest tourist cable cars, rescued next day",
    "Govt in talks with industry on extension of FAME scheme, says official",
    "Who is Neelam Gorhe? Uddhav Thackrey's close aide who joined Eknath Shinde",
    "Karnataka budget 2023 Live Updates: CM Siddaramaiah presents budget in assembly",
    "Defamation law was misused, says Congress | LIVE",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "GSTN geocodes 1.8 crore addresses of registered businesses",
    "Loneliness is a serious health issue; Here's what to do",
    "Respect for poor is Modi’s guarantee: PM Modi in Varanasi during projects launch",
    "Tamim Iqbal's retirement U-turn: Ravichandran Ashwin's reaction breaks internet",
    "Sunil Chhetri moves up in international goal scorer list. His rank is . . .",
    "Microsoft India president Anant Maheshwari resigns, firm elevates COO"
]