[
    "Adani Power to Adani Ports: Adani shares trade red. Market cap dips ₹52,000 cr",
    "Paytm share price jumps over 90% from life-time low. Is more steam left?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Share Market LIVE: Sensex, Nifty in red; Adani stocks tumble, IndusInd shines",
    "Apple to launch its credit card in India",
    "Opposition Meeting LIVE: Oppn meet 'war cry' against 'fascist' regime: TN CM",
    "BofA Securities raises target price on Paytm; do you own?",
    "Titanic Submarine LIVE: OceanGate co-founder hits back at James Cameron",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi US visit Live: ‘Not an era of war but of dialogue, diplomacy’, says Modi",
    "Shah Rukh Khan's daughter Suhana Khan buys Alibaug farmland for ₹12.91 cr",
    "PM Modi to come back with 300 seats: Amit Shah challenges the opposition",
    "TikTok expands e-commerce reach with 'Trendy Beat' shopping section in the UK",
    "Thanks Congress for announcing ‘can't defeat PM Modi alone,’ says Smriti Irani",
    "Delhi CR Park firing: Masked men shoot at car, driver injured",
    "MoS IT speaks on announcements in tech space during PM Modi's US visit",
    "IT stocks fall after Accenture cuts earnings growth guidance",
    "Infosys shares underperform BSE IT, Sensex in last one year; should you buy it?",
    "Adani Enterprises share price",
    "India travelling to THESE destinations, despite airfare surge",
    "'MS Dhoni gave us a sense of security' R Ashwin's jibe at Rohit Sharma, Dravid",
    "Maruti Suzuki set to expand with these upcoming EV and hybrid vehicles in India: Report",
    "Indonesia’s nickel boom tests Western green sensibilities",
    "Power ministry plans varying electricity tariff for peak, non-peak hours",
    "Apple's iOS 17 update brings magical ‘NameDrop’ feature. Here's how it works",
    "HMA Agro IPO: Issue subscribed 1.24 times so far on Day 4; check details",
    "What do Accenture's Q3 results indicate for Indian IT firms?",
    "Odisha CM Patanaik sanctions ₹ 2.49 cr for Bahanaga School's reconstruction"
]