[
    "PM Modi to chair 8th NITI Aayog meeting today. Details here",
    "Delhi-NCR delights in refreshing rainfall",
    "Asian businesses are being dragged into the chip war",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "The rise and rise of e-sports",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Karnataka cabinet expansion: 24 legislators to take oath as ministers today",
    "Traffic Alert! Avoid these routes on new Parliament inauguration day",
    "Goldman Sachs hikes India’s 2023 GDP forecast to 6.3%",
    "IPL 2023 MI Vs GT: Shubman Gill's thunderous century glide Titans to finals",
    "CBDT starts consultation on angel tax valuation rules",
    "UK to enhance science and innovation ties with India",
    "Direct retail flows hit highest level in five months in April",
    "Shubman Gill's blistering 129 takes GT to finals; Kohli says this on Instagram",
    "ONGC Q4: Cons PAT falls 53% to ₹5,701 crore, revenue up 5%; dividend declared",
    "Forex reserves halt 3-consecutive weekly rises, dip by $6.05 bn to $593.48 bn",
    "Govt to amend rules to auction lithium, rare earth minerals",
    "Promoters ready to put in more equity in Vodafone Idea: CEO Akshaya Moondra",
    "Questioning Modi's re-election a worry for stock markets: Jefferies' Chris Wood",
    "PR Sundar settles SEBI advisory case, to pay over ₹6 crore; check details",
    "EIL eyes salt cavern-based crude reserve project in Rajasthan",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Yellen estimates debt-limit measures will run out by June 5",
    "DU academic council removes poet Mohd Iqbal, who wrote ‘Sare Jahan Se Acha’",
    "Zerodha's Nikhil Kamath concerned as world may get hit by 'friendship recession'",
    "JPMorgan CEO Dimon faces deposition in Jeffrey Epstein lawsuits in New York",
    "Markets gain 1% helped by FPI buying and normal monsoon predictions"
]