[
    "Arjun Ram Meghwal replaces Kiren Rijiju as Law Minister",
    "Gold rate today steady below $2000 on US dollar pullback from seven-week high",
    "Devyani International shares jump 5% despite fall in Q4 profit",
    "Stock Market LIVE: Sensex gains 150 pts; Bank, Metal shine; Pharma, Realty drag",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Index numbers for social issues need to be impartial by design",
    "Prime Minister Narendra Modi set to attend G-7 summit in Japan",
    "Nexus Select Trust IPO: What GMP signals as all eye set on listing date?",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "ITC Q4 results today: Cigarettes, FMCG biz revenue, PAT; key factors here",
    "People in Japan are learning how to smile; yes, you read that right!",
    "Asus debuts 13 new gaming laptops in India. Details on price, specs and more",
    "‘Last few weeks have been dramatic. We are still a bit shocked’",
    "Pakistan Supreme Court judges get paid more than President, PM: Report",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Indian Brands Are Embracing QR Codes Now More Than Ever",
    "Max Healthcare share price hits all-time high; should you buy or book profit?",
    "Mahindra 5-Door Thar, rival to Jimny, could debut this August: Report",
    "People have ‘lost faith’ in BJP govt, Manipur MLAs tell Amit Shah",
    "Adani firms lose UN green endorsement | Mint Primer | Mint",
    "Can India Become a Developed Economy and Catch Up with China? | Mint Explains | Mint",
    "Bharti Airtel Q4 results: Should you buy, sell or hold?",
    "Excel Entertainment to release ‘Fukrey 3’ on 24 November",
    "Netflix to stream Telugu film ‘Virupaksha’",
    "Professor fails his entire class because ChatGPT said this"
]