[
    "SBI, PNB, BoB to Canara Bank: Why experts are bullish on PSU bank shares",
    "Utkarsh Small Finance Bank IPO to open on July 12; check details",
    "Share Market LIVE: Banks drag Sensex sub 65,500; Adani Ports, Powergrid shed",
    "China’s Communist Party is tightening its grip in businesses",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Small-cap funds are all the rage, but should you buy?",
    "Karnataka budget 2023 Live Updates: CM Siddaramaiah presents budget in assembly",
    "Rahul Gandhi news LIVE: Cong press conference at 3 pm; BJP welcomes HC's verdict",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Karnataka Budget 2023: Key highlights from CM Siddaramaiah's 14th budget",
    "Karnataka Budget: CM Siddaramaiah increases excise duty on liquor. See details",
    "Watch: Drivers trapped in cars after hailstorm, flooding",
    "'Murder of democracy': DK Shivkumar's big attack after Gujarat HC verdict",
    "Paytm solidifies its merchant payments leadership; records 21 lakh devices deployed in 2023 so far",
    "Karnataka Budget: Liquor prices to soar as CM Siddaramaiah proposes duty hike",
    "Q1FY24 earnings preview: OMCs to post strong growth; metals' income may fall",
    "Paytm shares: Morgan Stanley, BofA, Citi give 'buy' tag after 60% rally in YTD",
    "No tomato in McDonald's food as prices surge across India",
    "Monsoon Rain LIVE: Amarnath Yatra temporarily suspended due to bad weather",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Sexual harassment case: Delhi court summons Brij Bhushan Singh, Vinod Tomar",
    "Meet Indian man who owns world's largest private residence",
    "‘Go to man since 2009': Jadeja's birthday wish for Dhoni breaks internet",
    "Karnataka budget 2023: Insurance coverage of ₹4 lakhs announced for e-commerce delivery employees",
    "Best Pictures of the Day: Amazing Photos from Around the World",
    "FMCG companies stare at healthy margin growth in Q1FY23; demand to gain traction"
]