[
    "‘Will not have any negative impact…’ RBI Governor on ₹2000 notes withdrawal",
    "Most Adani Group stocks rise in early trade; Adani Enterprises up over 2%",
    "Why Yes Bank share price is rising today — explained",
    "Share Market LIVE: Sensex, Nifty turn flat; Tata Cons, M&M shine; TCS sheds",
    "A strange revolt in Russia: Is this the end of Putin?",
    "Diabetes: The ticking time bomb",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in ....",
    "Indian markets go with the FII flow",
    "Four surprising facets shaping mutual fund returns",
    "Should your retirement nest be far from the teeming crowd?",
    "India-US relations: Set for a strategic upgrade",
    "Generation AI: It is India’s time to play chief disruptor",
    "“We are bringing new vehicles that will run on ethanol,” says Nitin Gadkari",
    "ideaForge IPO: GMP, subscription status, review, other details. Apply or not?",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Realme Narzo 60 could be the next Narzo smartphone in India, says company",
    "ICC to announce World Cup 2023 schedule today",
    "‘Hi-tech train cooling system’: Netizens slam Railways over water leakage video",
    "Assam floods: Situation still grim as heavy rainfall affects 5 lakh people",
    "HMA Agro Industries IPO: What GMP signals as focus shifts towards allotment date",
    "HDFC Life Insurance shares fall on ₹942-crore GST demand notice",
    "ICICI Securities share price hits 52-week high as board to consider delisting",
    "US man flies 37 million km with just an airline pass, visits over 100 countries",
    "Air India pilot refuses to fly after emergency landing in Jaipur",
    "Monsoon news LIVE: Moderate to heavy rain likely occur in Mumbai today, says BMC",
    "Adani Enterprises share price",
    "PKH Ventures IPO: From key dates to price band, all you need to know",
    "SBI Card falls over 3% as Nomura downgrades rating, cuts target price"
]