[
    "HDFC twins merger: What does the merger mean for depositors and borrowers?",
    "Market Wrap: Sensex gains over 400 points, Nifty settles above 18,800",
    "Air India-Vistara merger: Not so fast, says CCI",
    "This economist was ridiculed for her views on inflation ....",
    "An acrimonious debate about covid’s origins will rumble on",
    "A new class of drugs for weight loss could end obesity",
    "India’s IT industry must weed out corruption in hiring",
    "Americans love American stocks. They should look overseas",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Adani Group to review capital market strategy after market stablize: CFO",
    "HDFC twins, SBI, Maruti Suzuki, Cipla are among top gainers, losers today",
    "ICC World Cup 2023 schedule live updates: India to play Pakistan on Oct 15",
    "CAG conducts 'special audit' into Delhi CM Arvind Kejriwal's home renovations",
    "HDFC - HDFC Bank merger to be effective July 1, says Deepak Parekh",
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "Stock market holiday: NSE, BSE to remain closed on this date not on Wednesday",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Tata Technologies IPO gets Sebi nod",
    "Portfolio management: Best investment options for your child. Read here",
    "Gautam Adani terms Hindenburg report as ‘targeted misinformation'",
    "Sensex ends above 63,400, Nifty gains 120 pts; HDFC Life, Apollo Hosp, SBI shine",
    "Monsoon news LIVE: Several parts of Rajasthan receive light to moderate rain",
    "Surging India internet stocks trounce China peers, widening gap",
    "ICC World Cup 2023 tickets online",
    "Adani Enterprises share price",
    "Oppo Reno 10 to launch in India soon: What to expect",
    "How to block debit cards in case of fraud",
    "Messages, wishes to share with friends and family on the occasion of Bakrid",
    "LTIMindtree may enter Nifty50 after HDFC delisting",
    "PM distracting country from Manipur violence, price rise with UCC remark: Cong",
    "Barbie Dreamhouse is available for rent at Airbnb. How to book room for free",
    "IndiGo shares touch life-time high after UBS raises price target",
    "This economist was ridiculed for her views on inflation. Now, she’s a star"
]