[
    "Zomato share price hits 52-week high, touches IPO price of ₹76; here's why",
    "Exchanging ₹2,000 notes: 'No panic, no rush, just avoid...,' says RBI Governor",
    "Surging stockmarkets are powered by artificial intelligence",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Banks to enter a phase of moderation in credit growth",
    "Tracing the shifting patterns of remittance flows",
    "Aging with grace: Are senior living homes right for you?",
    "NIIT share price trades volatile on demerger record date. Do you own?",
    "RBI Monetary Policy Live: MPC keeps repo rate unchanged at 6.5%",
    "Paytm share price surges 8%; brokerages remain upbeat about the stock",
    "Stock Market LIVE: Sensex, Nifty trades red; Grasim, Sun Pharma lag; NTPC up",
    "'Unfair to punish students.,.' Jaishankar on Indians facing deportation risk",
    "Cyclone Biparjoy Live: ‘Very severe cyclonic storm to intensify further’, IMD",
    "Zomato could revolutionize food delivery with generative AI technology: Report",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Will Australia continue to have an upper hand or will India strike back?",
    "How ₹2000 notes withdrawal helped RBI to maintain status quo on interest rate?",
    "Imran Khan appeals to courts to prevent second arrest",
    "Monsoon has arrived in Kerala after a week's delay, says IMD",
    "Why visa wait time for Indians is 600 days? US says ‘need to fix the delay or …’",
    "Go First suspends operations until 12 June",
    "‘Out of anger, I said…, ’ wrestler's father says girl was not sexually harassed",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "Delhi, NCR get new rules for diesel generator sets usage to curb air pollution",
    "Zomato removes 'Kachra' campaign video, issues apology for offending netizens",
    "From Rahul Gandhi to Mamata Banerjee, these leaders to attend Opposition meet",
    "IKIO Lighting IPO: What GMP signals after strong subscription status?",
    "Jaishankar hits out at Canada over Indira Gandhi's killing celebration video",
    "India flight-tests new generation ballistic missile Agni Prime",
    "Health of long Covid patients worse than Stage-4 lung cancer patients: Study",
    "McDonald’s India partners with Simpl for online payment solutions",
    "Gadkari announces completion of two-lane Jaiswal Bridge in Jammu and Kashmir"
]