[
    "Zomato Q4 results: Firm narrows consolidated loss to ₹187.6 crore, revenue up",
    "RBI to transfer ₹87,416 crore dividend payout to govt for FY23",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "JSW Steel Q4 Results: Net profit rises 13% to ₹3,664 crore, dividend declared",
    "Bandhan Bank Q4 result: Net profit decline 57% to ₹808 cr, dividend declared",
    "PNB Q4 Results: Net profit increases 4 folds to ₹1,158 crore, net NPA down 2%",
    "Top gainers and losers in trade today: Adani Enterprises, NTPC ; Check list here",
    "Tesla stops short of committing to India plant in renewed talks",
    "SC panel report on Adani-Hindenburg row made public; Group's stocks rise",
    "Gyanvapi Case LIVE: SC stays HC order allowing scientific survey of ‘Shivling’",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Stock Market Today: Sensex, Nifty end higher led by IT, financials",
    "GAIL India share price falls over 3% as Q4 net profit plummets 77%",
    "Long Green Card wait time for India due to country-based quota: US official",
    "Cement stock hits 52-week high ahead of Q4 results today. Do you own?",
    "IT stocks lift Sensex 300 pts, Nifty up 75 pts; Tata Motors jumps; NTPC lags",
    "Redmi A2, Redmi A2+ launched in India with MediaTek Helio G36 SoC. Here’s price, specs, more",
    "Deloitte survey reveals Gen Zs and Millennials' perspectives on work and life",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Sunil Gavaskar blasts Jofra Archer for leaving IPL midway",
    "G20 Trade and Investment Working Group second meeting in Bengaluru 23-25 May",
    "Brookfield REIT and GIC co-invest in commercial property worth $1.4 billion",
    "Europe has led the global charge against big tech. But does it need a new approach?",
    "Government in view of setting up 8 new cities"
]