[
    "Devyani International shares jump 5% despite fall in Q4 profit",
    "Stock Market LIVE: Sensex gains 200 pts, Nifty up 50 pts; Bank, Metal shine",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Prime Minister Narendra Modi set to attend G-7 summit in Japan",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Index numbers for social issues need to be impartial by design",
    "Nexus Select Trust IPO: What GMP signals as all eye set on listing date?",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "ITC Q4 results today: Cigarettes, FMCG biz revenue, PAT; key factors here",
    "People in Japan are learning how to smile; yes, you read that right!",
    "Asus debuts 13 new gaming laptops in India. Details on price, specs and more",
    "‘Last few weeks have been dramatic. We are still a bit shocked’",
    "Pakistan Supreme Court judges get paid more than President, PM: Report",
    "ITC, SBI, GAIL to Tata Elxsi: These companies to declare Q4 results today",
    "Go First to resume flight operations from May 27: Report",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Metropolis to add 30 labs, 600-800 collection centres in FY24",
    "Sonia Gandhi's pivotal role behind Karnataka CM deal",
    "Russia, Ukraine extend grain deal amidst ongoing conflict",
    "Does work-life balance exist in healthcare industry? Doctors say this"
]