[
    "UBS hires Morgan Stanley’s Tom Wipf to help lead Credit Suisse tie-up",
    "ICICI Securities to be 100% subsidiary of ICICI Bank upon delisting",
    "Cyient DLM IPO: What GMP, subscription status reflects about the public issue",
    "WHO research agency identifies Aspartame sweetener as possible Carcinogen",
    "India’s low current-account deficit may not be good news",
    "India’s stock market rally should survive the coming Fe ....",
    "Talking about AI in human terms is natural—but wrong",
    "The choice between a poorer today and a hotter tomorrow",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Indian Men's Football team climbs up to 100th rank on FIFA world rankings",
    "CCL Products share hits $1 billion market cap. Gives 300% return in three years",
    "ITR filing: Exemptions and deductions that senior citizens can claim",
    "Rahul was stopped over grenade attack threat on travel route, says Manipur cop",
    "Manipur Live: 'Rahul Gandhi's behaviour was highly irresponsible', says BJP",
    "National Geographic lays off its last staff writers: Reports",
    "Armed rioters fire at Manipur village, Army responds, deaths likely",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Amit Shah calls Nitish Kumar 'Paltu Babu', says ‘He is just befooling Lalu…’",
    "Farooq Abdullah urges Centre ‘rethink’ implementation Uniform Civil Code",
    "Cabinet approves ₹3.7 trillion for fertilizer subsidy schemes",
    "Allahabad High Court slams makers of Adipurush, says if documentary on Quran…",
    "ideaForge IPO: What GMP signals after strong response by investors?",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Orange alert for six Maharashtra districts - What is the forecast for Mumbai?",
    "Wagner chief Prigozhin was told he would no longer fight in Ukraine: Russia",
    "Ashes 2023: Australia's Steve Smith claims 3 records on Day One of second Test",
    "Cube Highways secures ₹1,030 crore funding from IFC",
    "How political leaders reacted to Rahul Gandhi's Manipur visit. Read here",
    "Deloitte appoints former Bharti Airtel CEO Manoj Kohli as senior advisor",
    "As NSE rolls back Bank Nifty expiry day, here’s how the calendar looks now",
    "Catalyzing transformation: Augmenting human intelligence with AI",
    "WhatsApp boosts group video and audio call capacity on Windows desktop to 32 people"
]