[
    "Foxconn ending Vedanta JV has no impact on India's semiconductor goals: Govt",
    "GST Council to meet on July 11: Online gaming tax, ITC claim key items on agenda",
    "India overtakes China to become most attractive emerging market for investing",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Fed likely to lift rates on July 26; how can it impact the market, rupee?",
    "US visa: VFS global to temporarily shut down application process on THESE dates",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "Foxconn dumps $19.5 billion Vedanta chip plan in India, a look at timeline",
    "Four Indian-origin biz leaders in 2023 Forbes' 100 richest self-made women list",
    "Monsoon LIVE News: IMD issues yellow alert for Delhi; expect heavy downpour",
    "Tata Motors becomes 16th most valued automaker, beats Kia Corporation m-cap",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "Foxconn pulls out of semiconductor JV, Vedanta says other partners lined up",
    "Go First airline seeks investor interest as part of insolvency process",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Which is better?",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Cyber threats are worsening in today’s digital dystopia",
    "Bidenomics is a questionable way to fix inequality in the US",
    "Zee Entertainment, PNB, 5 others placed under F&O ban on NSE for July 11",
    "Let policy focus on productivity rather than gains of technology",
    "Delhi rains: All MCD schools to remain closed tomorrow, IMD issues yellow alert",
    "Grade inflation puts educational standards in a bind",
    "There are three major rates that leaders should track growth by",
    "As Foxconn dumps $19.5bn chip plan, Uddhav camp's regret: ‘Maharashtra could have",
    "China’s economic slump poses wider supply risks",
    "Bengal poll violence: Governor finds hope after meeting Amit Shah"
]