[
    "India plans action against Google after antitrust breaches",
    "Karnataka oath-taking ceremony LIVE: Siddaramaiah, DK S set to be sworn in today",
    "Karnataka swearing-in ceremony on Saturday: Who's invited and who's not?",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "Centre issues ordinance to negate SC order on control of services in Delhi",
    "Centre exempts tax at source on credit, debit card purchases upto ₹700,000",
    "India's forex reserves edge towards $600 billion, hit near 1-year high",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Phasing out ₹2000 notes: five things you need to know",
    "Jerome Powell signals a June pause, says Fed can afford to watch data",
    "What happens to your ₹2000 note after September 30? 15 points",
    "RBI withdraws ₹2000 note from circulation, to remain legal tender",
    "Adani-Hindenburg Case: What does SC-appointed panel report say? Key takeaways",
    "Tesla revives import duty talks with India",
    "Bulk Deals Today: HCC, Vishwaraj, others exchange hands: check buyers, sellers",
    "BSE, NSE remove NDTV from ASM framework from Monday",
    "IndiGo announces 3% bonus to crew post Q4 results: Report",
    "Zomato announces three top-level appointments",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Gold price rebounds as US dollar retraces from two month high. Should you buy?",
    "HP 12th Result 2023 Live:Result to be announced today",
    "Karnataka swearing-in ceremony: Date, time, venue, and how to watch live",
    "Adidas to start selling leftover Yeezy sneakers later this month",
    "World Metrology Day 2023: History, significance, theme and more",
    "Hit by 'cyberattack', Suzuki Motorcycle India halts production at its factories",
    "Mamata Banerjee slams RBI's move on withdrawing ₹2000 notes",
    "US imposes sanctions on over 300 targets in fresh Russia action"
]