[
    "Missed to link PAN card with Aadhaar? Top ten money losses that you may face",
    "Has Indian stock market topped out after hitting life-time high — explained",
    "Share Market LIVE: Sensex gains 150 pts; Powergrid shines; Maruti, Eicher lag",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "ideaForge IPO listing date advanced. GMP, experts signal strong debut of shares",
    "Maharashtra News Live: ‘Wont be disqualified,’ claims Ajit Pawar camp",
    "Cyient DLM IPO: Share allotment declared. What GMP (grey market premium) signals",
    "Meta's Threads attracts over 5 mn users in just 4 hours, Zuckerberg announces",
    "After TCS, Tata Steel fires 38 employees for breaching its ‘code of conduct’",
    "Monsoon Rain LIVE: Rains cause waterlogging, traffic jams in Delhi",
    "HDFC Bank's special FD for senior citizens to end tomorrow",
    "Canada: Sikhs for Justice group threatens to 'Besiege' Indian missions on Aug 15",
    "Apple releases iOS 17 Beta 3: Everything that is new",
    "Marico’s June quarter update paints a grim picture",
    "‘When are you going to..,’ Ajit Pawar questions Sharad Pawar",
    "Ratan Tata has a message for car-owners",
    "Maharashtra: Ajit Pawar's NCP camp claims ‘won't be disqualified’",
    "Canada Express Entry: 500 invites issued under first category-based STEM draw",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "JSW Steel crude steel production rises 11% to 6.43 million tonne in Q1",
    "Kia ready to launch 4th-gen Carnival and EV9 electric SUV by 2024: Report",
    "Senco Gold IPO subscribed over 18 times so far on last day",
    "Praj Industries sets AGM date, check details here",
    "Do overweight people die soon? New study says this",
    "Eicher Motors erases about ₹10,700 crore mcap in 3 sessions; what should you do?",
    "Hottest week on Earth: Global temp at ‘unofficial’ record high for second day",
    "Bajaj Auto or Hero MotoCorp? Which stock to prefer after new premium launches",
    "These 3 midcap stock rose the most in this week. Do you own any?"
]