[
    "Foxconn pulls out of India chip JV with Vedanta",
    "India overtakes China to become the most attractive emerging market for investing",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Go First airline seeks investor interest as part of insolvency process",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Which is better?",
    "Mutual Funds: Small-cap fund inflows at record high of ₹5,472 crore in June",
    "Bank of Baroda to PNB: These three banking stocks hit 52-week high",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Monsoon LIVE News: Delhi on high alert as water in Yamuna river dangerous",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Sensex, Nifty end higher on gains led by RIL; mid, smallcaps underperform",
    "Hyundai Exter SUV launched in India at a starting price of ₹5,99,900!",
    "SAT refuses to grant stay on order against Punit Goenka, Subash Chandra",
    "Sensex, Nifty end marginally higher; RIL, Tata Steel jump; Titan, HCL drag",
    "Weather Alert: List of trains cancelled due to heavy rainfall. Details here",
    "West Bengal Panchayat Polls",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Resolution professional invites bids for Go First",
    "Sandeep Goyal takes over from Diwan Arun Nanda as chairperson of Rediffusion",
    "Delhi rains update: Evacuation imminent as Yamuna breaches danger mark",
    "Marketing budgets may improve in this quarter",
    "OMG 2 teaser to be out on 11 July, Akshay Kumar in role of Lord Shiva: Watch",
    "Serentica inks pact with Greenko Group to source 1500 MW of green energy a day",
    "Oil eases ahead of inflation data after rising to 9-week high on Saudi cuts",
    "US President Joe Biden meets UK's Rishi Sunak ahead of NATO Summit",
    "Drone Destination IPO: GMP, subscription status on day 2, and other key details",
    "Allowing lessors to inspect aircraft can cause disruptions: Go First RP"
]