[
    "Kotak Mahindra Bank share price in focus as board to consider raising funds",
    "Stock Market LIVE: Sensex, Nifty move to red; IndusInd, Airtel drag",
    "Cowin data breach: Assessing the risk of recurring attacks",
    "In charts: How easing costs lifted India Inc’s profits in Q4",
    "EU deforestation law may hit Indian exports worth $1.3 billion",
    "Despite low inflation print, RBI may hold firm on rate cuts",
    "Wet paint alert: Can Grasim Industries surprise Berger Paints?",
    "Why you should avoid filing tax returns before 15 June",
    "Our economic optimism needs a touch of realism",
    "Promoter’s professionalization dilemma: To be or not to be ‘pro’",
    "Cyclone Biparjoy LIVE: IMD warns of floods, power outage this week",
    "Tamil Nadu Minister V. Senthil Balaji arrested in money laundering case",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Tata Chemicals, Canara Bank among shares to trade ex-dividend today",
    "Google CEO Sundar Pichai speaks about employees joining OpenAI",
    "Netherlands to distribute free sun cream; here’s why",
    "NEET Result 2023: Two students achieve perfect score of 720, cut-offs up for all",
    "Heatwave alert: Scorching summer to trouble people in these states",
    "Cyclone Biparjoy: Western Railway cancels 95 trains till 15 June. Details here",
    "Microsoft's acquisition of Activision Blizzard hits roadblock",
    "Wrestlers Protest: Khap leaders rally for 'Haryana Bandh' on June 14",
    "Cormac McCarthy, Pulitzer Prize-winning novelist no more, dies at 89",
    "RBI not to regulate social media influencers; here's why",
    "Amazon Alexa, other services stop working due to AWS outage",
    "India's fuel exports to EU nations go up amid Russia-Ukraine war",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "Anupam Rasayan shares jump over 5% on ₹2,186 crore order win; check details",
    "Senthil Balaji's arrest:‘Revengeful act’,TN minister Ponmudi criticises centre",
    "‘Senthil Balaji was tortured’: DMK minister cries in pain after ED questioning",
    "Rate cuts are still a while away",
    "Gold Price Today: Rates rise in early trade; what should be your strategy today?",
    "CSK’s cryptic post sparks speculations on MS Dhoni’s retirement from IPL",
    "BGMI redeem codes for June 14, 2023: Unlock exciting rewards and free gifts!",
    "Donald Trump arrest: Former US president calls indictment as ‘abuse of power’",
    "Hillary Clinton's laughter echoes as Donald Trump faces second indictment",
    "Ratha Yatra 2023 in Puri: Make arrangements keeping in mind hot weather, says CM"
]