[
    "Gautam Adani loses more than ₹4 trillion of wealth between Jan-June 2023",
    "Top news this week: Ajit Pawar, Jio Financial Services IPO and more",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Q1 earnings, inflation, industrial production to guide market movement this week",
    "BHEL, India Cements, 2 others placed under F&O ban on NSE for July 10",
    "Monsoon Fury LIVE: Flash floods with heavy rain ravage Himachal Pradesh, Delhi",
    "Canada Express Entry: Nearly 10,000 invites issued in just two week",
    "Monsoon Rains: Why Delhi CM Arvind Kejriwal cancels govt officials' Sunday off?",
    "India plays ‘constructive role’ in supporting Sri Lanka: Report",
    "Railways services disrupted: Heavy rainfall affects the operation of 20 trains",
    "Why Tesla is giving up to $48 an hour to drive its EVs this summer",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Hyundai Exter SUV launch tomorrow: How to watch livestream",
    "What is Bed Rotting, the latest trend on social media?",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "‘Have a KTM 390 but not allowed to…’ Rahul Gandhi to mechanics in Delhi",
    "Ukraine's Zelensky brings home Azovstal commanders in prisoner swap deal",
    "‘Pilgrims should proceed on their yatra..,' says Uttarakhand CM Pushkar Dhami",
    "Karnataka: Shop owner burns his labourer alive in Mangaluru"
]