[
    "Midcaps, smallcaps at record high: 10 stocks that can give you healthy returns",
    "Cyclone Biparjoy LIVE: Gujarat' Mandvi witnesses strong winds and heavy rain",
    "Bank, IT drag Sensex below 63000, Nifty sheds 70 pts; Apollo Hosp, Nestle shine",
    "RBI rule allowing banks to compromise with wilful defau ....",
    "Mint Explainer: Why the US Federal Reserve didn’t raise rates",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "Price of prestige: Exploring the allure of club members ....",
    "Karnataka HC threatens to close down Facebook",
    "Adani Power to Adani Enterprises: Mutual funds sold these Adani shares in May 20",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Paytm shares up over 100% in seven months, turn multibagger; can they rise more?",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Small-cap stock below ₹50 jumps 13% in two days after Q4 results",
    "TCS, Infosys other IT stocks may see up to 40% downside, says JPMorgan",
    "ITR filing: Income tax department releases ITR-3 Form online. Who should file?",
    "Railway Board expresses concern over unsafe signal reconnections",
    "WFI chief Brij Bhushan faces sexual harassment charges, says Delhi Police",
    "SBI Mutual Fund sees rupee strengthening to 80 per US dollar by year-end",
    "Amazon Prime Lite membership launched in India at ₹999",
    "Formula 1 Canadian Grand Prix 2023: Details on schedule, timings and how to watch",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "One Change Could Help U.S. Drugmakers Save 11 Million Trees a Year",
    "5 Simple tips to reduce your AC bill",
    "Why has cryptocurrency market tumbled despite Fed pausing key rates?",
    "Cyclone Biparjoy: No commercial flights in operation in Jamnagar, says DK Singh",
    "Skilling of people key to realising demographic advantage: CEA",
    "5 Foods to avoid when you are angry",
    "As Nifty Realty hits 52-week high, Godrej Properties, Brigade gain 2-4% each",
    "Your Health Insurance Is Giving You Trouble? Here’s How to Fight Back.",
    "Sensex, Nifty snap three-day winning streak; hawkish Fed weigh on sentiment",
    "Zee Entertainment case: SAT seeks SEBI response in 48 hours, to decide on Monday"
]