[
    "Reliance INE002A01018, RELIANCE, 500325",
    "Cyient DLM INE055S01018, CYIENTDLM, 543933",
    "Apple US0378331005, AAPL:US",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n19355.90\n\n0.00 (0.00%)",
    "Sensex\n\n65344.17\n\n0.00 (0.00%)",
    "ONDC posts record 35,000 retail orders in a day",
    "CBI arrests CMD of Tirupati Infraprojects in Rs 289 crore bank fraud case",
    "Yamuna breaches danger mark in Delhi",
    "Delhi court sends Supertech chairman RK Arora to judicial custody till July 24",
    "TCS delays onboarding of lateral recruits by up to three months",
    "Top 10 things to know before the market opens today",
    "Hot Stocks | Orient Cement, Suprajit Engineering, Mahindra Holidays",
    "Stock Market LIVE Updates: Indices likely to open higher on firm global cues; GIFT Nifty gains",
    "Rohan Murty Interviews Dad NR Narayana Murthy On Starting Up, Sacrifices & Values | Exclusive",
    "How the bathroom sealed the deal for this Bandra couple | The Tenant",
    "'Difficult To Live With The Most Successful...': Sudha Murty's Tribute To Wives Of Entrepreneurs",
    "Can Harley Davidson X440, Bajaj Triumph Scrambler 400X & Speed 400 Dethrone Royal Enfield?",
    "What will ISRO's Chandrayaan-3 do on the south pole of the moon? | Launch on 14th July",
    "WATCH: IIT Goes International | First IIT campus to open outside India in Tanzania | IIT Madras",
    "Best Features Of Apple iOS 17 | NameDrop, Check In, Clear OTP Messages",
    "Promising outlook for markets, focus on quality stocks: Sharekhan's Gaurav Dua",
    "Senco Gold to set basis of IPO share allotment today: Here's how to check",
    "Buzzing Stocks: Vedanta, SBI, Sanghvi Movers, Tata Comm, others in news today",
    "Direct tax collections, Vedanta, Q1 earnings season & more | Market Minutes",
    "Amazon readies for Prime Day blitz with 45,000 launches, faster deliveries",
    "ONDC posts record 35,000 retail orders in a day, Delhi-NCR pips Bengaluru in volume",
    "Vedanta, Foxconn call it quits on chip JV; both looking for new partners",
    "All the big stories to get you started for the day",
    "Last chance to opt for higher EPS pension is July 11: Here’s what you should do",
    "India can follow global models to bring fuel under GST: CBIC Chairman Vivek Johri",
    "Finmin asks IBA to finalise wage revision of bankers of PSU banks by December 1",
    "Indra Nooyi & Jayshree Ullal among four Indian-origin women America's richest self-made women",
    "Turkey gives green light to Swedish NATO membership bid",
    "CarTrade Tech to acquire Sobek Auto for Rs 537 crore",
    "Byju’s not facing SFIO probe yet, corporate affairs ministry investigating governance lapses",
    "SEBI disagrees with expert panel, says will take action if any violation found",
    "SBI to offload 2% equity stake in NSDL IPO via offer for sale",
    "JKC says will revive Jet Airways as per approved resolution plan amid calls for liquidation",
    "Tata Communications to acquire remaining 41.9% stake in OSSE France for Rs 99.3 crore",
    "India likely to buy 26 Rafale fighter jets, three Scorpene class submarines from France",
    "Review your Mutual Fund investments: Introducing Dezerv's Wealth Monitor app",
    "Harley Davidson X 440 first ride review: A new breed of AI (American-Indian)",
    "Newsletter with technical analysis, research advice, and insights",
    "'Connaught River, Jheelon ka shehar' Delhi videos are viral as rain batters capital",
    "Why I agreed to pay Rs 15,000 extra rent in 6 months: Samsung techie in Bengaluru explains",
    "What the collapse of the Dutch government means for India",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "The curious case of former NSG commando &amp; RAW agent Lucky Bisht",
    "Bengaluru man treats chest pain as indigestion, it was a heart attack. Doctor shares artery pics",
    "India likely to become world's second-largest economy by 2075, surpassing the US: Goldman Sachs",
    "Closing Bell: Market ends with marginal gains; IT, power, realty drag, metals shine",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Rain lashes North India — snippets from Himachal Pradesh, Uttarakhand and Delhi",
    "The unresolved mystery of consciousness",
    "Doctors find 'large number of' lice, eggs on 3-year-old Chinese boy's eyelashes. See pics",
    "Pune techie loses Rs 92 lakh to 'blescoin' fraud. Woman on matrimonial site duped him",
    "Advance / Decline (NSE) \n\n7871310",
    "Rcf looking strong at the moment heading towards rs125 plus slow and s...",
    "Us and eu used to invest billions of dollars in china every month for ...",
    "Why sudden spurt in volumes? whether it will reach the book value?",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets turn cautious on global cues",
    "Read Ambareesh Baliga full Report",
    "EU seals new US data transfer pact, but challenge likely",
    "ChatGPT dragged to US court over AI copyright",
    "Dominion sells Maryland gas plant stake to Berkshire Hathaway unit for $3.3 billion cash",
    "KAL Airways says ‘no question’ of amicable settlement with SpiceJet over pending payments",
    "Expression of Interest sought in Go Airlines possible sale",
    "HDFC Bank to sell 2% stake in NSDL IPO",
    "India's ethanol program will cap future sugar exports: BMI report",
    "Rate-cut push gathers steam as firms' inflation expectations fall below 4% in May",
    "Swaps predict inflation when all else comes up short",
    "WB panchayat elections: Repolling in nearly 700 booths; BJP, TMC in war of words over violence",
    "AAP launches 'Bijli Andolan' in Haryana; Kejriwal promises free power if voted to power",
    "Despite differences, India has scored with a consensus declaration at the SCO summit",
    "Aeroflex_Industries_Limited_Addendum_to_DRHP",
    "National_Securities_Depository_Limited_DRHP",
    "ESAF_Small_Finance_Bank_Limited_DRHP",
    "Acceleratebs_India_Limited_DRHP",
    "Equity inflows more than double to Rs 8,637 crore, smallcap fund flows at all-time high",
    "Final approval for mutual fund expected in 4-8 weeks: Zerodha CEO Nithin Kamath",
    "Union MF expects 50% growth in AUM, to reach Rs 15,000 cr mark by March",
    "SEBI issues framework for PE funds as sponsors and self-sponsored AMCs",
    "SEBI puts onus on trustees to ensure fairness of fees, expenses charged by fund houses",
    "New fund offer of Canara Robeco Multicap Fund opens today; should you invest?",
    "Motilal Oswal Nifty Microcap 250 Index Fund garners Rs 120 crore during NFO period",
    "Nippon India Mutual Fund limits inflows into smallcap fund",
    "Single premium term plans – Should you opt for them?",
    "Majority of insurance-buyers find products & processes to be complex: Policybazaar study",
    "Plum Insurance forays into business insurance space, targets startups and SMEs",
    "Critical illness standalone covers or riders: Which one to pick?",
    "Regulations on How Insurance Companies Should Value Each Bike Component After Depreciation",
    "Life and health insurance policies welcome LGBTQ community, but not all is rosy, just yet",
    "Maha government's flagship health insurance scheme to cover all: CM Shinde",
    "Bond market teaches you why even a single basis point matters a lot: A Balasubramanian",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "13 midcap stocks that are most shunned by active mutual fund managers",
    "RBI group says gains from including govt bonds in global indices outweigh risks",
    "Excise duty hike in K'taka would lead to dowtrading, may impact sales, say liquor makers",
    "Tax proposals should be planned and implemented like test cricket",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Know which is a better tax saving option",
    "ITR Filing: Handy tips for those filing returns for the first time",
    "Filing ITR for crypto gains? Here’s what you need to know | Simply Save",
    "ITR Filing: All you need to know about how to account for income from house property",
    "ITR filing for FY 2022-23: 28 days left, check these changes in income tax return forms",
    "Private investment in real estate marginally declines 5% in Q1FY24: Report",
    "Pune apartment prices rise 11% but sales down 8%, says GERA report",
    "Shriram Housing Finance raises $50 million through external commercial borrowing route",
    "Max Estates may start construction of luxury homes in Noida in September",
    "MHADA lottery 2023: Last day to apply today",
    "Ravi Kumar NG is appointed Greater Noida Authority CEO",
    "Gold awaits fresh cues as focus turns to US inflation print",
    "Gold heads for fourth weekly loss on prospects of more rate hikes",
    "Gold slips as strong US data fuels Fed rate-hike bets",
    "Gold slips as US dollar, yields rise after Fed minutes",
    "Gold rangebound in cautious trading ahead of Fed meet minutes",
    "Gold firms as traders hunker down for Fed cues",
    "Gold futures quiet, cues from Fed minutes awaited: Track latest prices",
    "Gold advances on weaker US economic cues",
    "Is NPS the best retirement planning tool?",
    "Seeking higher EPS pension? You have only five more days to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Banks education loan increases 18.3% after demand returns as pandemic ebbs",
    "HDFC-HDFC Bank Merger: All you need to know about its impact on home loan customers",
    "Financial Stability Report: Write-offs improved asset quality",
    "Personal Finance: Prepaying your home loan early on can save you lakhs",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "RBI‘s circular on issuance of cards a win for customers, say experts",
    "Visa says co-branding offers opportunities for new categories to emerge",
    "Government flip flop on TCS confounds credit card holders",
    "TCS of 20% on credit cards put on hold, forex cards get Rs 7-lakh exemption",
    "When should you upgrade your credit card?",
    "Free lounge visit, air miles is fine. But how do credit cards make money?",
    "Making UPI payments via RuPay credit cards: Is it worth it?",
    "Trade Spotlight | Your strategy for Reliance Industries, Mazagon Dock Shipbuilders, Ceat today",
    "Hot Stocks | Orient Cement, Suprajit Engineering, Mahindra Holidays may deliver 10-14% returns",
    "Top 10 trading ideas for 3-4 weeks as bull run may continue for now",
    "Trade Spotlight | How should you trade in Sunteck Realty, Jamna Auto, Olectra Greentech?",
    "Hot Stocks | Here's why you should bet on Granules India, Orient Electric for short term",
    "Daily Voice | This portfolio manager says below-par Q1 for key sectors can derail the rally",
    "Daily Voice | Watch out for these 3 factors in Q1 earnings season",
    "Prism Johnson closes below 30-Day Moving Average of 127.36 today.",
    "Nidan Laboratories & Healthcare",
    "Nidan Lab closes below 30-Day,150-Day Moving Average today.",
    "Visagar Polytex closes below 30-Day,50-Day Moving Average today.",
    "Swaraj Engines closes below 30-Day Moving Average of 2066.69 today.",
    "Cyient closes below 30-Day Moving Average of 1437.47 today.",
    "Jaiprakash Asso closes below 150-Day Moving Average of 8.56 today.",
    "Lakshmi Finance and Industrial Corporation",
    "Lakshmi Finance closes below 50-Day Moving Average of 133.28 today.",
    "Set SMS alerts for market news",
    "The dismal state of power discoms threatens India’s energy dreams",
    "Utkarsh Small Finance Bank’s IPO will test investor interest in microfinance",
    "UN's sustainable development goals are mission impossible",
    "Capitalism alone won’t save the planet",
    "Gold steady as investors await US data for Fed rate-hike clues",
    "Oil ticks up on OPEC+ cuts; traders eye economic data",
    "Agri Picks Report July 10, 2023: Geojit",
    "Policy Next - MSME-Growth Series: Have Indian MSMEs demonstrated the ability to take risks- Part 5",
    "AI4Bharat researchers to raise $12 million from Peak XV, Lightspeed for own firm, sources say",
    "See More Top Companies in India",
    "CPI Inflation, US Inflation, Cyient DLM listing, IPO action & the week ahead | Market Minutes",
    "The New B2C: Business to Climate | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]