[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18665.50\n\n-105.75 (-0.56%)",
    "Sensex\n\n62979.37\n\n-259.52 (-0.41%)",
    "HDFC Life gets Rs 942-crore GST demand notice",
    "Assam flood situation grim, death toll at 2, over 4.88 lakh hit",
    "Heavy rain triggers landslides in several parts of Arunachal Pradesh",
    "India's forex reserves jump $2.35 billion to $596 billion",
    "SBI Card dips after mixed growth data for May",
    "Air India, IndiGo to enjoy duopoly: Nuvama Institutional Equities",
    "Google, Amazon announce major investments after meeting with PM Modi",
    "Robust growth by Equitas Small Finance Bank to be a trigger for re-rating: Motilal Oswal",
    "These smallcaps up 10-32% as Sensex hits fresh record high despite volatility",
    "Noida Restaurant Service Charge Fight: What To Do If A Restaurant Levies Service Charge?",
    "Titanic Tourist Submarine: Why was it hard to rescue Titan submersible?",
    "'If There Is No Humanity...', PM Modi Answers Question On Human Rights In India | PM Modi In US",
    "Raamdeo Agrawal: Stock market stalwart on the way forward, investment themes, hot sectors",
    "'Catastrophic Implosion' Inside Titanic-Tour Submarine: Who Were The 5 Passengers On Board?",
    "Nifty Midcap consistently outperforming Nifty; 5 Midcap shares with huge return potential",
    "WHO Prepares For El Nino Linked Spread Of Viral Diseases Like Dengue, Zika Virus & Chikungunya",
    "Fed chair Jerome Powell says ‘long way to go in fight against inflation’, signals more rate hikes",
    "What you need to know about the new US visa services system",
    "Singer Hariharan: ‘The day is not far when machines will sing too’",
    "How Archies became a major pop culture influence in India",
    "Explainer: Why an El Niño doesn't always mean a bad monsoon for India",
    "Selectors make tough choices for Windies tour with an eye on the future",
    "TCS refutes any fraud in recruitment process, says no key persons are involved",
    "Parties resolve to fight 2024 unitedly, next summit in Shimla",
    "Modi's US visit: The beginning of Indimerica",
    "Claiming tax deductions without proofs can backfire, warn CAs",
    "Russia-Ukraine War Live: President Putin addresses the nation after Prigozhin mutiny threat",
    "Biden’s red-carpet welcome shifts the scales for India in global geopolitics: Panagariya",
    "Forex cards or credit cards? Which one is better for foreign travel",
    "Man found pregnant with twin for 36 years due to 'rare' medical condition",
    "ideaForge Technology raises Rs 254.88 crore via anchor book ahead of IPO",
    "Doctor saves woman with cardiac arrest on Bengaluru-Delhi Indigo flight",
    "Anand Mahindra, Sam Altman discuss Indian ChatGPT ‘challenge’ in White House meeting",
    "PFS Chairman Mishra did not act in shareholder interest: SEBI",
    "Infosys ends ties with lobbying firm, takes steps to boost governance in Australia unit",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Remember Inspector Vivek from 'CID'? He's now working in Bengaluru as a…",
    "Google, Amazon announce major investments in India after meeting with PM Modi in US",
    "US set to introduce in-country renewable for H-1B visa: official",
    "Mukesh Ambani, Sundar Pichai, Anand Mahindra and Nikhil Kamat in attendance at PM’s State Dinner",
    "'Scam in name of FedEx, Blue Dart’: Zerodha's Nithin Kamath warns after colleague loses money",
    "Hero MotoCorp unleashes Xtreme 160R 4V: A power-packed thrill for motorcycle enthusiasts",
    "In pics: At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "ITR filing: Claiming tax deductions without proofs can backfire, warn CAs",
    "How investor Shankar Sharma, 60, managed to get the body of a man in mid-40s",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In Pics: Modi's US visit leads to key partnerships in defence, space and technology",
    "Best quotes from Motilal Oswal's Raamdeo Agrawal, Kotak's Upadhyaya and others: In Pics",
    "Man found 'pregnant' with twin for 36 years due to rare medical condition",
    "Advance / Decline (NSE) \n\n4931565",
    "Time to moveout of this laggard",
    "No chance.....it will come down up to 6800 and then again it will fly ...",
    "Gail ..june july series me 105 below closing dega hi nahi... gail 108 ...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty inches away from all-time high",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "BOE is likely to announce 25 bps rate hike, as widely expected.",
    "Read Mecklai Financial full Report",
    "Wall Street ends down, snaps weekly winning streak on Fed worries",
    "Globally, 1.3 billion projected to be living with diabetes by 2050",
    "EU, Meta agree to July stress test on EU online content rules",
    "Customer effort score is key to SME growth",
    "Boeing to invest $100 million in infrastructure, pilot training in India",
    "No stance is best stance for monetary policy: Jayanth Varma",
    "Amit Shah lays foundation stone of 'Balidaan Stambh' in Srinagar",
    "Mob torches Manipur minister's godown, tries to burn down residence",
    "High-level panel to probe alleged scam in gold plating at Kedarnath temple",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "MC Review: HDFC MF’s new consumption-themed fund comes with a twist. Will it work?",
    "Personal Finance: 3 handy tips to make your SIPs a success",
    "Sandeep Bagla: A fixed income market champion who is now building Trust MF brick by brick",
    "MFs’ deployment in up to 90-day CPs of NBFCs rises 21-month high in May: SEBI data",
    "Will HDFC MF’s new scheme revive the interest in consumer sector funds?",
    "Does the rush in small cap stocks indicate a risk-off market?",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "LIC launches Dhan Vriddhi, a single premium guaranteed endowment policy",
    "MC explains: Why third-party motor insurance is critical for all vehicles on the road",
    "Beware of employer-assisted housing loans. It is the ultimate golden handcuffs",
    "Now, insurance cos can launch group Ulips, combi plans without prior IRDAI nod",
    "Moneycontrol Daily: Your Essential 7",
    "Does life insurance make sense without tax benefits?",
    "LIC announces relaxations for victims of Biparjoy Cyclone",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Retirement Planning in a Volatile Market",
    "Sensex on a high: Here’s why Mirae’s Swarup Mohanty loves largecaps",
    "LIC Mutual Fund set to acquire schemes of IDBI Mutual Fund",
    "Income Tax Return filing: Things to keep in mind while filing taxes",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "ITR filing: Know the difference between AIS and Form 26AS before filing your income tax return",
    "Using AI, Income-Tax department sends notices to tax evaders for fake donations",
    "Direct tax collections at Rs 3.8 lakh crore, up 11.2% so far in FY24",
    "Income tax returns: Types of TDS certificates and why they are needed",
    "Navi Mumbai metro to start soon, boost property prices in micro-markets",
    "India's LEED ranking a boost for green building initiatives of top developers",
    "Grade A commercial space in top six cities touches 700 mn sq ft: CREDAI-CRE Matrix Report",
    "Ashrai Infra launches office and high-street retail project in Greater Noida west",
    "Looking beyond net zero: Retrofitting, ESG crucial to meet real estate's sustainable goals",
    "Bengaluru resident asks housekeepers to use waiting areas over parks, gets slammed on Twitter",
    "Suhana Khan buys agricultural land in Alibag for Rs 12.91 crore",
    "Gold set for biggest weekly drop since Feb on hawkish Fed",
    "Gold set for worst week since early February: Check out latest prices",
    "Latest gold prices: Three-month tested as Jerome Powell's comments weigh",
    "Gold hovers near 3-month low on Powell comments",
    "Latest gold prices: At 3-month low on hawkish US Fed",
    "Gold slides 1% on strong US housing data, firmer dollar",
    "Commodities Live: Strong Domestic & Export Demand Push Prices of Spices To Record Highs!",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "IndusInd Bank tops Nifty50 list, needs to exceed recent swing high for momentum",
    "Trade Spotlight | How should you deal in Aether Industries, BSE, JBM Auto today",
    "Trade Spotlight | Your strategy for JSW Energy, Linde India, Tube Investments today",
    "Hot Stocks | Bet on Indiabulls Housing Finance and GNFC, sell JSW Steel for short term",
    "Daily Voice | Joseph Thomas of Emkay is bullish on BFSI sector. Here's why",
    "Balrampur Chini closes below 30-Day,50-Day Moving Average today.",
    "Agarwal Float closes below 30-Day Moving Average of 36.80 today.",
    "India Cements closes below 200-Day Moving Average of 216.43 today.",
    "ZIM Lab closes below 30-Day Moving Average of 105.60 today.",
    "Control Print closes below 30-Day Moving Average of 623.43 today.",
    "GFL closes below 30-Day,50-Day Moving Average today.",
    "NDTV closes below 30-Day Moving Average of 220.47 today.",
    "Set SMS alerts for market news",
    "Putin’s nuclear threats demand a response",
    "Looks like cash and acts like stocks, but it has a catch",
    "The Reading List: June 23, 2023",
    "Market snaps 4-week winning run; all sectors in the red",
    "Aether shares fall 3.3% after rallying 25% in a month",
    "Motilal Oswal expects Jindal Steel to become mega producer, sees 27% upside",
    "Agri Picks Report June 23, 2023: Geojit",
    "Oil steadies after sliding on UK rate hike",
    "Called out by intern for not paying stipend, Soshals app founder’s justification",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "See More Top Companies in India",
    "THE FIRM SPL WITH ASHOK CHAWLA, CHMN CCI",
    "Accenture's signals for Indian IT, likely block deal in Landmark Cars & more |  Market Minutes",
    "Global Chess League’s Gambit | Unusual Suspects",
    "Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Getting India Smart & Connected | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]