[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "IEX INE022Q01020, IEX, 540750",
    "Apple US0378331005, AAPL:US",
    "Infosys INE009A01021, INFY, 500209",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18716.15\n\n+114.65 (+0.62%)",
    "Sensex\n\n63143.16\n\n+418.45 (+0.67%)",
    "Power ministry clears 20% stake for Assam govt in NLC India subsidiary",
    "Cyclone Biparjoy won't impact monsoon further: IMD",
    "Russian missile attack on Ukraine kills 11 in Zelenskyy's hometown",
    "US consumer inflation slips to 4.0% in May",
    "Indian Oil cuts capex to Rs 30,395 crore for FY24",
    "Why have MFs fallen in love with Mankind Pharma just a month since its listing?",
    "Adani in talks to refinance $3.8 bn in debt after Hindenburg saga",
    "Trade setup for Wednesday: Top 15 things to know before the opening bell",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "‘Modi-Ji Thali’: US Restaurant Launches Special Thali Ahead Of PM’s US Visit",
    "101 million people have diabetes In India, 136 million pre-diabetic, ICMR data shows",
    "The face behind the fight for same-sex marriage | Pride 2023",
    "Ulwe Better Than New York: This tenant moved the seas to live in Navi Mumbai",
    "Toys, footwear, components for new age bicycles to come under PLI soon: Officials",
    "SEBI issues regulations for execution-only platforms for direct mutual fund schemes",
    "China is uninvestable, but surprised that Sequoia left India: Chamath",
    "Three IPOs in three days, busy week for Dalal Street",
    "Sudhansh Pant new Union Health Secy, Chanchal Kumar Aviation Secretary",
    "Bank unions ask RBI to withdraw compromise settlement for wilful defaulters",
    "Govt’s decision to limit stock holding of wheat will have cooling effect on prices",
    "International flights cancelled, delayed; Air India insiders share what’s going on",
    "Two students share top rank; highest number of qualifying candidates from UP",
    "Bengaluru | MNC employee asked to resign, makes hoax bomb threat; held",
    "WFI elections to be held on July 6, result on same day",
    "US to remove obstacles to defence, high-tech trade with India: NSA Sullivan",
    "Authorities probe bribery claim in toxic syrup tests: Report",
    "In five charts: How ZEEL’s funds were routed back to itself, according to Sebi",
    "Cyclone Biparjoy LIVE Updates:  The places that Biparjoy is likely to impact",
    "Exclusive: GST Council may consider defining online gaming to resolve tax stalemate: Official",
    "Viability Gap Funding (VGF) of Rs 6,800 crore likely for offshore wind projects: Govt sources",
    "Manchester United shares spike after Qatar hints at takeover bid success",
    "Production-ready Innova Hycross-based Maruti Suzuki MPV spied",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "‘Dinner leke aagaye’: Swiggy delivers food at 'Mannat' after Shah Rukh Khan's Twitter banter",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "IKIO Lighting IPO share allotment likely today, here's how to check status online",
    "Japan restaurant chain seeks Rs 4 crore in damages from teen who licked soy sauce bottle",
    "Closing Bell: Nifty above 18,700, Sensex gains 418 pts; all sectors in the green",
    "Porinju Veliyath bets house on 3 stocks; feels they are undervalued even after a good run",
    "This company removed all managers. Employees are now 20% more productive and happier",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Volvo C40 Recharge EV to debut in India on June 14 — all you need to know",
    "NATO begins largest air drill in Germany in ‘show of strength’",
    "Air India Mumbai-Doha flight faces giant delay, flyers tweet Ratan Tata",
    "Millennial Money: How to use ChatGPT to plan your next trip",
    "Paytm CEO says he's 'really bad at reading': 'Since class 12, I have only read two books'",
    "'Dine with the dead' at this Gujarat restaurant adorned by graves and an MF Husain painting",
    "Bengaluru IT hubs waterlogged after heavy rain. Videos",
    "Advance / Decline (NSE) \n\n1243831",
    "More the people, more the d.options.22.34.886838.me views of stocks,, ...",
    "One of the oldest s.options.22.34.886838.me members of our clik s.opti...",
    "Reading through all the q.options.22.34.886838.me boarders here in cli...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "In Pics: NATO begins largest air drill in Germany in ‘show of strength’",
    "June spreads LGBTQ+ Pride and rainbows around the world",
    "SoftBank prepares new round of layoffs at Vision Fund",
    "Microfinance loan portfolio rises by 22% to Rs 3.48 lakh crore in FY'23",
    "Gainers & Losers: 10 stocks that moved the most on June 13",
    "Redevelopment succeeds when original settlers are treated with respect",
    "Inflation, growth trend on track for first rate cut by RBI in early 2024",
    "Prime Minister Narendra Modi to receive 21-gun salute welcome during US visit",
    "Kerala Higher Education: The decline from meritocracy to mediocrity could soon become irreversible",
    "No discussions at state level on electoral understanding with JD(S) for LS polls: Basavaraj Bommai",
    "Biparjoy Cyclone: Here are 10 things you need to know",
    "Valiant_Laboratories_Limited_DRHP",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "How LIC Mutual Fund's chief executive plans to turn the tortoise into a hare",
    "5 things about money that Edelweiss CEO Radhika Gupta wants her son to learn first",
    "Has the time come for credit risk funds again? Yes, says R Sivakumar of Axis MF",
    "HDFC Defence Fund to stop lumpsum investments and new STPs, restricts SIPs to Rs 10,000",
    "Fee caps to dent profits for MFs by 30% or more, predicts Jefferies study",
    "Franklin Templeton repays investors of two debt funds",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Mutual funds lose Rs 342 cr in just two sessions as bears plunder IEX shares",
    "Why have China-focussed mutual funds hit a bump, again?",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "UP RERA issues notice to Investors Clinic over violations in M3M's Noida project",
    "Flex workspace provider WeWork adds over 1,500 desks in Hyderabad",
    "Flex office space provider International Workplace Group plans to expand to Tier 2, Tier 3 cities",
    "Remain constructive on real estate sector: Kotak Institutional Equities",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "Gold firms as dollar eases, focus on Fed cues",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Hyderabad Industries: Time to accumulate, but keep patience",
    "Trade Spotlight | Your game plan for Linde India, Nazara Technologies, REC today",
    "V-Guard: A viable option for investors looking for reliability, growth",
    "Top 10 picks for next 3-4 weeks as market stays bullish despite rush for profits",
    "CARE Ratings closes above 30-Day Moving Average of 671.49 today.",
    "Gayatri Rubbers and Chemicals",
    "Gayatri Rubbers closes below 30-Day Moving Average of 42.28 today.",
    "Prajay Engineers Syndicate",
    "Prajay Engineer closes below 30-Day,50-Day Moving Average today.",
    "Usha Martin Education and Solutions",
    "Usha Martin Edu closes below 30-Day,50-Day Moving Average today.",
    "Power & Instrumentation (Gujarat)",
    "Power & Instrum closes below 200-Day Moving Average of 55.71 today.",
    "Ruby Mills closes below 200-Day Moving Average of 214.32 today.",
    "GTL Infra closes below 30-Day Moving Average of 0.81 today.",
    "Set SMS alerts for market news",
    "Infra push boosts demand for core engineering skills",
    "Remote work pay cuts send the wrong message",
    "ECB inches nearer to the interest-rate summit",
    "Agri Picks Report June 13, 2023: Geojit",
    "Buy Hindustan Unilever; target of Rs 3100: Motilal Oswal",
    "Buy Hero MotoCorp; target of Rs 3500: Motilal Oswal",
    "MRF at Rs 1 lakh: Is it an 'expensive' stock?",
    "Indifi Technologies raises $35 million in Series E round led by ICICI Venture",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "See More Top Companies in India",
    "Wall Street at new 2023 high, India inflation cools & AMC stocks in focus | Market Minutes",
    "Block deal in Go Fashion, key Nifty levels to watch out for & more | Market Minutes",
    "RBI MPC decision, Tech Mahindra & utility stocks in focus | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]