[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Apple US0378331005, AAPL:US",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18979.05\n\n+161.65 (+0.86%)",
    "Sensex\n\n63953.95\n\n+537.92 (+0.85%)",
    "Mumbai has 77% of India’s tall buildings; Hyderabad ranks second: CBRE",
    "ED arrests real estate firm Supertech's chairman R K Arora",
    "Prosus reduces Byju's fair value further to $5.1 billion",
    "US considering new restrictions on AI chip exports to China",
    "NDTV shareholders approve appointments of new directors on board",
    "Bank Nifty expiry change: Are regulators tacitly acknowledging concentration risk?",
    "There could be fireworks after the Sebi Board meeting",
    "Sensex, Nifty scale all-time highs: Will the rally sustain?",
    "GQG group said to invest $1 billion in Adani flagship, green arm",
    "Tomato Price Rise: Why are tomatoes being sold at Rs 100/kg in Delhi & Bengaluru?",
    "Apple Credit Card In India: All You Need To Know About 'Apple Card', Coming To India Soon",
    "Learn to save income tax on your savings account interest by claiming deductions under 80TTA",
    "HUL New CEO: Rohit Jawa Takes Over As MD & CEO of Hindustan Unilever; His To-Do List Is A Long One",
    "Tata Motors zooms to 52-week high on JLR outlook, IPO nod to Tata Tech",
    "HDFC, HDFC Bank rise after clarification on merger date",
    "Adani stocks trade mixed after large trade deals, Adani Enterprises jumps 5%",
    "Market LIVE Updates: Sensex surges 600 pts, Nifty around 19,000; Nifty Bank hits record high",
    "With eye on food inflation, govt ready to keep check on prices of key items",
    "‘Data Entry’ most boring and fun job for Indian freelancers: Study",
    "Why did Ambedkar call Uniform Civil Code a  ‘little corner we have not been able to invade’?",
    "What Madras HC property order means for homemakers, their husbands",
    "Want to take out a life insurance policy? Here are the term plans on offer",
    "Opposition Unity: Will Congress play spoiler or enabler?",
    "India's Housing Sales Live Updates: India's Top 7 Cities Witness Record Housing Sales in Q2 2023",
    "IIT Bombay ranks 1st in India, 149th in world in QS World University Rankings",
    "Monsoon live updates: IMD issues yellow alert for Mumbai till June 29",
    "Ravi Kishan's daughter joins armed forces under Agnipath scheme",
    "QS World University Rankings 2024: Top 10 universities in the world",
    "How ‘Bazball’ is challenging the conventional wisdom of test cricket",
    "Amazon's flagship Prime Day sale to begin on July 15",
    "Google announces accelerator programme for ONDC",
    "Gold Rate Today: Prices s10872261lump as US economic data casts shadow",
    "Sanofi to widen presence in India with more products: MD Rodolfo Hrosz",
    "Singer Pink pauses performance briefly after fan throws mother's ashes on stage: Video",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Newsletter with fundamental stock ideas, multi-baggers and insights",
    "Brazilian billionaire's construction whims force 81-year-old man to leave his home",
    "Market LIVE Updates: Nifty crosses 19,000, Sensex above 64,000; all sectors in the green",
    "Watch: Delhi robbers try to rob couple at gunpoint, end up giving them Rs 100 because…",
    "9 best botanical gardens in India and abroad",
    "Veteran investor Kanwal Rekhi on Byju's: 'Auditors' resignation typically means...'",
    "Apptio founder Sunny Gupta sells his startup to IBM for $4.6 billion",
    "Sebi board meeting may discuss contentious proposals such as TER, bonus of proof",
    "Memes flood Twitter as tomato prices simmer across states",
    "ED arrests real estate firm Supertech's chairman R K Arora in money-laundering case",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Bharat Jodo Yatra Continues: Rahul Gandhi visits bike repair shop in Delhi's Karol Bagh",
    "Bengaluru woman sues dentist for cutting her lip, gets Rs 60,000",
    "When a 13-year-old boy went to explore Titanic wreck: ‘I fell unconscious’",
    "'Do not approach': Aggressive cow roams US college, prompts police warnings. Video",
    "Ratan Tata fact-checks cryptocurrency investment rumours: 'meant to scam citizens'",
    "Actor Julian Sands confirmed dead after remains found in California mountains identified",
    "Advance / Decline (NSE) \n\n1086949",
    "Closing below 565...... just wait and watch guys.... enjoy.... rally i...",
    "You are right. when a stock doesnt have fundamentals in place like deb...",
    "Extremely robust qtrly results will be declared bt pel.hold or keep ad...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets snap 4-week winning streak",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Nissan will not fill COO position left open by Ashwani Gupta's departure",
    "Two official teams from India, EU to discuss carbon tax issues",
    "OYO to add over 1,000 hotels by December, targets to rope in 100 first generation hoteliers",
    "Kotak Mahindra Bank customers can now use RuPay credit cards on UPI",
    "India produces 2.7 crore vehicles, valued at $108-billion in FY23: Report",
    "Naveen Patnaik urges Nirmala Sitharaman to withdraw 18% GST on Kendu leaves",
    "Hunter biden isn’t hiding. Even some Democrats are uncomfortable",
    "What will happen to Prigozhin and his Wagner fighters? Here’s what we know.",
    "Pyramid_Technoplast_Limited_Addendum_to_the_DRHP",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "Mutual funds ramp up stakes in new-age companies by 2-3X as PE/VCs head out",
    "Mutual Fund Review: Quant MF launches healthcare fund; should you invest?",
    "Tata Small Cap Fund to stop accepting lump sum investments from July 1",
    "Will credit risk debt funds make a comeback?",
    "Debt is his first choice: Rajiv Shastri’s journey from broker to CEO of a mutual fund",
    "MC Review: HDFC MF’s new consumption-themed fund comes with a twist. Will it work?",
    "Personal Finance: 3 handy tips to make your SIPs a success",
    "How much life insurance do you need?",
    "Choose wisely to avoid travel insurance frauds",
    "Tackling customer protection issues in life insurance for low-income households",
    "Kerala to roll out state-supported insurance scheme for MSMEs",
    "85% of health insurance reimbursement claims are for less than Rs 1 lakh: SecureNow study",
    "Exclusive: New commission rules will benefit policyholders & insurance firms: IRDAI chief",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Multibagger country: These top smallcap funds grew up to 12 times in 10 years",
    "Mid-Small Cap outperformance to continue amid strong inflow: Jefferies",
    "DSP MF rolls out tech sector ETF after dismal year for IT stocks. Time to scoop up IT stocks?",
    "ITR filing: Know who can and can't file income tax returns using ITR this year",
    "Filing income tax return (ITR) for the first time? Here is how to get started",
    "ITR filing: Know how to file income tax returns without Form 16 in simple steps",
    "ITR filing: Claiming tax deductions without proofs can backfire, warn CAs",
    "Noida Restaurant Service Charge Fight: What To Do If A Restaurant Levies Service Charge?",
    "Income Tax Return filing: Things to keep in mind while filing taxes",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Over 1.15 lakh housing units sold in top seven cities in Q2 of 2023",
    "Chart of the day| What is driving real estate growth",
    "Home and dry? 5 Mumbai areas that see waterlogging every year during monsoon",
    "K Raheja Corp, Cinevista to develop luxury homes project on 3.91 acres near Kurla",
    "Gold Rate Today: Prices slump as US economic data casts shadow",
    "AI frenzy draws hordes to private markets in industry gold rush",
    "Gold slips after strong US data as focus turns to Powell",
    "Gold Rate Today: Prices rebound from 3-month lows, buying interest seen",
    "US stocks muted, gold gains as rate hike worries linger, Russia tension simmers",
    "Gold firms above 3-month lows amid political turmoil in Russia",
    "Gold Rate Today: Prices rebound on a weaker dollar",
    "Seeking higher EPS pension? You have till July 11 now to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "SBI Card’s growth is remarkable, but potential profits are not",
    "Forex cards or credit cards? Which one is better for foreign travel",
    "SBI Card dips after mixed growth data for May",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Transport Corporation of India: A consistent performer",
    "Hot Stocks | NLC India, Shyam Metalics, KIMS may deliver double-digit returns",
    "Is it time to look at this oleochemicals derivatives play?",
    "Trade Spotlight | Your game plan for SJVN, PB Fintech, Mazagon Dock Shipbuilders today",
    "Hot Stocks | Hikal, Firstsource Solutions, Mahindra Holidays can fetch up to 22% returns",
    "MC Interview | Prashant Shah of Definedge bullish on these 5 sectors for medium term",
    "Nifty can see profit booking in F&O expiry week before making positive attempts, says Ashish Kyal",
    "Exhicon Events Media Solutions",
    "Only Buyers in Exhicon Events on BSE",
    "Only Sellers in Eureka Ind on BSE",
    "Spectrum Talent Management",
    "Only Sellers in Spectrum Talent on NSE",
    "Only Buyers in Cadsys India on NSE",
    "Gopal Iron & Steels Co.(Gujarat)",
    "Only Sellers in Gopal Iron on BSE",
    "Only Sellers in Earum Pharmace on BSE",
    "Only Sellers in SR Industries on BSE",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | Mid-year Outlook: Low visibility, caution is advised",
    "America is feeling buyer’s remorse at the world it built",
    "Eli Lilly’s new weight-loss drug is even better than Ozempic",
    "Buy Craftsman Automation; target of Rs 4750: Motilal Oswal",
    "Tomato prices to remain high for another 20-25 days, say FPOs",
    "Agri Picks Report June 27, 2023: Geojit",
    "Oil nudges higher as supply worries offset concerns about demand",
    "Time to clean up the startup ecosystem. And, put a governance charter in place",
    "Meltdown at Byju’s should end the free pass for startups",
    "EV startup Oben raises Rs 40 crore in extended pre-Series A round",
    "See More Top Companies in India",
    "HDFC delisting date, packaging stocks & more | Market Minutes",
    "Cyient DLM IPO opens, HUL now has a new CEO & more | Market Minutes",
    "Global Chess League’s Gambit | Unusual Suspects",
    "Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]