[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18817.40\n\n+126.20 (+0.68%)",
    "Sensex\n\n63416.03\n\n+446.03 (+0.71%)",
    "NDTV shareholders approve appointments of new directors on board",
    "Change in IPO Schedule | Ideaforge revises issue closing date to June 28",
    "IDFC First Bank raises Rs 1,500 cr via 10-year Basel-III Tier-II bonds",
    "James Crown, director of JPMorgan, dies on 70th birthday",
    "Saudi Aramco sees 'sound' oil outlook for H2 on China, India demand",
    "Exclusive: Shailendra Ajmera to present revised plan for revival of Go First to DCGA on June 28",
    "HDFC says July 13 delisting date is 'tentative'",
    "ED arrests real estate firm Supertech's chairman R K Arora in money-laundering case",
    "Trade setup for Wednesday: Top 15 things to know before the opening bell",
    "Cyient DLM IPO: Management speaks about growth outlook, financial performance",
    "Learn to save income tax on your savings account interest by claiming deductions under 80TTA",
    "Wagner Boss Yevgeny Prigozhin: From selling hot-dogs, to Putin’s top general, to a powerful rebel",
    "Mounting financial worries, layoffs, lawsuits and resignations, Byju's in the eye of the storm",
    "Mumbai To Nashik: The Tenant In A Long-Distance Marriage",
    "HDFC buys shares worth Rs 992.64 crore in HDFC Life Insurance; WWD Ruby exits Sapphire Foods India",
    "NSE scraps plan to shift Nifty Bank F&O expiry to Friday",
    "Wall Street advances, dollar softens after solid economic data",
    "Delaware Court rejects TLB lenders' request to investigate Byju'S $500 million transfer",
    "ROC finds PFS, MD Pawan Singh in violation of Companies Act, penalises in three matters",
    "India's March quarter CAD at $1.3 billion, $67 billion for FY23",
    "MSME Minister Narayan Rane to address Moneycontrol’s Policy Next summit on June 28",
    "Filing ITR for the first time? Here is how to get started",
    "Why Indian space start-ups are against auctioning of satellite spectrum",
    "Tomato prices to remain high for another 20-25 days, say FPOs",
    "Rahul Gandhi to visit violence-hit Manipur on June 29, 30",
    "MC Explains: Why RBI cracked down on credit bureaus that maintain your financial data",
    "Prosus further slashes Byju's fair value to $5.1 billion",
    "Karnataka government to reopen Bitcoin scam, to get it probed thoroughly",
    "ICC ODI World Cup 2023: India vs Pakistan on Oct 15; full schedule out",
    "Ratan Tata refutes cryptocurrency investment rumours: 'meant to scam citizens'",
    "Half-Yearly Report: Six important court rulings in the first half of 2023",
    "Banks to remain closed on June 28, 29 for Eid Al Adha in these states",
    "Zomato delivery agent eats food from a plastic bag. Viral video moves internet",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Newsletter with technical analysis, research advice, and insights",
    "Watch: Delhi robbers try to rob couple at gunpoint, end up giving them Rs 100 because…",
    "Vladimir Putin blasts Wagner ‘traitors’ after Prigozhin denies coup plot",
    "9 best botanical gardens in India and abroad",
    "35 BRS leaders join Congress in presence of Mallikarjun Kharge, Rahul Gandhi",
    "Hero MotoCorp unleashes Xtreme 160R 4V: A power-packed thrill for motorcycle enthusiasts",
    "Bakrid Bank Holiday 2023: Banks to remain closed on June 28, 29 for Eid Al Adha in these states",
    "Seeking higher EPS pension? You have till July 11 now to apply",
    "In pics: At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Essentials for Hajj: A guide to the gear for pilgrimage",
    "PM Modi flags off five Vande Bharat trains in Bhopal",
    "Watch: How an IPS officer brought light to the home of Noorjahan in UP",
    "Memes galore on Twitter as tomato prices skyrocket across states. Best ones",
    "Harvard professor researching 'honesty' put on leave for falsifying data",
    "Watch the moment when chimpanzee, caged for life, sees sky for first time",
    "Advance / Decline (NSE) \n\n1242794",
    "Some time up for new components manufacturing,not much details of it f...",
    "Its right time to add it stocks dont miss opportunity for more tmpuja ...",
    "What is the good news if funds have been raised? they will have to pay...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets snap 4-week winning streak",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Gucci owner acquires creed to expand in luxury fragrances",
    "Britcoin may not actually be on Blockchain, BoE executive says",
    "Lufthansa enters crunch week of talks with pilot union",
    "DealShare to invest Rs 1,000 crore in 5 years to help MSME partners scale business",
    "India has opportunity to leapfrog into AI, generative AI areas: Salesforce",
    "Amara Raja Infra bags solar project worth $130 million in Bangladesh",
    "New Zealand Prime Minister Hipkins visits China to boost economic ties",
    "India's road network grows 59% in 9 years to become second largest in world: Nitin Gadkari",
    "AAP slams CAG audit in Kejriwal's residence renovation, says it betrays BJP's 'desperation'",
    "PM Modi's call for Uniform Civil Code ignites opposition backlash",
    "Assam govt functions to feature 3-minute drama on road safety, says CM Himanta Biswa Sarma",
    "Pyramid_Technoplast_Limited_Addendum_to_the_DRHP",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "Mutual funds ramp up stakes in new-age companies by 2-3X as PE/VCs head out",
    "Mutual Fund Review: Quant MF launches healthcare fund; should you invest?",
    "Tata Small Cap Fund to stop accepting lump sum investments from July 1",
    "Will credit risk debt funds make a comeback?",
    "Debt is his first choice: Rajiv Shastri’s journey from broker to CEO of a mutual fund",
    "MC Review: HDFC MF’s new consumption-themed fund comes with a twist. Will it work?",
    "Personal Finance: 3 handy tips to make your SIPs a success",
    "Kerala to roll out state-supported insurance scheme for MSMEs",
    "85% of health insurance reimbursement claims are for less than Rs 1 lakh: SecureNow study",
    "Exclusive: New commission rules will benefit policyholders & insurance firms: IRDAI chief",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "LIC launches Dhan Vriddhi, a single premium guaranteed endowment policy",
    "MC explains: Why third-party motor insurance is critical for all vehicles on the road",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Multibagger country: These top smallcap funds grew up to 12 times in 10 years",
    "Mid-Small Cap outperformance to continue amid strong inflow: Jefferies",
    "DSP MF rolls out tech sector ETF after dismal year for IT stocks. Time to scoop up IT stocks?",
    "ITR filing: Know who can and can't file income tax returns using ITR this year",
    "Filing income tax return (ITR) for the first time? Here is how to get started",
    "ITR filing: Know how to file income tax returns without Form 16 in simple steps",
    "ITR filing: Claiming tax deductions without proofs can backfire, warn CAs",
    "Noida Restaurant Service Charge Fight: What To Do If A Restaurant Levies Service Charge?",
    "Income Tax Return filing: Things to keep in mind while filing taxes",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "K Raheja Corp, Cinevista to develop luxury homes project on 3.91 acres near Kurla",
    "The Executive Centre to double flex Grade A office portfolio in India, invests Rs 100 cr",
    "Chintels Paradiso cordons off tower with sagging balcony",
    "India’s REIT potential is 380 million sq ft, says Colliers report",
    "Godrej Properties board approves issuance of NCDs worth Rs 750 crore",
    "Gold slips after strong US data as focus turns to Powell",
    "Gold Rate Today: Prices rebound from 3-month lows, buying interest seen",
    "US stocks muted, gold gains as rate hike worries linger, Russia tension simmers",
    "Gold firms above 3-month lows amid political turmoil in Russia",
    "Gold Rate Today: Prices rebound on a weaker dollar",
    "Gold set for biggest weekly drop since Feb on hawkish Fed",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Forex cards or credit cards? Which one is better for foreign travel",
    "SBI Card dips after mixed growth data for May",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Is it time to look at this oleochemicals derivatives play?",
    "Trade Spotlight | Your game plan for SJVN, PB Fintech, Mazagon Dock Shipbuilders today",
    "Hot Stocks | Hikal, Firstsource Solutions, Mahindra Holidays can fetch up to 22% returns",
    "Ten best bets for next 3-4 weeks as bulls go slow on scaling new highs",
    "Trade Spotlight | How you should trade in DCM Shriram, ICICI Securities, Natco Pharma",
    "MC Interview | Prashant Shah of Definedge bullish on these 5 sectors for medium term",
    "Nifty can see profit booking in F&O expiry week before making positive attempts, says Ashish Kyal",
    "Daily Voice | Rajesh Kothari of AlfAccurate identifies 3 compelling investment themes for FY24",
    "Infinium Pharma closes below 30-Day Moving Average of 281.71 today.",
    "Kavveri Telecom closes below 200-Day Moving Average of 7.65 today.",
    "KCP Sugar closes above 30-Day Moving Average of 24.83 today.",
    "Party Cruisers closes below 30-Day Moving Average of 62.35 today.",
    "Perfect Infra closes below 150-Day Moving Average of 19.10 today.",
    "Global Educatio closes below  its 50-Day,150-Day,200-Day Moving Average today.",
    "Asian Hotels closes below 30-Day Moving Average of 177.30 today.",
    "Set SMS alerts for market news",
    "IBM can’t acquire its way into tech’s top ranks",
    "Russia’s mutiny underscores oil’s fragility",
    "Nobel laureate Harry Markowitz was a misunderstood economist",
    "Opposition Unity: AAP and Congress cannot sustain an alliance, whatever the formula",
    "Agri Picks Report June 27, 2023: Geojit",
    "Buy Tarsons Products Ltd; target of Rs 770: LKP Research",
    "Buy JTL Industries; target of Rs 470: Axis Securities",
    "Oil nudges higher as supply worries offset concerns about demand",
    "EV startup Oben raises Rs 40 crore in extended pre-Series A round",
    "Stability AI head of research resigns from startup",
    "Called out by intern for not paying stipend, Soshals app founder’s justification",
    "See More Top Companies in India",
    "Cyient DLM IPO opens, HUL now has a new CEO & more | Market Minutes",
    "Global Chess League’s Gambit | Unusual Suspects",
    "Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Getting India Smart & Connected | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]