[
    "SBI INE062A01020, SBIN, 500112",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Apple US0378331005, AAPL:US",
    "Infosys INE009A01021, INFY, 500209",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18206.35\n\n+24.60 (+0.14%)",
    "Sensex\n\n61678.72\n\n+118.08 (+0.19%)",
    "Tyre-makers under pressure as too much rubber hits the road",
    "Swiggy's food delivery biz turns profitable in March, excluding ESOP costs",
    "Vedanta in talks with Deutsche, other banks for up to $600 million loan",
    "Infosys slashes avg variable payout for Q4FY23 to 60%",
    "Market LIVE Updates: Indices erase gains, trade flat amid volatility; banks outshine",
    "Will Artificial Intelligence really take your job? Level up with these skills to beat ChatGPT, AI",
    "Avoid these 5 financial mistakes to safeguard yourself from heavy losses",
    "Meet Infosys Techie Who Quit His Job To Do Brinjal Farming in Japan, Now Earns Double",
    "PVR INOX To Put Curtains Down On 50 Screens After Q4 Loss Trebles To Rs 333 Cr",
    "Tax-saving tips for first-time employees | How to save Income-Tax | Money Mojo",
    "Domino’s is coming to ONDC: tech integration has already started, says Jubilant exec",
    "JK Tyres slumps 6% as investors book profits on strong Q4 show",
    "Jubilant FoodWorks Q4 net profit falls 59%; check what brokerages say",
    "SBI Q4: Brokerages see 68% rise in profit, 25% interest income growth",
    "Siddaramaiah: A pro-poor leader who rose from humble beginnings",
    "Pfizer asks doctors to avoid certain antibiotics due to deviations at mfg unit",
    "Embracing cloud technology critical to $5 trillion economy ambitions: AWS CEO Adam Selipsky",
    "Amazon Web Services to invest $12.7 billion in India cloud by 2030",
    "ZestMoney co-founder Lizzie Chapman opens up about leadership change, challenges",
    "MC Insider: Power space hotting up, juicy deals in F&B space and more",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Live News Today | Jallikattu sport to go on: SC",
    "Karnataka: Siddaramaiah takes the helm, Congress clears the air",
    "Jallikattu to go on in Tamil Nadu, Supreme Court upholds amendment to animal cruelty law",
    "Tesla team meets PMO, MoRTH officials, show serious interest in India as EV market: Sources",
    "Govt mulls slashing subsidy for 2-wheeler EVs, prices may go up",
    "This Delhi woman quit her corporate job to travel the world full-time",
    "Indian-origin cab driver gave Harry, Meghan a ride after paparazzi chase. What he said later",
    "Cannes 2023 Day 2: Sara Ali Khan shines in a saree, Mrunal Thakur debuts",
    "KTM 390 Adventure spoke wheels with fully adjustable suspension; All you need to know",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Bengaluru's traffic nightmare: Techies stuck in IT corridors for hours, many return home",
    "'15-minute phone call': Indian Amazon employee laid off in US",
    "CEO says remote workers are hurting businesses: ‘We caught trains, buses, ferries to work’",
    "Google, Meta, Amazon hiring low-paid H1B workers after US layoffs: report",
    "All for a phone: Man uses forged Vistara ticket to enter Mumbai airport, gets arrested",
    "Google reveals its first foldable phone Pixel Fold",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "France honours Tata Sons Chairman Chandrasekaran with its highest civilian award: See Pics",
    "Tata IPL 2023: Livingstone's quickfire 94 goes in vain as Delhi Capitals beat Punjab Kings",
    "When a flight attendant was brusque with Narayana Murthy: ‘didn't recognise him’",
    "Indian-origin doctor purposely drove family off cliff in Tesla, 'he’s depressed', says wife",
    "US ambassador takes Mahindra EV for a spin with Anand Mahindra",
    "Advance / Decline (NSE) \n\n1094869",
    "In last 2-3 days buyers are not putting buy order in queue but buying ...",
    "Brother now value to high buy at morning 45 to 50 now 110 almost day h...",
    "Warning to all retail investors stay away from this stock they will lo...",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Pakistan court extends bar on Imran Khan's arrest till May 31",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Vedant Fashions promoter launches offer for sale to offload 9.8% stake",
    "Effects of El Nino and the importance of monitoring and predicting the weather patterns",
    "Joe Biden is forced to pivot back to a divided home front",
    "Steel prices are set to cool",
    "International Museum Day: PM Modi inaugurates International Museum Expo 2023 | Live",
    "Jupiter_Life_Line_Hospitals_Limited_DRHP",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Large, mid or smallcap? Find out which fund suits you the best",
    "Does the large size of SBI Small Cap Fund bother its fund manager, R Srinivasan?",
    "Can inflows into gold ETFs sustain?",
    "SIPs and bank FDs attract investors amid volatility and new tax rules",
    "Are your equity funds investing in the same stocks?",
    "Ultra short duration funds: Riding rising rates",
    "Why debt mutual funds are still relevant and investment-worthy",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Despite correction, these mid- & small-cap technology stocks got picked by mutual funds",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Karnataka to revise property guidance value, a hike between 10-30% likely: Sources",
    "Mumbai-based Dosti Realty forays into Pune market, to construct over 1 million sq ft",
    "Real estate firm Group 108 to invest over Rs 2,000 crore in Noida-Greater Noida in next 10 years",
    "India Ratings and Research revises outlook for commercial real estate sector to neutral for FY24",
    "Mumbai’s top builders face reckoning over delayed projects and incomplete delivery",
    "Chart of the Day: What is triggering luxury apartment sales?",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Trade Spotlight | Your game plan for CreditAccess Grameen, Cyient, Amara Raja Batteries today",
    "GSFC breaks a Bullish Flag pattern; Here is why the stock is likely to surpass record high soon",
    "Hot Stocks | Here is why you should buy IDBI Bank, GMDC, &amp; sell ACC for short term",
    "Torrent Pharma forms Bullish Harami pattern. Will it reclaim record high?",
    "How much upside is there to the IDBI Bank stock with Kotak Bank eyeing a possible stake?",
    "Daily Voice | 'Financial services sector to drive double digit market growth'",
    "Daily Voice | This fund manager is bullish on SRF, SKF, PI Industries. Find out why",
    "Expect EBITDA margin to sustain at 25-30% in FY24, says Meghmani Finechem CMD Maulik Patel",
    "Sundaram Brake is moved by 0.30",
    "Tirupati Forge is moved by -4.74",
    "Banswara Syntex is moved by 6.68",
    "Salona Cotspin is moved by -3.28",
    "Oberoi Realty is moved by -2.30",
    "Banswara Syntex is moved by 6.45",
    "Set SMS alerts for market news",
    "Chart of the Day: Lead prices to rule firm on weak supply",
    "With UK parent snub, Vodafone Idea’s position as precarious as ever",
    "Agri Picks Report May 18,2023: Geojit",
    "Buy UGRO Capital; target of Rs 280: Ajcon Global",
    "MTAR Tech falls 6% on profit booking after a strong Q4 show",
    "Commodities Live: Gold Prices Fall Below $2000; Right Time To Buy?",
    "Agri Picks Report May 17,2023: Geojit",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "Vedant Fashions OFS, SBI Q4 preview and HDFC Bank in focus | Market Minutes",
    "What are risk-o-meters & should investors monitor them constantly? Simply Save",
    "Nifty @18,300: What next? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]