[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Vedanta INE205A01025, VEDL, 500295",
    "Apple US0378331005, AAPL:US",
    "Adani Ports INE742F01042, ADANIPORTS, 532921",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18348.00\n\n0.00 (0.00%)",
    "Sensex\n\n61981.79\n\n+18.11 (+0.03%)",
    "Karnataka Effect: Is BJP mulling a change of electoral strategy in Telangana?",
    "QIA leads $250 mn round in London-based Builder.ai",
    "Jamie Dimon has no plans to step down as JPMorgan CEO anytime soon",
    "M&M to sell 3.2% stake in auto component arm Mahindra CIE Automotive",
    "Top 10 things to know before the market opens today",
    "Paytm, Apollo Tyres, TVS Motor may fetch up to 16% return in short term",
    "Market LIVE Updates: Indices likely to open lower amid weak global cues; oil prices gain",
    "LIVE: Lot Of Appetite To Invest In India, says Salvatore Babones On PM Modi's Australia Visit",
    "JSW Steel Q4 Results | ‘India’s Growth Fuelled Good Quarter’, Says Jayant Acharya",
    "Zomato, Nykaa, Paytm, Delhivery High On Mutual Fund Houses' Buy List In April: Time To Buy?",
    "WhatsApp Job Scam: 5 Tips To Ensure You Don’t Get Scammed!",
    "The Siblings Who Moved Next Door To Find A Parking Spot | The Tenant",
    "Biocon Q4 net profit rises 31% to Rs 313 crore; declares dividend",
    "Polyplex Corporation to sell 24% stake to AGP Holdco Limited for Rs 1379 crore",
    "Buzzing Stocks: Hindalco, Ashok Leyland, Wockhardt, JSW Energy in news today",
    "Ashok Leyland Q4 net profit drops 17% YoY to Rs 751 cr; declares dividend",
    "JioCinema hits record concurrent viewership during CSK-GT match",
    "GQG's Rajiv Jain remains bullish on Adani, raises stake by about 10%",
    "Govt to offer incentives in demand aggregation model for green hydrogen",
    "Braving rough seas to gear up for $2-trillion export target",
    "All the big stories to get you started for the day",
    "OMCs likely to benefit from improving marketing environment in FY24",
    "Indian cough syrup caused mass child deaths in Gambia, international panel says",
    "NMDC Q4 results: Net profit rises 22% to Rs 2,277 crore; revenue falls 14%",
    "Top 10 trading ideas for next 3-4 weeks as bulls take charge of Nifty, 8 weeks on",
    "Urban consumption ended FY23 at over-three-year high but may fall in FY24: QuantEco Research",
    "SpiceJet hikes salary of pilots, Captains to now receive Rs 7.5 lakh per month",
    "DLF family, 11 other Indian developers in M3M Hurun Global Rich List",
    "Wipro expands partnership with Google Cloud",
    "Rs 2,000 note withdrawal: Banks see no rush for exchange, deposit",
    "UP petrol pump employee takes back fuel from scooter after customer pays with Rs 2,000 note. Watch",
    "Go First working on plan to resume flights at the earliest: Official",
    "Tata Safari Facelift Spied Again; Fresh Details Revealed",
    "Newsletter with technical analysis, research advice, and insights",
    "Happy birthday, Clint Eastwood",
    "Jeff Bezos, girlfriend make grand entrance at Cannes on $500 million superyacht",
    "Trade setup for Wednesday: Top 15 things to know before the opening bell",
    "US CEO, who spends $2 million a year on age reversal, now using teen son as 'blood boy'",
    "Infosys unveils AI-first offering Topaz, sees huge interest from clients",
    "Delhi woman, driving BMW, runs over man while returning from party",
    "Interview | 'Nifty likely hitting 19,000 by June, expect buying interest in these 4 stocks'",
    "In Pics: Kohli's sublime century powers Bangalore to crucial win in Indian Premier League 2023",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Is your MF justified for the expenses it charges you?",
    "Women take top 4 ranks in UPSC Civil Services Examination 2022",
    "Zimbabwe tops ‘World’s most miserable countries’ list. India’s rank is…",
    "Inside 'Modi Airways', charter flight to Sydney for NRIs to greet PM. Watch",
    "Advance / Decline (NSE) \n\n1047988",
    "Intraday trades avialbe daily 4 to 5 cals with full guidence just texx...",
    "Volumes are misleading, only 19% delivery ,whereas 30 crore shares wer...",
    "Last quarter result was not that impressive compared to previous. expe...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Netflix to charge an additional $8 month for viewers living outside US subscribers' households",
    "No signs of progress from White House, Republicans in 'tough' debt ceiling talks",
    "Saudi warns speculators of more pain as OPEC+ meeting looms",
    "India's PC market dips by 30% to 29.92 lakh units in Q1'23 , HP leads with 33.8% share",
    "Modi at 9: Braving rough seas to gear up for $2-trillion export target",
    "Indian banks set for profit boost on bank notes withdrawal",
    "Rahul Gandhi moves Delhi court seeking NOC to secure fresh passport",
    "Rule prohibiting investment by opaque funds done away by SEBI on 'weak grounds', claims Cong",
    "Karnataka Effect: Is BJP mulling a change of electoral strategy in neighbouring Telangana?",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "HDFC Defence Fund advances NFO closing date from June 2 to May 30",
    "Mutual funds brace for impact of Sebi consultation paper on total expenses",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "How can retirees use MC30?",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "SEBI wants mutual funds to catch front running, insider trading frauds",
    "Five Sebi proposals may make mutual funds cheaper and more transparent",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Is your mutual fund justified for the expenses it charges you?",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Noida Authority asks builders to register 1,097 flats in 21 projects or face action",
    "Shriram Properties acquires new project in Chennai; eyes Rs 1,200 crore sales revenue",
    "Rustomjee Group has 20 forthcoming projects with saleable potential of 27.86 million sq.ft.",
    "Developer liable to maintain project till OC is obtained and association formed: KRERA",
    "Operational office stock offers REIT-worthy assets valued at over $61 billion for future listing",
    "Wave Megacity’s 38 Noida properties to be auctioned for non-payment of dues",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "Commodities Live: Commodities eye the G7 meeting, Powell speech today",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Trade Spotlight | Your strategy for Route Mobile, Bajaj Electricals, Divi's Labs today",
    "Hot Stocks | Paytm, Apollo Tyres, TVS Motor may fetch up to 16% return in short term",
    "Delhivery: A reality check on the growth hype",
    "Balkrishna Industries on a breakout, stock shows fresh bullish overtone",
    "Trade Spotlight | How to trade in Elgi Equipments, Muthoot Finance, Mastek today",
    "Daily Voice | LIC Mutual Fund bullish on these 4 sectors for FY24, says this fund manager",
    "Buy Route Mobile; target of Rs 1735: HDFC Securities",
    "Hold Divi&#39;s Laboratories; target of Rs 2700: Prabhudas Lilladher",
    "Buy Bharat Electronics; target of Rs 125: Prabhudas Lilladher",
    "Krishna Institute of Medical Sciences",
    "Buy Krishna Institute of Medical Sciences; target of Rs 1660: Prabhudas Lilladher",
    "Neutral Muthoot Finance; target of Rs 1125: Motilal Oswal",
    "Neutral JSW Steel; target of Rs 700: Motilal Oswal",
    "Set SMS alerts for market news",
    "The AI gold rush will take humanity to some dark places",
    "Air conditioning can't stop climate migration",
    "RBI must adopt well-defined and time-bound guidelines on replacing soiled notes",
    "Buzzing Stocks: Hindalco, Ashok Leyland, Wockhardt, JSW Energy and others in news today",
    "Commodities Live: Crude Gains 1%; Gasoline Prices At 5-week Highs | Why Are Prices Surging?",
    "Agri Picks Report May 23, 2023: Geojit",
    "Oil prices rise on outlook for higher gasoline demand, tighter supply",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "See More Top Companies in India",
    "Should you bet on sectors with highest earnings growth? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "BPCL surprises the Street, correction in IT stocks & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]