[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Infosys INE009A01021, INFY, 500209",
    "Apple US0378331005, AAPL:US",
    "Reliance INE002A01018, RELIANCE, 500325",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18598.65\n\n+99.30 (+0.54%)",
    "Sensex\n\n62846.38\n\n+344.69 (+0.55%)",
    "'Shame': Twitter reacts to Indian wrestlers getting detained in Delhi",
    "FDI equity inflows falls 22% to $46 billion in 2022-23",
    "Jaypee Infratech defers approval of financial statements for March quarter",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "Head-to-Head: ITC, HUL stake equal claims to FMCG crown",
    "CBI books Rolls Royce for alleged corruption in Hawk Advanced Jet Trainer deal",
    "NDTV brought under short-term additional surveillance measure from May 30",
    "PM launches Rs 75 coin: Why has govt come up with the coin? Here is all you need to know",
    "Instagram star influencer moves out of village to rent in Navi Mumbai | The Tenant",
    "First Glimpse Of New Parliament | Inside Look Of Lok Sabha & Rajya Sabha Chambers",
    "FDI Into India Falls 16% In FY23: Why Are Foreign Investors Wary?",
    "Australian MPs were \"jealous\" of PM Modi's popularity, says Leader Of Opposition Peter Dutton",
    "What Is ‘Disease X’? WHO Rings Warning Bells For A Deadlier Pandemic",
    "ISTS charges on offshore wind, hydrogen, ammonia projects waived for 25 years",
    "Is aviation going the telecom way?",
    "At $3.31-trillion valuation, India reclaims fifth spot in global stock market tally",
    "Jaypee Infratech defers approval of financial statements for March 2023 quarter",
    "IPL 2023 Final: JioCinema sets another record with 3.2 crore viewers",
    "Urban unemployment hit new low of 6.8% in January-March: Govt survey",
    "Amid market glut, export slump, cashewnut prices crash",
    "Meet Jensen Huang, whose wealth doubled to $35 bn this year, thanks to AI",
    "GT vs CSK Final: Dhoni becomes first to play 250 IPL matches, appear in 11 finals",
    "Manipur Violence Updates: Shah arrives in strife-torn Manipur to bring peace",
    "Pak president approves SC review of judgments bill, clears way for former PM Nawaz Sharif's return",
    "Return of unclaimed deposits will take time, says FM Nirmala Sitharaman",
    "ITR filing: These common mistakes may attract income tax department notice",
    "Indian pharma must ensure compliance with global standards: Kiran Mazumdar-Shaw",
    "Zerodha co-founder Nikhil Kamath is worried about friendship recession. Here's what it means",
    "Go First offers pilots Rs 1 lakh in addition to monthly salary in bid to retain them",
    "Warburg Pincus affiliate acquires stake in Vistaar Finance, backs Avijit Saha as CEO",
    "ONGC plans Rs 1 lakh crore green push to set up 10 GW of capacity by 2030",
    "One big lesson Bill Ackman has drawn from Hindenburg’s takedown of Icahn Enterprises",
    "A guide to commercial real estate investing",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with commodity research advice and market analysis",
    "PM Modi responds to Shah Rukh Khan’s video on new Parliament building",
    "New seasons of 14 OTT shows to look forward to",
    "Delhi woman, kidnapped in 2006, found after 17 years",
    "PM Modi launches Rs 75 coin. Where and at what price can you buy it?",
    "Woman becomes 'full-time daughter' after parents offer her Rs 47,000 per month",
    "Once a symbol of China’s growth, now a sign of a housing crisis",
    "Closing Bell: Nifty around 18,600, Sensex gains 345 pts; auto, bank, metal, realty rally",
    "Watch: Can Indian startups sustain their current pace of growth? India’s Unicorns weigh in",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "ISRO's GSLV-F12 carrying navigation satellite lifts off from Chennai",
    "Girl stabbed 22 times to death by alleged boyfriend in Delhi CCTV horror, bystanders walked by",
    "IIT graduate quit Rs 36 lakh job offer to take UPSC exam, ranks 135",
    "This 60-year-old's wealth doubled to $35 billion this year, thanks to AI. Meet Jensen Huang",
    "Advance / Decline (NSE) \n\n1139941",
    "Bank nifty levels coming soon d.options.22.34.886838.me only on our gg...",
    "Tomorrow guarantee profit twenty lacs in option trading interested msg...",
    "Result is good in terms of revenue and net profit....reported a net pr...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Explosions rock Kyiv after new air-raid warning",
    "Talks possible if Imran Khan apologised to nation for May 9 carnage: Pakistan minister Ishaq Dar",
    "Shanghai records hottest May day in 100 years: Weather service",
    "ONGC Videsh has less than $100 million stuck in Russia, says official",
    "Smartwatch maker in talks to raise funds to expand India push",
    "Inside Paisabazaar’s ongoing pivot to a recurring revenue model",
    "Urban unemployment hit new low of 6.8% in January-March as per govt survey",
    "Sitharaman slams Chidambaram for 'frivolous' criticism of Rs 2,000 note withdrawal",
    "Gehlot, Pilot agree to fight Rajasthan polls unitedly, says Congress",
    "Surprised by Tharoor's tweet on sengol, says Congress leader M M Hassan",
    "Rajasthan CM Ashok Gehlot, Sachin Pilot meet Congress chief Mallikarjun Kharge, Rahul Gandhi",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Tech funds bounce back; time to invest?",
    "How MF sectoral allocation changed in April",
    "Got your first job? Now here’s where you should put your money",
    "'Our job is to create wealthy investors, not run after them'",
    "It's a long process, will take time: Ananta Barua on SEBI’s mutual fund TER proposals",
    "Enhancing fixed income returns when the yield curve is flat is not easy, but there’s a way out",
    "Six charts that influenced SEBI’s mutual fund total expense ratio proposals",
    "Passive investing gains momentum but retail investors still have only a small share",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "MC30 pick: This all-weather debt fund has delivered across rate cycles",
    "Frenetic rush to resolve sovereign debt crises keeps Wall Street jittery",
    "SEBI bringing in Mutual Fund Light regulation to foster passive fund growth: Ananta Barua",
    "One year of interest rate hikes: Debt funds emerge a winner despite headwinds",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Leave encashment up to Rs 25 lakh to be tax-free for non-government workers",
    "TDS, TCS aren’t money lost forever, you can adjust or claim it back",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Chintels Paradiso case: Flat owners in towers E, F asked to get interior evaluation done in a week",
    "Developers are bound to show land documents before purchase, says Karnataka authority",
    "DDA expected to launch housing scheme for 23,000 flats in June",
    "Puravankara plans to launch 15 mn sq ft projects this fiscal, eyes topline of Rs 18,000 crore",
    "GERA Developments appoints CEO for the first time in 52 years",
    "Greater Noida Authority sells 23,600-sqm builder plot for Rs 110 crore",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Sun Pharma: Stretched valuation a sticking point, what else to watch out for?",
    "Top 10 trading ideas for June series as Nifty summits Mt 18,499 and aims to scale higher",
    "Radico Khaitan — Promising market position at a steep valuation",
    "This tyre stock rallies over 35% in May but it can still deliver 9% more",
    "Trade Spotlight | Your game plan for eClerx services, Indus Towers, HDFC AMC today",
    "Want to remove pledge on shares, increase promoter holding, says Jain Irrigation vice chairperson",
    "Daily Voice | What makes Suresh Soni of Baroda BNP Paribas MF bullish on 3Cs in domestic space?",
    "EIH Assoc Hotel closes below 30-Day Moving Average of 477.61 today.",
    "Madhav Marbles and Granites",
    "Madhav Marbles closes below 50-Day Moving Average of 41.13 today.",
    "Vineet Lab closes below 30-Day Moving Average of 47.30 today.",
    "Godfrey Phillip closes below 150-Day Moving Average of 1796.96 today.",
    "Rolex Rings closes below  its 30-Day,150-Day,200-Day Moving Average today.",
    "IFB Industries closes below 30-Day Moving Average of 828.43 today.",
    "Zuari Ind. closes below 200-Day Moving Average of 143.61 today.",
    "Set SMS alerts for market news",
    "Kevin McCarthy won the debt-limit deal. Joe Biden did, too",
    "EU's Deforestation Regulation is meant to cut imports from developing countries",
    "Moneycontrol Pro Panorama | Another challenge for capex revival",
    "Taking Stock: Market extends gain; Nifty at 18,600, Sensex up 345 points",
    "Agri Picks Report May 29, 2023: Geojit",
    "Bulk Deals | Promoter Rajat Agrawal offloads Rs 180.8 crore shares in Gravita India",
    "Buy Nesco; target of Rs 770: East India Securities",
    "Gainers & Losers: 10 Stocks that moved the most on May 29",
    "Commodities Live: Crude Oil Prices At 2-week High; All Eyes On US FED Meet",
    "Oil climbs after US leaders strike provisional debt deal",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Cautious optimism in global markets, FPI inflows highest in six months & more | Market Minutes",
    "Should you log-out of Siemens or buy into weakness? Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]