[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Apple US0378331005, AAPL:US",
    "Reliance INE002A01018, RELIANCE, 500325",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18716.65\n\n-39.25 (-0.21%)",
    "Sensex\n\n63063.76\n\n-164.75 (-0.26%)",
    "Monsoon likely to reach Jharkhand between June 18-21: Official",
    "US lawmakers seek new law to protect TikTok user information",
    "RBI's Shaktikanta Das given 'Governor of the Year' award in London",
    "60 MF schemes to hold Rs 5,000 crore worth HDFC Bank shares beyond Sebi limit post merger",
    "Cautious ahead of markets nearing lifetime highs? Top largecap stocks exited by MFs",
    "After scaling Rs 1 lakh, does the MRF stock have the muscle to climb higher?",
    "Market LIVE Updates: Indices near day's low; IT, metal, banks under pressure",
    "Decoding FD Laddering I Benefits of Multiple Smaller FDs over a big one? | Watch",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "Kylian Mbappe Rejects Contract Renewal With PSG Shortly After Messi’s Exit",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "Market Cap of BSE listed companies hits record high of Rs 291.89 lakh crore",
    "Bain Capital likely seller in Axis as 0.75% shares trade in block",
    "Varun Beverages spurts 4% after stock split",
    "Spandana Sphoorty dismisses reports of sale to Yes Bank, calls them 'speculative'",
    "Acquired at 40% discount, Ustraa says its valuation can increase 6X in 3 years",
    "Coal India Vs CCI: SC holds that CIL falls under competition act despite being a PSU",
    "Flipkart veteran Anil Goteti launches Gen Z and Millenial-focussed fintech startup",
    "How does Metro connectivity impact real estate prices in mature markets?",
    "Under ChatGPT shadow, funding to domestic AI startups halves this year",
    "Jay Powell struggles to explain ‘hawkish pause’ to sceptical economists",
    "Cyclone Biparjoy live updates: Dwarkadhish, Somnath temples shut as Gujarat braces for Biparjoy",
    "Short Call: Upbeat HNIs, CDSL, Deepak Nitrite, banks, Kremlin’s cut, New Zealand in recession",
    "Relaxo Footwears: Q4 FY23 sees trend reversal; getting back foothold",
    "India, US near agreement to build fighter jet engines",
    "Starbucks made to pay $25.6 million to woman who said she was fired for being White",
    "Man fakes his own death to teach family a lesson, then shows up at funeral in helicopter",
    "India will be among first markets to hit life-time high, says Atul Suri of Marathon Trends",
    "What does HNI-meter say about investing in equities?",
    "Flipkart, PhonePe could be $100 billion businesses in India: Walmart",
    "Production-ready Innova Hycross-based Maruti Suzuki MPV spied",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Chinese man tricked in salon, forced to take Rs 1 lakh loan to pay bill",
    "How investor Shankar Sharma, 60, managed to get the body of a man in mid-40s",
    "‘Dinner leke aagaye’: Swiggy delivers food at 'Mannat' after Shah Rukh Khan's Twitter banter",
    "Hungry Swiggy agent walked 3 km to deliver order. How his luck changed after that",
    "EPFO announces formula for calculating higher pension on actual salary",
    "Stock Market Today: Top 10 things to know before the market opens",
    "A $204 million mansion is Dubai’s most expensive house for sale",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Volvo unveils C40 Recharge EV SUV for India; to be launched in August",
    "In 5 charts: How China’s sputtering recovery is hurting crude prices",
    "Bihar man, presumed dead, found at momo stall in Noida",
    "Indian-origin teenager Grace Kumar among 3 killed in Nottingham stabbing",
    "Ananya Birla shares throwback pic on dad Kumar Mangalam Birla’s birthday",
    "Ashneer Grover's birthday greeting from wife Madhuri Jain: 'You look younger than ever'",
    "21-year-old influencer dies at Chinese weight loss camp trying to lose 90 kg",
    "Advance / Decline (NSE) \n\n1067946",
    "Everyone here is saying buy buy, most of them are call writers. stock ...",
    "Golden opportunity to exit denora india. indian management operators n...",
    "Olectra gives high product and service quality matching with ideal ope...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Lithium boom comes to Brazil's 'misery valley'",
    "TikTok's venture into e-commerce paying off: Report",
    "Germany to give $1.4 billion to Holocaust survivors globally in 2024",
    "NTPC can acquire stranded thermal power plants rather investing in new projects: IEEFA",
    "How to tap the competitive advantage of being ‘bad’",
    "Gainers & Losers: 10 stocks that moved the most on June 14",
    "Government mulls tweaks to boost $731 billion insurance sector",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "BJP vs AIADMK spat is good news for the DMK",
    "Crayons_Advertising_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Western_Carriers_(India)_Limited_DRHP",
    "Valiant_Laboratories_Limited_DRHP",
    "Moneycontrol Selects: Top stories this evening",
    "Explainer: How SEBI’s norms on execution-only platforms will impact investors",
    "More AMCs make a beeline for Multi Asset Allocation Funds",
    "Mutual funds may not get holdings waiver post HDFC Bank - HDFC merger: Report",
    "Inflation down: But does that mean rates will be cut soon?",
    "SEBI issues regulations for execution-only platforms for direct mutual fund schemes",
    "Why have MFs fallen in love with Mankind Pharma just a month since its listing?",
    "How LIC Mutual Fund's chief executive plans to turn the tortoise into a hare",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Cautious of market highs, these large-caps exit MF portfolio",
    "Has the time come for credit risk funds again? Yes, says R Sivakumar of Axis MF",
    "Mutual funds lose Rs 342 cr in just two sessions as bears plunder IEX shares",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "Noida Authority likely to auction 3 commercial plots in Sector 50 by June-end",
    "MC Explains: How does Metro connectivity impact real estate prices in mature markets?",
    "Godrej Properties acquires prime land parcel in Kolkata's New Alipore for luxury housing project",
    "Gurugram administration may pick 15 critical condominiums for structural audit next week",
    "Greater Noida Authority puts 13 data centre plots on sale; scheme closes on July 4",
    "Karnataka RERA asks developer to refund amount paid by buyer for unregistered Bengaluru project",
    "Gold down third day ahead of FOMC; track latest prices",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | How do you trade KEI Industries, Tanla Platforms, APL Apollo Tubes today?",
    "Tata Consumer Products sees strong break out, analysts expect it above Rs 1,000",
    "NIPPON INDIA EQUITY HYBRID FUN",
    "Only Buyers in NIEHF on BSE",
    "Only Buyers in Blue Coast on NSE",
    "SPML Infra Consolidated March 2023 Net Sales at Rs 463.50 crore, up 91.74% Y-o-Y",
    "Only Buyers in Shalimar Wires on BSE",
    "Only Buyers in Ganga Forging on NSE",
    "Only Buyers in Guj Toolroom on BSE",
    "Only Sellers in Hawa Engineers on BSE",
    "Set SMS alerts for market news",
    "The Green Pivot: Will India’s green energy dreams face a severe capital crunch?",
    "AI: Digital zombies may already be in your home",
    "Rate Hikes: US Federal Reserve may be nowhere near done yet",
    "Agri Picks Report June 15, 2023: Geojit",
    "Oil prices tick up as markets look to key Chinese economic data",
    "IND Renewable Energy Ltd jumps 5% on board nod to fund-raising plan",
    "Aurionpro Solutions locked in upper circuit as Sumeet Nagar picks up stake",
    "Bharat Dynamics rises 4% on hopes of strong order inflow from FY25",
    "Yulu eyes expansion as it closes in on profitability",
    "Indifi Technologies raises $35 million in Series E round led by ICICI Venture",
    "See More Top Companies in India",
    "Fed throws a surprise, Axis Bank block deal & more | Market Minutes",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Wall Street at new 2023 high, India inflation cools & AMC stocks in focus | Market Minutes",
    "Block deal in Go Fashion, key Nifty levels to watch out for & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]