[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18593.85\n\n+59.75 (+0.32%)",
    "Sensex\n\n62787.47\n\n+240.36 (+0.38%)",
    "IKIO Lighting raises Rs 181.95 crore via anchor book ahead of IPO",
    "From Goldman to JPMorgan, deals have dried up",
    "UBS says it could complete Credit Suisse takeover on June 12",
    "‘Machli’ or ‘murgi’? Finfluencers devise innovative ways to get around Sebi glare",
    "Wipro buyback record date on June 16: What should investors do?",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "Owner of 2 Houses Turns Tenant To Seek Work-life Balance | The Tenant",
    "Watch For This While Buying Property, So That Selling It Later Is Easy | Real Estate",
    "Apple WWDC 2023: What To Expect At Apple’s Big Event?",
    "How Thums Up won the Indian cola race against Coca-Cola and Pepsi",
    "ITC Vs HUL: How Do The FMCG Majors Fare Post Their Q4 Numbers?",
    "Inside A Trip To Switzerland, Where Style Meets Sustainability! | World Environment Day",
    "SEC sues Binance and CEO Zhao for breaking rules",
    "Godrej Consumer appoints Aasif Malbari as CEO",
    "Brightcom clarifies on Moneycontrol article, takes remedial measures",
    "TCS bags 10-year contract to administer UK-based Teachers’ Pension Scheme",
    "Apple WWDC 2023 Live Updates: What's new for AirPods",
    "You can escape 20% TCS if you book your holidays with foreign tour operators",
    "ED carries out search ops at 7 locations of IREO Group, M3M Group",
    "Barclays Head of Technology I-Banking Praveer Garg headed to Jefferies",
    "Govt gets Rs 4,185.31 crore from Coal India stake sale",
    "Monsoon misses onset date in Kerala but IMD sees conditions turning favourable",
    "Honda Elevate to debut tomorrow: 5 things you should know about the Honda’s first midsized SUV",
    "Microsoft 365 down for thousands of users; Word, Excel affected",
    "HDFC Bank officer abuses employees in online meeting, suspended after video is viral",
    "WWDC 2023 effect: Apple shares hit all-time high",
    "Odisha train crash highlights: 12 parties demand Rail Minister's resignation, reject CBI probe",
    "Reliance Foundation unveils 10-point relief plan to help Odisha train accident victims",
    "Virat Kohli joins HSBC India's campaign: 'My system of discipline resonates with its legacy'",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Tanmay Bhat's YouTube channel with 4.4 million subscribers hacked, renamed to...",
    "These sectors are looking for freshers, offering higher salary packages",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with technical analysis, research advice, and insights",
    "'King Kohli': Bengaluru police track down culprits who murdered 82-year-old woman",
    "Bengaluru-Chennai train journey may soon be reduced to 2 hours",
    "Closing Bell: Nifty ends at 18,600, Sensex gains 241 pts led by power, auto, capital goods",
    "India presses Germany to send back Baby Ariha as soon as possible",
    "'Indian daughter of Korean parents': Influencer visiting Taj Mahal with parents wins hearts",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "In Pics: All about lithium and its use in batteries",
    "Nvidia's stunning $184 billion surge; Five charts tell the story",
    "As bull run on D-Street continues, here are top 10 ideas for next 3-4 weeks",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Maruti Suzuki Jimny and 5 more cars making their way to market this June",
    "In pics | Thousands march in Poland anti-govt protests to show support for democracy",
    "Video: This swanky Bengaluru auto has tray tables, cushions and posters of...",
    "Barkha Dutt's 'The Mojo Story' YouTube account loses all content after hacking: 'Heartbroken'",
    "How a trans actor’s Bud Light campaign plunged an Indian-origin CEO’s marketing firm into crisis",
    "Shark Tank India season 3 promo is out. Here's how you can register",
    "Chinese woman travels to work wearing IV drip, internet reacts to viral video",
    "Advance / Decline (NSE) \n\n1218874",
    "Bhai usko bechney ka time aa chuka tha 150 odd pe and abhi bhi woh che...",
    "Nationalum....u first sold in losses and now asking others if it was r...",
    "It is bull market, now focus shifting to value stock like holding comp...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, headwinds averted",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Hesitation has been a feature of this trend and the momentum continues to blow in this manner.",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Tesla's China-made EV sales rose 2.4% in May from April: CPCA",
    "Foxconn's May sales drop 9.5% YoY on smartphone weakness",
    "Richard Teng frontrunner to steer Binance should CEO Zhao quit",
    "Lohum partners MG Motor India for second-life EV battery solutions",
    "Tata Power Renewable Energy commissions 110 MW solar project at Bikaner, Rajasthan",
    "Ahead of MPC meet, IIM survey shows firms' inflation expectations edged down to 4.31% in April",
    "India can reduce pollution by 40% by not using fossil fuels: Nitin Gadkari",
    "Tea production rises in 2022, growers express concern over present challenges",
    "Nepal and India should hold talks to resolve border issue: PM Prachanda",
    "Rajasthan: Time is running out for the Congress high command to resolve the Gehlot-Pilot rift",
    "Why were grave red flags ignored: Mallikarjun Kharge to PM Modi on Odisha rail tragedy",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "UTI Nifty 50 Equal Weight Index Fund NFO: Should you invest?",
    "Do equity savings funds make sense after the tax hit on debt mutual funds?",
    "Planning to look at MF stock picks last month and play copy cat? Here’s why you shouldn’t",
    "HDFC Mutual Fund sends notice to investors about change of sponsor. What should you do?",
    "Your first salary should be where your investment journey begins",
    "Can arbitrage funds sustain the momentum?",
    "B30 AUM in mutual funds grew higher than T30’s",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Future Generali India launches health insurance policy with multiple optional covers",
    "ULIP debt funds back in focus after debt mutual funds taxation. Here’s the top performing funds",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "How a 10-year bond crashed and burnt out in just 8 months",
    "MFs – The losers and the gainers in the new regime",
    "NFO review: Edelweiss MF’s new multi-asset fund is debt-focussed with indexation taxation benefit",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "ED carries out search operations on seven locations of IREO Group and M3M Group in Delhi, Gurugram",
    "MHADA’s Mumbai Lottery: More than 23,000 applications received so far, sale of one flat dropped",
    "CREDAI developers undertake 55 green projects spread across 32 million sq ft",
    "Yamuna Expressway Authority mulls plot relocation policy to avoid possession delay",
    "Developer cannot escape liabilities of project completion after promoters change: NCDRC",
    "World Environment Day: Real estate developer Gaurs Group sets up 15 MW solar power plant",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Paradeep Phosphate: Benefits of backward integration to kick in",
    "Hot Stocks | Bet on Apollo Hospitals Enterprises, HUDCO for short term",
    "Nifty rally may pause at 18,900-19,000, but these 3 stocks will drive home up to 18%",
    "Weekly Tactical Pick – Why this cement stock deserves attention",
    "MC Interview | Market may take some more time to hit fresh record highs: Milan Vaishnav",
    "Prajay Engineers Syndicate",
    "Prajay Engineer closes below 150-Day,200-Day Moving Average today.",
    "Educomp Sol closes below 30-Day Moving Average of 1.64 today.",
    "Swan Energy closes below 200-Day Moving Average of 247.90 today.",
    "Poddar Housing and Development",
    "Poddar Housing  closes below 30-Day,50-Day Moving Average today.",
    "Manomay Tex Ind closes below 30-Day Moving Average of 138.52 today.",
    "Yaari Digital Integrated Services",
    "Yaari Digital closes below 30-Day,50-Day Moving Average today.",
    "B&B Triplewall  closes below 50-Day Moving Average of 228.21 today.",
    "Set SMS alerts for market news",
    "Saudi Arabia's solo oil production cut is a risky strategy",
    "Taking Stock: Nifty ends near 18,600; Sensex gains 241 points; auto, capital goods shine",
    "Suzlon surpasses 20 GW Wind Energy Installations, stock ends 4.5% higher",
    "Buy Kfin Technologies; fair value at Rs 400: Kotak Institutional Equities",
    "Gainers & Losers: 10 stocks that moved the most on June 5",
    "Commodities Live: Crude Hit $79 As Saudi Arabi Pledges Additional Cuts; OPEC Outlook Explained",
    "Agri Picks Report June 05, 2023: Geojit",
    "Base metals may get some support from additional Chinese realty initiatives",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Saudi Arabia to cut oil output, RBI rate decision & the week ahead | Market Minutes",
    "The Giving Economy | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]