[
    "SBI INE062A01020, SBIN, 500112",
    "ITC INE154A01025, ITC, 500875",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18154.70\n\n+24.75 (+0.14%)",
    "Sensex\n\n61566.05\n\n+134.31 (+0.22%)",
    "Jaguar owner Tata leans toward UK over Spain for battery plant",
    "Planning a trip abroad? This new rule could play spoilsport",
    "Land transactions at all-time high, but clear titles remain a challenge",
    "IndiGo slips in red despite strong Q4, upbeat brokerage views",
    "Market LIVE Updates: Indices turn positive, Nifty around 18,150; Tata Motors top gainer",
    "Tesla eyeing India for a new gigafactory? | Tesla’s global expansion plans",
    "Amazon's Big Bet On India | AWS To Invest $12.7 Billion By 2030 | CEO Adam Selipsky Interview",
    "Will Artificial Intelligence really take your job? Level up with these skills to beat ChatGPT, AI",
    "SBI beats estimates with 83% profit jump; what brokerages are saying",
    "Blackstone-backed Nexus Select Trust lists at 3% premium",
    "HDFC Defence Fund NFO: Here are the hot defence stocks to watch out for",
    "Gland Pharma plunges to 52-week low as Q4 net profit slumps 72.5%, revenue drops 29%",
    "Why ONDC's retail orders fell by 50% last weekend",
    "RBI dividends to government may double, aiding fiscal gap",
    "Mumbai developers seek relaxation on charges for over 100 delayed projects",
    "Sebi proposes uniform total expense ratio for mutual funds",
    "Six ways to protect your job in the current storm of layoffs",
    "Sundar Pichai's childhood home in Chennai sold: 'Father broke down'",
    "Against regulations, AIF-I and AIF-II funds may be borrowing largely for investing: Sebi paper",
    "Market regulator Sebi proposes four key revamps: Top takeaways",
    "SBI posts record Q4 net profit: Key highlights from the earnings",
    "Ban on Krafton's game BGMI lifts in India",
    "Brookfield India REIT, GIC to acquire commercial property for $1.4 bn",
    "IndiGo aims to grow north of mid-teens this FY, says CEO Pieter Elbers",
    "Business class passenger on Air India flight turns violent, wife hides in economy class",
    "Byju’s Alpha accused of hiding $500 million from lenders",
    "Nazara's Nodwin Gaming raises $28 mn for global expansion, IP development",
    "KTM 390 Adventure spoke wheels with fully adjustable suspension; All you need to know",
    "Newsletter with commodity research advice and market analysis",
    "When an air hostess did not recognise Infosys founder Narayana Murthy on flight",
    "'15-minute phone call': Indian Amazon employee laid off in US",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "Karnataka to revise property guidance value, a hike between 10-30% likely: Sources",
    "Tyre-makers under pressure as too much rubber hits the road",
    "Google reveals its first foldable phone Pixel Fold",
    "Stock Market Today: Top 10 things to know before the market opens",
    "Google, Meta, Amazon hiring low-paid H1B workers after US layoffs: report",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Japan G7 Summit: World leaders visit Hiroshima memorial in shadow of new threats",
    "In Pics: Kohli's sublime century powers Bangalore to crucial win in Indian Premier League 2023",
    "Cannes 2023: Aishwarya Rai Bachchan turns heads in oversized silver hood",
    "Virat Kohli and 18: A connection beyond just a jersey number",
    "Woman sues boss after misinterpreting ‘xx’ in emails as kisses",
    "Advance / Decline (NSE) \n\n8461130",
    "Every segment cals available with super accuracy just texxct now on vh...",
    "Only one rs stoploss how is it possible",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Walmart's grocery business success is breeding too many copycats",
    "Elon Musk’s lawyer sends letter to Microsoft on Twitter data misuse",
    "Top cryptocurrency prices on May 19: Major crypto in red, Bitcoin over Rs 23 lakh",
    "How to demystify the market prophets",
    "China’s shaky recovery and how it impacts Indian investors",
    "With inflation being reined in, a recovery in the markets is expected in the second half of FY24",
    "Army set to manoeuvre a process of generational change in Pakistan politics",
    "MC Explains: How was Kiren Rijiju’s stint as the law minister?",
    "Netweb_Technologies_India_Limited_Corrigendum_to_DRHP",
    "Jupiter_Life_Line_Hospitals_Limited_DRHP",
    "JSW_Infrastructure_Limited_DRHP",
    "A surgical strike: HDFC MF launches defence-themed fund. Should you invest?",
    "Large, mid or smallcap? Find out which fund suits you the best",
    "Does the large size of SBI Small Cap Fund bother its fund manager, R Srinivasan?",
    "Can inflows into gold ETFs sustain?",
    "SIPs and bank FDs attract investors amid volatility and new tax rules",
    "Are your equity funds investing in the same stocks?",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Chart of the Day: Term premium has shrunk, a sign of many things",
    "Despite correction, these mid- & small-cap technology stocks got picked by mutual funds",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Mumbai developers seek relaxation on govt charges for over 100 delayed projects approved in 2021",
    "Brookfield India REIT, GIC to acquire commercial property for $1.4 billion",
    "Chintels Paradiso: Residents of towers E, F seek time until July 31 to vacate flats",
    "Developers acquire 2,181 acres in 17 months, to develop 209 mn sq ft: JLL report",
    "Mumbai-based Dosti Realty forays into Pune market, to construct over 1 million sq ft",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Zydus Lifesciences: Time to book profit, post strong rally over a year?",
    "Weekly Tactical Pick – Why this chemical stock warrants a look?",
    "Trade Spotlight | How to trade in KRBL, HEG, Poonawalla Fincorp today",
    "Trade Spotlight | Your game plan for CreditAccess Grameen, Cyient, Amara Raja Batteries today",
    "Daily Voice | Scope of early interest rate cut by RBI low: Azeem Ahmad of Waterfield Advisors",
    "Daily Voice | 'Financial services sector to drive double digit market growth'",
    "Daily Voice | This fund manager is bullish on SRF, SKF, PI Industries. Find out why",
    "Dollex Agrotech is moved by -1.07",
    "Olectra Greente is moved by 3.03",
    "Sovereign Gold Bonds 2.50% Sr. II FY 2022-23",
    "SGBAUG30 has hit an all time high of Rs 6,050.00 on BSE",
    "Only Buyers in KCD Industries on BSE",
    "Sri Adhikari Brothers Television",
    "Sri Adhikari is moved by -3.33",
    "Only Sellers in Sri Adhikari on NSE",
    "Set SMS alerts for market news",
    "This key health metric still evades gadget makers",
    "Agri Picks Report May 19, 2023: Geojit",
    "Ramco Cements climbs 5% after Q4 profit zooms 27%",
    "GR Infraprojects soars 9% on strong fourth-quarter earnings",
    "Tata Elxsi slips after Q4 revenue miss, margin drop",
    "Oil prices fall on strong US dollar, sticky inflation",
    "Commodities Live: Crude Prices Settle Up $2 | Optimism About US Debt Ceiling & Demand",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "Did SBI, ITC & Indigo Q4 numbers beat Street estimates? Market Minutes",
    "PVR-INOX: Time to check in? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "What are risk-o-meters & should investors monitor them constantly? Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]