[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Vedanta INE205A01025, VEDL, 500295",
    "Apple US0378331005, AAPL:US",
    "Adani Wilmar INE699H01024, AWL, 543458",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "How can retirees use MC30?",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "SEBI wants mutual funds to catch front running, insider trading frauds",
    "Five Sebi proposals may make mutual funds cheaper and more transparent",
    "Commissions to drop if SEBI’s proposal to cut MF expense ratio goes through, say distributors",
    "Sebi's proposal on TER to curb mis-selling, bring in transparency",
    "Sebi's proposed fee caps could slash AMC profits by Rs 1,400 crore",
    "A surgical strike: HDFC MF launches defence-themed fund. Should you invest?",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Chart of the Day: Term premium has shrunk, a sign of many things",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Rs 2,000 note withdrawal: Real estate experts see rise in land, secondary deals in cash",
    "REITs and InvITS must ensure dematerialisation of securities by June 30: Sebi",
    "Mumbai third on the list of top data centre markets in Asia-Pacific region: Report",
    "Tata Realty plans to develop 5 million sq ft office space in Bengaluru, to invest Rs 4,000 crore",
    "Titan Company purchases commercial space in Mumbai for Rs 100 crore",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "Commodities Live: Commodities eye the G7 meeting, Powell speech today",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Interview | 'Nifty likely hitting 19,000 by June, expect buying interest in these 4 stocks'",
    "Daily Voice | This fund manager is bullish on financials, capital goods, export manufacturers",
    "RBI unlikely to change policy stance in the next few meetings, says Weekend Investing founder",
    "NGL Fine Chem closes below 150-Day,200-Day Moving Average today.",
    "HLE Glascoat closes below 150-Day Moving Average of 608.49 today.",
    "Pudumjee Ind closes below 50-Day Moving Average of 22.28 today.",
    "Pondy Oxides closes below 30-Day Moving Average of 347.80 today.",
    "Signet Ind closes below 150-Day Moving Average of 38.07 today.",
    "Wealth First Portfolio Managers",
    "Wealth First Po closes below 50-Day Moving Average of 293.83 today.",
    "Mitcon Consultancy and Engineering Services",
    "Mitcon Cons closes below 200-Day Moving Average of 68.81 today.",
    "Set SMS alerts for market news",
    "Go First’s aircraft lessors caught in a legal tangle, sent back to NCLT",
    "China is jumping at digital shadows",
    "Meta’s $1.3 billion EU fine could get worse",
    "Failure of Banks and Financial Institutions: Regulators can only have a roadside view of risks",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "Oil futures steady as US default risk offsets supply decline",
    "Buy PI Industries; target of Rs 4300: Motilal Oswal",
    "Buy Container Corporation; target of Rs 710: Motilal Oswal",
    "Chart of the Day | Non-ferrous metals wilt, Dr Copper also under the weather",
    "Agri Picks Report May 22, 2023: Geojit",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "US debt-ceiling worry weighs on market, stock picking key in capital goods | Market Minutes",
    "PVR-INOX: Time to check in? Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "<path id=\"Path_11\" data-name=\"Path 11\" d=\"M279.393,295.618a8.428,8.428,0,0,1,8.427,8.345h-8.43"
]