[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Apple US0378331005, AAPL:US",
    "Yes Bank INE528G01035, YESBANK, 532648",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n19453.70\n\n+55.20 (+0.28%)",
    "Sensex\n\n65628.37\n\n+182.33 (+0.28%)",
    "Jefferies raises target price for Bajaj Finance after growth in loans",
    "Paytm gains post Q1 business update, GMV up 37%",
    "Can D-Mart regain its past glory?",
    "Bandhan Bank CFO Sunil Samdani resigns",
    "GIC to acquire 74% stake in Genus Power's smart metering venture",
    "Around 4 in 10 Nifty 500 names below all-time highs amid midcap, smallcap frenzy",
    "TCS to get 25,000 employees trained in Microsoft's Azure Open AI",
    "Senco Gold IPO final day | Issue subscribed 17 times, QIB portion booked 21 times",
    "India’s drone industry shaping up to be a disruptive force",
    "JioBharat launch: Can the 4G phone disrupt Indian data market?",
    "Sumitomo Chemicals India | This agrochemical player should reap long-term gains | Stock Of The Day",
    "Wimbledon 2023: How are the grass tennis courts at Wimbledon maintained?",
    "What are drone laws in India? | Explained",
    "Puravankara soars 13% on highest-ever Q1 sales",
    "Eicher Motors down third day in a row, investors lose Rs 11,300 crore",
    "DCB Bank jumps 8% after Tata AMC gets RBI nod to raise stake",
    "Stock Market LIVE Updates: Sensex up 180 pts, Nifty around 19,450; M&M, Power Grid top gainers",
    "ITR Filing: Handy tips for those filing returns for the first time",
    "Seafood industry stares at slump as global market for shrimp shrinks",
    "Jio takes the lead in 5G deployment, Vi struggles with funding issues",
    "Sumitomo Chemicals India: This agrochemical player should reap long-term gains",
    "First IIT outside India will be in Tanzania: MEA",
    "Mark Zuckerberg tweets after 11 years as Threads launches. It's obviously an Elon Musk jibe",
    "A Shanghai Contradiction Organisation – Let’s call it what it is",
    "Twitter rival Threads crosses 10 million users within hours of launch",
    "Moneycontrol Selects: Top stories this afternoon",
    "Which is the best day of the month to invest in an SIP?",
    "Samsung teases Galaxy Z Flip 5, Unpacked event on July 26",
    "Dhirubhai Ambani death anniversary: 8 inspiring quotes by the business magnate",
    "Canada Express Entry introduces category-based immigration for priority occupations",
    "Harley Davidson X 440 first ride review: A new breed of AI (American-Indian)",
    "Newsletter with technical analysis, research advice, and insights",
    "Titanic sub victims spent final moments in darkness, watching sea creatures pass by",
    "Man's past-present photos of food served on Vande Bharat Express are viral, IRCTC responds",
    "RBI issues draft circular on issuance of debit, credit and prepaid cards",
    "Stock Market LIVE Updates: Sensex up 180 pts, Nifty around 19,450; M&amp;M, Power Grid top gainers",
    "ITC at record after fifth day of gains amid hotel demerger buzz",
    "Union Cabinet clears personal data protection bill: Sources",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Suzlon shares soar, but headwinds could be building up",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "PM Modi to lay foundation stone for redevelopment of Gorakhpur railway station",
    "3 protesters arrested at Wimbledon for interrupting matches by throwing confetti",
    "Titanic sub spun uncontrollably with terrified crew inside during 2022 dive, reveals documentary",
    "Mandira Bedi on her experience at Mumbai airport: ‘landed in a nightmare’",
    "Advance / Decline (NSE) \n\n1278753",
    "If today cross 2450 then positive view for uc tomorrow",
    "Stay safe any update on call and put data for bn ?",
    "What is happening with acc? not moving ahead...ud83dude13",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Trends remained muted until the positive vibes in Bank Nifty started to surge ahead.",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty breaches the 19k mark, but euphoria missing",
    "Read Ambareesh Baliga full Report",
    "In Pics: 3 protesters arrested at Wimbledon for interrupting matches by throwing confetti",
    "Meta takes aim at Twitter with Threads app, millions join",
    "Venture capital funding plunges globally in first half despite AI frenzy",
    "Google accuses India antitrust body of protecting Amazon in Android probe",
    "Alkem Laboratories forays into ophthalmology segment",
    "JSW Steel posts 11% rise in crude steel production at 6.43 MT in April-June quarter",
    "Recession odds fall, a bit",
    "Central banks should stop hammering the economy into recession",
    "India's expects EU carbon tax to exports of steel, iron ore and cement",
    "PM Modi to address BJP workers in Varanasi on July 7",
    "Motisons_Jewellers_Limited_Addendum_to_DRHP",
    "Muthoot_Microfin_Limited_DRHP",
    "AKME_Fintrade_(India)_Limited_DRHP",
    "Edelweiss MF to merge ETF-Nifty Bank with Nifty Largemidcap 250 Index Fund; focus on index funds",
    "Bond market teaches you why even a single basis point matters a lot: A Balasubramanian",
    "Smart investing: When exactly should you invest in a Focused Fund scheme?",
    "Microcaps can be multibaggers, but it’s a ‘chakravyuh’. Here’s a plan",
    "MC Explains: How to get your capital gains statement for MF investments",
    "How HDFC and HDFC bank multiplied the wealth of MF investors",
    "Plum Insurance forays into business insurance space, targets startups and SMEs",
    "Critical illness standalone covers or riders: Which one to pick?",
    "Regulations on How Insurance Companies Should Value Each Bike Component After Depreciation",
    "Life and health insurance policies welcome LGBTQ community, but not all is rosy, just yet",
    "Maha government's flagship health insurance scheme to cover all: CM Shinde",
    "How to avoid disappointment when making an insurance claim | Simply Save",
    "Average health insurance claims in India Rs 42,000; 15% exceed Rs 1 lakh: Report",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "SBI Mutual Fund to accept investments in SBI International Access–US Equity FOF",
    "AMFI reclassification: Smallcap stocks that got upgraded to midcaps. Do you own them?",
    "Win for the unitholder is a win for the shareholder: Navneet Munot of HDFC MF",
    "Filing ITR for crypto gains? Here’s what you need to know | Simply Save",
    "Why should investors consider this mutual fund distributor despite regulatory headwinds?",
    "Mankind, TVS, IDBI becomes largecaps; Nykaa, JSW Energy, Page Industries down to midcap bracket",
    "ITR Filing: All you need to know about how to account for income from house property",
    "ITR filing for FY 2022-23: 28 days left, check these changes in income tax return forms",
    "ITR filing: Mind the disclosures while filing tax returns to keep taxman at bay",
    "Government defers higher TCS on spends abroad to Oct 1",
    "Embassy Group to launch 4 million sq ft of residential portfolio, eyes Rs 3,300 cr revenue",
    "Gurugram district administration to start structural safety audit of 23 condominiums from July 10",
    "Unsold housing inventory drops by over 21% in Delhi-NCR",
    "Gross absorption of office space touches 14.6 mn sq ft in Apr-Jun 2023: Colliers",
    "Incuspaze to triple its managed office space portfolio; eyes Rs 180 crore revenue by 2025",
    "Fall in demand for affordable homes pushes Mumbai sales down by 8%: Knight Frank report",
    "Gold slips as US dollar, yields rise after Fed minutes",
    "Gold rangebound in cautious trading ahead of Fed meet minutes",
    "Gold firms as traders hunker down for Fed cues",
    "Gold futures quiet, cues from Fed minutes awaited: Track latest prices",
    "Gold advances on weaker US economic cues",
    "Gold slips as stronger dollar, rate hike expectations dent appeal",
    "Betting on farm futures is not equivalent to gambling",
    "Gold stabilizes after strong US data drags bullion below $1,900/oz",
    "Is NPS the best retirement planning tool?",
    "Seeking higher EPS pension? You have till July 11 now to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Banks education loan increases 18.3% after demand returns as pandemic ebbs",
    "HDFC-HDFC Bank Merger: All you need to know about its impact on home loan customers",
    "Financial Stability Report: Write-offs improved asset quality",
    "Personal Finance: Prepaying your home loan early on can save you lakhs",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Visa says co-branding offers opportunities for new categories to emerge",
    "Government flip flop on TCS confounds credit card holders",
    "TCS of 20% on credit cards put on hold, forex cards get Rs 7-lakh exemption",
    "When should you upgrade your credit card?",
    "Free lounge visit, air miles is fine. But how do credit cards make money?",
    "Making UPI payments via RuPay credit cards: Is it worth it?",
    "Credit card bad debt doubles to 18% for state-run banks: RBI Financial Stability Report",
    "Kotak Mahindra Bank customers can now use RuPay credit cards on UPI",
    "Trade Spotlight | Your trading plan for Aegis Logistics, BHEL, Asahi India Glass today",
    "Trade Spotlight | How to trade in KEC International, Aster DM Healthcare, Bajaj Finance",
    "Hot Stocks | Ganesh Housing, J&amp;K Bank, Hero MotoCorp may deliver double-digit returns",
    "Cera Sanitaryware – Why the caution despite stupendous growth?",
    "Daily Voice | Mihir Vora of Max Life explains why this sector is a structural long term play",
    "MC Interview | Accumulate IT stocks, expect positive breakout soon, says Ashish Kyal",
    "Only Sellers in Sumeru Ind on BSE",
    "Vintage Coffee and Beverages",
    "Only Buyers in Vintage Coffee on BSE",
    "Only Buyers in Sturdy Ind on BSE",
    "Only Sellers in Raghuvansh Agro on BSE",
    "Only Buyers in Gokak Textiles on BSE",
    "Only Sellers in MSR India on BSE",
    "Only Sellers in Ortel Comm on BSE",
    "Set SMS alerts for market news",
    "Threads had big launch energy. Twitter is under pressure",
    "Equity analysts have only one way to get paid",
    "Sebi looking to mandate FPIs to use RFQ platform for 10% of secondary transactions",
    "Oil dips as China demand fears offset tighter supply outlook",
    "Agri Picks Report July 06, 2023: Geojit",
    "Prestige Estates Projects’ subsidiary signs agreement to develop IT parks, shares up by 2%",
    "Agri Picks Report July 05, 2023: Geojit",
    "Funding winter hurts! India unicorn employee addition falls to fifth",
    "A funding winter’s tale: Corporate governance failures hold many lessons for startups",
    "Funding to Indian startups tanked 79% in first half of 2023 as top investors sit out",
    "See More Top Companies in India",
    "JSW Steel to enter Sensex, FOMC minutes & stocks to watch | Market Minutes",
    "The New B2C: Business to Climate | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]