[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18726.40\n\n+127.40 (+0.69%)",
    "Sensex\n\n63142.96\n\n+350.08 (+0.56%)",
    "Lionel Messi to join Inter Miami after PSG exit: Report",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Rural market still not out of the woods. When will HUL hit Rs 3,000?",
    "New pension scheme with assured returns will have high premium cost: PFRDA",
    "Days of steady US pricing for pharma players to come in FY24, says JM Financial",
    "Big brokers uneasy after NSE's client monitoring directive",
    "How Meta’s global team derailed WhatsApp India's payment ambitions",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Cabinet approves Rs 89,047 crore third revival package for BSNL",
    "Apple Vision Pro Is A Computer On Your Face! Game-changing Rs 3 Lakh AR Headset Launched",
    "What's unique about the Mumbai Trans Harbour Link? Highway connects Navi Mumbai, Raigad",
    "IKIO Lighting IPO Fully Subscribed In First Five Hours: Should You Invest?",
    "Iran-Afghanistan ties: A deep dive into Helmand river water sharing dispute",
    "RBI Policy Expectations: Will MPC hold rates again? All eyes on stance",
    "India's Defence Exports At A Record High, Make-In-India Push Pays Off",
    "Will FAME II Subsidy Cuts Affect The Growth Momentum Of Electric 2-Wheelers?",
    "LIC increases stake in Tech Mahindra to 8.88%",
    "Tumbling international prices worsen outlook for chemical stocks",
    "RBI adds 8 platforms in the alert list of unauthorised forex trading platforms",
    "Thyssenkrupp bids for $5.2 billion Indian submarine contract",
    "Women attrition races past men at TCS as work-from-home ends",
    "MC Interview | Shailendra Singh on Peak XV minus Sequoia",
    "Airfares have fallen up to 60% in the last few days, says Jyotiraditya Scindia",
    "Company puts off results announcement as CA disappears",
    "In today's ruthless corporate world, Sir Ivan Menezes stood out for channeling his inner Gandalf",
    "Bulk Deals | Ashish Kacholia sells half a percent stake in D-Link India",
    "FIFA made false claims about ''carbon-neutral'' World Cup in Qatar, Swiss regulator says",
    "Australia 327/3 at stumps on Day 1 against India in WTC final",
    "Political News Highlights: All Opposition parties to meet in Patna on June 23",
    "Over 1,000 applications but not 1 job offer: Tech engineer on life after Microsoft layoff",
    "Gujarat cardiologist who conducted over 16,000 heart surgeries dies of cardiac arrest",
    "Maruti Suzuki rolls out Jimny at a price tag of Rs 12.74 lakh",
    "Bengal’s 'setting theory' and the 2024 Lok Sabha elections",
    "Unleash the Power of Business Loans: Key Factors to Consider Before You Apply",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with technical analysis, research advice, and insights",
    "Bengaluru man shares WhatsApp conversation of scammer teaching him 'valuable' lesson",
    "Comic Tanmay Bhat's YouTube channel restored, hackers had renamed it to...",
    "Ankur Warikoo says he used supplements to lose 8 kg in 16 weeks, gets schooled by a doctor",
    "Closing Bell: Nifty ends above 18,700, Sensex gains 350 pts; all sectors in the green",
    "Indian-origin US Presidential candidate Nikki Haley calls India ‘one of biggest polluters'",
    "Upgrad's Ronnie Screwvala jabs Byju's over US lawsuit: 'Not even Netflix or HBO...'",
    "Finland hands Rs 1 crore speeding ticket to one of its richest men",
    "HDFC Bank officer abuses employees in online meeting, suspended after video goes viral",
    "Maruti Suzuki Jimny and 5 more cars making their way to market this June",
    "In Pics: Defence Minister Rajnath Singh holds talks with his US counterpart Lloyd Austin",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Smoke from Canadian wildfires sets off health alerts in New York, Ottawa",
    "Cyclone Biparjoy rapidly intensifies into severe cyclonic storm: See Pics",
    "Content writer says ChatGPT replaced him. Now, he repairs ACs to make ends meet",
    "Woman attacks strangers in New York park in unprovoked rampage. Video",
    "This 19-year-old model could be the queen of Italy",
    "Chaos, confusion grip Air India passengers stuck in Russia: 'Inadequate food, toilets'",
    "Advance / Decline (NSE) \n\n1371704",
    "The more the revival packages come for bsnl the lesser the chance of i...",
    "Change name of this company to parle gud83eudd23",
    "Buy for the target of rs 200/-.... in july end only.......",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, headwinds averted",
    "Read Ambareesh Baliga full Report",
    "Meta to introduce new accounts centre after talks",
    "OECD sees limited growth pick-up as rate hikes weigh",
    "HMSI rolls out industry's first warranty programme",
    "Ivan Menezes, Diageo's India-born CEO passes away at 64",
    "KPI Green Energy gets LoI for 40 MW hybrid project in Gujarat",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Will RBI change its monetary policy stance to neutral?",
    "Pakistan's economy to grow by 2% in the next fiscal year, says World Bank",
    "Centre trying to prevent truth behind Odisha train crash from coming out: Mamata",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Debt mutual funds 2.0: Life after removal of long-term indexation benefit",
    "Is this the time to invest in auto funds?",
    "Franklin Templeton equity funds go up when things are down. Here's why",
    "ICICI Pru Bluechip Fund completes 15 years. Does it still have its mojo?",
    "Bajaj Finance to bring down dependence on telemarketing calls: Sanjiv Bajaj",
    "Bajaj Finserv MF, India’s newest, to launch today",
    "UTI Nifty 50 Equal Weight Index Fund NFO: Should you invest?",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Indian issuers raised nearly $43 billion in green bonds from January 2014 to March 2023",
    "MF multibagger smallcap stocks: Returns of over 1,200% in 2 years, and more to come",
    "How a 10-year bond crashed and burnt out in just 8 months",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "High-speed metro between Noida and IGI airports may stop only at six stations",
    "Mumbai remains India's most expensive city for expats: Survey",
    "Yamuna Expressway Authority shelves its group housing scheme due to lack of bidders",
    "Rentals for ‘dollar homes’ hit the roof as demand from expats surges",
    "Can proptech help rent an apartment faster?",
    "Gold steady near $1950, as focus turns to US Fed's June 14 meeting",
    "Aditya Birla Group forays into branded jewellery retail with Rs 5,000-crore bet",
    "Gold rises as dollar sheds gains against peers",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel recommends penalties for banks if they lose your property documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Trade Spotlight | Here's how to trade in Mahindra CIE Automotive, Angel One, Ambuja Cements today",
    "UltraTech Cement top gainer in Nifty50, surpassing record high can bring more action in stock",
    "Hot Stocks | NELCO, Nuvoco Vistas, Orient Cement may fetch double-digit returns in short term",
    "MC Interview | Market may take some more time to hit fresh record highs: Milan Vaishnav",
    "GOCL Corp closes above 50-Day Moving Average of 313.77 today.",
    "Asian Granito closes above 50-Day Moving Average of 46.40 today.",
    "Vedant Fashions closes above 200-Day Moving Average of 1289.90 today.",
    "Nelcast closes above 30-Day Moving Average of 97.99 today.",
    "Kalpataru Projects International",
    "KPIL closes above  its 30-Day,50-Day,150-Day Moving Average today.",
    "Rallis India closes above 30-Day Moving Average of 189.67 today.",
    "Loyal Textiles closes above 30-Day Moving Average of 672.55 today.",
    "Set SMS alerts for market news",
    "Will the upcoming Telangana elections catalyse a BJP-TDP alliance?",
    "Here is one way to close the gender pay gap",
    "If Neoliberalism did not exist, we would have to invent it",
    "Taking Stock: Nifty above 18,700 ahead of RBI policy; investors get richer by Rs 2.48 lakh crore",
    "Agri Picks Report June 07, 2023: Geojit",
    "Gainers & Losers: 10 stocks that moved the most on June 7",
    "Man Infra hits 52-week high as subsidiary announces residential project in Mumbai",
    "COMMODITIES LIVE : Aluminium prices act firm as LME stocks fall to a four-month low",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "See More Top Companies in India",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "World Bank's dull economic outlook, Sensex December target & auto stocks | Market Minutes",
    "Saudi Arabia to cut oil output, RBI rate decision & the week ahead | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]