[
    "IEX INE022Q01020, IEX, 540750",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Hindustan Aeron INE066F01012, HAL, 541154",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18563.40\n\n-71.15 (-0.38%)",
    "Sensex\n\n62625.63\n\n-223.01 (-0.35%)",
    "Go First extends suspension of flight operations till June 14",
    "Russia to deploy tactical nuclear weapons in Belarus in July, says Putin",
    "Forex reserves jump $5.9 billion to $595 billion",
    "Billionaire Richard Branson puts himself on trial",
    "S&P 500’s tech-heavy top is a feature, not a bug",
    "Rs 5,551 cr FEMA violation: Top officials of Xiaomi India, 3 banks get ED notice",
    "What is market coupling and why does the govt want it?",
    "Concor strategic sale at ‘status quo’ as railways raises concerns: Official",
    "Govt plans fewer GDP estimates to avoid confusing markets",
    "How do Mumbai’s Youngsters Spend Their First Salary? | Ground Report | Expert Tips",
    "Ace investor Porinju Veliyath on outlook on equities, small cap space & his stock picks",
    "What's unique about the Mumbai Trans Harbour Link? Highway connects Navi Mumbai, Raigad",
    "PMEAC Member Shamika Ravi On How Freebies Wreck State Economies",
    "Avoid These 5 Mistakes To Safeguard Your ITR From Rejection",
    "New York Becomes World’s Most Polluted City Surpassing Delhi| How Canada Wildfires Impacting NYC",
    "TCS or Infosys, which stock should you bet on post-Q4 earnings?",
    "Go First CoC appoints Shailendra Ajmera as resolution professional: Report",
    "Why have China-focussed mutual funds hit a bump, again?",
    "Air India puts together 'huge financing deal' for new fleet: CEO",
    "FMCG companies set for decent growth, margin improvement: Sharekhan",
    "Sagging middle: Why some novels are losing the plot",
    "Who Killed Moosewala book review",
    "Under house arrest, fake heiress Anna 'Delvey' Sorokin launches podcast to rehab public image",
    "What you need to know about the Bonn Climate Change Conference",
    "WTC Final: Amid top order failure, Ajinkya Rahane gives India some chance with gritty knock",
    "Govt will regulate AI, other tech from perspective of harm it can inflict on users: MoS IT",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "Why fintechs are cheering RBI’s guideline allowing 5% default loss cover",
    "40-meter-high, 360-degree view garden pavilions at Bengaluru Airport's T2",
    "India can see China-like high-growth phase for a decade, says CEA Nageswaran",
    "CBI forms SIT to probe Manipur violence, takes over probe",
    "Why do some Bollywood stars prefer renting apartments in Mumbai rather than buying them?",
    "Ethnic violence a death knell for a weak economy like Manipur",
    "Ray Dalio: Looming US debt crisis is in a late-stage big cycle",
    "Forbes Global 2000 | JPMorgan top of the class; Chinese firms' tally shrinks",
    "McDonald's ad features love story brewing between customer and woman staff, faces backlash",
    "IEX Chairman SN Goel full interview: Read complete transcript here",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with technical analysis, research advice, and insights",
    "Man spends Rs 88 lakh to increase his height by 7 inches",
    "'Is Rs 40 lakh per annum good enough salary for a 23-year-old in India?' Responses break Twitter",
    "Who is Pratik Doshi, Nirmala Sitharaman's son-in-law and PM Modi aide?",
    "Indian-origin US presidential candidate Nikki Haley calls India ‘one of the biggest polluters'",
    "Nirmala Sitharaman's daughter gets married in Bengaluru. Watch",
    "Closing Bell: Nifty ends below 18,600, Sensex falls 223 pts; capital goods outshine",
    "A Class 7 boy was caught using ChatGPT for homework. One line gave it away",
    "Karnataka plans 5 satellite towns to ease development load on Bengaluru",
    "Narayana Murthy on how he was introduced to Telugu films while visiting his grandmother",
    "Here are 10 hot stocks to bet on as RBI keeps policy rates unchanged",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "BMW M2 coupe finally launched in India, starting at Rs 98 lakh: See Pics",
    "Donald Trump indicted on seven charges over classified documents case, here's all you need to know",
    "'It's eating his remains': Shark eats man on Egypt coast. Viral video",
    "How New York surpassed Delhi briefly as the most polluted city in the world",
    "Men stop train door from closing, Delhi Metro reacts. Watch",
    "This Rs 800 crore-company started off as a pushcart in Tamil Nadu",
    "Chinese girl, 13, spends family’s life savings of over Rs 52 lakh on mobile games",
    "Advance / Decline (NSE) \n\n9131154",
    "Nifty views posted by s.options.22.34.886838.me so many boarders here ...",
    "Adani is that bull who can q.options.22.34.886838.me only be beaten fo...",
    "Where are those boarders with so much confusing a.options.22.34.886838...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, headwinds averted",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "China, Its Economy Flagging, Prods Consumers to Save Less and Spend More",
    "A look at how smoke from Canada wildfires is turning US skies hazy",
    "Indoco Remedies gets EU-GMP certification for Himachal plant",
    "SBI to raise Rs 50,000 crore in FY24",
    "Aether Industries signs licensing agreement with Saudi Aramco Technologies",
    "Cash-strapped Pakistan allocates Rs 1.8 trillion for defence in budget 2023-24",
    "Six survival must-dos for startups",
    "Varsha Gaikwad becomes Mumbai Congress chief ahead of civic polls, first woman to hold post",
    "LIVE: PMEAC Member Shamika Ravi On How Freebies Wreck State Economies",
    "Valiant_Laboratories_Limited_DRHP",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "MFs can now participate in repos on Commercial Papers, Certificate of Deposits",
    "RBI MPC: Deposit and lending rates remain on a steady path; life goes on as usual, for now",
    "Reaching that crorepati milestone hinges on your commitment to investing",
    "Debt mutual funds 2.0: Life after removal of long-term indexation benefit",
    "Is this the time to invest in auto funds?",
    "Franklin Templeton equity funds go up when things are down. Here's why",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Equity mutual fund inflows halve to Rs 3,240 crore in May, SIP book hits record high",
    "ICICI Pru Bluechip Fund completes 15 years. Does it still have its mojo?",
    "Bajaj Finance to bring down dependence on telemarketing calls: Sanjiv Bajaj",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Hyderabad records 5,877 residential property registrations in May, up 31% MoM",
    "K Raheja Corp announces Rs 1,100 cr pre-launch sales for South Mumbai project",
    "Yamuna Expressway Authority launches data centre scheme, eyes Rs 220 crore revenue",
    "Tenders for India’s first pod taxi project along Yamuna Expressway to be floated next week",
    "MahaRERA extends deadline of 12 real estate projects; wait for homebuyers to get longer",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "Gold firms as dollar eases, focus on Fed cues",
    "Gold near two-month low on surprise rate hikes in Australia, Canada",
    "Gold steady near $1950, as focus turns to US Fed's June 14 meeting",
    "Aditya Birla Group forays into branded jewellery retail with Rs 5,000-crore bet",
    "Gold rises as dollar sheds gains against peers",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | How should you trade in JBM Auto, HEG, JSW Steel today",
    "Paytm scales 9-month high with big volumes, likely to march towards Rs 850",
    "Trade Spotlight | Your game plan for Glenmark Pharma, HPCL, Triveni Engineering today",
    "Daily Voice | High growth, low inflation puts India in a sweet spot, says Amit Jain of Ashika",
    "Trejhara Solutions Limited",
    "Trejhara closes below 30-Day Moving Average of 70.32 today.",
    "Khandwala Sec closes below 30-Day Moving Average of 34.65 today.",
    "Priti Internati closes below 30-Day,200-Day Moving Average today.",
    "Melstar Info closes below 150-Day Moving Average of 2.51 today.",
    "Astec Life closes below 30-Day,50-Day Moving Average today.",
    "Tamilnadu Telecommunications",
    "Tamil Telecom closes below 30-Day Moving Average of 6.32 today.",
    "Brooks Labs closes below 50-Day Moving Average of 63.84 today.",
    "Set SMS alerts for market news",
    "Billionaire Bernard Arnault has a MoonSwatch in his archives",
    "The Reading List: June 9, 2023",
    "Taking Stock: Nifty below 18,600, Sensex falls 223 points; PSU banks worst hit",
    "Silver at 4-week high ahead of US data; track India prices",
    "Sula Vineyards hits record high with 10% rally in 3rd straight session in green",
    "Gainers & Losers: 10 stocks that moved the most on June 9",
    "Paytm gains on RBI nod to First Loan Default Guarantee model, up third day in a row",
    "Premier Explosives takes off on order wins but profit booking pulls it down",
    "Agri Picks Report June 09, 2023: Geojit",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "See More Top Companies in India",
    "S&P 500's best close of 2023, FII stake sale in Kotak Mahindra Bank & more | Market Minutes",
    "RBI MPC decision, Tech Mahindra & utility stocks in focus | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]