[
    "Cyient DLM INE055S01018, CYIENTDLM, 543933",
    "Reliance INE002A01018, RELIANCE, 500325",
    "Apple US0378331005, AAPL:US",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n19439.40\n\n+83.50 (+0.43%)",
    "Sensex\n\n65617.84\n\n+273.67 (+0.42%)",
    "DGCA puts SpiceJet under enhanced surveillance; airline refutes",
    "Roposo partners with Shopify as it bets big on creator commerce",
    "Lupin receives EIR from USFDA for Pithampur unit-2 manufacturing facility",
    "India, Foxconn's worries over Vedanta's financials led to JV pullout: Report",
    "GST Council Meet: GoM decides to levy 28% GST on online gaming, horse racing, casinos",
    "'Will wipe out the entire industry', say online gaming cos after GST set at 28%",
    "GST Council Meet 2023: Tax incidence on MUVs to increase with 22% cess",
    "Stock Markets At All-Time High: How To Navigate Mid-Caps | Sunil Singhania",
    "Which Is The Right Income Tax Form For Salaried Professionals, ITR 1 or 2?",
    "Exter: Hyundai’s Entry-Level SUV In India Has Some Segment-First Features!",
    "Parineeti Chopra invests in Clensta, the eco-friendly personal care brand",
    "Aptus Value Offers High Earnings Growth Potential, Good Bet In Housing Finance | Stock of The Day",
    "What will ISRO's Chandrayaan-3 do on the south pole of the moon? | Launch on 14th July",
    "TCS Q1 Preview: Muted revenue growth expected amid wage hikes, macro-headwinds",
    "We target 1 million CBDC transactions a day by year-end: RBI Deputy Governor Rabi Sankar",
    "Trade setup for Wednesday: Top 15 things to know before the opening bell",
    "Utkarsh Small Finance Bank raises Rs 222.75 crore via anchor book ahead of IPO",
    "Gautam Adani weighs bid for Anil Ambani’s insolvent coal plants",
    "Remain committed to Make in India, will apply for incentives under semiconductor policy: Foxconn",
    "Happiest Minds launches QIP, floor price set at Rs 972.16 per share",
    "A look at Maruti Suzuki Invicto",
    "Made multiple wills? Don’t make the mistake that Aretha Franklin did",
    "Microsoft-Activision: US judge declines to block the deal",
    "Prestige Group purchases 2.3 acre land parcel in Mumbai for Rs 704 crore",
    "'Failed JEE, couldn’t get into IIT': Walmart techie who cracked interviews with over 13 companies",
    "Tempted to take some money off the table now: Mirae Asset's Rahul Chadha",
    "SC annuls extension of ED chief's tenure, current director should vacate by July 31",
    "Double murder shocks tech capital: CEO, MD of Bengaluru pvt firm killed by ex-colleague",
    "ITC raised chief Sanjiv Puri's salary by 29.5% to Rs 16.31 crore in FY23",
    "What can investors expect from banks’ Q1 earnings?",
    "Hyundai Exter launched in India: Variants Explained",
    "Newsletter with commodity research advice and market analysis",
    "Closing Bell: Sensex up 274 points, Nifty around 19,450; mid, smallcaps shine",
    "What the collapse of the Dutch government means for India",
    "Why I agreed to pay Rs 15,000 extra rent in 6 months: Samsung techie in Bengaluru explains",
    "Nifty poised for muted open, PSU banks soar | Competition blues for Eicher | LTIMindtree in focus",
    "Finmin asks IBA to finalise wage revision of bankers of PSU banks by December 1",
    "TCS delays onboarding of lateral recruits by up to three months",
    "'Connaught River, Jheelon ka shehar' Delhi videos are viral as rain batters capital",
    "'Education for sale': Institute offers MBBS, MD seats to low scorers for Rs 65 lakh-Rs 1 crore",
    "Flight diverted after business class passenger throws tantrum over meal choice",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Gainers & Losers: 10 stocks that moved the most on July 11",
    "News18 Mega UCC Poll: 76.5% of Muslim women surveyed disagree with polygamy",
    "Ashneer Grover says 28% GST 'murdered' online gaming. '$10 billion down the drain'",
    "Man's London Airbnb turns out to be a bed inside a bathroom. Viral pic has 13 million views",
    "3 police cars sent to investigate reports of screaming woman. Instead, cops find…",
    "Advance / Decline (NSE) \n\n1205852",
    "Chola is zero debt company and will become next to bajaj finance.",
    "People calling this stock as junk....many got it free after demeeger. ...",
    "Bhai taxes r bad but actually its blessing in disguise as government o...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets turn cautious on global cues",
    "Read Ambareesh Baliga full Report",
    "NATO says it will invite Ukraine to join when ‘conditions are met’",
    "North Korea ramps up rhetoric ahead of US nuclear submarine visit",
    "Joe Biden has quick-trigger temper in private, yells at White House aides: Report",
    "The corporate bankruptcy wave will get even uglier",
    "Focussed on scaling up FMCG business: ITC",
    "Exclusive: LIC, pension funds keen on investing in longer-term govt Green Bonds",
    "Atishi concerned over including GST IT network in money laundering act",
    "Moneycontrol Pro Panorama | Pharmaceutical earnings are in recovery mode",
    "Live: Finance Minister Nirmala Sitharaman Speaks After 50th GST Council Meeting",
    "Strict action against those who overcharge for daily essentials: Kerala govt",
    "TMC dominates Bengal rural polls by bagging over 12,518 seats, maintains strong lead",
    "Aeroflex_Industries_Limited_Addendum_to_DRHP",
    "National_Securities_Depository_Limited_DRHP",
    "ESAF_Small_Finance_Bank_Limited_DRHP",
    "Acceleratebs_India_Limited_DRHP",
    "Kotak Quant Fund NFO: Only for select investors",
    "Samco MF garners Rs 409 crore via Active Momentum Fund NFO, restricts fresh investments",
    "Gilt funds have just turned more attractive. What should you do?",
    "Equity inflows more than double to Rs 8,637 crore, smallcap fund flows at all-time high",
    "Final approval for mutual fund expected in 4-8 weeks: Zerodha CEO Nithin Kamath",
    "Union MF expects 50% growth in AUM, to reach Rs 15,000 cr mark by March",
    "SEBI issues framework for PE funds as sponsors and self-sponsored AMCs",
    "SEBI puts onus on trustees to ensure fairness of fees, expenses charged by fund houses",
    "Single premium term plans – Should you opt for them?",
    "Majority of insurance-buyers find products & processes to be complex: Policybazaar study",
    "Plum Insurance forays into business insurance space, targets startups and SMEs",
    "Critical illness standalone covers or riders: Which one to pick?",
    "Regulations on How Insurance Companies Should Value Each Bike Component After Depreciation",
    "Life and health insurance policies welcome LGBTQ community, but not all is rosy, just yet",
    "Maha government's flagship health insurance scheme to cover all: CM Shinde",
    "Bond market teaches you why even a single basis point matters a lot: A Balasubramanian",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "13 midcap stocks that are most shunned by active mutual fund managers",
    "Excise duty hike in K'taka would lead to dowtrading, may impact sales, say liquor makers",
    "Tax proposals should be planned and implemented like test cricket",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Know which is a better tax saving option",
    "ITR Filing: Handy tips for those filing returns for the first time",
    "Filing ITR for crypto gains? Here’s what you need to know | Simply Save",
    "ITR Filing: All you need to know about how to account for income from house property",
    "Proposed Rithala-Narela metro corridor may be extended up to Kundli in Haryana: DMRC",
    "DDA Housing Scheme: Dwarka flats sold out, heavy demand for Narela and Rohini",
    "Housing prices have increased by 6 percent in major cities: Report",
    "MHADA lottery 2023: Deadline to apply for 4,000 homes in Mumbai ends today",
    "Increased guidance value will dent affordability in Bengaluru",
    "Greater Noida-New Delhi metro project submitted to YEIDA, UP government for approval",
    "Delhi court sends Supertech chairman RK Arora to judicial custody till July 24",
    "Gold near 3-week high on dollar dip, eyes on US inflation data",
    "Gold awaits fresh cues as focus turns to US inflation print",
    "Gold heads for fourth weekly loss on prospects of more rate hikes",
    "Gold slips as strong US data fuels Fed rate-hike bets",
    "Gold slips as US dollar, yields rise after Fed minutes",
    "Gold rangebound in cautious trading ahead of Fed meet minutes",
    "Gold firms as traders hunker down for Fed cues",
    "Gold futures quiet, cues from Fed minutes awaited: Track latest prices",
    "Is NPS the best retirement planning tool?",
    "Seeking higher EPS pension? You have only five more days to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Banks education loan increases 18.3% after demand returns as pandemic ebbs",
    "HDFC-HDFC Bank Merger: All you need to know about its impact on home loan customers",
    "Financial Stability Report: Write-offs improved asset quality",
    "Personal Finance: Prepaying your home loan early on can save you lakhs",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "RBI‘s circular on issuance of cards a win for customers, say experts",
    "Visa says co-branding offers opportunities for new categories to emerge",
    "Government flip flop on TCS confounds credit card holders",
    "TCS of 20% on credit cards put on hold, forex cards get Rs 7-lakh exemption",
    "When should you upgrade your credit card?",
    "Free lounge visit, air miles is fine. But how do credit cards make money?",
    "Making UPI payments via RuPay credit cards: Is it worth it?",
    "Trade Spotlight | Your strategy for Reliance Industries, Mazagon Dock Shipbuilders, Ceat today",
    "Hot Stocks | Orient Cement, Suprajit Engineering, Mahindra Holidays may deliver 10-14% returns",
    "Top 10 trading ideas for 3-4 weeks as bull run may continue for now",
    "Trade Spotlight | How should you trade in Sunteck Realty, Jamna Auto, Olectra Greentech?",
    "Hot Stocks | Here's why you should bet on Granules India, Orient Electric for short term",
    "Daily Voice | This portfolio manager says below-par Q1 for key sectors can derail the rally",
    "Daily Voice | Watch out for these 3 factors in Q1 earnings season",
    "Gravita India closes above 30-Day Moving Average of 608.14 today.",
    "Sanofi India closes above 30-Day Moving Average of 6924.17 today.",
    "Good Luck closes above 200-Day Moving Average of 447.56 today.",
    "Silver Touch Te closes above 30-Day Moving Average of 378.59 today.",
    "Excel Realty closes below 30-Day Moving Average of 0.39 today.",
    "Visesh Infotech closes below 30-Day,50-Day Moving Average today.",
    "Nippon India ETF Nifty 5 yr Benchmark GSec",
    "GILT5YBEES closes above 30-Day,50-Day Moving Average today.",
    "Set SMS alerts for market news",
    "Crypto's 'one-click endorphin loop' needs to end",
    "Telangana: Will caste make a comeback after a decade of statehood sentiment?",
    "Taking Stock: Sensex gains 270 points, Nifty ends near 19,450; autos, FMCG shine",
    "Agri Picks Report July 11, 2023: Geojit",
    "Elecon Engineering company shares soar 11% post Q1 results",
    "Buy Tata Motors; target of Rs 700: Motilal Oswal",
    "Gold steady as investors await US data for Fed rate-hike clues",
    "Oil ticks up on OPEC+ cuts; traders eye economic data",
    "Policy Next-MSME-Growth Series: Have Indian MSMEs demonstrated the ability to take risks- Part 6",
    "Policy Next - MSME-Growth Series: Have Indian MSMEs demonstrated the ability to take risks- Part 5",
    "See More Top Companies in India",
    "Direct tax collections, Vedanta, Q1 earnings season & more | Market Minutes",
    "CPI Inflation, US Inflation, Cyient DLM listing, IPO action & the week ahead | Market Minutes",
    "The New B2C: Business to Climate | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]