[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "IEX INE022Q01020, IEX, 540750",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18601.50\n\n0.00 (0.00%)",
    "Sensex\n\n62724.71\n\n+99.08 (+0.16%)",
    "AMD sets stage for next-gen Data Centre and AI Technology at upcoming livestream event",
    "Big US stocks surely can't outperform forever",
    "Berlusconi wrote the playbook for the modern strongman",
    "Sundar Pichai turns 51: From IIT Kharagpur to Google CEO",
    "Can Indigo continue to soar despite steady stake sale by Gangwal family?",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "Porinju Veliyath bets house on 3 stocks; feels they are undervalued even after a good run",
    "IIP growth rises to 4.2% in April",
    "‘Modi-Ji Thali’: US Restaurant Launches Special Thali Ahead Of PM’s US Visit",
    "Ulwe Better Than New York: This tenant moved the seas to live in Navi Mumbai",
    "2024 Lok Sabha Elections: Will the opposition unite with Congress to beat BJP?",
    "The face behind the fight for same-sex marriage | Pride 2023",
    "How do Mumbai’s Youngsters Spend Their First Salary? | Ground Report | Expert Tips",
    "What's unique about the Mumbai Trans Harbour Link? Highway connects Navi Mumbai, Raigad",
    "Buzzing Stocks: HFCL, Inox Wind, JSW Steel, Engineers India, Tejas Networks & others in the news",
    "Trade Spotlight | Your game plan for Linde India, Nazara Technologies, REC today",
    "Inflation numbers in line with expectations, but uncertainty still remains, say experts",
    "Sebi bars Subhash Chandra, Punit Goenka from holding directorial roles",
    "India may now proceed with oil exploration in Andamans",
    "Supreme Court sets aside stay on bike taxi ban in Delhi",
    "JLR aims £28 billion revenue in FY24, revenue per unit stands at £70,000",
    "Top 10 picks for next 3-4 weeks as market stays bullish despite rush for profits",
    "All the big stories to get you started for the day",
    "Sebi to auction Saradha Group's properties worth Rs 26 crore to recover investors' money",
    "Apple shares at record show big tech’s dominance",
    "Toyota to make solid-state batteries soon in EV push",
    "Intel is in talks to be an anchor investor in chip designer arm’s IPO",
    "Centre imposes stock limit on wheat for FY 2023-24",
    "JSW Steel emerges 'preferred bidder' of mining lease for iron ore in two Goa blocks",
    "Swiggy delivers food at 'Mannat' after Shah Rukh Khan's Twitter banter",
    "Delhi HC grants interim protection from arrest to M3M Group owners in money laundering case",
    "5 things about money that Edelweiss CEO Radhika Gupta wants her son to learn first",
    "EY GDS India renews its lease in Bengaluru",
    "Entrepreneur shares how goddess Lakshmi inspired JRD Tata to come up with Lakme",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "‘Dinner leke aagaye’: Swiggy delivers food at 'Mannat' after Shah Rukh Khan's Twitter banter",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "Japan restaurant chain seeks Rs 4 crore in damages from teen who licked soy sauce bottle",
    "This company removed all managers. Employees are now 20% more productive and happier",
    "Entrepreneur shares how goddess Lakshmi inspired JRD Tata to come up with 'Lakme'",
    "Whatsapp account hacked: Cybercriminals impersonate user to ask contacts for money",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "A Look At Life of Silvio Berlusconi, Late Italian Prime Minister, In Pictures",
    "Five Key Charts to Watch in Global Commodity Markets This Week",
    "Man arrested for assaulting Dutch YouTuber in busy Bengaluru market. Video is viral",
    "Advance / Decline (NSE) \n\n1225859",
    "Ex dividend on 20th june tuesday and boi has come down to a comfortabl...",
    "Buy infy 1291 sl 1279 tagret given 1320 above , terligriam- pujatradin...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Positive results for potential first chikungunya vaccine",
    "UBS picks Credit Suisse’s Mihir Doshi to head Combined India Business",
    "Deal activity plunges 87% to $4.6 billion in May",
    "Gainers & Losers: 10 stocks that moved the most on June 12",
    "CPI inflation drops to 4.25% in May, lowest in 25 months",
    "West Bengal election panel may extend rural poll nomination date by day",
    "Valiant_Laboratories_Limited_DRHP",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "Has the time come for credit risk funds again? Yes, says R Sivakumar of Axis MF",
    "HDFC Defence Fund to stop lumpsum investments and new STPs, restricts SIPs to Rs 10,000",
    "Fee caps to dent profits for MFs by 30% or more, predicts Jefferies study",
    "Franklin Templeton repays investors of two debt funds",
    "Why have China-focussed mutual funds hit a bump, again?",
    "MFs can now participate in repos on Commercial Papers, Certificate of Deposits",
    "RBI MPC: Deposit and lending rates remain on a steady path; life goes on as usual, for now",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Mutual funds lose Rs 342 cr in just two sessions as bears plunder IEX shares",
    "Equity mutual fund inflows halve to Rs 3,240 crore in May, SIP book hits record high",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "Sizzling rally in realty stocks seen extending on rates",
    "Warehousing leasing in Bengaluru touches 3.9 million sq ft in 2022: Sotheby's report",
    "Should the Indian real estate market be worried about an impending global meltdown?",
    "Shriram Properties to develop 5.4 msf of residential space in FY23-24",
    "Noida Authority launches group housing plots in sectors 43 and 44",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Colliers selects Ramaiy Kapoor as MD of data centre business",
    "Flat sizes shrinking in Mumbai Metropolitan Region and Chennai: Anarock report",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "Gold firms as dollar eases, focus on Fed cues",
    "Gold near two-month low on surprise rate hikes in Australia, Canada",
    "Gold steady near $1950, as focus turns to US Fed's June 14 meeting",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "V-Guard: A viable option for investors looking for reliability, growth",
    "Trade Spotlight | Your trading strategy for Paytm, Suzlon Energy, Manappuram Finance today",
    "Visagar Polytex closes below 30-Day,50-Day Moving Average today.",
    "Bhansali Engineering Polymers",
    "Bhansali Eng closes below 30-Day Moving Average of 136.35 today.",
    "Bkm industries closes below 50-Day Moving Average of 0.94 today.",
    "Hindusthan National Glass and Industries",
    "Hind Nat Glass closes below 150-Day Moving Average of 12.37 today.",
    "Sanco Ind closes below 50-Day Moving Average of 7.96 today.",
    "Ameya Precision closes below 50-Day Moving Average of 38.23 today.",
    "Khandwala Sec closes below 150-Day Moving Average of 32.34 today.",
    "Set SMS alerts for market news",
    "Exorbitant Air Fares: A case of flawed diagnosis blinding us to the solution",
    "Ending Colonial Overhang: Regulatory adjudication needs experts",
    "Market LIVE Updates: SGX indicates a positive start; US markets gain, Asia trade mixed",
    "Taking Stock: Sensex gains 99 points, Nifty at 18,600 led by IT, realty, oil & gas",
    "Agri Picks Report June 12, 2023: Geojit",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "See More Top Companies in India",
    "Block deal in Go Fashion, key Nifty levels to watch out for & more | Market Minutes",
    "RBI MPC decision, Tech Mahindra & utility stocks in focus | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]