[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18691.20\n\n+25.70 (+0.14%)",
    "Sensex\n\n62970.00\n\n-9.37 (-0.01%)",
    "I-T dept tweaks disclosure norms for charitable institutions",
    "IndiGo announces Nairobi as its 27th international destination",
    "Byju’s courts trouble with EPFO over delay in PF payments",
    "Rohit Jawa to take over as MD and CEO of HUL after Sanjiv Mehta retires today",
    "Asian Paints acquires additional stake in White Teak for Rs 54 crore; shares fall",
    "Platform to standardise health insurance claims coming soon: IRDAI chief",
    "IBM to acquire Apptio for $4.6 billion from Vista Equity Partners",
    "Airtel Business CEO Ajay Chitkara resigns, telco reshuffles top team",
    "Tech Mahindra CEO CP Gurnani pay halves in FY23 to Rs 32 crore",
    "Most Asked Personal Finance Questions On Internet That You Need An Answer To",
    "Mumbai To Nashik: The Tenant In A Long-Distance Marriage",
    "Wagner Boss Yevgeny Prigozhin: From selling hot-dogs, to Putin’s top general, to a powerful rebel",
    "Meet Ajit Doval, the undercover spy who became India’s NSA | James Bond Of India",
    "Mounting financial worries, layoffs, lawsuits and resignations, Byju's in the eye of the storm",
    "Prashant Khemka exclusive: Markets reached an all-time high, will the rally continue?",
    "India-US Sign Key Space Exploration Pact | Explained: How The Artemis Accords Will Benefit India",
    "Titanic Tourist Submarine: Why was it hard to rescue Titan submersible?",
    "Cyient DLM IPO opens tomorrow | 10 key things to know",
    "Higher ESOP payout affected margins in FY23; expenses to come down: Ideaforge",
    "Aditya Birla Capital launches QIP, floor price set at Rs 175.9 per share",
    "Exclusive | L&T Finance looks to sell its wholesale book to banks, NBFCs",
    "Can’t afford to take our eye off the ball: HUL Chairman on competition",
    "Tata Small Cap Fund to stop accepting lump sum investments from July 1",
    "Centre approves Rs 56,415 cr to 16 states so far in FY24 as interest-free loans",
    "Emerging tech of 2023: Flexible batteries, sustainable aviation fuel",
    "Suicides due to drug and alcohol addiction in India tripled since 2011",
    "107 real estate projects up for deregistration in Maharashtra",
    "Monsoon Live Updates: Char Dham Yatra halted due to bad weather in Uttarakhand",
    "Should VCs/PEs maintain silence when start-ups have governance issues or fail?",
    "Govt to launch self-defence program for 1,800 women in J&K's Kupwara",
    "1.9 million consumers will experience rise in electricity bills in Delhi",
    "PM Modi’s US Visit: These two deals are a sweetener for India",
    "Wrestlers move Delhi court seeking copy of charge sheet filed against Brij Bhushan Sharan Singh",
    "Flurry of bulk deals hits D-Street. Check how the stocks have fared…",
    "Pink WhatsApp scam: What is it and how to protect your phone from it",
    "Revolt raises searing question: Could Putin lose power?",
    "Tourists chase Tibetan wild ass in Ladakh, causes outrage on Twitter. Viral video",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "PM Modi's Egypt visit ends with a trip to the iconic Pyramids: See Pics",
    "When Mukesh Ambani and Anand Mahindra had to hail an Uber ride",
    "9 best botanical gardens in India and abroad",
    "Closing Bell: Sensex, Nifty end flat amid volatility; auto, pharma outperform",
    "Hero MotoCorp unleashes Xtreme 160R 4V: A power-packed thrill for motorcycle enthusiasts",
    "FM Sitharaman slams Obama, cites US 'bombing' of Muslim countries during his tenure",
    "Pak-origin teen took Rubik's Cube on Titanic sub to create world record near shipwreck",
    "In pics: At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "Modi refuses to let go of Putin despite Biden’s charm offensive",
    "Remember Inspector Vivek from 'CID'? He's now working in Bengaluru as a…",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Russian defence minister appears for first time since Wagner mutiny: See Pics",
    "LGBTQ+ Pride Month reaches its grand crescendo on city streets from New York to San Francisco",
    "Zerodha's Nithin Kamath highlights importance of having hobbies, sings 'Lag Ja Gale'. Watch",
    "Candy Crush trends, thanks to MS Dhoni's viral video on Indigo flight",
    "Man gets into IIM Ahmedabad after 9 unsuccessful attempts",
    "Rain water leaks into AC coach on Mumbai-Indore Avantika Express. Viral video",
    "Advance / Decline (NSE) \n\n1140936",
    "Adani is that bull who can q.options.22.34.886838.me only be  beaten f...",
    "Yea lagta hai duba dega pakka",
    "Market Outlook - Short Term",
    "Have an opinion on this news? post your comment here.",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets snap 4-week winning streak",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "In pics | Hajj pilgrimage starts in Saudi Arabia: All you need to know about it",
    "Recession risk, rate rises drive down private equity deal volumes to 4-year low",
    "TCS, Standard Life team up to enhance European policyholders' customer experience",
    "Lulu Group to invest Rs 10,000 crore in India over 3 years to complete ongoing projects",
    "2023 Global Competitiveness Index: India at 40, Ireland leaps to 2 & Singapore slides to 4",
    "US needs to bring in trade liberalisation as part of IPEF: Arvind Panagariya",
    "5 banks provide senior citizens FDs with interest rates of more than 9 per cent",
    "35 BRS leaders join Congress in presence of Mallikarjun Kharge, Rahul Gandhi",
    "Good work of people of Kerala marred by petty politics of LDF-UDF: J P Nadda",
    "Electricity usage above 200 units in Delhi to cost more, Atishi slams Centre",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Will credit risk debt funds make a comeback?",
    "Debt is his first choice: Rajiv Shastri’s journey from broker to CEO of a mutual fund",
    "MC Review: HDFC MF’s new consumption-themed fund comes with a twist. Will it work?",
    "Personal Finance: 3 handy tips to make your SIPs a success",
    "Sandeep Bagla: A fixed income market champion who is now building Trust MF brick by brick",
    "MFs’ deployment in up to 90-day CPs of NBFCs rises 21-month high in May: SEBI data",
    "Exclusive: New commission rules will benefit policyholders & insurance firms: IRDAI chief",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "LIC launches Dhan Vriddhi, a single premium guaranteed endowment policy",
    "MC explains: Why third-party motor insurance is critical for all vehicles on the road",
    "Beware of employer-assisted housing loans. It is the ultimate golden handcuffs",
    "Now, insurance cos can launch group Ulips, combi plans without prior IRDAI nod",
    "Moneycontrol Daily: Your Essential 7",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Mid-Small Cap outperformance to continue amid strong inflow: Jefferies",
    "DSP MF rolls out tech sector ETF after dismal year for IT stocks. Time to scoop up IT stocks?",
    "ITR filing: Know how to file income tax returns without Form 16 in simple steps",
    "ITR filing: Claiming tax deductions without proofs can backfire, warn CAs",
    "Noida Restaurant Service Charge Fight: What To Do If A Restaurant Levies Service Charge?",
    "Income Tax Return filing: Things to keep in mind while filing taxes",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "ITR filing: Know the difference between AIS and Form 26AS before filing your income tax return",
    "Using AI, Income-Tax department sends notices to tax evaders for fake donations",
    "HDFC Ltd sells Mumbai land to Lodha for Rs 70 crore to recover dues from borrower",
    "With offices opening up, majority of companies will have flex office portfolio by 2025: CBRE",
    "107 real estate projects up for deregistration in Maharashtra; MahaRERA invites objections",
    "MHADA lottery 2023: Deadline to apply for homes in Mumbai starting at Rs 24 lakh comes closer",
    "Here’s why luxury housing is gaining traction",
    "Navi Mumbai metro to start soon, boost property prices in micro-markets",
    "Gold Rate Today: Prices rebound on a weaker dollar",
    "Gold set for biggest weekly drop since Feb on hawkish Fed",
    "Gold set for worst week since early February: Check out latest prices",
    "Latest gold prices: Three-month tested as Jerome Powell's comments weigh",
    "Gold hovers near 3-month low on Powell comments",
    "Latest gold prices: At 3-month low on hawkish US Fed",
    "June 26 deadline for higher EPF pension may be extended by 15 days. Here’s what you need to know",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Forex cards or credit cards? Which one is better for foreign travel",
    "SBI Card dips after mixed growth data for May",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Ten best bets for next 3-4 weeks as bulls go slow on scaling new highs",
    "Trade Spotlight | How you should trade in DCM Shriram, ICICI Securities, Natco Pharma",
    "Hot Stocks | Bet on Dr Reddy's Laboratories, Dabur India for short term",
    "IndusInd Bank tops Nifty50 list, needs to exceed recent swing high for momentum",
    "Trade Spotlight | How should you deal in Aether Industries, BSE, JBM Auto today",
    "MC Interview | Prashant Shah of Definedge bullish on these 5 sectors for medium term",
    "Nifty can see profit booking in F&O expiry week before making positive attempts, says Ashish Kyal",
    "Daily Voice | Rajesh Kothari of AlfAccurate identifies 3 compelling investment themes for FY24",
    "Banswara Syntex closes below 30-Day Moving Average of 168.08 today.",
    "Websol Energy closes below 150-Day Moving Average of 88.42 today.",
    "Asian Granito closes below 50-Day,200-Day Moving Average today.",
    "Par Drugs closes below 30-Day Moving Average of 206.24 today.",
    "UFO Moviez closes below 30-Day Moving Average of 75.91 today.",
    "Atam Valves closes below 30-Day Moving Average of 230.71 today.",
    "Hathway Cable closes below 150-Day Moving Average of 15.20 today.",
    "Set SMS alerts for market news",
    "UBS-Credit Suisse won’t be the bloodiest of bank mergers",
    "Unilever's new CEO may need to get radical for a company turnaround",
    "Space Cooperation: Signing of the Artemis Accords is a force multiplier for India",
    "Taking Stock: Market ends flat amid volatility; auto, pharma, midcap indices up 1% each",
    "Gainers & Losers: 10 stocks that moved the most on June 26",
    "Buy Prudent Corporate Advisory Services; target of Rs 1048: ICICI Securities",
    "Commodities Live: Crude oil prices gain to above $74 | Central banks tighten monetary policies",
    "Agri Picks Report June 26, 2023: Geojit",
    "Called out by intern for not paying stipend, Soshals app founder’s justification",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "See More Top Companies in India",
    "FII optimism in India, IPO action & the week ahead | Market Minutes",
    "Global Chess League’s Gambit | Unusual Suspects",
    "Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Getting India Smart & Connected | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]