[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Apple US0378331005, AAPL:US",
    "Coal India INE522F01014, COALINDIA, 533278",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18567.60\n\n+33.20 (+0.18%)",
    "Sensex\n\n62711.90\n\n+89.66 (+0.14%)",
    "Nifty Realty top sectoral gainer; Sobha, Macrotech Developers jump up to 5%",
    "Bet on Borosil Renewables, PI Industries, LTIMindtree for short term",
    "Amarendu Prakash takes over as SAIL Chairman",
    "Greater Noida Authority asks to cancel plot allotments of 50 defaulters",
    "India's May manufacturing PMI rises to 31-month high",
    "Affable, execution-focussed, empathetic: Meet K Krithivasan, who takes charge of TCS today",
    "At 6.1%, India’s Q4 GDP faster than the biggest, but there are a few worry lines",
    "Market LIVE Updates: Nifty above 18,550, Sensex gains; Apollo Hospitals top gainer",
    "Q4 GDP Beats Estimates At 6.1%, India Continues To Be A Bright Spot",
    "Nvidia first US chipmaker valued at $1 trillion: CEO Huang talks about failures on his journey",
    "Should You Sell Your Mutual Funds Now? What All You Should Take Into Account Before Selling MFs?",
    "Watch: Right time to buy real estate stocks? Inventories down, prices up, shows Jefferies' report",
    "5 Things You Must Remember To Do If You're Switching Jobs: Watch!",
    "Zerodha's Nikhil Kamath is worried about 'Friendship Recession': Here is what it means",
    "GDP expands 6.1% in Q4: Read top brokerages views on the road ahead",
    "Abrdn exits HDFC Life but who bought the stake?",
    "China leads in fourth week of emerging market ETF outflows; India gets inflows",
    "Escorts Kubota's record tractor sales in May lift the stock up",
    "May Auto sales: Cars, 2-wheelers thrive; commercial vehicles face hurdles",
    "Commercial gas cylinder prices slashed. Check latest rates in Delhi, Mumbai, other cities",
    "India's Q4 GDP surprise, Coal India OFS & grey market sentiment check",
    "8 money changes to watch out for in June",
    "Short Call | Patanjali Foods, IRCTC, Apollo Hospitals, finfluencers beware",
    "Govt to offload 3% stake in Coal India via OFS at nearly 7% discount",
    "Laurus Labs shares higher on gene therapy bet",
    "How India transformed in less than a decade: Morgan Stanley shows in 10 points",
    "IKIO Lighting sets price band for Rs 600 crore IPO at Rs 270-285 per share",
    "First 100 units electricity per month free for all households in Rajasthan: CM Gehlot",
    "Amul celebrates World Milk Day with its signature doodle",
    "Elon Musk again world’s richest person as Bernard Arnault’s LVMH sinks",
    "Buzzing Stocks: Coal India, MOIL, Laurus Labs, Max Healthcare & others in focus today",
    "Adani to raise $3.5 bn from share sale in three group companies",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "MS Dhoni set to be admitted in hospital after winning IPL with CSK",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "Bengaluru: Gusty winds tear beams, panels off Rs 314-crore Visvesvaraya Terminal. Watch",
    "‘Indigo ki audacity’: Founder's rant after Rs 21,000-ticket to Ahmedabad",
    "MC Exclusive: PR Sundar, Mangaiyarkarasi Sundar found to have two DINs, in violation of law",
    "Mumbai Police bans public gatherings till June 11. Find out what’s allowed and what’s not allowed",
    "Zombie drug epidemic grips Philadelphia in US. Viral videos show debilitated users",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "15-year-old autistic boy denied boarding at Bengaluru airport",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Nvidia's stunning $184 billion surge; Five charts tell the story",
    "In Pics: All about lithium and its use in batteries",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Too heavy to fly? This airline has decided to weigh flyers before boarding flights",
    "Bus driver finishes lunch while waiting in Bengaluru traffic. Video has 2 million views",
    "Advance / Decline (NSE) \n\n1483528",
    "Niwas spinning standalone march 2023 net sales at rs 0.43 crore, up 27...",
    "Exi exit exit bhaag jao ud83dude22ud83dude22ud83dude0aud83dude0a",
    "Today or tomorrow, it will touch 270 again, its my view",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Asia stocks gain as Fed hike bets recede, debt vote eases nerves",
    "Japan tells US it wants closer cooperation to deal with North Korea",
    "NASA UFO panel in first public meeting says better data needed",
    "MG Motor India retail sales up 25% to 5,006 units in May",
    "Jaguar Land Rover recalling I-PACE vehicles in US over fire risks",
    "US set to allow GE to make engines in India for New Delhi's military jets",
    "J.P.Morgan hikes India's FY24 GDP forecast to 5.5%",
    "There is need to have appropriate regulations on data safety and security, says Rahul Gandhi",
    "Rahul Gandhi says his disqualification from Lok Sabha has given him huge opportunity",
    "Rahul Gandhi holds interactions with Silicon Valley AI experts, startup entrepreneurs",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Can arbitrage funds sustain the momentum?",
    "B30 AUM in mutual funds grew higher than T30’s",
    "SEBI nudges AMFI to form ethics committee to catch bad apples in time",
    "Parag Parikh Flexi Cap Fund: So far, so good. But can it do an encore?",
    "MF industry safe, but Sebi will step in if self-regulation isn't strong: Madhabi Puri Buch",
    "Tech funds bounce back; time to invest?",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "From Rs 40 trillion to Rs 100 trillion: How SEBI wants mutual funds to chart the way forward",
    "Challenges for market borrowings to persist but RBI to ensure smooth completion",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: What is Form-16? All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Leave encashment up to Rs 25 lakh to be tax-free for non-government workers",
    "Peninsula Land reports Rs 101 crore profit, revenue up by 130%",
    "Compared to 2019, more homebuyers bought newly-launched projects in Q1 2023: Report",
    "Mumbai’s May property registrations down 3 percent on year, 9 percent on month: Maharashtra data",
    "Embassy Group clocks revenue of Rs 1,370 crore in FY23, up by 210 percent",
    "Greater Noida Authority launches scheme for 22 commercial plots, eyes Rs 1,100 crore revenue",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "KPIT Technologies hits a new high with a decisive breakout. What should you do?",
    "Trade Spotlight | How to trade in PI Industries, Dixon Technologies, CDSL today",
    "Trade Spotlight | Your strategy for India Cements, Birla Corporation, Orient Electric today",
    "Hot Stocks | Dreamfolks Services, Sundram Fasteners, RBL Bank may deliver up to 12% in short term",
    "Daily Voice | Rate cuts will happen later than when markets are expecting, says this fund manager",
    "Zodiac Energy is moved by 3.09",
    "Flexituff Ventures International",
    "Flexituff Ventu is moved by -3.69",
    "Silly Monks Ent has hit 52wk low of Rs 15.65 on NSE",
    "Kilburn Engg has hit an all time high of Rs 137.85 on BSE",
    "Only Sellers in Sturdy Ind on BSE",
    "Only Sellers in White Diamond on BSE",
    "Prajay Engineers Syndicate",
    "Prajay Engineer is moved by 3.28",
    "Set SMS alerts for market news",
    "Consumers' dilemma: how to protect ‘themselves from themselves’",
    "Apparel retailers feel the heat of discretionary spending cuts",
    "Chart of the Day: Heatwave makes India’s fossil fuels sweat",
    "Start-up Street | Founders’ exit: causes and implications for startups",
    "Agri Picks Report June 01, 2023: Geojit",
    "Apollo Hospitals gains 4% on growth plan, brokerages also positive",
    "Oil falls after large surprise build in US crude stocks",
    "Dollar At Seven-Week High | US Economic Data Reflects Strength | Commodities Live",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "See More Top Companies in India",
    "India's Q4 GDP surprise, Coal India OFS & grey market sentiment check | Market Minutes",
    "Want your bank locker to be safer? Don’t ignore the new locker agreement | Simply Save",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "W Power: Wisdom, Wealth & Women | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]