[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Apple US0378331005, AAPL:US",
    "Vedanta INE205A01025, VEDL, 500295",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18518.80\n\n-115.05 (-0.62%)",
    "Sensex\n\n62542.70\n\n-426.43 (-0.68%)",
    "Greater Noida Authority asks to cancel plot allotments of 50 defaulters",
    "Strategy for India Cements, Birla Corporation, Orient Electric today",
    "Dreamfolks Services, Sundram Fasteners, RBL short term return potential",
    "FDI equity inflows dip 22% to $46 bn in 2022-23",
    "Anil Agarwal's chip dreams stymied as India to deny funding",
    "Sebi looks to plug gaps in PMLA, FII rules with ownership disclosure proposal for FPIs",
    "Sebi paper asks ‘high risk’ FPIs with concentrated holdings to make more disclosures",
    "F&O Manual: Bullishness stays intact for Nifty even as index struggles in short term",
    "Market LIVE Updates: Sensex down 430 pts, Nifty below 18,550; Axis Bank, SBI top losers",
    "New York City is sinking every year | Why is this a caution for Mumbai? | What is land subsidence",
    "5 Things You Must Remember To Do If You're Switching Jobs: Watch!",
    "What’s The ‘In-Principle’ Debt Ceiling Deal That Biden Is Urging Congress To Pass Before Deadline?",
    "Instagram star influencer moves out of village to rent in Navi Mumbai | The Tenant",
    "SEBI nudges AMFI to form ethics committee to catch bad apples in time",
    "Analysts see 42% upside in Adani Ports but stock falls post Q4 results",
    "Fairchem Organics jumps 7% despite muted Q4 results",
    "This little-known cement company's stock zooms 446% in 7 weeks",
    "RBI dividend to govt could have been Rs 1.2 lakh crore if not for risk buffer change",
    "Dhanlaxmi Bank likely to propose new candidate as part-time chairman soon",
    "Morgan Stanley's Ridham Desai: 10 things that changed India for the better in the last decade",
    "More than 16,000 applications for 4,083 Mumbai homes in a week",
    "Patanjali to enter FMCG market armed with an important weapon",
    "Short Call | Can MCX rerate? Contrarian case for AMC stocks, SPAC insiders make a packet",
    "MSCI reshuffling may see Kotak Bank weightage double, Adani exit, inflows to Max Healthcare",
    "India poised to deny funding for Vedanta-Foxconn chip venture",
    "Indigo's Bhatias, Capital International start sale process for travel tech firm ITQ",
    "Rs 4,000-Uber from Bengaluru airport? Transport body steps in after man's viral tweet",
    "Indian-origin ex-CFO, accused of stealing $35 million for crypto venture, pleads not guilty",
    "BlackRock cuts Byju's fair value by 62% for the second time since October 2022",
    "Even Cathie Wood can’t spot the next bull market",
    "15-year-old autistic boy denied boarding at Bengaluru airport",
    "Anil Agarwal's chip dreams stymied as India set to deny funding",
    "Maximize Your Chances: 12 Smart Tips for Getting a Small Business Loan",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with commodity research advice and market analysis",
    "Zombie drug epidemic grips Philadelphia in US. Viral videos show debilitated users",
    "Woman becomes 'full-time daughter' after parents offer her Rs 47,000 per month",
    "I was there as an Indian, says the Rabbi-lawyer who recited Torah at the New Parliament",
    "Surprised by Tharoor's tweet on sengol, says Congress leader M M Hassan",
    "Mumbai Police bans public gatherings till June 11. Find out what’s allowed and what’s not allowed",
    "PM Modi responds to Shah Rukh Khan’s video on new Parliament building",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Ukraine war comes to Moscow as drones strike both capitals: See Pics",
    "Simple One electric scooter launched at a starting price of Rs 1.45 lakh: See Pics",
    "‘IndiGo ki audacity’: Founder rants about high cost of flight tickets",
    "Rs 4,000-Uber from Bengaluru airport? Man's viral tweet prompts transport body action",
    "River in Noida turns red: ‘it’s bleeding to death’",
    "Who is Nevin Shetty, Indian-origin ex-CFO in the centre of $35 million crypto embezzlement case?",
    "Al Pacino, 83, expecting fourth child with 29-year-old girlfriend",
    "Advance / Decline (NSE) \n\n9831056",
    "This stock is not going anywhere in short 2022 sales 1400cr np 2023 sa...",
    "This stock is operator stock, moving 20 point uo next day 20 points do...",
    "Rvnl 144 and higher and higher.. it next q1 robust results.",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Yemen street artist chronicles war on battle-scarred walls",
    "Pakistan court to hear Imran Khan's bail plea in Al Qadir Trust corruption case",
    "China's Baidu launches $145 million venture capital AI fund",
    "Vistara to start flight service on Agartala-Bengaluru route on August 1",
    "Manappuram Finance launches digital money lending app",
    "Xiaomi partners with Dixon Technologies to make mobile phones in India",
    "Customers queue up at PSBs as private banks refuse, put limits on Rs 2,000 notes exchange",
    "Delhi ordinance row: Arvind Kejriwal plans to meet Stalin, Hemant Soren to drum up support",
    "Rahul Gandhi says PM Modi thinks he knows more than God, calls him 'specimen'",
    "The Bodoland Territorial Region’s self-governing success may just be what Manipur needs",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Parag Parikh Flexi Cap Fund: So far, so good. But can it do an encore?",
    "MF industry safe, but Sebi will step in if self-regulation isn't strong: Madhabi Puri Buch",
    "Tech funds bounce back; time to invest?",
    "How MF sectoral allocation changed in April",
    "Got your first job? Now here’s where you should put your money",
    "Our job is to create wealthy investors, not run after them: Parag Parikh AMC",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Challenges for market borrowings to persist but RBI to ensure smooth completion",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: What is Form-16? All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Leave encashment up to Rs 25 lakh to be tax-free for non-government workers",
    "95 percent of real estate agents clear competency exam conducted by MahaRERA",
    "Greater Noida Authority asks officials to list 50 big defaulters, cancel their allotment of plots",
    "DB Realty tanks 7% following disappointing March quarter earnings",
    "MHADA Lottery 2023: More than 16,000 applications for 4,083 Mumbai homes in a week",
    "Noida Authority e-auctions three duplex villas, one MIG flat for Rs 6.47 crore",
    "Mumbai cluster development policy: Maharashtra govt announces 50% premium waiver for 1 year",
    "Prestige Group buys out DB Group from two upscale JV projects in Mumbai in Rs 1,176-crore deal",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Trade Spotlight | Your strategy for India Cements, Birla Corporation, Orient Electric today",
    "Hot Stocks | Dreamfolks Services, Sundram Fasteners, RBL Bank may deliver up to 12% in short term",
    "Hot Stocks | Bet on Apollo Hospitals, Marico, Equitas SFB for healthy returns",
    "Sun Pharma: Stretched valuation a sticking point, what else to watch out for?",
    "Daily Voice | Rate cuts will happen later than when markets are expecting, says this fund manager",
    "Adani Ports and Special Economic Zone",
    "Adani Ports is moved by 0.33",
    "Indiabulls Real is moved by -0.68",
    "Bharti Airtel is moved by 2.18",
    "Sarthak Metals is moved by -3.28",
    "PI Industries is moved by 3.13",
    "Set SMS alerts for market news",
    "What’s behind Patanjali Foods’ ESOP gambit?",
    "Wall Street prepares to take on established crypto companies",
    "Manipur: When politics becomes the only game in town, ethnic rifts widen",
    "SBI slides marginally by 2% as it turns ex dividend",
    "Agri Picks Report May 31, 2023: Geojit",
    "Welspun Corp shares up 5% despite muted profit in Q4; board recommends 100% dividend",
    "Dollar At Seven-Week High | US Economic Data Reflects Strength | Commodities Live",
    "Oil edges up after steep losses ahead of US debt ceiling vote",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "See More Top Companies in India",
    "HDFC Life block deal, Adani Ports, Apollo Hospital & real estate stocks | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "W Power: Wisdom, Wealth & Women | Unusual Suspects",
    "Should you log-out of Siemens or buy into weakness? Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]