[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18856.85\n\n+40.15 (+0.21%)",
    "Sensex\n\n63523.15\n\n+195.45 (+0.31%)",
    "Amazon to collect expiring Rs 2,000 notes from Indian customers",
    "Twitter has failed to pay millions in worker bonuses, lawsuit claims",
    "Go First seeks up to $122 million in additional funds: Report",
    "Amazon duped millions of consumers into enrolling in Prime, says US FTC",
    "Mumbai: Lift collapses from fourth floor, at least 12 injured",
    "'Open to M&A opportunities that add to HDFC Credila's capabilities' — BPEA EQT's Jimmy Mahtani",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Elon Musk Is A 'Fan Of Modi', Says 'Incredibly Excited About Future Of India' | PM Modi In US",
    "Decoding Indigo’s Record 500 Airbus Aircraft Order |  Sky Is Not The Limit!",
    "Sanjay Dutt In An Exclusive Chat With Moneycontrol On His Startup Investments",
    "From Zoho to Tech Mahindra: Where are India's AI startups headed? Watch",
    "A grand White House welcome for PM Modi, US Congress address next",
    "US to ease visas for skilled Indian workers as PM Modi visits",
    "PM Modi invites US students to India as he kicks off official visit",
    "PM Modi to meet Joe Biden as global money flocks to India",
    "TCS bags $1 billion deal from UK's National Employment Savings Trust",
    "Carlyle plans to sell 2.53% stake in Delhivery via block deal: Sources",
    "What lost Titanic submersible maker said on vessel not being up to industry standards",
    "Moneycontrol Daily: Your Essential 7",
    "Saudi sovereign wealth fund PIF sells McLaren stake to Bahrain",
    "Twitter resumes paying Google Cloud",
    "Oil steady after surprise dip in US crude stocks offsets demand fears",
    "Uber to lay off 200 employees in recruitment division",
    "Unacademy's Graphy buys Gaurav Munjal-backed creator community platform Scenes",
    "US President Joe Biden, First Lady Jill received PM Modi at White House",
    "NTPC board to consider proposal to raise up to Rs 12K crore via non-convertible debentures",
    "Nepal resumes import of onions from India after 2-week halt",
    "SAFF Championship: Sunil Chhetri's hat-trick powers India to 4-0 win over Pakistan",
    "Pak court grants pre-arrest bail to former PM Imran Khan in May 9 violence case",
    "Global stocks fall, yields up; Powell says inflation fight not over",
    "ITR filing: Know the difference between AIS and Form 26AS before filing your income tax return",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Elon Musk meets PM Modi, says Tesla is looking to invest in India",
    "'Daku Haseena', wanted for Rs 8.5 crore heist, arrested. Thanks to Rs 10 Frooti",
    "Closing Bell: Nifty at 18,850, Sensex up 196 points; metals drag, power gains",
    "Finmin asks IBA to look at bank retirees' demands within seven days",
    "Area Watch: Why more techies are slowly shifting towards north Bengaluru",
    "Hero MotoCorp unleashes Xtreme 160R 4V: A power-packed thrill for motorcycle enthusiasts",
    "In pics: At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "Banging sounds heard in search for missing Titanic submarine are 'cause for hope'",
    "Five midcap gems with the highest return potential",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "PM Modi meets Musk, Falguni Shah and attends Yoga Day during US visit",
    "International Yoga Day 2023: Popular yoga poses and their benefits",
    "Titanic Expedition: What happens in the 8-day voyage to historic shipwreck",
    "Man stays at Delhi 5-star hotel for nearly 2 years with Rs 58 lakh unpaid bill",
    "The bizarre reason why a Chinese woman was slapped with a 'punishment fee' by a pub",
    "Paytm's Vijay Shekhar Sharma shares Elon Musk clip: 'Loves India and is a fan of our PM'",
    "'I'll finally be free': Woman, 23, to be euthanised in Australia. Her last wish is...",
    "Advance / Decline (NSE) \n\n9501100",
    "Pi s major move on either side is dependent on f n o position it has.....",
    "No move since a long time, exit and buy better stocks. totally my view",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "BOE is likely to announce 25 bps rate hike, as widely expected.",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty inches away from all-time high",
    "Read Ambareesh Baliga full Report",
    "Sanjai Ranganathan to take over from Sabyasachi Das as CEO of L&amp;T EduTech",
    "Bikar Aerospace chooses Aequs' Belagavi cluster to set up operations",
    "Iraq's president ratifies record $152 billion budget criticized by IMF for too rosy projections",
    "The world's experiments with CBDCs — the future of international payments",
    "Sensex At a New Peak: Signs of irrational exuberance are now conspicuous",
    "Patna meeting crucial for opposition’s 2024 plan",
    "Karnataka CM Siddaramaiah Has a Problem: Budgeting for Congress’s lavish poll sops",
    "Modi's Visit to US: Go big on commercial ties. There’s shared prosperity waiting, China lurking",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "MFs’ deployment in up to 90-day CPs of NBFCs rises 21-month high in May: SEBI data",
    "Will HDFC MF’s new scheme revive the interest in consumer sector funds?",
    "Does the rush in small cap stocks indicate a risk-off market?",
    "Sensex hits a new all-time high: Time to stop SIP in equity mutual funds?",
    "SIP closures rise 7.4% month-on-month in May",
    "Rahul Goswami to join Franklin Templeton India MF as head of fixed income",
    "MC explains: Why third-party motor insurance is critical for all vehicles on the road",
    "Beware of employer-assisted housing loans. It is the ultimate golden handcuffs",
    "Now, insurance cos can launch group Ulips, combi plans without prior IRDAI nod",
    "Does life insurance make sense without tax benefits?",
    "LIC announces relaxations for victims of Biparjoy Cyclone",
    "Strengthening grievance redressal framework a work in progress: IRDAI chief",
    "How much health insurance should a fresher get?",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Retirement Planning in a Volatile Market",
    "Sensex on a high: Here’s why Mirae’s Swarup Mohanty loves largecaps",
    "LIC Mutual Fund set to acquire schemes of IDBI Mutual Fund",
    "Midcap index at record high: 10 stocks powering the mutual funds",
    "Will BlackRock’s spot Bitcoin ETF breathe life into the comatose crypto market?",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Using AI, Income-Tax department sends notices to tax evaders for fake donations",
    "Direct tax collections at Rs 3.8 lakh crore, up 11.2% so far in FY24",
    "Income tax returns: Types of TDS certificates and why they are needed",
    "Old is gold: Income tax exemptions &amp; deductions that senior citizens can claim",
    "EPF or NPS: Which is the better investment option?",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "Property prices in northern Bengaluru increase by almost 10 percent: Report",
    "Saya Group to develop ‘India’s tallest mall’ Saya Status in Noida’s Sector 129",
    "Yamuna Expressway Authority to sell 49 industrial plots, eyes Rs 86 cr revenue",
    "Flex office spaces major game changers for commercial sector in Bengaluru, but to grow cautiously",
    "Noida Authority e-auctions two commercial plots in Sector 50 for Rs 169.41 crore",
    "Gold hovers near 3-month low on Powell comments",
    "Latest gold prices: At 3-month low on hawkish US Fed",
    "Gold slides 1% on strong US housing data, firmer dollar",
    "Commodities Live: Strong Domestic & Export Demand Push Prices of Spices To Record Highs!",
    "Latest gold prices: Below $1950, near three-month low",
    "Latest gold prices: Rangebound around $1950, eye on BoE, Jerome Powell's testimony",
    "Sovereign Gold Bond 2023-2024 Series I opens today: Should you invest?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Trade Spotlight | Your strategy for JSW Energy, Linde India, Tube Investments today",
    "Hot Stocks | Bet on Indiabulls Housing Finance and GNFC, sell JSW Steel for short term",
    "Trade Spotilght | How to trade in Shriram Finance, Balkrishna Industries, Dr Lal Path Labs",
    "Hot Stocks | SJS Enterprises, IRCON International, Poly Medicure may fetch up to 20% in short term",
    "Mazagon Dock continues to gain, experts advise profit booking",
    "Daily Voice | Why this fund manager hopes to see robust growth in these sectors in 3-5 years",
    "Nila Spaces closes below 200-Day Moving Average of 3.22 today.",
    "Aptus Value Housing Finance India",
    "APTUS VALUE closes below 50-Day Moving Average of 260.27 today.",
    "Prajay Engineers Syndicate",
    "Prajay Engineer closes below 30-Day,50-Day Moving Average today.",
    "Indo Thai Secu closes below  its 30-Day,50-Day,200-Day Moving Average today.",
    "Nila Infra closes below 200-Day Moving Average of 6.16 today.",
    "TCPL Packaging closes below 150-Day,200-Day Moving Average today.",
    "Atlanta closes below 150-Day Moving Average of 15.62 today.",
    "Set SMS alerts for market news",
    "Archegos fine points to a much bigger issue for UBS",
    "Don’t forget who loses in Fed's quest to soften labour market",
    "Zinc prices extend decline on weak demand, rising supply",
    "Agri Picks Report June 21, 2023: Geojit",
    "Called out by intern for not paying stipend, Soshals app founder’s justification",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "See More Top Companies in India",
    "LESSONS IN MARKETING EXCELLENCE",
    "Can Nifty cross 19,000 mark? Factors to watch out for this week | Market Minutes",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Getting India Smart & Connected | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]