[
    "IRCTC INE335Y01020, IRCTC, 542830",
    "Vedanta INE205A01025, VEDL, 500295",
    "Apple US0378331005, AAPL:US",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18633.85\n\n+35.20 (+0.19%)",
    "Sensex\n\n62969.13\n\n+122.75 (+0.20%)",
    "ITR: These common errors in filing may attract I-T notice",
    "Russia launches massive new air assault on Kyiv: Officials",
    "'Shame': Twitter reacts to Indian wrestlers getting detained in Delhi",
    "FDI equity inflows falls 22% to $46 billion in 2022-23",
    "Jaypee Infratech defers approval of financial statements for March quarter",
    "Fiscal deficit target at risk, Nomura warns despite RBI's Rs 87,416 crore dividend to govt",
    "Market gains for fourth day; Nifty above 18,600, Sensex up 123 points",
    "'Sharp-correction in second half of June, but Nifty likely to hit 21,000 later this year'",
    "Ajay Bagga says 'make hay in May' as markets rally, fears of a slowdown fade",
    "PM launches Rs 75 coin: Why has govt come up with the coin? Here is all you need to know",
    "Instagram star influencer moves out of village to rent in Navi Mumbai | The Tenant",
    "First Glimpse Of New Parliament | Inside Look Of Lok Sabha & Rajya Sabha Chambers",
    "FDI Into India Falls 16% In FY23: Why Are Foreign Investors Wary?",
    "Australian MPs were \"jealous\" of PM Modi's popularity, says Leader Of Opposition Peter Dutton",
    "What Is ‘Disease X’? WHO Rings Warning Bells For A Deadlier Pandemic",
    "Go First: DGCA puts jet repossession request from lessors on hold",
    "Apollo Hospitals Q4 net profit rises 50.5% to Rs 146 crore, lags estimate",
    "Jubilant Pharmova plunges 10% on dismal Q4 earnings, regulatory snags",
    "Zomato shares jump on sizeable block deal",
    "HUL annual report: No salary jump for Sanjiv Mehta, 19 brands in Rs 1,000 crore club and more",
    "RBI dividend to govt could have been Rs 1.2 lakh crore if not for risk buffer change",
    "Wary of high rates, metal producers plan to fund capex through cash flows, and not debt",
    "Mensa Brands fires 200 employees as business shows signs of slowdown",
    "Condoms, biryani, jalebi-fafda: What India ordered from Swiggy this IPL season",
    "Unruly passenger assaults Air India crew member onboard Goa-Delhi flight",
    "Anand Mahindra says MS Dhoni should consider politics: 'Obvious future leader'",
    "Iranian model wears noose around her neck at Cannes: 'Stop executions'",
    "Road To 2024: Modi magic intact, Rahul’s ratings improve, economic concerns",
    "FPI investment in outstanding corporate bonds decline to Rs 1.04 lakh crore",
    "Recession fear returns as Fed revises rate outlook, signals another hike: Antique",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Jeff Bezos prepares prenup to protect his $138 billion in marriage to Lauren Sanchez",
    "SBI receives Rs 2,000 notes worth Rs 14,000 crore as deposit, says Chairman Dinesh Kumar Khara",
    "Maximize Your Chances: 12 Smart Tips for Getting a Small Business Loan",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with commodity research advice and market analysis",
    "Poonawalla Fincorp's Business Loans: The perfect solution for your funding needs",
    "PM Modi responds to Shah Rukh Khan’s video on new Parliament building",
    "Woman becomes 'full-time daughter' after parents offer her Rs 47,000 per month",
    "Discover New Zealand: The Guide For First-Time Visitors By Air New Zealand",
    "Inside the Bootcamp Sessions that are Prepping India’s Startups for Funding Success",
    "Surprised by Tharoor's tweet on sengol, says Congress leader M M Hassan",
    "New seasons of 14 OTT shows to look forward to",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "IPL 2023: A look at five Indian players who outperformed this season",
    "Home Minister Amit Shah meets women leaders, civil society groups in Manipur",
    "Cooking eggs in microwave left woman with skin peeling from face",
    "Jeff Bezos and Lauren Sanchez celebrated engagement with $4,000 wine and...",
    "Mumbai Police bans public gatherings till June 11. Find out what’s allowed and what’s not allowed",
    "A Spanish village voted under a record 30 seconds. The total number of voters are...",
    "Advance / Decline (NSE) \n\n9531084",
    "Market os bullish however you haveypur preference.",
    "Seat belt toh kitne dino se pahen rakha hai.......abitak udd heee nahi...",
    "Koi to result bata do bhai...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "William J. O’Neil, Investor’s Business Daily founder, dies at 90",
    "Unilever and Nestle to appoint new finance chiefs as industry battles inflation",
    "What do we know about the drone strike on Moscow?",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "P-notes investment hits 4-month high of Rs 95,911 crore in April",
    "Congress wants Centre to come out with White Paper on situation along the LAC with China",
    "Pakistan: Made and unmade by the Army, Imran Khan’s political avenues are closing fast on him",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Tech funds bounce back; time to invest?",
    "How MF sectoral allocation changed in April",
    "Got your first job? Now here’s where you should put your money",
    "Our job is to create wealthy investors, not run after them: Parag Parikh AMC",
    "It's a long process, will take time: Ananta Barua on SEBI’s mutual fund TER proposals",
    "Enhancing fixed income returns when the yield curve is flat is not easy, but there’s a way out",
    "Six charts that influenced SEBI’s mutual fund total expense ratio proposals",
    "Passive investing gains momentum but retail investors still have only a small share",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Challenges for market borrowings to persist but RBI to ensure smooth completion",
    "HDFC Short Term Debt Fund: An all-weather debt fund has delivered across rate cycles",
    "Frenetic rush to resolve sovereign debt crises keeps Wall Street jittery",
    "SEBI bringing in Mutual Fund Light regulation to foster passive fund growth: Ananta Barua",
    "One year of interest rate hikes: Debt funds emerge a winner despite headwinds",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: What is Form-16? All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Leave encashment up to Rs 25 lakh to be tax-free for non-government workers",
    "Technology companies occupy half of total flex space in India: report",
    "Almost 36% real-estate projects from pre-RERA era have disputes, compared to 3% now: MahaRERA",
    "Malls worried over low occupancy at multiplexes; pin hopes on July releases",
    "Chintels Paradiso case: Flat owners in towers E, F asked to get interior evaluation done in a week",
    "Developers are bound to show land documents before purchase, says Karnataka authority",
    "DDA expected to launch housing scheme for 23,000 flats in June",
    "Puravankara plans to launch 15 mn sq ft projects this fiscal, eyes topline of Rs 18,000 crore",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Hot Stocks | Bet on Apollo Hospitals, Marico, Equitas SFB for healthy returns",
    "Sun Pharma: Stretched valuation a sticking point, what else to watch out for?",
    "Top 10 trading ideas for June series as Nifty summits Mt 18,499 and aims to scale higher",
    "Radico Khaitan — Promising market position at a steep valuation",
    "Want to remove pledge on shares, increase promoter holding, says Jain Irrigation vice chairperson",
    "ILandFS Investment Managers",
    "ILandFS Consolidated March 2023 Net Sales at Rs 17.51 crore, up 49.27% Y-o-Y",
    "Winsome Yarns Consolidated March 2023 Net Sales at Rs 2.43 crore, down 80.76% Y-o-Y",
    "IMEC Services Consolidated March 2023 Net Sales at Rs 12.90 crore, up 25.56% Y-o-Y",
    "IMEC Services Standalone March 2023 Net Sales at Rs 3.99 crore, up 122.54% Y-o-Y",
    "Panacea Biotec Consolidated March 2023 Net Sales at Rs 128.93 crore, down 8.38% Y-o-Y",
    "Alpa Labs Consolidated March 2023 Net Sales at Rs 29.16 crore, up 15.88% Y-o-Y",
    "Set SMS alerts for market news",
    "WeWork’s woes show return-to-office is no party",
    "Moneycontrol Pro Panorama | Return of the FIIs",
    "G20 Presidency: Climate change and fractured world order emerges as main challenges",
    "Taking Stock: Market gains for fourth day; Nifty above 18,600, Sensex up 123 points",
    "Ground 17,000 or Summit 21,000: What's next for the Nifty?",
    "Hold Steel Authority of India; target of Rs 90: Sharekhan",
    "Buy Mahindra and Mahindra; target of Rs 1550: Sharekhan",
    "Buy Grasim Industries; target of Rs 1950: Sharekhan",
    "Agri Picks Report May 30, 2023: Geojit",
    "Oil rises on US debt deal, but rate hikes, OPEC+ talks curb enthusiasm",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "See More Top Companies in India",
    "W Power: Wisdom, Wealth & Women | Unusual Suspects",
    "Should you log-out of Siemens or buy into weakness? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]