[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Apple US0378331005, AAPL:US",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18634.55\n\n-91.85 (-0.49%)",
    "Sensex\n\n62848.64\n\n-294.32 (-0.47%)",
    "Economic pessimists are running out of worries",
    "Why the MPC has signalled an extended pause",
    "Billionaire Richard Branson puts himself on trial",
    "S&P 500’s tech-heavy top is a feature, not a bug",
    "RBI adds 8 entities to alert list of unauthorised forex trading platforms",
    "RBI approves FLDG, key to partnership between fintechs & banks/NBFCs",
    "RBI status quo: Banks remain on wait-and-watch mode on rates",
    "Ten hot stocks for double-digit return after MPC pause",
    "RBI MPC: Deposit and lending rates remain on a steady path; life goes on as usual, for now",
    "LIVE: RBI Governor Shaktikanta Das | Monetary Policy announcement on key interest rates",
    "Apple Vision Pro Is A Computer On Your Face! Game-changing Rs 3 Lakh AR Headset Launched",
    "What's unique about the Mumbai Trans Harbour Link? Highway connects Navi Mumbai, Raigad",
    "IKIO Lighting IPO Fully Subscribed In First Five Hours: Should You Invest?",
    "Iran-Afghanistan ties: A deep dive into Helmand river water sharing dispute",
    "Avoid These 5 Mistakes To Safeguard Your ITR From Rejection",
    "Canada Pension Fund to sell 1.66% stake in Kotak Mahindra Bank: Sources",
    "HDFC may tap Arvind Kapil for mammoth mortgage business post merger",
    "Railways’ earning from freight in May up 4% YoY at Rs 14,642 crore",
    "Street laps up banking, finance firms in May, shuns IT",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "Go First's sole intent is to hijack insolvency process, Delhivery alleges",
    "FMCG cos see mixed consumption trends in Q4",
    "Govt set to introduce market coupling in electricity trade",
    "MFs can now participate in repos on Commercial Papers, Certificate of Deposits",
    "US jobless claims surge to 261,000, highest since October 2021",
    "Centre’s air quality panel puts curb on use of DG sets in Delhi NCR",
    "Govt issues allocation orders for 22 coal mines",
    "Amit Thawani to take over as new Nomura India i-banking head, Utpal Oza steps down",
    "Reaching that crorepati milestone hinges on your commitment to investing",
    "US credit card users owe nearly $1 tn: Here’s how to avoid their mistakes",
    "Sebi asks registrars, transfer agents to set up online system for investor requests, complaints",
    "e-RUPI vouchers get a boost from RBI monetary policy",
    "News Highlights | PM Modi speaks to Saudi Crown Prince, discusses connectivity, trade ties",
    "Karnataka to construct 5 satellite towns in outskirts to reduce pressure on Bengaluru",
    "Barack Obama says this sentence will accelerate your success: 'Let me take...'",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Man spends Rs 88 lakh to increase his height by 7 inches",
    "Ankur Warikoo says he lost 8 kg in 16 weeks, gets schooled by a doctor over supplements",
    "Indian-origin US presidential candidate Nikki Haley calls India ‘one of the biggest polluters'",
    "Bengaluru man shares WhatsApp conversation of scammer teaching him 'valuable' lesson",
    "Closing Bell: Nifty below 18,650, Sensex falls 294 pts; IT, realty, auto worst hit",
    "Comic Tanmay Bhat's YouTube channel restored, hackers had renamed it to...",
    "As RBI keeps policy rates unchanged, bet on these 10 stocks for double-digit returns",
    "Narayana Murthy and Sudha Murty on how Telugu cinema introduced them to the language",
    "Upgrad's Ronnie Screwvala jabs Byju's over US lawsuit: 'Not even Netflix or HBO...'",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Papua New Guinea women weave their way to a living: See Pics",
    "In Pics: Ten most expensive cities for expats in 2023",
    "This Forbes billionaire, 76, once worked as a Playboy Bunny",
    "US man lands dream acting job after 321 days of 'playing dead' on TikTok",
    "'I'll hit you on the head with this stick': Haryana gym trainer's viral video has internet divided",
    "The most sought-after professions among Tamils for arranged marriage are…",
    "Advance / Decline (NSE) \n\n6761395",
    "Where are those boarders with so much confusing a.options.22.34.886838...",
    "Good to buy gold for long term investment",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, headwinds averted",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "In Pics: Lionel Messi joining MLS's Inter Miami after exit from Paris Saint-Germain",
    "Kilauea, one of the world's most active volcanoes, begins erupting after 3-month pause: See Pics",
    "Gainers & Losers: 10 stocks that moved the most on June 8",
    "Looking to invest in FD? Choose the ideal tenure for maximum returns.",
    "Mother Dairy reduces MRP of Dhara edible oils by Rs 10/litre",
    "Cash-strapped Pakistan's economy shows just 0.29% GDP growth & over 29% inflation",
    "MSP hike on kharif crops may help lower inflation, say economists",
    "BJP announces `election chiefs' for Lok Sabha, Assembly constituencies in Maharashtra",
    "100 lakh saplings to be planted  on Gandhi Jayanti: Himanta Biswa Sarma",
    "Congress asks S Jaishankar to take up with Canada 'Indira assassination float' in Brampton parade",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Debt mutual funds 2.0: Life after removal of long-term indexation benefit",
    "Is this the time to invest in auto funds?",
    "Franklin Templeton equity funds go up when things are down. Here's why",
    "ICICI Pru Bluechip Fund completes 15 years. Does it still have its mojo?",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Bajaj Finance to bring down dependence on telemarketing calls: Sanjiv Bajaj",
    "Indian issuers raised nearly $43 billion in green bonds from January 2014 to March 2023",
    "Over 1,200% returns in 2 years, but not over yet: MF still hold these multibagger smallcap stocks",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "Housing prices jump in 43 cities, slump in 7: NHB",
    "Karnataka RERA directs Bengaluru developer to stick to guidelines for proposed township",
    "RBI MPC meet: Realty stocks under pressure but analysts unperturbed",
    "Gurugram’s new metro may spur property price increase, revive old city",
    "RBI MPC meeting: Decision to hold rates will boost housing demand, say experts",
    "Gold firms as dollar eases, focus on Fed cues",
    "Gold near two-month low on surprise rate hikes in Australia, Canada",
    "Gold steady near $1950, as focus turns to US Fed's June 14 meeting",
    "Aditya Birla Group forays into branded jewellery retail with Rs 5,000-crore bet",
    "Gold rises as dollar sheds gains against peers",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | Your game plan for Glenmark Pharma, HPCL, Triveni Engineering today",
    "Hot Stocks | Bet on Power Grid Corporation, NTPC, Bharat Forge for short term",
    "Trade Spotlight | Here's how to trade in Mahindra CIE Automotive, Angel One, Ambuja Cements today",
    "Kandarp Digi closes below 30-Day,50-Day Moving Average today.",
    "PPAP Automotive closes below 150-Day,200-Day Moving Average today.",
    "IEX closes below 150-Day,200-Day Moving Average today.",
    "NK Industries closes below  its 50-Day,150-Day,200-Day Moving Average today.",
    "Bharat Road Net closes below 150-Day,200-Day Moving Average today.",
    "Anjani Portland closes below 150-Day Moving Average of 191.54 today.",
    "Oriental Trimex closes below 50-Day Moving Average of 6.79 today.",
    "Set SMS alerts for market news",
    "RBI Monetary Policy: A calibrated approach to normalisation",
    "Taking Stock: Sensex down 294 points, Nifty below 18,650; power, capital goods shine",
    "Bulk deals | Ashish Kacholia pares his stake by 0.78% stake in United Drilling Tools",
    "Buy Techno Electric and Engineering; target of Rs 480: ICICI Direct",
    "Buy Lemon Tree Hotels; target of Rs 120: ICICI Direct",
    "Iron ore prices at seven-week high; Metals extend gains | Commodities LIVE",
    "Strong order book, focus on EVs make Sona BLW a compelling bet",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "RBI MPC decision, Tech Mahindra & utility stocks in focus | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]