[
    "AP;AFP; Getty ImagesKirill Kudryavtsev / AFP - Getty Images",
    "Drones strike Moscow in first attack on capital's residential areas since the war began",
    "Ukraine denies responsibility for Moscow drone attack",
    "Russia issues arrest warrant for Lindsey Graham after Ukraine comments",
    "Elizabeth Holmes set to report to prison to begin 11-year sentence",
    "Scott Olson / Getty Images",
    "Woman rescued uninjured 24 hours after Iowa building's partial collapse",
    "Her wife vanished as they started to flee their crumbling Iowa building",
    "Historic Iowa apartment building set to be demolished after partial collapse",
    "Anna Moneymaker / Getty Images",
    "Debt ceiling deal between Biden and McCarthy faces its first major test",
    "Far-right members, unhappy with debt deal, float threatening McCarthy's speakership",
    "What's in the debt limit bill? Key provisions in the Biden-McCarthy deal to avert default",
    "China rejects meeting with Pentagon chief in a setback for U.S. hopes of a thaw",
    "China’s youth unemployment hits a record high, deepening its economic scars",
    "Elon Musk meets Chinese foreign minister, who calls for ‘mutual respect’ in U.S. relations",
    "Eva Marie Uzcategui / Getty Images",
    "At least 16 dead and dozens injured in shootings across the U.S. over Memorial Day weekend",
    "Ralph Yarl, Black teen shot for ringing the wrong doorbell, walks at brain injury event",
    "Sam Bankman-Fried's bid to dismiss cryptocurrency charges is 'meritless,' prosecutors say",
    "Amy Harris / Invision / AP",
    "U.S. Coast Guard searching for man who fell overboard Carnival cruise ship near Florida",
    "9 people, including 3 children, injured in shooting near beach in Hollywood, Florida",
    "1 dead and 4 missing after charter boat sinks off the coast of Alaska",
    "U.S.-Canadian border crossing shut down after driver claims to have explosive device",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "Brett Coomer / Houston Chronicle via Getty Images file",
    "Impeachment trial of Texas AG Ken Paxton to begin no later than August 28",
    "Biden’s student debt plan hangs in balance as major Supreme Court rulings loom",
    "Young engaged couple shot dead by landlord over tenancy dispute, police say",
    "Japan premier’s son to resign after public outrage over private party at official residence",
    "Woman knocked unconscious but wins chaotic U.K. race chasing cheese down a hill",
    "Guillem Sartorio / Bloomberg via Getty Images file",
    "Uganda enacts harsh anti-LGBTQ law including death penalty",
    "At least 150 people jailed under El Salvador's emergency powers have died, according to new report",
    "North Korea says it will launch its first military spy satellite in June",
    "30 international peacekeepers injured in fierce clashes with ethnic Serbs in Kosovo",
    "Carnival passengers share 'nightmare' conditions during rough seas",
    "Venice’s Grand Canal turned green — and no one knows why",
    "Woman rescued 24 hours after Iowa apartment partially collapses",
    "Children of lost service members gather to grieve, support and honor",
    "NBC News / Getty Images; Golden Patriots Future",
    "‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "'Succession' finally has a winner, but that was never the point",
    "NBC News / Dan Fine Photography",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Disgraced Theranos founder Elizabeth Holmes set to report to prison to begin 11-year sentence",
    "Smith Collection/Gado / Getty Images",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Future Publishing via Getty Images file",
    "Chinese apps remain hugely popular in the U.S. despite efforts to ban TikTok",
    "Ministry of Foreign Affairs of the People's Republic of China via AP",
    "'The Little Mermaid' makes box office splash with $95.5 million opening",
    "Lucy North / Press Association via AP Images",
    "British prank TikToker who went viral for entering stranger's home is in custody",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "El Salvador Presidential Press Office via AP",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "Daisy Jasmin Estrada Borja",
    "A Latina who's not allowed to wear Mexican American sash at graduation takes legal action",
    "Courtesy Mike Lewis of USA Swimm",
    "An Olympian says a drowning experience inspired him to teach children to swim",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Fans around the world gather to remember Tina Turner's influence",
    "South Dakota governor calls on college board to ban drag shows and eliminate 'preferred pronouns'",
    "Charlie Neibergall / AP file",
    "Iowa Gov. Reynolds signs bill restricting instruction on sexual orientation and gender identity",
    "Michael M. Santiago / Getty Images",
    "12-year-old graduates college in California, setting school record",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "Tuft & Needle ; Birch Living ; Purple",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Do Not Sell My Personal Information"
]