[
    "Canadian Forces; Getty Images; OceanGate",
    "Desperate push to find sub before oxygen supply runs out",
    "The Titanic brought them together, and a tiny vessel could doom them",
    "Rescue operation faces extreme environment in search for missing sub",
    "Titanic submersible lost at sea raises legal questions for high-risk businesses",
    "Chip Somodevilla / Getty Images file",
    "Republicans take the rare step of censuring Rep. Adam Schiff over Trump-era probes",
    "Harvard human remains case highlights need for body donation regulations, experts say",
    "Anna Moneymaker / Getty Images",
    "Republicans decide to forgo Biden impeachment vote after internal fighting",
    "U.S. District Court for the District of Columbia",
    "Mandel NGan / AFP via Getty Images file",
    "Former FBI analyst sentenced to nearly 4 years for illegally retaining classified docs",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "Hunter Biden plea deal sparks political fight over independence of the justice system",
    "Tornado strikes Texas town, destroying homes and businesses",
    "Joshua Boucher / Pool / The State via AP",
    "Judge in Alex Murdaugh trial says he 'felt sorry' for convicted murderer",
    "Genetic genealogy used to link suspect in Idaho slayings to crime scene, prosecutors say",
    "Darrell Schoppe / Cover Images via AP",
    "‘Unprecedented’ ocean heat wave could linger through fall",
    "Neo-Nazis disrupt a drag story hour in New Hampshire",
    "Sorority says rules allow transgender woman at Wyoming chapter",
    "Christian-owned Texas business shielded from LGBTQ bias claims, appeals court rules",
    "Wolfgang Schwan / Anadolu Agency via Getty Images",
    "Ukrainian leaders call for aid to help meet $400 billion recovery price tag",
    "Saul Loeb / AFP - Getty Images file",
    "U.S. senior officials caught off-guard by Biden's calling Xi a 'dictator'",
    "Explosion kills 31 people at a barbecue restaurant in China",
    "Blast in central Paris injures dozens of people; gas explosion suspected",
    "Rome's newest tourist spot: The site where Julius Caesar was assassinated",
    "Science Photo Library - CDC / Getty Images",
    "CDC panel recommends RSV vaccines for adults ages 65 and up",
    "Leila Register / NBC News; Getty Images",
    "Doctors say HCA hospitals push patients into hospice care to improve mortality stats",
    "George Frey / Getty Images file",
    "CDC warns people to protect themselves from measles when traveling",
    "Sales of e-cigs packed with nicotine soar as regulators try to crack down",
    "Hospital turns over transgender patient records to Tennessee attorney general in investigation",
    "Chelsea Stahl / NBC News; Getty Images",
    "How ex-Confederates spread racist attitudes far and wide after the Civil War",
    "Deep sea expert discusses search for Titanic submersible",
    "Underwater noise heard amid search for submersible exploring Titanic wreckage",
    "Test scores for 13-year-olds continue to plunge in math and reading, new data reveals",
    "Rural Massachusetts town pushes past fear to hold Pride event",
    "Ibrahim Rayintakath for NBC News",
    "In hidden Discord communities, adults are abusing and extorting children",
    "Inside the Titanic tourist submersible missing with 5 people",
    "Mark Abramson for NBC News",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Chelsea Stahl / NBC News; handout photos; Getty Images",
    "Tom Williams / CQ Roll Call via AP file",
    "Rep. Lauren Boebert to force House vote on impeaching Biden",
    "Idaho man accused of killing 4 'lost it' after neighbor allegedly exposed himself to family",
    "simpson33 / Getty Images/iStockphoto",
    "FTC sues Amazon over 'deceptive' Prime sign-up and cancellation process",
    "Supreme Court's Samuel Alito defends against ethics questions",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Titanic tour company offered up-close experience for $250,000",
    "Academy of American Poets makes history with its first Latino president",
    "Sergione Infuso  / Corbis via Getty Images file",
    "Ava Max says she was slapped onstage during Los Angeles performance",
    "Most avid true crime podcast listeners are Latino and Black",
    "What happened to Bad Bunny's superhero spinoff?",
    "French filmmaker Luc Besson cleared of all charges in rape case",
    "Amid LGBTQ backlash, Latinos in advocacy groups push back",
    "Brazilian Environmental Agency",
    "Brazil seizes world's biggest illegal shark fin consignment",
    "Congress and Postal Service unveil stamp honoring John Lewis",
    "Once wrongly imprisoned, member of 'Central Park Five' is running for office",
    "Shannon Broderick / Laramie Daily Boomerang via AP file",
    "Brandon Bell / Getty Images file",
    "Wisconsin school district weighs banning LGBTQ 'safe space' signs",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "What is Walmart Plus Week?",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "When is Amazon Prime Day 2023? What to know",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "Do Not Sell My Personal Information"
]