[
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Moms for Liberty chapter apologizes for quoting Hitler in newsletter",
    "Moms for Liberty activists strategize to take over school boards and pass parental rights bills",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Biden says Putin was weakened by Prigozhin's revolt",
    "3 children among 9 dead as Russian missile slams into pizza restaurant",
    "Laurence Griffiths / Getty Images",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "FROM 2022: Simone Biles becomes youngest Presidential Medal of Freedom recipient",
    "Brendan Smialowski  / AFP - Getty Images",
    "Have you heard the one about the old president? Well, Biden has a joke for you",
    "'I know I'm 198 years old': Biden cracks jokes about his age in speeches",
    "Scott Eisen / Getty Images",
    "Trump explores messing with the first GOP debate",
    "House Republicans embark on a mission: Avenge Trump",
    "The 'lesser of two evils' voters who could decide 2024",
    "Canadian wildfire smoke blankets parts of U.S. as others face severe heat and storms",
    "Daniel Penny pleads not guilty in NYC subway chokehold death of Jordan Neely",
    "Sean Gardner / Getty Images file",
    "NASCAR driver Jimmie Johnson's in-laws and their grandson are dead in an apparent murder-suicide",
    "Bodycam video shows police rescuing toddler from mom during attempted drowning",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Ex-NFL player Ryan Mallett dies in apparent drowning at Florida beach",
    "Over half of Americans have faced online hate, survey finds",
    "Luiz C. Ribeiro / Tribune News Service via Getty Images file",
    "Trump sues E. Jean Carroll, claims she defamed him on television",
    "Patrick Semansky / AP file",
    "Former Trump lawyer Rudy Giuliani interviewed in special counsel's election probe",
    "Al Drago / Bloomberg via Getty Images",
    "Ron DeSantis pushes for the federal Disney trial to start after the presidential election",
    "Biden to tout his vision for economic growth 'from the middle out and bottom up'",
    "This Democrat has led an anti-gun violence group in Congress for a decade. Now some want a change.",
    "Reappointment vote ends in partisan deadlock for Wisconsin's top elections official",
    "Cheney says she won't do anything that 'helps' Trump as she weighs White House bid",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Artur Widak / NurPhoto via Getty Images",
    "Buy Buy Baby goes up for auction after Bed Bath & Beyond assets get sold off",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Mortgage demand grows, driven by sales of new homes",
    "Costco cracks down on sharing membership cards",
    "After 27 tries, Chinese millionaire considers giving up on college entrance exam",
    "Archaeological Park of Pompeii via AFP - Getty Images",
    "Pie in the sky! A wall painting found in Pompeii doesn't depict Italy’s iconic dish",
    "Anthony Wallace / AFP via Getty Images file",
    "Millions become a year or two younger as South Korea scraps traditional way of counting age",
    "Unrest after police shooting of teenager prompts France to heighten security",
    "Bus of migrants help mother give birth before being detained in Mexico",
    "Chris Delmas / AFP via Getty Images file",
    "Dwyane Wade says his daughter physically hid from him when she came out to the family",
    "'Superman: Legacy' casts David Corenswet as Clark Kent and Rachel Brosnahan as Lois Lane",
    "Franco Origlia / Getty Images file",
    "Actor Julian Sands confirmed dead after going missing months ago in California mountains",
    "Michelle Yeoh and Chadwick Boseman are honored with Walk of Fame stars",
    "Concertgoer appears to throw ashes at Pink during performance",
    "Kelsey Brunner for NBC News",
    "Follow the latest news and conversations at the Aspen Ideas Festival",
    "Just now17m agoNot to be overlooked in the gun debate: Suicides",
    "Just now33m agoEverytown president: Laws alone can't solve 'complicated problem'",
    "Just now43m agoHow 'trauma fatigue' prevents debate on guns from moving forward",
    "Just now55m agoMcBath on gun violence: 'We’re looking at a public health crisis'",
    "Brian Cox on 'Succession' popularity: We live in the age of the ultra-rich",
    "Follow full coverage of the Aspen Ideas Festival",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Our favorite pet stain removers and litter boxes of 2023",
    "Global outrage after tourist carves names into Rome's Colosseum",
    "Ryan Seacrest to take over for Pat Sajak on ‘Wheel of Fortune’",
    "The next Ozempic? New weight-loss drug shows promising results",
    "Number of Americans working remotely drops from pandemic high",
    "Erik McGregor / LightRocket via Getty Images",
    "Sarah L. Voisin / The Washington Post via Getty Images file",
    "Supreme Court deals a blow to Trump ally John Eastman's 2020 election theory",
    "Arkady Budnitsky / Anadolu Agency via Getty Images",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Kent Nishimura / Los Angeles Times via Getty Images",
    "Supreme Court rules against giving state legislatures unchecked control over federal elections",
    "Scott Olson / Getty Images",
    "Judge in Trump docs case denies special counsel's request to keep 84 witnesses secret",
    "5 teens killed after car plunges into Florida retention pond",
    "Spencer Platt / Getty Images",
    "What to know about the health risks of wildfire smoke",
    "Cavan Images / Getty Images",
    "Pregnant workers may get new protections and accommodations as new law takes effect",
    "Soumyabrata Roy / NurPhoto via Getty Images",
    "CDC issues alert after 5 cases of locally acquired malaria reported in Texas and Florida",
    "Experimental drug could offer more weight loss than any drug on the market, study finds",
    "Intermittent fasting is as effective as calorie counting for weight loss, study finds",
    "Blistering heat grips the South and puts Texas under triple-digit temperatures",
    "NaluPhoto / Getty Images/iStockphoto",
    "Dolphin moms use 'baby talk' with their newborns, research shows",
    "For California marine mammals, toxic algae bloom is a mass casualty incident",
    "Oregon county sues fossil fuel companies, alleging they caused deadly 2021 heat wave in Northwest",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "Mexico Instituto Nacional de Migracion",
    "Alberto Ortega / Europa Press via Getty Images file",
    "Spanish Royal Academy rejects changing  language to anti-colonial ‘Ñamericano’",
    "Stefani Reynolds / Bloomberg via Getty Images file",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Black firefighter sues fire department over alleged racist party and harassment",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Lev Radin / Sipa via AP file",
    "NYC makes Diwali an official school holiday, but there’s a catch this year",
    "Do Not Sell My Personal Information"
]