[
    "A dormant California lake that reappeared isn't going anywhere fast",
    "California's historic winter snowfall stresses the state's water systems",
    "Nov. 2021: Slain Iowa teacher remembered 'the very best of us'",
    "Amanda Andrade-Rhoades / AP file",
    "Freedom Caucus members voted to oust Rep. Marjorie Taylor Greene. It's unclear if it worked.",
    "Marjorie Taylor Greene berated fellow Freedom Caucus member Lauren Boebert on House floor",
    "BSIP / Universal Images Group via Getty",
    "FDA grants full approval to new Alzheimer's drug meant to slow disease",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Texas Center for the Missing",
    "Houston teenager 'missing' for 8 years was at home the whole time, police say",
    "Questions emerge about disappearance of Texas teen who was reported found 8 years later",
    "Houston mom often cried about her 'missing' son who was home the whole time, neighbor says",
    "Samuel Corum / Getty Images",
    "Cocaine found in the White House was in a different location than previously reported, sources say",
    "Metropolitan Police Department",
    "Jan. 6 defendant arrested with guns near Obama's home may be released next week",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump aide Nauta pleads not guilty in Florida classified documents case",
    "Saul Loeb / AFP via Getty Images",
    "Biden touts clean energy investments in S.C. amid 'Bidenomics' push",
    "2 top public health positions in Ron DeSantis' administration are vacant",
    "Tax records show Sen. Joe Manchin has been late on payments repeatedly in recent years",
    "For two California reparations task force members, the hard work comes next",
    "Jeanne Accorsini / Sipa via AP Images",
    "Meta rebuts claim it hired former Twitter employees to make Threads",
    "NBC News / AP; Bloomberg via Getty Images",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Eva Marie Uzcategui / Bloomberg via Getty Images file",
    "Need a new passport? State Department says apply at least 6 months before your departure",
    "Mortgage demand drops to lowest level in a month as interest rates rise",
    "Ercin Erturk / Anadolu Agency via Getty Images",
    "Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Wigs, guns and a giant sledgehammer: Russian media claims to show Wagner mercenary chief's home",
    "Jenin residents begin picking up pieces after Israeli forces end raid",
    "Alexander Zemlianichenko / AP",
    "Mercenary chief is still in Russia despite deal to end mutiny with exile, leader of Belarus says",
    "Tourist who etched names on Colosseum says he didn't know it was ancient in apology letter",
    "Deforestation in the Amazon has dropped 34%, reversing trend under Bolsonaro",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "OceanGate Expeditions via AP",
    "OceanGate suspends all exploration and commercial operations after Titan implosion",
    "Los Angeles County Sheriff's Department",
    "L.A. County sheriff's office probes 'disturbing' video showing deputy slam woman to ground",
    "7-year-old shot and killed on Fourth of July after jet ski dispute in Florida",
    "Foot fondler on the loose in Lake Tahoe area, officials warn",
    "Getty Images/AFP-Getty Images",
    "JM Haedrich  / Sipa via AP",
    "Tommaso Boddi / Getty Images file",
    "Kevin Costner’s estranged wife ordered to leave home by the end of the month in divorce battle",
    "Monica Schipper / Getty Images for Netflix",
    "Angelina Jolie says racial disparity in health care has 'endangered' her children of color",
    "'Dolores Roach' actor Justina Machado still loves empanadas — though not the horror-filled kind",
    "Keke Palmer's boyfriend faces backlash for shaming her sheer dress at Usher concert",
    "When is Amazon Prime Day 2023? What to know",
    "7 top-rated tower fans to stay cool this summer",
    "The best products to buy during Prime Day",
    "The best women's razors for summer",
    "What to know before buying an Amazon Echo speaker",
    "Britney Spears says she was hit by security guard for NBA rookie",
    "Twitter threatens to sue Meta over new app Threads",
    "FDA grants full approval for new Alzheimer’s drug",
    "‘Sisters of the Skies’ aiming to inspire more Black women to become pilots",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Barriers to transgender health care lead some to embrace a do-it-yourself approach",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "@beberexha / via Instagram",
    "Fans keep throwing stuff at artists onstage. Will it ever stop?",
    "More Mar-a-Lago search warrant information released in Trump classified docs case",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "Man sentenced to life in prison for rape of 10-year-old",
    "Tom Williams / CQ Roll Call via AP file",
    "WHO report on deadly virus among babies in 3 countries has U.S. doctors on edge",
    "Johan Nilsson / TT News Agency via AP file",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Guillermo Legaria   / AFP via Getty Images file",
    "The show that inspired ‘Ugly Betty’ is getting a sequel with the original Colombian star",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "California and Texas officials ask DOJ to investigate Florida for sending migrants to other states",
    "Joe Raedle / Getty Images file",
    "Judge blocks Florida provision that would limit Latino voter registration",
    "Visual Ideas/Nora Pelaez / Getty Images/Tetra images RF",
    "Some Black Twitter users are hoping new Spill app will be a safe space",
    "Supreme Court backtracked on Black death row inmates’ racial bias claims, liberal justices say",
    "Rich Fury / Getty Images file",
    "Ricky Martin and husband, Jwan Yosef, announce divorce",
    "1 in 5 United Methodist congregations in the U.S. have left over LGBTQ conflicts",
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "Philadelphia shooting suspect isn't trans, officials say, but speculation continues",
    "John Phillips / Getty Images",
    "‘Peaky Blinders’ and Cillian Murphy denounce homophobic video shared by DeSantis campaign",
    "Connecticut legislator attacked after Muslim service says police downplayed assault",
    "South Korea includes American teenager in Women’s World Cup squad",
    "Do Not Sell My Personal Information"
]