[
    "A 'large majority' of Democrats are 'in flux' on the debt ceiling deal, progressive rep. says",
    "Biden urges Congress to pass bipartisan debt ceiling deal to avoid 'catastrophic default'",
    "Negotiators struck a deal ‘in principle’ on the U.S. debt ceiling",
    "‘Nuclear weapons for everyone’ who joins Belarus and Russia, Putin ally promises",
    "Kyiv hit by massive Russian drone attack as city marks its founding",
    "'Succession' finally has a winner, but that was never the point",
    "NBC News / Dan Fine Photography",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Medal of Honor recipient's remains to be buried in Georgia after being identified 73 years later",
    "Authorities search for missing residents in Iowa apartment collapse",
    "Charlotte Area Transit System",
    "Dramatic video captures shootout between Charlotte bus driver and passenger",
    "Arizona mother pleads guilty to murder, child abuse after 6-year-old son died of starvation",
    "Body of escaped inmate found floating in Ohio River in Kentucky, police say",
    "Biden’s student debt plan hangs in balance as major Supreme Court rulings loom",
    "Biden hopes to get re-elected with a little help from his friends",
    "Inside the Florida group pushing to slash food stamp rolls nationwide",
    "‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "Texas House votes to impeach Attorney General Ken Paxton, triggering suspension",
    "President Recep Erdoğan re-elected for unprecedented third term as Turkey's president",
    "Venice police investigating after famed Grand Canal turns bright green",
    "Man faces up to 10 years in prison after arrest for opening plane emergency exit door",
    "South Africa to investigate U.S. allegation of arms shipment to Russia",
    "Memorial Day weekend travel rush hits pre-pandemic levels",
    "Cruise ships reach capacity as demands surges",
    "Portland police using data science to find stolen cars",
    "Family reflects on sister’s Iraq sacrifice nearly 20 years later",
    "Thomas Imo / Photothek via Getty Images",
    "How many people are held in solitary confinement in U.S. prisons and jails? Now there’s a number.",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Saul Loeb / AFP - Getty Images file",
    "Bipartisan agreement reached to avoid debt-limit default, Biden announces",
    "How an outrageous drag queen found mainstream fame in 'The Little Mermaid'",
    "Kevin Mazur / BBMA2017/Getty Images for dcp file",
    "Celine Dion pulls plug on European tour citing ongoing health issues",
    "Tom Hanks delivers commencement speech at Harvard: ‘The truth is sacred’",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "Cancer drug shortage across U.S. has become ‘life-threatening’",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Kevin Frayer / Getty Images",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Jakub Porzycki / NurPhoto via Getty Images",
    "Why are streaming services removing some of their own movies and shows?",
    "Justin Sullivan / Getty Images",
    "Ford EVs will use Tesla charging tech in surprise partnership between rival automakers",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "Daisy Jasmin Estrada Borja",
    "A Latina who's not allowed to wear Mexican American sash at graduation takes legal action",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Fans around the world gather to remember Tina Turner's influence",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "South Dakota governor calls on college board to ban drag shows and eliminate 'preferred pronouns'",
    "Charlie Neibergall / AP file",
    "Iowa Gov. Reynolds signs bill restricting instruction on sexual orientation and gender identity",
    "12-year-old graduates college in California, setting school record",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "Do Not Sell My Personal Information"
]