[
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "Drones strike Moscow in first attack on capital's residential areas since the war began",
    "Putin vows to retaliate for what he said was a Ukrainian attack",
    "NBC News / Getty Images; AP",
    "House to vote on Biden-McCarthy debt ceiling bill days before deadline for default",
    "Live Updates / Rep. Pramila Jayapal says she will vote 'no' on debt deal",
    "What the debt ceiling deal would mean for student loan payments and forgiveness",
    "Ex-CIA officer accused of abusing women may walk free because of how feds searched his phones",
    "Congress threatens to block funding for Space Command HQ as abortion laws impact location decision",
    "Drew Angerer / Getty Images file",
    "House Oversight chair prepares to hold FBI director in contempt over document in Biden probe",
    "Former N.J. Governor Chris Christie to announce his 2024 presidential bid Tuesday",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images file",
    "Republican Rep. Chris Stewart plans to leave Congress",
    "Va. Gov. Glenn Youngkin sends National Guard to southern border",
    "Democrats in Congress reintroduce bill to break down mental health stigmas among Asian Americans",
    "Nevada becomes latest to enhance penalties for election worker intimidation after statewide exodus",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "Cassville Missouri Police / via AP",
    "Body of missing Missouri ER doctor found in Arkansas, family says",
    "GordonBellPhotography / Getty Images / iStockphoto",
    "White man who pulled gun in MLK Day confrontation with Black teens gets probation",
    "Sign with a homophobic slur in front of Florida business sparks backlash",
    "Police identify remains of Arizona woman strangled and left in trunk in Florida in 1969",
    "MLB players say drag troupe invited to Dodgers' Pride Night mocks Christianity",
    "Here are 10 words that will be featured in the African American English Dictionary",
    "North Korean spy satellite launch fails",
    "Chinese jet flew past nose of U.S. plane, Pentagon says",
    "An airline is asking passengers to weigh in before their flights",
    "Young engaged couple shot dead by landlord over tenancy dispute, police say",
    "Dominik Bindl / Getty Images",
    "Al Pacino, 83, is expecting a baby with girlfriend, Noor Alfallah, 29",
    "Ezra Miller won't be recast if there's a sequel to ‘The Flash,’ director says",
    "Vincent Laforet / AFP via Getty Images file",
    "Scottie Pippen says Michael Jordan was 'horrible to play with' on Chicago Bulls",
    "Alec Baldwin receives hip replacement after suffering 'intense chronic pain,' wife says",
    "Harold Perrineau says he was fired from ‘Lost’ after asking for character to have ‘equal depth’",
    "Justine Goode / NBC News / Getty Images",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "The Biden administration quietly eliminated a barrier to medication for opioid addiction",
    "Car flies 120 feet after driving up tow truck ramp at full speed",
    "Could AI lead to human extinction? New warning sparks concern",
    "Air New Zealand announces voluntary weigh-in for passengers",
    "Watch: Chinese fighter jet flies in front of U.S. Air Force aircraft",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "China rejects meeting with Pentagon chief in a setback for U.S. hopes of a thaw",
    "Joel Saget / AFP - Getty Images",
    "AI risks leading humanity to 'extinction,' experts warn",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Charles Manson follower Leslie Van Houten should be paroled, appeals court rules",
    "LGBTQ activists call for new strategies to promote equality after Target backlash",
    "Roy Rochlin / Getty Images file",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Chinese apps remain hugely popular in the U.S. despite efforts to ban TikTok",
    "South_agency / Getty Images",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "El Salvador Presidential Press Office via AP",
    "At least 150 people jailed under El Salvador's emergency powers have died, new report says",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "Jemal Countess / Getty Images",
    "Alabama expands ban on trans athletes to include college teams",
    "Anna Moneymaker / Getty Images file",
    "Michael M. Santiago / Getty Images",
    "12-year-old graduates college in California, setting school record",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Do Not Sell My Personal Information"
]