[
    "Anna Moneymaker / Getty Images",
    "Biden-McCarthy debt ceiling deal approved by key committee ahead of House vote",
    "What the debt ceiling deal would mean for student loan payments and forgiveness",
    "Anti-hunger advocates slam the work requirements for SNAP participants in debt limit bill",
    "Chinese jet flew past nose of U.S. plane, Pentagon says",
    "China rejects meeting with Pentagon chief in a setback for U.S. hopes of a thaw",
    "Elon Musk meets Chinese foreign minister, who calls for ‘mutual respect’ in U.S. relations",
    "Octavio Jones / Getty Images file",
    "Florida elections officials quietly made it easier for Ron DeSantis to fund his 2024 bid",
    "Gusher of cash reshapes GOP presidential contest",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "South_agency / Getty Images",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "Scott Olson / Getty Images",
    "Sergio Flores / Bloomberg via Getty Images",
    "Elizabeth Holmes is booked into Texas prison to begin serving 11-year sentence",
    "Tennessee woman feared missing on trip is located and is safe",
    "Puyallup Police Department",
    "3 young children die in hot cars across the U.S.",
    "Charles Manson follower Leslie Van Houten should be paroled, appeals court rules",
    "Man arrested in the death of New Jersey council member shot and killed in her car",
    "Natalee Holloway case suspect Joran van der Sloot injured in Peruvian prison brawl, lawyer says",
    "Anna Rose Layden / Getty Images",
    "Far-right members, unhappy with debt deal, float threatening McCarthy's speakership",
    "Justice Department via AP file",
    "Jan. 6 rioter who wanted Pelosi brought out to mob is sentenced to 2 years",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "John Bazemore / Pool via AP file",
    "Former first lady Rosalynn Carter is diagnosed with dementia",
    "Alabama expands ban on trans athletes to include college teams",
    "Impeachment trial of Texas AG Ken Paxton to begin no later than Aug. 28",
    "Biden’s student debt plan hangs in balance as major Supreme Court rulings loom",
    "North Korea launches purported ‘space vehicle,’ South Korea says",
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Drones strike Moscow in first attack on capital's residential areas since the war began",
    "Young engaged couple shot dead by landlord over tenancy dispute, police say",
    "Woman knocked unconscious but wins chaotic U.K. race chasing cheese down a hill",
    "Australian man frees his head from the jaws of a crocodile after he's attacked while snorkeling",
    "Japan premier’s son to resign after public outrage over private party at official residence",
    "Uganda enacts harsh anti-LGBTQ law including death penalty",
    "Watch: Chinese fighter jet flies in front of U.S. Air Force aircraft",
    "An inside look at the Wagner Group’s control over the Central African Republic",
    "Carnival passengers share 'nightmare' conditions during rough seas",
    "Venice’s Grand Canal turned green — and no one knows why",
    "NBC News / Getty Images; Golden Patriots Future",
    "‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "'Succession' finally has a winner, but that was never the point",
    "NBC News / Dan Fine Photography",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Jeff Gritchen / Orange County Register via Getty Images file",
    "Marines and group of teens brawl on California pier over Memorial Day weekend, officials say",
    "Joel Saget / AFP - Getty Images",
    "AI risks leading humanity to 'extinction,' experts warn",
    "LGBTQ activists call for new strategies to promote equality after Target backlash",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Lynn Goldsmith / Corbis/VCG via Getty Images file",
    "Third person charged in 2002 killing of hip-hop pioneer Jam Master Jay",
    "Lucy North / Press Association via AP Images",
    "British prank TikToker who went viral for entering stranger's home is in custody",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "El Salvador Presidential Press Office via AP",
    "At least 150 people jailed under El Salvador's emergency powers have died, new report says",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "Ralph Yarl, Black teen shot for ringing the wrong doorbell, walks at brain injury event",
    "Courtesy Mike Lewis of USA Swimm",
    "An Olympian says a drowning experience inspired him to teach children to swim",
    "Guillem Sartorio / Bloomberg via Getty Images file",
    "Michael M. Santiago / Getty Images",
    "12-year-old graduates college in California, setting school record",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Expert-approved travel car seats",
    "Do Not Sell My Personal Information"
]