[
    "Live: Supreme Court decisions",
    "Supreme Court rejects race as a determining factor in college admissions",
    "Jonathan Drake / Reuters / Redux",
    "Just now40m agoAOC criticizes court over affirmative action ruling",
    "Just now41m agoBiden: 'This is not a normal court.'",
    "Just now1h ago'A severe disappointment': Biden on decision",
    "Just now1h agoAttorney General Garland blasts affirmative action ruling",
    "Sotomayor and Jackson write  strong dissents on affirmative action",
    "Biden says colleges 'should not abandon their commitment' to diversity after Supreme Court ruling",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "4 things students need to know now",
    "Amy Sussman / Getty Images file",
    "Civil rights groups blast Supreme Court for sharply curtailing affirmative action",
    "Supreme Court rules for Christian mail carrier who refused to work Sundays",
    "David Gladstone / NBC News",
    "Mike Pence meets with Zelenskyy in surprise trip to Ukraine",
    "Top generals' uncertain fate overshadows Putin's show of public support",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Catherine Powell / Getty Images for CMT file",
    "Country music star Kelsea Ballerini hit in the face during a concert",
    "Concertgoer appears to throw ashes at Pink during performance",
    "Man who threw phone at Bebe Rexha during concert thought 'it would be funny,' police say",
    "Drew Angerer / Getty Images",
    "Chris Christie goes after Ron DeSantis for dodging Jan. 6 question: 'Was he alive that day?'",
    "Samuel Corum / Bloomberg via Getty Images file",
    "For some Republicans who endorsed Biden in 2020, the next election looks bleak",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Manuel Balce Ceneta / AP file",
    "Biden warns top aides against offering him political advice about Hunter",
    "DOJ says law signed by Ron DeSantis limiting Chinese land ownership is unconstitutional",
    "Judges in Kentucky and Tennessee block portions of transgender youth care bans",
    "State Rep. assaulted after attending Eid service with her family in Connecticut",
    "Live updates: Task force will recommend dozens of policies for California reparations",
    "Matt Nighswander / NBC News",
    "Tiffany's flagship store in Manhattan was ablaze following electrical fire, authorities say",
    "Benjamin B. Braun / Pittsburgh Post-Gazette via AP",
    "71 million under heat alerts as smoke from wildfires has 'no end' in sight",
    "Puerto Ricans protest proposed increase to already high electric bills",
    "Families sue Harvard over theft of body parts from morgue",
    "At least 12 have drowned at Florida beaches as rip current continues to plague Panhandle",
    "Utah grief author accused of poisoning her husband sued for over $13M by his sister",
    "Stefano Rellandini / AFP - Getty Images",
    "French police officer faces voluntary homicide charge after teenager's shooting",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "As China crests second Covid wave, families still mourn victims of the first one",
    "Professor and 2 students stabbed in gender issues class at Canadian university",
    "Inflation hits royal finances as King Charles turns down heating to save emissions",
    "chris-mueller / Getty Images/iStockphoto",
    "Pedestrian deaths hit a 41-year high. Reckless driving and bigger cars may be to blame.",
    "Tranq increasingly found in opioid overdose deaths, CDC warns",
    "Science Photo Library - CDC / Getty Images",
    "CDC recommends RSV shots for older adults, clearing the way for vaccinations to begin this fall",
    "Tick and mosquito season is already shaping up to be severe this year",
    "ABC Photo Archives / Disney via Getty Images",
    "'Boy Meets World' stars say Ben Savage 'disappeared' from their lives: 'He ghosted us'",
    "Sthanlee B. Mirador / Sipa USA via AP",
    "Colleen Ballinger responds to allegations with a song",
    "Ethan Miller / Getty Images file",
    "Pete Davidson checks into rehab",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "McDonald's Grimace breaks his silence on TikTok trend",
    "Kelsey Brunner for NBC News",
    "Follow the latest news and conversations at the Aspen Ideas Festival",
    "Just now11m agoSittenfeld’s rise to fame as an author",
    "Just now2h agoNext up: Author Curtis Sittenfeld talks about her latest novel",
    "Just now2h agoVignarajah: Immigration is a politics problem, not a policy problem",
    "Just now2h agoU.S. has a 'lower percentage of immigrants' now than in 1910, Vignarajah says",
    "How to have sensitive conversations about race at Aspen Ideas Festival",
    "Follow full coverage of the Aspen Ideas Festival",
    "Everything you need for a picnic",
    "WindmillFrigidaire; Windmill",
    "6 top-rated air conditioners for 2023",
    "The best products to buy during Prime Day",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "Madonna hospitalized with bacterial infection, postpones tour",
    "Simone Biles to return to competition for the first time since Tokyo",
    "Inside daring effort to rescue Ukrainian children",
    "Delta jet makes emergency landing without nose gear",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Supreme Court strikes down college affirmative action programs",
    "Sean Gardner / Getty Images file",
    "NASCAR driver Jimmie Johnson's in-laws and their grandson are dead in an apparent murder-suicide",
    "Leonardo Munoz / VIEW press / Corbis via Getty Images file",
    "Overstock.com will relaunch Bed Bath & Beyond after buying its IP assets for $21.5 million",
    "Stephanie Keith / Bloomberg via Getty Images file",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "Summer travel season off to rough start amid widespread flight delays",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "A disjointed jet stream has some climate scientists spooked",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "Astronauts' urine and sweat are almost entirely recycled into drinking water with new system",
    "California reparations live updates: Task force will recommend dozens of policies",
    "Timothy D. Easley / AP file",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Key civil rights groups blast Supreme Court for sharply curtailing affirmative action",
    "Do Not Sell My Personal Information"
]