[
    "Supreme Court strikes down college affirmative action programs",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "4 things students need to know now",
    "Al Seib / Los Angeles Times via Getty Images file",
    "California ended affirmative action in the ’90s but retains a diverse student body",
    "Biden says it would be a 'mistake' to try to expand the Supreme Court",
    "Sotomayor and Jackson slam idea that U.S. is 'colorblind'",
    "Chelsea Stahl / NBC News; Getty Images",
    "Medical schools will be even less diverse after affirmative action ruling, experts say",
    "Drew Angerer / Getty Images",
    "Some Asian Americans say affirmative action ruling used the group as ‘pawns’",
    "Courtesy Patrick Tomlinson",
    "The FBI has formed a national database to track and prevent 'swatting'",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "A disjointed jet stream has some climate scientists spooked",
    "Amy Beth Bennett / South Florida Sun-Sentinel via AP, Pool",
    "Ex-Parkland school security officer found not guilty over failure to confront 2018 gunman",
    "32-year-old woman who allegedly posed as Boston high school student faces charges",
    "Benton County Sheriff's Office via Facebook",
    "Missouri woman accused in fatal plot to kidnap pregnant woman is charged in fetus' death",
    "California reparations final report details who's eligible, but no dollar figure set",
    "Man who stole thousands by posing as coin-cashing employee sentenced to prison",
    "Nicaraguan migrant who died in ICE custody had been recommended for release, advocates say",
    "Saul Loeb / AFP via Getty Images file",
    "Hunter Biden settles long-running child support case in Arkansas",
    "Democrats say document from Trump impeachment probe rebuts GOP claims about a Biden bribery scheme",
    "Anatolii Stepanov / AFP - Getty Images",
    "U.S. is considering sending cluster munitions to Ukraine, officials say",
    "Federal judge rejects Trump bid to dismiss E. Jean Carroll defamation claims",
    "People of color have the highest support for gun laws, new study finds",
    "Corey Nickols / Getty Images for IMDb",
    "Transgender influencer Dylan Mulvaney says Bud Light never reached out to her after backlash",
    "Samir Hussein / WireImage via Getty Images file",
    "Travis Scott won't be criminally charged in  Astroworld concert deaths, officials say",
    "Catherine Powell / Getty Images for CMT file",
    "Country music star Kelsea Ballerini hit in the face during a concert",
    "Pepsi introduces Colachup, a ketchup infused with cola",
    "'Boy Meets World' stars say Ben Savage 'disappeared' from their lives: 'He ghosted us'",
    "Pavel Bednyakov / Sputnik via AP file",
    "Putin's stooge or savior: What role did Belarus' leader play in ending the Russian rebellion?",
    "Tobias Schwarz / AFP via Getty Images file",
    "Google says it will remove Canadian news links from searches in the country",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "Mike Pence meets with Zelenskyy in surprise trip to Ukraine",
    "Russian general is believed to be detained in aftermath of Wagner mutiny",
    "Science Photo Library - CDC / Getty Images",
    "CDC recommends RSV shots for older adults, clearing the way for vaccinations to begin this fall",
    "chris-mueller / Getty Images/iStockphoto",
    "Pedestrian deaths hit a 41-year high. Reckless driving and bigger cars may be to blame.",
    "Angela Weiss / AFP - Getty Images",
    "Tranq increasingly found in opioid overdose deaths, CDC warns",
    "Tick and mosquito season is already shaping up to be severe this year",
    "The best products to buy during Prime Day",
    "Everything you need for a picnic",
    "WindmillFrigidaire; Windmill",
    "6 top-rated air conditioners for 2023",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "Sailor rescued after being lost at sea for 34 days",
    "Baker offers sourdough scavenger hunt to his local community",
    "Madonna hospitalized with bacterial infection, postpones tour",
    "Simone Biles to return to competition for the first time since Tokyo",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Paul Daly / The Canadian Press via AP",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "McDonald's Grimace breaks his silence on TikTok trend",
    "Brandon Bell / Getty Images",
    "Ron DeSantis vetoes popular criminal justice bill as he moves to Trump's right",
    "Robyn Beck / AFP via Getty Images file",
    "These retailers will take over Bed Bath & Beyond's 'top-notch' store leases",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Jonathan Drake / Reuters / Redux",
    "Lezlie Sterling / Zuma Press",
    "What’s in the California Reparations Task Force's final report",
    "Christine King Farris, the last living sibling of Martin Luther King Jr., dies at 95",
    "Tasos Katopodis / Getty Images for GLAAD",
    "Kamala Harris slams lawmaking 'extremists' at LGBTQ Pride event",
    "Timothy D. Easley / AP file",
    "Judges in Kentucky and Tennessee block parts of transgender youth care bans",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Seth Herald / Getty Images",
    "Do Not Sell My Personal Information"
]