[
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Trump explores messing with the first GOP debate",
    "The 'lesser of two evils' voters who could decide 2024",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Biden says Putin was weakened by Yevgeny Prigozhin's revolt",
    "Frazer Harrison / Getty Images file",
    "Madonna pauses tour after hospitalization for 'serious bacterial infection'",
    "Brandon Bell / Getty Images",
    "Ron DeSantis vetoes popular criminal justice bill as he moves to Trump's right",
    "Ron DeSantis pushes for the federal Disney trial to start after the presidential election",
    "Joe Burbank / Orlando Sentinel via Getty Images file",
    "Passenger rescued after falling off 10th deck of cruise ship, Coast Guard says",
    "Canadian wildfire smoke blankets parts of U.S. as others face severe heat and storms",
    "Just now42m agoFrom Chicago to Minnesota officials warn about air quality",
    "Just now1h agoSmoke from Canada wildfires increasing health risks in Black, poorer US communities",
    "Just now2h agoN.C. health officials urge precaution against heat",
    "Just now2h agoAn intensifying heat wave",
    "Kena Betancur / Getty Images",
    "Summer travel season off to rough start amid widespread flight delays",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Stewart  F. House / Getty Images",
    "Body camera footage from Allen, Texas, mall shooting shows officer chase and kill gunman",
    "Daniel Penny pleads not guilty in NYC subway chokehold death of Jordan Neely",
    "Delta flight makes emergency landing without nose gear after malfunction",
    "Laurence Griffiths / Getty Images",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "NASCAR driver Jimmie Johnson's in-laws and their grandson are dead in an apparent murder-suicide",
    "Astronauts' urine and sweat is almost entirely recycled into drinking water with new system",
    "Accused Boston serial rapist facing new charges of rape and assault",
    "Owen Berg / NBC News / Getty Images",
    "Liberal wins at the Supreme Court may prove to be fleeting",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Brendan Smialowski  / AFP - Getty Images",
    "Have you heard the one about the old president? Well, Biden has a joke for you",
    "Luiz C. Ribeiro / Tribune News Service via Getty Images file",
    "Trump sues E. Jean Carroll, claims she defamed him on television",
    "Patrick Semansky / AP file",
    "Former Trump lawyer Rudy Giuliani interviewed in special counsel's election probe",
    "Biden ribs GOP Sen. Tommy Tuberville for touting broadband funds he voted against",
    "Biden pushes vision for economic growth 'from the middle out and bottom up'",
    "This Democrat has led an anti-gun violence group in Congress for a decade. Now some want a change.",
    "Laurie Dieffembacq / Belga/Sipa USA via AP file",
    "Anheuser-Busch CEO says his company will continue to support the LGBTQ community",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "Google distances itself from company-sponsored drag show following employee petition",
    "After 27 tries, Chinese millionaire considers giving up on college entrance exam",
    "Genya Savilov / AFP - Getty Images",
    "3 children among 9 dead after Russian missile slams into pizza restaurant",
    "Archaeological Park of Pompeii via AFP - Getty Images",
    "Pie in the sky! A wall painting found in Pompeii doesn't depict Italy’s iconic dish",
    "Millions become a year or two younger as South Korea scraps traditional way of counting age",
    "Unrest after police shooting of teenager prompts France to heighten security",
    "Tick and mosquito season is already shaping up to be severe this year",
    "AntonioGuillem / Getty Images / iStockphoto",
    "Have a summer cold? Common viruses are back from a pandemic hiatus",
    "Spencer Platt / Getty Images",
    "What to know about the health risks of wildfire smoke",
    "Pregnant workers may get new protections and accommodations as new law takes effect",
    "CDC issues alert after 5 cases of locally acquired malaria reported in Texas and Florida",
    "Weiss Eubanks / NBCU Photo Bank via Getty Images file",
    "Chrissy Teigen and John Legend welcome baby No. 4",
    "Francois Nel / Getty Images file",
    "Australian teen becomes first female to pull off Tony Hawk's famed '720' skateboard maneuver",
    "McDonald's Grimace breaks his silence on TikTok trend",
    "'Superman: Legacy' casts David Corenswet as Clark Kent and Rachel Brosnahan as Lois Lane",
    "Dwyane Wade says his daughter physically hid from him when she came out to the family",
    "Kelsey Brunner for NBC News",
    "Follow the latest news and conversations at the Aspen Ideas Festival",
    "Just now9m agoUp next on the blog: The Dilemmas of Hostage Diplomacy",
    "Just now31m agoWealth inequality is now as wide as it was during the Gilded Age",
    "Just now42m agoThe bottom line for corporations on socially conscious issues",
    "Just now1h agoBroadly speaking, 'banks are in great shape,' Wells Fargo chief says",
    "Tom Llamas in conversation with leaders inspiring America",
    "Follow full coverage of the Aspen Ideas Festival",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Delta jet makes emergency landing without nose gear",
    "Watch: Chimpanzee is awestruck after seeing open sky after 28 years in a cage",
    "Global outrage after tourist carves names into Rome's Colosseum",
    "Ryan Seacrest to take over for Pat Sajak on ‘Wheel of Fortune’",
    "Erik McGregor / LightRocket via Getty Images",
    "Sarah L. Voisin / The Washington Post via Getty Images file",
    "Supreme Court deals a blow to Trump ally John Eastman's 2020 election theory",
    "Arkady Budnitsky / Anadolu Agency via Getty Images",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Thomas Simonetti / The Washington Post via Getty Images file",
    "Supreme Court rules for online stalker convicted of making 'true threats'",
    "Kent Nishimura / Los Angeles Times via Getty Images",
    "Supreme Court rules against giving state legislatures unchecked control over federal elections",
    "Denise Truscello / Getty Images for iHeartMedia file",
    "Ryan Seacrest will succeed Pat Sajak as host of 'Wheel of Fortune'",
    "Judge in Trump docs case denies special counsel's request to keep 84 witnesses secret",
    "Blistering heat grips the South and puts Texas under triple-digit temperatures",
    "Dolphin moms use 'baby talk' with their newborns, research shows",
    "For California marine mammals, toxic algae bloom is a mass casualty incident",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "Mexico Instituto Nacional de Migracion",
    "Bus of migrants help mother give birth before being detained in Mexico",
    "Alberto Ortega / Europa Press via Getty Images file",
    "Spanish Royal Academy rejects changing  language to anti-colonial ‘Ñamericano’",
    "Stefani Reynolds / Bloomberg via Getty Images file",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Brandon Bell / Getty Images file",
    "A 2013 Supreme Court decision invited widespread voter suppression laws, experts say",
    "Justine Good4 / NBC News; Getty Images / AP",
    "What to know about California's highly anticipated reparations proposal",
    "Angela Weiss / AFP via Getty Images file",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Chris Delmas / AFP via Getty Images file",
    "Michelle Yeoh and Chadwick Boseman are honored with Walk of Fame stars",
    "Lev Radin / Sipa via AP file",
    "NYC makes Diwali an official school holiday, but there’s a catch this year",
    "Do Not Sell My Personal Information"
]