[
    "New York City's newest weed dispensary opens with a Black woman at its helm",
    "Samuel Corum / Getty Images fileSamuel Corum / Getty Images",
    "Live Updates: Debt ceiling",
    "Biden won't use 14th Amendment to raise the debt limit, Treasury official says",
    "What will happen if the U.S. hits the debt ceiling?",
    "'We're not there yet': Debt ceiling talks still stuck on federal spending levels",
    "U.S. District Court for Washington, D.C.",
    "Self-proclaimed 'idiot' Oath Keeper sentenced to more than 8 years in Jan. 6 case",
    "Oath Keepers founder gets 18 years in longest Jan. 6 sentencing yet",
    "James Borchuck / Tampa Bay Times via AP file",
    "Ex-ice cream truck driver who killed 2 brothers in mistaken identity case sentenced to life",
    "Trump dominating 2024 endorsement race, DeSantis' launch generates little movement",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "U.S. Virgin Islands Dept. of Justice",
    "John Carrington / Atlanta Journal-Constitution via AP",
    "Georgia father won't face a retrial over murder charges in child's hot car death",
    "Chicago woman, 64, was beaten while struggling with gunman who stole her French bulldog",
    "South Carolina school bus crash sends 18 people including several students to hospital",
    "Gusher of cash reshapes GOP presidential contest",
    "Alex Brandon / AP fileAP file",
    "Republicans brace for 2022 losers to take another crack at winning",
    "A North Dakota governor running for president? You betcha",
    "Ron DeSantis says he would consider presidential pardons for Jan. 6 rioters",
    "A tree felled in a storm leaves a nation mourning a 'great loss'",
    "Sergey Bobok / AFP - Getty Images",
    "Who are the anti-Putin groups behind the dramatic raid into Russia?",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Passenger opens plane door during flight in South Korea",
    "Pope Francis skipped audiences because of a fever, Vatican says",
    "Kevin Mazur / BBMA2017/Getty Images for dcp file",
    "Celine Dion pulls plug on European tour citing ongoing health issues",
    "Bettmann Archive / Getty Images",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Tom Hanks delivers commencement speech at Harvard: ‘The truth is sacred’",
    "On TikTok, there's always a new 'girl' aesthetic",
    "Plane lands safely after emergency door opened mid-flight",
    "Historic ‘Cotton Tree’ symbolizing Sierra Leone’s freedom falls during rainstorm",
    "Watch: Killer whale attack caught on camera near Morocco",
    "Hundreds of animals relocated to sanctuaries after Puerto Rico's only zoo closes",
    "Hannah Rappleye / NBC News",
    "Months after residents sound the alarm, Pennsylvania 'cracks' down on Shell plant",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "National Institute of Allergy and Infectious Diseases via AP",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "China faces a new Covid wave that could peak at 65 million cases a week",
    "Scott Olson; Jim Watson / Getty Images",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Justin Sullivan / Getty Images",
    "Ford EVs will use Tesla charging tech in surprise partnership between rival automakers",
    "Justin Sullivan / Getty Images file",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Cuba's rural towns are hit hard with fuel shortages",
    "Fans around the world gather to remember Tina Turner's influence",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "George Wood / Getty Images file",
    "New British Cycling rules bar transgender women from competing in elite female events",
    "Parker Seibold / The Gazette via AP file",
    "After Club Q shooting, New York woman accused of threats to Colorado LGBTQ businesses",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "After being wrongfully accused of spying for China, professor wins appeal to sue the government",
    "Amanda Edwards / Getty Images file",
    "After a year of long overdue Hollywood love, actor James Hong is still having his moment",
    "Memorial Day mattress and bedding sales to shop",
    "The best Memorial Day sales to shop now",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "7 best Amazon gaming week deals",
    "The best sunscreens for oily skin",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "Do Not Sell My Personal Information"
]