[
    "J. Scott Applewhite / AP fileKent Nishimura / Los Angeles Times via Getty Images file",
    "Republicans angry with McCarthy over debt deal join Democrats to block gas stove bills",
    "Far-right members, unhappy with debt deal, float threatening McCarthy's speakership",
    "Detroit housing court reopens with big changes and fears of more evictions",
    "Tough immigration policies are making it harder to build new homes",
    "Ethan Miller / Getty Images file",
    "Pete Davidson has 'no idea what's going on' with the Staten Island ferry he bought",
    "Spencer Platt / Getty Images",
    "How poor air quality hurts your health",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "2023 Planet Labs PBC/AFP via Getty Images",
    "Why the destruction of Ukraine's Kakhovka dam could be so serious",
    "Live Updates /  Up to 70 towns and cities will be flooded due to dam break, Zelenskyy says",
    "Ukraine accuses Russia of blowing up major dam",
    "Brendan Smialowski / AFP via Getty Images",
    "Chris Christie jumps into the 2024 GOP presidential race",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "Judge agrees to unseal names of those who helped George Santos make bond",
    "Michele Eve Sandberg / AFP via Getty Images file",
    "Appeals court rules that people convicted of nonviolent crimes can own guns",
    "Stephanie Keith / Getty Images",
    "Trump seeks to stop second E. Jean Carroll lawsuit",
    "Billionaire Harlan Crow's lawyer agrees to speak with Senate panel probing Clarence Thomas gifts",
    "Nation's largest LGBTQ advocacy group declares state of emergency",
    "Maine election officials say No Labels may be misleading voters in its third-party push",
    "PGA and Saudi-backed LIV merge in stunning end to bitter golf rivalry",
    "Boppy’s recalled infant lounger is now linked to at least 10 deaths",
    "Gary Coronado / Los Angeles Times via Getty Images file",
    "Two California lakes are making comebacks with different results",
    "High school athlete stabbed 15 times by her ex while leaving a restaurant, Florida officials say",
    "Parallel reparations efforts gain momentum in California and Capitol Hill",
    "Atlanta lawmakers approve funds for police training center despite fierce opposition",
    "Robyn Beck / AFP - Getty Images",
    "Oregon breakaway effort is down to just 8 votes, deepening urban-rural divide",
    "Prince Harry says tabloids have ‘blood on their hands’ in historic testimony",
    "Lise Aserud / AFP - Getty Images",
    "Antony Blinken to embark on high-stakes trip to China",
    "Britain’s Princess Eugenie gives birth to her second son",
    "In Mexico's most populous state, a party ends an almost 100-year dominance",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Justin Sullivan / Getty Images",
    "Apple’s entry into VR is a ‘watershed moment,’ say top industry execs",
    "Juliette Michel / AFP via Getty Images file",
    "Boeing warns new defect on 787 Dreamliners will slow deliveries",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "SEC sues Coinbase over exchange and staking programs",
    "Leila Register / NBC News; Bravo",
    "Shanna Madison / Chicago Tribune via ZUMA Press Wire",
    "Taylor Swift accidentally swallows a bug during Eras Tour concert",
    "Alec Tabak / The Daily News via AP file",
    "Cuba Gooding Jr. settles lawsuit that accused him of rape, avoiding N.Y. trial",
    "Elliot Page reveals secret romance with Kate Mara in 'Pageboy' memoir",
    "Brazilian Astrud Gilberto, who sang 'The Girl from Ipanema' is dead at 83",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Prince Harry takes the stand in suit against British tabloid",
    "Apple unveils headset that blends real and digital world",
    "Video reportedly shows flooding in the town of Nova Kakhovka after dam wall breach",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Nova Scotia Government via AFP - Getty Images",
    "Chandan Khanna / AFP - Getty Images file",
    "Trump asks 'How can DOJ possibly charge me' after his lawyers meet with feds",
    "Calls for woman's arrest grow after the fatal shooting of her neighbor in Florida",
    "Kentaro Aoyama / AP file/NBC News",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "To ease cancer drug shortage, FDA will allow imports from China",
    "A gluten-free food makes a comeback in Cuba — and seeks world recognition",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Ingo Barth / ullstein bild via Getty Images file",
    "Is 'Latino' the most misunderstood term?",
    "Ron DeSantis attacks Trump on immigration: ‘This is a different guy’ than in 2016",
    "Jeff Kowalski / AFP via Getty Images file",
    "Increases in Black unemployment are especially dire for Black women, experts say",
    "Tom Williams / CQ-Roll Call via Getty Images file",
    "Tayfun Coskun / Anadolu Agency via Getty Images file",
    "Cornel West announces his presidential campaign",
    "Ricardo Ramirez Buxeda / Orlando Sentinel",
    "Alejandro Alvarez / Sipa USA via AP",
    "Police investigate alleged pellet gun shooting outside Kansas City LGBTQ bar",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "May reader favorites: Sunscreens, deodorants and more",
    "Courtesy Annie Shigo; Fable; Wild One",
    "18 must-have products for new puppy parents",
    "15 Amazon tools that'll make your garden flourish",
    "6 best instant cameras of 2023",
    "What experts want you to know about dog food",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do Not Sell My Personal Information"
]