[
    "AP; Getty ImagesJulie Jacobson / AP",
    "Wildfire smoke blanketing Northeast likely won’t improve tomorrow, forecasters warn",
    "NYC's air quality sinks to worst in the world",
    "What to know about the health risks of wildfire smoke",
    "Trump ally Bannon subpoenaed in special counsel Jack Smith's Jan. 6 grand jury probe",
    "Live Updates / Trump says he hasn't been told about a federal indictment",
    "John Moore / Getty Images file",
    "Child labor investigation spreads to meatpacking, produce companies in 11 states",
    "Marion County Sheriff's Office",
    "Woman arrested in fatal shooting of her neighbor in Florida",
    "Sean Drakes / Getty Images file",
    "Pride organizers scramble to keep up with drag laws in Florida, Montana and Tennessee",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Sarah Silbiger / Bloomberg via Getty Images file",
    "Conservatives bring the House to a halt as anger at McCarthy's debt deal remains",
    "How Ron DeSantis found a home in Florida’s swamp",
    "Noel Vasquez / Getty Images file",
    "DOJ charges ‘Bob’s Burgers,’ ‘Arrested Development’ actor in Jan. 6 Capitol riot",
    "Drew Angerer / Getty Images file",
    "Mike Pence rips Trump as he launches his 2024 GOP presidential bid",
    "North Dakota Gov. Doug Burgum launches his 2024 GOP presidential campaign",
    "Debt limit law sets up 'enormous' stakes for the 2024 election",
    "Julian Finney / Getty Images",
    "Paramount / Courtesy Everett Collection",
    "Franklin County Sheriff's Office",
    "Man, 67, pleads guilty to strangling and dumping body of Missouri woman 3 decades ago",
    "Courtesy Jackson-Smith Family",
    "Father and son killed and 5 injured in shooting after high school graduation at VCU",
    "Black man shot in the mouth by Mississippi deputy to file federal civil rights lawsuit",
    "‘I was appalled’: Michigan legislators aim to address education crisis affecting vulnerable youths",
    "Kevin Mazur / Getty Images",
    "Chris Licht out at CNN after tumultuous run as CEO",
    "Chris Trotman / LIV Golf / Getty Images",
    "Here's why the PGA Tour just merged with LIV Golf",
    "Image Source / Getty Images",
    "Apple to stop autocorrecting swear word to 'ducking' on iPhone",
    "SEC’s crypto crackdown unlikely to affect traders in near term but could transform the industry",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Muhammed Enes Yildirim / Anadolu Agency via Getty Images",
    "What could the Ukraine dam disaster mean for Russia's war?",
    "Ulises Ruiz / AFP via Getty Images file",
    "8 young workers at drug cartel call center killed, bodies placed in bags",
    "James D. Morgan / Getty Images file",
    "U.S.-bound passengers stranded in Siberia after flight makes emergency landing",
    "Pope Francis emerges from 3-hour abdominal surgery without complications",
    "John Salangsang / Invision for American Humane/AP file",
    "Shannen Doherty reveals breast cancer has spread to her brain in emotional post",
    "Neilson Barnard / Getty Images for GQ file",
    "The Iron Sheik, pro wrestling legend and social media star, dies at 81",
    "J.C. Leyendecker / National Museum of American Illustration",
    "How one of America's most famous illustrators brought homoerotic ads to the masses",
    "Jim Hines, 1968 Olympic 100-meter champion and NFL wide receiver, dies at 76",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "US skies filled with haze from Canada wildfires",
    "Prince Harry testifies in phone-hacking lawsuit against UK tabloid",
    "Iconic Paris sites get ready to take center stage for 2024 Olympics",
    "Robyn Beck / AFP - Getty Images",
    "Oregon breakaway effort is down to just 8 votes, deepening urban-rural divide",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Gary Coronado / Los Angeles Times via Getty Images file",
    "Two California lakes are making comebacks with different results",
    "High school athlete stabbed 15 times by her ex while leaving a restaurant, Florida officials say",
    "Spencer Platt / Getty Images",
    "Dimitrios Kambouris / Getty Images file",
    "Is it safe to exercise outdoors when the air quality is poor?",
    "Matthew Lloyd / Getty Images / iStockphoto",
    "More kids and teens are getting anxiety medication without therapy, report finds",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Florida confirms it arranged recent migrant flights to California",
    "James MacDonald / Bloomberg via Getty Images",
    "Black residents of Detroit brace themselves for rougher air quality conditions",
    "Racist message, dead raccoon left for Oregon mayor, Black city council member",
    "Missouri governor signs bill banning transgender care for minors, some adults",
    "Congressman honors drag icon RuPaul on the House floor",
    "Pride flag burned outside a City Hall in Arizona",
    "Timothy A. Clary / AFP - Getty Images",
    "Asians in the U.S. say air quality ‘feels dangerously like home’",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "The best pimple patches for breakouts",
    "Where to find a KN95 mask right now",
    "TheraGun; Ooni; Vivian Le / NBC News",
    "22 best Father's Day gifts of 2023",
    "Songsak rohprasit / Getty Images",
    "Where to find NIOSH-approved N95 masks right now",
    "Kara Birnbaum/ NBC News; Vivian Le/ NBC News",
    "12 best pair hair removers of 2023",
    "9 new products launching in June",
    "May reader favorites: Sunscreens, deodorants and more",
    "Do Not Sell My Personal Information"
]