[
    "AP; AFP; Anadolu; Getty Images",
    "Floating mines add to fears as thousands flee Ukraine flooding",
    "Why the destruction of Ukraine's Kakhovka dam could be so serious",
    "Ukraine accuses Russia of blowing up major dam",
    "Alex Brandon / AP fileAlex Brandon / AP",
    "Mike Pence launches his 2024 GOP presidential bid",
    "Chris Christie jumps into the 2024 GOP presidential race",
    "Anadolu; AFP; AP; Getty ImagesEd Jones / AFP - Getty Images",
    "Photos show New York haze caused by Canadian wildfire smoke",
    "Live Updates / Millions in eastern U.S. face unhealthy air conditions from Canada wildfire smoke",
    "What to know about the health risks of wildfire smoke",
    "Father and son killed and 5 injured in shooting after high school graduation at VCU",
    "Gary Coronado / Los Angeles Times via Getty Images file",
    "Two California lakes are making comebacks with different results",
    "Marion County Sheriff's Office",
    "Woman arrested in fatal shooting of her neighbor in Florida",
    "Detroit housing court reopens with big changes and fears of more evictions",
    "High school athlete stabbed 15 times by her ex while leaving a restaurant, Florida officials say",
    "Debt limit law sets up 'enormous' stakes for the 2024 election",
    "How Ron DeSantis found a home in Florida’s swamp",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "New Supreme Court financial reports set for release amid increased ethics scrutiny",
    "Department of Justice via AP",
    "Secret Service agents have testified in Trump classified documents probe",
    "Republicans angry with McCarthy over debt deal join Democrats to block gas stove bills",
    "Gavin Newsom: Florida officials committed crimes sending migrants to California",
    "Giuliani denies claims he coerced woman to have sex, says she's trying to stir 'media frenzy'",
    "Andreas Solaro / AFP - Getty Images",
    "Pope Francis to undergo intestinal surgery and will be hospitalized for several days",
    "Prince Harry says tabloids have ‘blood on their hands’ in historic testimony",
    "Antony Blinken to embark on high-stakes trip to China",
    "Britain’s Princess Eugenie gives birth to her second son",
    "Chris Trotman / LIV Golf / Getty Images",
    "Here's why the PGA Tour just merged with LIV Golf",
    "Greg Baker / AFP via Getty Images file",
    "Apple to stop autocorrecting swear word to 'ducking' on iPhone",
    "Michael Nagle / Bloomberg via Getty Images file",
    "SEC’s crypto crackdown unlikely to affect traders in near term but could transform the industry",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Apple’s entry into VR is a ‘watershed moment,’ say top industry execs",
    "J.C. Leyendecker / National Museum of American Illustration",
    "How one of America's most famous illustrators brought homoerotic ads to the masses",
    "Tony Korody / Sygma via Getty Images file",
    "Françoise Gilot, celebrated painter who loved and later left Picasso, dies at 101",
    "Leila Register / NBC News; Bravo",
    "Pete Davidson has 'no idea what's going on' with the Staten Island ferry he bought",
    "Taylor Swift accidentally swallows a bug during Eras Tour concert",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Meet the hiker dreaming up the 14,000-mile American Perimeter Trail",
    "Job seekers speak out about pulled employment offers",
    "Prince Harry takes the stand in suit against British tabloid",
    "Robyn Beck / AFP - Getty Images",
    "Oregon breakaway effort is down to just 8 votes, deepening urban-rural divide",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Ed Jones / AFP - Getty Images",
    "Matthew Lloyd / Getty Images / iStockphoto",
    "More kids and teens are getting anxiety medication without therapy, report finds",
    "Spencer Platt / Getty Images",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "To ease cancer drug shortage, FDA will allow imports from China",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Florida confirms it arranged recent migrant flights to California",
    "Jose A. Iglesias / Miami Herald/TNS via Getty Images",
    "Republican legislators who backed DeSantis immigration law appear to downplay its potential impact",
    "Ingo Barth / ullstein bild via Getty Images file",
    "Brazilian Astrud Gilberto, who sang 'The Girl From Ipanema,' is dead at 83",
    "Jeff Kowalski / AFP via Getty Images file",
    "Black women are bearing the brunt of an increase in Black unemployment, data shows",
    "Tom Williams / CQ-Roll Call via Getty Images file",
    "Parallel reparations efforts gain momentum in California and Capitol Hill",
    "Calls for woman's arrest grow after the fatal shooting of her neighbor in Florida",
    "Tayfun Coskun / Anadolu Agency via Getty Images file",
    "Cornel West announces his presidential campaign",
    "Ricardo Ramirez Buxeda / Orlando Sentinel",
    "Alejandro Alvarez / Sipa USA via AP",
    "Nation's largest LGBTQ advocacy group declares state of emergency",
    "Elliot Page reveals secret romance with Kate Mara in 'Pageboy' memoir",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Kara Birnbaum/ NBC News; Vivian Le/ NBC News",
    "12 best pair hair removers of 2023",
    "9 new products launching in June",
    "May reader favorites: Sunscreens, deodorants and more",
    "Courtesy Annie Shigo; Fable; Wild One",
    "18 must-have products for new puppy parents",
    "15 Amazon tools that'll make your garden flourish",
    "6 best instant cameras of 2023",
    "What experts want you to know about dog food",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Do Not Sell My Personal Information"
]