[
    "DEVELOPING: Read the full indictment in the Trump classified documents case",
    "Trump aide Walt Nauta also indicted in classified documents case",
    "Just now2m agoBiden says he hasn't spoken to Garland",
    "Just now5m agoTrump alleged to have asked his attorney to hide or destroy subpoenaed documents",
    "Just now10m agoTrump faces 37 counts on seven charges",
    "Coverage of Trump classified documents indictment",
    "Brendan Smialowski / AFP via Getty Images file",
    "Read the full federal indictment in the Trump classified documents case",
    "Donald Trump's trial is a test of the nation",
    "Brendan Smialowski / AFP - Getty Images",
    "Trump tries to make his own criminal indictment about Joe Biden",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump allies say Biden is 'weaponizing' DOJ against his chief 2024 rival",
    "Few of Trump's rivals challenge him after the federal indictment",
    "AFP; AP; Bloomberg; Getty Images",
    "U.S. sees reprieve from smoky haze, but Canadian wildfires are still raging",
    "Interpol Peru / AFP - Getty Images",
    "Austin L. Miller / Ocala Star-Banner / USA Today Network",
    "Florida woman accused of fatally shooting her neighbor is granted bond",
    "HCA Florida Pasadena Hospital",
    "Florida man nearly loses leg to flesh-eating disease after getting bitten in a family brawl",
    "L.E. Baskow / Las Vegas Review-Journal",
    "The Pentagon's ban on drag shows has upset both supporters and opponents",
    "Acclaimed Cleveland school dance teacher gets life in prison for raping students",
    "The cause of Colorado's most destructive wildfire ever revealed",
    "Casey White, Alabama inmate who escaped prison with help from jail official, sentenced to life",
    "Chip Somodevilla / Getty Images",
    "Biden to attend first 2024 rally in Pa. next week, as campaign plots flurry of fundraising",
    "Joseph Prezioso / AFP via Getty Images file",
    "Ron DeSantis’ top aide organized government staff to solicit campaign cash from lobbyists",
    "Iowa couple behind landmark same-sex marriage ruling worries about the future",
    "FBI arrests businessman linked to impeachment of Texas AG Ken Paxton",
    "Seismic activity adds to evidence that explosion caused Ukraine dam collapse",
    "Ukraine sends Western tanks into battle for the first time to bolster counteroffensive",
    "Sergei Supinsky / AFP - Getty Images",
    "Iran helping Moscow to build drone factory in Russia, U.S. says",
    "Fred Dufour / AFP via Getty Images file",
    "Thousands evacuated in China’s Tianjin after cracks appear near high-rises",
    "Italy’s Berlusconi in hospital for leukaemia scheduled checks",
    "Man mauled to death by tiger shark off Egypt’s Red Sea coast",
    "Russia to deploy tactical nuclear weapons in Belarus in July, Putin says",
    "He's Baby Gronk. She's Livvy. He's got drip and she rizzed him up (and we've got it translated)",
    "Courtesy of Pop. 87 Productions / Focus Features",
    "Bryan Cranston says he plans to retire from acting in 2026",
    "‘Chicago Fire’ star Daniel Kyri is thriving in his ‘unapologetic era’",
    "The movie version behind one of our favorite spicy snacks is streaming now",
    "A Tony nominee details his journey from the South Bronx to Broadway",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "13-year-old shark attack survivor invited to tag sharks",
    "Brides share why they wore their wedding dresses out of the town",
    "NFL legends give rookies advice ahead of new football season",
    "Wrinkles and trouble sleeping are among the strange symptoms poor air quality can cause",
    "Golf's PGA Tour and LIV merger is the latest power play by Saudi Arabia",
    "Jason Davis / Getty Images file",
    "Alex Kent / Bloomberg via Getty Images",
    "Delivery workers say they don't have a choice but to ignore health guidance about the smoke",
    "Live updates: Trump classified documents indictment is unsealed",
    "Nathan Howard / Bloomberg via Getty Images file",
    "Home foreclosures are rising nationwide, with Florida, California and Texas in the lead",
    "Drew Angerer / Getty Images file",
    "Trump indicted on 7 charges in classified docs probe",
    "White House Covid response coordinator Ashish Jha to step down",
    "Earl S. Cryer / AFP via Getty Images file",
    "Taurine, a nutrient found in high-protein foods, slows aging in animals — and maybe humans, too",
    "FDA panel recommends injectable drug to prevent RSV in infants",
    "GM’s electric vehicles will gain access to Tesla’s vast charging network",
    "Los Angeles county DA's office quits Twitter due to barrage of 'vicious' homophobic attacks",
    "Angela Weiss / AFP - Getty Images",
    "How New York's day of smoke laid bare the realities of climate catastrophe",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Rebecca Blackwell / AP file",
    "Here comes El Niño: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Two California lakes are making comebacks with different results",
    "Colombia and its largest remaining rebel group agree to a cease-fire at talks in Cuba",
    "Courtesy Searchlight Pictures via YouTube",
    "Dia Dipasupil / Getty Images file",
    "Vaughn Ridley / Getty Images",
    "Blue Jays cut pitcher Anthony Bass after latest anti-LGBTQ comments",
    "J. Scott Applewhite / AP file",
    "Korean American judicial nominee shares her adoption and immigration journey with Senate committee",
    "19-year-old Ph.D. started community college when he was 7",
    "Dickson Lee / South China Morning Post via Getty Images file",
    "YouTube channel Wong Fu Productions reflects on 20 years of Asian American storytelling",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "CasarsaGuru / Getty Images",
    "The best cat foods to buy, according to experts",
    "The 12 best toothpastes in 2023, according to dentists",
    "Cabana Life; Ruffle Butts; Athleta",
    "Top-rated UPF swimwear for sun protection",
    "Our predictions for Prime Day 2023",
    "18 best Father's Day gifts on Amazon",
    "What causes rosacea? Derms explain.",
    "11 best women's walking shoes in 2023",
    "The 9 best BBQ smokers for summer 2023",
    "No central air? No problem thanks to these portable ACs.",
    "Do Not Sell My Personal Information"
]