[
    "Getty Images / iStockphoto",
    "U.S. government says several agencies hacked as part of broader cyberattack",
    "Software vulnerability exploited in cyberattack on federal government agencies, official says",
    "Allison V. Smith for The New York Times via Redux file",
    "Supreme Court delivers win for Native American tribes in adoption case",
    "Tracking major Supreme Court cases",
    "Kevin Mazur / Getty Images for Parkwood file",
    "Beyoncé shows blamed for fueling inflation in Sweden",
    "Beyoncé tickets in the U.S. are so expensive that some fans are flying to Europe instead",
    "Jonathan Ferrey / LIV Golf via Getty Images file",
    "Sen. Wyden launches probe into PGA Tour's merger with Saudi-funded LIV Golf",
    "Golf's PGA Tour and LIV merger is the latest power play by Saudi Arabia",
    "Justine Goode / NBC News; Getty Images",
    "How women broke barriers in the hip-hop fashion industry",
    "50 Years Fly: The Rise, Fall and Revolution of Hip-Hop Fashion",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images file",
    "Key Republican deals a blow to House Democrats’ new push for tougher gun laws",
    "'Stop pussyfooting around': Ron DeSantis questions why Gavin Newsom won’t challenge Biden",
    "DACA court challenges leave hundreds of thousands of eligible applicants out",
    "Chip Somodevilla / Getty Images",
    "Would Republicans support Trump in 2024 if he's convicted of crimes? They're split",
    "House blocks Republican effort to censure Democratic Rep. Adam Schiff",
    "Fox News says graphic calling Biden a 'wannabe dictator' has been 'addressed'",
    "David Zalubowski / AP file",
    "Suspect in mass shooting at Colorado gay nightclub is expected to take a plea deal",
    "Man charged in fatal stabbing of New York City subway rider",
    "Chicago woman who went missing while traveling in Japan has been found",
    "Florida set to execute man convicted of 2 murders and rapes in 1984",
    "Pregnant woman fatally shot in car at Seattle intersection",
    "More than 4,000 ads for Ozempic-style drugs were found running on Instagram and Facebook",
    "Women, people of color make solid gains in corporate board representation",
    "Tayfun Coskun / Anadolu Agency via Getty Images",
    "Twitter is the 'most dangerous' major social media platform for LGBTQ users, GLAAD says",
    "Musk and Dorsey criticize Apple over its treatment of a social media app that allows bitcoin tips",
    "Russia will lose the war if Ukraine's counteroffensive succeeds, Zelenskyy says",
    "Frank Rumpenhorst /  dpa via AP",
    "American man pushed 2 U.S. tourists into ravine at German castle, killing one woman",
    "Courtesy Everett Collection",
    "Two-time Oscar winner and lawmaker Glenda Jackson dies at 87",
    "Bill Gates visits China as leaders try to revive foreign business interest",
    "Boris Johnson deliberately misled Parliament over 'partygate,' probe finds",
    "Charley Gallay / Getty Images for Disney",
    "Ke Huy Quan surprises Harrison Ford on 'Indiana Jones' red carpet",
    "Shannen Doherty shares video before surgery to remove tumor from her head: 'I am petrified'",
    "Arturo Holmes / FilmMagic file",
    "Kevin Costner says his estranged wife will not move out of his house amid divorce",
    "Before dying of pregnancy complications, Tori Bowie was excited to become a mom",
    "Anita Baker kicks Babyface off her tour over what she says are his fans' cyberbullying",
    "How to avoid phone scams that use AI-voice cloning",
    "Biden pushes for end to junk fees that catch consumers by surprise",
    "What is Berberine and why is it being called 'nature's Ozempic'?",
    "See 21-year-old solve Rubik's cube in mind-boggling record time!",
    "NBC News; Getty Images; Courtesy Libero Copper & Gold",
    "A powerful U.S. political family is linked to copper mining in the Colombian rainforest",
    "Republicans privately acknowledge Trump's legal woes are serious this time",
    "Tentative deal reached to get UPS drivers air-conditioned trucks ahead of strike threat",
    "Mario Tama / Getty Images file",
    "Inflation is finally slowing down, but consumers are still feeling the sting of high prices",
    "Justin Sullivan / Getty Images",
    "2 Americans found dead in hotel room in Mexico's Baja California Sur",
    "Catherine McQueen / Getty Images",
    "When it comes to obesity, is BMI really the best measure?",
    "De Agostini via Getty Images",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "New results show vaccine could help fight brain cancer",
    "People are using ChatGPT like a personal trainer. Professionals say it could be unsafe.",
    "'It's my future': Montana youth undertake one of the world's most high-profile climate trials",
    "Chemical traces offer evidence of the universe's earliest stars",
    "It's already a hot start to what is expected to be a hot summer",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "Miami Mayor Francis Suarez files for 2024 presidential bid",
    "Stephanie Keith / Getty Images",
    "Trump's long game with Latino voters is apparent after his historic arraignment",
    "Harry How / Getty Images file",
    "Drag artists say all they want is 'basic respect' as attacks against their art form grow",
    "Jonathan Newton / The Washington Post via Getty Images file",
    "Johns Hopkins pulls 'lesbian' definition after uproar over use of 'non-men' instead of 'women'",
    "First Muslim woman confirmed as a U.S. federal judge",
    "Courtesy of Vhey Preexa via Stable Diffusion",
    "Why this tool is reducing Asian influence in AI-generated art",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "The best at-home pizza ovens of 2023",
    "How to choose the best sunscreen",
    "The best cleaning tools to dust your home",
    "9 best teeth whitening treatments",
    "10 best face moisturizers for dry skin",
    "Do Not Sell My Personal Information"
]