[
    "TRUMP INDICTED ON 7 CHARGES IN CLASSIFIED DOCS PROBE",
    "Drew Angerer / Getty Images file",
    "Watch Donald Trump's response to news of his indictment",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Charges include false statements and conspiracy to obstruct",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump allies say Biden is 'weaponizing' DOJ against his chief 2024 rival",
    "Few of Trump’s rivals challenge him after the federal indictment",
    "Lawyer for witness in Trump docs probe alleges prosecutorial misconduct",
    "What Trump's indictment could mean for 2024",
    "What recent polling says Americans think about charges",
    "What to expect at Trump's arraignment next week",
    "Brandon Bell / Getty Images file",
    "Surprise Supreme Court win for Black voters could give Democrats an electoral boost",
    "Supreme Court backs landmark voting rights law, strikes down Alabama congressional map",
    "Tracking major Supreme Court cases",
    "Alex Wong / Getty Images file",
    "FBI agent who testified for Republicans was suspended over leaked sensitive information",
    "GOP witnesses undermined Jan. 6 cases with conspiracy theories, FBI says",
    "Another day of unhealthy air forecast in parts of U.S. due to Canada wildfire smoke",
    "Delivery workers say they don't have a choice but to ignore health guidance about the smoke",
    "N.Y. sends firefighters to Canadian wildfires as U.S. records worst smoke day in 20 years",
    "Jason Davis / Getty Images file",
    "Elon Musk’s response to an anti-trans video sparked 24 hours of chaos at Twitter",
    "Earl S. Cryer / AFP via Getty Images file",
    "Nutrient found in high-protein foods helps slow aging in animals — and maybe humans, too",
    "Marion County Sheriff's Office",
    "Gun used in Florida neighbor's killing was bought last year after previous dispute, affidavit says",
    "Anna Webber / Getty Images for Netflix file",
    "Danny Masterson’s lawyers sanctioned for sharing info with a lawyer for the Church of Scientology",
    "DC Police Dept.; NBC Washington",
    "Sebastian Silva / AFP via Getty Images",
    "Joran van der Sloot, chief suspect in Natalee Holloway disappearance, transferred to U.S. custody",
    "Pat Robertson, conservative evangelist and Christian Coalition founder, dies at 93",
    "19-year-old Ph.D. started community college when he was 7",
    "Joseph Prezioso / AFP via Getty Images file",
    "Ron DeSantis’ top aide organized government staff to solicit campaign cash from lobbyists",
    "Dylan Hollingsworth / Bloomberg via Getty Images file",
    "FBI arrests businessman linked to impeachment of Texas AG Ken Paxton",
    "Mandel Ngan / AFP - Getty Images file",
    "House Republicans attack Biden and his family after viewing FBI document",
    "Donald Trump asks for new trial in E. Jean Carroll case",
    "California Gov. Gavin Newsom calls for constitutional amendment to curb gun access",
    "Aleksey Filippov / AFP - Getty Images",
    "Russia shells civilians fleeing dam collapse in southern Ukraine",
    "Ukraine launches counteroffensive against Russia",
    "Golf's PGA Tour and LIV merger is the latest power play by Saudi Arabia",
    "Maxar Technologies; Planet Labs",
    "Satellite images show the scale of the Ukraine dam destruction",
    "Five killed in criminal shooting in Israeli city of Nazareth",
    "4 children stabbed in knife attack in France",
    "He’s Baby Gronk. She’s Livvy. He’s got drip and she rizzed him up (and now for a translation)",
    "Stephanie Mei-Ling / Apple",
    "Tom Holland is taking a break from acting after making ‘The Crowded Room’",
    "Chandan Khanna  / AFP via Getty Images file",
    "Jake Paul is making a feature-length boxing drama",
    "Tupac Shakur’s sister tears up as late rapper gets star on Hollywood Walk of Fame",
    "'Never Have I Ever' star Maitreyi Ramakrishnan on the signs Devi finally grew up in final season",
    "FDA panel recommends injectable drug to prevent RSV in infants",
    "Christopher Katsarov / The Canadian Press via AP file",
    "Experimental drug for marijuana addiction shows promise, small study finds",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Is it safe to exercise outdoors when the air quality is poor?",
    "What to know about the health risks of wildfire smoke",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "‘Parade’ returns to Broadway with a message of hope",
    "Companies push to fill empty offices, as some city centers sit empty",
    "Supreme Court strikes down Alabama congressional map in voting rights case",
    "Spencer Platt / Getty Images",
    "Timothy A. Clary / AFP - Getty Images",
    "Asians in the U.S. say air quality ‘feels dangerously like home’",
    "Muhammed Enes Yildirim / Anadolu Agency via Getty Images",
    "What could the Ukraine dam disaster mean for Russia's war?",
    "Trump indicted on 7 charges in classified docs probe",
    "Andrew Cabellero-Reynolds / AFP via Getty Images",
    "Wildfire smoke snarls U.S. air travel with flight delays",
    "Donald Iain Smith / Getty Images/Tetra images",
    "Minors may need parents’ permission to join social media under newly passed Louisiana bill",
    "Black workers at California Tesla factory allege rampant racism, seek class-action status",
    "An unsubstantiated claim that Jamie Foxx was hospitalized after a Covid vaccination is going viral",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Rebecca Blackwell / AP file",
    "Here comes El Niño: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "Two California lakes are making comebacks with different results",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Alex Kent / Bloomberg via Getty Images",
    "New York City sues state counties over ‘xenophobic’ migrant bans",
    "Grandmother knows best: Cuban American women tout their abuelas' cooking and life lessons",
    "John Moore / Getty Images file",
    "Child labor investigation spreads to meatpacking, produce companies in 11 states",
    "Joshua Lott / AFP via Getty Images file",
    "2 Connecticut officers fired over treatment of man paralyzed in police van after 2022 arrest",
    "Robyn Beck / AFP - Getty Images",
    "Joe Maher / Getty Images file",
    "Australian man sentenced to 9 years in prison for 1988 manslaughter of gay American",
    "Allen J. Schaben / Los Angeles Times via Getty Images",
    "Three arrested at protests outside an L.A. school board meeting about Pride Month",
    "Missouri governor signs bill banning transgender care for minors, some adults",
    "Congressman honors drag icon RuPaul on the House floor",
    "J. Scott Applewhite / AP file",
    "Korean American judicial nominee shares her adoption and immigration journey with Senate committee",
    "Dickson Lee / South China Morning Post via Getty Images file",
    "YouTube channel Wong Fu Productions reflects on 20 years of Asian American storytelling",
    "Cabana Life; Ruffle Butts; Athleta",
    "Top-rated UPF swimwear for sun protection",
    "Our predictions for Prime Day 2023",
    "18 best Father's Day gifts on Amazon",
    "What causes rosacea? Derms explain.",
    "11 best women's walking shoes in 2023",
    "The 9 best BBQ smokers for summer 2023",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "The best pimple patches for breakouts",
    "Do Not Sell My Personal Information"
]