[
    "Putin met Prigozhin days after mercenary leader led mutiny",
    "Wigs, guns and a giant sledgehammer: Russian media attacks mercenary chief over lavish home",
    "Ukraine marks 500 days of fighting with Russia",
    "Biden meets with King Charles in London ahead of key NATO summit",
    "Biden and U.K. leader Sunak discuss U.S. decision to send cluster bombs to Ukraine",
    "NATO summit could test Biden's unity promise",
    "Seth Harrison / The Journal News / USA Today Network",
    "14 million under flash flood alerts after deadly flooding in New York",
    "Harrowing images of Northeast floods show submerged cars and collapsed roads",
    "At least one dead after flash flooding hits New York",
    "Scott Olson / Getty Images file",
    "Larry Nassar was stabbed multiple times at Florida federal prison",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "Chip Somodevilla / Getty Images",
    "A collision course over government funding raises fears of a shutdown",
    "Roy Herron, longtime Tenn. Democratic lawmaker, dies at 69 after injuries from jet ski accident",
    "Brendan Smialowski / AFP via Getty Images file",
    "Dozens of witnesses have testified as the Jan. 6-focused grand jury probes Trump",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "Ron DeSantis' presidential bid is giving life to a struggling Florida Democratic Party",
    "Look up: Northern Lights could be visible in 17 states this week",
    "Families with trans kids are increasingly forced to travel out of state for health care",
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "1st victim of alleged Philadelphia mass shooter was killed 44 hours earlier, police say",
    "Georgia mayor arrested on burglary and trespassing charges",
    "Videos of unconscious boys' rapes found on phone left at restaurant, police say",
    "Leila Register / NBC News; OceanGate Expeditions via AP",
    "A crypto prediction market draws bets and outrage on viral events",
    "Murat Kocabas / Sipa USA via AP",
    "Threads hits 100 million users, fueling doubts about Twitter",
    "Toni Anne Barson / WireImage",
    "Sarah Silverman sues Meta and OpenAI for copyright infringement",
    "Britain's BBC faces questions as presenter is accused of paying teenager for pictures",
    "Baby boomers and their cash are driving the housing market right now",
    "JMEnternational / Getty Images",
    "Harry Styles appears to become latest musician to be hit by an object while performing onstage",
    "Elton John bids an emotional farewell as he ends his final tour: 'I'm trying to process it'",
    "From 'Barbie' to 'Joy Ride,' July's hottest releases hit the big screen",
    "The internet is obsessed with Taylor Swift's friendship with Taylor Lautner and wife, Tay Lautner",
    "Aretha Franklin’s sons are going to court over her estate. Here's what to know.",
    "6 killed in stabbing at kindergarten in China",
    "Son of renowned Guatemalan journalist fights for father's freedom a year after imprisonment",
    "U.S. drone strike kills an Islamic State group leader in Syria, the Defense Department says",
    "Is Russia purging Wagner Group troops in Africa?",
    "Sudan on the brink of a 'full-scale civil war,' U.N. chief warns",
    "Kitchen Appliances and Tools",
    "How to choose the best air fryer for you",
    "Vivian Le / NBC; Location Courtesy of Viking",
    "Why Amazon hosts Prime Day every year",
    "Early Prime Day deals to shop right now",
    "The 7 best e-readers of 2023",
    "Best for Your Pet Awards 2023 favorites: Treats, toys and food",
    "Dangerous boat jumping challenge leaves at least 4 dead",
    "How to maximize savings on Amazon Prime Day",
    "Powerball and Mega Millions jackpots reach combined $1B",
    "Logan Paul’s PRIME energy drink faces scrutiny",
    "Rob Newell  / CameraSport via Getty Images",
    "Why this summer's big sporting events might look a little different",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Betty Laura Zapata / Bloomberg via Getty Images file",
    "What’s it like to have a bounty on your head for supporting democracy?",
    "Brett Coomer / Houston Chronicle via AP",
    "Houston man whose mother said he was missing no longer wants contact with her, aunt says",
    "U.S. District Court for the District of Columbia",
    "Trump-appointed judge gives a 'break' to Jan. 6 rioter who wants to be a police officer",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "Kidney stones on the rise in children, doctor says",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Biden highlights new efforts to lower health care costs and limit 'junk fees'",
    "Mark Felix / AFP - Getty Images",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Mario Tama / Getty Images file",
    "El Paso Walmart mass shooter sentenced to 90 life terms",
    "Brandon Bell / Getty Images/FILE",
    "Lawsuit seeking reparations for Tulsa Race Massacre is dismissed",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Mike Coppola / Getty Images file",
    "Keke Palmer is the latest Black mother facing backlash over what she wears",
    "U.S. Forest Service and HBCUs unite to boost diversity in wildland firefighting",
    "Julie Bennett / Getty Images file",
    "Trans woman, bookstore, teacher sue over Montana law banning drag reading events",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Do Not Sell My Personal Information"
]