[
    "'Underwater noises' were detected during the search, U.S. Coast Guard says",
    "Inside the Titanic tourist submersible missing with 5 people",
    "Billionaire adventurer and a father-and-son duo among the missing in Titanic sub",
    "Tom Williams / CQ Roll Call via AP file",
    "Rep. Lauren Boebert to force House vote on impeaching Biden",
    "Chelsea Stahl / NBC News; handout photos; Getty Images",
    "Drew Angerer / Getty Images file",
    "Legal experts say the charges against Hunter Biden are rarely brought",
    "Hunter Biden to plead guilty to tax-related misdemeanor crimes",
    "David J. Phillip / AP file",
    "Sweltering heat tests Texas’ power grid as thousands in South without electricity after storms",
    "Andrea Morales / Getty Images file",
    "Judge strikes down Arkansas ban on transition care for minors",
    "Bloomberg via Getty Images file",
    "Biden calls Chinese President Xi a 'dictator'",
    "Brandon Bell / Getty Images file",
    "Trump classified documents trial will begin in mid-August, judge says",
    "Scott Olson / Getty Images file",
    "Bipartisan team up to limit Chinese purchase of U.S. farmland",
    "New Hampshire state senator charged with assaulting an employee at his restaurant",
    "Bernie Sanders announces investigation into Amazon's safety record",
    "John Eastman faces disbarment proceedings in California over effort to reverse 2020 election",
    "Residents of close-knit Iowa community say building fell into disrepair before collapse",
    "Idaho man accused of killing 4 ‘lost it’ after neighbor allegedly exposed himself to family",
    "Ezra Bailey / Getty Images",
    "U.S. ranks 43rd on gender parity index this year, sliding 16 slots from last year",
    "Pilot arrested in Scotland after allegedly showing up drunk to New York-bound flight",
    "Search for Julian Sands resumes 5 months after actor vanished on California mountain",
    "Gavriil Grigorov / Sputnik via AP",
    "Biden warns the threat Putin will use tactical nuclear weapons is 'real'",
    "Andrew Tate will face trial on rape, human trafficking charges in Romania",
    "Nicolas Briquet / SOPA / Lightrocket via Getty Images file",
    "Paris Olympic headquarters searched in corruption probe",
    "Italian prosecutor demands cancellation of birth certificates for lesbian couples",
    "American woman who was pushed into a ravine near Neuschwanstein castle is out of the hospital",
    "@beberexha / via Instagram",
    "Man who allegedly threw phone at Bebe Rexha during concert thought 'it would be funny,' police say",
    "Paxton Whitehead, 'Friends' and 'Back to School' actor, dies at 85",
    "A 'Price Is Right' contestant celebrated so hard he dislocated his shoulder",
    "Kesha ‘almost died’ after egg freezing complication due to autoimmune disorder",
    "Taylor Swift just added 42 more international Eras Tour stops",
    "Smosh co-founders Anthony Padilla and Ian Hecox reunite to acquire comedy brand from Rhett & Link",
    "Inside look at the missing Titanic tourist submersible",
    "Bipartisan bill to establish commission on AI: Is it too little, too late?",
    "Ex-influencers speak about their lives after leaving social media",
    "Boaters make daring rescue after witnessing houseboat capsize",
    "Mark Abramson for NBC News",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Stephanie Mei-Ling for NBC News",
    "Black mermaids came to slay at annual Coney Island parade",
    "Andrej Isakovic / AFP via Getty Images file",
    "Rocked by 2 mass shootings in 2 days, this small country chose a different path",
    "Leila Register / NBC News; Getty Images",
    "People are using ChatGPT like a personal trainer. Professionals say it could be unsafe.",
    "OceanGate Expeditions / AP",
    "Highlights from Day One as the search for the missing Titanic submersible continues",
    "Hospital turns over transgender patient records to Tennessee attorney general in investigation",
    "HCA hospitals accused of pushing patients toward hospice",
    "Aleli Dezmen / Getty Images",
    "Screen all adults under 65 for anxiety, health panel says",
    "Novo Nordisk sues clinics allegedly selling copycat versions of Ozempic and Wegovy",
    "Cancer was once considered a disease of aging, but rates among young people are rising rapidly",
    "Supreme Court's Alito defends against ethics questions",
    "Biden meets with artificial intelligence experts in effort to manage its risks",
    "David Zalubowski / AP file",
    "Connecticut announces investigation into social media-linked thefts of Hyundai and Kia vehicles",
    "YouTube removes video of Robert F. Kennedy Jr. and Jordan Peterson for vaccine misinformation",
    "Rescue operation faces extreme environment in search for missing sub",
    "Titanic tour company offered up-close experience for $250,000",
    "How vulnerable is your neighborhood to extreme heat?",
    "Homeowners in California and Florida are running out of options to protect their homes",
    "It’s already a hot start to what is expected to be a hot summer",
    "How one city's apology to Black and Latino residents sparked a backlash",
    "Colombia's Armed Forces Press Office via AP",
    "Indigenous plane crash searchers turned to ayahuasca to find missing kids",
    "Theo Wargo / Getty Images for Songwriters Hall of Fame",
    "Gloria Estefan makes history with induction into Songwriters Hall of Fame",
    "Montinique Monroe / Getty Images file",
    "Texas Gov. Abbott signs law shutting diversity offices at public universities",
    "Collin Mayfield / Sipa USA via AP file",
    "Atlanta police training center opponents sue over delays in approving referendum",
    "Bill Glauber / USA Today Network",
    "Two arrested in Milwaukee Juneteenth shooting that wounded 6, including alleged shooters",
    "Students and authors sue Florida school district that banned a book about two male penguins",
    "'The Stroll' puts trans sex workers on the map of NYC's queer history",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "First Muslim woman confirmed as a federal judge",
    "When is Amazon Prime Day 2023? What to know",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "Do Not Sell My Personal Information"
]