[
    "Adria Malcolm for NBC News; Getty Images",
    "Migrants met by Border Patrol vans shortly after Title 42 lifted",
    "Live Updates / Water to be released into Rio Grande, raising safety concerns for migrants",
    "El Paso residents have differing views on the latest arrivals at the border",
    "Russia denies any Ukrainian breakthrough after Bakhmut gains spark panic",
    "Ukraine drives back Russian forces around Bakhmut in its first significant gains in months",
    "U.S. envoy says Russian ship picked up weapons in South Africa",
    "Michael M. Santiago / Getty Images",
    "NYC subway rider who put Jordan Neely in fatal chokehold surrenders to police",
    "Marine veteran who fatally choked a subway performer to be charged with manslaughter",
    "Swiss village evacuated over fears it's about to be wiped out in a massive rockslide",
    "This tiny Swiss village could soon be buried beneath a collapsing mountainside",
    "Former NBCUniversal ad chief Linda Yaccarino named CEO of Twitter",
    "Elon Musk says he's hired a new CEO for Twitter and will reduce his own role",
    "Vartika Sharma for NBC News",
    "National Maternal Mental Health Hotline received over 12,000 calls and texts in its first year",
    "YouTuber who crashed plane in California mountains did it for sponsorship deal, authorities say",
    "Meteorite crashes through roof of New Jersey home and bounces around in a bedroom",
    "A Chicago woman was arrested in a series of baseball bat attacks, police say",
    "Drew Angerer / Getty Images file",
    "Congress leaves town with no debt ceiling deal, but some see signs of progress",
    "George Santos inks deal to avoid prosecution in Brazil over bad checks",
    "Justice Department seeks to prevent Trump deposition in lawsuits by ex-FBI officials",
    "Brittainy Newman / AP file",
    "Judge in Virginia says law banning sales of handguns to young adults is unconstitutional",
    "Trump notifies court he plans to appeal $5 million E. Jean Carroll verdict",
    "Number 2 U.S. diplomat to retire after decades in government service",
    "CIA announces steps to tackle sexual misconduct cases",
    "Sedat Suna / EPA via Shuttersock",
    "Handful of LGBTQ candidates square off with President Erdogan ahead of key Turkish election",
    "Ex-NBA star Dwight Howard sparks anger in China by calling Taiwan a 'country'",
    "Former Pakistan PM Imran Khan released on bail",
    "Palestinian militants fire more rockets, Israeli airstrikes hit Gaza despite cease-fire efforts",
    "Lauren Schatzman / NBC News / Getty Images",
    "Asian Americans are no longer pop culture side-kicks — they're defining the mainstream",
    "Talk therapy falls short for many Asian Americans. They've turned to centuries-old alternatives.",
    "The chronically online third culture is redefining Asian America",
    "Grocery store prices drop for first time since September 2020",
    "Peloton recalls more than 2M bikes over safety hazard",
    "Google unveils latest AI features",
    "Artificial intelligence helping recycling center sort waste",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Trump's comments on Mar-a-Lago documents 'like red meat to a prosecutor'",
    "Christina Chung for NBC News",
    "Tough immigration policies are making it harder to build new homes",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "Natalee Holloway case suspect to be extradited to U.S. in alleged fraud targeting her mom",
    "Erik McGregor / LightRocket via Getty Images file",
    "Supreme Court throws out convictions in sweeping New York corruption probe",
    "Walker Mortuary; KPCW.org via AP",
    "Utah mom accused of killing husband with fentanyl tried to poison him before, family says",
    "Jessica Rinaldi / Boston Globe via Getty Images file",
    "Parents' fraud convictions in college admissions scandal overturned by appeals court",
    "Mike Stocker / South Florida Sun-Sentinel via Getty Images",
    "McDonald’s found liable for hot Chicken McNugget that fell from Happy Meal, burned girl",
    "Al Drago / Bloomberg via Getty Images",
    "The pandemic emergency is over, but Covid's impact on the labor force is set to last",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "Peloton recalls 2.2 million exercise bikes over safety hazard",
    "Phillip Faraone / Getty Images for Drake's Hollywood file",
    "'Selling Sunset' star Chrishell Stause and musician G Flip got married",
    "Arturo Holmes / FilmMagic file",
    "Elliot Page recalls past feelings of dysphoria and 'joy' he now feels in his body",
    "Jacklyn Zeman, longtime 'General Hospital' actor, dies at 70",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "Football and baseball legend Bo Jackson says he’s had hiccups for nearly a year",
    "CDC monitoring cases of drug-resistant ringworm",
    "FDA ends ban on blood donations from gay and bisexual men",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Patrick T. Fallon / AFP via Getty Images",
    "Live updates: Migrants weigh next steps after Title 42 immigration policy expires",
    "Stringer via Reuters/Redux",
    "Title 42 immigration policy has expired as border officials prepare for a possible influx",
    "Adria Malcolm for NBC News",
    "Lawmakers on reparations panel warn Black Californians not to expect huge payouts",
    "Andrew Savulich / New York Daily News/TNS via Getty Images file",
    "White House calls for 'thorough investigation' into Jordan Neely's death",
    "Caroline Brehman / CQ-Roll Call, Inc via Getty Images file",
    "Kansas City declares itself an LGBTQ sanctuary city",
    "Arkansas Pride event changes venue after drag show restriction",
    "Lauren Schatzman / NBC News",
    "Man accused in deadly shooting at  Taiwanese church in California is indicted on 98 charges",
    "José Luis Villegas  / AP file",
    "California Senate passes bill that would make caste discrimination illegal",
    "'Sesame Street' debuts its first Filipino American muppet",
    "16 products that will upgrade your braid care routine",
    "Tuft & Needle; Supergoop; Aura Frame",
    "7 best sales to shop this weekend",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "Do Not Sell My Personal Information"
]