[
    "2 killed, 5 injured in shooting after high school graduation at Virginia Commonwealth University",
    "VIDEO: Suspect is believed to have known at least one of the VCU shooting victims",
    "Spencer Platt / Getty Images",
    "What to know about the health risks of wildfire smoke affecting nearly 100 million across U.S.",
    "Detroit housing court reopens with big changes and fears of more evictions",
    "Tough immigration policies are making it harder to build new homes",
    "Leila Register / NBC News; Bravo",
    "2023 Planet Labs PBC/AFP via Getty Images",
    "Why the destruction of Ukraine's Kakhovka dam could be so serious",
    "Live Updates /  Up to 70 towns and cities will be flooded due to dam break, Zelenskyy says",
    "Ukraine accuses Russia of blowing up major dam",
    "Department of Justice via AP",
    "Secret Service agents have testified in Trump classified documents probe",
    "Kent Nishimura / Los Angeles Times via Getty Images file",
    "Republicans angry with McCarthy over debt deal join Democrats to block gas stove bills",
    "Patrick T. Fallon / AFP - Getty Images",
    "Gavin Newsom: Florida officials committed crimes sending migrants to California",
    "Florida confirms it arranged recent migrant flights to California",
    "Patrick Semansky / AP file",
    "Giuliani denies claims he coerced woman to have sex, says she's trying to stir 'media frenzy'",
    "Chris Christie jumps into the 2024 GOP presidential race",
    "Appeals court rules people convicted of nonviolent crimes can own guns",
    "Trump seeks to stop second E. Jean Carroll lawsuit",
    "Gary Coronado / Los Angeles Times via Getty Images file",
    "Two California lakes are making comebacks with different results",
    "PGA Tour, Saudi-backed LIV merge in stunning end to bitter golf rivalry",
    "Boppy’s recalled infant lounger is now linked to at least 10 deaths",
    "High school athlete stabbed 15 times by her ex while leaving a restaurant, Florida officials say",
    "What we know about the possible cause of the deadly Virginia plane crash",
    "Parallel reparations efforts gain momentum in California and Capitol Hill",
    "Robyn Beck / AFP - Getty Images",
    "Oregon breakaway effort is down to just 8 votes, deepening urban-rural divide",
    "Prince Harry says tabloids have ‘blood on their hands’ in historic testimony",
    "Lise Aserud / AFP - Getty Images",
    "Antony Blinken to embark on high-stakes trip to China",
    "Britain’s Princess Eugenie gives birth to her second son",
    "In Mexico's most populous state, a party ends an almost 100-year dominance",
    "Michael Nagle / Bloomberg via Getty Images file",
    "SEC’s crypto crackdown unlikely to impact traders near-term but could transform the industry",
    "Chris Trotman / LIV Golf / Getty Images",
    "Here's why the PGA Tour just merged with LIV Golf",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Apple’s entry into VR is a ‘watershed moment,’ say top industry execs",
    "Boeing warns new defect on 787 Dreamliners will slow deliveries",
    "Ethan Miller / Getty Images file",
    "Pete Davidson has 'no idea what's going on' with the Staten Island ferry he bought",
    "Shanna Madison / Chicago Tribune via ZUMA Press Wire",
    "Taylor Swift accidentally swallows a bug during Eras Tour concert",
    "Alec Tabak / The Daily News via AP file",
    "Cuba Gooding Jr. settles lawsuit that accused him of rape, avoiding N.Y. trial",
    "Elliot Page reveals secret romance with Kate Mara in 'Pageboy' memoir",
    "Brazilian Astrud Gilberto, who sang 'The Girl from Ipanema,' is dead at 83",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Meet the hiker dreaming up the 14,000-mile American Perimeter Trail",
    "Job seekers speak out about pulled employment offers",
    "Prince Harry takes the stand in suit against British tabloid",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Kentaro Aoyama / AP file/NBC News",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "To ease cancer drug shortage, FDA will allow imports from China",
    "A gluten-free food makes a comeback in Cuba — and seeks world recognition",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Jose A. Iglesias / Miami Herald/TNS via Getty Images",
    "Republican lawmakers who backed DeSantis immigration law appear to downplay its potential impact",
    "Ingo Barth / ullstein bild via Getty Images file",
    "Jeff Kowalski / AFP via Getty Images file",
    "Black women are bearing the brunt of an increase in Black unemployment, data shows",
    "Tom Williams / CQ-Roll Call via Getty Images file",
    "Calls for woman's arrest grow after the fatal shooting of her neighbor in Florida",
    "Tayfun Coskun / Anadolu Agency via Getty Images file",
    "Cornel West announces his presidential campaign",
    "Ricardo Ramirez Buxeda / Orlando Sentinel",
    "Alejandro Alvarez / Sipa USA via AP",
    "Nation's largest LGBTQ advocacy group declares state of emergency",
    "Police investigate alleged pellet gun shooting outside Kansas City LGBTQ bar",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Kara Birnbaum/ NBC News; Vivian Le/ NBC News",
    "12 best pair hair removers of 2023",
    "9 new products launching in June",
    "May reader favorites: Sunscreens, deodorants and more",
    "Courtesy Annie Shigo; Fable; Wild One",
    "18 must-have products for new puppy parents",
    "15 Amazon tools that'll make your garden flourish",
    "6 best instant cameras of 2023",
    "What experts want you to know about dog food",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Do Not Sell My Personal Information"
]