[
    "Instead of door-knocking, they were at the casino: Inside the flawed GOP turnout operation",
    "Ron DeSantis' security becomes a flashpoint for Florida’s top police agency",
    "Mike Pence is set to launch his presidential campaign next week",
    "Senate racing to vote on the debt ceiling deal as soon as Thursday night",
    "A break-glass option, gumbo and a bike ride: How the debt ceiling deal got done",
    "Kevin McCarthy proves his naysayers wrong",
    "Scott Olson / Getty Images",
    "Train carrying hazardous materials derails and closes highway in Minnesota",
    "Residents of this small Alabama town are helping each other through a collective nightmare",
    "Texas murder suspect calls police and tells them, 'You’re looking for me.'",
    "Family of Native American man killed by Border Patrol in Arizona wants to know why he was shot",
    "Police video shows a car rocketing off a tow truck on a Georgia highway",
    "This former Navy pilot has a new mission: Normalizing UFO reporting",
    "3 teens arrested after killing and eating New York village's prized swan, police say",
    "Robert F. Bukaty / AP file",
    "Ron DeSantis loses his temper with a reporter: 'Are you blind?'",
    "Jemal Countess / Getty Images",
    "Senate to vote to block Biden’s student debt relief program",
    "Ahmed Gaber / The New York Times / Redux file",
    "Trump attorneys seek recusal of judge in New York criminal case",
    "Roberto E. Rosales / The Albuquerque Journal via AP",
    "Grand jury charges ex-GOP candidate with election interference in shootings at lawmakers’ homes",
    "'Trump Bucks' websites taken down after being exposed for selling bogus currency",
    "Pentagon is blocking U.S. cooperation with international investigations of war crimes in Ukraine",
    "Pentagon leaders cancel drag show at a Nevada Air Force base",
    "Marco Gualazzini / Contrasto / Redux",
    "Russian mercenaries exploit a war-torn African nation as they lead Putin’s fight in Ukraine",
    "Jordan’s royal wedding day gets underway with surprise arrival of Britain’s William and Kate",
    "Emmanuel Dunand / AFP - Getty Images",
    "Tennis star Novak Djokovic stands by Kosovo comments after criticism",
    "U.S. warns China: Refusing to talk risks incidents ‘spiraling’",
    "Truck driver detained after spilled potatoes wreak havoc on key bridge in Denmark",
    "In blow to unions, Supreme Court rules company can pursue strike damage claim",
    "National Eating Disorders Association pulls chatbot after users say it gave harmful dieting tips",
    "Smith Collection / Gado via Getty Images",
    "Spirit Airlines blames huge delays, cancellations on technical issue",
    "A verified AOC parody account got a boost from Elon Musk’s Twitter",
    "Months after Adidas cut ties with Kanye West, Yeezy shoes are back on sale",
    "Pride 30: Drag performers who made 'herstory'",
    "Most Americans say companies should publicly support LGBTQ community, survey finds",
    "Walmart has not made changes to LGBTQ-themed merchandise in wake of Target backlash",
    "LGBTQ people flock to Florida for Disney's Gay Days celebration",
    "De Agostini via Getty Images",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "Leigh Henningham / Monash Turner Institute",
    "The shape of your brain may strongly influence your thoughts and behavior, study finds",
    "Bruce Willis’ daughter Tallulah reveals the first signs he had dementia",
    "Teen birthrates hit another record low as progress starts to slow",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "Myung J. Chun / Los Angeles Times via Getty Images",
    "Danny Masterson found guilty of rape",
    "Bob D'Amico / ABC via AP file",
    "'Lost' actors and writers allege toxic and racist work environment",
    "Kevin Winter / Getty Images",
    "Rhea Perlman on still being married to Danny DeVito despite splitting more than a decade ago",
    "Actor Armie Hammer won’t face sexual assault charge",
    "Kim Cattrall couldn't stay away from 'Sex and the City' role after all",
    "NASA’s UFO panel holds its first public meeting: Key takeaways",
    "'That 70s Show' actor Danny Masterson found guilty of rape",
    "Bruce Willis’ daughter Tallulah pens essay on dad's health battles",
    "Dramatic car flip caught on camera",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "A dedicated generation has changed the way Asian food is consumed",
    "Justine Goode / NBC News / Getty Images",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Anna Moneymaker / Getty Images",
    "Debt ceiling vote news: Biden-McCarthy plan passes, heads to Senate",
    "Nun whose body shows little decay since 2019 death draws hundreds to rural Missouri",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Chip Somodevilla / Getty Images file",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "A New York man is fired after a woman accused him of ripping her wig off in the street",
    "Paras Griffin / Getty Images file",
    "Sean ‘Diddy’ Combs files lawsuit alleging race played a role in marketing of his liquor brands",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "Phelan M. Ebenhack via AP file",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "LGBTQ flag burned at California elementary school before Pride event",
    "Yuki Iwamura / AFP - Getty Images",
    "Trial begins for three men accused of pressuring expats to return to China",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "Do Not Sell My Personal Information"
]