[
    "Fighter jets scrambled near D.C. to check off-course private plane that ultimately crashed",
    "Chandan Khanna / AFP - Getty Images file",
    "Trump asks 'How can DOJ possibly charge me' after his lawyers meet with feds",
    "Trump's attorneys sat down with special counsel ahead of grand jury meeting",
    "Mother of 6-year-old who shot Virginia teacher charged with federal gun crimes",
    "Paul J. Richards / AFP - Getty Images fileFBI via Getty Images",
    "Robert Hanssen, FBI agent who spied for the Russians, dies in supermax prison",
    "Convicted spy Robert Hanssen dies in federal prison",
    "Prince Harry set to become the first British royal to testify in court in 130 years",
    "Prince Harry prepares to testify in lawsuit against newspaper group",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Scott Olson / Getty Images",
    "Resident of collapsed Iowa building sues property owner and contractors",
    "6 women found dead within 3 months in Portland, Oregon, metro area",
    "Melody Sasser / via Facebook",
    "Tennessee woman accused of hiring hitman on dark web to kill her hiking buddy's wife",
    "Calls for woman's arrest grow after the fatal shooting of her neighbor in Florida",
    "Mother of slain Idaho student Ethan Chapin says her family won’t attend suspect’s trial",
    "Atlanta lawmakers to vote on controversial police training center",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Rep. James Comer to start contempt proceedings against FBI Director Wray on Thursday",
    "Jim Young / Reuters / Redux",
    "‘Trump too small’ trademark clash to be decided by Supreme Court",
    "Mike Pence filing papers launching 2024 bid in challenge to Trump",
    "Manuel Balce Ceneta / AP file",
    "Acting ICE director Tae Johnson to step down at end of June",
    "California investigating whether migrant flight came from Florida",
    "Cornel West announces his presidential campaign",
    "With debt limit deal behind him, Biden returns to 'previously scheduled programming'",
    "Russia claims Ukraine launched a major attack in the east",
    "Mother who served 20 years over deaths of her 4 children is freed after new evidence",
    "Britain’s Princess Eugenie gives birth to her second son",
    "U.S. releases video showing close-call with Chinese warship",
    "U.S. says Iran fast-attack boats ‘harassed’ ship in Strait of Hormuz",
    "Apple launches its $3,499 virtual reality headset: Apple Vision Pro",
    "Piaras Ó Mídheach / Sportsfile for Web Summit via Getty Images file",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "Gabby Jones / Bloomberg via Getty Images file",
    "Last tot standing: Buybuy Baby likely to survive as Bed Bath & Beyond fades into bankruptcy",
    "CNN CEO Chris Licht apologizes to staff during internal Monday morning call",
    "Is it real or made by AI? Europe wants a label for that as it fights disinformation",
    "GM to invest more than $1 billion to produce new heavy-duty pickups",
    "Kyle Gustafson / The Washington Post via Getty Images file",
    "Matty Healy has angered fans way before those Ice Spice comments",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Christopher Polk / NBC via Getty Images file",
    "'Abbott Elementary' star calls out 'very dangerous' culture of sexuality speculation",
    "‘Succession’ creator ‘terrified’ when Jeremy Strong tried to jump into river filming last scene",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Apple unveils new mixed-reality headset, its first new product in years",
    "Teachers show gratitude to high school senior who has sent hundreds of thank you notes",
    "New drug effective at preventing growth of lower-grade brain tumors, clinical trial finds",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Kentaro Aoyama / AP file/NBC News",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "Su Bikun / VCG via Getty Images file",
    "To ease cancer drug shortage, FDA will allow imports from China",
    "A gluten-free food makes a comeback in Cuba — and seeks world recognition",
    "Is Covid ticking up? Viruses and other bugs could make a summer comeback",
    "Younger people left this U.S. territory for better jobs. Who takes care of the seniors?",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Ron DeSantis attacks Trump on immigration: ‘This is a different guy’ than in 2016",
    "Luis Antonio Rojas / Bloomberg via Getty Images",
    "In Mexico's most populous state, a party ends an almost 100-year dominance",
    "Erika P. Rodríguez for NBC News",
    "Tayfun Coskun / Anadolu Agency via Getty Images file",
    "Jeff Greenberg / Universal Images Group via Getty Images",
    "Black Florida students are suing the state over less funding for their HBCU",
    "Police investigate alleged pellet gun shooting outside Kansas City LGBTQ bar",
    "Trans adults in Florida 'blindsided' that new law also limits their access to health care",
    "Brandon Bell / Getty Images file",
    "Texas bans gender-affirming care for minors after Gov. Abbott signs bill",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "15 Amazon tools that'll make your garden flourish",
    "6 best instant cameras of 2023",
    "What experts want you to know about dog food",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "Do Not Sell My Personal Information"
]