[
    "Is Russia purging Wagner Group troops in Africa?",
    "Wigs, guns and a giant sledgehammer: Russian media attacks mercenary chief over lavish home",
    "Mercenary chief is still in Russia despite deal to end mutiny with exile, leader of Belarus says",
    "Oliver Contreras / Bloomberg via Getty Images",
    "Trump aide Nauta pleads not guilty in Florida classified documents case",
    "More Mar-a-Lago search warrant information released in Trump classified docs case",
    "Betty Laura Zapata / Bloomberg via Getty Images file",
    "What’s it like to have a bounty on your head for supporting democracy?",
    "Not many are in the mood for the 'Happy Hong Kong' campaign after years of curtailed freedoms",
    "Arrests and tight security in Hong Kong on Tiananmen Square anniversary",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Meta rebuts claim it hired former Twitter employees to make Threads",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "Edward Berthelot / Getty Images file",
    "The 10 strangest, most troubling allegations about Ye's Donda Academy",
    "Roger Stone joins Trump on his private plane to Las Vegas after a campaign stop in Iowa",
    "U.S. District Court for the District of Columbia",
    "Trump-appointed judge gives a 'break' to Jan. 6 rioter who wants to be a police officer",
    "Chris Kleponis / Polaris/Bloomberg via Getty Images file",
    "Trump asks 'what the hell is a Blizzard' at Dairy Queen campaign stop in Iowa",
    "Texas' largest county, home to Houston, sues state over law ousting its election chief",
    "Ron DeSantis bragged about sending help to Iowa — 10 hours after being told it wasn't needed",
    "Republicans request Secret Service briefing on cocaine found at White House",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "Manson family killer will be paroled, lawyer says, after Gov. Newsom drops fight",
    "California man arrested in connection with serial killings of Mexican sex workers",
    "El Paso Walmart mass shooter Patrick Crusius sentenced to 90 consecutive life sentences",
    "New HIV cases linked to shuttered New Mexico salon that offered 'vampire facials'",
    "Justin Yau / Sipa via AP file",
    "U.S. will send cluster bombs to Ukraine despite concerns they could kill civilians",
    "Arabinda Mahapatra / AP file",
    "Three officials arrested in India over train crash that killed more than 290 people",
    "Mark Schiefelbein  / Pool via AFP - Getty Images",
    "Yellen defends U.S. actions to protect national security in meeting with Chinese premier",
    "Dutch government collapses over immigration policy",
    "Militants attack a police station and kill 2 in southeast Iran, state TV reports",
    "Did 'Barbie' cross the line? How a 'child-like' map stirred a South China Sea dispute",
    "Taylor Hill / TAS23 / Getty Images for TAS Rights Management file",
    "Think it's hard to get a Taylor Swift ticket in the U.S.? Try competing with Swifties in Asia",
    "Mike Coppola / Getty Images file",
    "Keke Palmer is the latest Black mother facing backlash over what she wears",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Video shows Britney Spears inadvertently hit herself in the face in Las Vegas Wembanyama encounter",
    "Kobo; Kara Birnbaum / NBC News",
    "The 7 best e-readers of 2023",
    "Early Prime Day deals to shop right now",
    "Owala; AmazonAmazon; Owala",
    "Best for Your Pet Awards 2023 favorites: Treats, toys and food",
    "How experts shop for a garden hose",
    "Target Circle Week starts July 9",
    "Kidney stones on the rise in children, doctor says",
    "New report shows US job growth cooled in June",
    "Extreme heat threatens 20 million as severe weather continues to hit U.S.",
    "Video shows rock crush cars in deadly India landslide",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Paul Hanna / Bloomberg via Getty Images",
    "Chaotic, blissful and confusing: What Threads users are saying about the new social media app",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "Andrew Cabalerro-Reynolds / AFP - Getty Images file",
    "Judge denies Justice Department request to block Trump deposition in lawsuits by ex-FBI officials",
    "Samuel Corum / Getty Images",
    "Cocaine found in the White House was in a different location than previously reported, sources say",
    "Texas Center for the Missing",
    "Houston teenager 'missing' for 8 years was at home the whole time, police say",
    "UPS customers weigh backup plans as threatened strike date approaches",
    "U.S. fines meat company that used two minors to run hazardous machinery at Minnesota factory",
    "Heather Hollingsworth / AP file",
    "Employment among people with disabilities hits post-pandemic high",
    "HBO cancels 'A Black Lady Sketch Show' after four seasons",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Biden highlights new efforts to lower health care costs and limit 'junk fees'",
    "Mark Felix / AFP - Getty Images",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Johan Nilsson / TT News Agency via AP file",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Mario Tama / Getty Images file",
    "El Paso Walmart mass shooter sentenced to 90 life terms",
    "Catholic priests report beatings, surveillance by Nicaragua government",
    "U.S. Forest Service and HBCUs unite to boost diversity in wildland firefighting",
    "Stephen McCarthy / Sportsfile via Getty Images file",
    "A diverse U.S. squad heads to women's World Cup",
    "From 'Barbie' to 'Joy Ride,' July's hottest releases hit the big screen",
    "Trans woman, bookstore, teacher sue over Montana law banning drag reading events",
    "Niall Carson / PA Wire via AP",
    "Pope taps priest who runs LGBTQ Catholic outreach to join major Vatican gathering",
    "Serial killer docuseries 'Last Call' reckons with NYC's history of anti-gay violence",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Joseph Prezioso / AFP via Getty Images file",
    "Asian Americans feel particularly targeted by new laws criminalizing those who assist voters",
    "Do Not Sell My Personal Information"
]