[
    "Chip Somodevilla / Getty Images",
    "Republicans privately acknowledge Trump's legal woes are serious this time",
    "After more legal trouble, Trump follows a familiar playbook: Play the victim",
    "Most Republicans in Biden-won districts don't want to talk about Trump indictment",
    "UPS drivers on track to get air-conditioned trucks for the first time",
    "In the hot seat: UPS delivery drivers at risk of heat-related illnesses",
    "Mississippi police officer who shot 11-year-old boy suspended without pay",
    "11-year-old says being shot by Mississippi officer felt like 'a big punch to the chest'",
    "NBC News; Getty Images; Courtesy Libero Copper & Gold",
    "A powerful U.S. political family is linked to copper mining in the Colombian rainforest",
    "Colombian Air Force / AFP - Getty Images",
    "How did four kids survive a plane crash and 40 days alone in the jungle?",
    "Kent Nishimura / Los Angeles Times via Getty Images",
    "'Lose Cruz' super PAC plans to hound the Texas senator (and his podcast)",
    "Judge allows E. Jean Carroll to amend defamation case against Trump",
    "Jemal Countess / Getty Images file",
    "NAACP says it is 'disappointed' Biden ended pause on federal student loan payments",
    "Few Americans know Sen. Tim Scott, but some Democrats see him as a tough election opponent",
    "Ohio Republican Vance will hold Justice Dept. nominees in Senate over Trump case",
    "Bruce Bennett / Getty Images",
    "Vegas Golden Knights capture first Stanley Cup in 9-3 win over Florida Panthers in Game 5",
    "Graeme Sloan / Sipa USA via AP file",
    "Federal Reserve expected to skip interest rate hike as it evaluates state of the economy",
    "Riley Keough asks court to approve her as sole trustee of mom Lisa Marie Presley’s estate",
    "Harrowing video shows helicopter crew pluck motorist from rocky California bluffs",
    "Mandel Ngan / AFP - Getty Images",
    "Blinken set for high-stakes China trip this week, but there's no sign of a thaw yet",
    "Yichuan Cao / Sipa USA via AP",
    "Google must break up digital ad business over competition concerns, European regulators say",
    "At least 59 migrants dead and dozens missing after fishing boat capsizes off coast of Greece",
    "Chinese airline is criticized over strict weight rules for female flight attendants",
    "2 Japanese soldiers are killed in shooting at army base firing range",
    "Justine Good4 / NBC News; Getty Images / AP",
    "Everything you need to know about California's reparations report",
    "Paul McCartney announces new Beatles music, with the help of AI",
    "Asteroid the size of the Brooklyn Bridge to pass Earth Thursday",
    "Swimming with sharks: Go inside the Georgia Aquarium",
    "New report focuses on what led plane to crash in Amazon jungle",
    "Teens in residential drug rehabs often don't get the most effective opioid treatment",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "How the Florida judge overseeing Trump's trial could hobble the Justice Department's case",
    "Leila Register / NBC News; Getty Images",
    "For China's LGBTQ community, safe spaces are becoming harder to find",
    "Social Security cost-of-living adjustment may be 2.7% in 2024, new estimate finds",
    "Lawmaker demands more information about PGA Tour and LIV Golf merger",
    "Jim Spellman / WireImage file",
    "Cormac McCarthy, Pulitzer-winning novelist known for 'The Road,' dies at 89",
    "Jordan Strauss / Invision / AP file",
    "Debra Messing recalls the 'Will & Grace' scene that left the audience 'dead quiet'",
    "'Never Have I Ever' fans say goodbye to a South Indian American milestone",
    "Actor Treat Williams dies at 71 after motorcycle accident",
    "Hannah Beier / Bloomberg via Getty Images file",
    "FDA advisers to discuss next round of Covid boosters for the fall",
    "Abraham Pineda / AFP via Getty Images file",
    "Fungal meningitis outbreak in U.S. kills 4 as CDC tries to track patients of clinics in Mexico",
    "Experimental vaccine shows promise in delaying the return of aggressive brain tumor",
    "What happened to the common cold? Post-Covid, it feels like every sniffle needs a name",
    "It's already a hot start to what is expected to be a hot summer",
    "Ezra Acayan / Getty Images file",
    "How New York's day of smoke laid bare the realities of climate catastrophe",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Adalberto Roque   / AFP via Getty Images",
    "Amid focus of Cuba's ties to China and Russia, residents bemoan hunger, scarcity",
    "Brazil sees increase in neo-Nazi groups amid more conservatism",
    "Claudio Cruz / AFP - Getty Images",
    "Mexico City mayor to step down to pursue historic bid for presidency",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "NYC mandates minimum wage for app-based delivery workers",
    "Army renames Louisiana base for Black WWI hero who received Medal of Honor",
    "Mike Coppola / Getty Images for Turner file",
    "Joseph Fiennes says playing Michael Jackson was the 'wrong decision' and a 'bad mistake'",
    "Lucy Garrett / Getty Images file",
    "California skate park is named for Black motorist fatally beaten in police traffic stop",
    "'Blue Jean' evokes the anxieties of being a gay teacher in the Thatcher era",
    "Mark Gunter / Getty Images for Art Hearts Fashion file",
    "White House bans trans activist for a topless photo at a Pride event",
    "David McNew / Getty Images file",
    "Starbucks denies union's accusation of banning Pride decorations",
    "Kevin Dietsch / Getty Images file",
    "Garth Brooks addresses 'stir' over saying his bar will serve Bud Light",
    "Kena Betancur / AFP via Getty Images file",
    "Most Asian Americans favor affirmative action, new Pew study shows",
    "The best at-home pizza ovens of 2023",
    "How to choose the best sunscreen",
    "The best cleaning tools to dust your home",
    "9 best teeth whitening treatments",
    "10 best face moisturizers for dry skin",
    "Top-rated portable ACs under $400",
    "45+ AAPI-owned food and beverage brands to shop right now",
    "11 expert-approved gas grills to shop",
    "7 best sales to shop this weekend",
    "Do Not Sell My Personal Information"
]