[
    "Gusher of cash reshapes GOP presidential contest",
    "EXCLUSIVE: Ron DeSantis administration officials solicit campaign cash from lobbyists",
    "After flubbed Twitter rollout, Ron DeSantis' team talks strategy with donors",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Budweiser parent is now offering money back to boost sales after trans marketing backlash",
    "Target quietly moved Pride merchandise in some stores as conservative activists declare victory",
    "There's growing evidence of marijuana's 'worrisome' link to mental health risks in young adults",
    "New York City's newest weed dispensary opens with a Black woman at its helm",
    "Hannah Rappleye / NBC News",
    "Months after residents sound the alarm, Pennsylvania 'cracks' down on Shell plant",
    "MAY 2022: Pollution killed 9 million in one year, on par with smoking",
    "Sergey Bobok / AFP - Getty Images",
    "Who are the anti-Putin groups behind the dramatic raid into Russia?",
    "U.S. distances itself from raid into Russia that involved American military vehicles",
    "Lloyd Fox / Baltimore Sun/Tribune News Service via Getty Images file",
    "Adnan Syed’s murder conviction on hold for now, as Maryland Supreme Court considers appeal",
    "Bettmann Archive / Getty Images",
    "Man declared innocent of attempted murder and freed after 33 years in California prison",
    "2 planes aborted landings when a Southwest jet taxied across their runways in San Francisco",
    "A North Dakota governor running for president? You betcha.",
    "Alex Brandon / AP fileAP file",
    "Republicans brace for 2022 losers to take another crack at winning",
    "Dylan Hollingsworth / Bloomberg via Getty Images file",
    "Texas House committee recommends Attorney General Ken Paxton be impeached",
    "Feds investigating if Menendez and wife got gifts including D.C. apartment, Mercedes and jewelry",
    "Doug Mastriano will not run for Senate in Pennsylvania in 2024",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Passenger opens plane door during flight in South Korea",
    "JIJI Press / AFP - Getty Images",
    "Suspect in killing of 4 people, including 2 police officers, in Japan captured after standoff",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Cuba's rural towns are hit hard with fuel shortages",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "On TikTok, there's always a new 'girl' aesthetic",
    "Amanda Edwards / Getty Images file",
    "After a year of long overdue Hollywood love, actor James Hong is still having his moment",
    "Fans around the world gather to remember Tina Turner's influence",
    "Plane lands safely after emergency door opened mid-flight",
    "Historic ‘Cotton Tree’ symbolizing Sierra Leone’s freedom falls during rainstorm",
    "Watch: Killer whale attack caught on camera near Morocco",
    "Hundreds of animals relocated to sanctuaries after Puerto Rico's only zoo closes",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "Tracking major Supreme Court cases",
    "Thomas Simonetti / The Washington Post via Getty Images",
    "Ron DeSantis is stuck in the middle and getting punched from above and below",
    "National Institute of Allergy and Infectious Diseases via AP",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board fines doctor who spoke about 10-year-old patient’s abortion",
    "China faces a new Covid wave that could peak at 65 million cases a week",
    "12 of the most common long Covid symptoms identified in long-awaited new report",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Government of Alberta Fire Service / The Canadian Press via AP file",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Justin Sullivan / Getty Images file",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "NSO spyware used in Armenia-Azerbaijan conflict, report finds",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Mireya Acierto / Getty Images file",
    "DeSantis' anti-DEI education law creates confusion and a 'chilling effect' on faculty",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "The NAACP's Florida travel advisory is less about traveling and more about Black voters",
    "Parker Seibold / The Gazette via AP file",
    "After Club Q shooting, New York woman accused of threats to Colorado LGBTQ businesses",
    "Don't expect everyone on 'The Ultimatum: Queer Love' to get their happy ending",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "After being wrongfully accused of spying for China, professor wins appeal to sue the government",
    "The best Memorial Day sales to shop now",
    "Memorial Day mattress and bedding sales to shop",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "7 best Amazon gaming week deals",
    "The best sunscreens for oily skin",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "Do Not Sell My Personal Information"
]