[
    "Brendan Smialowski / AFP via Getty Images file",
    "Space Command builds out Colorado HQ as Congress members try to force Alabama move",
    "Congress threatens to block funding for Space Command HQ",
    "Filip Singer / WPA Pool / Getty Images",
    "Turkey agrees to back Sweden's NATO bid, alliance secretary general says",
    "Big question hangs over NATO summit: Will Zelenskyy show up?",
    "NATO summit could test Biden's unity promise",
    "Triple-digits temperatures expected across U.S. Southwest as global heat shows no signs of easing",
    "61,000 Europeans may have died in last summer’s heatwaves, experts say",
    "World suffered its hottest day on record one week ago",
    "James Lewis, prime suspect in unsolved 1982 Tylenol murders case, dies at 76",
    "What are the Tylenol murders? Inside new efforts to solve the 40-year-old case",
    "AP; @zahakos; USA Today Network; NBC News",
    "Severe storms move over the Northeast after deadly flash flooding in New York",
    "Harrowing images of Northeast floods show submerged cars and collapsed roads",
    "Woman dies after being swept away by rapid waters in New York",
    "Look up: Northern Lights could be visible in 17 states this week",
    "Scott Olson / Getty Images file",
    "Larry Nassar was stabbed multiple times at Florida federal prison",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "Kansas City super fan 'ChiefsAholic' suspected in string of bank robberies across Midwest",
    "Man shooting victims at random while riding a scooter is arraigned, officials say",
    "California fugitive involved in fatal hostage standoff is captured, sheriff's office says",
    "Chip Somodevilla / Getty Images",
    "A collision course over government funding raises fears of a shutdown",
    "Curtis Means / Pool/DailyMail via AP file",
    "Steve Bannon ordered to pay his lawyers almost $500,000 in fees",
    "Roy Herron, longtime Tenn. Democratic lawmaker, dies at 69 after injuries from jet ski accident",
    "Texas Democrat Roland Gutierrez enters U.S. Senate race, pushed for gun legislation after Uvalde",
    "Biden meets with King Charles III and Rishi Sunak ahead of NATO summit",
    "Putin met Prigozhin days after mercenary leader led mutiny",
    "Belarusian tennis player booed at Wimbledon after losing to Ukrainian",
    "Son of renowned Guatemalan journalist fights for father's freedom a year after imprisonment",
    "6 killed in stabbing at kindergarten in China",
    "Britain's BBC faces questions as presenter is accused of paying teenager for pictures",
    "Madonna shares first health update since spending days in ICU with bacterial infection",
    "Harry Styles appears to be latest musician hit by an object while performing onstage",
    "Elton John bids an emotional farewell as he ends his final tour: 'I'm trying to process it'",
    "YouTuber Colleen Ballinger has several live shows and podcast canceled",
    "The 10 strangest, most troubling allegations about Ye's Donda Academy",
    "Leila Register / NBC News; OceanGate Expeditions via AP",
    "A crypto prediction market draws bets and outrage on viral events",
    "Murat Kocabas / Sipa USA via AP",
    "Twitter traffic is 'tanking' as Meta's Threads hits 100 million users",
    "Europe signs off on a new privacy pact that allows people’s data to keep flowing to U.S.",
    "Sarah Silverman sues Meta and OpenAI for copyright infringement",
    "Baby boomers and their cash are driving the housing market right now",
    "The 8 best vacuums to shop",
    "Early Prime Day deals to shop right now",
    "Thomas Barwick / Getty Images",
    "Best head shavers to use at home",
    "What are the benefits of blackout curtains?",
    "The best products to buy during Prime Day",
    "Dangerous boat jumping challenge leaves at least 4 dead",
    "How to maximize savings on Amazon Prime Day",
    "Powerball and Mega Millions jackpots reach combined $1B",
    "Logan Paul’s PRIME energy drink faces scrutiny",
    "Julie Bennett / Getty Images file",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Betty Laura Zapata / Bloomberg via Getty Images file",
    "What’s it like to have a bounty on your head for supporting democracy?",
    "Dozens of witnesses have testified as the Jan. 6-focused grand jury probes Trump",
    "FDA asked to investigate Logan Paul’s energy drink, PRIME, which has the caffeine of 6 Coke cans",
    "3 Georgia teens charged with murder after plot to egg a home goes wrong, police say",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "Kidney stones on the rise in children, doctor says",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Biden highlights new efforts to lower health care costs and limit 'junk fees'",
    "Valentine Chapuis / AFP via Getty Images file",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Monica Morgan / WireImage file",
    "Hill Harper, an actor on ‘CSI: NY’ and ‘The Good Doctor,’ announces Senate bid in Michigan",
    "Jim Hughes / NY Daily News via Getty Images",
    "Mutulu Shakur, Black liberation activist and stepfather of Tupac, dies at 72",
    "Brandon Bell / Getty Images/FILE",
    "Lawsuit seeking reparations for Tulsa Race Massacre is dismissed",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Wisconsin school district can’t restrict bathrooms for trans student, judge says",
    "Kansas judge says trans people can no longer change sex listing on driver’s licenses",
    "Families with trans kids are increasingly forced to travel out of state for health care",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Do Not Sell My Personal Information"
]