[
    "Justice Department reverses course on defending Trump in E. Jean Carroll case",
    "Georgia grand juries impaneled as Trump probe decision looms",
    "Stanislav Kogiku  /  SOPA Images/Sipa via AP Images file",
    "Discord bans AI-generated child sex abuse material and teen dating on platform",
    "In hidden Discord communities, adults are abusing and extorting children",
    "'It's horrifying': Discord CEO on child abuse issues after NBC News investigation",
    "Tom Williams / CQ-Roll Call Inc. via Getty Images file",
    "Freedom Caucus won't say if Marjorie Taylor Greene has been booted: 'It's none of your business'",
    "Freedom Caucus members voted to oust Rep. Marjorie Taylor Greene. It's unclear if it worked.",
    "Manson family killer Leslie Van Houten freed on parole",
    "Manson family killer will be paroled, lawyer says, after Gov. Newsom drops fight",
    "Triple-digit temperatures persist across Southwest as heat dome expands",
    "How hot is too hot for the human body to function optimally?",
    "61,000 Europeans may have died in last summer’s heat waves, experts say",
    "Francis Chung / POLITICO via AP",
    "Mark Wilson / Getty Images file",
    "Ron DeSantis says he wouldn't be Trump's running mate: 'I'm not a No. 2 guy'",
    "Yuri Gripas / Abaca/Bloomberg via Getty Images file",
    "Biden confronts a 'pissed-off generation' of young voters who may be decisive in 2024",
    "GOP House 'informant' indicted on allegations he was an agent for China",
    "Rioter who stormed Capitol while on bail on an attempted murder charge gets 3 years",
    "Trump denounces Biden's decision to send cluster munitions to Ukraine",
    "Secret Service to brief House committee about White House cocaine",
    "Paul Natkin / Getty Images file",
    "Jury decides 2014 document found in Aretha Franklin's couch is a valid will",
    "Ringo Chiu / SOPA Images/Sipa USA via AP",
    "California hotel workers on strike demand higher wages and a chance to live closer to work",
    "Jessica Rinaldi / Boston Globe via Getty Images",
    "Vermont floods have led to more than 100 rescues, officials say",
    "Great white sharks killing seals 'very close' to Nantucket prompts swimming ban",
    "Where you can get birth control from a pharmacist without a doctor's prescription",
    "Randy Travis' stagehand shot dead by wife over alleged affair, Nashville police say",
    "Black men are at an increased risk for melanoma, study finds",
    "Eva Marie Uzcategui / Bloomberg via Getty Images",
    "John Shearer / Getty Images",
    "Ticketmaster halts Taylor Swift Eras Tour sales in France",
    "Mark Kauzlarich / Bloomberg via Getty Images file",
    "Microsoft-Activision deal moves closer as judge denies FTC injunction request",
    "Microsoft to lay off more employees months after letting 10,000 workers go",
    "Petras Malukas / AFP - Getty Images",
    "NATO to offer Ukraine invitation once ‘conditions are met’",
    "Visual China Group via Getty Images file",
    "Coco Lee's death sheds light on the lack of mental health awareness in China",
    "In Cuba, there's little change two years after historic protests",
    "Olympic champion Caster Semenya wins appeal against testosterone rules in human rights court",
    "At least 5 dead after helicopter carrying foreign tourists crashes near Mount Everest",
    "Nearly one-sixth of Ecuador's prison inmates haven't been sentenced",
    "Israelis block major highways in nationwide protests of government's plan to overhaul judiciary",
    "We found 97+ of the best Prime Day deals",
    "The best Prime Day Nintendo Switch deals",
    "Vivian Le / NBC ; Location Courtesy of VikingVivian Le / NBC",
    "The best Prime Day Apple deals",
    "The 21 best Prime Day vacuum deals",
    "The best Prime Day home and kitchen deals",
    "Amazon Prime Day 101: How to find the best deals",
    "Madonna thanks fans for support after hospitalization",
    "Seven locally transmitted malaria cases found in Florida and Texas",
    "Sen. Schumer seeks FDA probe of PRIME energy drinks",
    "Leila Register / NBC News; OceanGate Expeditions via AP",
    "A crypto prediction market draws bets and outrage on viral events",
    "Julie Bennett / Getty Images file",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "Baby boomers and their cash are driving the housing market right now",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Win McNamee / Getty Images file",
    "House GOP conservatives send McCarthy an ultimatum on funding the government",
    "Charlie Neibergall / AP file",
    "Trump feuds with Iowa Gov. Kim Reynolds",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "FDA asked to investigate Logan Paul’s energy drink, PRIME, which has the caffeine of 6 Coke cans",
    "John Shearer / TAS23/Getty Images for TAS Rights Management",
    "'Top Chef' reveals Kristen Kish will replace Padma Lakshmi as host",
    "Britney Spears set to release memoir 'The Woman in Me' in October",
    "AndreyPopov / Getty Images/iStockphoto",
    "White House wants to reduce 'tranq dope' deaths by 15% within the next two years",
    "Logan Paul's PRIME Energy drink prompts concerns about the risks of caffeine for kids",
    "Northern lights unlikely to be seen across U.S. despite early forecast",
    "Laura Betz / NASA via AP file",
    "Webb Space Telescope spots most distant black hole yet — and more may be lurking",
    "Hot and getting hotter: South and Southwest U.S. face triple-digit temperatures",
    "U.S. Department of Justice via AP",
    "American accused of killing three women in Tijuana arrested in California",
    "Nicaragua police jail another Catholic priest in latest crackdown on clergy",
    "Big Freedia’s remix of a classic children’s song goes viral",
    "Monica Morgan / WireImage file",
    "Hill Harper, an actor on 'CSI: NY' and 'The Good Doctor,' announces Senate bid in Michigan",
    "James Williamson / AMA via Getty Images file",
    "A record 87 out LGBTQ athletes will compete in the Women's World Cup",
    "Simon Russell / Getty Images file",
    "Jeffrey Carlson, 'All My Children' actor,  dies at 48",
    "Russia's first transgender politician drops her run for governor due to anti-LGBTQ bill",
    "Christopher Ruppel / Allsport/Getty Images file",
    "Mikala Jones, Hawaii surfer known for making videos inside waves, dies in surfing accident",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Do Not Sell My Personal Information"
]