[
    "Alex Chan Tsz Yuk / SOPA Images/Sipa USA via AP file",
    "How the U.K. is trying to pressure other nations into arming Ukraine",
    "GOP candidates criticize Trump for praising Kim Jong Un",
    "Porn stars vs. parenthood: Ron DeSantis plays the family card against Trump",
    "Samuel Corum / Getty Images file",
    "D.C. rattled by boom from fighter jets sent to check private plane",
    "Florian Gaertner / Photothek via Getty Images file",
    "Ozempic and Wegovy force weight-loss companies to upend their longstanding strategies",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "nechaev-kon / Getty Images/iStockphoto",
    "Is Covid ticking up? Viruses and other bugs could make a summer comeback",
    "12 of the most common long Covid symptoms identified in long-awaited new report",
    "Scott Olson / Getty Images",
    "Grand jury in Trump classified documents case expected to meet this coming week after hiatus",
    "Immigrant health care workers can face harsh working conditions and $100,000 lawsuits for quitting",
    "Daniel Acker / Bloomberg via Getty Images file",
    "Who receives food benefits? It may not be who you think",
    "Bill Clark / CQ-Roll Call via AP file",
    "Sen. Rounds won't commit to support eventual GOP nominee if it’s not Tim Scott",
    "Biden signs bipartisan debt ceiling bill to avert government default",
    "Former Trump lawyer compares classified documents case to Hillary Clinton’s emails",
    "Here's what's going on with Texas Attorney General Ken Paxton's impeachment",
    "Missing man’s body recovered at Iowa apartment collapse site; two others still missing",
    "7 shot, 1 fatally, in Chicago when gunfire erupts amid remembrance for man killed in car crash",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Daughter, granddaughter charged after 71-year-old Maryland grandmother killed, police say",
    "Pennsylvania teen fatally shot after he allegedly struck two troopers with car, police say",
    "Lightning strike blamed for fire at Louisiana oil tank farm that prompted evacuations",
    "Man confesses to killing landlord 15 years ago, police recordings show",
    "Chuck Todd to depart 'Meet the Press'; Kristen Welker to become host",
    "Eliot Blondet / Sipa via AP Images file",
    "Elon Musk’s response to an anti-trans video sparked 24 hours of chaos at Twitter",
    "Olly Curtis / Future via Getty Images files",
    "YouTube will stop removing false claims about 2020 election fraud",
    "Chase online banking issue causes double transactions and fees",
    "Buy Buy Baby draws sale interest in Bed Bath & Beyond bankruptcy",
    "Abhishek Chinnappa / Getty Images",
    "Signal error blamed for deadly India train crash",
    "Roslan Rahman / AFP - Getty Images",
    "China defends buzzing American warship and accuses the U.S. of provocation",
    "VANO SHLAMOV / AFP - Getty Images",
    "Supporters of Russian opposition leader Navalny hold protests to mark his birthday",
    "Arrests and tight security in Hong Kong on Tiananmen Square anniversary",
    "North Korean leader’s sister vows 2nd attempt to launch spy satellite, slams U.N. meeting",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Most Americans say companies should publicly support LGBTQ community, survey finds",
    "Pregnant transgender man stars on cover of Glamour UK’s Pride issue",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Videos capture sonic boom heard across Washington Metropolitan area",
    "Moms on Mushrooms uses psychedelics to treat depression",
    "Bear breaks in and eats 60 cupcakes at Connecticut bakery",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "Instead of door-knocking, they were at the casino: Inside the flawed GOP turnout operation",
    "Robert F. Bukaty / AP file",
    "Ron DeSantis loses his temper with a reporter: 'Are you blind?'",
    "Jemal Countess / Getty Images",
    "Senate votes to overturn Biden’s student loan relief program",
    "Charlotte County Sheriff's Office",
    "Girl, 4, found dead in Florida canal after wandering away from her family's vacation rental",
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Drones strike Moscow in first attack on capital's residential areas since the war began",
    "Akilah Townsend / NBC News",
    "Jasmin Merdan / Getty Images",
    "Why are people always debating proper plane etiquette on TikTok?",
    "Cynthia Weil, 'You’ve Lost That Lovin’ Feeling' songwriter and Grammy-winner, dies at 82",
    "Padma Lakshmi announces she’s leaving ‘Top Chef’ after 17 years",
    "Erika P. Rodríguez for NBC News",
    "Younger people left this U.S. territory for better jobs. Who takes care of the seniors?",
    "Women more likely than men to skip or delay medications due to cost, CDC report finds",
    "Woman who refused tuberculosis treatment is in custody months after an arrest warrant was issued",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Olivier Touron / AFP via Getty Images file",
    "A quarter of all children in the U.S. are Latino, U.S. census study finds",
    "Jalisco State Prosecutor's Office",
    "45 bags of human remains found in western Mexico amid search for missing call center workers",
    "Michael Brochstein / Sipa USA via AP file",
    "32 Mississippi school districts still under federal desegregation orders",
    "Ron DeSantis fires back at NAACP over travel advisory, education and shootings",
    "Brandon Bell / Getty Images file",
    "Texas bans gender-affirming care for minors after Gov. Abbott signs bill",
    "Rodin Eckenroth / Getty Images file",
    "Pride Night celebrations at the ballpark were largely uncontroversial — until now",
    "Some trans people turn to crowdfunding to leave Florida after anti-LGBTQ laws",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "Greta Lee of 'Past Lives' says truthful storytelling means not serving the white male gaze",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "Do Not Sell My Personal Information"
]