[
    "Chip Somodevilla / Getty Images",
    "A collision course over government funding raises fears of a shutdown",
    "Battle over government spending poised to escalate when Congress returns from recess",
    "Big question hangs over NATO summit: Will Zelenskyy show up?",
    "Putin met Prigozhin days after mercenary leader led mutiny",
    "Mike Pence backs U.S. sending cluster munitions to Ukraine",
    "AP; @zahakos; USA Today Network; NBC News",
    "Severe storms move over the Northeast after deadly flash flooding in New York",
    "Harrowing images of Northeast floods show submerged cars and collapsed roads",
    "Woman dies after being swept away by rapid waters in New York",
    "Look up: Northern Lights could be visible in 17 states this week",
    "Leila Register / NBC News; OceanGate Expeditions via AP",
    "A crypto prediction market draws bets and outrage on viral events",
    "Scott Olson / Getty Images file",
    "Larry Nassar was stabbed multiple times at Florida federal prison",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "James Lewis, prime suspect in unsolved 1982 Tylenol murders case, dies at 76",
    "Maine father drowns while trying to save daughters swept out to deep water of pond",
    "Families with trans kids are increasingly forced to travel out of state for health care",
    "Biden meets with King Charles III and Rishi Sunak ahead of NATO summit",
    "Denis Doyle / Getty Images file",
    "NATO summit could test Biden's unity promise",
    "Roy Herron, longtime Tenn. Democratic lawmaker, dies at 69 after injuries from jet ski accident",
    "Dozens of witnesses have testified as the Jan. 6-focused grand jury probes Trump",
    "Ron DeSantis' presidential bid is giving life to a struggling Florida Democratic Party",
    "Madonna shares first health update since spending days in ICU with bacterial infection",
    "Harry Styles appears to become latest musician to be hit by an object while performing onstage",
    "Brill / ullstein bild via Getty Images file",
    "YouTuber Colleen Ballinger has several live shows and podcast canceled",
    "Elton John bids an emotional farewell as he ends his final tour: 'I'm trying to process it'",
    "Sarah Silverman sues Meta and OpenAI for copyright infringement",
    "Belarusian tennis player booed at Wimbledon after losing to Ukrainian",
    "Europe signs off on a new privacy pact that allows people’s data to keep flowing to U.S.",
    "6 killed in stabbing at kindergarten in China",
    "Son of renowned Guatemalan journalist fights for father's freedom a year after imprisonment",
    "U.S. drone strike kills an Islamic State group leader in Syria, the Defense Department says",
    "Early Prime Day deals to shop right now",
    "Thomas Barwick / Getty Images",
    "Best head shavers to use at home",
    "Moyo Studio / Getty Images",
    "What are the benefits of blackout curtains?",
    "The best products to buy during Prime Day",
    "Kitchen Appliances and Tools",
    "How to choose the best air fryer for you",
    "Dangerous boat jumping challenge leaves at least 4 dead",
    "How to maximize savings on Amazon Prime Day",
    "Powerball and Mega Millions jackpots reach combined $1B",
    "Logan Paul’s PRIME energy drink faces scrutiny",
    "Julie Bennett / Getty Images file",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "Baby boomers and their cash are driving the housing market right now",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Betty Laura Zapata / Bloomberg via Getty Images file",
    "What’s it like to have a bounty on your head for supporting democracy?",
    "Brendan Smialowski / AFP via Getty Images file",
    "3 Georgia teens charged with murder after plot to egg a home goes wrong, police say",
    "Videos of unconscious boys' rapes found on phone left at restaurant, police say",
    "Murat Kocabas / Sipa USA via AP",
    "Twitter traffic is 'tanking' as Meta's Threads hits 100 million users",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "Kidney stones on the rise in children, doctor says",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Biden highlights new efforts to lower health care costs and limit 'junk fees'",
    "Mark Felix / AFP - Getty Images",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Mario Tama / Getty Images file",
    "El Paso Walmart mass shooter sentenced to 90 life terms",
    "Brandon Bell / Getty Images/FILE",
    "Lawsuit seeking reparations for Tulsa Race Massacre is dismissed",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Mike Coppola / Getty Images file",
    "Keke Palmer is the latest Black mother facing backlash over what she wears",
    "U.S. Forest Service and HBCUs unite to boost diversity in wildland firefighting",
    "From 'Barbie' to 'Joy Ride,' July's hottest releases hit the big screen",
    "Trans woman, bookstore, teacher sue over Montana law banning drag reading events",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Do Not Sell My Personal Information"
]