[
    "Natalia Kolesnikova / AFP via Getty Images",
    "Ukraine counteroffensive has 'no chance,' Putin says as Russians brace for long war",
    "Russia will lose the war if Ukraine's counteroffensive succeeds, Zelenskyy says",
    "Belarus starts taking delivery of Russian nuclear weapons",
    "Nicholas Kamm / AFP via Getty Images file",
    "Secure bathrooms to 'not a spy': Here's how Republicans are defending Trump",
    "Pence jabs at GOP opponents, calling promises to pardon Trump 'premature'",
    "Biden allies start to chafe at Democrats' silent treatment of Trump indictment",
    "Catholic and other religious protesters gather at Dodger Stadium on Pride Night",
    "Meet the drag nuns caught up in the culture war over Pride events",
    "Saul Loeb / AFP via Getty Images",
    "Biden gambles that delaying sanctions and playing down espionage will improve China relations",
    "EXCLUSIVE: Biden wanted to speak with China's Xi after U.S. shot down surveillance balloon",
    "Leila Register / NBC News; Twitter",
    "How many people are watching Tucker Carlson’s new show on Twitter?",
    "Fox News sends Tucker Carlson cease-and-desist letter over new Twitter show",
    "Andrew Caballero-Reynolds / AFP via Getty Images file",
    "After a pause, Biden and Harris accelerate campaign cash dash",
    "Scott Olson / Getty Images",
    "Inside the $100 million door-knocking effort to boost Ron DeSantis",
    "Oath Keepers lawyer's trial delayed for competency treatment",
    "DOJ probe into Minneapolis police finds racial discrimination and excessive force",
    "Expert report fuels election doubts as Georgia waits to update voting software",
    "Florida man sentenced to almost 5 years for attacking officer at Capitol insurrection",
    "Six dead after gunfire, blaze erupt where gunman's estranged wife lived, sheriff says",
    "Doctors' group raises new alarm about 'unsafe' weighted sleep sacks for infants",
    "Roy Rochlin / Getty Images file",
    "Pete Davidson charged with reckless driving after crashing car into Beverly Hills house",
    "Daniel Ellsberg, Pentagon Papers whistleblower, dies at 92",
    "Arizona man fatally mauled by black bear while drinking morning coffee",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Father charged with killing 3 sons as surviving daughter fled home screaming",
    "Greg Doherty / Variety via Getty Images",
    "Reddit CEO praises Elon Musk’s cost-cutting as protests rock the platform",
    "Techa Tungateja / Getty Images",
    "Justin Sullivan / Getty Images",
    "UPS workers vote to authorize strike while cheering unexpected progress on heat safety",
    "Michael Jordan selling his majority  ownership of the Charlotte Hornets",
    "Senators question Uber and Lyft on human trafficking risks",
    "Dozens protest L.A. Dodgers for honoring drag group at Pride Night",
    "Flamin’ Hot Cheetos film reignites debate over origin story",
    "Daniel Ellsberg, who leaked the Pentagon Papers, dies at 92",
    "Driver rescued after his car plunges off a dock in New York",
    "Justine Goode / NBC News; Getty Images",
    "How women broke barriers in the hip-hop fashion industry",
    "Kevin Mazur / Getty Images for Parkwood file",
    "Beyoncé shows blamed for fueling inflation in Sweden",
    "How Modelo Especial became America's No. 1 beer amid Bud Light's rapid decline",
    "Yavapi County Sheriff's Office via Facebook",
    "Colombia's Armed Forces Press Office via AP",
    "Indigenous plane crash searchers turned to ayahuasca to find missing kids",
    "Jamal Khashoggi's widow speaks out",
    "At least 25 killed in attack on school in Uganda",
    "It’s already a hot start to what is expected to be a hot summer",
    "Sante Fe County Sheriff's Office",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "Chris Polk / Getty Images file",
    "Gavin Rossdale says he and ex Gwen Stefani don't 'co-parent' their three sons",
    "NBA suspends Ja Morant 25 games for waving a gun on Instagram Live",
    "'The Flash' gives a nod to Latin music fans with this glimpse of a classic",
    "Disease screening for newborns varies by state. For some, that means diagnoses come too late.",
    "Patrick Smith / Getty Images",
    "Tori Bowie’s death shows how pervasive racial disparities are in maternal health",
    "Rates of a 'silent' liver disease are soaring, new research shows",
    "FDA asks drugmakers to update Covid boosters to target XBB.1.5 for the fall",
    "Biden picks North Carolina's former health chief, Mandy Cohen, to run CDC",
    "'It's my future': Montana youth undertake one of the world's most high-profile climate trials",
    "Chemical traces offer evidence of the universe's earliest stars",
    "Theo Wargo / Getty Images for Songwriters Hall of Fame",
    "Gloria Estefan makes history with induction into Songwriters Hall of Fame",
    "Montinique Monroe / Getty Images file",
    "Texas Gov. Abbott signs law shutting diversity offices at public universities",
    "Courtesy Warner Bros. Pictures and DC Comics",
    "Jose M. Osorio  / Chicago Tribune via Getty Images file",
    "Chicago police officer fired over raid at the wrong home where a Black woman was handcuffed naked",
    "Tennessee Democrats expelled over protests win primaries for their old seats",
    "Presidential hopeful Francis Suarez opposes 'Don't Say Gay' expansion backed by DeSantis",
    "Mark Gunter / Getty Images for Art Hearts Fashion",
    "Trans activist apologizes for going topless at a White House Pride event",
    "David Zalubowski / AP file",
    "Suspect in mass shooting at Colorado gay nightclub is expected to take a plea deal",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "First Muslim woman confirmed as a federal judge",
    "Charley Gallay / Getty Images for Disney",
    "Ke Huy Quan surprises Harrison Ford on 'Indiana Jones' red carpet",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "The best at-home pizza ovens of 2023",
    "Do Not Sell My Personal Information"
]