[
    "House passes Biden-McCarthy debt ceiling bill",
    "Tom Williams / CQ Roll Call via AP",
    "The bill heads to the Senate with days to spare ahead of Monday’s default deadline",
    "Just now9m agoMcCarthy 'didn't talk much' with Trump about debt deal",
    "Just now24m agoSchumer preps debt ceiling bill to start the process tomorrow",
    "Just now26m agoHow the debt ceiling deal got done",
    "Just now36m agoMcCarthy says 'we did pretty dang good' for Americans",
    "McCarthy celebrates House vote: 'Tonight we all made history'",
    "Chip Somodevilla / Getty Images file",
    "A break-glass option, gumbo and a bike ride: How the debt ceiling deal got done",
    "Kent Nishimura / Los Angeles Times via Getty Images file",
    "What the debt ceiling deal would mean for student loan payments and forgiveness",
    "Myung J. Chun / Los Angeles Times via Getty Images",
    "'That ’70s Show' star Danny Masterson convicted of two counts of rape",
    "L.E. Baskow / Las Vegas Review-Journal",
    "Pentagon leaders cancel drag show at a Nevada Air Force base",
    "LGBTQ flag burned at California elementary school ahead of Pride event",
    "MLB players say drag troupe invited to Dodgers' Pride Night mocks Christianity",
    "'Trump Bucks' websites taken down after being exposed for selling bogus currency",
    "EXCLUSIVE: ‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "Leigh Henningham / Monash Turner Institute",
    "The shape of your brain may strongly influence your thoughts and behavior, study finds",
    "Bruce Willis’ daughter Tallulah reveals the first signs he had dementia",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Mike Pence is set to launch his presidential campaign next week",
    "Congress threatens to block funding for Space Command HQ as abortion laws impact location decision",
    "Abbott appoints interim attorney general in Texas following Paxton’s impeachment",
    "Kevin Dietsch / Getty Images",
    "Pentagon is blocking U.S. cooperation with international investigations of war crimes in Ukraine",
    "Oklahoma high court strikes down 2 abortion bans; procedure remains illegal in most cases",
    "A verified AOC parody account got a boost from Elon Musk’s Twitter",
    "House Oversight chair prepares to hold FBI director in contempt over document in Biden probe",
    "Majority of Americans favor affirmative action in colleges as Supreme Court seems poised to end it",
    "Lowndes County Sheriff’s Office",
    "Police video shows a car rocketing off a tow truck on a Georgia highway",
    "Tenants of partially collapsed building in Iowa say complaints were ignored for years",
    "Doug Lindey / The Journal via AP file",
    "Hawaii man pleads guilty and is fined following death of Yellowstone bison calf",
    "Ex-CIA officer accused of abusing women may walk free because of how feds searched his phones",
    "Nun whose body shows little decay since 2019 death draws hundreds to rural Missouri",
    "Alex Murdaugh pleads not guilty — for now — to federal wire fraud and money laundering charges",
    "New York man is fired after a woman accused him of ripping her wig off in the street",
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "Gints Ivuskans / AFP - Getty Images",
    "Latvian Parliament elects first openly gay president of a Baltic nation",
    "North Korean spy satellite launch fails",
    "An airline is asking passengers to weigh in before their flights",
    "Chinese jet flew past nose of U.S. plane, Pentagon says",
    "Sudan’s military says it has suspended its participation in talks with paramilitary rival",
    "Kim Cattrall couldn't stay away from 'Sex and the City' role after all",
    "Katie Jones / Variety / Penske Media via Getty Images file",
    "Actor Armie Hammer won’t face sexual assault charge",
    "Months after Adidas cut ties with Kanye West, Yeezy shoes are back on sale",
    "Sean ‘Diddy’ Combs files lawsuit alleging race played a role in marketing of his liquor brands",
    "Al Pacino, 83, is expecting a baby with girlfriend, Noor Alfallah, 29",
    "Actor Danny Masterson found guilty of rape",
    "Dramatic car flip caught on camera",
    "Watch: Dashcam captures missile falling on busy Kyiv highway",
    "NASA and Pentagon officials present UFO preliminary findings",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "China rejects meeting with Pentagon chief in a setback for U.S. hopes of a thaw",
    "Joel Saget / AFP - Getty Images",
    "AI risks leading humanity to 'extinction,' experts warn",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Danny Masterson found guilty of rape",
    "Anna Moneymaker / Getty Images",
    "Live updates: House vote comes days ahead of default deadline",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images",
    "Amazon.com's Ring will pay $5.8 million after employees spied on customer videos",
    "LGBTQ activists call for new strategies to promote equality after Target backlash",
    "South_agency / Getty Images",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "Paras Griffin / Getty Images file",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "Sign with a homophobic slur in front of Florida business sparks backlash",
    "Filipino cuisine gets a nod in one of the U.S.'s highest culinary honors",
    "Leila Register / Getty Images",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "Do Not Sell My Personal Information"
]