[
  "Eyewitnesses recall horrifying scenes from the Texas mall shooting",
  "Live Updates / Patch on shooter's chest included a right-wing acronym, officials say",
  "Gunman was a 33-year-old suspected neo-Nazi sympathizer, officials say",
  "8 dead, at least 10 injured after vehicle plows into group near Texas border migrant center",
  "VIDEO: Vehicle crash in Brownsville leaves multiple dead",
  "Drew Angerer / Getty Images file",
  "Biden prepares to take debt ceiling battle to vulnerable GOP lawmakers",
  "Debt limit debate endangers already fragile U.S. economic outlook",
  "Jeffries won't commit to a short-term debt ceiling deal, insists on clean increase",
  "Ron DeSantis bets big on his Disney feud",
  "Gay fans who want to visit Disney say DeSantis' policies loom over 'the happiest place on earth'",
  "Disney fans are fighting online after the company sued DeSantis",
  "Herika Martinez  / AFP - Getty Images",
  "Everything you need to know about Title 42 ahead of its end date",
  "Mayorkas says Biden administration has targeted smugglers and is ready at the border",
  "Biden shifts southern border strategy — without congressional action behind him",
  "Nicholas Kamm / AFP via Getty Images file",
  "Trump won't testify in E. Jean Carroll rape and defamation trial after judge's deadline passes",
  "U.S. seek 25 years for Oath Keepers founder Stewart Rhodes in seditious conspiracy case",
  "Valerie Plesch / Bloomberg via Getty Images file",
  "GOP states trying to stop Biden's student loan forgiveness push their own relief programs",
  "GOP committee chair threatens Blinken with contempt of Congress over Afghan withdrawal information",
  "Senators love Tim Scott, but they're not ready to endorse him for president",
  "Nick Gilbert, the son of Cleveland Cavaliers owner Dan Gilbert, dies at 26",
  "Courtesy; Jordan Vonderhaar for NBC News",
  "Uvalde teacher who survived the mass shooting feels 'abandoned' by the school district",
  "California reparations panel OKs recommendations on state apology, payments",
  "Jordan Neely struggled with not being able to help his mother before her murder, attorney says",
  "17-year-old girl killed and 5 people wounded in shooting at a party in California",
  "Morteza Nikoubazl / NurPhoto via Getty Images",
  "Iran hangs 2 in rare blasphemy case as executions surge",
  "Hector Retamal / AFP - Getty Images",
  "China says it's imperative to stabilize U.S. relations",
  "Prince William invokes late Queen in tribute to King Charles at coronation concert",
  "At least 22 dead as tourist boat capsizes in southern India",
  "Russian mercenary chief 'promised ammunition' after threatening Bakhmut retreat",
  "Leila Register / NBC News; HoliCHIC and Dawang",
  "Talk therapy falls short for many Asian Americans. They've turned to centuries-old alternatives.",
  "The chronically online third culture is redefining Asian America",
  "New graduate to work at the same prosthetics center that helped her after terrible accident",
  "King Charles III celebrates first full day as newly coronated king",
  "Austin man changes lives for homeless with faith-based community",
  "Hawaii tourists rescued from water after GPS mishap",
  "Leila Register / NBC News; Getty Images; FBI",
  "Jan. 6 rioter in pink beret identified after ex spotted her in a viral FBI tweet",
  "In coastal Bangladesh, climate change devastates women’s reproductive health",
  "David Paul Morris / Bloomberg via Getty Images file",
  "A summer kitchen staple could be in short supply and cost more after record rainfall in California",
  "Leila Register / Getty Images",
  "Black Americans say white vigilantism played a role in Jordan Neely's homicide",
  "Stewart F. House / Getty Images",
  "Johannes Eisele / AFP via Getty Images file",
  "annual shareholder meeting",
  "Warren Buffett says bank runs would have been 'catastrophic' without government intervention",
  "ChatGPT is powered by these contractors making $15 an hour",
  "Graeme Sloan / Sipa USA via AP file",
  "Jenny Craig employees file a class-action lawsuit claiming the company violated the WARN Act",
  "'Yellowstone' to end this fall and it's not clear that Kevin Costner will be involved",
  "Chelsea Stahl / NBC News; Getty Images",
  "TikTok users slam recent weight loss trend videos as fatphobic",
  "Harry, Meghan, Andrew and more: Some of the controversies hanging over Charles's coronation",
  "F1 star Lewis Hamilton to wear rainbow helmet for LGBTQ rights",
  "What is Cinco de Mayo? A teacher's TikTok videos put a Gen Z lens",
  "FDA weighing first over-the-counter birth control pill",
  "Joe Raedle / Getty Images file",
  "CDC's Covid tracking changes come as '99 percent plus' of the U.S. is at low levels",
  "'Taylor's Gift' provides support to families of organ donors",
  "FDA appears skeptical about over-the-counter birth control pill",
  "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
  "Mario Tama / Getty Images file",
  "Record ocean temps and a predicted El Niño have weather forecasters on watch",
  "In a galactic first, a star is seen swallowing a planet in one gulp",
  "Manchin introduces bill to speed energy permitting",
  "Kevin Dietsch / Getty Images file",
  "'Living in anarchy': Migrants wait in Mexico one week before the end of Title 42",
  "Andrew Savulich / New York Daily News/TNS via Getty Images file",
  "Marine who put Jordan Neely into chokehold on subway acted in self-defense, lawyers say",
  "Jordan Neely’s death reflects inhumane consequences for being homeless, experts say",
  "Brandon Bell / Getty Images",
  "Texas AG to investigate Austin children’s hospital over transgender care for minors",
  "Leila Register / NBC News / Getty Images",
  "Dan Istitene / Formula 1 via Getty Images",
  "John Amis / AP Images for Human Rights Campaign file",
  "Pride organizers keep eye on drag laws ahead of festivals",
  "Tim Graham Photo Library / via Getty Images file",
  "South Asians watch another monarch ascend the throne that devastated their families",
  "Justine Goode / NBC News /  Getty Images",
  "Mandel Ngan / AFP - Getty Images",
  "Kamala Harris gets personal at White House Asian American heritage celebration",
  "Oura; Le Creuset; Solo Stove",
  "7  best sales to shop this week",
  "Gift these flowers and plants for Mother's Day",
  "9 best new products so far this May",
  "Top-rated carry-on luggage you need before summer travel season",
  "Amazon; Brooks Running; Spanx; NBC",
  "Select Wellness Awards: Shop the winners as seen on TODAY",
  "Select Wellness Awards winners available on Amazon",
  "Select Wellness Awards 2023: Under $25",
  "11 top-rated travel pillows to consider",
  "See all of the Select Best of Wellness Awards winners",
  "Amazon's Pet Day: Deals still live",
  "Do Not Sell My Personal Information"
]
