[
    "Kremlin says charges against mercenary chief will be dropped after forces turn back from Moscow",
    "Prigozhin will move to Belarus and fighters will not be prosecuted, Putin spokesperson says",
    "Just now32m agoVideo shows explosion at oil depot in Voronezh, Russia",
    "Just now43m agoUkrainian officials report progress in counter-offensive",
    "Just now1h agoRussian state media says criminal case against Prigozhin will be dropped",
    "Just now1h agoHouse Armed Services chair: 'Both Prigozhin and Putin are murderous thugs'",
    "A look at the mercenary group accused of ‘armed mutiny’ in Russia",
    "Putin calls armed rebellion ‘a stab in the back’ in national address",
    "Marco Gualazzini / Contrasto / Redux",
    "Notorious Russian mercenaries exploit a war-torn African nation",
    "On anniversary of Roe v. Wade reversal, Harris says the ruling created a 'health care crisis'",
    "One year without Roe v. Wade: How abortion access has changed in America",
    "Democrats lean on abortion to flip the House — but there’s a catch",
    "The 5 biggest state government trends on abortion",
    "These pilots fly women who need abortions to states where it's allowed",
    "San Antonio Police Department via YouTube",
    "Zach Wilkinson / Pool / Getty Images file",
    "Judge in Idaho murders case narrows gag order preventing people related to trial from speaking",
    "A Nebraska groom died an hour after his wedding, friends say",
    "South Carolina fire chief who pointed gun at teens who turned in his driveway is being sued",
    "Epstein victims ask judge to approve $290 million settlement with JPMorgan",
    "Passenger shot and killed Uber driver she believed was taking her to Mexico, police say",
    "Prosecutors request delaying Trump's classified documents trial until December",
    "Chris Christie, jeered for criticizing Trump, tells crowd: 'You can boo all you want'",
    "U.S. intelligence community remains divided over likely Covid origin, report shows",
    "David L. Ryan / Boston Globe via Getty Images file",
    "RFK Jr. divides social media platforms with vaccine misinformation",
    "Republicans look to use debt-limit tactics in government funding fight",
    "InfoWars host Owen Shroyer pleads guilty in Jan. 6 case",
    "Arizona Gov. Hobbs strips county prosecutors of authority to prosecute abortion cases",
    "Surgeon General Vivek Murthy discusses public health issues at Aspen Ideas: Health",
    "Universal Images Group via Getty Images file",
    "A cholesterol-lowering alternative to statins reduces deaths from heart disease, new study finds",
    "Leila Register / NBC News; Getty Images",
    "Does Ozempic treat PCOS and addiction? What the science says.",
    "Skin moles that grow hair may offer a treatment for baldness, a study in mice suggests",
    "Black veterans are denied VA health benefits more often than white veterans, new data shows",
    "Taras Ibragimov / Global Images Ukraine via Getty file",
    "Ukraine pleads for more U.S. support as Russia's advantage in the air hampers counteroffensive",
    "Konstantin Mihalchevskiy / Sputnik via AP file",
    "Russia doubles down on dolphin defenses to guard against Ukrainian attacks",
    "Greg Baker / AFP - Getty Images",
    "Beijing sizzles at 106 degrees, hottest June day recorded in China's capital",
    "Kenya could follow Uganda as East African nations wage war on LGBTQ rights",
    "DOJ files first-ever charges against Chinese fentanyl manufacturers",
    "OceanGate / AFP - Getty Images",
    "What is a 'catastrophic implosion'? How pressure but no pain likely marked the end for Titanic sub",
    "Carbon fiber, one of the Titan submersible's experimental materials, comes under scrutiny",
    "EXCLUSIVE: 19-year-old Titan passenger was 'terrified' before trip, his aunt says",
    "Rep. Connolly: This could very well be the unraveling of the Putin regime",
    "Oregon bar 'Sports Bra' is first to only show women's sports",
    "New exhibit takes a look back at cellphones throughout the years",
    "Newborn adopted by Florida firefighter who recovered her from Safe Haven Baby Box",
    "NBC News / Dirty Dozen Productions; via LinkedIn; Courtesy Dawood family; AFP via Getty Images",
    "The Titanic brought them together, and a tiny vessel could doom them",
    "Former Titan passengers share eerie accounts of safety issues",
    "Three of Mount Rainier's glaciers have melted away",
    "Ibrahim Rayintakath for NBC News",
    "In hidden Discord communities, adults are abusing and extorting children",
    "19-year-old Titan passenger was 'terrified' before trip, his aunt says",
    "Stringer / AFP via Getty Images",
    "Tom Williams / CQ Roll Call via AP Images",
    "How a personal experience with abortion is guiding the Senate Democrats' campaign chair",
    "FilmMagic; WireImage / Getty Images",
    "Colleen Ballinger, Miranda Sings and the unraveling of an online fandom",
    "Leila Register / NBC News; Getty Images Leila Register  / NBC News; Getty Images",
    "Nervous about AI? Many Internet creators  consider it a tool, not a threat.",
    "NHL teams won't wear theme-night jerseys after players' LGBTQ Pride refusals",
    "Dermot Mulroney walks off 'The View' during segment to show support for writers strike",
    "Adam Rich, 'Eight Is Enough' actor, died of effects of fentanyl",
    "Leila Register  / NBC News; Getty Images",
    "Saul Loeb / AFP via Getty Images file",
    "Honda recalls 1.2 million U.S. vehicles for rear camera issue",
    "Food insecurity worsened after pandemic SNAP aid expired, report finds",
    "Starbucks union says workers at over 150 stores will strike over Pride decor",
    "Oregon county sues fossil fuel companies, alleging they caused deadly 2021 heat wave in Northwest",
    "Darrell Schoppe / Cover Images via AP",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Mark Felix / Bloomberg via Getty Images file",
    "Latinos now outnumber non-Hispanic whites in Texas, census data shows",
    "Supreme Court upholds law against encouraging illegal immigration",
    "Tenoch Huerta drops out of Netflix movie after sexual assault allegation",
    "Graeme Sloan / Sipa via AP file",
    "Mike Janes / Four Seam Images via AP file",
    "MLB hopes the push for more Black players will soon be reflected on rosters",
    "Villa Rica Police Dept. via WXIA",
    "Georgia police department under investigation for using photo of a Black man for target practice",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "Brendan Farrington / AP file",
    "U.S. court blocks Florida law restricting drag performances",
    "Jeff Kowalsky / AFP via Getty Images file",
    "Anti-drag protests, threats and violence ramp up across the U.S., report finds",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "How to choose the right face sunscreen",
    "Target Circle Week starts July 9",
    "Slip; Nu Skin; Loop Earplugs",
    "Select Wellness Awards 2023 bestsellers",
    "What is Walmart Plus Week?",
    "7 best sales to shop this week",
    "When is Amazon Prime Day 2023? What to know",
    "The best way to clean your grill",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "Do Not Sell My Personal Information"
]