[
    "NBC News / Getty Images; Golden Patriots Future",
    "‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "Prosecutors say they have a recording of Trump and a witness in Manhattan DA case",
    "Trump's N.Y. criminal trial will begin in March 2024, halfway through presidential primaries",
    "Treasury says June 5 is new default deadline, buying more time for negotiations",
    "White House blasts House Republicans over work requirements proposal as debt negotiations draw on",
    "What will happen if the U.S. hits the debt ceiling?",
    "John MacDougall / AFP via Getty Images file",
    "As politically motivated hate crimes rise, Germany cracks down on far-right",
    "WATCH: Germany cracks down on far-right coup plot suspects with more arrests",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Daisy Jasmin Estrada Borja",
    "A Latina who's not allowed to wear Mexican American sash at graduation takes legal action",
    "Michael M. Santiago / Getty Images",
    "Florida deputy charged after stun gun turned man covered with fuel into 'human fireball'",
    "Man convicted of murder in California campground shootings that left father dead inside tent",
    "Pennsylvania nurse accused of killing 2 patients, injuring another with insulin injections",
    "J. Scott Applewhite / AP file",
    "The ugly proxy war over Feinstein's Senate seat",
    "Ohio banned August elections. Then the GOP planned one that could help preserve an abortion ban.",
    "Republicans brace for 2022 losers to take another crack at winning",
    "Gusher of cash reshapes GOP presidential contest",
    "Iowa Gov. Reynolds signs bill restricting instruction on sexual orientation and gender identity",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "A tree felled in a storm leaves a nation mourning a 'great loss'",
    "Russian forces 'decrease' attacks on Bakhmut to regroup, Ukraine says",
    "U.S. accuses Russia's Wagner Group mercenaries of fueling war in Sudan",
    "Serbian border troops on high alert after ethnic clashes inside Kosovo",
    "Passenger detained after allegedly opening plane’s emergency door while in-flight",
    "Custodian teaching students how to sweep their chess competition",
    "Record surge of post-pandemic travelers in airports this Memorial Day weekend",
    "Murder victim in 1986 California cold case identified through DNA match",
    "Hannah Rappleye / NBC News",
    "Months after residents sound the alarm, Pennsylvania 'cracks' down on Shell plant",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Oath Keepers founder gets 18 years in longest Jan. 6 sentencing yet",
    "China faces a new Covid wave that could peak at 65 million cases a week",
    "The Washington Post / Rebecca S. Gratz for The Washington Post via Getty Images file",
    "Ron DeSantis is learning that not every state wants to be Florida",
    "Natalie Behring / Getty Images file",
    "How an outrageous drag queen found mainstream fame in 'The Little Mermaid'",
    "Kevin Mazur / BBMA2017/Getty Images for dcp file",
    "Celine Dion pulls plug on European tour citing ongoing health issues",
    "Tom Hanks delivers commencement speech at Harvard: ‘The truth is sacred’",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "Cancer drug shortage across U.S. has become ‘life-threatening’",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Justin Sullivan / Getty Images",
    "Ford EVs will use Tesla charging tech in surprise partnership between rival automakers",
    "Justin Sullivan / Getty Images file",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Fans around the world gather to remember Tina Turner's influence",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "South Dakota governor calls on college board to ban drag shows and eliminate 'preferred pronouns'",
    "Charlie Neibergall / AP file",
    "George Wood / Getty Images file",
    "New British Cycling rules bar transgender women from competing in elite female events",
    "12-year-old graduates college in California, setting school record",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "The best Amazon Memorial Day deals to shop now",
    "14 best sunscreens for sensitive skin",
    "The best Memorial Day sales to shop now",
    "The best mattresses to keep you cool",
    "Memorial Day mattress and bedding sales to shop",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "Do Not Sell My Personal Information"
]