[
    "Arkady Budnitsky / Anadolu Agency via Getty Images",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "Plane belonging Russian mercenary chief lands in Belarus, flight-tracking website shows",
    "Putin blasts rebel leaders as traitors and says Russia would've crushed the revolt",
    "Scott Olson / Getty Images",
    "Judge in Trump docs case denies special counsel's request to keep witnesses under wraps",
    "Trump’s GOP lead grows after latest indictment, poll finds",
    "Democrats warn party: The threat of Trump winning in 2024 is 'very real'",
    "Intermittent fasting is as effective as calorie counting for weight loss, study finds",
    "Experimental drug could offer more weight loss than any drug on the market, study finds",
    "Effective pills for weight loss, including an oral version of Ozempic, are on the horizon",
    "Evelyn Hockstein / For the Washington Post via Getty Images",
    "'Planned in plain sight': Senate report finds intel agencies failed in the lead-up to Jan. 6",
    "Jan. 6 defendant, representing himself, questions son who turned him into the FBI",
    "Multiple Secret Service agents have testified before Jan. 6 grand jury, sources say",
    "Jessica Rinaldi / Boston Globe via Getty Images",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Robert F. Bukaty / AP file",
    "How Ron DeSantis is trying to overcome challenging terrain in New Hampshire",
    "Kansas attorney general sues to stop trans people from changing their birth certificates",
    "FBI Director Christopher Wray to testify before House Judiciary Committee in July",
    "White House blasts harassment of reporter who asked Modi about human rights record",
    "Supreme Court paves the way for Louisiana congressional districts to be redrawn",
    "Ron DeSantis endorses 'deadly force' against migrants suspected of trafficking drugs",
    "Zach Wilkinson / The Moscow-Pullman Daily News via AP pool file",
    "Prosecutors will pursue death penalty in slayings of 4 University of Idaho students",
    "Patrick McDermott / Getty Images for IRONMAN file",
    "Three die in Gulf of Mexico rip currents off Panama City Beach",
    "Major research lost after custodian flips switch on lab freezer, lawsuit claims",
    "Elijah Nouvelage / Bloomberg via Getty Images file",
    "Death of Texas airport worker who was 'ingested' in airplane engine is ruled a suicide",
    "Marion County Sheriff's Office",
    "CDC issues alert after 5 cases of locally acquired malaria reported in Texas and Florida",
    "Club Q shooter sentenced to life in prison for attack on gay nightclub",
    "Vice President Kamala Harris makes a surprise visit to NYC's Stonewall Inn",
    "Tomas Stevens / Sipa USA via AP file",
    "Influencers under fire for promoting Shein's China factory amid abuse allegations",
    "Emma McIntyre / Getty Images file",
    "'The Office' star Rainn Wilson talks about spirituality and his new book",
    "Twitter shows users police brutality and anti-vaccine videos on TikTok copycat",
    "Jesse Watters replaces Tucker Carlson in Fox News prime-time hour",
    "James Crown, businessman and Aspen Institute chair, dies in race track crash",
    "Myanmar torches drugs worth half a billion as illicit trade soars",
    "Photos: 24 hours that took Russia to the brink of civil war",
    "Teen who died on Titanic sub brought Rubik's Cube with him in bid to break world record",
    "Thousands of North Koreans march in anti-U.S. rallies as country marks Korean War anniversary",
    "Alligator attacks 13-year-old swimming in a Florida creek",
    "Ryan Reynolds, Michael B. Jordan, and more invest in Alpine F1 team",
    "Sarah Ferguson reveals breast cancer diagnosis, urges screenings",
    "Colleges prepare for Supreme Court decision on affirmative action",
    "Leila Register / NBC News; Getty Images",
    "How digital creators went from a Hollywood afterthought to major power players in entertainment",
    "Nathan Laine / Bloomberg via Getty Images",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "'They don't want us here': Florida immigrants detail their exit over DeSantis law",
    "Chicago's consent decree woes offer a warning as Minneapolis police face federal oversight",
    "OceanGate / AFP - Getty Images",
    "What is a 'catastrophic implosion'? How pressure but no pain likely marked the end for Titanic sub",
    "Future Publishing via Getty Images",
    "Leon Bennett / FilmMagic file",
    "Actor Angela Bassett will finally take home an Oscar",
    "Olivia Rodrigo announces sophomore album 'Guts'",
    "Patti LaBelle flubs lyrics for a Tina Turner tribute, pleads 'I'm trying, y'all'",
    "Eli Lilly releases new data from potentially game-changing weight loss drug trial",
    "Soumyabrata Roy / NurPhoto via Getty Images",
    "AJ Mast / Bloomberg via Getty Images file",
    "Oregon county sues fossil fuel companies, alleging they caused deadly 2021 heat wave in Northwest",
    "Three of Mount Rainier's glaciers have melted away",
    "Darrell Schoppe / Cover Images via AP",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Luis Robayo / AFP via Getty Images",
    "Argentine dictatorship’s 'death flight' plane returned to country for a historical reckoning",
    "Mark Felix / Bloomberg via Getty Images file",
    "Latinos now outnumber non-Hispanic whites in Texas, census data shows",
    "These pilots fly women who need abortions to states where it's allowed",
    "Paras Griffin / Getty Images",
    "Mark Terrill / Invision / AP",
    "BET Awards honor hip-hop's 50 years, Busta Rhymes",
    "Bing Guan / Bloomberg via Getty Images",
    "New York governor signs 'safe haven' law for transgender youth",
    "Police detain 50 after Pride march in Istanbul",
    "Drew Angerer / Getty Images",
    "Iowa paper apologizes for cartoon that GOP hopeful Vivek Ramaswamy called 'bigoted'",
    "Over 60% of Netflix users have watched a Korean title on the streaming service, CEO says",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "9 highly rated toiletry bags to keep you organized",
    "How to choose the right face sunscreen",
    "Target Circle Week starts July 9",
    "Slip; Nu Skin; Loop Earplugs",
    "Select Wellness Awards 2023 bestsellers",
    "What is Walmart Plus Week?",
    "7 best sales to shop this week",
    "When is Amazon Prime Day 2023? What to know",
    "The best way to clean your grill",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Do Not Sell My Personal Information"
]