[
    "Adipurush Makers 'Revamp' Dialogues After Backlash Over Hanuman's 'Jalegi Bhi Tere Baap Ki' Line",
    "PM Modi's State Visit to the US is Significant. Here's All You Need to Know About It",
    "Bengaluru: Shuttle Bus Crashes Into Pole at Airport; 10, Including 2-Year-Old, Injured",
    "Tamannaah Bhatia, Vijay Varma Set Instagram on Fire With Sensual Shoot; Photos Go Viral",
    "Bigg Boss OTT 2: Puneet Superstar EVICTED from Salman Khan Show In Less Than 24 Hours",
    "Kerala Man Stabbed to Death by Roommate in London, Third Killing of Indian National This Week",
    "Father's Day is a Complicated Occasion for Some. Here's How to Deal With It | Explained",
    "Sunny Deol Dons a Red Safa For Karan Deol's Wedding Ceremony",
    "2023 Kia Seltos Facelift Launch in India: Clear Photos Emerge Ahead of Official Debut",
    "Kiara Joins YRF Spy Universe | Alia, Gal Gadot Pose Together | Neha Kakkar Quashes Divorce Rumours",
    "Sunny Deol, Ranveer Singh, Dharmendra & Bobby Deol At Karan Deol's Sangeet Ceremony | Viral Videos",
    "Hanging Or Upside-Down Sit-Ups | Sharvari Wagh's Unique Workout Is The Fitness Motivation We Need",
    "Fan Asks Kartik Aaryan If He Has Found His True Love; Actor Says ‘I Thought I Had’",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Jasprit Bumrah Could Return to Action in T20Is vs Ireland | Exclusive",
    "Watch: Usman Khawaja's Daughter Steals The Show as She Scrolls Through a Journalist's Camera",
    "'People Will Judge on the Outcome..': Gareth Southgate Warns Ben Stokes on Bold Declaration",
    "Om Raut's Old Tweet 'Trolling' SRK's 'FAN' Goes Viral As 'Adipurush' Gets Panned ...",
    "'Adipurush' Roasted Over VFX, Costumes As Twitter Comes Armed With Honest Memes",
    "What Era Are You in Right Now? Desis Share Memes to Express Bittersweet Mood in  ...",
    "Gaddiya Uchiya Rakhiya: Vicky Kaushal's Viral Reel Has Spawned Hilarious Out-of- ...",
    "International Yoga Day 2023: Theme, and 7 Health Benefits of Yoga",
    "Karan Deol Makes a Case of Classic Groom Attire in an Ivory Sherwani for His Wedding",
    "Urfi Javed Poses With Her Nani, Mother And Sisters, Fans Say, 'Her Family Is So Innocent'",
    "5 Looks Of Tamannaah Bhatia From Jee Karda That Are Too Hot To Handle",
    "Should You Be Going Out For A Walk Post Dinner? Expert Weighs In",
    "Delhi News | Delhi RK Puram Shooting Incident | 2 Women Shot Dead In Delhi's RK Puram | News18",
    "Equity Markets This Week: Know Which Forces To Drive Investor Sentiments In India",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "If Cricketers Were Marvel Superheroes…",
    "Meet Drisha Acharya, Karan Deol`s Fiancé",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Shilpa Shetty Encourages Surya Namaskar",
    "9 Great Benefits Of Cycling",
    "Hotness Alert! Celebs Who Went Topless",
    "Happy Father's Day 2023: Wishes, Images &...",
    "6 Zodiac Signs That May Have Difficult...",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Astrological Predictions for June 17, 2023",
    "Kriti Sanon Inspired Saree Looks",
    "WhatsApp Users Can Send Video Messages",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Astrological Predictions for June 16, 2023",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Remembering Sushant Singh Rajput",
    "Astrological Predictions for June 15, 2023",
    "Top 6 Budget-friendly ACs Under Rs 30,000",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "ODI WC Qualifier: If We Don't Qualify for the Main Event, We Go a Step Lower, Says Carl Hooper",
    "Bangladesh Recall Afif Hossain, Naim Sheikh in 15-Man Roster For ODI Series Against Afghanistan",
    "Ambati Rayudu to Join Politics, May Contest Lok Sabha Polls: Report",
    "PM Modi Proposes G20 Membership for African Union; Sources Say 'Bold Step'",
    "Yoga Day 2023: PM Modi to Lead Celebrations With People From Over 180 Countries At UN HQ",
    "Soon NPS To Have Systematic Withdrawal Plan; Here's What PFRDA Chairman Said",
    "Father's Day 2023: Are You A New Dad? Check These 5 Money Management Tips",
    "Biparjoy Cyclone: LIC Announces Relaxations For Victims, Check Details Here",
    "Gold Rate Today In India: Check 22 Carat Price In Your City On June 18",
    "Income Tax Payment: Now 25 Banks Available For E-Pay Tax Service; Check List Here",
    "Bollywood Divas And Their Stylish Beach Vacations In Pictures",
    "Malaika Arora Aces Her Gym Look In Simple Athleisure Wear, See Photos",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "US Man Gets AI Girlfriend After Losing Connection With His Depressed Wife",
    "US Man Wins Rs 41 Lakh In Lottery And His Winning Strategy Is...",
    "Video Of Thirsty Squirrel Asking For More Water Is Too Cute To Miss",
    "'Adipurush' Day 1 Has Been a Roller Coaster Ride. Here’s Everything Bizarre That Unfolded",
    "JEE Advanced 2023 Results Announced, Check Category-Wise Qualifying Marks",
    "Jobs In Central PSUs Fell By Over 2.7 Lakh In The Last Decade: Govt Data",
    "CSIR UGC NET 2023 Results To Be Out Soon, Check Details",
    "More Education & Career News",
    "This New Feature On iOS 17 Can Help Reduce Eye Strain: Here's How",
    "WhatsApp To Release New Interface To Advertise Status Updates: Know More",
    "Twitter Video App For Smart TVs Is 'coming', Says Elon Musk",
    "Microsoft Says Early June Service Outages Were Cyberattacks: All Details",
    "All-New Hero Xtreme 160R Launched in India, Price Starts at Rs 1.27 Lakh",
    "2023 Honda Unicorn Launched in India, Price Starts at Rs 1.09 Lakh",
    "All-Electric Volvo C40 Recharge Unveiled in India, Gets Range of 530 Km",
    "Maruti Suzuki All-New MPV To Be Christened Invicto, Will Be Unveiled on July 5",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Pakistan Receives $1 Billion from China to Support Critically Low Foreign Reserves",
    "Images Show How a Massive Rockslide Misses Swiss Village 'By a Hair'",
    "Secretary of State Antony Blinken Lands in China on Highest-level US Visit Since 2018",
    "Ferrari's Carlos Sainz Handed Three-place Grid Penalty For Canadian Grand Prix",
    "Max Verstappen on Pole at Canadian Grand Prix, Nico Hulkenberg Second",
    "WATCH: IShowSpeed Finally Meets His Idol Cristiano Ronaldo as Duo Hits 'Siu', YouTuber Cries Later",
    "Planning to Be A Father In Your 40’s; Here’s What You Need To Know",
    "Father's Day 2023: Heartfelt Quotes and Messages From Daughter",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Uniform Civil Code in Limelight Again: What it is, Major Court Judgements Around UCC | Explained",
    "Predator Drone Deal With US: What are MQ9 Reaper Drones & Why Does India Need Them? Explained",
    "Tamil Nadu Withdraws Consent to CBI for Probe in State Amid Senthil's Arrest: What Does Law Say?",
    "Chandrayaan-3 Scheduled for July Launch | A Guide to ISRO's 3rd Lunar Exploration Mission",
    "Indian Monsoon: What is El Nino and It's Impact on Rainy Season Explained",
    "Opinion | How India Can Effectively Tie Public Diplomacy to Its National Security Objectives",
    "Opinion | Why Sunny Deol’s ‘Gadar 2’ Could Spring a Surprise at The Box Office",
    "Opinion | Why Uttarakhand And Jharkhand Have Set Off Alarm Over Demographic Shift",
    "Opinion | PM Modi’s State Visit to US: Why 'Gastro-diplomacy' Must be on the Table Too",
    "Akhilesh Yadav Reveals ‘PDA’ Formula for 2024 Lok Sabha Polls to Counter BJP-led NDA in UP",
    "Toppling Elected Govts Through Horse Trading is Matter of Concern: Gehlot",
    "Erling Haaland Scores But Norway Suffer Defeat Against Scotland in Euro 2024 Qualifier"
]