[
    "'Surrender Weapons': Shah's Stern Warning Amid Decision on Panel to Probe Manipur Violence",
    "IAF Training Aircraft Crashes in Karnataka's Chamarajanagar District, Both Pilots Safe",
    "Comeback Queen? Raje's Presence at PM Modi Rally Sets Off Buzz About BJP's Rajasthan Roadmap",
    "Meet K Krithivasan: TCS Welcomes New Visionary CEO Today; Here's What You Should Know",
    "Deepika Padukone Holds Ranbir Kapoor Close As They Reunite After Many Years For YJHD Reunion",
    "WTC Final: R Ashwin Replaces Ravindra Jadeja in England Legend's Combined India-Australia XI",
    "Alia Bhatt's Grandfather Dies at 95; Soni Razdan Pens Emotional Tribute to 'Daddy'",
    "Salary Account Scam: 4 Arrested For Duping ICICI Bank In Hyderabad Of Rs 1.33 Crore",
    "153 Prisoners Die In El Salvador Jail, The Cruelest In The World",
    "Urvashi Rautela Moves Into Rs190-Crore Bungalow Next To Yash Chopra’s House In Mumbai",
    "TCS Work From Office Policy: IT Firm Warns of Paycut, Leave Deduction For Employees",
    "Meet the Indian Sardar Who Owns 15 Turban Colour Matching Rolls-Royce Cars, Details Here",
    "Aamir Khan Says Will Return To Films When Emotionally Ready | Here's How He's Enjoying His Break",
    "Sonakshi In Dahaad; Sanya In Kathal, Shefali In Delhi Crime & More | How Female Cops Save The Day",
    "Suffering From Hypertension? Say Goodbye To Stress In 30 Seconds The Malaika Arora Way!",
    "Spider Man Across The Spider-Verse Review: One Of The Best Superhero Films Of All Time",
    "Sexy! Mouni Roy Raises The Heat In A Plunging Bodysuit; Hot Photo Shoot Video Goes Viral",
    "Sexy! Sonali Raut Heats Up Instagram With Sizzling Look In A Bralette, Hot Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "MS Dhoni and CSK: A Bond Intertwined",
    "IPL 2023 Team Review: Lucknow Super Giants Falter Before Final Hurdle but Show Plenty of Promise",
    "Slower Bat Speeds, Fuller Length: India Legends' Advise to India Cricketers for WTC 2023 Final",
    "Australia Legend Slams 'Over the Top' Gesture From Steve Smith Ahead of WTC Final Against India",
    "Maharashtra Villagers Exposing Poor-quality Road By Lifting it Like a 'Carpet' I ...",
    "Sweet Mangoes to Rain Delays: IPL 2023 Summed Up in One Video Packed With Iconic ...",
    "Indian National Wins Big in Korean Survival Drama Squid Game at Singapore Compan ...",
    "Better Than Bollywood Romance: Jadeja Celebrating IPL 2023 Win With Wife Melts H ...",
    "Ghum Hai Kisikey Pyaar Meiin Star Sneha Bhawsar Breaks Silence On Vihan Verma Dating Rumours",
    "Katrina Kaif Makes Rare Public Appearance Amid Pregnancy Rumours, Sports Oversized Clothes",
    "KASHISH 2023 Will Showcase Fluidity Through Films At Its 14TH Edition",
    "Malaika Arora, in an Exquisite Yellow Iris Serban Gown Is a True Light of Sunshine; See Photos",
    "Does Spider-Man Across The Spider-Verse Have Post Credits Scene?",
    "Teenage Mutant Ninja Turtles: Mutant Mayhem's New Trailer Is High On Drama And Action",
    "French Open 2023: Still no Women's Matches in Night Sessions at Roland Garros",
    "MP CM Shivraj Participates In Cleanliness drive on ‘Bhopal Gaurav Diwas’",
    "Would You Try 'Paan Dosa' Which is Making Desi Foodies Cringe So Hard?",
    "Sara Ali Khan News | Sara Ali Khan Shuts Trolls Who Criticised Her Visit To Mahakaleshwar Temple",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "Top 9 Richest People in the World",
    "9 Upcoming Movies In June 2023",
    "Why Is Pride Month Celebrated In June?",
    "Astrological Predictions for June 1, 2023",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for May 31, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Vicky Kaushal Marks His Fan Boy Moment With Hrithik Roshan Through A Throwback PIC, Check It Out",
    "Mimi Director On Choosing Sara Over Kriti in Zara Hatke Zara Bachke: 'I Felt Sara Was Perfect'",
    "South Korean Model Lee Pyung Dies at 43, Cause of Death Revealed",
    "Wasim Akram Predicts 'Bright Future' For Rising India Star After IPL 2023",
    "On This Day in 2014: Kolkata Knight Riders Beat Kings XI Punjab To Win Second IPL Title",
    "Happy Birthday Dinesh Karthik: Top 5 International Knocks of the Wicketkeeper-Batter",
    "ENG vs IRE 2023: Fast Bowler Josh Tongue Set for Test Debut at Lord's",
    "​​Ahmednagar to Soon Be Officially Renamed As ‘Ahilyanagar’: Maharashtra CM Eknath Shinde",
    "Kerala’s Vande Bharat on Right Track, Sees Around 200% Occupancy: Ministry Data",
    "As Monsoon Nears, Bengaluru's Posh Rainbow Drive Layout in Troubled Waters",
    "'Economy Firing All Cylinders', Here's All What Economists Say On India's Q4FY23 GDP Growth",
    "LPG Commercial Cylinder Slashed By Rs 83.50; Will Domestic Cooking Gas Become Cheaper?",
    "Sukanya Samriddhi Account: Key Things To Know Before Investing",
    "Mouni Roy To Shilpa Shetty Kundra: Celebrities Who Own Swanky Restaurants In Mumbai And Abroad",
    "Kennedy Screening: Sunny Leone, Manoj Bajpayee, Shabana Azmi, Vijay Varma, Sudhir Mishra Attend",
    "Sobhita Dhulipala Is A Vision To Behold In White Cotton Saree, See The Diva's Stunning Pictures",
    "Ameesha Patel's Sexy Bikini-Clad Photos Will Definitely Make Your Jaw Drop, See Pics",
    "Indian National Wins Big in Korean Survival Drama Squid Game at Singapore Company Dinner-dance",
    "'Welcome Back' Was So Bad Naseeruddin Shah Called it 'Goodbye Again' in Hilarious Slip-up",
    "KK's Last Song At Kolkata Concert Was 'Pal', Fans Call it 'Biggest Irony'",
    "'Choose Wisely': Man Says Watching IPL is Waste of Time, Gets Roasted on Twitter",
    "CBSE 10th, 12th Supplementary Exam 2023: Submission of LOC Starts Today at cbse.gov.in",
    "CUET PG 2023 City Intimation Slip Released for June 5-8 Exams, How to Download",
    "RBSE 5th Result 2023 Live: Rajasthan Board Class 5 Result Declared At rajshaladarpan.nic.in",
    "RBSE 5th Result 2023: When and Where to Check Rajasthan Board Class 5 Result?",
    "JEE Advanced 2023: Check IIT Delhi’s Cut-Off For BTech Courses",
    "More Education & Career News",
    "Apple App Store Turns 15; Users Spent $1.1 Trillion On Apps In 2022",
    "OnePlus India CEO Navnit Nakra Steps Down, Company Grateful For His 'Instrumental' Contributions",
    "New Malware Called DogeRAT Spreading Through Fake Android Apps: What We Know And How To Be Safe",
    "Xiaomi Extends Warranty For Redmi Note, Mi And Poco Phones In India: Full List",
    "WhatsApp Companion Mode Now Allows Four iPhones To Be Linked To One Account",
    "Hyundai Exter Exterior Design Revealed Ahead of Official Launch, Details Inside",
    "Mahindra Thar 5-door Spied Testing with Sunroof, Debuts in 2024",
    "Delhi: Extended Ashram Flyover Completely Open For Heavy Vehicles, Details Here",
    "MG Gloster Blackstorm Edition Launched in India, Price Starts at Rs 40.29 Lakhs",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Eight Injured in 'Uninterrupted' Attacks on Russian Border Region: Governor",
    "Elon Musk is World's Richest Person Once Again as Shares of Bernard Arnault's LVMH Fall",
    "'It's Something I Stand For': Novak Djokovic on Kosovo 'Heart of Serbia' Row",
    "French Open 2023: Novak Djokovic Claims Win in Second Round After Kosovo Controversy",
    "'Political Statements Not Banned at Grand Slam,' Says ITF After Novak Djokovic Kosovo Row",
    "Europa League Final: Mourinho Raises Doubts Over AS Roma Future after Penalties Loss to Sevilla",
    "Sevilla Beat AS Roma on Penalties to Claim Record-Extending 7th Europa League Title",
    "8 Yoga Asanas To Try Out If You Are Suffering From Breathlessness",
    "Sunny Leone Stuns in A Gemy Maalouf Maroon Gown",
    "5 Storytellers Who Can Transport You To Different Worlds",
    "World Milk Day 2023: Must-Try Recipes On World Milk Day",
    "National Nail Polish Day 2023: DIY Summer Nail Art Designs for Beginners",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Skip Leg Day at the Gym? New Study Shows Why It May be Essential to Heart Health | Explained",
    "Manipur Violence: As Amit Shah Holds Meet With Political, Civil Leaders, the Conflict Explained",
    "What is Foucault's Pendulum Installed in New Parliament Building & How Does it Work?",
    "Bajrang Punia Warns Against 'Morphed' Photos of Wrestlers: How to Spot an AI Deepfake? Explained",
    "Indian Ink | The 3% Fallacy: India’s Education Spends Are Far More Than Critics Claim",
    "Opinion l 9 Years Of Modi Government Has Given India Poorna Swaraj",
    "Opinion | Why Indians Must Celebrate New Parliament, Sengol Installation",
    "Opinion | Enhancing India-Nepal Ties in Uncertain Times",
    "'Caste' Aspersions: KCR Unveils Brahmin Sadan, BJP Calls It Political Gimmick",
    "In Rajasthan, PM Modi Lambasts Congress for Misleading Poor, Takes Jibe Over its 'Guarantee Habit’",
    "By Boycotting Parliament, Opposition Snubs People of India And Not PM Modi: Smriti Irani to News18",
    "Criteria, Frameworks Being Decided for Implementation of Guarantees, Says Minister Priyank Kharge",
    "Watch: After FIFA World Cup 2022, Gonzalo Montiel Converts Winning Penalty in Europa League Final"
]