[
    "New Parliament Building Inauguration LIVE: Prez Humiliated for Being Tribal or Woman? Asks DMK",
    "Not Only Tamil Outreach, Savarkar & Sengol is BJP's Way to Dominate 'Political Narrative': Experts",
    "Ashish Vidyarthi's First Wife Drops Cryptic Post After His 2nd Marriage at 60, Says 'Do Not Get…'",
    "Salman Khan's Security Pushes Vicky Kaushal Away at IIFA; SHOCKING Video Goes Viral",
    "Mumbai Airport: Over 100 VietJet Passengers Stranded Since Last Night Amid 'No Flight Info'",
    "Salman Khan Replaces Karan Johar As The Host Of Bigg Boss OTT 2; Show To Go On Air In June",
    "Planning a Last-Minute Vacation This Summer? Look No Further Than Yas Island Abu Dhabi",
    "Heat on The Hunt? Two More Cheetah Cubs Die at Kuno, One Critical",
    "Stocks to Watch: SAIL, Hindustan Zinc, ONGC, BHEL, Vedanta, Voda Idea, Zee, and Others",
    "Menstrual Hygiene Day 2023: Beyond Pads - Tips for Clean and Comfortable Periods",
    "Aditi Rao Hydari Exudes Cinderella Vibes, Sunny Leone & Esha Gupta Stun | India At Cannes 2023",
    "Karan Johar: The Man, The Myth & The Legend | Why He Is The Undisputed Kingmaker Of The Industry",
    "Saba Azad Shares Her Morning Routine - Healthy Habits, Exercise & Dedicated Skincare Regime",
    "Mandira Bedi Fitness Routine & Diet Plan For Toned Physique REVEALED",
    "Aahana Kumra's Message Is Quite Clear - Female Celebs Need Space | Malaika Arora | Kareena Kapoor",
    "HOT! Nora Fatehi Raises The Heat In A Very Skintight Plunging Dress, Sexy Video Goes Viral; Watch",
    "Shubman Gill REACTS To Dating 'Sara' In Viral Video, Netizens Ask 'Which One, Khan Or...'; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Rohit Sharma: IPL’s Most Successful Player Pursuing an Unforgettable Legacy",
    "IPL 2023, Qualifier 2: Time for Hardik Pandya to Step up as Gujarat Titans Face the Heat",
    "'Fantastic MS Dhoni Has Shown How to Win Big Matches': India Legend Praises CSK Captain",
    "BCCI Likely to Rest Virat Kohli, Rohit Sharma and Other Seniors For Proposed Afghanistan Series",
    "WTC Final 2023: Team India Kick-start Preparations for Australia Showdown in New Training Jerseys",
    "Mumbai Rains: Memes Flood Twitter After City Wakes Up to Light Showers on Friday",
    "Dhoni Grants Autographs to Ground Staff at Chepauk Stadium in Heartwarming Video",
    "'Nothing to Worry About Pathirana': Dhoni's Assurance to CSK Star Pacer's Family ...",
    "MI vs LSG: Rohit Sharma's Men Eye Win in IPL Eliminator Amid Intense Meme Battle ...",
    "Mumbai: Water Supply Cut in Mahim, Matunga and Dadar for Over 24 Hours",
    "Who Is Rupali Barua? Meet The Entrepreneur Who Said 'I Do' To Ashish Vidyarthi",
    "Khatron Ke Khiladi 13: Rohit Roy Gets Injured While Shooting In Cape Town; Might Fly Back To India",
    "Janhvi Kapoor Yet Again Slays the No-Makeup Look During Her Most Recent Vacay; See Photos",
    "Jogira Sara Ra Ra Review: Nawazuddin Siddiqui, Neha Sharma Starrer Is A Surprisingly Fresh Film",
    "Aishwarya Rai Did Not Accompany Husband Abhishek Bachchan To IIFA For THIS Reason?",
    "Big Relief For Mumbaikars: No More Stopping at Vakola Signal on WEH, Here's Why",
    "New Algorithm Accurately Predicts Extreme Weather Events",
    "Gold Rates Decline In India On May 26; Check 22 Carat Gold Price In Your City",
    "Rocky Aur Rani Kii Prem Kahani First Look | Ranveer Singh And Alia Bhatt Kapoor | Shorts | Video",
    "Dharavi Teen Maleesha Kharwa Becomes New Brand Ambassador Of Forest Essentials | English News",
    "Priyanka Chopra Jonas Reveals A Bollywood Director Wanted To See Her Underwear | Bollywood News",
    "Astrological Predictions for Friday",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "9 Benefits Of Surya Namaskar",
    "9 Must-watch Hindi Thriller OTT Shows",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "Mouni Roy Gives Holiday Glam Goals",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "Ferrari To Launch First Electric Car in 2025",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "8 Movies to Watch on Mother's Day with Your Mom",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "9 Health Benefits Of Sleeping Naked",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Five gift ideas to make your mother feel...",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "YouTuber Agastya Chauhan Dies While...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "ITR Filing 2023: Don't Forget These Essentials",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "Inside Nia Sharma's Vacay In Sikkim",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "Check Out The Unseen Pics Of Shah Rukh...",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Jacqueline Fernandez's Fitness Routines",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Busiest Airports In The World In 2022",
    "Salman Khan Buys New Bullet-proof Car",
    "Salman Khan, SRK 'Convinced' Aamir Khan For THIS, Partied Till 4 AM at Galaxy, Discussed Dunki",
    "WATCH | Sachin Tendulkar Thanks Mumbai Indians for 'Best' Anniversary Gift After Win over LSG",
    "IPL 2023: Gautam Gambhir Left Stunned After Akash Madhwal Tears Through LSG Batting",
    "Rain, Strong Winds Bring Mercury Down in Delhi, Other Parts of India; No Heatwave for Next 5 Days",
    "Husband Admonishing Wife for Extramarital Affair Does Not Amount to Suicide Abetment: Telangana HC",
    "Leave Encashment Upon Retirement: Rs 25 Lakh Tax Exemption For Salaried Employees",
    "Angel Tax Exemption For Investment In Startups From 21 Nations; CBDT Notifies Details",
    "Rs 2,000 Note Exchange In SBI, PNB Or HDFC; Check Rules Of Your Bank Here",
    "Retirement Planning In India: Here's How To Create The Best Corpus",
    "Meet Mohan Singh Oberoi, From Being a Desk Clerk To Rs 12,700 Crore Hotel Group",
    "Inside Bhumi Pednekar's Dubai Holiday: Check Out The Diva's Stunning Pictures With Her Family",
    "Megan Fox Makes Jaws Drop With Scorching Hot Bikini Photoshoot, Check Out The Diva's Sexy Pictures",
    "Uorfi Javed Bares It All In Colourful Beaded Bikini, Check Out The Diva's Sexy Pictures",
    "Cannes 2023: Mouni Roy Makes Grand Red Carpet Debut In Princess-style Ruffled Gown, See Pics",
    "Alia Bhatt, Malaika Arora, Shahid Kapoor, Ranbir Kapoor Among Celebrities Spotted Out And About",
    "2 Samosa For Rs 500? US Man Can't Believe It And He Wants To Go To Bihar Now",
    "Hilarious Video Of Man Interrupted By Kid While Offering Prayers Viral",
    "Dubai Woman Does Rs 70 Lakh Shopping In 1 Day, Says, 'Spending Husband's Money Is Hobby'",
    "RBSE 12th Arts Stream Result 2023 Sees 92.35% Clearing Exam, Girls Outperform Boys",
    "Mohammed Husain, A Mumbai Slum Resident, Gets 570 Rank In UPSC",
    "Kerala DHSE +2 Results 2023 Released, 82.95% Pass HS 12th Exam",
    "MP Board 12th Result 2023: Decline in Pass Percentage, 55.28% Pass MPBSE Inter",
    "More Education & Career News",
    "Gurugram Resident Loses Rs 70 Lakh In WhatsApp Work-From-Home Scam: How It Happened",
    "Windows PCs Will Finally Get Native Support For RAR Files: What It Means",
    "All Major Announcments From PlayStation Showcase: Spider-Man 2 Gameplay, New Handheld And More",
    "WhatsApp To Replace Phone Numbers With Usernames: Here's How It Will Work",
    "Mercedes-Benz Launched A 200 Limousine and AMG A 45 S 4MATIC+ Facelift, Details Inside",
    "Tata Tiago Driver's Miraculous Survival After Collision with Pickup Truck, Watch Video",
    "Elon Musk Sets Sights on India, Tesla's New Factory Location to be Sealed in 2023",
    "Simple One Electric Scooter Launched in India, Price Starts at Rs 1.45 Lakh",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Sexual Predator Used Snapchat to Prey on More Than 120 Minor Girls in Finland",
    "Indian-origin Designer Clothing Scam Mastermind Jailed in UK for Tax Frauds",
    "Elon Musk Start-Up Neuralink Gets US Govt Nod for Human Test of Brain Implants",
    "10,000-Kilometer Walk Across South Africa to Promote Save Soil Campaign, International Day of Yoga",
    "Mohamed Salah 'Devastated' as Liverpool Miss Out on Champions League Spot",
    "Manchester United Secures Champions League Return after Chelsea Win",
    "Lewis Hamilton to Sign New Mercedes Deal in 'Coming Weeks'",
    "Chelsea's Frank Lampard Questions Premier League Sacking Culture",
    "Khelo India University Games in UP Declared Open by PM Modi Following Grand Opening Ceremony",
    "Travel Tailored for You: Personalized Perfection Redefines the Wellness Experience",
    "Anupam Kher Sustains Hairline Fracture; Know Everything About Treatment, Causes And Recovery",
    "Nushrratt Bharuccha's Multi-Colour Jumpsuit Is A Summer Staple",
    "Janhvi Kapoor, Alia Bhatt and Tejasswi Prakash Ace Black Gowns Like Never Before",
    "BTS Sensation Jimin Rocks ₹2.7 Lakh Dior Backpack, Ignites Style Frenzy",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "US Debt Ceiling: How Will the Average American Suffer in Case of Default? 10 Scary Points",
    "'He is the Boss': Australia's 'Rocking' Welcome to PM Modi | Explained",
    "What is a Sengol, the 'Symbol of Power & Justice' to be Installed in New Parliament Building?",
    "Imran Khan's 'Crusade': Amid Legal Battles and Trouble in PTI, the Pakistan Story Summed Up",
    "Opinion | Karnataka Lessons: Time’s Ripe For RSS And BJP To Rediscover Their Ideological Moorings",
    "Opinion | Hiroshima G7 Summit: Rhetoric and Reality",
    "Opinion | How PM Modi Uses Diaspora Diplomacy To Push The Rising India Story",
    "Opinion | Naya Kashmir Shines on the Global Stage",
    "NE Youth Returning to Development Mainstream Due to BJP Govt's Policies: PM",
    "Sitharaman Appeals to Oppn Parties to Rethink on Boycott, Says Sengol is a Civilisational Symbol",
    "India Clubbed with UAE, Maldives, China in AFC U-23 Asian Cup Qualifiers",
    "Liverpool Almost Closes Deal With Brighton Star Alexis Mac Allister: Report",
    "Manchester United May Target Real Madrid's Vinicius Jr in Blockbuster Transfer Move",
    "Lionel Messi’s Argentine Buddy Urges Him to Join Premier League Next Season"
]