[
    "Donald Trump Under Arrest and Booked in Secret Document Case",
    "News18 Uncovers 'Admission Fraud' Gangs as Indian Students in Canada Face Deportation",
    "​​Know Alliance Dharma, Just Want…: TN BJP Chief Annamalai on AIADMK’s Resolution Against Him",
    "Tamannaah Bhatia, Vijay Varma Hold Hands In Viral Photo After Actress Confirms Dating Him",
    "Donald Trump Pleads Not Guilty to Mishandling US Government Secrets",
    "‘Modi for India, Shinde for Maharashtra’: Full Page Print Ad by Shiv Sena Irks State BJP Unit",
    "Rohit Sharma's Test Captaincy Uncertain After West Indies Tour: Report",
    "Cyclone Biparjoy to Reach Gujarat on June 15; Over 37,000 People Shifted to Safety | Key Points",
    "'No Honking Day' to be Observed in Mumbai on June 14; Violators to Face Action | Details Here",
    "Bigg Boss OTT 2: Avinash Sachdev, Aaliya Siddiqui and More, Fans Identify Mystery Contestants",
    "Kangana Ranaut Is Getting Married? Star Hands Out 'Wedding Invites' In Viral Video; Watch",
    "'Fake Confidence by Winning on Bad Pitches': Harbhajan Blasts Indian Team After WTC Final Defeat",
    "Shah Rukh Khan's Best Twitter AMA Session | Swiggy Surprises Him With ‘Dinner’ Delivery At Mannat",
    "Kajol Returns To Instagram Hours After Bidding Goodbye; Fans Call Out Her 'Poor' Marketing Gimmick",
    "Radhika Madan Says Switching To Vegan Diet Changed Her Life | All You Should Know About Veganism",
    "Sexy! Nikki Tamboli Slips Into a Bathrobe, Flaunts Her Toned Legs In Hot Photo; See Here",
    "Abhishek Bachchan, Nora Set Dance Floor On Fire With Kajra Re & We Miss Aishwarya Rai; Watch Video",
    "MORE FROM NEWS18 CRICKETNEXT",
    "'Why on Earth Did he Play That Shot': Pujara's Ill-fated Ramp Shot in WTC Final Irks India Legend",
    "How Maharaja Bhupinder Singh Secretly Used 'Patiala Peg' to Win Over the British",
    "Earthquake in Delhi: Memes 'Rock' Twitter As Delhiites Experience Yet Another Tr ...",
    "Woman Brutally Trolled on Twitter for 'Showing Off' Zero Fare Bus Ticket in Karn ...",
    "'DDLJ', 'Welcome': Twitter Chooses Bollywood Films With Epic Endings That Are Ju ...",
    "More Than 10 Cases Related to Communal Tensions Registered in Maharashtra Over 3 Days",
    "If People Want, Maha Govt Can Consider Reducing Number of 'Dry Days', Says Minister",
    "Amy Virk, Vikramjeet Virk And Dev Kharoud Impresses Fans With Maurh",
    "Hot! Tamannaah Goes Bold and Sexy In 1st Appearance Since Vijay Varma Dating News; Watch",
    "Tamannaah Bhatia Confirms Dating Vijay Varma; Bigg Boss OTT 2 Contestants Revealed?",
    "Discover 6 Hidden Hill Stations This Monsoon",
    "Who is Walt Nauta? How Trump’s White House Valet Became Co-conspirator in Secret Docs Case",
    "Singer Neha Kakkar Spotted At The Airport Amid Reports Of Trouble In Her Marriage | #shorts #viral",
    "Actress Raveena Tandon's Daughter Rasha Thadani Slays In Denim Look | #Shorts #trending #viral",
    "Actress Rashmika Mandanna Is A Breath Of Fresh Air In Yellow Kurta | #Shorts #trending #viral",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Top 6 Budget-friendly ACs Under Rs 30,000",
    "6 Tips To Revive Physical Attraction In...",
    "BTS Turns 10: Their Biggest Milestones",
    "8 Most Scenic Road Trips In India",
    "Astrological Predictions for June 13, 2023",
    "9 Most Popular Indian Web Series Of All Time",
    "6 Things Women Should Know Before Using...",
    "5 Trees Considered Sacred In Hinduism",
    "6 Signs You Have A Caring And Loving Partner",
    "Realme 11 Pro Series Launched In India: Key...",
    "Does Cactus Plant Bring Bad Luck in Homes?",
    "9 Smoothies To Try This Summer",
    "9 Times Alia Bhatt Slayed In Beachwear",
    "Mark Zuckerberg Claims Apple Vision Pro...",
    "Bollywood Actresses Without Makeup",
    "Astrological Predictions For June 9, 2023",
    "5 Quick Summer Breakfast Ideas",
    "Apple Launches Vision Pro Headset: What's...",
    "9 Most Expensive Cities For Expats In 2023",
    "Signs That A Man Finds You Attractive",
    "9 Actresses Who Became Pregnant Before Marriage",
    "5 Places You Should Visit Before You Die",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Sara Ali Khan Runs Away From Paparazzi, Closes Car Door on Them; Video Goes Viral",
    "'Winning IPL More Difficult Than Winning World Cup': Legendary India Captain Makes Huge Claim",
    "'Motivation and Energy': Keemo Paul Hails Impact of Legend Darren Sammy Ahead of ODI WC Qualifiers",
    "ECB Slams Former Yorkshire Chairman Colin Graves for Comments on Historical Racists Incidents",
    "PM Modi to Lead Yoga Session at UN Secretariat on June 21, Says Shombi Sharp",
    "Haryana Govt Agrees to Hike MSP, Protesting Farmers Call off Agitation",
    "Delhi's Peak Power Demand Crosses 7000 MW, Highest This Season",
    "Aadhaar-PAN Not Linked? Inactive PAN Won't Allow Tax Refund; Know Consequences Here",
    "ZEE's Subhash Chandra, Punit Goenka Move SAT Against Sebi Order Barring Them From Key Posts",
    "Switching Made Easy: Expert Tips About Motor Insurance Portability",
    "Byju's Braces For Crucial Week As Lender Calls Loom Amid Rising Tensions",
    "How to Change PAN Address Using Aadhaar Card: A Simple Guide",
    "Bollywood Divas And Their Stylish Beach Vacations In Pictures",
    "Malaika Arora Aces Her Gym Look In Simple Athleisure Wear, See Photos",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "Earthquake in Delhi: Memes 'Rock' Twitter As Delhiites Experience Yet Another Tremor",
    "Viral Video of 1954 Batch Dancing at Reunion Party in Pune is Friendship Goals",
    "At This Ahmedabad Restaurant, You Can Dine With The Dead",
    "Just A Usual Day At Florida Beach: Black Bear Swims Out Of Water And Leaves Onlookers Surprised",
    "Swiggy Employees Reach Mannat to Deliver 'Dinner' for Shah Rukh Khan, Here's Why",
    "Jharkhand Board Class 11 Result Declared At jacresults.com, 98.15% Students Pass",
    "CBSE Class 10, 12 Re-evaluation and Re-verification Results Released",
    "UPSC Vs Judicial Service Exam: Decoding The Challenge And Determining the Tougher Test",
    "Delhi University to Launch 2 Separate CSAS Portals for UG, PG Admissions Tomorrow",
    "AP EAMCET 2023 Result To Be Declared Tomorrow At cets.apsche.ap.gov.in",
    "More Education & Career News",
    "Outright Lie, No One Was Raided Or Sent To Jail: IT Minister To Twitter Ex-Boss Dorsey",
    "Mixed Reality Searches On Google Surge 1,130% After Apple Unveils Vision Pro",
    "Maruti Suzuki All-New MPV To Be Christened Invicto, Will Be Unveiled on July 5",
    "Shivamogga Airport: Flight Operations to Start from August 11, Claims MP Raghavendra",
    "Delhi-Mumbai Flight Ticket: Airfares Goes as High as Rs 14K Between Two Cities",
    "Mumbai Metro Line 5: Thane-Bhiwandi-Kalyan Corridor To Reduce Travel Time By 60 Percent",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "NATO Chief Hopes Ukraine Offensive Will Force Russia to Negotiate",
    "Iran Discusses Nuclear Programme with European Diplomats in Abu Dhabi",
    "Premier Handball League: Maharashtra Ironmen Rout Delhi Panzers 41-31",
    "WFI Elections to Take Place on July 6, Result to be Announced on Same Day",
    "Brazil and Spain to Face off in Santiago Bernabeu Friendly as Part of Anti-racism Campaign",
    "'No Extension Mentioned', Says Kylian Mbappe Amid PSG Contract Bombshell",
    "KSSM Shooting Championship: Bhavesh Shekhawat Clinches 25m Rapid Fire Pistol Title",
    "Best Father's Day 2023 Speech: Emotional and Heart-touching Speech Ideas to Honour Your Dad",
    "Tamannaah Bhatia And Vijay Varma: How They Became The Hottest Couple In B-Town",
    "Navi Mumbai International Airport To Open In 2024; Everything You Need To Know",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Ex-Intelligence Official Says US Collected UFOs: What are the Claims & Is There Truth to Them?",
    "Opinion | What Jack Dorsey Forgot to Say About Twitter’s Free Speech Record in India",
    "Opinion | Uncertainties of Political Engineering Lie Ahead for Pakistan",
    "OPINION | Lessons from WTC Defeat: Time for a Mindset Change for Team India in Knockout Games",
    "Opinion | Financial Analysis of State Lenders Required for Successful Privatisation of PSBs",
    "Twitter Row: Anurag Thakur Slams Dorsey, Says Foreign Forces Wake Up When Elections...",
    "Some People in Congress Have Become 'Seasonal Hindu': Rajnath Singh in Madhya Pradesh",
    "AIFF Receives Bids From Five Teams for Direct Entry Into I-League",
    "ISL: Mohun Bagan Head Coach Juan Ferrando to Stay at Helm of Club for One More Year"
]