[
    "Rajasthan Congress Cockpit on Shaky Grounds Over Sachin Pilot’s Likely Move to Quit",
    "Shahid Kapoor Brutally Trolled For Saying Marriage Is About Wife 'Fixing' Husband",
    "World Test Championship Final: The Big Test Awaits Captain Rohit Sharma",
    "Ukraine Dam Collapse: 17,000 Rescued, Many Deaths, 24 Villages Flooded as Moscow, Kyiv Trade Blame",
    "'I Am Alive': Odisha Train Crash Survivor Wakes Up in Room Filled With Corpses",
    "Adipurush Co-Stars Prabhas, Kriti Sanon Win Hearts As They Share a Warm Hug; Photo Goes Viral",
    "Kartik Aaryan Charges Rs 25 Crore For Satyaprem Ki Katha? Here's How Much Kiara Advani Is Getting",
    "WATCH | Beer Frenzy in Andhra After Van Carrying Alcohol Cartons Overturns, People Rush to Loot",
    "How Celebrity Chef Ranveer Brar Clawed His Way Back From Staring At Bankruptcy",
    "Siddhant Chaturvedi & Navya Naveli Nanda Return From Goa Vacation Together; So It's Official Now?",
    "Gufi Paintal Death: Remembering Mahabharat's Shakuni Mama & How He Made It A Cult Show",
    "SatyaPrem Ki Katha Trailer: Kiara Advani & Kartik Aaryan's Chemistry Outdoes A Mediocre Showreel",
    "Priyanka Chopra Fan Girls Over Beyonce, Dances Her Heart Out At Queen Bee's Renaissance Concert",
    "Prince Narula On Roadies & His Co-Gang Leaders Rhea Chakraborty & Gautam Gulati | EXCLUSIVE",
    "Samantha Ruth Prabhu Raises A Toast For Her Friendship With Vijay Deverakonda; And We Are In Awe",
    "Adipurush New Trailer: Prabhas' Ram Fights Saif Ali Khan's Lankesh For 'Adharm Ka Vidhwans'",
    "Divya Agarwal Admits Breakup With Varun Sood Happened Because of Her, Calls It 'Abrupt'",
    "Bigg Boss OTT 2 Contestants Tentative List: Jiya Shankar, Umar Riaz, Pooja Gor And More",
    "Malaika Arora Sets Internet On Fire With Her 'Ram Chahe Leela' Dance In Black Saree; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC Final: India Have Options on Mind as Against a Far More Sorted Australian XI at The Oval",
    "Two Spinners or One; Umesh Yadav or Shardul Thakur: India Keep Cards Close to Chest",
    "Rohit Sharma Injured in Nets on Eve of WTC Final? Here's The Truth",
    "Internet Has Discovered the 'Saddest' Thing About Apple's Vision Pro Headset",
    "If You Remember 'Made in Heaven', Your Childhood Was Awesome: Woman's Post Has T ...",
    "Instagram Story Icon Suddenly Got Bigger and Users are Freaking Out on Twitter",
    "Mallus are 'Cooking' Their Cats on Twitter After This Viral Tweet, Here's Why",
    "World Food Safety Day 2023: Theme, History and Significance",
    "World Food Safety Day: 7 Tips to Keep Food Safe at Home",
    "TMKOC: Monika Bhadoriya Claims She Was Forced To Lose Weight, Was Told 'You Look Pregnant'",
    "Soha Ali Khan And Kunal Kemmu's Vacation Pictures Will Give You Major Couple Goals",
    "Boeing Halts Shipments of the 787 Dreamliner for a Flaw in the Tail Section of the Planes",
    "Petrol, Diesel Fresh Prices Announced Today: Check Fuel Rates In Your City on June 7",
    "Sara Ali Khan News | Sara Ali Khan Shuts Trolls Who Criticised Her Visit To Mahakaleshwar Temple",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "Astrological Predictions for June 7, 2023",
    "5 Places You Should Visit Before You Die",
    "9 Most Popular Indian Web Series Of All Time",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "9 Actresses Who Became Pregnant Before Marriage",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "TMKOC Actors Face Gender Pay Gap? Priya Ahuja and Malav Rajda Reveal",
    "Priyanka Chopra To Star Opposite Jr NTR In Prashanth Neel's Next: Reports",
    "Vicky Kaushal, Sara Visit Siddhivinayak, Distribute Prasad Amid Zara Hatke Zara Bachke Success",
    "Salman Khan Announces Bigg Boss OTT 2 Premiere Date In New Promo; Watch",
    "'The Return of Virat': ICC Pay Stunning Tribute to Kohli Ahead of WTC Final 2023",
    "Babar Azam, Chamari Athapaththu Lead ICC Player of the Month Nominations",
    "Punjab Seeks More Power From Centre As Demand Increased During Paddy Season",
    "RBI Monetary Policy Meeting Starts Deliberations; Policy Rate Decision On June 8",
    "NSE Changes Nifty Bank F&O Expiry to Friday; Here's What You Need to Know",
    "Aadhaar-PAN Link Deadline Soon: Steps To Protect Your PAN Before It Becomes Inoperative",
    "IKIO Lighting IPO Day 1: Know Price, GMP, Reviews, Other Details Before Investing",
    "Gold Rates Rise Today In India; Know 22 Carat Latest Price In Your City On June 6",
    "Suhana Khan Paints The Town Red In Bold Corset Top, Check Out The Star Kid's Hottest Style Moments",
    "Sunny Leone Makes Jaws Drop With Stunning Photos From Maldives Vacay, Check Out Her Sexy Pictures",
    "Malaika Arora Looks HOT And Happening In Chic Athleisure Wear, See Photos",
    "HOT! Alaya F Truly Sets The Temperature Soaring With One Picture At A Time, See Photos",
    "Mouni Roy Sets Internet On Fire With Hot Bikini Photoshoot, Check Out The Diva's Sexy Pictures",
    "If You Remember 'Made in Heaven', Your Childhood Was Awesome: Woman's Post Has Twitter Confused",
    "Dubai Man Leaves Rolls Royce With Key Outside Gym to Prove How Safe the City is, Video Goes Viral",
    "'Korean Mummy Papa Ki Indian Beti': Influencer's Taj Mahal Post Is Winning Hearts",
    "'What A Legend': Sherpa's Heroic Rescue In Mount Everest’s Death Zone Wins Internet",
    "Bengaluru Auto Adorned With Lights, Tray Tables and Cushions Captivates Internet",
    "NCERT to Develop New Textbooks for Academic Year 2024-25",
    "CUET 2023 Results Soon, Check Cut off for Admission to Colleges Across India",
    "UPSC Civil Services Prelims 2023: How To Check Results And Expected Cutoff",
    "SEBA Assam to Discontinue Class 10 Board Exams From Next Year",
    "26-year-old Assam Doctor Mayur Hazarika Secures AIR 5 in UPSC CSE 2022 in First Attempt",
    "More Education & Career News",
    "iOS 17 Update: 10 Important Features Coming To Your iPhone Soon",
    "Duck It! One Big News For Apple iPhone Users With iOS17 Update Release",
    "Why Apple CEO Tim Cook Did Not Wear The Vision Pro ‘Headset’ At WWDC 2023?",
    "Apple Unveils Vision Pro Headset At WWDC 2023; Here's What The 'Spatial Computer' Can Do",
    "Microsoft to Pay USD 20 Million to Settle US Charges for Violating Children's Privacy",
    "Air India New Delhi-San Francisco Flight Diverted to Russia, Engine Glitch Reported",
    "Honda Elevate SUV in Pics: See Design, Features, Interior and More",
    "Honda Elevate SUV Launch in India: Bookings Start in July 2023, Price Reveal Later",
    "Ola Electric Scooter Water Test: Youtuber Submerges EV Into Sea, End Result Left Internet In Shock",
    "Travelogue: Delhi-Jalandhar-Delhi in MG ZS EV, Range Anxiety Eliminated?",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Russia, Ukraine Point Fingers at UN Over Burst Dam Disaster; US Remains Uncertain",
    "Blinken to Reschedule Visit to China Amid Ongoing Tensions",
    "US Had Intel of Ukrainian Plan to Attack Nord Stream Project: Report",
    "Blinken in Saudi Arabia to Rebuild Strained US Ties with Oil-Rich Kingdom",
    "French Open: Carlos Alcaraz Books Novak Djokovic Clash as Aryna Sabalenka Condemns Ukraine War",
    "'Need to Improve Our Defending..': Indian Men's Hockey Coach Craig Fulton",
    "Singapore Open: Kidambi Srikanth Wins; PV Sindhu, HS Prannoy Out",
    "Karim Benzema Joins Saudi Pro League, Signs Three-Year Deal With Al Ittihad",
    "Harness Your Inner Power: 5 Natural Foods For Strength and Vitality",
    "Female Fitness Coach Loves Working Out Draped In Sarees, Watch VIRAL Videos",
    "Citadel Jet-Jetting Alert: Which Destinations Should Be On Your List From The Citadel TV Show?",
    "Ananya Panday's Handstand Sets Fitness Goals High; Discover The Health Benefits",
    "How to Choose Perfect Lipstick for your Wedding Day",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "When Did Mark Zuckerberg Become 'Shredded'? All About His Controversy With Jiu Jitsu EXPLAINED",
    "BJP-Congress Slugfest Over Anti-Cow Slaughter Law in Karnataka: What's the Row? EXPLAINED",
    "'Fail-proof' Relay Rooms: Officials Say 'Intentional Malfunction' May be Behind Odisha Disaster",
    "How AI Helped Find a New Antibiotic to Fight a Deadly Superbug | Explained",
    "Opinion | Pakistan Army and Its Imran Khan Dilemma: No Light at the End of the Tunnel",
    "Opinion | Future of Indian Democracy Hangs on Prudent and Pragmatic Approach to Delimitation",
    "Opinion | India Has a New Parliament, But Does the Nation Need a New Capital Too?",
    "Opinion | Rahul Gandhi’s America Visit and the Dangerous Soros-ian Agenda to Target India",
    "BJP MP Alleges Rs 5,000 Crore Scam in Rajasthan IT Dept, Involvement of CM Gehlot's Relative",
    "Kerala Blasters 'Temporary Pauses' Women's Team After Being Fined by AIFF for Forfeiting ISL Game",
    "Manolo Marquez Confident FC Goa Will 'Field a Good Team and Enjoy a Good Season'"
]