[
    "'Any Direct Attacks...': UK 'Condemns' Threats to Indian Mission in London by Pro-Khalistanis",
    "Meet BJP’s 5 Rajya Sabha Probables for Its First Seat from West Bengal & Why They Made the Cut",
    "Costing More Than a Litre of Petrol, Why Tomato Prices are at All-Time High | Kolar Ground Report",
    "Jawan Trailer: Nayanthara First Look From Shah Rukh Khan Film Leaks Online? Photo Goes Viral",
    "No Truck With Nitish Kumar Again, Bihar CM Stands Exposed for Supporting the Corrupt: BJP Sources",
    "'No PM Should Be Without Wife': Lalu Prasad Yadav's Advice to Rahul Gandhi on Marriage",
    "Did Mark Zuckerberg Drop An Update On Cage Fight With Elon Musk After Threads' Launch?",
    "Evelyn Sharma Welcomes Baby Boy, Yeh Jawaani Hai Deewani Star Becomes Mother For 2nd Time",
    "Tamim Iqbal Announces Retirement Months Ahead of ICC ODI World Cup 2023",
    "IRCTC Announces International Tour Package to Bali: Price, Itinerary, Dates, and More",
    "Akanksha Puri On Her Bigg Boss OTT 2 Stint, The 'Kiss' Task & Salman Khan | EXCLUSIVE",
    "Alia Bhatt, Kiara Advani, Sara Ali Khan & Shraddha Kapoor Bring Back The Yellow Saree To Bollywood",
    "Huma Qureshi And Director Ashwiny Iyer Tiwari On Women In Films & Their Movie 'Tarla' | EXCLUSIVE",
    "Deepika, Anushka Or Kiara-Who Should Replace Priyanka In Jee Le Zaraa? | Alia Bhatt | Katrina Kaif",
    "Take Notes From Deepika Padukone On How To Start & End Your Day | Mental Health",
    "Nysa Devgan's Rumoured Boyfriend Orry Says 'Don't Leave Me Now, Baby...'; Kajol's Daughter Replies",
    "Salaar Teaser: Fan Spots MAJOR Clue Hinting At Biggest Crossover Between Prabhas, KGF Star Yash",
    "When Shah Rukh Khan Offered Money To Get Best Actor Award: 'Main Ghatiya Ho Gaya...'",
    "Sexy! Nikki Tamboli Goes Bold In A Very Plunging Mini Dress, Hot Video Goes Viral; Watch",
    "When Anil Kapoor Said He Would 'Leave' Wife Sunita Kapoor For Kangana Ranaut: 'She Is So...'",
    "When 'Married' Raj Kapoor Spoke About His Alleged Affair With Nargis: 'My Wife Is Not My...'",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Tilak Varma Gets Maiden India Call-up For West Indies T20Is: All You Need to Know About MI Star",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be  ...",
    "Vande Bharat Passenger Upset Over 'Now vs Then' Quality of Food, IRCTC Responds  ...",
    "Did You Know 'Jaane Tu Ya Jaane Na' Had an Easter Egg Tribute to Samuel Beckett' ...",
    "What Happens When a Bird Hits An Aeroplane At High Speed? Scary Pic Goes Viral",
    "Ahead Of Jawan's Trailer Launch, Shah Rukh Khan Fans Take Twitter By Storm; Check It Out",
    "Rakhi Sawant's Response To Rising Vegetable Prices: 'Khudke Khet Mein Sabjiya Lagaungi'",
    "Ranveer Singh To Be Announced as New Don After RRKPK Release? Here's What We Know",
    "Stress Levels Are Higher in India Since Covid-19 Pandemic",
    "India's Got Talent 10: New Promo Featuring Terrific Acts Out, Here's When & Where You Can Watch",
    "Bengal Panchayat Polls Ground Report | No Campaigning, No Voting—Why Giria Has Given Up",
    "NCP Entry Triggers Berth Pangs in Shinde Camp, CM Leaves President's Tour to Pacify Sena MLAs",
    "Internal Strife between Haqqani, Kandhari Groups, Sirajuddin’s ‘Ambitions’ Threaten Taliban",
    "Bengal Panchayat Polls: Murshidabad Test Vital for Mamata Critic Adhir Ranjan as Cong Takes on TMC",
    "TXT and Jonas Brothers Promise Playful Summer Song With ‘Do It Like That’ Teaser; Watch",
    "Panchamrit In Liquor Bottles To Anoint Sai Baba At Andhra Pradesh Temple Angers Devotees",
    "Astrological Predictions for July 6, 2023",
    "Maruti Suzuki Invicto Launched In India",
    "6 TV Divas Stun In Bikinis",
    "Animals Who Have Great Memory",
    "5 Ways To Achieve Work-Life Balance",
    "Corporate Lessons From Chanakya",
    "JioBharat 4G Mobile Launched: Price And...",
    "What If 'Friends' Was Made In India?",
    "5 Phones Set To Launch This Week",
    "9 Divas Slay In Sexy Bikinis",
    "Shravani Mela Special Trains Announced",
    "9 Benefits Of A Plant-based Diet",
    "Buy iPhone 14, iPhone 14 Plus At Huge...",
    "6 Bollywood Actors Ruling OTT Platforms",
    "9 Tips To Stay Healthy In Monsoon",
    "7 Times Celebrities Slayed In Pearls",
    "Who is Akanksha Puri, Bigg Boss OTT 2...",
    "If South Indian Stars Turned Spiritual Gurus…",
    "WhatsApp Will Let You Share High-Quality Videos",
    "Most Powerful Numbers In Numerology",
    "9 Of The Highest-Grossing Hindi Films Of 2023",
    "Have You Linked Your PAN-Aadhar Card?",
    "5 Benefits Of Sleeping Next To Someone You Love",
    "Monthly Horoscope For July 2023",
    "9 Tips To Take Care Of Your Coloured Hair",
    "8 Tips To Take Care Of Your Pets During...",
    "Meet Jassym Lora Russell, Andre Russell's Wife",
    "9 Big Hindi Movies Releasing Soon",
    "7 Tips To Smell Good In Hot Weather",
    "ICC World Cup 2023: Match Schedule Of Team...",
    "7 Indian Restaurants In World's Legendary...",
    "How To Grow Sunflower In A Pot?",
    "How To Make Joint Financial Decisions As A...",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "5 Food Combinations with Milk to Avoid",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Shilpa Shetty Encourages Surya Namaskar",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Mission Impossible 7: Tom Cruise Film Built a Train From Scratch Only To DESTROY It | Viral Video",
    "Bangladesh vs Afghanistan 2023 Live Score, 1st ODI Latest Updates",
    "ICC ODI World Cup Qualifier: Andrew Balbirnie Steps Down as Ireland White-ball Captain",
    "Ajit Agarkar: Five Reasons Why Former India Cricketer Has Been Appointed as Chief Selector",
    "John Wright Birthday: Did You Know Why New Zealand Cricket Legend was Called ‘Shake’?",
    "In A First, Govt Decides to Open All CAPF Hospitals for Public to Aid Health Infrastructure",
    "Second Vande Bharat for Rajasthan, Gujarat | How It Will Ease Travel Between Tourists Destinations",
    "WATCH | MP CM Chouhan Washes Sidhi Pee Case Victim's Feet, Says 'I was Pained...'",
    "GST Council Meeting: Planning To Buy Multi-Utility Vehicle? Here's What Could Change Soon",
    "Gold Prices Rise In India: Check 24 Carat New Rate In Your City On July 6",
    "Sensex Gains 340 pts, Ends Near 65,800; Nifty Tests 19500; Auto Stocks Rally",
    "Petrol, Diesel Fresh Prices Announced For July 6: Check Fuel Rates In Your City",
    "Mouni Roy's Gorgeous Moments In Sarees, Check Out Her Top 6 Looks",
    "Haute Couture Diva: Shilpa Shetty Raises Temperature In A Red Cutout Dress",
    "Radhika Madan Exudes Elegance In Bright Pink Lehenga, Check Out The Diva's Stunning Pictures",
    "Sobhita Dhulipala's Ravishing Corset Look, Check Out Her Sizzling Pics",
    "Rekha's Cover Shoot For Fashion Magazine Cover: She Rules The Golden Theme",
    "Hot! Chitrangada Singh Is a Smokeshow Sporting a Tangerine Pant Suit and a Sexy Black Bralette",
    "Soha Ali Khan-Kunal Kemmu's Trip To Disneyland With Daughter Inaaya, See Pics",
    "Uorfi Javed Is Making Headlines With Her Bold Outfit Choices Time And Again",
    "Disha Patani Sets Internet Ablaze With Latest Photoshoot, Check Out Her Hot And Sexy Pictures",
    "Sobhita Dhulipala Paints An Elegant Picture In Black Saree, Check Out Her Stunning Pictures",
    "Rakul Preet Singh Exudes Elegance In Bodycon Dresses, Check Out Her Pics",
    "Dhoni’s Cheekiest Stump Mic Recordings Captured in Viral Twitter Thread",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be Cautious",
    "Created Threads Account? You Can’t Delete it Without Deleting Instagram and People are Livid",
    "Threads App is Here to Rival Twitter and Desis Are Already Weaving Hilarious Memes",
    "Sister-In-Law Exposes Bride's OnlyFans Account At Engagement; Internet Demands Apology",
    "SAMS Odisha Plus 2 Admission 2023: First Merit List Today at samsodisha.gov.in",
    "JoSAA Counselling 2023 Round 2 Seat Allotment List to be Out Today at 5 PM",
    "UGC NET Answer Key 2023 LIVE: NTA Releases Answer Key, How To Raise Objections",
    "UP Board 10th, 12th Scrutiny Results 2023 Today at upmsp.edu.in",
    "ICAI Releases CA Foundation, Inter, Final Exam Dates For November 2023",
    "More Education & Career News",
    "Threads Is Offering Easy Sign-Up: How To Follow Your Instagram Friends, Import Bio",
    "What Is Meta's Threads And How To Use It: A Step-By-Step Guide",
    "Samsung Galaxy Unpacked Event Officially Confirmed For July 26: Check Timings, What To Expect",
    "ChatGPT-Maker OpenAI Says It Is Doubling Down On Preventing AI From 'Going Rogue'",
    "Meta Launches Twitter Rival Threads, Posing a Direct Challenge to Elon Musk",
    "Bajaj-Triumph Speed 400 Launched at Rs 2.23 Lakh, Scrambler 400X Price Reveal Later",
    "Maruti Suzuki Invicto Launched in India, Price Starts at Rs 24.79 Lakh",
    "Vande Bharat Express: Chennai to Vijayawada in Just 6.5 Hours, Check Details",
    "Indian Railway to Introduce Affordable Non-AC Vande Sadharan Train, Check Details",
    "2023 Kia Seltos Facelift Unveiled, Bookings Start from July 14",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "‘Prigozhin Is in St Petersburg’: Belarus Prez Lukashenko Says Wagner Chief Is in Russia",
    "Alleged Russian Missile Strike in Lviv Apartment Kills Four",
    "French Cops Can Now Spy on Suspects by Remotely Activating Mobile Camera, Mic, GPS",
    "Trudeau Says He’s Tough on Terror after Facing Flak for Not Reining in Khalistan Separatists",
    "PSG President Nasser Al-Khelaifi Under Investigation Over Detention and Torture of Lobbyist",
    "Shakira Makes a Bold Statement in a ‘NO’ Trench Coat at the Haute Couture Fashion Week",
    "A Sneak Peek Into Deepika Padukone's Healthy Morning Routine",
    "Harnaaz Sandhu's Latest Photos Prove Confidence Is The Best Accessory",
    "Indians, Second Most Confident Travellers in Asia-Pacific, Reveals Survey",
    "World Zoonoses Day 2023: History, Significance, and How to Celebrate",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "All About the Digital Personal Data Protection Bill, 2022 | Explained",
    "What is a Demarche that the Indian Govt Has Issued to Canada Over 'Pro-Khalistani Activities'?",
    "After Maharashtra's Maneuvers, Will Bihar Boil With Political Upheaval? Explained",
    "Orkney Wants to Leave UK to Join Norway, But Why?",
    "Opinion | The Teesta Setalvad Files: A Sordid Saga of Forgery and Perjury",
    "Opinion | Dr Syama Prasad Mookerjee and Subhas Chandra Bose: The Icons of West Bengal",
    "Opinion | How Nephew Ajit’s Betrayal Would Hurt Sharad Pawar For The Rest Of His Life",
    "Opinion | SCO is Neither About Security Nor Good Neighbourliness, But it Has a Hidden Potential",
    "Global Watch | Violence in France: An Inevitable Clash of Civilisations",
    "Bengal Panchayat Polls: Shattered By Firecracker Factory Blast, Khadikul Still Looking for Answers",
    "Bengal: 48 Hours to Go for High-stakes Panchayat Polls; Campaign Goes Local, Regional, Central",
    "Happy Days for 'Divorced' SAD-BJP Alliance, 'Remarriage' on The Cards?",
    "ISL Transfer News: FC Goa and Nikhil Prabhu Part Ways; NorthEast United Sign Phalguni Singh",
    "PSG Unveil New Centre-Back Signing Milan Skriniar From Inter"
]