[
    "'Nitty Gritty of  United Oppn...': Kejriwal's 3rd Attempt to Seek Cong Support on Delhi Ordinance",
    "Islam Safe in Bharat, But People Need to Forget About Foreign Connections: RSS Chief Mohan Bhagwat",
    "Manipur Ceasefire Under Scanner After Amit Shah's Stern Warning to Violators",
    "Delhi Murder: Sahil's Police Remand Extended, Psychoanalysis Test on Cards; New Video Emerges",
    "Indian Cricket Team's Brand New Test, ODI and T20I Jerseys Revealed",
    "Shocking! Bhojpuri Singer Nisha Upadhyay Suffers Bullet Injury During Her Show In Patna",
    "'Like Filth Seeking Flies': BJP Slams Congress, Raghuram Rajan as India Clocks 7.2% Growth in GDP",
    "Hrithik Roshan's Fighter 'Bigger' Than Shah Rukh Khan's Pathaan? Siddharth Anand's Plan Revealed",
    "Australia Legend Slams 'Over the Top' Gesture From Steve Smith Ahead of WTC Final Against India",
    "HMPV Virus Spreading in US; All About 'The Most Important Virus' You've Never Heard of | 10 Points",
    "Deepika Padukone Holds Ranbir Kapoor Close As They Reunite After Many Years For YJHD Reunion",
    "TCS Work From Office Policy: IT Firm Warns of Paycut, Leave Deduction For Employees",
    "Aamir Khan Says Will Return To Films When Emotionally Ready | Here's How He's Enjoying His Break",
    "Sonakshi In Dahaad; Sanya In Kathal, Shefali In Delhi Crime & More | How Female Cops Save The Day",
    "Suffering From Hypertension? Say Goodbye To Stress In 30 Seconds The Malaika Arora Way!",
    "Sexy! 'Bikini Queen' Mouni Roy Stuns All With Her Hottest Photoshoot Ever",
    "BLACKPINK's Jisoo Tests Covid-19 Positive, To Skip Concerts In Japan | Official Statement",
    "Samantha Goes On Lunch Date With Vijay Deverakonda In Turkey, Says 'Some Friends Gently...'",
    "Sexy! Sonali Raut Heats Up Instagram With Sizzling Look In A Bralette, Hot Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "MS Dhoni Undergoes Successful Knee Surgery in Mumbai",
    "'Dhonimania' Is the Big Takeaway From IPL 2023 For Pakistan's Ramiz Raja",
    "WATCH: MS Dhoni Fulfils Fan Request With Selfie on Mumbai Roads Days After IPL Title Triumph",
    "Indian Cricket Team Jersey Launch Highlights: Classy New India Kit Revealed Ahead of WTC Final",
    "Peak Bengaluru: Bus Driver Eats Lunch While Stuck in Traffic, Internet Says 'Can ...",
    "Desi Mom's Emotional Comeback After Fight With Daughter is Too Hilarious",
    "Maharashtra Villagers Exposing Poor-quality Road By Lifting it Like a 'Carpet' I ...",
    "Sweet Mangoes to Rain Delays: IPL 2023 Summed Up in One Video Packed With Iconic ...",
    "Alia Bhatt Pays Tribute To Her 'Nana'; Hrithik Roshan's Fighter To Be Bigger Than SRK's Pathaan?",
    "Esha Gupta Looks Absolutely Brave and Beautiful in Recent Photo From Qatar",
    "How Do You Tell Whether the Person You’re Dating Is Unhappy? Take Note of These Signs",
    "When Karan Johar Asked Tabu About Her Rumoured Relationship With Nagarjuna",
    "Oil Prices Surge Ahead of OPEC+ Meeting, Easing Debt Ceiling Concerns",
    "Stock Markets Surge as US Labor Market Data Eases Rate Hike Concerns",
    "Jordan Crown Prince Weds Saudi Architect in Royal Ceremony",
    "Famed Australian Soldier Loses Defamation Case Over War Crimes in Afghanistan",
    "Airbnb Sues New York City Over 'De Facto Ban' on Short-Term Rentals",
    "Sara Ali Khan News | Sara Ali Khan Shuts Trolls Who Criticised Her Visit To Mahakaleshwar Temple",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "Top 9 Richest People in the World",
    "9 Upcoming Movies In June 2023",
    "Why Is Pride Month Celebrated In June?",
    "Astrological Predictions for June 1, 2023",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for May 31, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Alia Bhatt Holds Raha Close As They Get Papped Following Actress' Grandfather’s Demise; Watch",
    "Vatsal Sheth To Return To TV After 3 Years With Tejasswi Prakash's Naagin 6? Know Here",
    "Shaheer Sheikh’s Woh Toh Hai Albelaa To Go Off Air? Here's What We Know",
    "Wasim Akram Predicts 'Bright Future' For Rising India Star After IPL 2023",
    "On This Day in 2014: Kolkata Knight Riders Beat Kings XI Punjab To Win Second IPL Title",
    "Happy Birthday Dinesh Karthik: Top 5 International Knocks of the Wicketkeeper-Batter",
    "ENG vs IRE 2023: Fast Bowler Josh Tongue Set for Test Debut at Lord's",
    "India Carries Out Successful Training Launch of Medium-Range Ballistic Missile Agni-1",
    "Karnataka Necrophilia Case: HC Asks Centre to Frame Laws against Sexual Assault of Deceased People",
    "Meth Worth Rs 350 Cr Seized from 2 UP Houses; Smugglers Stitch Drug Into Garments, Send to Ports",
    "GST Collections Jump 12% YoY to Rs 1.57 Lakh Crore In May 2023",
    "Planning A Visit To A Bank This Month? Know June Holidays",
    "IT Hiring Sees 23% Decline In May 2023; Oil & Gas, Real Estate, Banking Top Hiring Sectors: Report",
    "Meet K Krithivasan: TCS Welcomes New Visionary CEO Today; Here's What You Should Know",
    "LPG Commercial Cylinder Slashed By Rs 83.50; Will Domestic Cooking Gas Become Cheaper?",
    "Raai Laxmi Turns Up The Heat In Stylish Blue Swimsuit, Check Out The Beauty's Hottest Pictures",
    "Mouni Roy To Shilpa Shetty Kundra: Celebrities Who Own Swanky Restaurants In Mumbai And Abroad",
    "Kennedy Screening: Sunny Leone, Manoj Bajpayee, Shabana Azmi, Vijay Varma, Sudhir Mishra Attend",
    "Bride, Groom and Snake: Photos from Pre-wedding Shoot are Giving Internet the Chills",
    "Maharashtra Villagers Exposing Poor-quality Road By Lifting it Like a 'Carpet' Inspire Memes",
    "153 Prisoners Die In El Salvador Jail, The Cruelest In The World",
    "Sweet Mangoes to Rain Delays: IPL 2023 Summed Up in One Video Packed With Iconic Memes",
    "'Welcome Back' Was So Bad Naseeruddin Shah Called it 'Goodbye Again' in Hilarious Slip-up",
    "NCERT Allegedly Removes Periodic Table from Science Textbook, A Lookback at Chapters Eliminated",
    "RBSE 5th Result 2023: Rajasthan Board Result Declared, 97.30% Students Pass",
    "Kritika Goyal, Daughter Of A Judge And Sister Of An IPS Officer, Gets AIR 14 In UPSC 2022",
    "Meet Vrajesh Chetan Shah Who Scored 86.83% In Class 12 Exams Despite Partial Blindness",
    "CBSE 10th, 12th Supplementary Exam 2023: Submission of LOC Starts Today at cbse.gov.in",
    "More Education & Career News",
    "WhatsApp Is Crashing On Android If You Click On This Link: Know More",
    "Instagram Chief Explains How Reels And Photos Are Ranked",
    "Apple India Records Rs 25 Crore In Sales Thanks To New Store Launches In Mumbai And Delhi",
    "Digital Loan Apps Cannot Access Your Location Or Call Logs In India: What It Means",
    "Apple App Store Turns 15; Users Spent $1.1 Trillion On Apps In 2022",
    "Delhi to Mumbai Airfares Skyrocket, Surpassing Ticket Price to Dubai",
    "Meet the Indian Sardar Who Owns 15 Turban Colour Matching Rolls-Royce Cars, Details Here",
    "2024 Range Rover Sport SV Unveiled with the Powerful 626 Bhp V8 Engine, Details Inside",
    "Ola S1, S1 Pro E-Scooters Price Hiked After Cut in FAME II Subsidies; Check Latest Price Here",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "India, Nepal Resolve to Address Boundary Dispute Amicably; Ink Raft of Pacts to Broadbase Ties",
    "Russia 'Thwarts' Attack on Border as Three Killed in Kyiv",
    "The 2023 Atlantic Hurricane Season is Now Underway: Here's What to Know",
    "US Slaps Sanctions Against Sudan After Ceasefire Violations",
    "Zelensky Warns Doubts on Ukraine NATO Membership Endanger Europe",
    "Junior Men's Asia Cup Hockey: India Clinch Title With 2-1 Win Over Pakistan in Final",
    "UWW Ranking Series: Manjeet Wins Greco-Roman Bronze in Kyrgyzstan",
    "French Open 2023: Casper Ruud, Elena Rybakina Through to Round Three",
    "Protesting Wrestlers Mentally Shattered After Police Manhandling Incident, According to Sources",
    "Lionel Messi to Leave PSG, Head Coach Christophe Galtier Confirms",
    "The Root Cause of Dry Skin and the Best At-Home Treatments to Relieve It",
    "5 Fruitful Ways to Achieve Jelly-Like Skin",
    "Arunachal Pradesh's Rich Natural Beauty Makes It Perfect For A Vacation",
    "MasterChef Pankaj Bhadouria’s 3 Recipes for World Milk Day; Must Try These!",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Skip Leg Day at the Gym? New Study Shows Why It May be Essential to Heart Health | Explained",
    "Manipur Violence: As Amit Shah Holds Meet With Political, Civil Leaders, the Conflict Explained",
    "What is Foucault's Pendulum Installed in New Parliament Building & How Does it Work?",
    "Bajrang Punia Warns Against 'Morphed' Photos of Wrestlers: How to Spot an AI Deepfake? Explained",
    "Opinion | Why US Defence Secretary’s Upcoming India Visit Should Focus on China",
    "Opinion | 9 Years of Modi Government: Unleashing J&K’s Unprecedented Triumphs",
    "Indian Ink | The 3% Fallacy: India’s Education Spends Are Far More Than Critics Claim",
    "Opinion l 9 Years Of Modi Government Has Given India Poorna Swaraj",
    "Delhi Minister Atishi Gets Public Relations Department; Number of Portfolios Under Her Rise to 9",
    "Congress to Attend June 12 Meeting of Opposition Parties in Patna, Says Ramesh",
    "Real Madrid Star Karim Benzema Set To Leave For Saudi Pro League, According to Report",
    "Barcelona Given 10 Day Deadline To Make Transfer Decision For Lionel Messi, Says Report"
]