[
    "Adipurush Dialogue 'Jalegi Tere Baap Ki' Removed After Backlash, Replaced With THIS Line",
    "Makers of Taarak Mehta Ka Ooltah Chashmah Would Harass Me, Force Me to Drink, Says Actress in FIR",
    "Kangana Ranaut Brutally Trolled After Tiku Weds Sheru Promo Takes Massive Dig at Hrithik Roshan",
    "Sanjay Leela Bhansali Is Finally Making Baiju Bawra After ‘20 Years’ of Meticulous Planning",
    "World Motorcycle Day 2023: Top 5 Bikes Launching in India Later This Year",
    "Alia Bhatt Embraces Barbiecore Era For 'Heart Of Stone' Promotion | All About The Viral Pink Trend",
    "Rakul Preet Singh & Pragya Jaiswal Turn To Cold Water Therapy For Fitness | Know Benefits & More",
    "Rocky Aur Rani Kii Prem Kahaani Teaser: Alia Bhatt, Ranveer-Starrer Is A Celebration Of Bollywood",
    "Lust Stories 2 Trailer: Married Vijay Varma Tries To Kiss Ex Girlfriend Tamannaah Bhatia",
    "Hema Malini Family Reacts For 1st Time To Sunny Deol's Son Karan Deol's Wedding",
    "Fans Point Out Sunny Deol's Wife Pooja Deol Looks 'Sad' In Son Karan Deol's Wedding Pics",
    "Adipurush Box Office Day 5: Prabhas Film Tanks Miserably Amid Protest, Earns Rs 10 Cr",
    "Mukesh Khanna Says Adipurush Team Must Not Be Forgiven: 'They Should Be Burnt'",
    "Sexy! Disha Patani Goes Bold In A Sizzling Saree With Plunging Blouse, Hot Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Railways' Upendra Yadav On the Fast Track to Team India",
    "Ashes 2023: ICC Punishes All 22 Players of England & Australia Featured in Edgbaston Test",
    "Man Calls 'Andhadhun' Underrated and Bollywood Fans Hilariously Share 'Hidden' G ...",
    "Viral Video of Chocolate Ice Cream Being Made With Oil Has Desis Feeling 'Heavy' ...",
    "Poo in 'K3G', Govinda: Indians Hilariously Show Up for 'Barbie' Premiere in Gorg ...",
    "Fish is Kolkata: Desis 'Savour' Stereotypical Foods From Different States in Vir ...",
    "Kangana Ranaut Reacts After Sunil Lahri Pins His Hopes On Her Sita Following Adipurush Debacle",
    "Chhavi Mittal’s Quick And Easy Recipes To Keep A Check On Your Calorie Count",
    "Mumbai: Eight Injured as Lift Plunges from Fourth Floor at Kamala Mills High-rise",
    "Janhvi Kapoor-Varun Dhawan Discuss Bawaal Promotions From Shoot Locations In UK And Serbia; Photos",
    "When Kedar Shinde Got To Know That He Had Become Father To A Daughter",
    "When Hema Malini's Daughter Esha Deol Met Dharmendra's 1st Wife Prakash Kaur: 'She Left Me After…’",
    "Want to Control Diabetes? Try Having Herbal Leaves Every Morning.",
    "Remembering AR Rahman's Father RK Shekhar On His Birthday",
    "Chef Sanjeev Kapoor Shares His Simple Tips To Cook Millets",
    "Woman Killed by Crocodile in Odisha's Kendrapara, Sparks Outrage",
    "International Yoga Day 2023 | Meenakshi Lekhi Exclusive Interview On Yoga Day 2023 | News18",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Malaika Arora's Favourite Yoga Asanas",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "AI-generated Photos of Bollywood Stars As...",
    "Best Careers For Each Zodiac Sign",
    "Most Practiced Yoga Asanas In The World",
    "Astrological Predictions For June 21, 2023",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Why Travel To India During The Monsoon",
    "Steps To Help You Recover After Breakup",
    "9 Great Benefits Of Cycling",
    "If Cricketers Were Marvel Superheroes…",
    "WhatsApp Users Can Send Video Messages",
    "6 Zodiac Signs That May Have Difficult...",
    "Meet Drisha Acharya, Karan Deol`s Fiancé",
    "Hotness Alert! Celebs Who Went Topless",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Astrological Predictions for June 17, 2023",
    "Kriti Sanon Inspired Saree Looks",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Happy Father's Day 2023: Wishes, Images &...",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Astrological Predictions for June 16, 2023",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Remembering Sushant Singh Rajput",
    "Astrological Predictions for June 15, 2023",
    "Top 6 Budget-friendly ACs Under Rs 30,000",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Lust Stories 2 Trailer: Married Vijay Varma Tries To Kiss Ex-Girlfriend Tamannaah Bhatia",
    "'Forever Grateful': Virat Kohli Writes a Short Note on Completing 12 Years in Test Cricket",
    "Watch: Ricky Ponting Delivers a Savage Remark After Kevin Pietersen Praises Joe Root",
    "Want To Improve Your CIBIL Score? Follow These Steps",
    "I-T Department Reports Surge In Taxpayers Earning Over Rs 1 Crore",
    "Do You Know Why Mutual Funds Investments Are Subject To Market Risks? Check Here",
    "Sensex Hits All-Time High At 63,588 Led By Index Heavyweights; What Should Investors Do?",
    "EPFO Nomination Process Online: Step-By-Step Guide To Add Nominee In Your PF Account",
    "Sanya Malhotra Looks Ravishing In Yellow Bikini, Check Out The Diva's Hot And Sexy Pictures",
    "Hot! 7 Times Urfi Javed’s Super Daring and Racy Looks Set the Internet Ablaze",
    "SEXY! Anusha Dandekar Shows Off Her Curves In Hot Bikini Photos",
    "Actors Who Played Lord Ram: Prabhas, Arun Govil, Gurmeet Choudhary, Jeetendra, Ashish Sharma",
    "Watch: Cat Turns Into 'Goalkeeper' While Watching Football Match On TV",
    "SRK to Rihanna: 'Favourite Celebrity Quote' Trend on Twitter Proves Our Stars are Sharp-witted",
    "Procedure Gone Wrong at Gurugram Salon Damages Woman's Ear, Owner Gets Charged",
    "Aamir Khan’s Train Stunt Scene From 'Ghulam' Goes Viral, Twitter Screams 'VFX'",
    "Andhra Pradesh Extends Half-Day School Schedule Till June 24 Amid Heatwave",
    "JEE Advance 2023: IIT Increases Intake This Year, Total 17,385 Seats Available",
    "REET Level 2 Results 2023 To Be Announced Soon At rsmssb.rajasthan.gov.in; How To Check",
    "NEET PG 2023 Counselling To Begin Soon, Check Update",
    "More Education & Career News",
    "Apple ID Owners Gets Passkey Support On Apple Web Logins: All You Need To Know",
    "Google Chrome Adds Improved Translation, Lens And Maps Features On iPhones: Details",
    "Microsoft, Activision CEOs On Witness List For Hearing On FTC Bid To Block Merger",
    "Apple Watch Alerts Woman About Her Dangerous Blood Clot, Saving Her Life",
    "World's First AI-Powered DJ, RadioGPT, Debuts On US Radio",
    "2023 Honda Shine 125 Launched in India, Price Starts at Rs 79,800",
    "Hero Xtreme 160R 4V Review: It's Here to Stay and Dominate",
    "AC Cabins for Truck Drivers to Become Mandatory by 2025, Details Inside",
    "Bhavish Aggarwal Teases New Variant of Ola S1 Electric Scooter",
    "2023 Kia Seltos Facelift India Debut on July 4, Deliveries Start Later",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Prime Minister Modi-led Event Sets Guinness World Record for Most Nationalities in a Yoga Session",
    "'Yoga Is Truly Universal': PM Modi Leads International Yoga Day Event at UN HQ",
    "Five-time Champion Venus Williams Handed Wildcard Entry Into Wimbledon 2023 Women's Singles",
    "'Always Believe In': Chelsea Post Thank You Note for N'Golo Kante Following Saudi Switch",
    "International Yoga Day 2023: 5 Homegrown Activewear Brands That Are Perfect For Every Yoga Session",
    "Happy International Day of Yoga 2023: Wishes, Photos, Images, Messages, and Quotes to Share",
    "International Yoga Day: The Best Yoga Retreats In The Country For You To Visit",
    "International Yoga Day: 7 Tips To Begin Your Yoga Journey With Confidence",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Opinion | Why US Rolls Out The Red Carpet For Prime Minister Modi",
    "Opinion | Partygate is a Reflection of Boozy Britain, Not Just Tipsy Tories",
    "OPINION | Why Medical Colleges and IITs Must Celebrate Raja Ram Mohun Roy’s Legacy",
    "Opinion | Jairam Ramesh is Wrong: Gita Press is More Gandhian Than Rahul’s Congress",
    "Opinion | Adipurush Row: Contemporarise Ancient Texts, But For God’s Sake Never Trivialise Them",
    "Hope Cong Will Clear Stand on Delhi Services Ordinance at June 23 Opposition Meet, Says Kejriwal",
    "WATCH | Maha MLA Loses Cool, Slaps Junior Civic Engineer in Public"
]