[
    "Rain Alert: Monsoon Reaches Delhi, Overnight Showers Turn Weather Pleasant; Yellow Alert in Mumbai",
    "Manipur: Mob of 1200-1500 Led by Women Stops Army Op, 12 Militants Released After Standoff",
    "Sikh Man Shot Dead in Pakistan's Peshawar, Second Such Attack in Two Days",
    "Kiara Advani Pregnant? Actress Sparks Pregnancy Rumours After Netizens Claim She Has a 'Baby Bump'",
    "SAFF Championship: India and Nepal Players Get into an Ugly Fight | WATCH",
    "West Bengal: Several Wagons of 2 Goods Trains Derail After Collision in Bankura; No Casualties",
    "Bangalore Metro: Purple Line Opens for Public in August; Check Stations, Routes and More",
    "Hot! Janhvi Kapoor Exudes Class in a Sultry Saree and Stunning Nath; See Photos",
    "2023 Kia Seltos Facelift GT Line Clear Images Leaked Ahead of Launch in India",
    "Sobhita Dhulipala On Rumours About Her Personal Life & Her Role In 'The NIght Manager' | EXCLUSIVE",
    "Tamannaah Bhatia & Vijay Varma On Love And Their Film 'Lust Stories 2' | Sujoy Ghosh | EXCLUSIVE",
    "Ram Charan & Wife Upasana Kamineni Make First Public Appearance With Daughter | WATCH | EXCLUSIVE",
    "'Ramayan' Series Director Moti Sagar On 'Adipurush', Importance Of Right Casting, More | EXCLUSIVE",
    "Rashmika Mandanna, Vijay Deverakonda's Secret Date Sparks Patch-Up Rumours, Video Goes Viral",
    "Tamannaah Bhatia Told Vijay Varma 'You're 1st Actor I'm Kissing On Screen'; His Reply",
    "Hrithik Roshan Tells 70-Year-Old Woman ‘Single Toh Main…’ As She Proposes To Him On Stage, Watch",
    "Janhvi Kapoor's Sister Khushi Kapoor Dating AP Dhillon? Singer's Latest Song Sparks Rumours",
    "HOT! Nia Sharma Goes Bold In A Racy Cutout One-Piece, Sexy Video, Photos Go Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "IND vs WI 2023: Cheteshwar Pujara Breaks Silence After Being Dropped From India's Test Squad",
    "ICC ODI World Cup 2023 Schedule Expected to be Announced on June 27",
    "BCCI to Field Men & Women Teams as Cricket Returns to Asian Games 2023: Report",
    "'Changing Venues Plays into an Advantage': Ashwin's Take on Pakistan's Request to Change WC Venues",
    "Dosa 'Cone' Made With Ice Cream and Chocolate Leaves Internet 'Cold'",
    "Viral Chats Show OceanGate CEO Offered Cut-price Sub Tickets to US Financier Ahe ...",
    "OceanGate Job Posting for New Sub Pilot During Titan Search Causes Uproar Online",
    "ChatGPT Version of Titan Tragedy in Carrie Bradshaw's Voice Looks Straight Out o ...",
    "When Pooja Bhatt Confessed She 'Hated' Salman Khan, 'Didn't Get Along' With Bigg Boss OTT 2 Host",
    "Munna Bhai 3 Cancelled? Arshad Warsi Hints Reunion With Sanjay Dutt Might Not Happen, Here's Why",
    "Shriya Saran Risks Wardrobe Malfunction in a Sexy Denim Dress, Gets Brutally Trolled",
    "Kiara Advani Opens Up About Married Life With Sidharth Malhotra: 'Mera Jo Pati Hain...'",
    "Salman Khan Slams Aaliya Siddiqui; Calls Her A ‘Crybaby’ on Bigg Boss OTT 2; Here's What Happened",
    "Russia News | Rostov-on-don Resident Asks Wagner Fighters About Civil War | English News | News18",
    "Rafuchakkar SPOTTED Out And About! Guess Who?!",
    "West Bengal News | West Bengal Panchayat Elections | Central Forces Reach Various Districts",
    "Amit Shah News | Home Minister Amit Shah Recalls 1975 Emergency And Hits Out At Congress | News18",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Astrological Predictions for June 25, 2023",
    "9 Celebrities Who Swear By Aerial Yoga",
    "India ODI Squad vs WI Announced",
    "5 Food Combinations with Milk to Avoid",
    "6 K-Drama Locations You Can Visit In South...",
    "Top 5 Bikes Launching In India This Year",
    "India Test Squad VS WI Announced",
    "Kajol Set To Make OTT Debut With Lust Stories 2",
    "9 Benefits Of Drinking Saffron Tea",
    "Indian Cricketers in Their Alternate...",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Best Careers For Each Zodiac Sign",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Why Travel To India During The Monsoon",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Kriti Sanon Inspired Saree Looks",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "How To File Complaint With IRCTC",
    "Remembering Sushant Singh Rajput",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Ashes 2023: England Include Teenage Rehan Ahmed to Squad for Second Test vs Australia",
    "Navdeep Saini to Miss July County Stint After Getting India Call-up For West Indies Tests",
    "ODI WC Qualifiers: Hasaranga, Kumara, Openers Lead Sri Lanka to Thumping 10-wicket Win Over Oman",
    "'I Was Fighting an Uphill Battle': James Anderson on 'Kryptonite' Edgbaston Pitch",
    "Raina Indian Restaurant: Where Suresh Raina's Passion for Food Meets Authentic Indian Flavours",
    "‘Digital Kumbh Museum’: How UP is Planning ‘Once-in-a-lifetime’ Experience for Mahakumbh 2025",
    "Mumbai’s First Monsoon Rain Leaves Waterlogging in Many Areas; Orange Alert Issued for Next 24 Hrs",
    "‘Yeh Dosti Hum Nahi Todenge’: Egyptian Woman Sings Hindi Song to Welcome PM Modi | Watch",
    "Who is Mary Millben, Popular American Singer Who Touched PM Modi's Feet in Viral Video?",
    "Gold Rate Falls Again In India: Check 22 And 24 Carat Price In Your City On June 25",
    "Petrol, Diesel Updated Price Today: Check Latest Rates In Your City On June 25",
    "Govt Nod to Hike in Wage of Coal India Non-Executive Employees",
    "TCS Suspends 4 Employees for Violating Code of Conduct After Whistleblower Complaint: Report",
    "Forex Boost: India's Foreign Exchange Reserves Jump $2.35 Billion To $596.1 Billion",
    "Esha Gupta Is A Sight To Behold In White Bodycon Dress, Check Out The Diva's Sexy Pictures",
    "Moments From Intimate Dinner for PM Modi Hosted by US President Biden, First Lady Jill | In Pics",
    "Sanya Malhotra Looks Ravishing In Yellow Bikini, Check Out The Diva's Hot And Sexy Pictures",
    "Masaba Gupta Trolled for Her Brand's Newly-launched 'Surya Namaskar' Sunscreen, Actor Reacts",
    "ChatGPT Version of Titan Tragedy in Carrie Bradshaw's Voice Looks Straight Out of Show",
    "How to Kill a Star? Astronomers See a 'Demolition Derby' Scenario",
    "PSSSB Declared Punjab Patwari 2023 Results; Check Out",
    "NMC to Conduct Webinar on NExT Exam With Medical Colleges, MBBS Students on June 27",
    "Jharkhand Public Service Commission Notifies 120 Vacancies For Food Safety Officer, CPDO",
    "Maharashtra School Education Dept Proposes Re-Examination In  Classes 5 and 8",
    "India To Set Up Indo-U.S. Global Challenge Institutes To Deepen Research & People Exchanges",
    "More Education & Career News",
    "How To Save Your Job From ChatGPT? Genpact COO Shibu Nambiar Shares Tips",
    "Soon Get A ‘Smart Wedding Ring’ In India Which You Can ‘Swipe’ While Shopping",
    "PlayStation 6 And Next Xbox Could Launch In 2028, Microsoft Reveals At FTC Hearing",
    "YouTube Is Making Account Impersonation Harder To Protect Creators: What We Know",
    "Indian Govt Warns iPhone And iPad Users Of High-Level Security Flaw, Urgent Update Needed",
    "2023 Ducati Panigale V4 R Launched in India, Price Starts at Rs 69.90 Lakh",
    "Hyundai Exter Production Begins, Price Announcement on July 10",
    "Maruti Suzuki Invicto Clear Images Emerge Ahead of Official Launch, Spotted at Dealership",
    "Royal Enfield Classic 650 Spotted Testing for First Time in India, Check What's New",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Putin Likely 'Very Scared' of Mutiny and 'Hiding Somewhere': Ukraine President Zelensky",
    "Revolts in Russia: Before Wagner Group's Mutiny, Kremlin Survived Two Other Crises",
    "UK Says Fighter Jets Scrambled 21 Times in Three Weeks to Respond to Russian Aircraft",
    "Football Transfer News Live Updates, 25 June: Chelsea Incomings Start as Clear Out Continue",
    "Birmingham Classic: Barbora Krejcikova and Jelena Ostapenko Set up Championship Clash",
    "Queen’s Club Championships: Carlos Alcaraz Enters Summit Clash With Win Over Sebastian Korda",
    "Did Not Ask for Exemption from Trials, Just Asked for Time to Prepare: Wrestlers Threaten to Quit",
    "Recurring UTIs? –  3 Ways To Prevent It",
    "Pride Month 2023: Celebrate Colour With Pride Themed Jewellery",
    "Weight Loss: What To Do After A ‘Fat Loss Phase’?",
    "From Kitchen Romance to Kama Sutra: Top 5 Fantasies Of Married Couples in India",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Who Were the People aboard the Titan Submersible? EXPLAINED",
    "Opposition Meet: Lessons from the Third Fronts of Yesterday",
    "Titan Submersible Deaths: Look at How 'Catastrophic Implosion' Differs from Explosion",
    "India Set to Join Artemis Accords: Know Arrangement on 'Sending Humans Back to Moon by 2025'",
    "Opinion | PM Modi in US: Altogether a Successful Visit in Substance and Public Relations",
    "Opinion | Prime Minister Modi’s Landmark Visit to the US Full of Symbolism and Substance",
    "Opinion | Irony Dies A Thousand Deaths As Barack Obama Lectures India On Human Rights",
    "Opinion | ‘Yogaplomacy’: Transforming India's Soft Power Into Economic Strength",
    "In Meeting with Union Minister, K T Rama Rao Demands MGNREGA-like Job Scheme for Urban Poor",
    "Not a Face But Public Issues to Dominate 2024 Lok Sabha Polls: Tejashwi Yadav",
    "Karnataka: BBMP Polls in December, Says Transport Minister Ramalinga Reddy",
    "NRC Will Be Implemented in Jharkhand if BJP Voted to Power Next Year: Raghubar Das",
    "SAFF Championship: India Seal Progress to Semis With 2-0 Win Over Nepal",
    "Tom Holland Irks Tottenham Fans With Real Madrid Request to Harry Kane, Son Hueng-Min"
]