[
    "Chandrayaan-3: 4 Yrs On, ISRO Eyes Moon Again, Scientists Confident of Historic Lunar Landing",
    "Ajit Pawar News Updates: Sharad Pawar Calls Up All NCP MLAs, 'Many Said They'll Return'",
    "As Sourav Ganguly Teases Birthday Suspense, Sources Close to 'Dada' Bet on Biopic Over Politics",
    "'Dhokaa Uddhavji Ne Diya...': Devendra Fadnavis On What Happened in Maharashtra in 2019 | Watch",
    "Brij Bhushan Singh, Vinod Tomar Summoned by Delhi Court, Will Have to Appear on July 18",
    "McDonald's 'Drops Tomatoes' from Menu Amid Price Hike: When Will Tomato Rates Go Down?",
    "Shah Rukh Khan Teases Dhoni About Deepika In Viral Video, MSD Replies 'Yuvraj Knows Her'",
    "Noida Residents Slam Dog Owner for Pet Inside Lift, Viral Video Sends Internet Into Frenzy",
    "Mark Zuckerberg Takes a Cheeky Dig at Twitter, Promises to Keep Threads 'Friendly'",
    "Dengue Cases On The Rise: Understand The Symptoms, Tests And Precautions",
    "Deepika Padukone & Sonakshi Sinha Spotted Wearing The Same Coord Sets; Who Styled It Better",
    "Mona Singh On Her New Web Show 'Kafas', 'Jassi Jaisi Koi Nahin' & 'Laal Singh Chadha' | EXCLUSIVE",
    "Ranveer Singh Birthday: Will He Reclaim His Throne With Rocky Aur Rani Kii Prem Kahaani Release?",
    "Sonu Sood Flexes His Muscles Giving Major Fitness Goals In Latest Workout Video",
    "Ameesha Patel Makes Big Claims, Says Contemporaries Like Kareena, Esha 'Snatched Films' From Her",
    "Dharmendra Reacts To Jaya Bachchan's 'Crush' On Him During Guddi: 'We Had Fun...'",
    "Blind Review: Sonam Kapoor Shines Bright But Purab Kohli's Ruthless Killer Act Steals The Show",
    "MORE FROM NEWS18 CRICKETNEXT",
    "MS Dhoni Birthday: Landmark Moments From Legendary Skipper’s Illustrious Career",
    "MS Dhoni Turns 42: A Look at MSD's Personal Life And The Untold Story",
    "MS Dhoni Birthday: Thala’s Top Moments with Chennai Super Kings",
    "Employee Catches Manager Watching 'Lust Stories 2' During Office Video Call, Scr ...",
    "'Threading' Memes Go Viral As Users Look for 'Uploading' Term on Twitter's Clone ...",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be  ...",
    "Vande Bharat Passenger Upset Over 'Now vs Then' Quality of Food, IRCTC Responds  ...",
    "Actress Rupali Bhosale Leaving Aai Kuthe Kay Karte? Here's What We Know",
    "Shahid Kapoor Shares Passionate Kiss With Mira Kapoor As He Wishes Wife ‘Happy Anniversary’",
    "Amitabh Bachchan Hits Back At Trolls In Cryptic Post, Says ‘The Man Is 81 And Mental, Bear Him’",
    "Malaika Arora Rocks Blue Activewear As She Steps Out Of The Gym, Sets Major Fitness Goals",
    "Sanjay Leela Bhansali To Redesign Heeramandi Sets For Baiju Bawra? Here's What We Know",
    "Mission Impossible Dead Reckoning Part One: Release Date, Review, Cast, Plot, Trailer",
    "SatyaPrem Ki Katha Box Office: Kartik Aaryan and Kiara Advani's Film Crosses Rs 50 Crore Mark",
    "Rainy Day Blues? Here’s How You Can Cheer Yourself Up",
    "Trained Only in Crowd Control, RAF Struggling with Manipur Deployment, Writes to State Police",
    "Only 12% Cities Measuring Air Quality, Monitoring Remains Sparse, Shows Study",
    "Karnataka Budget 2023: Big Relief For Gig Workers, To Get Insurance Cover, Check Details",
    "India's 'Titanic' Moment Goes Viral As Overflowing River Mishap Sparks Instant Laughter",
    "Dhoni Turns 42: A Look at His Rare Photos",
    "Astrological Predictions For July 7, 2023",
    "9 Destinations To Visit In Monsoons",
    "Meta's Threads Is Here: What Is It And How...",
    "9 Foods You Can Eat While Fasting",
    "Maruti Suzuki Invicto Launched In India",
    "9 Interesting Facts About MS Dhoni",
    "6 TV Divas Stun In Bikinis",
    "6 Health Benefits Of Raspberries",
    "Animals Who Have Great Memory",
    "5 Ways To Achieve Work-Life Balance",
    "Corporate Lessons From Chanakya",
    "JioBharat 4G Mobile Launched: Price And...",
    "What If 'Friends' Was Made In India?",
    "5 Phones Set To Launch This Week",
    "9 Divas Slay In Sexy Bikinis",
    "Shravani Mela Special Trains Announced",
    "9 Benefits Of A Plant-based Diet",
    "Buy iPhone 14, iPhone 14 Plus At Huge...",
    "6 Bollywood Actors Ruling OTT Platforms",
    "9 Tips To Stay Healthy In Monsoon",
    "7 Times Celebrities Slayed In Pearls",
    "Who is Akanksha Puri, Bigg Boss OTT 2...",
    "WhatsApp Will Let You Share High-Quality Videos",
    "Most Powerful Numbers In Numerology",
    "9 Of The Highest-Grossing Hindi Films Of 2023",
    "5 Benefits Of Sleeping Next To Someone You Love",
    "Monthly Horoscope For July 2023",
    "9 Tips To Take Care Of Your Coloured Hair",
    "8 Tips To Take Care Of Your Pets During...",
    "9 Big Hindi Movies Releasing Soon",
    "7 Tips To Smell Good In Hot Weather",
    "ICC World Cup 2023: Match Schedule Of Team...",
    "7 Indian Restaurants In World's Legendary...",
    "How To Grow Sunflower In A Pot?",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Steps To Help You Recover After Breakup",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Tips To Make The Right Career Move",
    "Shilpa Shetty Encourages Surya Namaskar",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Neeyat Review: Vidya Balan Is Flawless But The Movie Has A Rushed Climax",
    "Katrina Kaif's Staff Pushes Fans Away As Chaos Erupts At Airport After Her Entry, Video Goes Viral",
    "Rishabh Pant Makes His Debut on Threads Asks Mark Zuckerberg to Join His Thread",
    "Bas de Leede's All-round Show Helps Netherlands Book Last Spot in 2023 ODI World Cup",
    "Senior Tamil Nadu Police Official Dies by 'Suicide'; CM Stalin Expresses Shock",
    "Tomato Price On The Rise, Hits Rs 250 Per Kg In THIS State; Overall Thali Cost Rises",
    "Home Loan Hurdles: Top Blunders To Avoid When Financing Your Dream Home",
    "Rekha Jhunjhunwala Gets Richer By Rs 500 Cr In Few Minutes From This Tata Stock; Do You Own?",
    "IdeaForge Technology Lists At A Premium of 93% at Rs 1,300; What Should Investors Do Now",
    "Sensex Falls 505 pts, Nifty Gives up 19,350 amid global weakness; ZEEL Jumps 9%",
    "Disha Patani's Lifestyle Magazine Cover Shoot, Check Out Her Sexy Photos",
    "Ahead of MS Dhoni's 42nd Birthday, Know All About CSK Captain's Cute Love Story With Sakshi",
    "Made in Heaven, Bandish Bandits And Other Indian OTT Shows To Look Forward To",
    "Mouni Roy's Gorgeous Moments In Sarees, Check Out Her Top 6 Looks",
    "Haute Couture Diva: Shilpa Shetty Raises Temperature In A Red Cutout Dress",
    "Radhika Madan Exudes Elegance In Bright Pink Lehenga, Check Out The Diva's Stunning Pictures",
    "Sobhita Dhulipala's Ravishing Corset Look, Check Out Her Sizzling Pics",
    "Rekha's Cover Shoot For Fashion Magazine Cover: She Rules The Golden Theme",
    "Hot! Chitrangada Singh Is a Smokeshow Sporting a Tangerine Pant Suit and a Sexy Black Bralette",
    "Soha Ali Khan-Kunal Kemmu's Trip To Disneyland With Daughter Inaaya, See Pics",
    "AI Model Asks Zerodha, PhonePe Founders to Sing and Their Replies Are Too Hilarious",
    "MrBeast Becomes First 'Threads' User To Hit 1 Million Followers, Beats CEO Mark Zuckerberg",
    "This Pole Dance Video Inside Delhi Metro Upsets Internet",
    "Happy Birthday MS Dhoni: Viral Videos in This Twitter Thread Prove Why There's No One Like Him",
    "UPSC Success Stories: 5 Doctors Who Left Their Careers to Become IAS Officers",
    "Over 100 Universities Across India To Join FYUP This Year, Others To Join In 2024: UGC Chief",
    "TS Inter, SSC Supply Results 2023 Live Updates: Results Declared, How to Check Marks Memo",
    "CSIR UGC NET 2023 Results to be Declared Soon at csirnet.nta.nic.in, Steps to Download",
    "More Education & Career News",
    "Is Meta's Threads The 'Twitter Killer'? Here's What Makes It Different",
    "Meta's Threads App Crosses 95 Million Posts, Claims Top Spot On Apple App Store",
    "Google Fixes 3 Most Actively Exploited Bugs On Android: All Details",
    "ISRO Confirms Chandrayaan 3 Mission Launch Date For July 14: All Details",
    "How Elon Musk Has Made Facebook and Zuckerberg Cool Again!",
    "Honda Elevate SUV Variants and Features Leaked Ahead of Launch in India",
    "Watch: Kerala Man Receives His Beloved Hindustan Ambassador as a Gift From His Sons",
    "From MS Dhoni To Riteish Deshmukh, Indian Celebrities Who Own Electric Vehicles",
    "Maruti Suzuki Invicto vs Toyota Innova HyCross: Price, Features, Engine Specs and More",
    "A Complete Analysis On Bajaj-Triumph Speed 400 vs Harley-Davidson X440",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "‘US-China Decoupling Impossible’: US Finance Minister Treads Cautiously on Beijing Trip",
    "Robodebt Scandal Rocks Australia as False Debt Repayment Demands Sent to 400k Recipients",
    "PM Modi’s Speech at US Congress Now in VR, Speaker McCarthy’s Office Releases New Video",
    "‘Forbidden Services, Hardship to Grooms’ Families’: Taliban's Reasons for Beauty Salon Ban",
    "One Step Closer to Return? Court Slams Former Govt for ‘Vendetta’, Acquits Nawaz",
    "Canada Open 2023: Indian Shuttlers PV Sindhu, Lakshya Sen March Into Quarterfinals",
    "Throwback Wimbledon Moment: David Beckham Can't Stop Smiling as Rafael Nadal Score a Point | WATCH",
    "'Didn't Know it was Britney Spears': Victor Wembanyama Clarifies Stance on 'Slapping Incident'",
    "Arsenal Set to Sign Jurrien Timber From Ajax For €42million Fee",
    "Transfer News Live, July 7: Manchester United Chase Andre Onana, Arsenal To Unveil Declan Rice",
    "World Chocolate Day 2023: From Heartbreaks To Romance, Chocolates Are The Perfect Mood Booster",
    "Kerala Rat Fever Outbreak: Causes, Symptoms, Treatment and Prevention",
    "World Chocolate Day 2023: Here's Exploring The Diverse World Of Chocolates",
    "Radhika Madan Slays in a Structured Green Gown, Looks All Things Gorgeous",
    "Cardi B’s ‘Green Goddess’ Moment at Gaurav Gupta’s Couture Show is Haute and Happening!",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Japan to Release Fukushima's Radioactive Water into Ocean, China Fumes: All You Need to Know",
    "Opinion | Uniform Civil Code: A Major Step Towards Inclusive Growth and Larger Indian Identity",
    "Opinion | The Teesta Setalvad Files: A Sordid Saga of Forgery and Perjury",
    "Opinion | Dr Syama Prasad Mookerjee and Subhas Chandra Bose: The Icons of West Bengal",
    "Opinion | How Nephew Ajit’s Betrayal Would Hurt Sharad Pawar For The Rest Of His Life",
    "Opinion | SCO is Neither About Security Nor Good Neighbourliness, But it Has a Hidden Potential",
    "As Kejriwal Waits for His Tea Invite, Staking It All on Congress Yes or No is a Costly Gamble",
    "Rebels with A Cause: Can Eknath Shinde And Ajit Pawar Help BJP Clear 2024 Maha Maths Test?",
    "Real Madrid Sign Arda Guler on Six-year Deal from Fenerbahce",
    "David de Gea Posts Cryptic Tweet Even as Manchester United Future Remains Unsure",
    "Jim Ratcliffe Still Keen to Buy Manchester United as Sale Process Drags On",
    "Mason Mount Says, 'Keen to Replicate Manchester United Legends Who Donned the Number 7 Shirt'",
    "Paris Saint-Germain Signs Free Agent Marco Asensio on 3-year Deal"
]