[
    "Higher BMI Not Necessarily Linked to Higher Risk of Death? What New Study Says | Explained",
    "Salman Khan Holds Cigarette While Hosting Bigg Boss OTT 2; Photo Goes Viral, Sparks Debate",
    "If India Want Asia Cup Games at Neutral Venue, Will Withdraw from ODI WC: Pakistan Sports Minister",
    "Banned in Over 100 Countries, What are the Deadly Cluster Bombs US Will Supply to Ukraine?",
    "Harmanpreet Kaur's Fifty Guides Indian Women to 7-Wicket Win Over Bangladesh in First T20I",
    "Embrace the Monsoon With These Must Have Skincare and Haircare Essentials",
    "Misbah-ul-Haq With Dua Lipa? Viral Instagram Pic of Singer Has Pakistan Fans Puzzled",
    "When Abhishek Bachchan Was SLAPPED By a Fan: 'She Didn't Like My Film, Said I Should Stop...'",
    "Delhi-NCR Residents Share Videos of Waterlogged Roads as Heavy Rains Lash Capital",
    "Hyundai Exter India Launch Tomorrow, Here's All You Need to Know",
    "Kiara Advani Follows A Healthy Lifestyle To Achieve Fitness | Watch To LEARN How She Does It",
    "Manoj Muntashir's Apology For Adipurush Dialogues | Neetu Kapoor's Birthday | Tom Cruise's Hindi",
    "Deepika Skips Birthday Post For Ranveer | Bhumi Spotted With Beau | Bollywood Celebs Join Threads",
    "Paris Fashion Week 2023: Models Walk The Ramp In Crazy Swimsuits, Creepy Tuxedo Affixed To Waist",
    "Sonu Sood Flexes His Muscles Giving Major Fitness Goals In Latest Workout Video",
    "Jawan Prevue Date CONFIRMED: Shah Rukh Khan Makes Exciting Announcement With Fiery Video",
    "Savage Karan Johar Shuts Down Troll Asking If He is Gay, Asks User 'You're Interested?'",
    "Jawan Trailer Shah Rukh Khan Atlee Song Dubai Filming Location",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Ashes Live Score, 3rd Test Day 4 Updates: England Lose Ben Stokes Early, Australia Eye Comeback",
    "Sourav Ganguly Took The Indian Team Forward, Backed His Players: Mohammad Kaif",
    "'Inspired By Ghajini': Woman Trolled For Putting ‘Finally CA Aditi’ Update Every ...",
    "Make Up Using Pepsi And Tampons? Ex-convict Reveals How She Made Products in Pri ...",
    "Employee Catches Manager Watching 'Lust Stories 2' During Office Video Call, Scr ...",
    "'Threading' Memes Go Viral As Users Look for 'Uploading' Term on Twitter's Clone ...",
    "Waiting to See How BJP Handles Its New 'riff-raffs': Uddhav Thackeray",
    "Samantha Ruth Prabhu Shares Cryptic Post About 'Hardest Six Months', Says 'Made It To The End'",
    "Late Pregnancy Risks: Challenges and Concerns of Motherhood in Later Years",
    "Bawaal Trailer: Varun Dhawan And Janhvi Kapoor's Dramatic Love Story Has Shades Of War; Watch",
    "Saira Banu Misses Her 22 Inches Waistline As She Shares Throwback Photo; Fans React",
    "Vijay Varma Calls GF Tamannaah Bhatia 'Cinema Goddess' As He Cheers Her For 'Kavaalaa' Song",
    "Let’s Talk Law | Legally Speaking, the Shariat Act of 1937 Must Go. Here is Why",
    "Karnataka’s ‘Gig’ Budget Move: Rs 4-Lakh Insurance for E-Commerce Workers | Bharat Jodo Impact",
    "Schools in Ghaziabad to Remain Closed till July 15 Amid Heavy Rainfall",
    "Vande Bharat Train's New Colour Inspired by Tricolour: Railway Minister Vaishnaw",
    "Astrological Predictions For July 9, 2023",
    "9 Bollywood Actresses Who Gave Bold Scenes",
    "Benefits Of Mango Seeds For Skin and Hair",
    "Dhoni Turns 42: A Look at His Rare Photos",
    "10 Largest Economies In The World",
    "6 Hidden Gems Of Europe To Leave You Spellbound",
    "5 Essential Monsoon Skincare Hacks",
    "Meta's Threads Is Here: What Is It And How...",
    "9 Foods You Can Eat While Fasting",
    "Maruti Suzuki Invicto Launched In India",
    "9 Destinations To Visit In Monsoons",
    "9 Interesting Facts About MS Dhoni",
    "6 TV Divas Stun In Bikinis",
    "6 Health Benefits Of Raspberries",
    "Animals Who Have Great Memory",
    "5 Ways To Achieve Work-Life Balance",
    "Corporate Lessons From Chanakya",
    "JioBharat 4G Mobile Launched: Price And...",
    "What If 'Friends' Was Made In India?",
    "5 Phones Set To Launch This Week",
    "9 Divas Slay In Sexy Bikinis",
    "Shravani Mela Special Trains Announced",
    "9 Benefits Of A Plant-based Diet",
    "Buy iPhone 14, iPhone 14 Plus At Huge...",
    "6 Bollywood Actors Ruling OTT Platforms",
    "9 Tips To Stay Healthy In Monsoon",
    "7 Times Celebrities Slayed In Pearls",
    "Who is Akanksha Puri, Bigg Boss OTT 2...",
    "WhatsApp Will Let You Share High-Quality Videos",
    "Most Powerful Numbers In Numerology",
    "9 Of The Highest-Grossing Hindi Films Of 2023",
    "5 Benefits Of Sleeping Next To Someone You Love",
    "Monthly Horoscope For July 2023",
    "9 Tips To Take Care Of Your Coloured Hair",
    "8 Tips To Take Care Of Your Pets During...",
    "9 Big Hindi Movies Releasing Soon",
    "7 Tips To Smell Good In Hot Weather",
    "ICC World Cup 2023: Match Schedule Of Team...",
    "7 Indian Restaurants In World's Legendary...",
    "How To Grow Sunflower In A Pot?",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Steps To Help You Recover After Breakup",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Tips To Make The Right Career Move",
    "Shilpa Shetty Encourages Surya Namaskar",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Janhvi Kapoor Impresses Fans With Her Voice By Singing 'Tumhe Kitna Pyaar Karte' Song From Bawaal",
    "Jungkook Was Struggling, I Cried a Lot: Jimin Makes Heartbreaking Reveal In BTS' New Book",
    "Ranbir Kapoor Goes Shirtless, Jumps Into Ocean With Niece Samaira During Vacay, Photo Goes Viral",
    "OMG2 Teaser Date Out: Akshay Kumar To Drop Promo Day After Shah Rukh Khan's Jawan, Deets Inside",
    "Sexy! Neha Sharma, Sister Aisha Flaunt Cleavage in Plunging Yellow Dresses, Hot Photo Goes Viral",
    "ICC ODI World Cup Qualifier Final Live Cricket Score, Sri Lanka vs Netherlands",
    "WATCH: Pinch-to-zoom Style Artistic Tribute to MS Dhoni Goes Viral",
    "'Was Looking for it Everywhere': Ishan Kishan Gets His Shirt Back from 'Brother' Shubman Gill",
    "MP Police Register Case Against Digvijaya Singh Over Controversial Post on Ex-RSS Chief Golwalkar",
    "UP: Dalit Man Slapped, Forced to Lick Slippers in Viral Video; Accused Booked",
    "How Sudha Murty Reacted Adorably On 'Successful Man' Narayana Murthy?",
    "Gold Rate Today: Prices Rise In Many Indian Cities On July 9, Check Details Here",
    "Centre Empowers ED by Bringing Goods & Services Tax Network Under PMLA",
    "Indian Railways Cuts Train Ticket Prices By Up To 25%, Including Vande Bharat; Details Here",
    "Income Tax Refund: Now, Quickly Check Your Tax Refund Status In Simple Way; A Step-By-Step Guide",
    "Esha Gupta's Sexy Bikini Pics Are Soaring Temperature, Check Them Out",
    "Margot Robbie's Barbie Press Tour Outfits, Check Out Her Glam Pics",
    "Huma Qureshi Joined By Saqib Saleem, Anupam Kher, Karishma Tanna, Sharib Hashmi At Tarla Screening",
    "Alaya F's Sultry Sartorial Looks Are Worth Bookmarking For Your Next Beach Vacation, See Photos",
    "Disha Patani's Lifestyle Magazine Cover Shoot, Check Out Her Sexy Photos",
    "Ahead of MS Dhoni's 42nd Birthday, Know All About CSK Captain's Cute Love Story With Sakshi",
    "Made in Heaven, Bandish Bandits And Other Indian OTT Shows To Look Forward To",
    "Mouni Roy's Gorgeous Moments In Sarees, Check Out Her Top 6 Looks",
    "'Inspired By Ghajini': Woman Trolled For Putting ‘Finally CA Aditi’ Update Every Year Since 2021",
    "Ranveer Allahbadia Credits His Success to God And Virat Kohli, Gets Brutally Trolled",
    "Make Up Using Pepsi And Tampons? Ex-convict Reveals How She Made Products in Prison",
    "Schools, Colleges In Mandi To Stay Shut Tomorrow As Heavy Rainfall Continues In Himachal",
    "NEET PG 2023 Counselling Registration Likely To Commence From July 15 At mcc.nic.in",
    "CUET PG 2023: NTA To Release Answer Key Soon, Check Latest Update",
    "MHT CET 2023 Counselling Registration Window For B.E, B.Tech Extended Till July 10",
    "NEET UG Counselling 2023: PwD Certificate Portal Opens, Check List Of Centres",
    "More Education & Career News",
    "Apple iPhone 15 Pro Expected To Launch In Dark Blue Colour: All Details",
    "Suspended Twitter Account Tracking Elon Musk's Jet Moves To Rival Meta's Threads",
    "Instagram Boss Doesn't Want You To Post News And Politics On Threads: Here's Why",
    "iPhone 15 Pro Max Expected To Come With A Price Hike: What We Know",
    "This Apple iPhone Costs More Than A Ferrari: Here's What Makes It So Expensive",
    "Triumph Speed 400, Scrambler 400 X Get 10,000 Bookings in Merely 3 Days of India Launch",
    "Triumph Street 400 On-Road Price Creates Controversy, Bajaj Issues Official Statement",
    "Honda Elevate SUV Variants and Features Leaked Ahead of Launch in India",
    "Maruti Suzuki Invicto vs Toyota Innova HyCross: Price, Features, Engine Specs and More",
    "A Complete Analysis On Bajaj-Triumph Speed 400 vs Harley-Davidson X440",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "After Riots, France Bans Fireworks Sales for Bastille Day Celebrations",
    "Solar Storm to Make Northern Lights Visible in 17 States in US on Thursday. Details Here",
    "26 Policemen Injured in Clashes at Eritrean Music Festival in Germany",
    "ISL Transfer News: Mohun Bagan Super Giant Announce Signing of India Defender Anwar Ali",
    "Sunil Chhetri Opens Up on What Keeps Him Going and He Why is Not Chasing 100 Goals for India",
    "Canada Open: Lakshya Sen Marches Into Finals, PV Sindhu Crashes Out in Semis",
    "Mouni Roy Oozes Oomph in a Gorgoues Off-Shoulder Gown and Flawless Makeup; See Photos",
    "Astrology: How to Choose Your Wedding Lehenga According to Your Zodiac Sign",
    "Virat Kohli’s Leg Day Mantra: Why Leg Workouts Are Worth the Sweat and Effort",
    "Why Do We Feel Low During Monsoon? 9 Effective Ways To Handle Monsoon Blues",
    "Detoxify And Cleanse Your Body With These Refreshing Drinks",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Use Your Emojis Carefully? Man Lands in Trouble Over 'Thumbs Up' Reply to Contract | Explained",
    "McDonald's 'Drops Tomatoes' from Menu Amid Price Hike: When Will Tomato Rates Go Down?",
    "Opinion | Today’s China Isn’t Real China, Can Be Broken Into Six Independent Nations",
    "Opinion | France Teetering on The Brink of Anarchy",
    "Opinion | 9 Years of Modi Govt and 100 Years of DU: Paving the Way for ‘Amrit Peedhi’",
    "Opinion | What Life Was Like Inside Bahadur Shah Zafar’s Red Fort",
    "Opinion | Uniform Civil Code: A Major Step Towards Inclusive Growth and Larger Indian Identity",
    "Conspiracy Being Hatched to Disturb Unity in Tipra Motha: Pradyot Kishore",
    "Bengal Poll Violence: 19 Dead, BJP Questions 'Silence' of Oppn on 'Murder of Democracy'",
    "Transfer News LIVE Updates, 9 July: Kylian Mbappe Saga Drags on, Lucas Hernandez Joins PSG"
]