[
    "'Jinnah's Muslim League? ...Sad': Now, Rahul Gandhi Upsets Kiren Rijiju | Know What Happened",
    "Why Has India Seen a 'Cooler Summer' & Why Do Forecasts Differ for Monsoon? Explained",
    "Scoop Review: Hansal Mehta Series Depicts A Journalist’s Life In An Apt Way",
    "SS Rajamouli Borrowed Rs 400 Cr For Baahubali At 24 Percent Interest? Rana Daggubati Reveals",
    "SHOCKING! 18-year-old Boy From UP Turns Deaf After Using In-ear TWS Earbuds",
    "Meta Asks Employees To Work From Office From September: Report",
    "When Javed Akhtar Revealed He Was Mistaken for Gulzar at Airport: 'Itna Bada Aadmi Aur...'",
    "Made-in-India Harley-Davidson X440 Roadster Bookings Open, India Launch on July 3",
    "World Environment Day 2023: 5 Tips To Minimize Waste And Foster Eco-Consciousness At Work",
    "Aamir Khan Says Will Return To Films When Emotionally Ready | Here's How He's Enjoying His Break",
    "Sonakshi In Dahaad; Sanya In Kathal, Shefali In Delhi Crime & More | How Female Cops Save The Day",
    "Suffering From Hypertension? Say Goodbye To Stress In 30 Seconds The Malaika Arora Way!",
    "Mumbaikar Review: Vijay Sethupathi Delivers Solid Performance In Quirky Urban Thriller",
    "Sanjay Dutt Pushes Away Fan Trying To Take Selfie, Netizens Slam Him; Watch Video",
    "Deepika Padukone Holds Ranbir Kapoor Close As They Reunite After Many Years For YJHD Reunion",
    "Sexy! Sonali Raut Heats Up Instagram With Sizzling Look In A Bralette, Hot Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "'Actually Felt Disrespected in The way That...': David Warner Slams CA Over Leadership Ban Row",
    "MS Dhoni Undergoes Successful Knee Surgery in Mumbai",
    "Indian Cricket Team's Brand New Test, ODI and T20I Jerseys Revealed",
    "'Dhonimania' Is the Big Takeaway From IPL 2023 For Pakistan's Ramiz Raja",
    "WATCH: MS Dhoni Fulfils Fan Request With Selfie on Mumbai Roads Days After IPL Title Triumph",
    "How Stadiums Erupt When Dhoni Enters the Field: Twitter Thread Shows Fascinating ...",
    "'Deepika Still Loves Ranbir Kapoor': Woman's Viral Tweet Has Fans Roasting Her t ...",
    "Man Gets Chunky Panday's Tattoo on Chest, Actor Says 'Humbled' in Instagram Phot ...",
    "Man Forgets to Switch Tab While Presenting on Google Meet, Shares 'Embarrassing' ...",
    "Salim Khan Did Not Like Son Salman's Role In Baghban, Called It ‘Artificial’",
    "Ileana D'Cruz Hints At Engagement With Mystery Man Amid Pregnancy; Photo Goes Viral",
    "Zinc Intake for Women: Reasons to Include It in Your Diet and Benefits",
    "Jennifer Lopez And Ben Affleck Buy Rs 494 Crore Mansion In Los Angeles; See Pics",
    "Nawazuddin Siddiqui On Coping With Marriage Rumours: 'I’ll have to be thick-skinned'",
    "Dipika Kakar Reacts To Fake Pregnancy Allegations, Says 'We Also Feel Bad, Get Upset'",
    "Mix Dal Chilla Recipe: Easy-to-make Healthy Option For Your Breakfast",
    "Sara Ali Khan News | Sara Ali Khan Shuts Trolls Who Criticised Her Visit To Mahakaleshwar Temple",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "Astrological Predictions for June 2, 2023",
    "Meet India's Richest Actresses",
    "9 Upcoming Movies In June 2023",
    "Top 9 Richest People in the World",
    "Why Is Pride Month Celebrated In June?",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for May 31, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Hrithik Roshan Says 'I Don't Get Nude In Films But...' In Viral Video; Fan Calls Him 'Naughty'",
    "Project K: Rana Daggubati Says Prabhas' Movie Will 'Break The Boundaries' Like Baahubali and RRR",
    "Tiger Vs Pathaan: Siddharth Anand To Get Rs 40 Cr For Salman Khan and Shah Rukh Khan Starrer?",
    "Malaika Arora Looks Hottest In Black As She Steps Out On Dinner Date With Son Arhaan; Pics",
    "Wasim Akram Predicts 'Bright Future' For Rising India Star After IPL 2023",
    "On This Day in 2014: Kolkata Knight Riders Beat Kings XI Punjab To Win Second IPL Title",
    "Happy Birthday Dinesh Karthik: Top 5 International Knocks of the Wicketkeeper-Batter",
    "ENG vs IRE 2023: Fast Bowler Josh Tongue Set for Test Debut at Lord's",
    "India Carries Out Successful Training Launch of Medium-Range Ballistic Missile Agni-1",
    "Karnataka Necrophilia Case: HC Asks Centre to Frame Laws against Sexual Assault of Deceased People",
    "Meth Worth Rs 350 Cr Seized from 2 UP Houses; Smugglers Stitch Drug Into Garments, Send to Ports",
    "With 7.2% GDP Growth, India Remains One of Fastest-Growing Major Economies In 2022-23",
    "TCS CEO K Krithivasan's Focus Areas: Generative AI, IoT, Cloud, Cybersecurity; Details Here",
    "Stock Market Updates: Sensex Up Over 200 pts, Nifty Above 18,550; Metals Stocks Rally",
    "Stocks to Watch: Adani Ent, IndusInd Bank, Infosys, Tata Motors, HCL Tech, and Others",
    "GST Collections Jump 12% YoY to Rs 1.57 Lakh Crore In May 2023",
    "Mouni Roy Sets Internet On Fire With Hot Bikini Photoshoot, Check Out The Diva's Sexy Pictures",
    "Raai Laxmi Turns Up The Heat In Stylish Blue Swimsuit, Check Out The Beauty's Hottest Pictures",
    "Mouni Roy To Shilpa Shetty Kundra: Celebrities Who Own Swanky Restaurants In Mumbai And Abroad",
    "Kennedy Screening: Sunny Leone, Manoj Bajpayee, Shabana Azmi, Vijay Varma, Sudhir Mishra Attend",
    "Did You Know 'Sholay' Has a Parody Called ‘Chholay?’ Check Out This Viral Video",
    "Rajesh Khattar Says He Won't Take Son Ishaan Or Shahid Kapoor's Help For Finding Work",
    "Farooq Sheikh Being an Understanding Dad in 'YJHD' is Everyone’s Favourite Scene",
    "What Makes Us Human? Primate Genome Study Offers Some Clues",
    "Man Forgets to Switch Tab While Presenting on Google Meet, Shares 'Embarrassing' Screenshot",
    "Rajasthan Board 10th Result 2023: Increase in Overall Pass Percentage, 90.49% Clear Exam",
    "Maharashtra SSC Result 2023: 93.83% Students Qualified SSC Exam; Know How To Download",
    "More Education & Career News",
    "The Creators Of ‘Lil Artist’ iOS App Share What It Takes To Make Your First Successful iPhone App",
    "WhatsApp Is Crashing On Android If You Click On This Link: Know More",
    "Instagram Chief Explains How Reels And Photos Are Ranked",
    "Apple India Records Rs 25 Crore In Sales Thanks To New Store Launches In Mumbai And Delhi",
    "Travelogue: Delhi-Jalandhar-Delhi in MG ZS EV, Range Anxiety Eliminated?",
    "Delhi to Mumbai Airfares Skyrocket, Surpassing Ticket Price to Dubai",
    "Meet the Indian Sardar Who Owns 15 Turban Colour Matching Rolls-Royce Cars, Details Here",
    "2024 Range Rover Sport SV Unveiled with the Powerful 626 Bhp V8 Engine, Details Inside",
    "Ola S1, S1 Pro E-Scooters Price Hiked After Cut in FAME II Subsidies; Check Latest Price Here",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Russia Says US Hacked Thousands of Apple Phones in Spy Plot",
    "Indian-Origin Dev Shah Wins Prestigious US Spelling Bee, Takes Home $50,000 Cash Prize",
    "US Fends Off National Default Fears as Senate Approves Debt Ceiling Deal, Sends it to Biden",
    "AI-Powered Drone Goes Rogue during US Military’s Test Simulation, ‘Attacks’ Human Operator",
    "World is Multipolar, Old Ways Can’t Address New Situations, Jaishankar Tells BRICS Counterparts",
    "Junior Men's Asia Cup Hockey: India Clinch Title With 2-1 Win Over Pakistan in Final",
    "UWW Ranking Series: Manjeet Wins Greco-Roman Bronze in Kyrgyzstan",
    "French Open 2023: Casper Ruud, Elena Rybakina Through to Round Three",
    "Protesting Wrestlers Mentally Shattered After Police Manhandling Incident, According to Sources",
    "Lionel Messi to Leave PSG, Head Coach Christophe Galtier Confirms",
    "Kiara Advani To Disha Patani; Bollywood Actresses Who Aced The Cut-Out Fashion Trend",
    "Astrology: Find Out What Your Birth WeekDay Says About You?",
    "World Environment Day: Top 5 Eco-Friendly Self-Care Products to Try Under Rs 1200",
    "How To Fix Your Sugar Cravings? Experts Share Tips",
    "Beach Goddess Alert: Aamna Sharif's Pictures Set Social Media on Fire",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Skip Leg Day at the Gym? New Study Shows Why It May be Essential to Heart Health | Explained",
    "Manipur Violence: As Amit Shah Holds Meet With Political, Civil Leaders, the Conflict Explained",
    "What is Foucault's Pendulum Installed in New Parliament Building & How Does it Work?",
    "Bajrang Punia Warns Against 'Morphed' Photos of Wrestlers: How to Spot an AI Deepfake? Explained",
    "Opinion | Analysing Drug Dimension in the Manipur Imbroglio",
    "Opinion | GDP Data: Decoding India’s Better Than Expected Economic Growth in 2022-23",
    "Opinion | Unseen War of Love Jihad Rages On and It is Time We Opened Our Eyes to It",
    "Opinion | 9 Years of Modi Government: Unleashing J&K’s Unprecedented Triumphs",
    "Islam Safe in Bharat, But People Need to Forget About Foreign Connections: RSS Chief Mohan Bhagwat",
    "Delhi Minister Atishi Gets Public Relations Department; Number of Portfolios Under Her Rise to 9",
    "Congress to Attend June 12 Meeting of Opposition Parties in Patna, Says Ramesh",
    "Real Madrid Star Karim Benzema Set To Leave For Saudi Pro League, According to Report",
    "Barcelona Given 10 Day Deadline To Make Transfer Decision For Lionel Messi, Says Report"
]