[
    "Adipurush Writer Manoj Muntashir Issues Public Apology After Defending Prabhas Film: ‘I Accept…’",
    "Shah Rukh Khan 'Forces' Lady Gaga To Take His Watch, Netizens Say 'Making Her Uncomfortable'",
    "Jawan: Shah Rukh Khan To Play Double Role, Key Details About His Character Revealed",
    "Doctor Receives Fake Rs 500 Note From Patient, Shares Funny Ordeal on Threads",
    "'Two Bouncers Per Over': BCCI Announces Major Rule Change for Mushtaq Ali Trophy; IPL Next?",
    "Let’s Talk Law | Legally Speaking, the Shariat Act of 1937 Must Go. Here is Why",
    "Mumbai: Yellow Alert Today; Despite Heavy Rainfall Water Shortage Continues In Some Area",
    "This Apple iPhone Costs More Than A Ferrari: Here's What Makes It So Expensive",
    "World Rum Day 2023: 3 Rum Day Cocktails You Must Have Today",
    "Deepika Padukone & Sonakshi Sinha Spotted Wearing The Same Coord Sets; Who Styled It Better",
    "Mona Singh On Her New Web Show 'Kafas', 'Jassi Jaisi Koi Nahin' & 'Laal Singh Chadha' | EXCLUSIVE",
    "Ranveer Singh Birthday: Will He Reclaim His Throne With Rocky Aur Rani Kii Prem Kahaani Release?",
    "Sonu Sood Flexes His Muscles Giving Major Fitness Goals In Latest Workout Video",
    "Shah Rukh Khan Teases Dhoni About Deepika In Viral Video, MSD Replies 'Yuvraj Knows Her'",
    "Korean Singer Lee Sang Eun Found Dead In Bathroom Minutes Before Her Performance",
    "3 Idiots 2 Coming Soon? Raju Aka Sharman Joshi Shares Big Update On Aamir Khan Starrer",
    "Ameesha Patel Makes Big Claims, Says Contemporaries Like Kareena 'Snatched Films' From Her",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Sourav Ganguly Birthday: Team India's Top 5 Performances Under Dada's Captaincy",
    "Ashes 2023, 3rd Test: Moeen Ali's Double Strike Puts Australia on Backfoot at Stumps on Day 2",
    "BCCI Apex Council Approves Participation of Men's and Women's Teams in Asian Games",
    "Ton-up Pathum Nissanka, Theekshana Guide Sri Lanka to 8-wicket Win Over West Indies",
    "Employee Catches Manager Watching 'Lust Stories 2' During Office Video Call, Scr ...",
    "'Threading' Memes Go Viral As Users Look for 'Uploading' Term on Twitter's Clone ...",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be  ...",
    "Vande Bharat Passenger Upset Over 'Now vs Then' Quality of Food, IRCTC Responds  ...",
    "Anupam Kher Announces His 538th Movie, Leaves Netizens Stunned With His Rabindranath Tagore Look",
    "Sexy! Esha Gupta Sets Temperature Soaring In Her Hot Bikini Photo; Check Out Here",
    "Love, Sex Aur Dhokha 2: Ekta Kapoor Announces Release Date",
    "Naagin 6 Climax: Tejasswi Prakash Dances To Silsila Ye Chahat Ka",
    "Tom Cruise Greets 'Namastey', Mission Impossible Star Leaves All Impressed With His Fluent Hindi",
    "Karnataka’s ‘Gig’ Budget Move: Rs 4-Lakh Insurance for E-Commerce Workers | Bharat Jodo Impact",
    "Rahul Gandhi Defamed a Community, Not Just A Person: Gujarat HC ‘Modi Surname’ Order",
    "Khalistanis and Gangsters, the New Terror Nexus: Crimes to Crackdown | Exclusive from Sources",
    "Dinner at Louvre, Photo with Mona Lisa: Here is PM Modi's Itinerary for 2-Day France Visit",
    "CUET UG 2023 Result Likely by Next Week on cuet.samarth.ac.in",
    "Woman Ties Husband's Hands And Legs Before Beating Him",
    "Astrological Predictions for July 8, 2023",
    "Dhoni Turns 42: A Look at His Rare Photos",
    "10 Largest Economies In The World",
    "6 Hidden Gems Of Europe To Leave You Spellbound",
    "5 Essential Monsoon Skincare Hacks",
    "Meta's Threads Is Here: What Is It And How...",
    "9 Foods You Can Eat While Fasting",
    "Maruti Suzuki Invicto Launched In India",
    "9 Destinations To Visit In Monsoons",
    "Astrological Predictions For July 7, 2023",
    "9 Interesting Facts About MS Dhoni",
    "6 TV Divas Stun In Bikinis",
    "6 Health Benefits Of Raspberries",
    "Animals Who Have Great Memory",
    "5 Ways To Achieve Work-Life Balance",
    "Corporate Lessons From Chanakya",
    "JioBharat 4G Mobile Launched: Price And...",
    "What If 'Friends' Was Made In India?",
    "5 Phones Set To Launch This Week",
    "9 Divas Slay In Sexy Bikinis",
    "Shravani Mela Special Trains Announced",
    "9 Benefits Of A Plant-based Diet",
    "Buy iPhone 14, iPhone 14 Plus At Huge...",
    "6 Bollywood Actors Ruling OTT Platforms",
    "9 Tips To Stay Healthy In Monsoon",
    "7 Times Celebrities Slayed In Pearls",
    "Who is Akanksha Puri, Bigg Boss OTT 2...",
    "WhatsApp Will Let You Share High-Quality Videos",
    "Most Powerful Numbers In Numerology",
    "9 Of The Highest-Grossing Hindi Films Of 2023",
    "5 Benefits Of Sleeping Next To Someone You Love",
    "Monthly Horoscope For July 2023",
    "9 Tips To Take Care Of Your Coloured Hair",
    "8 Tips To Take Care Of Your Pets During...",
    "9 Big Hindi Movies Releasing Soon",
    "7 Tips To Smell Good In Hot Weather",
    "ICC World Cup 2023: Match Schedule Of Team...",
    "7 Indian Restaurants In World's Legendary...",
    "How To Grow Sunflower In A Pot?",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Steps To Help You Recover After Breakup",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Tips To Make The Right Career Move",
    "Shilpa Shetty Encourages Surya Namaskar",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Malaika Arora and Arjun Kapoor Walk Hand In Hand As They Get Snapped; Watch",
    "Shehnaaz Gill's Explosive Take On Relationships: 'Been In Love Only Once. Everyone Is Selfish'",
    "Watch: MS Dhoni Receives Special ‘Thala’ Artwork Signifying His IPL Titles on 42nd Birthday",
    "IND vs WI: Virat Kohli Spotted Taking Selfies, Giving Autographs to Local Fans in Barbados",
    "Duleep Trophy: Vyshak Vijaykumar Claims Fifer as South Zone on Course to Chase Down 215",
    "Duleep Trophy: Ton-up Cheteshwar Pujara Puts West Zone in Commanding Position",
    "Ashes 2023: MCC Restricts Access of its Members After Long Room Incident at Lord's Test",
    "Law Panel Cautions People Against Fraudulent Whatsapp Messages, Calls in Its Name Over UCC Issue",
    "Kerala Teen Dies of Rare Brain Infection After Bathing in Contaminated Waters | Details Here",
    "Kashmir Railway on Track: Around 95% Work Completed on Katra-Banihal Section",
    "Petrol, Diesel Prices Announced For July 8: Check Latest Fuel Rates In Your City",
    "Inactive PAN? THESE 15 Financial Transactions Cannot Be Performed; Check Details",
    "Meet Amith Kishan: Who Left Banking To Build Rs 21 Crore Organic Farming Startup",
    "Vedanta Group Rejigs Semiconductor Business, Brings it Under Twin Star",
    "Underreporting Income Under ITR Can Be Dangerous, May Lead To Fine Or Even Jail: Tax Official",
    "Esha Gupta's Sexy Bikini Pics Are Soaring Temperature, Check Them Out",
    "Margot Robbie's Barbie Press Tour Outfits, Check Out Her Glam Pics",
    "Huma Qureshi Joined By Saqib Saleem, Anupam Kher, Karishma Tanna, Sharib Hashmi At Tarla Screening",
    "Alaya F's Sultry Sartorial Looks Are Worth Bookmarking For Your Next Beach Vacation, See Photos",
    "Disha Patani's Lifestyle Magazine Cover Shoot, Check Out Her Sexy Photos",
    "Ahead of MS Dhoni's 42nd Birthday, Know All About CSK Captain's Cute Love Story With Sakshi",
    "Made in Heaven, Bandish Bandits And Other Indian OTT Shows To Look Forward To",
    "Mouni Roy's Gorgeous Moments In Sarees, Check Out Her Top 6 Looks",
    "Did You Know Narayana Murthy Quit Job on His Wife's Birthday in 1976? Here's How She Reacted",
    "MrBeast Becomes First 'Threads' User To Hit 1 Million Followers, Beats CEO Mark Zuckerberg",
    "This Pole Dance Video Inside Delhi Metro Upsets Internet",
    "Happy Birthday MS Dhoni: Viral Videos in This Twitter Thread Prove Why There's No One Like Him",
    "Seeking For Career in Human Resources? Here’s a List of Internships To Apply For This Week.",
    "NEET UG 2023: Counselling Schedule Likely To Release This Week At mcc.nic.in",
    "DU Admissions 2023: Over 2 Lakh Registrations Recorded For UG Programmes",
    "More Education & Career News",
    "Is Meta's Threads The 'Twitter Killer'? Here's What Makes It Different",
    "Meta's Threads App Crosses 95 Million Posts, Claims Top Spot On Apple App Store",
    "Google Fixes 3 Most Actively Exploited Bugs On Android: All Details",
    "ISRO Confirms Chandrayaan 3 Mission Launch Date For July 14: All Details",
    "How Elon Musk Has Made Facebook and Zuckerberg Cool Again!",
    "Honda Elevate SUV Variants and Features Leaked Ahead of Launch in India",
    "Watch: Kerala Man Receives His Beloved Hindustan Ambassador as a Gift From His Sons",
    "From MS Dhoni To Riteish Deshmukh, Indian Celebrities Who Own Electric Vehicles",
    "Maruti Suzuki Invicto vs Toyota Innova HyCross: Price, Features, Engine Specs and More",
    "A Complete Analysis On Bajaj-Triumph Speed 400 vs Harley-Davidson X440",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Putin Will Visit Turkey in August, Says Erdogan as He Backs Ukraine's NATO Bid",
    "World Daily Temperature Records Smashed This Week: Here's Why?",
    "Artificial Intelligence: AI Robots at UN Think They Could Run the World Better",
    "Wimbledon 2023: 'Glad my Husband let me Hug Him', Jokes Ons Jabeur After David Beckham Meeting",
    "Lionel Messi's Arrival at Inter Miami Will Be Announced at 'The Unveil' on July 16",
    "3 Ways To Make Your Monsoon Wedding Memorable",
    "Climatic Adaptability Helped Asian Wildlife Survive Australia: Study",
    "Goa's Pitch for 'Digital Nomad Visa' Aims to Strengthen Tourism",
    "Dengue Cases On The Rise: Understand The Symptoms, Tests And Precautions",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "McDonald's 'Drops Tomatoes' from Menu Amid Price Hike: When Will Tomato Rates Go Down?",
    "Japan to Release Fukushima's Radioactive Water into Ocean, China Fumes: All You Need to Know",
    "Opinion | 9 Years of Modi Govt and 100 Years of DU: Paving the Way for ‘Amrit Peedhi’",
    "Opinion | What Life Was Like Inside Bahadur Shah Zafar’s Red Fort",
    "Opinion | Uniform Civil Code: A Major Step Towards Inclusive Growth and Larger Indian Identity",
    "Opinion | The Teesta Setalvad Files: A Sordid Saga of Forgery and Perjury",
    "Opinion | Dr Syama Prasad Mookerjee and Subhas Chandra Bose: The Icons of West Bengal",
    "West Bengal Set for High-stakes Panchayat Elections Today; Central Forces Deployed | Details",
    "'No Threat to My Post': Maharashtra CM Shinde on Ajit Pawar's Entry Into Govt",
    "PM Modi Takes Dig At Oppn Over Corruption, Says Previous Govts Made Schemes Sitting in AC Rooms",
    "Mauricio Pochettino Ready to Deliver from 'Day One' as New Era Starts for Chelsea"
]