[
    "Continue reading the main story",
    "Trump Is Told He Is Target in Classified Files Inquiry",
    "Wildfire Smoke in U.S. Prompts Cancellations and Warnings",
    "Kenny Holston/The New York Times",
    "Vincent Tullo for The New York Times",
    "David Degner for The New York Times",
    "Julian Finney/Getty Images",
    "The magazine’s Ethicist columnist discusses workplace inequities that manifest at home.5 min read",
    "David Wallace-WellsAs Smoke Darkens the Sky, the Future Becomes Clear5 min read",
    "Gail CollinsThe Republican Silly Season Has Begun4 min read",
    "Charles M. BlowYes, We’re in an L.G.B.T.Q. ‘State of Emergency’4 min read",
    "Nicholas KristofRemembering a Massacre That China Keeps Trying to Erase4 min read",
    "Linsey MarrWhat Wildfire Smoke, Gas Stoves and Covid Tell Us About Our Air4 min read",
    "Peter CoyGolf’s Antitrust Problem Just Got Bigger5 min read",
    "Sean GriffinI Know Why Disney Is Fighting DeSantis5 min read",
    "Letters From Our ReadersBiden’s Age, and His Achievements5 min read",
    "Matthew YglesiasIt’s Great to Have a President Who Knows When to Shut Up5 min read",
    "Randall KennedyThe Truth Is, Many Americans Just Don’t Want Black People to Get Ahead6 min read",
    "Thomas L. FriedmanWhat I Saw in Israel and Saudi Arabia That I Never Expected23 min read",
    "Thomas B. EdsallAs the Suburbs Go, So Goes America11 min read",
    "Jennifer AckermanWhat Owls’ Silent Flight Tells Us About the World5 min read",
    "Bret StephensAn Endgame for Ukraine4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Cliff Hawkins/Getty Images",
    "Why the N.F.L. Must Get a Handle on Its Gambling Issue",
    "10 Stories Explain Why M.L.B. Will Never Have Another Player Like Zack Greinke",
    "Analysis: If Celtics Learn a Lesson From These Playoffs, It Should Be Shame",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]