[
    "Continue reading the main story",
    "Tom Brenner for The New York Times",
    "Doug Mills/The New York Times",
    "What’s Behind the Violence",
    "Amnesty for Illegal Firearms",
    "Scripps National Spelling Bee",
    "Cycle syncing is trendy. But does it work?5 min read",
    "At this Staten Island garden, the plants are all queer.5 min read",
    "Bret StephensGo Forth and Argue11 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "Daniel BergnerThere’s a Reason So Many People Quit Antipsychotic Drugs5 min read",
    "David FrenchTo Watch a Trump Town Hall on Fox Is to Enter an Entirely Different World4 min read",
    "Josh ChafetzThe First Name of a Supreme Court Justice Is Not Justice7 min read",
    "Farhad ManjooIt’s the End of Computer Programming as We Know It. (And I Feel Fine.)5 min read",
    "Jamelle BouieThe Republican Obsession With ‘Work Requirements’ Is Telling4 min read",
    "Ross DouthatPut ‘Succession’ in the TV Pantheon9 min read",
    "Vidya KrishnanIn India’s Gang Rape Culture, All Women Are Victims5 min read",
    "David BrooksLet’s Smash the College Admissions Process4 min read",
    "Paul KrugmanThe Case of the Disappearing Debt Disaster4 min read",
    "Peter CoyHow to Fix the National Drug Shortage6 min read",
    "‘The Ezra Klein Show’Fareed Zakaria on Where Russia’s War in Ukraine Stands — and Much More",
    "Letters From Our ReadersThe Great Debt Ceiling Drama’s Finale5 min read",
    "‘Matter of Opinion’What Biden Understands About Negotiating That Obama Never Did",
    "Michael Quitugua for The New York Times",
    "Alabama Basketball Manager Says He, Not Player, Was at Deadly Shooting4 min read",
    "Georgia Officials Target Bail Fund in Crackdown on ‘Cop City’ Protests5 min read",
    "Sabalenka Skips French Open News Conference Citing Her Mental Health5 min read",
    "Human Remains Match Traits of Missing Workers in Mexico, Officials Say3 min read",
    "Man Pleads Guilty to Moving Bison Calf, Calling It an ‘Act of Compassion’3 min read",
    "Steve Garvey, Former Baseball All-Star, Explores Senate Run in California2 min read",
    "52 Places to Go in 2023This year’s list has food, culture, natural beauty and more.",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "Back in New York, Rick Pitino Is Giving St. John’s an Extreme Makeover",
    "Aaron Rodgers Details What Led to His Divorce With the Packers",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]