[
    "Job openings fell in May, a sign of continued cooling in the labor market.3 min read",
    "Listen to the full episode.",
    "Cristobal Herrera-Ulashkevich/EPA, via Shutterstock",
    "Our magazine writer on what’s lost when censors tamper with classic films.5 min read",
    "Never mind the summer heat: Earth is at its greatest distance from the sun.4 min read",
    "David FrenchThe Rage and Joy of MAGA America6 min read",
    "Frank BruniRon DeSantis and His Campaign of Contempt9 min read",
    "Clifford WinstonThe Little-Known Provision That Could Revolutionize Highway Travel4 min read",
    "Ryan HassXi Jinping May Be Souring on His ‘Best, Most Intimate Friend’4 min read",
    "Pamela PaulWhat’s the Story With Colleen Hoover?6 min read",
    "Letters From Our ReadersShould Colleges End Legacy Admissions?4 min read",
    "College Admissions Will Not Be the Same. Here’s What 7 Experts Think Should Happen.",
    "Charles M. BlowThe Supreme Court Didn’t Put Racism on a Leash. It Granted It License.4 min read",
    "The Editorial BoardAmerica Is Living on Borrowed Money4 min read",
    "Thomas B. EdsallFor Some Key Voters, Trump Has Become Toxic12 min read",
    "Anna SauerbreyGermany Is Learning a Hard Lesson5 min read",
    "David PomerantzGuess Who’s Been Paying to Block Green Energy. You Have.4 min read",
    "Jessica GrosePro-Vaccine Views Are Winning. Don’t Fear the Skeptics.5 min read",
    "Dakota Santiago for The New York Times",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]