[
    "Continue reading the main story",
    "TRUMP INDICTED IN DOCUMENTS CASE",
    "Doug Mills/The New York Times",
    "These are some of the charges Mr. Trump faces.3 min read",
    "Here’s how indictments work in the United States’ legal system.2 min read",
    "Mr. Trump faces other investigations. Here’s where they stand.5 min read",
    "Republicans in Congress are denouncing the indictment, vowing retaliation.",
    "Who is Jack Smith, the special counsel behind the indictment?4 min read",
    "The Supreme Court ruling on voting rights could resound across the South.4 min read",
    "Patrick Semansky/Associated Press",
    "What’s the Air Quality Index?",
    "See Our Maps of Air Quality and Smoke ›",
    "Tyler Hicks/The New York Times",
    "David FrenchGiven What We Know, Not Charging Trump Would Be the Greater Scandal6 min read",
    "David BrooksThis Is Not the Time for a Third Presidential Candidate4 min read",
    "Richard L. HasenJohn Roberts Throws a Curveball6 min read",
    "Michelle GoldbergI Loved Watching Chris Christie Tear Into Trump. That’s a Problem.6 min read",
    "Frank BruniCasey DeSantis Is Your Obsession. Jill Biden Is Mine.9 min read",
    "Paul KrugmanOrange Skies, Red Alerts and the Future4 min read",
    "Clare FrankWe Suffer Too Many Fools Who Start Wildfires5 min read",
    "Letters From Our ReadersEerie Days: Smoke and Haze, All Around5 min read",
    "Charles KomanoffThere’s Only One Way to Fix New York’s Traffic Gridlock6 min read",
    "The Editorial BoardNew York Lawmakers Try to Sabotage Campaign Reform4 min read",
    "Timothy DeneviA Decades-Old Joan Didion Mystery Solved10 min read",
    "Christopher CaldwellTrump’s Justices Didn’t Doom Affirmative Action. Demography Did.5 min read",
    "Gail CollinsThe Republican Silly Season Has Begun4 min read",
    "Charles M. BlowYes, This Is an L.G.B.T.Q. ‘State of Emergency’4 min read",
    "WirecutterThese mosquito-thwarting gadgets have been Wirecutter favorites for five years.",
    "Lionel Messi, Soccer’s Most Coveted Free Agent, Picks Miami",
    "Want a Class in Leadership Styles? Look to the N.B.A. Finals.",
    "海外华人札记 | 武汉跳楼母亲悲剧：网暴之恶背后的匿名狂欢Read our Chinese-language Newsletter.1 min read",
    "Ramon Espinosa/Associated Press",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Inside the PGA Players’ Fiery Response to the LIV Golf Merger",
    "A Broadcaster Opened Up About Eating Disorders on Air. The Clip Went Viral.",
    "A Pitcher’s Tweets Create a Pride Month Problem for the Red Sox",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]