[
    "Continue reading the main story",
    "Here are the likely next steps in the documents case.4 min read",
    "Doug Mills/The New York Times",
    "A grim Donald Trump, president no longer, was humbled in the courtroom.4 min read",
    "Haiyun Jiang for The New York Times",
    "Here’s what to know about Ukraine’s counteroffensive against Russia.3 min read",
    "Richard A. Brooks/Agence France-Presse — Getty Images",
    "Ariana Drehsler for The New York Times",
    "At Wylie Dufresne’s new pizzeria, the best menu item may be a salad, Pete Wells writes.5 min read",
    "A study on fruit flies showed they age faster after witnessing death.3 min read",
    "Thomas L. FriedmanHow Trump Keeps Getting Away With It5 min read",
    "Bret StephensLock Him Up4 min read",
    "Michelle CottlePresident Don Jr.?5 min read",
    "Thomas B. EdsallIf Democrats Win Back the House, They Will Have John Roberts to Thank11 min read",
    "Jesse WegmanTwo Utterly Absurd Defenses of Donald Trump6 min read",
    "Ross DouthatEvery Trump Indictment Tells a Story4 min read",
    "Deborah PearlsteinThe Genius of Leaving Trump’s Fate Up to 12 Ordinary Floridians5 min read",
    "Jamelle BouieRepublicans Have Made Their Choice4 min read",
    "David French‘Shiny Happy People,’ Fundamentalism and the Toxic Quest for Certainty6 min read",
    "Michelle CottleJust When You Thought There Was Nothing New to Learn About Donald Trump",
    "Letters From Our ReadersSaving the Flailing Humanities5 min read",
    "‘The Ezra Klein Show’What We Learned Reading Ron DeSantis’s Books",
    "‘He Has Nothing Else’: Our Writers on Trump and the 2024 Election8 min read",
    "Listen to the full episode.",
    "Chang W. Lee/The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Is Miami Ready for ‘Football God’ Lionel Messi?",
    "Meet the Teenagers Crafting the Future of Formula 1",
    "Rory McIlroy Was the Face of the PGA Tour’s ‘War’ on LIV. Now What?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]