[
    "Continue reading the main story",
    "Analysis: This is what “productive” looks like in Washington as a deadline approaches.4 min read",
    "Doug Mills/The New York Times",
    "The Headlines\nAudio\nListen to “The Headlines,” a new way to experience The Times.\n9 min listen",
    "Haiyun Jiang/The New York Times",
    "Listen to the full episode.",
    "Martin Scorsese, Leonardo DiCaprio and Robert De Niro discuss their new film.5 min read",
    "Can you cure constipation without laxatives?4 min read",
    "Frank BruniThe DeSantis Delusion6 min read",
    "Rich LowryHe’s Not Dead Yet6 min read",
    "Roger LowensteinThe Way Out of the Debt Crisis Could Lead Back Through the Civil War5 min read",
    "Ross DouthatWhat Has Trump Cost American Christianity?6 min read",
    "Paul KrugmanThe Good News on Unemployment for Black Americans4 min read",
    "Farhad ManjooA.I. Photoshopping Is About to Get Very Easy. Maybe Too Easy.6 min read",
    "Jamelle BouieNeil Gorsuch Has Given Himself Away4 min read",
    "Katherine MillerThere’s Another Businessman  Who Wants to Run America6 min read",
    "‘A Tim Scott Nomination Would Be a Nightmare for Joe Biden’7 min read",
    "Chouwa LiangMy A.I. Lover Gets Me",
    "‘The Ezra Klein Show’Our Obsession With Wellness Is Hurting Teens — and Adults",
    "Scott J. ShapiroThis Is Why I Teach My Law Students How to Hack5 min read",
    "Letters From Our ReadersCan Kids Recover From Covid Learning Losses?5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Andrew D. Bernstein/NBAE via Getty Images",
    "The Most Scrutinized Shirt in Soccer",
    "One Shot Showcases the Inexplicable Greatness of Nikola Jokic",
    "The Record-Setting Slugger Likely to Be the No. 1 M.L.B. Draft Pick",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]