[
    "Continue reading the main story",
    "Kenny Holston/The New York Times",
    "Ukraine is on the attack in the south, in what Russia is calling a counteroffensive.3 min read",
    "CNN will be managed on an interim basis by a group of executives. Here’s who they are.3 min read",
    "Pence Delivers Strong Rebuke to Trump in Campaign Announcement",
    "Chris Christie Announces ’24 Run, Taking Square Aim at Trump",
    "Listen to the full episode.",
    "Want to chat with Benjamin Franklin or Winnie-the-Pooh? There’s a new bot for that.3 min read",
    "Sophie Park for The New York Times",
    "Drone video showed a critically endangered porpoise still hanging on in Mexico.3 min read",
    "What can I do about my daughter’s father showing up drunk?4 min read",
    "Gail CollinsThe Republican Silly Season Has Begun4 min read",
    "Charles M. BlowYes, This Is an L.G.B.T.Q. ‘State of Emergency’4 min read",
    "The Editorial BoardNew York Lawmakers Are Taking a Good Idea and Turning It Upside Down4 min read",
    "Nicholas KristofRemembering a Massacre That China Keeps Trying to Erase4 min read",
    "Christopher CaldwellTrump’s Justices Didn’t Doom Affirmative Action. Demography Did.5 min read",
    "David Wallace-WellsAs Smoke Darkens the Sky, the Future Becomes Clear5 min read",
    "Charles KomanoffThere’s Only One Way to Fix New York’s Traffic Gridlock6 min read",
    "Linsey MarrWhat Wildfire Smoke, Gas Stoves and Covid Tell Us About Our Air4 min read",
    "Peter CoyGolf’s Antitrust Problem Just Got Bigger5 min read",
    "Letters From Our ReadersBiden’s Age, and His Achievements5 min read",
    "Matthew YglesiasIt’s Great to Have a President Who Knows When to Shut Up5 min read",
    "10 Movies That Capture New YorkHere are some memorable cinematic depictions of the city.4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Cliff Hawkins/Getty Images",
    "Denver’s Stars Refused to be Stopped. They Made N.B.A. History in the Process.",
    "With Jim Boeheim Retired, Can Zone Defense Still Work in College Basketball?",
    "How Real Madrid’s Blockbuster New Signing Impacts the Rest of Soccer",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]