[
    "Continue reading the main story",
    "Scott Rossi for The New York Times",
    "Here’s how parents can help teenagers navigate social media.6 min read",
    "Pool photo by Ludovic Marin; Sophie Park for The New York Times",
    "Ukraine finally got the keys to American-made F-16 fighter jets. Now come the lessons.4 min read",
    "A.I. might help gamers design their next characters.6 min read",
    "Here’s how to light an outdoor space without infuriating your neighbors.5 min read",
    "Jamelle BouieNeil Gorsuch Has Given Himself Away4 min read",
    "Paul KrugmanWorking From Home and Realizing What Matters4 min read",
    "‘A Tim Scott Nomination Would Be a Nightmare for Joe Biden’7 min read",
    "Katherine MillerThere’s Another Businessman  Who Wants to Run America6 min read",
    "Chouwa LiangMy A.I. Lover Gets MeChouwa Liang",
    "‘The Ezra Klein Show’Our Obsession With Wellness Is Hurting Teens — and Adults",
    "Scott J. ShapiroThis Is Why I Teach My Law Students How to Hack5 min read",
    "David BrooksTim Keller Was a Guide to a Wonder-Filled Life4 min read",
    "Letters From Our ReadersCan Kids Recover From Covid Learning Losses?5 min read",
    "Sapna CheryanThe Most Common Graduation Advice Tends to Backfire4 min read",
    "Gail Collins and Bret StephensThe Republican Presidential Plot Is Thickening6 min read",
    "Peter CoyThe Welfare Debate Stalling the Debt Talks5 min read",
    "Ezra KleinBiden’s Emergency Debt Ceiling Plan Wouldn’t Work4 min read",
    "Dustin Franz for The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Andrew D. Bernstein/NBAE via Getty Images",
    "Will the N.F.L. Approve a Flawed Bid for the Commanders to Oust Dan Snyder?",
    "One Shot Showcases the Inexplicable Greatness of Nikola Jokic",
    "Is Ryan Reynolds’s Wrexham Welcome in the U.S.? A Summer Match Will Tell.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]