[
    "Continue reading the main story",
    "Floridians would make up the jury pool for the case. Here’s what some are saying.5 min read",
    "Here is how former President Trump plans to beat his indictment on the campaign trail.7 min read",
    "U.S. lawmakers asked the White House to punish South Africa for supporting Russia.4 min read",
    "NATO members used a major air exercise to send a message to Russia.5 min read",
    "Paolo Pellegrin/Magnum Photos",
    "Cisco Swank put a pandemic-era spin on jazz-rap.4 min read",
    "See 11 summer zucchini recipes loved by Times readers.3 min read",
    "Mattia FerraresiBefore Trump, There Was Berlusconi4 min read",
    "‘He Has Nothing Else’: Our Writers on Trump and the 2024 Election8 min read",
    "Gail Collins and Bret StephensSpeaking of Forest Fires, Let’s Talk About Trump6 min read",
    "Erwin ChemerinskyTime Is Running Out for John Roberts and the Supreme Court4 min read",
    "David FirestoneRon DeSantis Finds a New Set of Laws to Ignore6 min read",
    "Anjanette DelgadoWhat the Women of the World’s Oldest Colony Know About Violence5 min read",
    "Peter CoyThe Woman in Charge of Saving Turkey’s Economy5 min read",
    "Margaret RenklTo Enter This Place Alone Is to Take a Risk5 min read",
    "Robert B. Semple Jr.America Has a Chance to Make Farmers Climate Heroes5 min read",
    "Letters From Our ReadersThe Trump Case and the Bathroom Files4 min read",
    "Ezra KleinDeSantis Thinks Trump Didn’t Go Far Enough5 min read",
    "The Editorial BoardTrump Should Never Again Be Trusted With the Nation’s Secrets5 min read",
    "Maureen DowdBathroom Reading at Mar-a-Lago4 min read",
    "Tanya GoldHarry Is a More Interesting Prince Than We Deserved3 min read",
    "Oona A. HathawayThe Company Trump Keeps in Violation of the Espionage Act7 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Christian Petersen/Getty Images",
    "Could the Denver Nuggets Be the Next N.B.A. Dynasty?",
    "Oakland A’s Fans to Take Last Stand Against Relocation With Reverse Boycott",
    "A Tradition Has Fans ‘Armed’ With Plastic Rats at the Stanley Cup Final",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]