[
    "Continue reading the main story",
    "Roman Romokhov/Agence France-Presse — Getty Images",
    "G.O.P. Candidates on Climate Change",
    "Doug Mills/The New York Times",
    "Why Hunter, Britain’s best known rain boot, fell from grace.4 min read",
    "Here’s how to spend a weekend in Bath, England, where Jane Austen novels come alive.",
    "J. Michael LuttigIt’s Time for a Reckoning With Donald Trump4 min read",
    "David FrenchThe Legal Foundation of Women’s Sports Is Under Fire6 min read",
    "Lydia PolgreenMilitias Are Rampaging Through West Darfur, Killing With Impunity8 min read",
    "Richard MorganI’m Here, I’m Queer, and I Came Out in the Name of Truth5 min read",
    "Mark OppenheimerThe Pittsburgh Gunman Didn’t Just Kill 11 Jews. He Killed a Minyan.4 min read",
    "Tish Harrison WarrenCan Everyone Take a Sabbatical?6 min read",
    "17 Columnists Pick the One TV Show, Movie, Book or Song That Explains America",
    "Nicholas KristofThe Real Lesson From the Hunter Biden Saga4 min read",
    "Letters From Our ReadersAre Biofuels Bad for the Environment?5 min read",
    "Charles M. BlowComing Out Late — and Finding a New Life in Midlife10 min read",
    "Farhad ManjooHow ‘South Park’ Explains America3 min read",
    "David BrooksHow ‘Dark Was the Night, Cold Was the Ground’ Explains America1 min read",
    "Mikhail ZygarHow the War in Ukraine Created a Dangerous Competitor to Putin’s Power6 min read",
    "Ross DouthatGo Ahead. Debate Robert F. Kennedy Jr.4 min read",
    "Chris VognarI Thought No One Had Felt Grief Like Mine. Then I Saw ‘The Bear.’5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "FRANCK FIFE/AFP via Getty Images",
    "Inside an M.L.B. Player’s Pursuit of a .400 Batting Average",
    "How an N.H.L. Prospect’s Family Optimized His Potential ‘48 Eggs at a Time’",
    "Only One M.L.B. Team Doesn’t Host Pride Night. That’s Unlikely to Change.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]