[
    "Continue reading the main story",
    "Caroline Yang for The New York Times",
    "Where Documents Were Found",
    "See how Republicans have reacted to Donald Trump’s federal indictment.3 min read",
    "Pentagon Papers Role Revealed",
    "Revisiting the Pentagon Papers",
    "Supreme Court’s 1971 Decision",
    "OpinionMonths before his death, Daniel Ellsberg spoke with Times Opinion about his life’s work.",
    "Donal F. Holway/The New York Times",
    "Pavel Bednyakov/RIA Novosti, via Agence France-Presse — Getty Images",
    "Tampa’s “Litter Skimmer” trash boat is tackling a growing problem.3 min read",
    "This siloed storyteller living in Venice Beach is fashion’s reluctant it boy.9 min read",
    "Michelle GoldbergCreeping Shariah Has Nothing on the Woke Mob4 min read",
    "Trent Davis BaileyWhat a Motherless Son Knows About FatherhoodTrent Davis Bailey",
    "Tiya MilesJuneteenth Is Different Out West7 min read",
    "Stephen WertheimThe Danger of Dismissing the West’s Role in Ukraine’s War5 min read",
    "Kate PickertIs a Revolution in Cancer Treatment Within Reach?13 min read",
    "Ross DouthatThis C.S. Lewis Novel Helps Explain the Weirdness of 20236 min read",
    "‘The Ezra Klein Show’Why Do So Few Democrats Want Biden to Run in 2024?",
    "Paul KrugmanWonking Out: Core Inflation Has Gone Rotten4 min read",
    "David BrooksI Won’t Let Donald Trump Invade My Brain4 min read",
    "Nick AkermanDon’t Automatically Write Off the Judge in the Trump Documents Case5 min read",
    "Frank BruniThe Brotherhood of the Philandering Oligarchs9 min read",
    "24 Works of Fiction to Read This Summer",
    "14 Nonfiction Books to Read This Summer",
    "PodcastListen to ‘Hard Fork’Social platforms are entering a strange and uncertain future.",
    "Alone TogetherThese four picture books pay tribute to children who seek some solitude.3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "U.S. Women’s Soccer Captain Will Miss the 2023 World Cup",
    "In a Moment that Called for Grace, Rob Manfred Opted for Sarcasm",
    "U.S. vs. Mexico Soccer Game Halted After Homophobic Chanting",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]