[
    "A major lender abroad, China is facing a debt bomb at home. Here’s why.5 min read",
    "One reason the U.S. can’t quit China? Chips.4 min read",
    "Pool photo by Mark Schiefelbein",
    "Prigozhin’s 36-Hour Rebellion",
    "On the war’s 500th day, a Russian strike killed eight people in Ukraine.4 min read",
    "Here’s what to know about college admissions now that affirmative action is gone.3 min read",
    "Gov. Ron DeSantis unleashed his humanizer-in-chief: His wife, Casey DeSantis.4 min read",
    "Jordan Gale for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "This American Life\nAudio\nListen to This American Life: Americans in Paris\n58 min listen",
    "You can still get that vacation feeling while taking a staycation. Here’s how.4 min read",
    "Going on a trip you can’t afford? These strategies can help control the cost.6 min read",
    "Kate ShawHas the Supreme Court Gone Overboard in How It Favors Religion?6 min read",
    "Maureen DowdIt’s Seven Grandkids, Mr. President4 min read",
    "Jeff GoodellLife Under the Heat Dome, a Glimpse of the Future5 min read",
    "Peter CoyThe Avoidable Mistake of a UPS Strike6 min read",
    "David MackGot a Flight? Don’t Even Think About Checking a Bag.4 min read",
    "‘The Ezra Klein Show’The I.R.A. Passed a Year Ago. Here’s a Progress Check.",
    "Paul KrugmanDe-Dollarization Debunked4 min read",
    "Frank LehmanHave We Been Listening to Movies the Wrong Way?",
    "Letters From Our ReadersThe Power of Community, Religious and Secular5 min read",
    "Letters From Our ReadersCan the Republican Party Reverse Course?4 min read",
    "Jamelle BouieNo One Can Stop Talking About Justice John Marshall Harlan6 min read",
    "Shamus KhanLegacy Admissions Don’t Work the Way You Think They Do4 min read",
    "Bayan AbubakrSudanese People Want Democracy. The World Has Never Listened.5 min read",
    "How Would You Score America’s Progress on Race? We Asked 10 Black Americans.",
    "Gabe Stone ShayerThe American Ballet Theater Does Not See Me as I See Myself5 min read",
    "Don’t Take It From a ‘Thinkboi’",
    "Why Is Apple Getting ‘Spatial’?",
    "NewsletterRead The MorningAs we age, our needs for sleep change, Melissa Kirsch writes.6 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]