[
    "Continue reading the main story",
    "Provision on Contentious Pipeline",
    "Understand the Debt Ceiling",
    "Doug Mills/The New York Times",
    "Alyson Aliano for The New York Times",
    "Ricardo Nagaoka for The New York Times; Barrett Emke for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "Critic’s Pick‘Spider-Man: Across the Spider-Verse’4 min read",
    "BOOK REVIEWFrom Paul Rudnick, a Mismatched Couple but Perfect for Each Other3 min read",
    "MOVIE REVIEW‘After Sherman’: A Family Reckoning2 min read",
    "BOOK REVIEW‘The Male Gazed’: What’s the Deal With Men3 min read",
    "THE ETHICISTA reader asks if it’s wrong to bring a child into our warming world.5 min read",
    "WIRECUTTERThese Father’s Day gifts will surprise, delight and make your dad’s life better.",
    "The Editorial BoardTexas Is Silencing the Will of Millions of Voters7 min read",
    "Maureen DowdJackie on My Mind4 min read",
    "Ross DouthatKevin McCarthy Has a Rare Quality for a Republican House Speaker4 min read",
    "Nicholas KristofThis May Be the Most Important Thing Happening in the World Today4 min read",
    "Sarah WildmanWhat It Means to Be a Witness Three Generations Later5 min read",
    "Beth RaymerMy Father Taught Me the Benefits of Delusion6 min read",
    "Paul KrugmanZooming and the Future of Cities5 min read",
    "Jessica Grose‘Doing the Work’ and the Obsession With Superficial Self-Improvement5 min read",
    "Lauren KelleyHow Did the End of Roe Alter Your Choices?2 min read",
    "Bret StephensGo Forth and Argue11 min read",
    "Letters From Our ReadersA High Court Held in Low Esteem4 min read",
    "‘The Ezra Klein Show’Fareed Zakaria on Where Russia’s War in Ukraine Stands — and Much More",
    "Peter CoyHow to Fix the National Drug Shortage6 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "‘Matter of Opinion’What Biden Understands About Negotiating That Obama Never Did",
    "3 Israeli Soldiers Killed in Rare Attack on Egyptian Border3 min read",
    "Vigilante Justice Rises in Haiti and Crime Plummets6 min read",
    "Judge Finds Tennessee Law Aimed at Restricting Drag Shows Unconstitutional4 min read",
    "5 Takeaways From Ron DeSantis’s First Campaign Trip6 min read",
    "A Weakened Arlene Could Bring Heavy Rain to South Florida3 min read",
    "Redd Holt, Drummer on ’60s Instrumental Pop Hits, Dies at 914 min read",
    "30 Shows to Watch This SummerHighlights include “Black Mirror” and “Reservation Dogs.”7 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Patrick McDermott/Getty Images",
    "Can Congress Help the N.C.A.A. Bring Order to the Wild Wild West of N.I.L.?",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "Syracuse Was a College Football Power. Are Those Days Gone Forever?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]