[
    "Continue reading the main story",
    "Abe McNatt/Naval Special Warfare Command",
    "4 More Convicted of Sedition",
    "Oath Keepers’ Role in Jan. 6",
    "U.S. Debt Ceiling Standoff",
    "When Would the U.S. Default?",
    "U.S. military spending has become a major dispute in the debt-limit talks.4 min read",
    "Kenny Holston/The New York Times",
    "Lynne Sladky/Associated Press",
    "Still Processing: We, Tina",
    "Here’s how to speed through airport security lines.3 min read",
    "With airfares high, flexibility is key to saving money.3 min read",
    "Michelle GoldbergRon DeSantis vs. the ‘Woke Mind Virus’4 min read",
    "The Editorial BoardWho Can Rein In the Supreme Court?6 min read",
    "David FrenchWill DeSantis Destroy Conservatism as We Know It?7 min read",
    "Pamela PaulThis 1991 Book Was Stunningly Prescient About Affirmative Action5 min read",
    "Molly WorthenWhy Universities Should Be More Like Monasteries10 min read",
    "Letters From Our ReadersFighting the Book Bans: What We Can Do4 min read",
    "Dan MurphyLike It or Not, America Needs Chinese Scientists4 min read",
    "Linda GibbsNew York’s ‘Right to Shelter’ Must Change. The Alternative Is Los Angeles.5 min read",
    "Gail CollinsNo Time Like the Present, Senator Feinstein4 min read",
    "Charles M. BlowUnprepared Republican Presidential Candidates Are Flooding Into the Race4 min read",
    "Nicholas KristofOn the Front Line of an Education Revolution5 min read",
    "David Wallace-WellsAmerica’s ‘Neoliberal’ Consensus Might Finally Be Dead6 min read",
    "Frank BruniThe DeSantis Delusion6 min read",
    "M.L.B.’s New Rules Have Baseball in Overdrive",
    "The 2026 Winter Olympics Are Looking Beyond the Horizon",
    "Kevin Mohatt, Meredith Heuer and Mark Abramson for The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Jevone Moore/Icon Sportswire, via Getty Images",
    "Several N.B.A. Teams Are Stuck. This Summer Could Bring a Flurry of Moves.",
    "His Job Is Pulling Fighter Jets. His Obsession Is Catching Yankees Home Runs.",
    "Can Virginia Basketball Survive and Thrive in a New Era of College Sports?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]