[
    "Continue reading the main story",
    "Michael A. McCoy for The New York Times",
    "At least four people are dead in a strike that hit an apartment building in Lviv, Ukraine.",
    "Ukraine attacked a Russian-occupied city, igniting a huge blast.3 min read",
    "Henrietta Wildsmith/The Times / USA TODAY NETWORK",
    "Jeenah Moon for The New York Times",
    "Sarah Blesener for The New York Times",
    "How Amazon taught Alexa to speak in an Irish brogue.5 min read",
    "A reader asks: Why do mosquitoes like me so much? There are two main factors at play.3 min read",
    "Charles M. BlowThe Supreme Court Didn’t Put Racism on a Leash. It Granted It License.4 min read",
    "The Editorial BoardAmerica Is Living on Borrowed Money4 min read",
    "Anna SauerbreyGermany Is Learning a Hard Lesson5 min read",
    "Thomas B. EdsallFor Some Key Voters, Trump Has Become Toxic12 min read",
    "David PomerantzGuess Who’s Been Paying to Block Green Energy. You Have.4 min read",
    "Jessica GrosePro-Vaccine Views Are Winning. Don’t Fear the Skeptics.5 min read",
    "Letters From Our ReadersTransgender Athletes in Women’s Sports5 min read",
    "Paul KrugmanBiden Versus the Bad News Bros3 min read",
    "John McWhorterWhat My Experience in Academia Has Taught Me About Affirmative Action7 min read",
    "William D. CohanNo One Can Stop Rupert Murdoch. That’s Increasingly a Problem.5 min read",
    "Colin P. ClarkePutin Created a Beast, and Now He Has No Idea How to Rein It In4 min read",
    "Christine HennebergThe Story of Abortion Is the Story of One in Four Women4 min read",
    "Anthony FauciOn Larry Kramer and Loving Difficult People4 min read",
    "Was the Supreme Court Right to Block Biden’s Student Loan Forgiveness Plan?5 min read",
    "Jamelle BouieAmerica Had More Than One Founding and More Than One Set of Founders4 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]