[
    "The Pentagon said an accounting mistake has freed up $3 billion more for Ukraine.4 min read",
    "Continue reading the main story",
    "Haven’t checked Gmail in a while? Google may delete your account.2 min read",
    "North America got the 2026 World Cup. Which city will get the final?3 min read",
    "Miki Katoni‘The Kids Don’t Even Know That They’re in Conversion Therapy’",
    "David FrenchI Just Arrived in Kyiv. The Ukrainian Valor Is Breathtaking.6 min read",
    "Naomi CohenWhy Didn’t Turkey’s Earthquake Hurt Erdogan in the Presidential Election?4 min read",
    "Pamela PaulThe Decade That Cannot Be Deleted4 min readAlamy Photo",
    "Randall D. EliasonWhy the Supreme Court Is Blind to Its Own Corruption5 min read",
    "Kevin F. BoehnkeWhat an Utterly Pointless Drug Test3 min read",
    "Jennifer LindJapan Can’t Pass the Buck Anymore5 min read",
    "Letters From Our ReadersA Generation of Women Named for Connie Chung5 min read",
    "Gail CollinsRemember When Trump and DeSantis Loved Each Other? Neither Do They.4 min read",
    "David Wallace-WellsThere’s No Escape From Wildfire Smoke5 min read",
    "Peter CoyWhat Americans Don’t Understand About China5 min read",
    "Elise LoehnenThe Lies Mothers Tell Themselves and Their Children6 min read",
    "Why Is an M.V.P. Outfielder Playing Shortstop?So far, so good for Mookie Betts.6 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Inside a Broadcaster’s Secret Campaign to Become an N.H.L. Team President",
    "Blue Jays Pitcher Admits He Was Tipping Pitches Against Aaron Judge",
    "Is a Las Vegas Move Really What M.L.B. Should Want for the A’s?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]