[
    "Continue reading the main story",
    "The Texas attorney general is the first statewide officeholder to be impeached in over a century.",
    "Mike Osborne for The New York Times",
    "Kyiv repelled its “largest ever drone attack” from Russia overnight.4 min read",
    "Did you follow the news this week? Take our quiz.",
    "‘Sanctuary’ Review: Who’s the Boss?2 min read",
    "‘Master Gardener’ Review: Paul Schrader’s Solitary Man4 min read",
    "The ‘Doughnut Dollies’ of World War II5 min read",
    "Book Review: A Look at the Supreme Court’s ‘Shadow Docket’5 min read",
    "These 15 side dishes will steal the show at your next barbecue.7 min read",
    "401(k) administrators are seeing an uptick in hardship withdrawals.6 min read",
    "Maureen DowdDon’t Kill ‘Frankenstein’ With Real Frankensteins at Large4 min read",
    "Nicholas KristofWhen Your Sexuality Is Against the Law4 min read",
    "Ross DouthatHow Twitter Shrank Elon Musk and Ron DeSantis4 min read",
    "Ilan StavansThe Newest Immigrants Will Change American Spanish. That’s a Good Thing.4 min read",
    "Molly WorthenWhy Universities Should Be More Like Monasteries10 min read",
    "Paul RudnickWhat Would Happen if a Robot Tried to Write ‘Law & Order’?3 min read",
    "Roger RosenblattI Won a Prize. So What?4 min read",
    "Jamelle BouieTrump Must Be Pleased With the Way the Republican Race Is Shaping Up4 min read",
    "Letters From Our ReadersApplying D.E.I. to Science4 min read",
    "Theresa RebeckWhy TV Finales Matter (And Why They Are So Hard to Get Right)4 min read",
    "Eleni SchirmerThe Case of Six Lawyers Versus Tens of Millions of Struggling Americans6 min read",
    "Dan MurphyClosing the Door on Chinese Academics Weakens America4 min read",
    "Dara LindThe U.S. Keeps Telling People to Come the ‘Right Way.’ They’re Listening.5 min read",
    "Ross DouthatMy Fantasy Bookshelf5 min read",
    "Bret StephensThe ‘Last Jews’ Board a Plane From Ethiopia to Israel10 min read",
    "Higher Food Prices Bring Bigger Profits, but Consumers Start to Resist",
    "Inflation Inched Higher in April, Reflecting Challenge for the Fed",
    "Sergey Ponomarev for The New York Times",
    "An 11-Year-Old Boy Called 911. Police Then Shot Him.2 min read",
    "‘Anatomy of a Fall’ Wins the Palme d’Or at Cannes3 min read",
    "These Guards Brutally Beat Prisoners and Lied About It. They Weren’t Fired.10 min read",
    "Biden Administration Announces Indo-Pacific Deal, Clashing With Industry Groups3 min read",
    "Kamala Harris Is First Woman to Address Graduates at West Point Commencement3 min read",
    "Student Cannot Wear Sash of Mexican and U.S. Flags at Graduation, Judge Rules3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "A Beginner’s Guide to the Premier League’s Newest Team",
    "Why the Monaco Grand Prix Is the Epitome of Formula 1",
    "Star Women’s Golfer Is Turning Pro After Breaking Tiger Woods’ School Record",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]