[
    "Continue reading the main story",
    "Haiyun Jiang/The New York Times",
    "Turkey is holding a presidential runoff election on Sunday. Here’s what to know.5 min read",
    "Did you follow the news this week? Take our quiz.",
    "‘Sanctuary’ Review: Who’s the Boss?2 min read",
    "‘Master Gardener’ Review: Paul Schrader’s Solitary Man4 min read",
    "The ‘Doughnut Dollies’ of World War II5 min read",
    "Book Review: A Look at the Supreme Court’s ‘Shadow Docket’5 min read",
    "Want a fixer-upper with waterfront views? The U.S. is unloading lighthouses.3 min read",
    "Try these crowd-pleasing recipes for Memorial Day weekend.",
    "Maureen DowdDon’t Kill ‘Frankenstein’ With Real Frankensteins at Large4 min read",
    "Nicholas KristofTo Be Gay in a Country Where It’s Still Illegal4 min read",
    "Ross DouthatHow the Internet Shrank Musk and DeSantis4 min read",
    "Jamelle BouieTrump Must Be Pleased With the Way the Republican Race Is Shaping Up4 min read",
    "Paul RudnickWhat Would Happen if a Robot Tried to Write ‘Law & Order’?3 min readErik Carter",
    "Ilan Stavans¡Qué Vaina! What Flavor of Spanish Do You Speak?4 min read",
    "Roger RosenblattWhat’s the Point of Prizes?4 min read",
    "Theresa RebeckWhy TV Finales Matter (And Why They Are So Hard to Get Right)4 min read",
    "Eleni SchirmerThe Case of Six Lawyers Versus Tens of Millions of Struggling Americans6 min read",
    "Dan MurphyClosing the Door on Chinese Academics Weakens America4 min read",
    "Dara LindThe U.S. Keeps Telling People to Come the ‘Right Way.’ They’re Listening.5 min read",
    "Letters From Our ReadersApplying D.E.I. to Science4 min read",
    "Ross DouthatMy Fantasy Bookshelf5 min read",
    "Bret StephensThe ‘Last Jews’ Board a Plane From Ethiopia to Israel10 min read",
    "‘The Ezra Klein Show’If You’re Reading This, You’re Probably ‘WEIRD’",
    "DeSantis Steps Up Attacks on Trump, Hitting Him on Crime and Covid4 min read",
    "Flood-Battered Italian Region May See More Violent and Frequent Storms5 min read",
    "Judge Puts South Carolina Abortion Ban on Hold2 min read",
    "German Plan Would Ease Path to Citizenship, but Not Without a Fight5 min read",
    "Kenneth Anger, 96, Dies; Experimental Filmmaker Left a Pop Culture Legacy6 min read",
    "Indian Official Who Drained a Reservoir to Retrieve His Phone Is Suspended2 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Why the Monaco Grand Prix Is the Epitome of Formula 1",
    "Yankees Manager Suspended 1 Game for Accidentally Spitting in Umpire’s Face",
    "Star Women’s Golfer Is Turning Pro After Breaking Tiger Woods’ School Record",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]