[
    "Continue reading the main story",
    "Here’s what we know about the train crash in eastern India.4 min read",
    "Provision on Contentious Pipeline",
    "Understand the Debt Ceiling",
    "Alyson Aliano for The New York Times",
    "Ricardo Nagaoka for The New York Times; Barrett Emke for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "Critic’s Pick‘Spider-Man: Across the Spider-Verse’4 min read",
    "BOOK REVIEWFrom Paul Rudnick, a Mismatched Couple but Perfect for Each Other3 min read",
    "MOVIE REVIEW‘After Sherman’: A Family Reckoning2 min read",
    "BOOK REVIEW‘The Male Gazed’: What’s the Deal With Men3 min read",
    "United Airlines refused to offer a refund. Then our columnist stepped in.5 min read",
    "WirecutterExperts share tips on how to clean patio furniture cushions.",
    "Bret StephensGo Forth and Argue11 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "Daniel BergnerThere’s a Reason So Many People Quit Antipsychotic Drugs5 min read",
    "David FrenchTo Watch a Trump Town Hall on Fox Is to Enter an Entirely Different World4 min read",
    "Josh ChafetzThe First Name of a Supreme Court Justice Is Not Justice7 min read",
    "Farhad ManjooIt’s the End of Computer Programming as We Know It. (And I Feel Fine.)5 min read",
    "Jamelle BouieThe Republican Obsession With ‘Work Requirements’ Is Telling4 min read",
    "Ross DouthatPut ‘Succession’ in the TV Pantheon9 min read",
    "Vidya KrishnanIn India’s Gang Rape Culture, All Women Are Victims5 min read",
    "‘The Ezra Klein Show’Fareed Zakaria on Where Russia’s War in Ukraine Stands — and Much More",
    "Peter CoyHow to Fix the National Drug Shortage6 min read",
    "Letters From Our ReadersThe Great Debt Ceiling Drama’s Finale5 min read",
    "David BrooksLet’s Smash the College Admissions Process4 min read",
    "Paul KrugmanThe Case of the Disappearing Debt Disaster4 min read",
    "‘Matter of Opinion’What Biden Understands About Negotiating That Obama Never Did",
    "A.I. Is Having a ‘Netscape Moment’",
    "Wonks ‘Socialize’ Differently",
    "Washington State Woman Is Arrested After Refusing TB Treatment3 min read",
    "Thomas Buergenthal, Holocaust Survivor and Judge, Dies at 896 min read",
    "Two More Oath Keepers Members Sentenced for Sedition in Jan. 6 Case3 min read",
    "Haitian Businessman Gets Life Sentence in Assassination of Haiti’s President3 min read",
    "Churchill Downs to Cease Racing as It Investigates Deaths of Horses3 min read",
    "Human Remains Match Traits of Missing Workers in Mexico, Officials Say3 min read",
    ".52 Places to Go in 2023This year’s list has food, culture, natural beauty and more.",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Why England’s National Soccer Stadium Is So Unloved",
    "Aaron Rodgers Details What Led to His Divorce With the Packers",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]