[
    "Continue reading the main story",
    "Justice Samuel Alito’s reply in The Wall Street Journal took ProPublica by surprise.2 min read",
    "Erin Schaff/The New York Times",
    "What Is OceanGate Expeditions?",
    "Some people on drugs like Ozempic say their mental “food noise” has disappeared.4 min read",
    "Is your plant sick? Here’s how to get a diagnosis.6 min read",
    "Zeynep TufekciThe Government Must Say What It Knows About Covid’s Origins5 min read",
    "Tressie McMillan CottomRodeo is Turning America’s Whitest Big City Black7 min read",
    "Katherine MillerThe Bargain You Make Living in America May No Longer Hold5 min read",
    "Jessica GroseThe Largest and Fastest Religious Shift in America Is Well Underway6 min read",
    "Frank BruniChris Christie Is Doing Something Very, Very Important9 min read",
    "Nicholas KristofI Took a Trip to Find Out the Truth About Education and Poverty. It’s Complicated.",
    "17 Columnists Pick the One TV Show, Movie, Book or Song That Explains America",
    "David CyranoskiHow a Scientific Fraud Reinvented Himself6 min read",
    "Peter CoyR.I.P., the Sun Triangle4 min read",
    "Nanna Bonde ThylstrupThe World’s Digital Memory Is at Risk6 min read",
    "Letters From Our ReadersHunter Biden’s Plea Deal and Donald Trump’s Defense4 min read",
    "Bret StephensTake Bobby Kennedy Jr. Seriously, Not Literally4 min read",
    "Paul KrugmanIs Taylor Swift Underpaid?5 min read",
    "Adam MastroianniYour Brain Has Tricked You Into Thinking Everything Is Worse4 min read",
    "Matthew WaltherThe Only Show I Watch Is About So Much More Than Sports6 min read",
    "Here are some more recent favorites:",
    "What’s in Our Queue? Iyla and More",
    "What’s in Our Queue? Jorge Ben and More",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "FRANCK FIFE/AFP via Getty Images",
    "Analysis: Finally, the Goaltenders Get Their Due in the Hockey Hall of Fame",
    "The N.F.L. Team Making an Unprecedented Gamble at Quarterback",
    "Only One M.L.B. Team Doesn’t Host Pride Night. That’s Unlikely to Change.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]