[
    "Continue reading the main story",
    "Haiyun Jiang/The New York Times",
    "If debt ceiling talks fail, this is how a default could unfold.6 min read",
    "Leader Sentenced to 18 Years",
    "Oath Keepers’ Role in Jan. 6",
    "Here’s how the crime of seditious conspiracy is different from insurrection and treason.3 min read",
    "Alberta Election Tests Conservatives’ Hard-Right Turn5 min read",
    "Colleges Will Be Able to Hide a Student’s Race on Admissions Applications4 min read",
    "Awkward Silence: Ron DeSantis’s Bold Twitter Gambit That Flopped",
    "DeSantis Plows Ahead With Whirlwind of Friendly Interviews and a Tour",
    "This publisher is using machine learning to breathe new life into old books.3 min read",
    "Los Angeles’s bus stops need shade. Instead, they got La Sombrita.4 min read",
    "Bret StephensThe ‘Last Jews’ Board a Plane From Ethiopia to Israel10 min read",
    "Theresa RebeckThe ‘Succession’ Finale Is Almost Here. Will They Get It Right?4 min read",
    "Dan MurphyLike It or Not, America Needs Chinese Scientists4 min read",
    "Jamelle BouieThe Real Threat to Freedom Is Coming From the States6 min read",
    "‘The Ezra Klein Show’If You’re Reading This, You’re Probably ‘WEIRD’",
    "Letters From Our ReadersRon DeSantis’s Entry Into the Republican Race5 min read",
    "Ross DouthatMy Fantasy Bookshelf5 min read",
    "Dara LindThe U.S. Keeps Telling People to Come the ‘Right Way.’ They’re Listening.5 min read",
    "Michelle GoldbergRon DeSantis vs. the ‘Woke Mind Virus’4 min read",
    "Paul KrugmanDebt: The Bad, the Weak and the Ugly4 min read",
    "The Editorial BoardWho Can Rein In the Supreme Court?6 min read",
    "Boyan SlatReducing Plastic Pollution in Our Oceans Is Simpler Than You Think5 min read",
    "Molly WorthenWhy Universities Should Be More Like Monasteries10 min read",
    "New York City Starts Busing Migrants North. Counties Are Fighting It.",
    "Ugly Tale of Migrants Displacing Veterans Makes Waves and Then Dissolves",
    "Super Typhoon Mawar Strengthens as It Moves Toward the Philippines2 min read",
    "Students in Belgium Hazing Death Are Sentenced to Fines and Service3 min read",
    "Ketamine Shows Promise for Hard-to-Treat Depression in New Study4 min read",
    "New York City Bans Weight Discrimination2 min read",
    "Doctor Reprimanded for Discussing Abortion for 10-Year-Old Rape Victim4 min read",
    "Mary Turner Pattiz, Rock D.J. During FM’s Heyday, Dies at 765 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Nathaniel S. Butler/NBAE, via Getty Images",
    "The A’s Move to Las Vegas Could Be Finalized Soon. A Serious Pause Is in Order.",
    "Star Women’s Golfer Is Turning Pro After Breaking Tiger Woods’ School Record",
    "The Return of Baseball’s Most Lovable Madman: ‘He’s a Fighter’",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]