[
    "Continue reading the main story",
    "The percent increase in staple food prices in the E.U. over the last year.",
    "What Are the Dangers of A.I.?",
    "How 35 Real People Use A.I.",
    "Test A.I.’s Literary Skills",
    "Jim Lo Scalzo/EPA, via Shutterstock",
    "My apartment is infested with bugs. How do I make my landlord fix it?2 min read",
    "Do home water filters work? Here’s what experts say.5 min read",
    "Brian DeeseThis Is How Far the Country Has Come Since the I.R.A. Became Law5 min read",
    "Mirjana SpoljaricTaking Sides Is a Natural Impulse. My Organization Can’t.3 min read",
    "Paul KrugmanHow the Wind Became Woke4 min read",
    "The Editorial BoardThe Debt Deal Satisfies No One. Now Pass It as Quickly as Possible.5 min read",
    "Stacy MitchellThe Real Reason Your Groceries Are Getting So Expensive6 min read",
    "Chun Su-jinWhy North Korea’s Princess Will Never Wear the Crown6 min read",
    "Jim MurphyThe Supreme Court Is Crippling Environmental Protections. Where Is Congress?4 min read",
    "Letters From Our ReadersThe Twists in the Long Debt Drama4 min read",
    "Ross BarkanTrump Will Be Tough to Beat, if 1968 Is Any Guide5 min read",
    "Kurt Andersen‘Succession’ Nailed the Unreal Way We Live Now10 min read",
    "Margaret RenklI’ve Spent 28 Years Pondering the Wild World of My Home5 min read",
    "Peter CoyThe Impossible Math of the Debt Deal’s Detractors4 min read",
    "Ezra KleinBeyond the ‘Matrix’ Theory of the Mind9 min read",
    "Adam GrantYour Most Ambivalent Relationships Are the Most Toxic5 min read",
    "Erin Schaff/The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Justin Tafoya/NCAA Photos, via Getty Images",
    "Ranking M.L.B. Teams From First to Worst, as the San Francisco Giants Rise",
    "Was a 1920 World Series Triple Play a Clue to the ‘Succession’ Finale?",
    "The Stanley Cup Final Is Set. N.H.L. Insiders Predict the Winner.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]