[
    "Continue reading the main story",
    "Read key excerpts from the affirmative action opinion and dissents.2 min read",
    "“This is not a normal court”: President Biden slammed the ruling on affirmative action.4 min read",
    "A majority of Americans say race should not be a factor in college admissions.2 min read",
    "Pool photo by Amy Beth Bennett",
    "See Our Maps of Air Quality and Smoke ›",
    "Dave Sanders for The New York Times",
    "Pool photo by Gavriil Grigorov",
    "Teen Driver Killed by Police",
    "Michel Euler/Associated Press",
    "David FrenchHarvard Undermined Itself on Affirmative Action5 min read",
    "Mikhail ZygarPutin Thinks He’s Still in Control. He’s Not.5 min readAlexey Malgavko/Reuters",
    "David BrooksWhy Biden Isn’t Getting the Credit He Deserves4 min read",
    "Jerome KarabelL.B.J. Was Right. Fairness Doesn’t Happen As Fast As We’d Like.10 min read",
    "Sara J. WinstonThis Fragile Body: Scenes From My Life With Multiple Sclerosis4 min read",
    "Thomas E. GrahamAleksandr Lukashenko Is Trying to Get Our Attention5 min read",
    "Pamela PaulDo Not Panic. It’s Just a Moral Panic.4 min read",
    "Michael E. WebberYou Should Be Getting Paid to Prevent Heat Wave Power Outages4 min read",
    "David BrooksAffirmative Action Is Dead. Campus Diversity Doesn’t Have to Be.",
    "‘Matter of Opinion’Wait, Are There Actually Aliens?",
    "Letters From Our ReadersShould Gay People Seek to Be Seen as ‘Normal’?5 min read",
    "David Wallace-WellsThe Myth of Early Pandemic Polarization9 min read",
    "Nicholas KristofThe Wannabe Putin in Saudi Arabia4 min read",
    "Thomas B. EdsallThis Is Why Trump Lies Like There’s No Tomorrow11 min read",
    "Want to run a world-record time? Follow the green lights.5 min read",
    "Goodreads can help excite readers, but it can also tank a book before it’s published.5 min read",
    "What Are Your Favorite Underrated Hip-Hop Lyrics?The Times wants to hear from you.1 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]