[
    "Continue reading the main story",
    "Tyler Hicks/The New York Times",
    "Ukrainian troops’ use of patches bearing Nazi emblems risks fueling Russian propaganda.6 min read",
    "Sophie Park for The New York Times",
    "Paul KrugmanThe Eyes of the World Are Upon Ukraine4 min read",
    "Michelle Goldberg‘The Idol’ and Our Backlash Times4 min read",
    "Gail Collins and Bret StephensBlessings to You, Chris Christie7 min read",
    "Michelle CottleDonald Trump Wants to Throw America a ‘Most Spectacular’ Party4 min read",
    "Simone StolzoffPlease Don’t Call My Job a Calling4 min read",
    "Peter CoyWhat Economics and Hamlet Have in Common4 min read",
    "Betsey StevensonGuess How Much This Debt Ceiling Nonsense Is Costing Us4 min read",
    "Letters From Our ReadersReal Solutions to Reduce Plastics Pollution5 min read",
    "Richard MeyerThe Supreme Court Is Wrong About Andy Warhol5 min read",
    "Margaret RenklWhy America Desperately Needed Ted Lasso5 min read",
    "David FrenchHere’s How We Can End the War in Ukraine",
    "The Editorial BoardStates Are Silencing the Will of Millions of Voters7 min read",
    "Maia SzalavitzWhat Ozempic Reveals About Desire6 min read",
    "Bill SaporitoCould Air Travel Get Even More Miserable? Yes, and Here’s Why.5 min read",
    "Columns That Scrutinized, and Skewered, the Literary World",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Carmen Mandato/Getty Images",
    "Kyrie Irving Wants LeBron James to Join Him in Dallas. Is a Reunion Likely?",
    "Mercedes’s Finish at Spanish Grand Prix Offers Hope for Its Formula 1 Revival",
    "For Some American Athletes, Playing in Russia Is Still Worth the Risk",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]