[
    "Continue reading the main story",
    "Here are five takeaways from a rocky 2024 debut for Ron DeSantis.6 min read",
    "Pool photo by Stefani Reynolds",
    "The Florida governor’s chosen rollout venue, Twitter, was a bold gambit that flopped.4 min read",
    "What does Russia’s success in Bakhmut mean for the wider war in Ukraine?5 min read",
    "Andriy Andriyenko/Associated Press",
    "See Tina Turner’s life in photos.2 min read",
    "Clara Mokri for The New York Times",
    "Grimes invited anyone to make songs with her voice using A.I. Here are her reviews.6 min read",
    "I used a slur for accuracy when repeating a joke. Why is everyone upset?4 min read",
    "Gail CollinsNo Time Like the Present, Senator Feinstein4 min read",
    "Pamela PaulReflections on ‘Reflections of an Affirmative Action Baby’6 min read",
    "Charles M. BlowUnprepared Republican Presidential Candidates Are Flooding Into the Race4 min read",
    "Nicholas KristofOn the Front Line of an Education Revolution5 min read",
    "Linda Gibbs‘Right to Shelter’ Is Bad Policy. But New York City Needs It Right Now.5 min read",
    "Molly WorthenWhat College Students Need Is a Taste of the Monk’s Life10 min read",
    "Dan MurphyLike It or Not, America Needs Chinese Scientists4 min read",
    "Frank BruniThe DeSantis Delusion6 min read",
    "Lauren KelleyHow Did the End of Roe Alter Your Choices?2 min read",
    "Rich LowryHe’s Not Dead Yet6 min read",
    "Kate RedburnAll Americans Have the Right to Dress Exactly How They Want5 min read",
    "Peter CoyUnemployment Is Low, But So Is the National Mood4 min read",
    "Letters From Our ReadersLegalizing Weed: Was It a Harmful Mistake?5 min read",
    "The Mecca of New York Skateboarding, Back From the Dead?",
    "Why Skaters Love and Resist Skateboard Parks",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Angel Martinez/Getty Images",
    "A 46-Year-Old Club Pro Is Living a Golf Fever Dream",
    "The Speedy Serie A Striker on Manchester United’s Radar",
    "The Latest N.F.L. Rule Change Is Out of the Roger Goodell Playbook",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]