[
    "Continue reading the main story",
    "There is one big part of the debt ceiling deal that Congress isn’t talking about.",
    "The MorningThe House passed the debt ceiling bill. Who won?6 min read",
    "Sophie Park for The New York Times",
    "The Tilt NewsletterMillennials are not an exception. They’ve also moved to the right.3 min read",
    "Allison Joyce/Getty Images; Charlie Neibergall, via Associated Press",
    "Pottery workshops are filling up with people who want to connect with others.7 min read",
    "Iceland is a magnet for tourists. Its first lady has some advice for them.6 min read",
    "Carlos LozadaMen Have Lost Their Way. Josh Hawley Has Thoughts About How to Save Them.8 min read",
    "Pamela PaulPolitical Correctness Used to Be Funny. Now It’s No Joke.5 min read",
    "Jonathan MingleJoe Manchin Wanted a 303-Mile-Long Pipeline, and He’s About to Get One5 min read",
    "Andrew SchwartzCalifornia’s Snow Is Melting and It’s a Beautiful Thing4 min read",
    "Nicholas KristofMississippi Is Offering Lessons for America on Education10 min read",
    "Ron CurrieI Saw What Happened to My Father, So I’m Striking With My Fellow Writers5 min read",
    "Jean W. PapeHaiti Has Overcome Other Crises. This Time, We Can’t Do It Alone.4 min read",
    "Eric KaplanDeath Is Real. So Is Happiness. Imagine That.",
    "Jessica GroseThe Duggar Family and Reality TV’s Exploitation of Kids6 min read",
    "Ezra KleinWe May Be About to Find Out How This Republican Party Really Works6 min read",
    "Thomas B. EdsallThe Politics of Delusion Have Taken Hold12 min read",
    "Peter CoyTwo Ways of Looking at the Stock Market’s Rise4 min read",
    "Letters From Our ReadersChristian Cooper and the Birds of New York5 min read",
    "Subscribe to The Space and Astronomy Calendar",
    "Webb Telescope Finds a Star Cloaked in 3 Rings of Ruined Worlds",
    "Japanese Moon Lander Crashed Because It Was Still Three Miles Up, Not on the Ground",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Daniel Knighton/Getty Images",
    "Mike Pence Calls on M.L.B. to Apologize to ‘Catholics Across America’",
    "Lionel Messi Is Leaving Paris Saint-Germain This Summer",
    "Aaron Rodgers Details What Led to His Divorce With the Packers",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]