[
    "Continue reading the main story",
    "Doug Mills/The New York Times",
    "5 Film Adaptations to Stream",
    "“It requires genius and he had it”: Readers reflected on Cormac McCarthy and his work.4 min read",
    "Gilles Peress/Magnum Photos",
    "These national parks are welcoming stargazers this summer.3 min read",
    "Spotted lanternflies are back. You should still kill them.4 min read",
    "Gail CollinsYour Spring-Into-Summer Politics Quiz Is Here",
    "Nicholas KristofA President Governing from Behind Bars?!4 min read",
    "Deborah PearlsteinThe Genius of Leaving Trump’s Fate Up to 12 Ordinary Floridians5 min read",
    "Charles M. BlowL.G.B.T.Q. Americans Could Become a ‘New Class of Political Refugees’5 min read",
    "Jessica GroseSoon We Won’t Have Enough Kids to Fill Our Schools. That’s a Problem.6 min read",
    "Peter CoyThe Case for Ending Free Parking5 min read",
    "David Wallace-WellsEven in Texas, You Can’t Stop the Green Revolution5 min read",
    "Thomas L. FriedmanHow Trump Keeps Getting Away With It5 min read",
    "Michelle CottlePresident Don Jr.?5 min read",
    "Ross DouthatEvery Trump Indictment Tells a Story4 min read",
    "Jesse WegmanThe Impossible Task of Defending Donald Trump6 min read",
    "Thomas B. EdsallIf Democrats Win Back the House, They Will Have John Roberts to Thank11 min read",
    "Bret StephensLock Him Up4 min read",
    "Letters From Our ReadersA ‘Rubicon Moment’ for Donald Trump4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "As One N.B.A. Team Considers a Rebuild, Another Star Could Be on the Move",
    "Rory McIlroy Was the Face of the PGA Tour’s ‘War’ on LIV. Now What?",
    "A College Senior’s Quest to Find the Weirdest Baseball Fields in America",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]