[
    "Continue reading the main story",
    "Ukrainian forces claimed to destroy a Russian ammunition dump in their counteroffensive.3 min read",
    "Giorgio Viera/Agence France-Presse — Getty Images",
    "Did you follow the news this week? Take our quiz.",
    "My husband is in his 70s and won’t retire. Can I make him?6 min read",
    "An artist uses bombshells and memories in Vietnam.7 min read",
    "Ezra Klein‘What the Hell Happened to the California of the ’50s and ’60s?’7 min read",
    "David FrenchThe Supreme Court Finally Strikes the Right Balance on Voting Rights6 min read",
    "Zach GottliebTo All the Men Who Chose to Father Me5 min read",
    "Maureen DowdTo Jail or Not to Jail4 min read",
    "Suzanne Garfinkle-CrowellTaylor Swift Has Rocked My Psychiatric Practice5 min read",
    "Kate PickertIs a Revolution in Cancer Treatment Within Reach?13 min read",
    "Rachel L. SwarnsMy Church Was Part of the Slave Trade. This Has Not Shaken My Faith.5 min read",
    "Nicholas KristofIt’s Easy to Feel Righteous in the Trump Era. Liberals, Beware.4 min read",
    "Ross DouthatNo Culture for Alienated Men4 min read",
    "Alex KingsburyDaniel Ellsberg Never Ran Out of Secrets6 min read",
    "Trent Davis BaileyWhat a Motherless Son Knows About Fatherhood",
    "Esau McCaulleyMy Father Failed Me. Here’s How I Learned to Forgive Him.5 min read",
    "Tiya MilesAs Juneteenth Goes National, We Must Preserve the Local7 min read",
    "Michelle GoldbergCreeping Shariah Has Nothing on the Woke Mob4 min read",
    "Stephen WertheimThe Tale the West Tells Itself About Ukraine5 min read",
    "Here are some more recent favorites:",
    "What’s in Our Queue? Jorge Ben and More",
    "What’s in Our Queue? ChocQuibTown and More",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The M.L.B. Commissioner’s Unsurprising Shot at Athletics Fans",
    "The Grandson of a Civil Rights Icon Pursues His N.F.L. Dream",
    "Is M.L.B.’s Audience Tired of Yankees-Red Sox Primetime Matchups?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]