[
    "Here’s why President Biden reversed course on Ukraine’s F-16 request.",
    "Continue reading the main story",
    "Did you follow the news this week? Take our quiz.",
    "The Best Movies on Amazon Prime Video Right Now22 min read",
    "‘The Night of the 12th’ Review: When a Case Doesn’t Close2 min read",
    "‘The Postcard’ Review: An Autobiographical Novel of Occupied France6 min read",
    "‘Undaunted’ Review: A History of Women in Journalism6 min read",
    "Do dress sneakers belong in the Oval Office?3 min read",
    "Here’s what 40-somethings should know about breast cancer.5 min read",
    "The Editorial BoardWhy Is George Santos Still in Office?3 min read",
    "Maureen DowdClassical Crescendo4 min readMarcus Ohlsson/Trunk Archive",
    "Nicholas KristofHow to Change a Life for 50 Cents4 min read",
    "Megan K. Stack and Mike OsborneFear Is for Sale on the U.S.-Mexico Border4 min read",
    "Ross DouthatCan the Writers’ Strike Fix Hollywood?4 min read",
    "Paul KrugmanHere’s How We’ll Know the U.S. Economy Is Headed for a ‘Soft Landing’",
    "Elizabeth SpiersOn ‘Succession,’ the Rest of Us Are All Capacious Handbags5 min read",
    "Warren ZanesWhat We Can Learn From Bruce Springsteen’s Great Left Turn5 min read",
    "Peter CoyTo See One of A.I.’s Greatest Dangers, Look to the Military4 min read",
    "Letters From Our ReadersSeeking Cures for Loneliness4 min read",
    "Brad StulbergThe Case for Obligation4 min read",
    "‘The Ezra Klein Show’Why Are Teens in Crisis? Here’s What the Evidence Says.",
    "Sarah WildmanMy Daughter’s Future Was Taken From Her, and From Us8 min read",
    "Rachel ConnollyLet Me Tell You About My Friend Dan. Dan Always Buys ‘The Best.’11 min read",
    "Farhad ManjooOffice Workers Don’t Hate the Office. They Hate the Commute.5 min read",
    "Read the Guardian article.",
    "Here are some more recent favorites:",
    "What’s in Our Queue? bell hooks and More",
    "What’s in Our Queue? Liberato and More",
    "Read The MorningMelissa Kirsch on the biggest films at the Cannes Film Festival.6 min read",
    "8-Year-Old Migrant Died After a Week in U.S. Detention4 min read",
    "DeSantis Lawyers Ask Judge in Disney Case to Recuse Himself2 min read",
    "Superstar Billy Graham, Model of the Buff, Blond Wrestler, Dies at 795 min read",
    "Nebraska Votes to Restrict Abortion and Transgender Care for Minors4 min read",
    "A ‘Canadian Armageddon’ Sets Parts of Western Canada on Fire4 min read",
    "Airman in Leak Case to Remain Detained as He Awaits Trial4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Just How Bad Are the 2023 Oakland A’s? They Could Make History.",
    "College Football Is in an Arms Race. One Storied Program Is Falling Behind.",
    "An Investment App Could Revolutionize Horse Racing",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]