[
    "Continue reading the main story",
    "The Headlines\nAudio\nHundreds are killed in India train crash, and other top stories.\n10 min listen",
    "The A.I. Boom’s Wild Children",
    "Jordan Gale for The New York Times",
    "What does good psychedelic therapy look like?5 min read",
    "Teenagers can expect a strong job market this summer.5 min read",
    "Gail Collins and Bret StephensBlessings to You, Chris Christie7 min read",
    "Michelle CottleTrump’s Birthday Bash for America4 min read",
    "Betsey StevensonGuess How Much This Debt Ceiling Nonsense Is Costing Us4 min read",
    "Simone StolzoffPlease Don’t Call My Job a Calling4 min read",
    "Richard MeyerThe Supreme Court Is Wrong About Andy Warhol5 min read",
    "Margaret RenklWhy America Desperately Needed Ted Lasso5 min read",
    "David FrenchHere’s How We Can End the War in Ukraine",
    "The Editorial BoardStates Are Silencing the Will of Millions of Voters7 min read",
    "Maia SzalavitzWhat Ozempic Reveals About Desire6 min read",
    "Bill SaporitoCould Air Travel Get Even More Miserable? Yes, and Here’s Why.5 min read",
    "Mara GayThere Are Better Ways to Solve a Housing Crisis Than This5 min read",
    "Benyamin CohenEinstein and a Theory of Disinformation5 min read",
    "Sarah WildmanWhat It Means to Be a Witness Three Generations Later5 min read",
    "Letters From Our ReadersCollege Grads, Do ‘Follow Your Passions’5 min read",
    "The R.T.O. Whisperers Have a Plan",
    "Office Mandates. Pickleball. Beer. What Will Make Hybrid Work Stick?",
    "Desiree Rios/The New York Times",
    "Emmanuel Macron Faces Fresh Test as Outlook for French Finances Dims5 min read",
    "Hong Kong Court Overturns Conviction of Journalist in Rare Victory for Media3 min read",
    "Hundreds of Gannett Newsroom Employees Walk Out3 min read",
    "Roger Craig, Teacher of an Era-Defining Pitch, Is Dead at 935 min read",
    "Amsterdam Train Service Resumes After Disruption, but Problems Remain2 min read",
    "In Utah, Scriptures (and Satire) Enter Debates Over Book Bans4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Justin Tafoya/NCAA Photos, via Getty Images",
    "To Slow Down the Nuggets, the Heat Made a Surprising Lineup Change",
    "A Soccer Club Fights Through Sadness After Turkey’s Devastating Earthquakes",
    "Mercedes’ Finish at Spanish Grand Prix Offers Hope for Its Formula 1 Revival",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]