[
    "The Headlines\nAudio\nToday’s top news: the end of the “great resignation,” and more.\n10 min listen",
    "Here’s what the contentious U.S.-China relationship looks like, by the numbers.4 min read",
    "Pool photo by Mark Schiefelbein",
    "The death toll in a missile strike on Lviv in western Ukraine rose to 10.",
    "Here’s what to know if you’re considering the Alzheimer’s drug Leqembi.4 min read",
    "Hairstylists share tips on what men should know before coloring their hair.4 min read",
    "Modern loveOn the coldest continent on earth, I kissed a fellow janitor amid the trash.6 min read",
    "Paul KrugmanThe Rich Are Crazier Than You and Me4 min read",
    "Frank LehmanWhen Watching Indiana Jones, Close Your Eyes",
    "Jamelle BouieNo One Can Stop Talking About Justice John Marshall Harlan6 min read",
    "Shamus KhanLegacy Admissions Don’t Work the Way You Think They Do4 min read",
    "Gabe Stone ShayerThe American Ballet Theater Does Not See Me as I See Myself5 min read",
    "Farhad ManjooHow Would Harvard Talk About My Kids?5 min read",
    "Bayan AbubakrSudan Will Not Be Left for Dead5 min read",
    "David BrooksWhy I Still Love the New York Mets4 min read",
    "Tressie McMillan CottomThe Supreme Court Shattered the American Dream",
    "‘The Ezra Klein Show’This Taught Me a Lot About How Decarbonization Is Really Going",
    "David FrenchThe Rage and Joy of MAGA America6 min read",
    "Frank BruniRon DeSantis and His Campaign of Contempt9 min read",
    "Letters From Our ReadersShould Colleges End Legacy Admissions?4 min read",
    "Listen to the full episode.",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]