[
    "Continue reading the main story",
    "Here’s what it’s like to be a passenger inside the Titan submersible.2 min read",
    "Al Drago for The New York Times",
    "What happens if a presidential candidate is convicted of a felony?5 min read",
    "Doug Mills/The New York Times",
    "Turn Your Walk Into a Workout",
    "Daniel Berehulak/The New York Times",
    "Jeenah Moon for The New York Times",
    "We picked summer books for every kind of reader.",
    "Barbie, Spidey and more: Here are the movies to check out this season.19 min read",
    "If You Want to Understand America, Read, Watch and Listen to This",
    "Ezra KleinHow ‘Her’ Explains America",
    "David FrenchHow ‘Arrival’ Explains America",
    "Tressie McMillan CottomHow ‘Ted Lasso’ Explains America",
    "Bret StephensTake Bobby Kennedy Jr. Seriously, Not Literally4 min read",
    "Adam MastroianniYour Brain Has Tricked You Into Thinking Everything Is Worse4 min read",
    "Paul KrugmanIs Taylor Swift Underpaid?5 min read",
    "Paul BogardWe’re Watching the Sky as We Know It Disappear4 min read",
    "‘The Ezra Klein Show’What the Heck Is Going on With These U.F.O. Stories?",
    "Matthew WaltherThe Only Show I Watch Is About So Much More Than Sports6 min read",
    "Letters From Our ReadersThe Life and Courage of Daniel Ellsberg, ‘a True American Hero’5 min read",
    "Peter CoyCreating a Path for More Black Economists6 min read",
    "Anupam B. JenaThe Science of What We Eat Is Failing Us6 min read",
    "Dan SinykinCormac McCarthy Had a Remarkable Literary Career. It Could Never Happen Now.7 min read",
    "Suzanne Garfinkle-CrowellTaylor Swift Has Rocked My Psychiatric Practice5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Steph Chambers/Getty Images",
    "Who Is the Next Face of the N.B.A. as LeBron James Nears Retirement?",
    "Only One M.L.B. Team Doesn’t Host Pride Night. That’s Unlikely to Change.",
    "As Tensions Grow, Could One of the N.B.A.’s Top Young Stars Be Traded?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]