[
    "Continue reading the main story",
    "Mayor Adams Addresses Killing",
    "U.S. Debt Ceiling Standoff",
    "Understand the G.O.P. Plan",
    "Here’s how the writers’ strike of 2007 affected audiences and programming.4 min read",
    "We spoke with two of the minds behind Tears of the Kingdom, the latest Zelda game.4 min read",
    "David BrooksThe Second Phase of the Biden Presidency4 min read",
    "Zeynep TufekciThe Shockingly Lax Laboratory Standards in the U.S.8 min read",
    "Cecilia MárquezThe Long and Violent History of Anti-Black Racism in the Latino Community4 min read",
    "Luis Alberto UrreaMy Mother Returned from World War II a Changed Woman5 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Farhad ManjooTucker Carlson on Twitter Could Work Awfully Well5 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "Frank BruniTrump’s ‘Stupid,’ ‘Stupid’ Town Hall9 min read",
    "Letters From Our ReadersBullying, and Suicide, in High School5 min read",
    "Matter of OpinionWhat if We Just Paid Clarence Thomas $1 Million?",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Lulu Garcia-NavarroMillions of People Watched Her Grow Up Online. What Did It Cost Her?",
    "Jeneen InterlandiAmerica Is Forgetting the Lessons of the Covid Health Emergency5 min read",
    "Listen to ‘The Daily’President Biden has a radical option to end the debt fight.",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Kevin Durant’s Talent Blinded Everyone to the Suns’ Fatal Playoff Flaws",
    "Why Georgia Football Was Wrong for Declining the White House Invitation",
    "All Eyes Are on Shohei Ohtani, but There’s Another Free Agent Worth Watching",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]