[
    "Continue reading the main story",
    "Details are trickling out about the accord that could avert a debt default.3 min read",
    "Kenny Holston/The New York Times",
    "Kyiv repelled its “largest ever drone attack” from Russia overnight.5 min read",
    "How well do you know “Succession”? Try our quiz.",
    "Did you follow the news this week? Take our quiz.",
    "‘Still: A Michael J. Fox Movie’ Review3 min read",
    "‘You Hurt My Feelings’ Review: She Can’t Handle the Truth4 min read",
    "A Cabin in the Woods, Intermittent Wi-Fi and a Dead Landline3 min read",
    "Book Review: ‘For the Love of Mars’5 min read",
    "Hiking has all the benefits of walking and more. Here’s how to get started.4 min read",
    "Modern Love: She lost her second husband. Her pain taught her son how to grieve.6 min read",
    "Ezra KleinBeyond ‘The Matrix’ Theory of the Mind 9 min read",
    "David FrenchThe Right Is All Wrong About Masculinity6 min read",
    "Michelle CottleThe Chris Christie Scenario4 min read",
    "Kayla M. WilliamsWho Should We Honor on Memorial Day?5 min read",
    "Adam GrantYour Most Ambivalent Relationships Are the Most Toxic5 min read",
    "Theresa RebeckHow the Final Five Minutes of ‘Succession’ Could Change Everything4 min read",
    "Jassi Pannu and Jacob SwettWhat if There Was Never a Pandemic Again?4 min read",
    "Ross DouthatHow Twitter Shrank Elon Musk and Ron DeSantis4 min read",
    "Maureen DowdDon’t Kill ‘Frankenstein’ With Real Frankensteins at Large4 min read",
    "Nicholas KristofWhen Your Sexuality Is Against the Law4 min read",
    "Jamelle BouieTrump Must Be Pleased With the Way the Republican Race Is Shaping Up4 min read",
    "Ilan StavansThe Newest Immigrants Will Change American Spanish. That’s a Good Thing.4 min read",
    "Paul RudnickWhat Would Happen if a Robot Tried to Write ‘Law & Order’?3 min read",
    "Illustration by Lincoln Agnew",
    "At Least 3 Are Killed in Clashes on Iranian-Afghan Border2 min read",
    "An 11-Year-Old Boy Called 911. The Police Then Shot Him.2 min read",
    "Modi Opens India’s New Parliament Building as Opposition Boycotts4 min read",
    "Despite Hochul’s Vow, Her Policies Have Indirectly Aided Husband’s Firm7 min read",
    "Formula 1: Verstappen Rules in Monaco’s Rain3 min read",
    "Ian Hacking, Eminent Philosopher of Science and Much Else, Dies at 876 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The French Open’s Youngest Champion Still Resonates at Roland Garros",
    "How a Retired Coach Came Back to Lead the N.H.L.’s Most Surprising Team",
    "The Inside Story of Germany’s Day of Glorious Chaos",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]