[
    "Continue reading the main story",
    "Ron DeSantis, the Florida governor, is amping up his retail campaign in New Hampshire.3 min read",
    "The Editorial BoardWhy Is George Santos Still in Office?3 min read",
    "Sarah WildmanMy Daughter’s Future Was Taken From Her, and From Us8 min readKarlotta Freier",
    "Paul KrugmanHere’s How We’ll Know the U.S. Economy Is Headed for a ‘Soft Landing’",
    "Jamelle BouieThe Four Freedoms, According to Republicans5 min read",
    "Rachel ConnollyLet Me Tell You About My Friend Dan. Dan Always Buys ‘The Best.’11 min readTracy Ma",
    "Michelle GoldbergIf You Care About Book Bans, You Should Be Following This Lawsuit5 min read",
    "‘The Ezra Klein Show’Why Are Teens in Crisis? Here’s What the Evidence Says.",
    "Farhad ManjooOffice Workers Don’t Hate the Office. They Hate the Commute.5 min read",
    "Mara GayThe Wrong Way to Cut New York City’s Budget4 min read",
    "Warren ZanesThe Flaws of Perfection5 min read",
    "Ross DouthatWhy ‘Succession’ Is a Work of Fantasy6 min read",
    "Peter CoyTo See One of A.I.’s Greatest Dangers, Look to the Military4 min read",
    "Letters From Our ReadersRational Approaches to Immigration5 min read",
    "David FrenchI Just Arrived in Kyiv. The Ukrainian Valor Is Breathtaking.6 min read",
    "A University Fired 2 Employees for Including Their Pronouns in Emails5 min read",
    "These Guards Brutally Beat Prisoners and Lied About It. They Weren’t Fired.10 min read",
    "Jerome Powell Says Inflation Remains Too High3 min read",
    "Nebraska to Vote on Restrictions on Abortion and Transgender Care for Minors3 min read",
    "Jimmy Buffett, Hospitalized After Bahamas Trip, Cancels Show2 min read",
    "Police in Australia Use Stun Gun on 95-Year-Old Woman3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Mediocrity From LeBron James and Anthony Davis Has This Lakers Run in Danger",
    "Just How Bad Are the 2023 Oakland A’s? They Could Make History.",
    "Horse Racing Takes Another Hit After Contender Is Removed From Preakness",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]