[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Start of truce period brings lull in fighting to Sudan's capital",
    "Malians vote in referendum paving the way to elections",
    "Lebanon’s top Christian cleric slams failed attempt to elect a president",
    "India eases curfew in violence-hit Manipur",
    "Swiss referendum set to back global minimum corporate tax, climate goals",
    "Key ASEAN members skip Thai-hosted Myanmar talks amid criticism",
    "Heavy rains lash east Nepal; one dead, 25 missing",
    "Death toll rises from flooding after Ukraine dam breach",
    "Ukraine says it destroys ammunition depot in Kherson",
    "Evidence suggests Russia blew Kakhovka dam in Ukraine: NYT",
    "Putin rebuts key elements of African peace plan for Ukraine",
    "Blinken in China for rare trip amid frosty ties and dim hopes for progress",
    "Exclusive: Xi Jinping tells Bill Gates he welcomes U.S. AI tech in China",
    "US plays down chance of breakthrough from Blinken's China visit",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "'Terrible': UK minister sorry for COVID lockdown party video",
    "How U.C. Berkeley tried to buoy enrollment of Black students without affirmative action",
    "Trump lacked power to declassify secret nuclear arms document, experts say",
    "Reddit’s golden geese foul up its IPO plans",
    "Netanyahu seeks 'active steps' on Israel judicial overhaul this week",
    "Microsoft says early June service outages were cyberattacks",
    "Nidec to form joint venture with Brazil's Embraer to make flying car parts",
    "Elon Musk says Twitter video app for smart TVs is 'coming'",
    "Binance, SEC strike deal to keep US customer assets in country",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "McIlroy shuts out the noise to stay in U.S. Open hunt",
    "Scheffler finishes with a flourish, three back of U.S. Open lead",
    "MLB roundup: Royals erase 6-run deficit, stun Angels",
    "Verstappen on pole after wild Canadian GP qualifying",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Seoul hosts large crowds as BTS fans celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]