[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US judge temporarily blocks Microsoft acquisition of Activision",
    "Autos & Transportationcategory",
    "Toyota shareholders vote down climate resolution, back board",
    "OMV Petrom makes largest crude oil discovery in decades",
    "Bunge, Viterra will merge to form $34 billion agri-trading powerhouse",
    "Meta releases 'human-like' AI image creation model",
    "Amazon cloud services back up after big outage hits thousands of users",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "Trump pleads not guilty in federal documents case",
    "E. Jean Carroll can pursue $10 mln lawsuit against Donald Trump -judge",
    "Trump documents case: What are the charges and how can he defend against them?",
    "Trump faces difficult odds in classified documents case",
    "Blue and yellow flag, Russian dead attest to Ukrainian advance in south",
    "Russia urges 'transparent' investigation into Nord Stream blasts",
    "Putin ponders: Should Russia try to take Kyiv again?",
    "New US military aid to Ukraine pushes Washington deeper in conflict - Russia",
    "Asian shares up, dollar wobbly as US inflation data reinforces Fed pause bets",
    "Exclusive: US pushing India to seal big armed drone buy for Modi visit",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "Nigeria boat accident kills 50 people, several missing",
    "Vegas hits the jackpot, beats Florida to win Stanley Cup",
    "New Zealand national broadcaster launches review after stories altered",
    "Japan Self Defence Force member arrested after shooting, two dead - NHK",
    "Explainer: Why Japanese Prime Minister Kishida may call a snap election soon",
    "State Department amends comment on APEC invitation for Hong Kong's leader",
    "Trump's defense team still taking shape as he appears in court",
    "Trump documents case: what happens now that he pleaded not guilty?",
    "US House resumes passing bills amid Republican infighting",
    "Biden calls racism 'still too powerful' during Juneteenth concert at White House",
    "UK police arrest murder suspect after three bodies found on Nottingham streets",
    "'Goodbye President': Berlusconi fans pay tribute to late leader",
    "Kosovo PM presents plan to defuse tensions in Serb-majority area",
    "Britain's COVID-19 inquiry hears government was under-prepared",
    "Neo-Nazi groups multiply in a more conservative Brazil",
    "Human rights body finds Cuban gov't responsible in 2012 deaths of dissidents",
    "Mayor of Mexico's Tijuana moves into barracks for safety after threats",
    "Colombia ex-candidate Zuluaga violated law with funds from Odebrecht -AG",
    "Golden Knights' Marchessault named Stanley Cup playoffs MVP",
    "PGA Tour Commissioner Monahan recuperating after 'medical situation'",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Trump arraigned on federal charges in Miami",
    "Towns submerged after Ukraine dam breach",
    "'The Flash' dashes to theaters, starting the DC universe reboot",
    "Disney's Pixar seeks return of box office magic with 'Elemental'",
    "'Last' Beatles record to be released this year thanks to AI - McCartney",
    "Rare icons evacuated from Ukraine go on show in Paris' Louvre Museum",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]