[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "China's tumbling industrial profits deepens economic gloom",
    "Tesla charging technology put on fast track to become US standard",
    "Australia's consumer inflation hits 13-month low, adding to rate pause case",
    "United Airlines CEO blames FAA as storms trigger more flight cancellations",
    "Disney beats investor lawsuit over feud with DeSantis",
    "Oil ticks up as drop in US crude and gasoline stocks exceeds view",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Explore the specific ties to slavery among U.S. elite",
    "Reparations: Where slavery’s descendants stand",
    "Resources to explore your own family history",
    "US Supreme Court rejects bid to give lawmakers unchecked power over elections",
    "US Supreme Court backs man who sent female musician flood of unwanted messages",
    "Supreme Court leans toward limiting judicial scrutiny of U.S. elections",
    "Analysis: In U.S. Supreme Court elections case, politicians could win either way",
    "Asia shares hesitant, yen slide stokes intervention risk",
    "East Europe NATO allies say Wagner troops in Belarus spell trouble",
    "Court says Trump must face New York civil fraud claims, tosses case against Ivanka",
    "Exclusive: Indian firm used toxic industrial-grade ingredient in syrup - sources",
    "South Korea unveils sanctions on Russian national over North's weapons programmes",
    "Taiwan says it spots two Russian warships off its east coast",
    "Hong Kong film-makers say censorship law spooks investors, actors",
    "South Koreans become a year or two younger as traditional way of counting age scrapped",
    "Australia, NZ consider joint bid for 2029 Club World Cup",
    "Trump sues E. Jean Carroll for defamation after jury finds he sexually abused her",
    "Relentless heat wave scorches US South, air quality deteriorates over Midwest",
    "Over $200 billion potentially stolen from U.S. COVID relief programs, watchdog says",
    "Georgia election official Raffensperger to speak with Jan. 6 investigators",
    "Microsoft attempts to pick apart US legal argument against deal to buy Activision",
    "Apple fails to end lawsuit over CEO Tim Cook's China sales comment",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "US considering new restrictions on AI chip exports to China - WSJ",
    "Mexico proposes handing control of capital airport to its navy",
    "After 89 days, Colombia lowers activity alert at Nevado del Ruiz volcano",
    "Maverick Mexican politician Xochitl Galvez throws hat in ring for presidency",
    "Bedard offers Blackhawks a chance to fast-track the rebuild",
    "Carlsen, Chess.com beat Niemann's $100 million suit over cheating scandal",
    "'I'm still cool': US World Cup squad bridges generational divide",
    "WTA tweaks circuit with plans for pay parity in top events by 2027",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Coming to a US city near you: An 825-pound Alex Morgan statue",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Lewis Capaldi takes tour break to 'adjust to impact' of Tourette syndrome",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]