[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Autos & Transportationcategory",
    "Toyota shareholders vote down climate resolution, back board",
    "Fed poised to punt rate hike into the summer wind",
    "China's efforts to catch up in global electronic spying race",
    "Shell boosts dividend, steadies oil output in new CEO plan",
    "Why are other automakers chasing Tesla's 'Gigacasting'?",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "China e-commerce shipments would lose US tariff exemption under proposed law",
    "Belarus starts taking delivery of Russian nuclear weapons - president",
    "Blue and yellow flag, Russian dead attest to Ukrainian advance in south",
    "Putin ponders: Should Russia try to take Kyiv again?",
    "Russia's Medvedev says Moscow now has free hand to destroy enemies' undersea communications cables",
    "Trump pleads not guilty in federal documents case",
    "E. Jean Carroll can pursue $10 mln lawsuit against Donald Trump -judge",
    "Trump documents case: What are the charges and how can he defend against them?",
    "Trump faces difficult odds in classified documents case",
    "Retail and films drive modest growth in UK economy",
    "Exclusive: US pushing India to seal big armed drone buy for Modi visit",
    "Potential Olympics sponsorship deal tests LVMH heir Antoine Arnault",
    "Seventeen drown, 100 rescued after migrant shipwreck off Greece",
    "'In principle, I'm done', Messi unlikely to play at 2026 World Cup",
    "Japanese soldier arrested after fatal gun-range shooting - defence ministry",
    "New Zealand national broadcaster launches review after stories altered",
    "China rebukes US in phone call ahead of Blinken's planned Beijing trip",
    "Nine killed in clash in India's Manipur - police",
    "Trump's defense team still taking shape as he appears in court",
    "Trump documents case: what happens now that he pleaded not guilty?",
    "US House resumes passing bills amid Republican infighting",
    "Biden calls racism 'still too powerful' during Juneteenth concert at White House",
    "UK police seek motive for Nottingham murders",
    "Germany to unveil first-ever National Security Strategy",
    "Russian missile attacks on Odesa and Donetsk region kill at least six, Ukraine says",
    "Navalny campaigner jailed for 7.5 years for 'extremism' by Russian court",
    "Sudan slides further into war as diplomacy flounders",
    "Kenyan president's tax hikes alienate his 'hustler' base",
    "Titan of Cameroon's opposition politics John Fru Ndi dies at 81",
    "Death toll from Kenyan doomsday cult crosses 300",
    "Golden Knights' Marchessault named Stanley Cup playoffs MVP",
    "MLB roundup: A's top Rays on 'reverse boycott' night",
    "Venus loses to Swiss teen on return to competition",
    "McIlroy sees 'big steps of progress' before US Open bid",
    "Trump arraigned on federal charges in Miami",
    "Towns submerged after Ukraine dam breach",
    "Cormac McCarthy, dark genius of American literature, dead at 89",
    "Japanese wrestler moves to Senegal to master ancient martial art",
    "'The Flash' dashes to theaters, starting the DC universe reboot",
    "'Horse diapers' keep Gaza streets clean",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]