[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Austria's Raiffeisen attempts last-ditch Russian spin-off - sources",
    "China's Micron ban highlights chipmakers' dilemma as Sino-U.S. tensions grow",
    "Cryptoverse: Busy bitcoin births new breed of crypto",
    "Krupa, hard-driving veteran entrusted with reviving Societe Generale",
    "US will not award $200 million grant for Microvast battery company - source",
    "Exclusive: Lebanon set to be grey-listed by financial crime watchdog",
    "Majority of British firms cautious on new investments in China - survey",
    "Ukraine courts Africa and 'Global South' as peace plans proliferate",
    "Russia maintains 'counter-terrorism operation' in Belgorod - governor",
    "Moscow says G7 nuclear rhetoric intended to pressure Russia, China",
    "Biden, McCarthy meeting ends with no deal on debt ceiling",
    "Treasury confirms U.S. default as early as June 1 without debt ceiling hike",
    "What happens if Washington falls behind on its bills?",
    "US debt ceiling crunch threatens to roil complacent stock market",
    "Morning Bid: Can PMIs reprise their April surprise?",
    "As Bud slips, Heineken plots further shake-up of U.S. light beer",
    "Healthcare & Pharmaceuticalscategory",
    "Weight-loss drug pioneers aim to jump on Wegovy bandwagon",
    "Greece's leftists to seek second vote instead of coalition government",
    "Driver detained as truck crashes near White House; Nazi flag found",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "India makes tests mandatory for cough syrup export after overseas deaths",
    "Overseas Indians flock to Modi's rally in Sydney",
    "PNG won't be used for 'offensive military operations' - prime minister",
    "East Timor opposition wins most votes in parliamentary election - state media",
    "Nepali sherpa scales Everest for 28th time as toll on peak reaches 11",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "E. Jean Carroll seeks $10 mln in damages from Trump over post-verdict statements",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "TikTok sues Montana after state bans app",
    "Turkey's third-place candidate endorses Erdogan in runoff",
    "Indonesia, Iran sign preferential trade agreement",
    "Israel accuses Iran of using civilian ships as 'floating terror bases'",
    "Political uncertainty could lead to further rate hikes, Bank of Israel official says",
    "Explainer: How the World Health Organization could fight future pandemics",
    "Denmark to boost healthcare with an extra $739 mln per year",
    "Judge tosses out some claims in Abbott baby formula litigation",
    "US FDA approves Opiant's spray for reversing opioid-related overdoses",
    "Exclusive: Paris 2024 hoping for Olympic flame on Eiffel Tower",
    "Spanish police detain four in connection with Vinicius Jr effigy hung from bridge",
    "Halep says ITIA trying to delay her doping hearing further",
    "MLB roundup: Dodgers outslug Braves in series opener",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Boxed Out: Why safe deposit boxes are harder to find",
    "Director of Cannes' first Sudanese film: I walk red carpet as people flee bullets",
    "South African fossils reveal ancient beast's epic journey to oblivion",
    "The Weeknd, Lily-Rose Depp draw screaming fans to 'The Idol' premiere",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]