[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "OpenAI offers $100,000 grants for ideas on AI governance",
    "OpenAI CEO's threat to quit EU draws lawmaker backlash",
    "JPMorgan notifies some First Republic employees of job losses -source",
    "Impossible Foods accused of misusing private investigators in meat-substitute patent fight",
    "The end of King Dollar? The forces at play in de-dollarisation",
    "Microsoft chief says deep fakes are biggest AI concern",
    "Boeing starts deliveries of reworked 737s, promises pricing discipline",
    "Biden, McCarthy appear near to deal on US debt ceiling as default looms",
    "Explainer: What would happen to a Treasury bill after default? Six key questions",
    "U.S. Treasury debt announcement signals to some June 1 is not 'X-date'",
    "US default fears sparks clearing house collateral scrutiny",
    "Chip giant Nvidia nears trillion-dollar status on AI bet",
    "Nvidia set to be retail favorite after Tesla's six-month streak",
    "Nvidia's results spark nearly $300 billion rally in AI stocks",
    "Explainer: Why are Nvidia's shares soaring and what is its role in the AI boom?",
    "Wall Street ends higher as Nvidia sparks rush for AI stocks",
    "Oath Keepers founder gets 18 years in prison, longest Jan. 6 sentence yet",
    "Russia moves ahead with deployment of tactical nuclear weapons in Belarus",
    "Mexican president urges Latino voters to reject DeSantis after campaign launch",
    "Exclusive: From Russia with gold: UAE cashes in as sanctions bite",
    "DeSantis to stump in early voting states after rocky presidential launch",
    "US Supreme Court rules against EPA in wetlands regulation challenge",
    "Biden lauds leadership skills of his pick for top US general",
    "US Supreme Court curbs states' property tax 'windfall'",
    "Only half of Germans see Scholz's coalition surviving as policy differences mount",
    "Ukraine shouldn't use US weaponry inside Russia, US general says",
    "US to announce more military aid for Ukraine, mainly ammunition -sources",
    "Technical issue at British Airways causes some flight cancellations at Heathrow",
    "Most of Guam without power, water after Typhoon Mawar exits",
    "US forecasters call for near-normal Atlantic hurricane season",
    "Storm fells Sierra Leone's historic cotton tree, a symbol of freedom",
    "Brazil's Lula summons ministers as Congress seeks to dilute environmental powers",
    "EU remains Cuba´s top trade partner, committed to 'mutual respect,' top diplomat says",
    "Peru protest victims faced racial bias from security forces, Amnesty says",
    "Peru's Congress deems Mexican leader unwelcome, regional split deepens",
    "Erdogan says Gulf states sent cash in relief for Turkey",
    "Analysis: UAE steps up pace of solo trade deals in regional economic race",
    "Kurds fear Erdogan win amid sharper nationalist rhetoric",
    "Egypt's female 'prisoners of poverty' struggle with stigma",
    "Manchester United back in Champions League with 4-1 rout of Chelsea",
    "Last of the 'Big Three' standing, Djokovic eyes Grand Slam record",
    "Alcaraz says he is just 'one of the favourites' ahead of French Open",
    "Michael Jordan Olympic jersey fetches over $3 million at auction",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Our top photos of the week",
    "Scientists identify polar cyclone swirling on mysterious Uranus",
    "France's Breillat back to breaking taboos at Cannes with 'Last Summer'",
    "Wim Wenders gets rare Cannes film double bill: 'It will be an experience'",
    "Dubai camel cloning caters to races, beauty pageants",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]