[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Magnitude 5.5 earthquake strikes offshore northern California region",
    "Modi, Blinken to meet Pacific Island leaders in Papua New Guinea",
    "US criticizes Israeli order on West Bank settler outpost",
    "Alberta wildfire fighters hope rain, cooling bring relief",
    "Sudan ceasefire deal raises hopes for relief in Khartoum",
    "Cholera outbreak claims ten more lives in South Africa",
    "Animal health body backs bird flu vaccination to avoid pandemic",
    "Biden and McCarthy to meet on Monday as debt ceiling talks resume",
    "Yellen says June 1 is 'hard deadline' for raising debt ceiling",
    "White House, Republicans trade barbs as debt talks paused",
    "Could Biden use the 14th Amendment to raise the debt ceiling?",
    "Ukraine aims to encircle Bakhmut as Russia says it captures city",
    "At G7, Zelenskiy says Bakhmut destruction has echoes of Hiroshima",
    "Biden: Zelenskiy promised Ukraine won't use F-16's in Russia",
    "China summons Japanese ambassador over actions at G7",
    "Morning Bid: China to hold rates steady, markets digest G7",
    "Greece's ruling Conservatives win vote but fall short of majority",
    "Mount Etna eruption halts flights to Sicily's Catania airport",
    "Instagram down for thousands of users",
    "China fails Micron's products in security review, bars some purchases",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "'Killers of Flower Moon' star says Native Americans need allies like Scorsese",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Warner Bros Discovery chief booed at Boston University graduation, videos show",
    "Australia to regulate buy-now-pay-later sector",
    "Morgan Stanley CEO succession underscores Wall Street's diversity gap",
    "Fed's Kashkari open to holding rates steady in June, WSJ reports",
    "Man City celebrate Premier League title with 1-0 win over Chelsea",
    "Vinicius Jr calls LaLiga and Spain racist for chants after sending-off",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "Medvedev outclasses Rune in Rome to capture first title on clay",
    "Trevi Fountain water turns black in Rome climate protest",
    "Italy's Meloni vows support for flood-hit Emilia-Romagna",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Mexico City airport resumes operations after volcanic ash forces shutdown",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "'Firebrand' puts spotlight on Henry VIII's sixth and final wife",
    "'May December' director: women pay higher price than men for breaking rules",
    "Jennifer Lawrence-produced Afghan documentary premieres at Cannes",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]