[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "Billionaire George Soros hands control of empire to son Alex",
    "Asia shares meander ahead of c.bank meetings",
    "South Korea indicts ex-Samsung Elec executive for alleged data leak to China",
    "Novartis to buy Chinook for up to $3.5 bln in boost to late-stage pipeline",
    "Central banks shelve guidance, in fits and starts, as inflation reigns",
    "Analysis: Price drop fears put a brake on European grocers' rally",
    "Ukraine says heavy battles going on after first counteroffensive gains",
    "Russia says it hits Leopard tanks, U.S. Bradley vehicles in Ukraine",
    "Kherson's unending nightmare: Occupation, shelling and floods",
    "UN nuclear watchdog concerned over water levels at Ukraine plant",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "What might the Espionage Act mean for Donald Trump?",
    "How secret were the documents found at Mar-a-Lago?",
    "Morning Bid: Markets drift ahead of central bank extravaganza",
    "North Korea's Kim vows to 'hold hands' with Putin for strategic cooperation",
    "Bus accident kills 10 wedding guests in Australia",
    "Gender biases not improved over past decade, U.N. says",
    "'Kimberly Akimbo,' Tom Stoppard’s 'Leopoldstadt' among winners on writerless Tony night",
    "New Zealand's national broadcaster probes 'inappropriate' editing of Ukraine war stories",
    "British man detained climbing South Korean skyscraper",
    "Taiwanese minister to make rare Britain visit this week",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Portion of I-95 in Philadelphia collapses after vehicle engulfed by fire",
    "US House Speaker McCarthy hopes to 'get back on right track' after Conservative revolt",
    "LGBTQ community celebrates Pride in the face of online and offline attacks",
    "Michigan GOP to change 2024 nomination process, may boost Trump",
    "Chinese aircraft monitored US, France, Canada, Japan naval drill -Global Times",
    "Children who survived five weeks in Colombia jungle will tell own story, father says",
    "Mexico's ruling party to announce 2024 presidential candidate on Sept. 6",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "Manchester City's Rodri named Champions League Player of the Season",
    "Cagliari score stoppage-time winner to snatch promotion from Bari",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "Scientists document how space travel messes with the human brain",
    "Scientists expand search for signs of intelligent alien life",
    "Village garbage man helped unearth ancient bronze statues in Tuscany",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]