[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US central command says it killed ISIS leader in Eastern Syria",
    "Netanyahu bristles at protests as Israel's judicial reform edges ahead",
    "Ukraine, Poland leaders jointly mark WWII massacres that strained ties",
    "NATO flexes muscle to protect Vilnius summit near Russia, Belarus",
    "Boat sinking off Tunisia leaves one dead, at least 10 migrants missing",
    "FARC dissidents and Colombian government reach agreement to begin peace talks",
    "One dead, 7 missing in central China highway landslide",
    "Yellen sees 'progress' in rocky US-China ties, expects more communication",
    "Yellen urges US-China cooperation on economy, climate",
    "U.S. calls Pan Gongsheng China's central-bank 'head', suggesting unannounced promotion",
    "Ukraine celebrates, Russia denounces Azovstal commander release",
    "Poland moves troops to eastern border amid Wagner fears",
    "Russia downs missiles over Crimea, regions bordering Ukraine",
    "Dynamo Kyiv criticise Fenerbahce for pre-season games in Russia",
    "Breakingviews: Meta’s Threads isn’t worth 11 Twitters",
    "Biden begins three-nation tour with stop in London",
    "Pope Francis puts stamp on Church future with new cardinals",
    "Six dead in private jet crash outside Los Angeles",
    "BBC suspends presenter over alleged teenager photos scandal",
    "Business leaders left in limbo by rate hike impact lag",
    "European firms look for footing in China-U.S. spat, French execs say",
    "Meta's 'friendly' Threads collides with unfriendly internet",
    "France upbeat on attracting major Tesla investment, finance minister says",
    "Congressional Democrats raise concerns on cluster bombs for Ukraine",
    "Court reinstates Tennessee ban on care for transgender youth",
    "Ron DeSantis supports revoking China's trade status",
    "Shooter who killed 23 at Texas Walmart sentenced to 90 life terms",
    "Safiullin knocks out Shapovalov to reach maiden major quarter-finals at Wimbledon",
    "Wimbledon order of play on Monday",
    "Pegula produces dazzling display to reach first Wimbledon quarters",
    "Dimitrov dispatches Tiafoe with ease to advance at Wimbledon",
    "Haute couture week in Paris",
    "Homeless World Cup brings its message of hope to California",
    "U.S. forward Rapinoe to retire after current season",
    "Canadian farmer's thumbs-up emoji leads to $62,000 fine for undelivered flax",
    "'Sign the baby': Norris used to bizarre requests at home race",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]