[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Rain to help clear Canada's air soon, but days away from Quebec fires",
    "Child plane crash survivors in \"acceptable\" state of health",
    "Annecy knife attack suspect detained, prosecutor says",
    "Sudanese capital quiet as 24-hour ceasefire takes hold",
    "Nine killed in restaurant attack in Somali capital",
    "Soldier guilty in Rwanda's genocide dies in Niger",
    "Top Indian wrestler accuses government of silence over sexual harassment probe",
    "Trump magnifies attacks on Justice Department after his indictment",
    "Trump faces difficult odds in classified-documents case",
    "Without naming Trump, Ron DeSantis condemns his indictment",
    "Factbox: How secret were the documents found at Mar-a-Lago?",
    "Ukraine's army reports new gains against Russian forces near Bakhmut",
    "Russian strikes kill three in Odesa, hit Poltava air base, Ukraine says",
    "Zelenskiy: Tell Putin my generals are in a positive mood",
    "Trudeau announces military aid, addresses Ukraine parliament",
    "Convicted 'Unabomber' Ted Kaczynski dead at 81",
    "U.S. gives Havana embassy a facelift after years of neglect",
    "Crispin Odey to leave hedge fund he founded after assault allegations",
    "Lessons from the original Industrial Revolution",
    "Boris Johnson's shock exit reverberates through British ruling party",
    "Activision intervenes in Microsoft challenge to UK regulator's block",
    "Aerospace & Defensecategory",
    "Rheinmetall could be worth 17 billion euros over medium term, CEO says",
    "Analysis: City distances itself from hedge fund boss Odey in tentative #MeToo shift",
    "Wall Street Week Ahead: Investors rethink recession plays, boosting U.S. stock market laggards",
    "US West Coast port workers shut down Port of Seattle",
    "Bidens offer 'joy' at White House Pride event as LGBTQ attacks mount",
    "U.S. Supreme Court ruling brightens electoral map for Democrats in 2024",
    "Biden administration near deal to preserve preventive care coverage, for now",
    "Man City hang tough to beat Inter and complete the treble",
    "Swiatek reigns supreme at French Open by quelling Muchova",
    "Now I know I can win big titles, says French Open finalist Muchova",
    "NBA: Finals-Denver Nuggets at Miami Heat",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]