[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Manhattan DA must hand over documents to JPMorgan for lawsuit over Epstein ties",
    "Ford, Tesla shares jump over 7% on Superchargers deal",
    "Paramount Global shares rise as major shareholder gets $125 million investment deal",
    "Strong US consumer spending, inflation readings put Fed in tough spot",
    "Fed 'pause' on rate hikes in doubt after strong US data",
    "Investing in AI: how to avoid the hype",
    "India to push back against 'agenda-driven' global ranking firms, Modi adviser says",
    "US debt ceiling talks struggle before deadline; 'major issues' remain",
    "Understanding the debt ceiling",
    "Power transmission deal being considered in US debt limit talks",
    "Factbox: What's in the debt ceiling deal Biden, McCarthy are negotiating?",
    "Russian attack on Ukrainian clinic kills two and wounds 30, Kyiv says",
    "Russia moves ahead with deployment of tactical nukes in Belarus",
    "Boris Johnson discussed Ukraine with former US President Trump, spokesperson says",
    "Russia summons US diplomats to protest at Sullivan comments on Crimea",
    "Analysis: NATO struggles in the shadows to find new leader",
    "Oath Keeper gets 8 1/2 years in prison over US Capitol attack",
    "Sudan army calls on ex-soldiers to re-enlist, sporadic fighting persists",
    "South Carolina judge temporarily blocks six-week abortion ban",
    "British cycling federation bars transgender women from competing in female category",
    "U.S. warns China could hack infrastructure, including pipelines, rail systems",
    "North Dakota's Republican governor set to launch US presidential bid",
    "How Americans plan to travel this Memorial Day",
    "U.S. Treasury's Adeyemo sees no ability to 'triage' payments without debt limit hike",
    "More than 13,000 people in England denied vote due to new ID law, Reuters survey shows",
    "Serbia orders army to Kosovo border after protest clashes",
    "Gun and drug trafficking ring busted in raids across Europe",
    "WSJ reporter appeals against extension of detention in Russia",
    "Erdogan defies predictions of political demise ahead of Turkey election runoff",
    "Ten years after Turkey's Gezi protests, some say vote a chance for justice",
    "Lebanon's central bank governor set to end his tenure a wanted man",
    "Kuwait suspends new visas for Philippines workers in rights row",
    "Four dead, suspect arrested in rare shooting in Japan",
    "India gets new parliament building as Modi remakes capital's centre",
    "U.S. mountaineer climbs rare Everest 'triple crown' as death toll reaches 12",
    "South Korea detains passenger after Asiana plane door opened mid-air",
    "Bumper US entrants braced for assault on Paris",
    "Soccer Spanish grassroots club players see more racism outside the sport",
    "Top-ranked amateur Zhang announces decision to turn professional",
    "'Anatomy of a Fall' border collie fetches Cannes Palm Dog in fiercest contest yet",
    "Orlando Bloom at Cannes for 'Gran Turismo' story of gamer-turned-racer",
    "Celine Dion cancels rest of world tour due to medical condition",
    "Killer whales wreck boat in latest attack off Spain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]