[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Russian attack cannot be ruled out, says Swedish parliamentary report: SVT",
    "Magnitude 6.4 earthquake strikes the Gulf of California",
    "Israel set to approve thousands of building permits in West Bank",
    "Start of truce period brings lull in fighting to Sudan's capital",
    "Analysis: Mali faces spectre of anarchy after demanding UN's departure",
    "Ghana sees agreement with bilateral creditors in coming weeks",
    "Key ASEAN members to skip Thai-hosted Myanmar talks amid criticism",
    "Blinken to wrap up rare visit to China, may meet Xi Jinping",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Does a Cuba base host a Chinese spy station? US thinks so",
    "Olaf Scholz faces tricky balancing act in Germany-China talks",
    "Russia reports fierce fighting, Zelenskiy praises troops, counter-offensive",
    "Ukraine targets seeks $40 billion for 'Green Marshall Plan'",
    "EU to accelerate arms shipments to Ukraine",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "Asian stocks pause rally, eyeing China stimulus, Powell testimony",
    "Their parents made China the world's factory. Can the kids save the family business?",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Trump lacked power to declassify secret nuclear arms document, experts say",
    "Clark holds off McIlroy to win US Open for first major title",
    "Australian Senate paves way for landmark referendum on Indigenous voice in constitution",
    "Analysis: China bankers told to shun flashy clothes, 5-star hotels in austerity drive",
    "South Korea's Yoon begins foreign tour for 2030 expo bid, Vietnam state visit",
    "Support for Japan PM Kishida's cabinet slumps, Mainichi Shimbun poll shows",
    "Aerospace & Defensecategory",
    "Exclusive: Mystery X9 helicopter takes shape as potential successor to Airbus H145",
    "JLR taps Everstream Analytics' AI to dodge supply chain problems",
    "Oil prices come off earlier gains as banks cut China growth forecasts",
    "Intel to invest $25 billion in Israel factory in record deal, Netanyahu says",
    "Biden will announce $600 million in climate investments during California trip",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Murray bags second straight grasscourt title, Boulter wins all-British showdown",
    "ATP roundup: Frances Tiafoe wins thrilling Stuttgart final",
    "Team by team analysis of the Canadian Grand Prix",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Coffee research group progresses on naturally decaffeinated varieties",
    "Ticketmaster, others agree to upfront, all-in prices as part of Biden war on junk fees",
    "Saturn's icy moon Enceladus harbors essential elements for life",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]