[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Five takeaways from the Trump indictment over classified documents",
    "Trump documents case: what happens now after indictment?",
    "Biden says won't speak to AG Garland as Trump indictment unsealed",
    "Top US congressional Democrats urge to let Trump indictment case 'proceed peacefully'",
    "Factbox: How secret were the documents found at Mar-a-Lago?",
    "Trump documents case: What are the charges and how can he defend against them?",
    "Donald Trump, the Presidential Records Act and ‘Clinton's sock drawer’ defense",
    "Trump risked national secrets, US prosecutors allege in indictment",
    "The indictment of Donald Trump in the classified documents probe",
    "Trump-appointed judge to preside at initial court appearance",
    "Russia has received hundreds of Iranian drones to attack Ukraine, White House says",
    "Some people in flooded Russian-controlled Ukraine still need rescuing, say relatives",
    "Ukraine reports 'heavy combat' after Putin says offensive has begun",
    "S&P 500, Nasdaq hit fresh 2023 highs as Tesla rallies",
    "Decrying 'witch hunt,' Boris Johnson resigns from UK parliament",
    "Wildfires spread in British Columbia, Quebec sees signs of progress",
    "Healthcare & Pharmaceuticalscategory",
    "US FDA panel backs approval for Eisai-Biogen Alzheimer's drug Leqembi",
    "Apple, Amazon must face consumer lawsuit over iPhone, iPad prices, US judge rules",
    "Wall Street Week Ahead: Investors rethink recession plays, boosting U.S. stock market laggards",
    "White House welcomes Tesla to take advantage of federal dollars",
    "Binance.US halts dollar deposits, Robinhood delists tokens after SEC crackdown",
    "US House Republicans unveil broad package of tax cuts",
    "Biden admin near deal to preserve preventive care coverage, for now",
    "Biden to hold first 2024 campaign event in Pennsylvania",
    "US Chamber of Commerce sues over government's drug pricing power",
    "Suspect in Natalee Holloway disappearance pleads not guilty in US court",
    "Israeli construction in West Bank no bar to peace, Netanyahu says",
    "Erdogan names Erkan to head Turkey central bank, policy pivot expected",
    "Saudi Arabia's golf coup highlights Biden's human rights bind",
    "Oil posts second weekly decline as demand concerns overshadow Saudi cut",
    "Regulatory Oversightcategory",
    "Exclusive: LNG developer Venture Global spars with customers over cargoes",
    "New York lawmakers weigh clean fuel standard as legislative session ends",
    "Exploration & Productioncategory",
    "US drillers cut oil and gas rigs for sixth week in a row, Baker Hughes says",
    "Sudan factions agree day's truce designed to 'break cycle of violence'",
    "One U.N. peacekeeper killed and four injured in north Mali attack",
    "Archbishop of Canterbury urges Ugandan Anglicans to reject anti-gay law",
    "From restaurants to water towers, unrest dents Senegal's economy",
    "Serbia's Vucic demands Kosovo concessions on autonomy for local Serbs before new vote",
    "Toddlers stable after Annecy attack, Macron hails emergency responders",
    "Boris Johnson's honours list includes aides tied to ex-UK PM's 'Partygate' scandal",
    "Italy's former PM Berlusconi in hospital for leukaemia scheduled checks",
    "NBA: Finals-Denver Nuggets at Miami Heat",
    "Djokovic closes on Major 23 as Alcaraz breaks down, faces Ruud in final",
    "Kipyegon and Girma smash world records in dazzling Paris Diamond League meet",
    "Ingebrigtsen shatters world record in seldom-run two-mile event at Paris Diamond League",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]