[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "At least 10 people killed, nine injured in shootout in northern Mexico",
    "White daisies bloom in Uruguay's streets, in memory of dictatorship missing",
    "Nine dead in stampede at El Salvador stadium - AFP, citing police",
    "South Korea's Yoon praises Japan's Kishida for his efforts to mend ties",
    "Sudan's army and paramilitary RSF sign seven-day ceasefire",
    "East Timor heads to the polls in parliamentary election",
    "Tens of thousands protest against planned Israeli judicial overhaul",
    "Russia says Ukrainian city of Bakhmut captured",
    "Pope asks Italian cardinal to carry out Ukraine peace mission",
    "UN official criticised after meeting Russian sought by ICC",
    "Explainer: How important is Wagner's claimed capture of Bakhmut?",
    "G7 stiffens resolve to thwart Russia, gives Zelenskiy chance to win over fence sitters",
    "Ukraine's Zelenskiy courts 'Global South' at G7 summit",
    "Podcast: What's the G7 to do about China?",
    "Biden will meet Zelenskiy, South Korea and Japan on Sunday",
    "Trump or DeSantis? Neither, say Ukrainian-American voters angry at war stance",
    "Biden, House Speaker McCarthy could speak Sunday on debt limit",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Ex-British Gurkha hopes Everest climb will change disability perceptions",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "Brittney Griner greeted by US VP Harris in return to court",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Pentagon leak suspect Jack Teixeira ordered to remain in jail ahead of trial",
    "JPMorgan, ex-executive spar in court over responsibility for Epstein",
    "Morgan Stanley's Aussie CEO Gorman transformed bank, deal by deal",
    "Lawsuit over Trident 'Original Flavor' gum is dismissed",
    "Wall Street Week Ahead: Artificial intelligence gives real boost to U.S. stock market",
    "MLB roundup: Aaron Judge helps Yankees stun Reds",
    "Manchester City win Premier League title as Arsenal lose",
    "Rybakina wins Rome title after ailing Kalinina retires",
    "Koepka in lead at Oak Hill as he goes for PGA Championship hat-trick",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Mexico City airport resumes operations after volcanic ash forces shutdown",
    "Villagers evacuated as wildfire ravages woodlands in western Spain",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Cate Blanchett dons habit in Australian director's conversion tale",
    "Julianne Moore, Natalie Portman anchor Cannes competitor 'May December'",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]