[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Paris air show: India centre stage as another big jet deal looms",
    "Carlos Ghosn sues Nissan for $1 bln in Lebanon, legal document shows",
    "Alibaba CEO and Chairman Zhang to step down to focus on cloud business",
    "Exclusive: EV maker Rivian to adopt Tesla's charging standard",
    "Healthcare & Pharmaceuticalscategory",
    "Weight loss drug Wegovy slower to launch in new markets - Novo Nordisk",
    "SoftBank's Son says he is 'heavy user' of ChatGPT",
    "UK grocery inflation edges lower for third straight month -Kantar",
    "Russia attacks Kyiv and other Ukrainian cities in overnight air strikes",
    "Biden says threat of Putin using tactical nuclear weapons is 'real'",
    "Ukraine says Hungary ignores requests for contact with transferred prisoners of war",
    "Ukraine builds layered air defences as Russia ramps up strikes",
    "Titanic tourist sub missing for third day with five aboard",
    "Who is on the missing Titanic sub?",
    "Ships, planes search for sub that went missing on trip to Titanic wreckage",
    "Morning Bid: US housing rebound, China prime cuts",
    "Inside China's underground market for high-end Nvidia AI chips",
    "Lab crunch: British science has nowhere to go",
    "Paris Olympic headquarters searched as part of corruption investigations",
    "Podcast: The hunt for the Titanic tourist sub and succession in the West Bank",
    "U.S. judge sets Aug. 14 trial date for Trump in Florida documents case",
    "Biden criticizes U.S. senator's hold on military nominations",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Affirmative action, student debt rulings loom at US Supreme Court",
    "Modi heads to US to deepen ties, says no doubting India's position on Ukraine",
    "U.S. urges China military dialogue despite rebuff to Blinken",
    "Australians say they would support Taiwan if China attacked, with limits -poll",
    "Taliban treatment of women could be 'gender apartheid' - UN expert",
    "Romanian prosecutors send Andrew Tate to trial for human trafficking",
    "Estonia becomes first central European country to allow same-sex marriage",
    "Finland's parliament backs Petteri Orpo as PM, replacing Sanna Marin",
    "Countries back weakened EU nature law, seek more biodiversity funding",
    "Ugandan students' parents submit DNA samples to ID massacre victims",
    "Rwandan genocide accused abandons South African bail, seeks asylum",
    "Nigeria sets eight-week timeline to agree minimum wage with unions",
    "Tunisians struggle to buy sheep for Eid as economic crisis bites",
    "Kontaveit to retire after Wimbledon due to back injury",
    "MLB roundup: Joey Votto stars in return for streaking Reds",
    "'World's fastest accountant' Amo-Dadzie goes under 10 seconds in Graz 100m",
    "Giro d'Italia winner Roglic will not ride Tour de France",
    "Americans mark Juneteenth with marches, music and reflection",
    "News junkies turn to TikTok to chart new paths in media",
    "UN adopts world's first treaty to protect high seas biodiversity",
    "Two sea turtles nest on Spain's Mediterranean coast as waters warm",
    "Rome to open ancient square where Julius Caesar was killed",
    "Visit a museum, go home inked - pop-up tattoo parlour at Dutch Rembrandt House",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]