[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "EU considering major Tunisia aid package as migration surges",
    "Russia arrests U.S. citizen on drug dealing charges",
    "Iran's Khamenei says 'nothing wrong' with a nuclear deal with West",
    "Body camera footage released after fatal police shooting of 14-year-old in Colorado",
    "Fighting rages in Sudan's capital after 24-hour truce expires",
    "Annecy gathers in support of knife attack victims",
    "Pope skips Sunday blessing, recovering normally from surgery",
    "Ukraine says it retakes village in 'first results' of counterattack",
    "Russia shells boats in Ukraine flood rescue, three dead - governor",
    "Prigozhin says Wagner will not sign any contract with Russian defence minister",
    "Kherson's unending nightmare: Occupation, shelling and floods",
    "What is the Espionage Act and what might it mean for Donald Trump?",
    "Trump magnifies attacks on Justice Department after his indictment",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Biden plans to keep quiet on Trump documents charges",
    "Billionaire George Soros hands control of empire to son Alex",
    "After arrest in SNP funding probe, Scotland's Sturgeon says 'I am innocent'",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Warren Buffett – he invests just like us!",
    "Philadelphia highway collapses after vehicle engulfed by fire",
    "Germany refusing Intel's additional demand for subsidies for chip plant, Financial Times reports",
    "Illumina CEO Francis deSouza resigns after battle with Icahn",
    "BioNTech faces first German lawsuit over alleged COVID vaccine side effects",
    "CD Projekt to launch Cyberpunk 2077 expansion on Sept. 26",
    "OPEC+ working against 'uncertainities and sentiment,' Saudi energy minister says",
    "EU to try again for renewable energy deal after nuclear row",
    "Nord Stream sabotage probe turns to clues inside Poland, Wall Street Journal reports",
    "Exploration & Productioncategory",
    "Pakistan PM says first discounted Russian crude oil cargo arrives in Karachi",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "Another Grand Slam final lost, but Ruud hopes he won respect at French Open",
    "Australia aim for 'legacy defining' moment by completing WTC-Ashes double",
    "Novak Djokovic's run to record 23 Grand Slam titles",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]