[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Shell pivots back to oil to win over investors -sources",
    "Inside OPEC+, Saudi 'lollipop' oil cut was a surprise too",
    "Ex-JPMorgan executive Staley to be questioned under oath about Epstein ties",
    "France strong-arms big food firms into cutting prices",
    "Tesla jumps as GM deal takes Supercharger network closer to US standard",
    "UBS, government sign Credit Suisse loss-sharing deal clearing way for deal to close",
    "Binance.US to halt dollar deposits after SEC crackdown",
    "Trump faces federal charges in classified documents case, adding to legal woes",
    "Trump's Republican rivals slam Justice Dept. 'weaponization' after indictment",
    "Who is Special Counsel Jack Smith in the Trump documents case?",
    "Trump documents case: what happens now after indictment?",
    "Russia reports heavy fighting in southern Ukraine, Kyiv silent on counterattack",
    "Kyiv says it intercepted call showing Russia blew up Kakhovka dam",
    "Maps: Damage from the Nova Kakhovka dam collapse",
    "Russian invasion increases challenges, risks for Ukraine coal mines",
    "Wall St opens higher on Tesla boost, Fed meet in focus",
    "French 'backpack hero' says his faith gave him strength to fight knifeman",
    "Wildfires spread in Canada's British Columbia as Quebec stabilizes",
    "Podcast: What’s next for Trump and crypto’s uncertain future",
    "U.S. Supreme Court ruling brightens electoral map for Democrats in 2024",
    "Voting Rights Act survives at US Supreme Court but more challenges loom",
    "Biden heads to North Carolina while Republicans Trump, DeSantis court state",
    "FBI arrests Texas man at center of suspended attorney general Paxton's impeachment",
    "Controlled burn and downed power line sparked Colorado's costliest wildfire",
    "Toddlers stable after Annecy knife attack, France lauds 'backpack hero'",
    "Julian Assange loses US extradition challenge, will renew appeal next week",
    "Pope 'progressively improving' after surgery, doing some work from armchair",
    "NATO may base troops in Sweden before Stockholm joins, government says",
    "Erdogan names Erkan to head Turkey central bank, policy pivot expected",
    "Chinese investors flock to Riyadh conference seeking new markets, capital",
    "Saudi Arabia's golf coup highlights Biden's human rights bind",
    "US and Iran both deny report of nearing interim nuclear deal",
    "Heavy 'dragon boat water' rains hit southwest China, some cities flooded",
    "China warns Europe against official ties with Taiwan ahead of minister's visit",
    "Japan calls for power saving for Tokyo households, industries during summer",
    "South Korea summons China envoy over warning on 'wrong bets' in ties",
    "OpenAI CEO encourages South Korea to supply chips in AI boom",
    "U.S. Congress to consider two new bills on artificial intelligence",
    "AI startup Cohere raises funds from Nvidia, valued at $2.2 billion",
    "Autos & Transportationcategory",
    "Mercedes-Benz beats Tesla for California's approval of automated driving tech",
    "US remain top in FIFA rankings before Women's World Cup",
    "Tennis-Swiatek aiming for third title, Muchova out to spoil the party",
    "Heat forward Butler excited about Messi's impact in Miami",
    "India all out for 296, trail Australia by 173 runs",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Travellers gather for the annual Appleby Horse Fair",
    "Skylines vanish behind wildfire smoke from Canada",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Boy George says he still wants to startle people 'a little bit'",
    "Texas aquarium saves endangered sea turtles stunned by cold water events",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]