[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Analysis: For Musk and other foreign CEOs visiting China, silence is golden",
    "Healthcare & Pharmaceuticalscategory",
    "Weight-loss drugs pilot to begin in UK amid uncertainty over Wegovy launch",
    "Morning Bid: Fearless VIX, China miss, Canada hike?",
    "Turkish lira drops 7%, signalling move towards free market",
    "Meta plans new overview for Facebook, Instagram users, German regulator says",
    "US tightens crackdown on crypto with lawsuits against Coinbase, Binance",
    "Exclusive: Vodafone, Hutchison to announce UK merger as soon as Friday",
    "Ukrainians face homelessness, disease as floodwaters crest from destroyed dam",
    "Ukraine warns of floating mines and disease after Kakhovka dam collapse",
    "Kakhovka dam breach takes Ukraine war into uncharted territory",
    "Nova Kakhovka dam attack: what do we know so far?",
    "Analysis: Diverted Indian jet lands in middle of Russia airspace dispute",
    "Air India sends plane for stranded passengers in Russia, with engineers",
    "Exclusive: Kosovo president open to new elections in Serb-majority municipalities",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "PGA Tour, LIV merger may lead to higher viewers and costs for golf sponsors",
    "Embattled CEO Chris Licht out at CNN",
    "Podcast: Golf geopolitics and exclusive sit-down with Kosovo’s president",
    "Gunman shoots two dead, wounds five others at Virginia high school graduation",
    "Ex-US Vice President Mike Pence launches 2024 election bid, challenging Trump",
    "McCarthy faces sudden challenge from hardliners after US debt ceiling bill",
    "Trial opens for former Florida deputy in Parkland school shooting",
    "Prince Harry says phone-hacking was on industrial scale in UK press",
    "Pope Francis in hospital for second abdominal surgery in two years",
    "UK's Sunak seeks stronger economic ties with U.S. on Washington trip",
    "Explainer: Why would pipeline damage threaten Black Sea grain deal?",
    "India train crash: Family hopes DNA test will help claim for body",
    "Pakistan's Imran Khan formally named in 'abetting' lawyer's drive-by murder",
    "Philippine court denies bail for top Duterte rival after 6 years detained",
    "Bahanaga Bazar, the rural Indian train station rocked by disaster",
    "Supreme Swiatek outclasses Gauff to reach French Open semi-finals",
    "Warner misses out on fifty, Australia 73-2 in WTC final v India",
    "After French Open exit, Jabeur shifts focus to winning Wimbledon",
    "PGA Tour/LIV partnership will be good for game, says McIlroy",
    "Haze shrouds Manhattan skyline as Canada wildfire smoke drifts south",
    "France's iconic Mont-Saint-Michel abbey turns 1,000",
    "Nigerian parents pay school bills with recyclable waste",
    "Pro wrestlers return to China as global bouts resume after pandemic",
    "Dua Lipa wins dismissal of 'Levitating' copyright lawsuit",
    "Peter Chernin's North Road buys Turkish film and TV house Karga Seven",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]