[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Swiss National Bank calls for new measures after Credit Suisse crash",
    "Asia stocks ease after Powell testimony; spotlight on BoE",
    "Netflix CEO says $2.5 bln Korean investment won't exploit local talent",
    "Brexit an 'economic disaster' for UK and German trade - DIHK",
    "Analysis: For EV batteries, lithium iron phosphate narrows the gap with nickel, cobalt",
    "Tech companies including Google gripe about unfair cloud practices",
    "Nasdaq expects expanded markets to justify $10.5 bln Adenza merger price tag",
    "Search intensifies for Titanic sub with only hours of oxygen left",
    "Who's on board the missing Titanic sub?",
    "Why recovering the missing Titanic sub is so challenging",
    "Titanic sub timeline: when did it go missing and key events in search",
    "Analysis: Investors keep bets on U.S. rates soon topping out, despite Powell's hawkishness",
    "Morning Bid: How high will BoE go?",
    "Exclusive: US to ease visas for skilled Indian workers as Modi visits",
    "Ukraine offensive makes slow gains, Zelenskiy says; Putin sees 'lull'",
    "Deadly blast in northwest China prompts call for safety overhaul",
    "Leaders head to Paris to give impetus for new global finance agenda",
    "New Zealand PM disagrees with Biden, says Xi Jinping not a 'dictator'",
    "Beijing braces for blistering hot weather as heatwaves return",
    "Indonesia moves site of ASEAN military drills away from South China Sea",
    "US Coast Guard ship transited Taiwan Strait after Blinken's China visit -US Navy",
    "U.S. court strikes down Florida transgender health rule",
    "U.S. House censures prominent Democrat for work on Trump probes",
    "US announces new visa restriction policy for those who have assisted fugitives",
    "Spirit AeroSystems workers at Kansas plant to strike after rejecting deal",
    "Honduras hands prison control to military police, expands emergency powers after deadly riot",
    "Canada, Dominican Republic reach agreement over Haitian crisis response",
    "Drought-hit Panama Canal further restricts maximum ship depth",
    "Brazil Senate confirms Lula's ex-lawyer for Supreme Court seat",
    "Paris blast: At least 37 hurt, sniffer dogs pick up scent under rubble",
    "Paul-Henri Nargeolet: French diver on missing sub is Titanic expert",
    "German far-right to nominate chancellor candidate as support soars",
    "Blinken encourages Turkish counterpart to support Sweden's NATO bid",
    "MLB roundup: Reds sweep Rockies, win 11th straight",
    "US Senate panel invites PGA Tour commissioner, LIV CEO to testify on merger",
    "Swede Lundqvist headlines Hall of Fame's Class of 2023",
    "China's governing body upholds lifetime bans for match-fixing",
    "Celebrating summer solstice, from Stonehenge to Times Square",
    "On the frontlines of Ukraine's counteroffensive",
    "Blood, sex and a little magic: Tasmania marks a decade of offbeat festival",
    "Tokyo residents find comfort in fluffy, street-strolling alpacas",
    "Zero waste theatre seeks to show we all can act for change",
    "Stonehenge-like 4,000-year-old sanctuary discovered in Netherlands",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]