[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "India to withdraw 2,000-rupee notes from circulation",
    "White daisies bloom in Uruguay's streets, in memory of dictatorship missing",
    "Georgia to resume flights to Russia this week, drawing EU and Ukrainian criticism",
    "After fleeing conflict, displaced women face rape in east Congo",
    "Villagers evacuated as wildfire ravages woodlands in western Spain",
    "Guatemala's presidential frontrunner thrown off ballot, promises appeal",
    "'War is not an option', Taiwan president says amid China tensions",
    "Zelenskiy joins Japan G7 as democracies take aim at Russia and China",
    "Podcast: What's the G7 to do about China?",
    "G7 calls for developing global technical standards for AI",
    "G7 aligns on shared 'de-risk, not decouple' approach to China",
    "White House, Republicans make no progress on debt ceiling",
    "Wall St slips on debt ceiling uncertainty",
    "US debt ceiling deal could stall safety flight fueling megacap rally",
    "Air strikes hit Khartoum's outskirts as Sudan's war enters sixth week",
    "Turks abroad begin voting in presidential election runoff",
    "No joke: China's backlash against stand-up stirs fear of comedy clampdown",
    "Breakingviews: Disney can play Scrooge with Florida",
    "Britain’s record holding climber says Everest is 'dry, more rocky'",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "Brittney Griner greeted by US VP Harris in return to court",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Pentagon leak suspect Jack Teixeira ordered to remain in jail ahead of trial",
    "JPMorgan, ex-executive spar in court over responsibility for Epstein",
    "Morgan Stanley's Aussie CEO Gorman transformed bank, deal by deal",
    "Lawsuit over Trident 'Original Flavor' gum is dismissed",
    "Wall St Week Ahead Artificial intelligence gives real boost to U.S. stock market",
    "MLB roundup: Rafael Devers homers twice as Red Sox top Padres",
    "Ten Hag hopes Rashford and Man Utd 'find each other' in contract talks",
    "Kalinina hopes Rome run provides some comfort for Ukraine",
    "'I will cry 100%': Firmino braces for emotional Anfield farewell",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Soggy Cannes premiere for Turkish director Ceylan's 'About Dry Grasses'",
    "Mick Jagger's daughter Jade fined for attacking police in Spain",
    "'Four Daughters' mixes documentary, fiction to portray Tunisian mother",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]