[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Spain government calls snap election after regional ballot rout",
    "U.N. warns more than one million may flee Sudan bloodshed",
    "Iranian female journalist goes on trial on charges linked to Amini protests",
    "NATO soldiers deploy around Kosovo town halls in standoff with Serb protesters",
    "Israeli forces kill Palestinian officer in clashes",
    "Nigeria's new President Tinubu promises economic reboot",
    "Shanghai breaks more than century-old heat record in sweltering May",
    "Russia hits military facility in Ukraine in new wave of strikes",
    "Dismissing Russian criticism, U.S. Senator Graham praises Ukrainian resistance",
    "Belarus's Lukashenko says there can be 'nuclear weapons for everyone'",
    "Denmark plans $2.6 bln more for Ukraine, Zelenskiy praises 'major contribution'",
    "Uganda enacts harsh anti-LGBTQ law including death penalty",
    "Factbox: Uganda's anti-LGBTQ law: Key provisions in the legislation",
    "Uganda's anti-gay law: how restricted are LGBTQ rights in Africa?",
    "European shares slip, but debt ceiling deal buoys U.S. futures",
    "Japan puts missile defences on alert as North Korea warns of satellite launch",
    "Turkey's Erdogan triumphs in election test, extending 20-year rule",
    "Biden and McCarthy's bumpy journey to a debt ceiling deal",
    "Inside South Korea's race to become one of the world’s biggest arms dealers",
    "US House Rules panel to meet Tuesday on debt ceiling bill",
    "Man charged with murder after 3 dead in New Mexico biker shootout",
    "IRS funding cut won't hurt near-term tax collection, officials say",
    "US Representative Chip Roy says 'we're going to try' to stop debt ceiling deal",
    "Eastern Canada's Halifax declares emergency over wildfire, shutting schools",
    "Alberta heads to the polls with Canada's green agenda in balance",
    "Factbox: Biggest issues in Canadian province of Alberta's May 29 election",
    "Mexico rulers tipped to win historic state election as presidency race looms",
    "Explainer: What is the U.S. debt ceiling?",
    "In the Market: Amid the calm, the Fed brews the next storm",
    "Musk expected to visit China this week, meet officials - sources",
    "Binance names Teng as head of regional markets outside US",
    "Hong Kong media tycoon Jimmy Lai loses bid to terminate national security trial",
    "Philippines, U.S., Japan to hold first-ever joint coast guard exercise",
    "Japan PM Kishida says his son to quit as aide after 'inappropriate' behaviour",
    "From highs to lows, Everest record breaker sees 'no future' in Nepal",
    "Stephens puts down marker on 'favourite court in the world'",
    "MLB roundup: Rays win shootout, take series from Dodgers",
    "Pavlyuchenkova makes winning Roland Garros return after injury woes",
    "Latvians awake to surprise holiday after epic ice hockey result",
    "Memorial Day across America",
    "Style from the Cannes red carpet",
    "NASA looks to spice up astronaut menu with deep space food production",
    "On a culinary homecoming, influencer chefs look to perpetuate Palestinian dishes",
    "Plastic recycling in focus as treaty talks get underway in Paris",
    "Taipei restaurant dishes up giant isopod noodles for adventurous patrons",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]