[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "IKEA bets on remote interior design as AI changes sales strategy",
    "Cryptoverse: Security alert! Altcoins worth $100 billion dropped in hot water",
    "Analysis: Tesla taps brakes on job ads after Musk clamps down on hiring",
    "Surprise UK wage jump raises likelihood of higher interest rates",
    "China cuts short-term borrowing costs to support recovery",
    "Disney's Pixar seeks return of box office magic with 'Elemental'",
    "Exclusive: Investors may exit consumer goods firms over EU deforestation law",
    "Ceding ground in Ukraine, Russia kills civilians in apartment block strike",
    "NATO pushes for common standards to tackle shortfalls in artillery munitions",
    "Russia releases video of captured German tanks, U.S. fighting vehicles in Ukraine",
    "US concerned North Korea plans to deliver more weapons to Russia",
    "Trump to face charges in Florida court in classified documents case",
    "'Speedy trial' promised by special counsel in Trump case may not go so fast",
    "Morning Bid: Inflation anxiety, yet S&P 500 keeps on running",
    "Toyota unveils sweeping plans for new battery tech, EV innovation",
    "Autos & Transportationcategory",
    "Analysis: GM could reap billions by building combustion trucks and SUVs through 2035",
    "Italy prepares to bid farewell to Berlusconi with grand funeral",
    "Podcast: Trump in court, Lebanon’s power vacuum and UAE sex trafficking",
    "UK police arrest murder suspect after three found dead on Nottingham streets",
    "Draining of Ukraine's Kakhovka reservoir offers a reminder of past and present wars",
    "Ukraine denounces Russian MH17 'rambling conspiracy theory' at World Court",
    "Britain's COVID inquiry launches with pledge to put bereaved at its heart",
    "U.S. officials call spy program key to big cases, but give few details",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "Residents in for months-long displacement as Philippine volcano spews lava, gases",
    "Taiwan civil defence handbook includes tips on identifying Chinese soldiers",
    "Seven die as cyclone barrels towards western India, Pakistan",
    "China says US eagerness to engage is an 'illusion'",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "McIlroy grouped with Koepka as PGA-LIV battle set to continue at US Open",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Finals MVP Jokic gives Serbia another sports hero to celebrate",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Why finding a camp for your kid is this summer's madness",
    "Pat Sajak to retire from record TV stint as 'Wheel of Fortune' host",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]