[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US judge temporarily blocks Microsoft acquisition of Activision",
    "Bunge, Viterra will merge to form $34 billion agri-trading powerhouse",
    "Autos & Transportationcategory",
    "Toyota shareholders set to vote on climate lobbying as EV pivot in focus",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "OMV Petrom makes largest crude oil discovery in decades",
    "Meta releases 'human-like' AI image creation model",
    "Bahamas court boosts Bankman-Fried's challenge to post-extradition charges",
    "Trump pleads not guilty in federal documents case",
    "E. Jean Carroll can pursue $10 mln lawsuit against Donald Trump -judge",
    "Trump documents case: What are the charges and how can he defend against them?",
    "'Speedy trial' promised by special counsel in Trump case may not go so fast",
    "Blue and yellow flag, Russian dead attest to Ukrainian advance in south",
    "Russia releases video of captured German tanks, U.S. fighting vehicles in Ukraine",
    "U.S. House united on call for Russia to release WSJ reporter",
    "Zelenskiy seeks tougher sanctions on Russian missile components",
    "Asian shares up, dollar wobbly as US inflation data reinforces Fed pause bets",
    "Amazon cloud services back up after big outage hits thousands of users",
    "Exclusive: US pushing India to seal big armed drone buy for Modi visit",
    "Nigeria boat accident kills 50 people, several missing",
    "Cormac McCarthy, dark genius of American literature, dead at 89",
    "New Zealand national broadcaster launches review after stories altered",
    "Australia's ANZ looks to expand lending to critical minerals sector",
    "State Department amends comment on APEC invitation for Hong Kong's leader",
    "US lawmakers warn North Korean refugees face forcible repatriation from China",
    "US House resumes passing bills amid Republican infighting",
    "White House to review ruling that press secretary violated act on political activity",
    "New York City in deal with teachers union, 5-year pact with over 15% wage hike",
    "NY top court hands win to Kesha in Dr. Luke defamation case",
    "UK police arrest murder suspect after three bodies found on Nottingham streets",
    "'Goodbye President': Berlusconi fans pay tribute to late leader",
    "Kosovo PM presents plan to defuse tensions in Serb-majority area",
    "Britain's COVID-19 inquiry hears government was under-prepared",
    "Neo-Nazi groups multiply in a more conservative Brazil",
    "Human rights body finds Cuban gov't responsible in 2012 deaths of dissidents",
    "Mayor of Mexico's Tijuana moves into barracks for safety after threats",
    "Colombia ex-candidate Zuluaga violated law with funds from Odebrecht -AG",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "Australia's Titmus might hang up the goggles after Paris",
    "Kyrgios suffers first-round defeat in comeback",
    "Trump arraigned on federal charges in Miami",
    "Towns submerged after Ukraine dam breach",
    "'The Flash' dashes to theaters, starting the DC universe reboot",
    "Biden to host Jennifer Hudson, Wu-Tang's Method Man at Juneteenth concert",
    "Disney's Pixar seeks return of box office magic with 'Elemental'",
    "'Last' Beatles record to be released this year thanks to AI - McCartney",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]