[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Paris air show takes off with historic plane order",
    "Inside China's underground market for high-end Nvidia AI chips",
    "Morning Bid: China to cut rates, but by how much?",
    "Intel spends $33 billion in Germany in landmark expansion",
    "Autos & Transportationcategory",
    "US opens safety probe into Hyundai Ioniq 5 EVs over power loss reports",
    "Pixar's 'Elemental' challenge: Originals aren’t breaking big at the box office",
    "US lawmakers to urge automakers to cut reliance on China",
    "Xi, Blinken agree to stabilize US-China relations in Beijing talks",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Podcast: Blinken meets Xi and Chinese bankers rein it in",
    "Their parents made China the world's factory. Can the kids save the family business?",
    "Ukraine prepares 'biggest blow' as it claims recapture of eight villages from Russia",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "Ukraine meets 2 of 7 conditions to launch EU membership talks -sources",
    "Israeli troops, backed by helicopter, kill 5 Palestinians in clash",
    "Ships, planes search for sub that went missing on trip to Titanic wreckage",
    "US judge orders Trump lawyers not to release evidence in documents probe",
    "What is Juneteenth? History of US federal holiday and its celebration explained",
    "UK parliament backs report that Boris Johnson lied over 'partygate'",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Affirmative action, student debt rulings loom at US Supreme Court",
    "Defence, critical tech on agenda as India's Modi heads to US for landmark visit",
    "Biden will announce $600 million in climate investments during California trip",
    "Greek migrant tragedy death toll rises, suspects detained",
    "Exclusive: Citing attack threat, France bans Iranian opposition rally -document",
    "Germany only has 20,000 high explosive artillery shells left - report",
    "Russia bars media from new \"extremism\" case against Navalny",
    "Nigeria's Tinubu removes security chiefs in major reshuffle",
    "International donors pledge $1.5 billion in Sudan aid",
    "Uganda detains 20 rebel 'collaborators' after student massacre",
    "Man fatally stabs police officer outside Brazilian embassy in Tunis",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Thailand justifies talks with Myanmar as key ASEAN members stay away",
    "UN rights chief seeks to establish presence in China and India",
    "Taliban's treatment of women could be 'gender apartheid' - UN expert",
    "Red Bull can win everything but the gap may be closing",
    "Judge who sentenced Nassar calls for national inquiry into Canadian sport",
    "Record-breaker Mbappe leads France to 1-0 win over Greece",
    "Hojlund the hero as Danes draw 1-1 with Slovenia",
    "Americans mark Juneteenth with marches, music and reflection",
    "News junkies turn to TikTok to chart new paths in media",
    "Two sea turtles nest on Spain's Mediterranean coast as waters warm",
    "Rome to open ancient square where Julius Caesar was killed",
    "Visit a museum, go home inked - pop-up tattoo parlour at Dutch Rembrandt House",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]