[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Fed's Daly: two more US rate hikes a 'very reasonable' projection",
    "Wall St falls as hawkish Fed comments sap risk appetite",
    "US Supreme Court rules in favor of Coinbase in arbitration dispute",
    "US business activity growth slows in June but services keep humming along",
    "Indian PM Modi meets tech CEOs as Washington visit concludes",
    "Analysis: With U.S. labor tight, union workers make bolder contract demands",
    "Honda recalling 1.2 million US vehicles for rear camera issue",
    "Relatives mourn Titanic sub deaths after 'catastrophic implosion'",
    "Titanic sub: How is submersible tourism regulated and what’s next for industry?",
    "James Cameron says he wishes he'd sounded alarm over lost submersible",
    "Podcast: A catastrophic end for the Titanic sub",
    "Wagner mercenary chief says Russia's war in Ukraine based on lies",
    "Ukraine signals main push in counteroffensive is yet to come",
    "Ukraine to make personnel changes over bomb shelter deaths",
    "Ukraine's defence minister wants NATO membership 'formula' at Vilnius summit",
    "Starbucks workers at over 150 stores to go on strike over Pride decor dispute",
    "U.S. Supreme Court upholds law against encouraging illegal immigration",
    "Israeli settlers build new outposts amid rising West Bank violence",
    "Analysis: Paris climate summit gives fresh impetus to development bank reform",
    "Biden to sign executive order expanding access to contraception",
    "U.S. Supreme Court allows Biden's shift on immigration enforcement",
    "Greece boat tragedy: At least 350 Pakistanis were onboard - minister",
    "Influencer Andrew Tate to stay under house arrest, court rules",
    "Ukraine's Naftogaz takes Crimea compensation battle against Russia to US",
    "Protesters in Madrid mark anniversary of deadly day at Spain-Morocco border",
    "Sudan's warring factions widen conflict across the country",
    "Congo's Catholic church questions government's election preparations",
    "UN rights chief urges Tunisian leader to stop curbing media freedoms",
    "Eleven candidates to run for president in Zimbabwe",
    "India's opposition parties unite for 2024 national elections, BJP says not worried",
    "Taliban official letter reinforces bar of female aid staff in southern Kandahar",
    "US combat ship to make rare port call in Vietnam amid South China Sea tensions",
    "Australia says no threat from squatting Russian diplomat",
    "United States to host expanded Club World Cup in 2025",
    "No specific concerns for Sports minister as Paris 2024 targeted by investigation, new searches",
    "Paris 2024 flame to be lit on April 16, relay to visit overseas territories",
    "Froome left out of Israel-Premier Tech's Tour de France team",
    "Our top photos of the week",
    "Fairy-tale return for London ballet company’s ‘Cinderella’",
    "Horses, royals and hats: Britain's Royal Ascot in pictures",
    "Moroccan trance collective kick off music at Glastonbury",
    "Sri Lanka readies ailing Thai elephant for flight home",
    "Kesha settles producer Dr. Luke's defamation lawsuit over rape accusation",
    "Givenchy shows dressy tailoring for men at Paris Fashion Week",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]