[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Morning Bid: All eyes on China's PMIs",
    "Risks lie ahead for US credit standing after tentative debt ceiling deal",
    "Nvidia briefly joins $1 trillion valuation club",
    "Fidelity marks down value of Twitter stake again",
    "Purdue Pharma can protect Sackler owners in opioid bankruptcy, court rules",
    "U.S. holiday air passenger travel tops 2019 pre-COVID levels",
    "Noncompete agreements violate US labor law, official says",
    "Ukraine war comes to Moscow as drones strike both capitals",
    "Factbox: Moscow drone attacks: what do we know so far?",
    "As drone war comes to Russia, Muscovites shrug their shoulders and carry on",
    "Russia, Ukraine fail to embrace IAEA plan to protect nuclear plant",
    "Deepfaking it: America's 2024 election collides with AI boom",
    "Podcast: Deep fakes want your vote, and North Korea’s wall",
    "Top AI CEOs, experts raise 'risk of extinction' from AI",
    "AI means everyone can now be a programmer, Nvidia chief says",
    "Chinese tech entrepreneurs keen to 'de-China' as tensions with US soar",
    "Top US Republican McCarthy urges support for debt ceiling deal ahead of key vote",
    "North Korea says satellite launch suffered malfunction",
    "In first presidential campaign swing, DeSantis says U.S. on wrong track",
    "Protests flare as Brazil approves bill limiting recognition of tribal lands",
    "Trump vows to end birthright citizenship for children of immigrants in US illegally",
    "Manhattan prosecutor seeks to keep Trump hush money case in state court",
    "Biden withdraws nomination of official to head US auto safety agency",
    "NATO to deploy more troops to Kosovo to curb violence",
    "Blinken urges Turkey to immediately approve Sweden's NATO accession",
    "UN rights chief tells Britain of concerns over migration bill",
    "Mexico to discuss migration, Central America investment with U.S. homeland security advisor",
    "Lula's call for South American unity faces opposing views on Venezuela",
    "Canada's former Conservative leader says China 'orchestrated' campaign against him",
    "Chile wants to start lithium negotiations with Albemarle soon -minister",
    "Intense clashes in Sudan's capital after ceasefire extended",
    "Central African Republic plans referendum on scrapping presidential term limits",
    "Congo could seize Peru's No. 2 copper spot as Andean output slows",
    "South Africa's Standard Bank says it exceeds 2022 green financing target",
    "Wild shock for Medvedev, Djokovic accused of fanning political flames",
    "Top seed Swiatek enjoys winning start to French Open title defence",
    "Miami win Game 7 to thwart Celtics' comeback bid",
    "Roland Garros goes Wild as Medvedev blown away in French Open first round",
    "Memorial Day across America",
    "Safety in the subway: Life inside Kyiv's citywide bomb shelter",
    "Italy bets on quietest of places to host world-leading telescope",
    "US climber urges better policing to keep Everest free from garbage",
    "In Zimbabwe, female rugby team seeks to keep girls off the streets",
    "North Korea spent the pandemic building a huge border wall",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]