[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Sudan ceasefire deal raises hopes for relief in Khartoum",
    "Pro-government rally in Moldovan capital draws tens of thousands",
    "German police investigate possible poisoning of two Russian exiles",
    "At least 12 dead in stampede at El Salvador stadium",
    "Animal health body urges bird flu vaccination to avoid pandemic",
    "Russian parliament chief proposes Polish truck ban, says Warsaw owes Moscow billions",
    "Iran says 'terrorist' group linked to Israel has been arrested, Nour News reports",
    "At G7, Zelenskiy says Bakhmut destruction has echoes of Hiroshima",
    "Biden unveils new $375 million military aid package for Ukraine",
    "Podcast: What's the G7 to do about China?",
    "Biden sees shift in ties with China 'shortly'",
    "Biden says Republican debt ceiling offer 'unacceptable,' to talk with McCarthy",
    "Yellen says June 1 is 'hard deadline' for raising debt ceiling",
    "White House, Republicans trade barbs as debt talks paused",
    "Oil slips as debt talks pause, Fed warns of high inflation",
    "Russia's war on Ukraine latest: Ukraine says closer to encircling Bakhmut",
    "Alberta wildfire fighters hope rain, cooling bring relief",
    "Morgan Stanley CEO succession underscores Wall Street's diversity gap",
    "AI boom could expose investors’ natural stupidity",
    "Far-right minister says Israel 'in charge' during visit to Jerusalem holy site",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "China says Micron's products fail security review, bars some purchases",
    "Analysis: Vodafone's new CEO faces tough calls to reconnect with investors",
    "Wall St Week Ahead Artificial intelligence gives real boost to U.S. stock market",
    "Murray pulls out of French Open",
    "Arsenal undone in title race by Guardiola mind games, lack of squad depth",
    "MLB roundup: Aaron Judge helps Yankees stun Reds",
    "Manchester City win Premier League title as Arsenal lose",
    "Trevi Fountain water turns black in Rome climate protest",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Italy's Meloni visits flood-hit Emilia-Romagna region",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Cate Blanchett dons habit in Australian director's conversion tale",
    "Julianne Moore, Natalie Portman anchor Cannes competitor 'May December'",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]