[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Shell pivots back to oil to win over investors -sources",
    "Inside OPEC+, Saudi 'lollipop' oil cut was a surprise too",
    "Ex-JPMorgan executive Staley to be questioned under oath about Epstein ties",
    "Tesla jumps as GM deal makes its charging network closer to US standard",
    "Netflix sign-ups jump as U.S. password sharing crackdown kicks off - data",
    "UBS, government sign Credit Suisse loss-sharing deal clearing way for deal to close",
    "France strong-arms big food firms into cutting prices",
    "Trump faces federal charges in classified documents case, adding to legal woes",
    "Trump's Republican rivals slam Justice Dept. 'weaponization' after indictment",
    "Who is Special Counsel Jack Smith in the Trump documents case?",
    "Graphic: Trump's major legal woes",
    "Russia reports heavy fighting in southern Ukraine, Kyiv silent on counterattack",
    "Kyiv says it intercepted call showing Russia blew up Kakhovka dam",
    "Maps: Damage from the Nova Kakhovka dam collapse",
    "Russian invasion increases challenges, risks for Ukraine coal mines",
    "S&P, Nasdaq hit fresh 2023 highs as Tesla rallies",
    "French 'backpack hero' says his faith gave him strength to fight knifeman",
    "Wildfires spread in British Columbia, Quebec stops blaze from hitting hydro plants",
    "Podcast: What’s next for Trump and crypto’s uncertain future",
    "U.S. Supreme Court ruling brightens electoral map for Democrats in 2024",
    "Voting Rights Act survives at US Supreme Court but more challenges loom",
    "Biden heads to North Carolina while Republicans Trump, DeSantis court state",
    "FBI arrests Texas man at center of suspended attorney general Paxton's impeachment",
    "Biden to hold first 2024 campaign event in Pennsylvania",
    "Serbia's Vucic demands Kosovo concessions on autonomy for local Serbs before new vote",
    "Toddlers stable after Annecy attack, Macron hails emergency responders",
    "Julian Assange loses US extradition challenge, will renew appeal next week",
    "Pope 'progressively improving' after surgery, doing some work from armchair",
    "Israeli construction in West Bank no bar to peace, Netanyahu says",
    "Erdogan names Erkan to head Turkey central bank, policy pivot expected",
    "Russia has received hundreds of Iranian drones to attack Ukraine - White House",
    "Saudi Arabia's golf coup highlights Biden's human rights bind",
    "China warns Europe against official ties with Taiwan ahead of minister's visit",
    "South Korea summons China envoy over warning on 'wrong bets' in ties",
    "S.Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Pakistan targets deficit of 6.54% in fiscal year from July",
    "OpenAI CEO encourages South Korea to supply chips in AI boom",
    "U.S. Congress to consider two new bills on artificial intelligence",
    "AI startup Cohere raises funds from Nvidia, valued at $2.2 billion",
    "Autos & Transportationcategory",
    "Mercedes-Benz beats Tesla for California's approval of automated driving tech",
    "US remain top in FIFA rankings before Women's World Cup",
    "Tennis-Swiatek aiming for third title, Muchova out to spoil the party",
    "Heat forward Butler excited about Messi's impact in Miami",
    "Rahane helps India hang tough against Australia onslaught",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Travellers gather for the annual Appleby Horse Fair",
    "Skylines vanish behind wildfire smoke from Canada",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Boy George says he still wants to startle people 'a little bit'",
    "Texas aquarium saves endangered sea turtles stunned by cold water events",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]