[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall Street rises after upbeat economic data, recovery in megacaps",
    "US core capital goods orders beat expectations; shipments rise modestly",
    "Healthcare & Pharmaceuticalscategory",
    "Analysis: Weight loss drug candidates multiply, spurring hopes of better outcomes, lower costs",
    "Obesity drug Wegovy's popularity has US employers rethinking insurance coverage",
    "Autos & Transportationcategory",
    "Lordstown Motors files for bankruptcy, sues Foxconn",
    "Apple fails to end lawsuit over China sales comment by CEO Cook",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Explore the specific ties to slavery among U.S. elite",
    "Reparations: Where slavery’s descendants stand",
    "Resources to explore your own family history",
    "US Supreme Court rejects bid to give lawmakers unchecked power over elections",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "How the grass plays at Wimbledon",
    "Wagner mutiny exposes risks for China's deep Russian ties",
    "Explainer: The China-U.S. military chill: do they talk at all?",
    "Indictment details plan to steal Samsung secrets for Foxconn China project",
    "Podcast: What's next for Putin and Ukraine after mutiny",
    "Trump lawyers to ask federal court to hear NY hush-money case",
    "Trump team lobbying for primary rule changes to boost his 2024 chances",
    "Jan. 6 U.S. Capitol attack preceded by intelligence agency failures - Senate report",
    "Analysis: Mexico's Lopez Obrador has a farm problem",
    "Analysis: Bolivia's creaking big state model rings warning bell in South America",
    "Honduras military takes over prisons after dozens die in riot",
    "Bus of migrants help mother give birth in Mexico before being detained",
    "Tropical forest losses rise in 2022 despite pledge to end them",
    "More than 30 arrested in latest Italy raid against 'Ndrangheta mafia",
    "Prince Harry should get just 500 pounds in phone-hacking case, London court told",
    "EU nature law on knife-edge after losing first vote",
    "Boris Johnson's rules breach over newspaper job shows need for reform - UK ethics body",
    "North Korea says U.S. has 'sinister intention' in rejoining UNESCO",
    "Indonesia starts reparations programme for victims of its bloody past",
    "Monsoon rains to cover all of India earlier than usual, accelerate crop sowing",
    "Thailand's Pita says 'enough support' from Senate to become PM",
    "Manchester United raises annual forecast amid Champions League return",
    "England Cricket Board apologises for discrimination following equity report",
    "Rossi sees Reynolds' winning touch boosting Alpine",
    "Arsenal, Belgian FA among winners selected by UEFA for social change work",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "A Minute With: John Krasinski and 'Jack Ryan' cast on saying goodbye to show",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Lewis Capaldi takes tour break to 'adjust to impact' of Tourette syndrome",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]