[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "India eases curfew in violence-hit Manipur",
    "Australian senator quits Liberal Party after allegations of misconduct",
    "Heavy rains lash east Nepal; one dead, 25 missing",
    "Militants kill 37, abduct six others in attack on Ugandan school",
    "Cyclone leaves 11 dead, 20 missing in southern Brazil",
    "'Vucic out': Serbian protesters keep heat on government",
    "Ceasefire agreed as air strikes pummel Sudanese capital, killing 17",
    "Blinken in China for rare trip amid frosty ties and dim hopes for progress",
    "Exclusive: Xi Jinping tells Bill Gates he welcomes U.S. AI tech in China",
    "US plays down chance of breakthrough from Blinken's China visit",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Death toll rises from flooding after Ukraine dam breach",
    "Ukraine says destroys ammunition depot in Russian-occupied Kherson",
    "Evidence suggests Russia blew Kakhovka dam in Ukraine - New York Times",
    "Putin rebuts key elements of African peace plan for Ukraine",
    "All you need is love, say LGBTQ+ activists on divided Cyprus",
    "India's Modi seeks African Union's full membership in G20",
    "A dozen French police wounded in clashes with protesters opposing rail link in Alps",
    "Key ASEAN members skip Thai-hosted Myanmar talks amid criticism",
    "For groups fighting U.S. opioid crisis, settlement money can be hard to come by",
    "Nidec to form joint venture with Brazil's Embraer to make flying car parts",
    "Binance, SEC strike deal to keep US customer assets in country",
    "Aerospace & Defensecategory",
    "Boeing boosts 20 year outlook for planes due to narrowbody demand",
    "WestJet to shut down Sunwing Airlines",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "McIlroy shuts out the noise to stay in U.S. Open hunt",
    "Scheffler finishes with a flourish, three back of U.S. Open lead",
    "MLB roundup: Royals erase 6-run deficit, stun Angels",
    "Verstappen on pole after wild Canadian GP qualifying",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Seoul hosts large crowds as BTS fans celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]