[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "New Zealand's national broadcaster probes 'inappropriate' editing of Ukraine war stories",
    "At least 10 people killed in bus accident in Australia",
    "After arrest in SNP funding probe, Scotland's Sturgeon says 'I am innocent'",
    "Firefighters make progress, bring some Quebec wildfires under control",
    "EU considering major Tunisia aid package as migration surges",
    "Iran's Khamenei says 'nothing wrong' with a nuclear deal with West",
    "Fighting rages in Sudan's capital after 24-hour truce expires",
    "Ukraine says it retakes village in 'first results' of counterattack",
    "Russia shells boats in Ukraine flood rescue, three dead, governor says",
    "Kherson's unending nightmare: Occupation, shelling and floods",
    "Russia says it hits Leopard tanks, U.S. Bradley vehicles in Ukraine",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "What might the Espionage Act mean for Donald Trump?",
    "How secret were the documents found at Mar-a-Lago?",
    "Biden plans to keep quiet on Trump documents charges",
    "Morning Bid: Central bank bonanza, stocks on a roll",
    "Children who survived five weeks in Colombia jungle will tell own story, father says",
    "Billionaire George Soros hands control of empire to son Alex",
    "BioNTech faces first German lawsuit over alleged COVID vaccine side effects",
    "Portion of I-95 in Philadelphia collapses after vehicle engulfed by fire",
    "Fossil fuel company net zero plans 'largely meaningless,' report says",
    "Germany refusing Intel's additional demand for subsidies for chip plant, Financial Times reports",
    "Illumina CEO Francis deSouza resigns after battle with Icahn",
    "World Bank must drive private investment in climate transition, new chief says",
    "OPEC+ working against 'uncertainities and sentiment,' Saudi energy minister says",
    "EU to try again for renewable energy deal after nuclear row",
    "Nord Stream sabotage probe turns to clues inside Poland, Wall Street Journal reports",
    "Exploration & Productioncategory",
    "Pakistan PM says first discounted Russian crude oil cargo arrives in Karachi",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "Manchester City's Rodri named Champions League Player of the Season",
    "Cagliari score stoppage-time winner to snatch promotion from Bari",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]