[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Inflation in Tokyo stays above BOJ's target for 13th straight month",
    "South Korea May factory output gets boost from cars and chips",
    "Analysis: Threat of 'down rounds' spur private credit funds in Asia",
    "US weekly jobless claims post biggest drop in 20 months as economy shows stamina",
    "What could break as interest rates rise?",
    "Exclusive: Morgan Stanley board considers next CEO while Gorman clears the decks",
    "Exclusive: China's Shein files for U.S. IPO",
    "Justices Jackson, Thomas illustrate heated US debate on race",
    "Where are Russian generals Gerasimov and Surovikin after Wagner rebellion?",
    "Exclusive: US, Dutch set to hit China's chipmakers with one-two punch",
    "How should slavery and its legacy be taught in classrooms?",
    "France unrest: Third night of riots after police shoot teen, officer charged",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: WHO's cancer research agency to say aspartame sweetener a possible carcinogen -sources",
    "Heat wave in Mexico leaves at least 100 dead, authorities say",
    "Trump says may skip first Republican debate, hold rival event",
    "Affirmative action: Key voices in the decades-long US debate",
    "US conservative group led by billionaire Koch to spend big to beat Trump",
    "Jury acquits former Florida deputy of failing to protect students in Parkland school shooting",
    "Judge rejects Donald Trump bid to dismiss E. Jean Carroll's first defamation lawsuit",
    "Exclusive: Panama expects to be struck off financial crime watch list in October",
    "Google to block news in Canada over law on paying publishers",
    "Brazil electoral court close to ending Bolsonaro's political career",
    "UK PM Sunak dealt blow as court rules Rwanda deportation plan unlawful",
    "From behind bars, Greek far-right populist propels ultra-nationalists",
    "Deep distrust of EU leaves Italy's Meloni in a corner over bailout fund",
    "Wagner merch soars in price after abortive mutiny",
    "Meta oversight board urges Cambodia PM's suspension from Facebook",
    "Vietnam jails former coast guard chief for 16 years for embezzlement",
    "Hotter, drier weather likely across Australia for winter and early spring",
    "Three players handed season-long suspensions for gambling violations",
    "Former CONMEBOL president Napout to be released from U.S. jail - lawyer",
    "MLB roundup: Yanks' Domingo German fires perfecto vs. A's",
    "Poland's Majchrzak receives 13-month ban after failing drug test",
    "Our top photos of the week",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Texas scorches under deadly 'heat dome'",
    "Dolly Parton says turning to rock was 'one of the most fun things I've done'",
    "Ready, try to stay steady, go! Men in high heels race at Madrid Pride",
    "Stolen 16th century Vasari letter returned to its Italian home",
    "New Madrid gallery brings royal treasures under one roof",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]