[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "India, Turkey, Nigeria threatened to shut down Twitter, founder says",
    "China cuts short-term borrowing costs as economy slows",
    "Intel in talks to be anchor investor in Arm IPO - source",
    "Asia shares track Wall Street rally with inflation data, Fed in focus",
    "Toyota unveils plans for new battery tech, EV innovation",
    "What challenges does Microsoft's $69 bln Activision deal face?",
    "Exclusive: SoftBank prepares new round of layoffs at Vision Fund",
    "Trump arrives in Florida to face charges, maintains lead in poll",
    "Exclusive: Most Republicans see politics behind Trump indictment -Reuters/Ipsos poll",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Russia launches 'massive missile' attack on Kryvyi Rih in central Ukraine - officials",
    "US concerned North Korea plans to deliver more weapons to Russia",
    "Ukraine's Zelenskiy vows action on air raid shelters",
    "Denver Nuggets beat Miami Heat to win first NBA title",
    "Residents in for months-long displacement as Philippine volcano spews lava, gases",
    "U.S. diplomacy has slowed China's expansion of spying, basing overseas, says Blinken",
    "Twenty-two US troops wounded in Syria helicopter mishap",
    "Golden Globe Awards sold, Hollywood Foreign Press group shut down",
    "China's Xi says willing to begin free trade talks with Honduras",
    "As climate change hits, China weighs new water megaprojects",
    "Fewer than half of Australians back Indigenous panel, poll shows",
    "South Korea's Yoon to visit Paris next week to promote hosting of 2030 expo",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "Body recovered from rubble of Philadelphia I-95 highway collapse",
    "US Senate leaders unveil $107 bln aviation policy bill",
    "Exclusive: Coalition aims to begin Ukrainian F-16 pilot training by summer - Dutch minister",
    "Russia's Putin calls Berlusconi a dear, wise friend and statesman",
    "UK's Sunak faces down critics after Boris Johnson honours row",
    "Scotland's leader won't suspend Nicola Sturgeon from party after arrest",
    "PGA-LIV merger has caused confusion, says U.S. Open holder Fitzpatrick",
    "US senator opens probe into PGA Tour, LIV Golf agreement",
    "Manchester City dance in the rain to celebrate treble",
    "Wrexham plan match in co-owner McElhenney's Philadelphia hometown",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Pat Sajak to retire from record TV stint as 'Wheel of Fortune' host",
    "Jennifer Lawrence says comedy 'No Hard Feelings' lured her back to acting",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]