[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Start of truce period brings lull in fighting to Sudan's capital",
    "Israel set to approve thousands of building permits in West Bank",
    "Attack on Vienna's pride parade prevented, security services say",
    "Analysis: Mali faces spectre of anarchy after demanding UN's departure",
    "Lebanon’s top Christian cleric slams failed attempt to elect a president",
    "Swiss voters approve global minimum corporate tax, climate goals",
    "Key ASEAN members to skip Thai-hosted Myanmar talks amid criticism",
    "Russia reports fierce fighting as African peace mission leaves empty-handed",
    "Ukraine says it destroys ammunition depot in Kherson",
    "Death toll rises from flooding after Ukraine dam breach",
    "Evidence suggests Russia blew Kakhovka dam in Ukraine: NYT",
    "Blinken, Qin hold 'candid' talks, US and China agree to meet again",
    "US plays down chance of breakthrough from Blinken's China visit",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "China 'deplores' UK security minister's Taiwan meeting",
    "Uganda sends more troops to pursue attackers who killed 37 students",
    "How U.C. Berkeley tried to buoy enrollment of Black students without affirmative action",
    "Trump lacked power to declassify secret nuclear arms document, experts say",
    "Reddit’s golden geese foul up its IPO plans",
    "Exclusive: Mystery X9 helicopter takes shape as potential successor to Airbus H145",
    "Aerospace & Defensecategory",
    "Analysis: Lockheed-Airbus face lengthening odds in U.S. tanker re-run",
    "Intel to invest $25 billion in Israel factory in record deal, Netanyahu says",
    "Boeing to lift 737 MAX output to 38/month 'pretty soon'",
    "SVB agrees to sell its investment banking division",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "Murray bags second straight grasscourt title, Boulter wins all-British showdown",
    "Stage set for thrilling U.S. Open finish in LA",
    "Martin piles pressure on Bagnaia with German GP win",
    "MLB roundup: Royals erase 6-run deficit, stun Angels",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "New Pixar film 'Elemental' opens weak for Disney",
    "Coffee research group progresses on naturally decaffeinated varieties",
    "Ticketmaster, others agree to upfront, all-in prices as part of Biden war on junk fees",
    "Saturn's icy moon Enceladus harbors essential elements for life",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]