[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Some Muscovites fearful or shocked as city braced for mutinous mercenaries",
    "White House says Biden spoke with leaders of France, Germany and UK amid developments in Russia",
    "Russia's mercenary revolt: how it evolved",
    "Russia turmoil to fuel market volatility, flight to safety",
    "Erdogan urges Putin to act with common sense",
    "Russia's Rostov, seized by rebels, is important commodity hub",
    "Wagner revolt clouds outlook for its operations in Africa",
    "Rebel Russian mercenaries turn back short of Moscow 'to avoid bloodshed'",
    "Chechen leader offers to help put down Wagner mutiny",
    "Turmoil in Russia: Reactions from foreign governments",
    "In pictures: Rebel Russian mercenaries on the move",
    "US activists rally one year after Supreme Court allowed abortion bans",
    "Republican 2024 hopefuls back abortion limits after Roe v. Wade",
    "Biden slams Republicans on abortion rights a year after Roe repeal",
    "U.S. state abortion legislation to watch in 2023",
    "Canadian safety regulators open probe into fatal loss of Titan submersible",
    "How Christian groups helped parents pull books from some Pennsylvania school libraries",
    "As Canada's wildfires intensify, recruiting firefighters is tougher",
    "Tesla vs. Meta cage fight already has a winner",
    "Special episode: Pride and prejudice – LGBTQ+ around the world",
    "US special counsel seeks delay to start of Trump documents trial until December",
    "U.S. attorney general denies allegations that Hunter Biden tax probe was stymied",
    "Hollywood directors ratify labor pact as writers keep picketing",
    "US House panel critical of Twitter probe to question FTC chair at July 13 hearing",
    "Exclusive: Nissan investigates claims CEO put deputy under surveillance",
    "US opens probe into Ford Explorer recalls over power loss reports",
    "Wall St Week Ahead Lofty valuations on US stocks a growing worry for investors",
    "Forecasts show U.S. earnings decline in second quarter",
    "Alcaraz sets up Queen's final against De Minaur",
    "Vekic and Kvitova win two matches in a day to reach German Open final",
    "Wrexham's Tozer slams EFL towel ban for throw-ins",
    "MLB roundup: Cycle helps Reds run win streak to 12",
    "Our top photos of the week",
    "Fairy-tale return for London ballet company’s ‘Cinderella’",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Hong Kong's international dragon boat races return after 4-year hiatus",
    "Mexico City holds mass celebration for same-sex weddings, gender ID changes",
    "Officine Generale loosens classic styles at Paris Fashion Week",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]