[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Asia shares track Wall Street rally with inflation data, Fed in focus",
    "What challenges does Microsoft's $69 bln Activision deal face?",
    "Intel in talks to be anchor investor in Arm IPO - source",
    "China's central bank cuts short-term borrowing cost for first time since Aug",
    "Exclusive: SoftBank prepares new round of layoffs at Vision Fund -sources",
    "Nasdaq to buy fintech firm Adenza for $10.5 billion, rattling some investors",
    "Analysis: EV charger makers guardedly look to adopt Tesla standard",
    "Trump arrives in Florida to face charges, maintains lead in poll",
    "Exclusive: Most Republicans see politics behind Trump indictment -Reuters/Ipsos poll",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "U.S. diplomacy has slowed China's expansion of spying, basing overseas, says Blinken",
    "Americans should prepare for cyber sabotage from Chinese hackers, US official warns",
    "White House: US shared concerns with Cuba about hosting China spy base",
    "Denver Nuggets beat Miami Heat to win first NBA title",
    "How torture, inaction underpin UAE’s thriving sex trafficking industry",
    "Body recovered from rubble of Philadelphia I-95 highway collapse",
    "Ukraine claims new gains in early phase of counteroffensive",
    "Golden Globe Awards sold, Hollywood Foreign Press group shut down",
    "China's Xi says willing to begin free trade talks with Honduras",
    "Australia mourns 10 wedding guests killed in bus accident",
    "South Korea's Yoon to visit Paris next week to promote hosting of 2030 expo",
    "New Zealand's economy likely in recession as rate hikes take hold",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "US Senate leaders unveil $107 bln aviation policy bill",
    "First woman to serve as New York City's top cop announces surprise resignation",
    "Exclusive: Coalition aims to begin Ukrainian F-16 pilot training by summer - Dutch minister",
    "Russia's Putin calls Berlusconi a dear, wise friend and statesman",
    "UK's Sunak faces down critics after Boris Johnson honours row",
    "Scotland's leader won't suspend Nicola Sturgeon from party after arrest",
    "US senator opens probe into PGA Tour, LIV Golf agreement",
    "PGA-LIV merger has caused confusion, says U.S. Open holder Fitzpatrick",
    "Manchester City dance in the rain to celebrate treble",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Pat Sajak to retire from record TV stint as 'Wheel of Fortune' host",
    "Jennifer Lawrence says comedy 'No Hard Feelings' lured her back to acting",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]