[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Morning Bid: Markets upbeat, China cheer at last",
    "27% of jobs at high risk from AI revolution, says OECD",
    "World's biggest gallium buyer says clients stockpiling",
    "Microsoft's Activision deal gets US judge go-ahead despite White House objection",
    "FTC would face tough appeal of Microsoft-Activision order -experts",
    "Wall St ends up ahead of CPI; JPMorgan, financial shares gain",
    "Exclusive: Mexico's Pemex to lose some 100,000 bpd of crude this month after fire -source",
    "Vermont capital submerged in floodwaters with dam on verge of capacity",
    "Canadian lake sediments reveal start of Earth's Anthropocene age, scientists say",
    "Zelenskiy to meet NATO leaders after membership timeline rebuff",
    "What would happen if Ukraine joined NATO?",
    "US to move ahead with transfer of F-16 jets to Turkey",
    "Russian ex-submarine officer on Ukraine blacklist gunned down",
    "Analysis: Turkey sets new Western tilt in foreign policy as economy weighs",
    "US says it no longer deems Donald Trump immune from E. Jean Carroll lawsuit",
    "US EV market struggles with price cuts and rising inventories",
    "Manson follower Leslie Van Houten released from California prison",
    "Biden's pick for top US general warns on Republican blocking promotions",
    "US climate envoy John Kerry to travel to China next week",
    "US Senator Tuberville chided on Senate floor for white nationalism remarks",
    "Iowa lawmakers debate six-week abortion ban in special session",
    "U.S. students trailing pre-pandemic learning levels, new study shows",
    "Conservative Feijoo emerges as winner from debate ahead of Spanish election",
    "Migration pushes EU population back to growth in 2022",
    "BBC presenter sent abusive messages to second young person, broadcaster says",
    "Kosovo moves to lower tensions in Serb majority area",
    "Thailand prime minister Prayuth retires from politics, nine years after his coup",
    "Nepal retrieves bodies of six killed in helicopter crash",
    "North Korea condemns US plan to send cluster munitions to Ukraine as 'criminal'",
    "Hong Kong plans widespread ban of Japanese sea products",
    "Israel protests flare over Netanyahu's new Supreme Court bill",
    "Israel's disputed judicial overhaul is back, what's new?",
    "Iraq's ancient sites, fragile stability spur new trickle of tourists",
    "Dubai property prices surge at fastest pace since 2014",
    "Djokovic relieved to survive Rublev dogfight",
    "Rublev grateful for Wimbledon support, wants end to 'terrible' Ukraine situation",
    "Ukraine's Wimbledon semi-finalist Svitolina has no time to lose",
    "Sinner says improved physicality, top-10 mentality fuels Grand Slam push",
    "Torrential rain floods streets in New Delhi",
    "Timothee Chalamet debuts as Wonka in prequel's first trailer",
    "Sibling around-the-world aviators set another youth record",
    "South Korean zoo welcomes giant panda twins",
    "Madonna's North American concerts postponed as singer recovers",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]