[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "IKEA bets on remote interior design as AI changes sales strategy",
    "Cryptoverse: Security alert! Altcoins worth $100 billion dropped in hot water",
    "Surprise UK wage jump raises likelihood of higher interest rates",
    "Nikkei closes above 33,000 for the first time in 33 years",
    "European Alzheimer's experts unconvinced by new Eisai, Biogen drug",
    "China cuts short-term borrowing costs to support recovery",
    "New Delhi city to impound bike taxis if Uber, Ola do not comply with ban",
    "Russian missile attack kills six in Ukrainian president's hometown",
    "US concerned North Korea plans to deliver more weapons to Russia",
    "Ukraine's Zelenskiy vows action on air raid shelters",
    "Trump arrives in Florida to face charges, maintains lead in poll",
    "Exclusive: Most Republicans see politics behind Trump indictment -Reuters/Ipsos poll",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Exclusive: Investors may exit consumer goods firms over EU deforestation law",
    "Toyota unveils sweeping plans for new battery tech, EV innovation",
    "Italy prepares to bid farewell to Berlusconi with grand funeral",
    "UK police say three dead in incident in Nottingham",
    "'Outright lie': India denies Dorsey's claims it threatened to shut down Twitter",
    "Residents in for months-long displacement as Philippine volcano spews lava, gases",
    "Taiwan civil defence handbook includes tips on identifying Chinese soldiers",
    "Seven dead as India steps up evacuations ahead of cyclone",
    "China says US eagerness to engage is an 'illusion'",
    "South Korean leader criticises China envoy over 'inappropriate' remarks",
    "China's Xi says willing to begin free trade talks with Honduras",
    "As climate change hits, China weighs new water megaprojects",
    "Fewer than half of Australians back Indigenous panel, poll shows",
    "Japan's Kishida to unveil new child care plan amid election rumours",
    "U.S. officials call spy program key to big cases, but give few details",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "Golden Globe Awards sold, Hollywood Foreign Press group shut down",
    "Draining of Ukraine's Kakhovka reservoir offers a reminder of past and present wars",
    "Ukraine denounces Russian MH17 'rambling conspiracy theory' at World Court",
    "What's next for Italy's coalition after Berlusconi's death?",
    "Vatican court orders climate activists to pay almost 30,000 euros",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "Finals MVP Jokic gives Serbia another sports hero to celebrate",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Mbappe tells PSG he will not renew contract in 2024 - L'Equipe",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Why finding a camp for your kid is this summer's madness",
    "Pat Sajak to retire from record TV stint as 'Wheel of Fortune' host",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]