[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "OpenAI CEO's threat to quit EU draws lawmaker backlash",
    "Impossible Foods accused of misusing private investigators in meat-substitute patent fight",
    "US debt default would impact military readiness, morale: top US general",
    "The end of King Dollar? The forces at play in de-dollarisation",
    "US labor market resilient; declining profits a red flag for economy",
    "Microsoft chief says deep fakes are biggest AI concern",
    "Boeing starts deliveries of reworked 737s, promises pricing discipline",
    "Biden, McCarthy appear near to deal on US debt ceiling as default looms",
    "US triple-A credit rating put on downgrade notice by DBRS",
    "Explainer: What would happen to a Treasury bill after default? Six key questions",
    "US Treasury debt announcement signals to some June 1 is not 'X-date'",
    "Nvidia close to becoming first trillion-dollar chip firm after stellar forecast",
    "Nvidia set to be retail favorite after Tesla's six-month streak",
    "Nvidia's results spark nearly $300 billion rally in AI stocks",
    "Explainer: Why are Nvidia's shares soaring and what is its role in the AI boom?",
    "Wall Street ends higher as Nvidia sparks rush for AI stocks",
    "Defiant Oath Keepers founder gets 18 years in prison, longest 1/6 sentence yet",
    "Russia moves ahead with deployment of tactical nuclear weapons in Belarus",
    "Mexican president urges Latino voters to reject DeSantis after campaign launch",
    "Exclusive: From Russia with gold: UAE cashes in as sanctions bite",
    "Two US citizens dead after catching meningitis in Mexico hospital",
    "Oath Keepers founder sentenced to 18 years, longest for any Jan. 6 defendant",
    "DeSantis to stump in early voting states after rocky presidential launch",
    "US Supreme Court curbs states' property tax 'windfall'",
    "Only half of Germans see Scholz's coalition surviving as policy differences mount",
    "Ukraine shouldn't use US weaponry inside Russia, US general says",
    "US to announce more military aid for Ukraine, mainly ammunition -sources",
    "Technical issue at British Airways causes some flight cancellations at Heathrow",
    "Cambodia tribunal dismisses election appeal by sole opposition party",
    "At APEC trade meeting, union leaders call for new 'balance' with China",
    "U.S. State Department warns China could hack infrastructure, including pipelines, rail systems",
    "Taiwan says software problems delaying new F-16 deliveries",
    "Brazil's Lula summons ministers as Congress seeks to dilute environmental powers",
    "EU remains Cuba´s top trade partner, committed to 'mutual respect,' top diplomat says",
    "Peru protest victims faced racial bias from security forces, Amnesty says",
    "Air Canada ground stop lifted after technical issue",
    "Erdogan says Gulf states sent cash in relief for Turkey",
    "Analysis: UAE steps up pace of solo trade deals in regional economic race",
    "Kurds fear Erdogan win amid sharper nationalist rhetoric",
    "Turkey cenbank's net forex reserves negative for first time since 2002",
    "Last of the 'Big Three' standing, Djokovic eyes Grand Slam record",
    "Michael Jordan Olympic jersey fetches over $3 million at auction",
    "Swiatek braced for tougher path to third Paris title",
    "Arrest warrant issued for five people in El Salvador stadium stampede",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Mexico's Popocatepetl volcano erupts",
    "Scientists identify polar cyclone swirling on mysterious Uranus",
    "France's Breillat back to breaking taboos at Cannes with 'Last Summer'",
    "Wim Wenders gets rare Cannes film double bill: 'It will be an experience'",
    "Dubai camel cloning caters to races, beauty pageants",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]