[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "OpenAI is exploring collective decisions on AI, like Wikipedia entries",
    "JPMorgan's Dimon says bank's plans regarding his tenure are unchanged",
    "Ireland to label alcoholic drinks with health warnings",
    "Inflation has eroded US households' financial security, Fed survey shows",
    "Explainer: Parsing the Fed's path to pause rate hikes",
    "Intel gives details on future AI chips as it shifts strategy",
    "Zoom raises annual revenue outlook on hybrid work boost",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Trump or DeSantis? Neither, say Ukrainian-American voters angry at war stance",
    "Podcast: Is a debt ceiling deal possible?",
    "McCarthy says US debt ceiling talks 'on right path' ahead of Biden meeting",
    "How Wall Street is preparing for possible US debt default",
    "Wall Street ends mixed as investors await debt ceiling talks",
    "Seven states reach 'historic' Colorado River water conservation deal",
    "Russia battles cross-border raid by what Ukraine calls Russian resistance",
    "Bill Gates says top AI agent will replace search, shopping sites",
    "Striking Hollywood writers lament residuals slide",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "US Supreme Court backs three men in Cuomo-era New York corruption cases",
    "Mexico to announce work visa program for Central Americans",
    "Brazil economists lower inflation forecasts, but still too high for central bank",
    "Brazil's Moreira Salles family launch bid for Alpargatas shares",
    "Colombia suspends ceasefire with Estado Mayor Central rebels in some areas",
    "Exclusive: Olympics-Paris 2024 hoping for Olympic flame on Eiffel Tower -source",
    "Real Madrid lodges hate crime complaint over Vinicius incident",
    "MLB roundup: Surging Cardinals down Dodgers for fourth straight series win",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "South African fossils reveal ancient beast's epic journey to oblivion",
    "Sparks return with new 'provocative and challenging' album",
    "Michelle Yeoh introduces mythological heroes in TV show 'American Born Chinese'",
    "'Firebrand' puts spotlight on Henry VIII's sixth wife",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]