[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "China's industrial profits tumble, deepening economic gloom",
    "Asia shares subdued, yen shunned as euro shines",
    "Tesla to hit record quarterly sales in China even as market share shrinks - analysts",
    "US banks scramble on research fees as reprieve on European rules runs out",
    "India flags antitrust concerns with Air India, Vistara merger -sources",
    "Australia's consumer inflation hits 13-month low, adding to rate pause case",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Explore the specific ties to slavery among U.S. elite",
    "Reparations: Where slavery’s descendants stand",
    "Resources to explore your own family history",
    "East Europe NATO allies say Wagner troops in Belarus spell trouble",
    "Senior Russian general knew about Prigozhin's plans - New York Times",
    "Russian missile hits restaurant in Ukraine's Kramatorsk killing at least eight",
    "Morning Bid: Beijing leaves market guessing on yuan",
    "Exclusive: Islamists wield hidden hand in Sudan conflict, military sources say",
    "South Koreans become a year or two younger as traditional way of counting age scrapped",
    "Exclusive: Indian firm used toxic industrial-grade ingredient in syrup - sources",
    "South Korea unveils sanctions on Russian national over North's weapons programmes",
    "Taiwan says it spots two Russian warships off its east coast",
    "Hong Kong film-makers say censorship law spooks investors, actors",
    "Thai protesters acquitted over run-in with queen's motorcade",
    "Australian defence minister in Solomon Islands for security talks",
    "US Supreme Court rejects bid to give lawmakers unchecked power over elections",
    "Trump sues E. Jean Carroll for defamation after jury finds he sexually abused her",
    "Relentless heat wave scorches US South, air quality deteriorates over Midwest",
    "Over $200 billion potentially stolen from U.S. COVID relief programs, watchdog says",
    "Analysis: Belarus leader, long the supplicant, feted in Russia after mutiny role",
    "After Wagner mutiny, jailed Kremlin critic Navalny asks who is the real extremist?",
    "Lithuanian president to meet Zelenskiy to discuss NATO summit",
    "Low water again hampers Rhine river shipping in Germany",
    "Mexico proposes handing control of capital airport to its navy",
    "After 89 days, Colombia lowers activity alert at Nevado del Ruiz volcano",
    "Maverick Mexican politician Xochitl Galvez throws hat in ring for presidency",
    "Carlsen, Chess.com beat Niemann's $100 million suit over cheating scandal",
    "'I'm still cool': US World Cup squad bridges generational divide",
    "WTA roundup: Jessica Pegula, Coco Gauff cruise in England",
    "Bedard offers Blackhawks a chance to fast-track the rebuild",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Coming to a US city near you: An 825-pound Alex Morgan statue",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Lewis Capaldi takes tour break to 'adjust to impact' of Tourette syndrome",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]