[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Energy sector's COVID recovery turns into massive CEO payday",
    "Oil rises on Saudi plan to deepen output cuts from July",
    "Exclusive: Crypto giant Binance controlled ‘independent’ U.S. affiliate’s bank accounts",
    "Analysis: US hotel developers run out of cash as construction lending dries up",
    "Analysis: Strong economy puts Bank of Canada's 4-month rate hike pause in doubt",
    "Dollar bears bide their time as US economic strength persists",
    "Forever in debt: Why U.S. loans are getting longer",
    "Russia says it thwarts big attack in Ukraine",
    "Russian statement on what it says was a major Ukrainian attack",
    "Ukraine retakes part of village near Bakhmut, head of Russia's Wagner says",
    "Papal envoy heads to Ukraine to 'listen carefully' to possible peace plans",
    "Analysis: Crowded 2024 Republican race helps clear way for Trump's nomination",
    "Analysis: Debt-ceiling deal ignores US debt time bomb",
    "Morning Bid: Jobs glow, crude pops, dollar lifts",
    "Exclusive: Musk's Neuralink valued at about $5 bln despite long road to market",
    "India opens rail disaster probe as trains crawl through crash site",
    "Fighter jets chase small plane in Washington area before it crashes in Virginia",
    "Podcast: Has Ukraine’s counter offensive begun?",
    "US Navy shows Chinese warship's 'unsafe interaction' near Taiwan",
    "United Nations 'alarmed' by Hong Kong June 4 detentions",
    "Support dips for Indigenous recognition referendum in Australia, poll shows",
    "Hong Kong journalist wins appeal over accessing records to research attack on protesters",
    "Republican White House hopeful Nikki Haley attacks Trump, DeSantis over Ukraine",
    "McCarthy lauds U.S. debt ceiling deal, House conservatives divided",
    "Body of man missing in Iowa building collapse found",
    "Hollywood directors reach labor pact, writers remain on strike",
    "Shelling, looting in Sudan's capital as military factions battle for eighth week",
    "Senegalese man warned of gun violence the day he was shot dead in riots",
    "Israel demands Egypt help in full probe of deadly attack at border",
    "Slump in global cashew demand pushes Ivory Coast industry to verge of collapse",
    "Jabeur swats aside Pera to move into French Open quarter-finals",
    "Exclusive: Olympics-IBA says has met reform criteria, accuses IOC of intransigence",
    "Gabe Vincent helps Heat beat Nuggets, level Finals at 1-1",
    "Russian Kasatkina feeling bitter after being booed at French Open",
    "Our top photos from the month of May",
    "Peeking into North Korea: Glimpses of daily life from across the border",
    "'Across the Spider-Verse' spins box office with $120.5 million debut",
    "Prince Harry fails to show up for court, will give evidence on Tuesday",
    "After rough start, UN plastic treaty talks end with mandate for first draft",
    "Village garbage man helped unearth ancient bronze statues in Tuscany",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]