[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "S&P 500 and Nasdaq close at highest since April 2022",
    "Nasdaq to buy fintech firm Adenza for $10.5 billion, rattling some investors",
    "Analysis: EV charger makers guardedly look to adopt Tesla standard",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "JPMorgan settles with Jeffrey Epstein victims for $290 million",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "YouTube resolves composer's copyright lawsuit one day before trial",
    "Trump arrives in Florida to face charges, maintains lead in poll",
    "Exclusive: Most Republicans see politics behind Trump indictment -Reuters/Ipsos poll",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "How torture, inaction underpin UAE’s thriving sex trafficking industry",
    "The Post-Pandemic Workforce",
    "Body recovered from rubble of Philadelphia I-95 highway collapse",
    "Ukraine claims new gains in early phase of counteroffensive",
    "U.S. diplomacy has slowed China's expansion of spying, basing overseas, says Blinken",
    "COVID shots should target XBB variants in 2023-24 campaign, US FDA staff say",
    "Biden postpones NATO leader meeting after root canal treatment",
    "US Senate leaders unveil $107B aviation policy bill",
    "Judge in Trump criminal hush-money case can stay, NY ethics panel signals",
    "Biden admin finalizes deal preserving preventive healthcare coverage during legal challenge",
    "Exclusive: Coalition aims to begin Ukrainian F-16 pilot training by summer - Dutch minister",
    "Russia's Putin calls Berlusconi a dear, wise friend and statesman",
    "UK's Sunak faces down critics after Boris Johnson honours row",
    "Scotland's leader won't suspend Nicola Sturgeon from party after arrest",
    "Driver charged after Australia's worst bus accident in decades kills 10 wedding guests",
    "New Zealand's national broadcaster probes 'inappropriate editing' of Ukraine war stories",
    "Indonesia court to rule on voting system change as election nears",
    "Cyclone likely to hit India's west coast, south Pakistan on Thursday",
    "Manchester City dance in the rain to celebrate treble",
    "PGA-LIV merger has caused confusion, says U.S. Open holder Fitzpatrick",
    "US senator opens probe into PGA Tour, LIV Golf agreement",
    "Clarkson delivers 1,000 beers by tractor to Alpine F1 team",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Jennifer Lawrence says comedy 'No Hard Feelings' lured her back to acting",
    "Fans celebrate K-Pop supergroup BTS' 10-year anniversary",
    "Climate change trial pits youths against Montana",
    "Prehistoric bird-wing flutes music to the ears of archaeologists in Israel",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]