[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Breakingviews: Disney can play Scrooge with Florida",
    "Exclusive: India plans action against Google after antitrust breaches",
    "Fed's Powell in spotlight as pressure mounts to 'fish or cut bait' on rates",
    "Japan's Nikkei powers to 1990 'bubble' era high",
    "US debt ceiling deal could stall safety flight fueling megacap rally",
    "Tesco chair Allan to step down after inappropriate behaviour claims",
    "Hyundai, Kia agree to $200 million settlement over US car thefts",
    "Deep in the Amazon, scientists race against time to identify unknown pathogens",
    "Bats carry killer viruses. Scientists suggest ways to cope.",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "Syria's Assad wins warm welcome at Arab summit after years of isolation",
    "Factbox: In Middle East, once improbable ententes set new tone",
    "Podcast:  Assad in Saudi to talk drugs and money",
    "From joy to dismay, Syrians split over Assad's Arab League return",
    "Morning Bid: Hopeful ahead of the weekend",
    "Pent-up demand promises record tourist season for southern Europe",
    "Russian forces dig in at Ukrainian nuclear plant, witnesses say",
    "From sunglasses to milking machines, US halts more exports to Russia",
    "Morgan Stanley CEO Gorman to hand reins to successor within a year",
    "Pakistan police talk 'terms and conditions' for search of ex-PM Khan's home",
    "Thailand's Move Forward says coalition partners need not support amending royal insult law",
    "US, Taiwan reach deal on first part of '21st Century' trade pact",
    "India lifts ban on Krafton's mobile game BGMI",
    "Biden's team reports 'progress' in US debt ceiling talks",
    "US Supreme Court leaves protections for internet companies unscathed",
    "TikTok users file lawsuit to block Montana ban",
    "In New Mexico, an unlikely wildfire thinning alliance",
    "More than half of the world's large lakes are drying up, study finds",
    "Wildfire risk spurs Alberta to close parks, urge caution ahead of holiday weekend",
    "Myanmar junta says 145 died in cyclone, NGOs fear higher toll",
    "Russian forces in retreat near Bakhmut, Ukraine and Wagner say",
    "EU's Michel calls for 'stable and constructive' cooperation with China",
    "Russia's Prigozhin says Bakhmut will not fall in next two days",
    "UK sanctions target Russian metal, 'shady' resellers of Ukraine's grain",
    "Israel's 'Flag March' in Jerusalem rattles Palestinians",
    "Erdogan rival pledges to repatriate all refugees before Turkey runoff",
    "Factbox: Then and now: How Arab states changed course on Syria",
    "MLB roundup: Stars homer in Angels' win over Orioles",
    "Nadal to miss French Open, 2024 likely to be last year of career",
    "Kim has no regrets after crawling through the mud at PGA Championship",
    "Man Utd defender Jones to leave club after 12 years",
    "Our top photos of the week",
    "Spain braces for summer of drought",
    "Style from the Cannes red carpet",
    "Captive breeding helps endangered Iberian lynx population hit record",
    "Mick Jagger's daughter Jade arrested in Ibiza",
    "The bullwhip is back: Harrison Ford in Cannes for 'Indiana Jones' premiere",
    "Japan's Kore-eda: sexual identity not the focus in film 'Monster'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]