[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Sam Bankman-Fried challenges post-extradition charges in Bahamas court",
    "Bunge, Viterra will merge to form $34 billion agri-trading powerhouse",
    "Analysis: Tesla taps brakes on job ads after Musk clamps down on hiring",
    "Boeing delivers 50 jets in May as 737 MAX rebounds from defect",
    "Price war: Amazon excludes rival Temu from competitive price checks",
    "Ryan Cohen scoops up GameStop stock worth $10 mln, shares rise",
    "AMD likely to offer details on AI chip in challenge to Nvidia",
    "Ukrainian flag, Russian corpses evidence of Kyiv's advance in south",
    "Russia releases video of captured German tanks, U.S. fighting vehicles in Ukraine",
    "Putin ponders a question: Should Russia try to take Kyiv again?",
    "Dutch intelligence tipped CIA on alleged Ukraine plan to attack Nord Stream -NOS",
    "Trump supporters gather outside Florida court where he faces charges",
    "Analysis: Why Trump's Republican rivals are lining up behind him to attack the FBI",
    "'Speedy trial' promised by special counsel in Trump case may not go so fast",
    "US consumer price increases slow; underlying inflation sticky",
    "Toyota unveils sweeping plans for new battery tech, EV innovation",
    "Autos & Transportationcategory",
    "Analysis: GM could reap billions by building combustion trucks and SUVs through 2035",
    "Exclusive: India probes bribery claim in toxic syrup tests",
    "Romanian prosecutors change human trafficking charge against Andrew Tate",
    "UK police arrest murder suspect after three bodies found on Nottingham streets",
    "'Goodbye President': Berlusconi fans pay tribute to late leader",
    "Kosovo PM presents plan to defuse tensions in Serb-majority area",
    "Britain's COVID-19 inquiry hears government was under-prepared",
    "Biden to tap tech, climate executives in California fundraising trip",
    "U.S. to renew deportation relief for more than 300,000 immigrants",
    "Trump documents case: What are the charges and how can he defend against them?",
    "U.S. Transportation chief pledges support for Philadelphia after highway collapse",
    "Neo-Nazi groups multiply in a more conservative Brazil",
    "Human rights body finds Cuban gov't responsible in 2012 deaths of dissidents",
    "Mayor of Mexico's Tijuana moves into barracks for safety after threats",
    "Colombia ex-candidate Zuluaga violated law with funds from Odebrecht -AG",
    "Sudan's warring factions not taking advantage of Jeddah talks for agreed truce goal -US",
    "US lawmakers call for S.Africa to lose summit over Russia ties",
    "Nigeria swears in lawmakers, focus shifts to president's cabinet nominees",
    "Titan of Cameroon's opposition politics John Fru Ndi dies at 81",
    "McIlroy grouped with Koepka as PGA-LIV battle set to continue at US Open",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "Djokovic returns to world number one, Nadal out of top 100",
    "PREVIEW Cricket-Australia braced for England storm with Ashes on the line",
    "Ukrainian president's hometown hit by deadly Russian missile strike",
    "The art of parkour in 18 surreal photos",
    "'Last' Beatles record to be released this year thanks to AI - McCartney",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "Disney's Pixar seeks return of box office magic with 'Elemental'",
    "Fans celebrate K-Pop supergroup BTS' 10-year anniversary",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]