[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Methane hunters tap new technology to reshape policing of US greenhouse emissions",
    "Russia considers gasoline export ban, sources say",
    "Meta sells Giphy to Shutterstock to comply with UK regulator order",
    "Standard Chartered CEO: Credit Suisse sale to UBS was 'surprising'",
    "EU seeks top court backing in $14 billion tax fight against Apple",
    "Judge throws out shareholder lawsuit against Elon Musk over Twitter buyout",
    "Lowe's reinforces wavering home improvement demand with forecast cuts",
    "Binance commingled customer funds and company revenue, former insiders say",
    "First set of global rules for crypto sector unveiled by watchdog",
    "Cryptoverse: Busy bitcoin births new breed of crypto",
    "Jester or rebel? Mercenary Prigozhin lays bare the strains of Putin's war",
    "Russia says cross-border attack from Ukraine has been crushed",
    "Factbox: Who are the armed fighters in Russia's Belgorod region?",
    "Morning Bid: Fed hawks re-emerge, dollar pumped",
    "Shell CEO shielded by security as climate protesters try to storm shareholder meeting",
    "Analysis: To vanquish Trump, DeSantis needs to build an unwieldy coalition",
    "Aides hunt for U.S. debt ceiling deal with markets on edge",
    "Podcast: DeSantis’ challenge, a Pacific pact and commingling at Binance",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Trump to be personally ordered not to disclose evidence in hush money case",
    "US safety board seeks answers on runway near-miss incidents",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "Belarus accused of role in transfers of Ukrainian children",
    "Harry loses bid to challenge decision not to allow him to pay for UK police protection",
    "Greece on track for new vote with leftists unable to form coalition",
    "Portugal police search dam for Madeleine McCann's remains, 16 years on",
    "India makes tests mandatory for cough syrup export after overseas deaths",
    "Overseas Indians flock to Modi's rally in Sydney",
    "Pakistan's ex-PM Imran Khan questioned on graft charges - lawyer",
    "Beer-loving Thai lawmaker takes aim at $14 billion booze industry duopoly",
    "Sudan ceasefire in danger as residents report fighting, warplanes",
    "Protesters in Ethiopia's Tigray demand withdrawal of outside forces",
    "South African rand steady after mini-recovery",
    "Congo registers around 43.9 million voters for December general election",
    "Turkish opposition calls Erdogan a 'fabricator' over doctored video",
    "Exclusive: Lebanon set to be grey-listed by financial crime watchdog",
    "Saudi Arabia's energy minister warns speculators ahead of OPEC+ meeting",
    "Most Gulf markets subdued on weaker Asia, volatile energy prices",
    "MLB roundup: Dodgers outslug Braves in series opener",
    "Exclusive: Paris 2024 hoping for Olympic flame on Eiffel Tower",
    "Spain arrests 7 after racist incidents targeting Vinicius Jr",
    "Stefan Wilson ruled out of Indianapolis 500 after crash",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Disgraced Australian-born former entertainer Rolf Harris dead at 93",
    "From mangoes to luxury watches, Indians look to offload 2,000-rupee notes",
    "Milan photo exhibition reveals lives of women in Iran",
    "Schwarzenegger is back in 'FUBAR,' his first TV series",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]