[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Ball Corp explores sale of aerospace unit for more than $5 billion",
    "Humana joins UnitedHealth in flagging cost hit from rising surgeries",
    "S&P 500 ends lower as Microsoft recedes from record high",
    "Exclusive: Twitter to focus on video, commerce in business revamp",
    "Deutsche Bank $75 million settlement with Epstein accusers wins preliminary approval",
    "Twinkies-maker Hostess fined over preventable amputation of worker's fingertip",
    "Fed policymakers deliver hawkish vibe after pause decision",
    "Putin says Russia positions nuclear bombs in Belarus as warning to West",
    "African leaders start peace mission in Ukraine despite Russian missile barrage",
    "Ukraine advancing in the south: military chiefs",
    "NATO meeting fails to approve first defense plans since Cold War",
    "Exclusive: Mondelez 'singled out' in boycott over Russia business, exec says",
    "Xi Jinping meets Bill Gates in China, calls him 'an old friend'",
    "Daniel Ellsberg, who leaked 'Pentagon Papers,' dies at 92",
    "Lawyer splits with Trump in CNN case, citing 'irreconcilable differences'",
    "U.S. Energy Dept gets two ransom notices as MOVEit hack claims more victims",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Flags lowered, relatives brace for bad news as 15 elders die in Canada crash",
    "Bolsonaro aide sought legal advice for Brazil coup, police say",
    "Mexico swelters as 'atypical' heat wave grips nation",
    "Mexico interior minister steps down to vie for presidential bid",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Protests planned for Modi's US visit over India's human rights",
    "US imposes visa restrictions on Uganda officials after anti-LGBTQ law",
    "U.S. Supreme Court allows Justice Department to toss whistleblower cases",
    "Pope Francis leaves hospital 'in better shape than before'",
    "IAEA's Grossi: Water for cooling a priority at Zaporizhzhia nuclear plant",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "Ethics body accuses UK's Johnson of new breach for taking newspaper job without vetting",
    "India cyclone: casualties averted with early warnings and timely evacuation",
    "Exclusive: Thailand seeking to re-engage Myanmar junta with ASEAN meeting",
    "Taliban's central-bank governor meets Chinese envoy to discuss banking ties",
    "Indian minister's home set ablaze in violence-hit Manipur state",
    "MLB roundup: Shohei Ohtani wins, homers in Texas",
    "Clark shines, McIlroy heats up midway through U.S. Open second round",
    "NBA suspends Morant 25 games over alleged firearm video",
    "Rapinoe expected to make swift comeback after calf injury, says OL Reign coach",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Valentino returns to Milan Fashion Week with flowery menswear show",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]