[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Japan regulator sounded out top domestic banks about China risks, sources say",
    "Stocks rally stalls, eyes Powell testimony for rate clues",
    "Goldman Sachs cuts China growth forecast as property slowdown bites",
    "JD.com sales during China shopping festival better than expected -analysts",
    "McDonald's Japan hikes prices in city centres as costs bite",
    "Oil falls on China growth uncertainties",
    "Indonesia, SpaceX launch satellite to boost internet connectivity",
    "Xi hails 'progress' as he meets Blinken during rare China trip",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Olaf Scholz faces tricky balancing act in Germany-China talks",
    "Podcast: Blinken meets Xi and Chinese bankers rein it in",
    "Ukraine says eight villages retaken from Russian forces in two weeks",
    "Ukraine targets initial $40 billion for 'Green Marshall Plan'",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "China seen cutting key lending benchmarks as economy slows",
    "Their parents made China the world's factory. Can the kids save the family business?",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Russia says one of its warships rescued 68 passengers from boat in Mediterranean",
    "Paris air show returns with jets and missiles in demand",
    "Scores die in northern India as heat wave scorches region",
    "Australian Senate paves way for landmark referendum on Indigenous voice in constitution",
    "Thais justify talks with Myanmar as key ASEAN members stay away",
    "Cathay Pacific to hire cabin attendants from mainland China from July",
    "UK lawmakers set to back report that Boris Johnson misled them over 'partygate'",
    "Russia's Navalny defends himself in court against new extremism charges",
    "Spain's conservative PP party widens lead ahead of national election, poll shows",
    "Biden will announce $600 million in climate investments during California trip",
    "Affirmative action, student debt rulings loom at US Supreme Court",
    "Trump lacked power to declassify secret nuclear arms document, experts say",
    "How U.C. Berkeley tried to buoy enrollment of Black students without affirmative action",
    "Hollywood ending for U.S. Open champion Clark",
    "Defending champions U.S. beat Canada in CONCACAF Nations League final",
    "Wimbledon 2023 women's contenders: Who are the emerging players to look out for?",
    "Alcaraz hopes to quickly adapt to grass after Paris disappointment",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Coffee research group progresses on naturally decaffeinated varieties",
    "Ticketmaster, others agree to upfront, all-in prices as part of Biden war on junk fees",
    "Saturn's icy moon Enceladus harbors essential elements for life",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]