[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US producer inflation subsides as energy, food prices fall",
    "Autos & Transportationcategory",
    "Macron to meet Elon Musk in Paris to talk Tesla investment",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "US lawmakers seek new law to protect TikTok user information",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Shell boosts dividend, steadies oil output under new CEO's plan",
    "Health insurers slammed after UnitedHealth says more surgeries driving up costs",
    "Belarus starts taking delivery of Russian nuclear weapons",
    "Analysis: Ukraine counteroffensive takes shape but main test still to come",
    "Russian soldiers' corpses line road into liberated Ukrainian village",
    "Russia now has free hand to destroy undersea communications cables, Putin ally says",
    "Trump faces difficult odds in documents case",
    "What happens next for Donald Trump after latest indictment?",
    "Podcast: Trump’s not guilty plea",
    "E. Jean Carroll can pursue $10 million lawsuit against Trump, judge says",
    "Fed likely to punt rate hike into the summer wind",
    "Scores drown, countless missing in migrant shipwreck off Greece",
    "Bill Gates in China: Microsoft co-founder to meet Xi Jinping",
    "Weather office warns of floods as India, Pakistan brace for cyclone",
    "U.S. farm agency to better verify antibiotic use claims on meat",
    "Berlusconi's funeral: Ex-PM divides Italy even in death",
    "Russia calls Ukraine's MH17 accusations at World Court 'fiction'",
    "Germany calls China a growing threat as it steps up focus on security",
    "Serbian arrest of three Kosovo police officers triggers new row",
    "Trump's defense team still taking shape as he appears in court",
    "US House resumes passing bills amid Republican infighting",
    "US drug overdose deaths top 109,000 in the past year",
    "Darfur cities under fire as Sudanese war spreads",
    "Ugandan law widens Anglican Church rift over LGBTQ rights",
    "Kenyan president's tax hikes alienate his 'hustler' base",
    "Zimbabweans hit by rising prices as local currency plummets",
    "Candidates enter race for Ecuador's crowded early elections",
    "Venezuelan asylum seekers tripled in 2022, UN agency says",
    "Clooney Foundation sues Venezuela over alleged human rights abuses",
    "El Salvador consolidates local governments, opposition warns of power grab",
    "'In principle, I'm done', Messi unlikely to play at 2026 World Cup",
    "I didn't ask to be sold to Real Madrid, says Mbappe",
    "MLB roundup: A's top Rays on 'reverse boycott' night",
    "PGA Tour, LIV golf deal needs close DOJ scrutiny, senators say",
    "Red carpet style at The Flash premiere",
    "Italy bids farewell to Berlusconi",
    "Harry Potter park in Tokyo hopes to enchant Asian fans",
    "Cormac McCarthy, dark genius of American literature, dead at 89",
    "Japanese wrestler moves to Senegal to master ancient martial art",
    "To Hel and back? Not on bus 666 after Polish operator changes number",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]