[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Wall Street ends mixed as investors await debt ceiling talks",
    "Morning Bid: PMIs could knock stocks off highs",
    "OpenAI is exploring collective decisions on AI, like Wikipedia entries",
    "JPMorgan's Dimon says bank's plans regarding his tenure are unchanged",
    "Ireland to label alcoholic drinks with health warnings",
    "Inflation has eroded US households' financial security, Fed survey shows",
    "Intel gives details on future AI chips as it shifts strategy",
    "Treasury confirms U.S. default as early as June 1 without debt ceiling hike",
    "US debt ceiling talks 'on right path,' McCarthy says before Biden meeting",
    "Podcast: Is a debt ceiling deal possible?",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Trump or DeSantis? Neither, say Ukrainian-American voters angry at war stance",
    "Brazil declares 180-day animal health emergency amid avian flu cases in wild birds",
    "E. Jean Carroll seeks new damages from Trump over post-verdict statements",
    "Seven states reach 'historic' Colorado River water conservation deal",
    "Russia fights cross-border raid that Ukraine says is Russian opposition",
    "Bill Gates says top AI agent will replace search, shopping sites",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "US Supreme Court backs three men in Cuomo-era New York corruption cases",
    "Florida sued for barring Chinese citizens from owning homes, land",
    "TikTok sues Montana after state move to ban app",
    "Novo Nordisk, Pfizer weight-loss pills work as well as shots",
    "Healthcare & Pharmaceuticalscategory",
    "Don't delay reforms to prepare for next pandemic, WHO chief says",
    "Judge tosses some claims in Abbott baby formula litigation",
    "Pfizer's diabetes drug results in similar weight loss levels as Novo's Ozempic",
    "Mexico to announce work visa program for Central Americans",
    "Brazil economists lower inflation forecasts, but still too high for central bank",
    "Brazil's Moreira Salles family launch bid for Alpargatas shares",
    "Colombia suspends ceasefire with Estado Mayor Central rebels in some areas",
    "Exclusive: Olympics-Paris 2024 hoping for Olympic flame on Eiffel Tower -source",
    "Real Madrid lodges hate crime complaint over Vinicius incident",
    "Woods withdraws from U.S. Open while recovering from surgery",
    "MLB roundup: Surging Cardinals down Dodgers for fourth straight series win",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "South African fossils reveal ancient beast's epic journey to oblivion",
    "Sparks return with new 'provocative and challenging' album",
    "Michelle Yeoh introduces mythological heroes in TV show 'American Born Chinese'",
    "'Firebrand' puts spotlight on Henry VIII's sixth wife",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]