[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Nasdaq to acquire financial software maker Adenza for $10.5 bln",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Exclusive: Broadcom set to win EU nod for $61 bln VMware deal, sources say",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "YouTube resolves composer's copyright lawsuit one day before trial",
    "Healed from the pandemic, U.S. job market may face fresh wounds from the Fed",
    "How torture, inaction underpin UAE’s thriving sex trafficking industry",
    "Trump to fly to Florida to face charges in documents case",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "What might the Espionage Act mean for Donald Trump?",
    "The Post-Pandemic Workforce",
    "Ukraine reports new gains in early stages of counteroffensive",
    "JPMorgan to pay $290 million to settle with Epstein victims - source",
    "Silvio Berlusconi: former Italian prime minister has died at 86",
    "Analysis: EV charger makers guardedly look to adopt Tesla standard",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Philadelphia I-95 highway collapse snarls morning commute",
    "'Livid' US House conservatives poised for next battle with McCarthy",
    "Russia's Putin calls Berlusconi a dear, wise friend and statesman",
    "UK's Sunak faces down critics after Boris Johnson honours row",
    "Exclusive: Coalition aims to begin Ukrainian F-16 pilot training by summer - Dutch minister",
    "Credit Suisse shares close slightly higher on final trading day",
    "North Korea's Kim vows to 'hold hands' with Putin for strategic cooperation",
    "New Zealand's national broadcaster probes 'inappropriate editing' of Ukraine war stories",
    "Driver charged after Australia's worst bus accident in decades kills 10 wedding guests",
    "Thailand's poll body to investigate PM frontrunner Pita",
    "US senator opens probe into PGA Tour, LIV Golf agreement",
    "International Boxing Association to appeal stripping of IOC recognition at CAS",
    "All eyes on Hollywood at U.S. Open drama arrives in LA",
    "MLB roundup: Andrew McCutchen gets 2,000th, Pirates win",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "'Kimberly Akimbo,' Tom Stoppard’s 'Leopoldstadt' among winners on writerless Tony night",
    "Amputee surfer making waves in the sport",
    "Prehistoric bird-wing flutes music to the ears of archaeologists in Israel",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]