[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "OpenAI CEO says 'optimistic' on global AI coordination",
    "Exclusive: Broadcom set to win EU nod for $61 bln VMware deal, sources say",
    "Novartis to buy Chinook for up to $3.5 bln in boost to late-stage pipeline",
    "Billionaire George Soros hands control of empire to son Alex",
    "Ex-Samsung Elec executive accused of stealing secrets for China chip factory",
    "European stocks rise ahead of inflation data, central bank meetings",
    "Silvio Berlusconi, Italy's ex-prime minister and media mogul, dies at 86",
    "Billionaire Berlusconi brought burlesque to Italian politics",
    "Silvio Berlusconi's gaffes, quips and quotes",
    "Ukraine recaptures fourth village in modest counteroffensive gains - Kyiv",
    "UN nuclear watchdog concerned over water levels at Ukraine plant",
    "Chechen force signs contract with Russia's defence ministry that Wagner's Prigozhin refused",
    "Morning Bid: Markets drift ahead of central bank extravaganza",
    "North Korea's Kim vows to 'hold hands' with Putin for strategic cooperation",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Gender biases not improved over past decade, U.N. says",
    "Driver charged after Australia's worst bus accident in decades kills 10 wedding guests",
    "Silvio Berlusconi: former Italian PM’s court cases and legal battles explained",
    "Silvio Berlusconi death: who will take over former Italian PM’s business empire?",
    "Montenegro's pro-EU Europe Now Movement claims victory in snap vote",
    "Swiss police officers on trial over Black man's death",
    "New Zealand's national broadcaster probes 'inappropriate' editing of Ukraine war stories",
    "Thailand's poll body to investigate PM frontrunner Pita",
    "Analysis: India's outsourcing giants cut hiring; disheartening for economy, students",
    "British man detained climbing South Korean skyscraper",
    "Philadelphia bridge collapse may snarl morning commutes in northeast",
    "'Livid' US House conservatives poised for next battle with McCarthy",
    "US House Speaker McCarthy hopes to 'get back on right track' after Conservative revolt",
    "LGBTQ community celebrates Pride in the face of online and offline attacks",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "MLB roundup: Andrew McCutchen gets 2,000th, Pirates win",
    "Manchester City's Rodri named Champions League Player of the Season",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Tony Awards 2023: Highlights and winners",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]