[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US goods trade deficit narrows; retail inventories rise",
    "UBS looks to axe 30% of staff and keep Credit Suisse's domestic business",
    "ECB forum: more tightening to come, top central bank chiefs warn",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Healthcare & Pharmaceuticalscategory",
    "Bayer claims early lead in Parkinson's stem cell therapy",
    "Virgin Galactic set to launch its first commercial rocket plane spaceflight",
    "Following the George Floyd killing, a Reuters journalist explores his own ties to slavery",
    "Explore the specific ties to slavery among U.S. elite",
    "Learn how to trace your own family history",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Exclusive: Top manager at U.S. firm privately sold high-tech in Russia",
    "Putin wanted to ‘wipe out’ Wagner chief Prigozhin during mutiny attempt, says Lukashenko",
    "As Russia teetered, the elite trembled, and some private jets left",
    "Exclusive: Wagner mutineers included Russian convicts freed to fight in Ukraine",
    "Wall St falls as chip stocks slide, Powell sticks to hawkish tone",
    "Paris police shooting:  Macron deplores 'inexcusable'  killing of teenager",
    "Protesters burn Koran at Stockholm mosque on Eid holiday",
    "Exclusive: Nissan installed camera to monitor No. 2's home, sources say",
    "From caterers to cowboy outfitters: Writers' strike hits Hollywood economy",
    "Most Americans support US arming Ukraine, Reuters/Ipsos poll shows",
    "Trump sues E. Jean Carroll for defamation after jury finds he sexually abused her",
    "Former US Marine pleads not guilty in Jordan Neely killing on New York subway",
    "Biden tries to flip skeptical Americans on his economic plan",
    "Cheap Russian drone a menace to Ukrainian troops and equipment",
    "Harry's phone-hacking lawsuit 'entirely speculative', publisher says",
    "Twin sisters among 11 killed in Russian attack on Ukraine's Kramatorsk",
    "Kevin Spacey appears in London court for start of sex offence trial",
    "South Koreans become a year or two younger as traditional way of counting age scrapped",
    "Australian defence minister in Solomon Islands for security talks",
    "Thai protesters acquitted over run-in with queen's motorcade",
    "South Korea unveils sanctions on Russian national over North's weapons programmes",
    "Brazil census shows population growth at its slowest since 1872",
    "Mexico's Sheinbaum leads race for ruling party presidential ticket -poll",
    "Chile assumes pro tempore presidency of Pacific Alliance",
    "Farm boom, fires make Bolivia No. 3 in world for forest loss",
    "Brisbane 2032's long lead-in a double-edged sword",
    "MLB roundup: Shohei Ohtani hits two homers, fans 10",
    "Red Bull ready for a celebration at scenic Spielberg",
    "Lehmann most influential women's player on Instagram ahead of World Cup",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]