[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Woman severely wounded at Sierra Leone opposition HQ after election",
    "Sudan's RSF says it seized police base as fighting rages",
    "Police detain 50 after Pride march in Istanbul",
    "Israel's Ben-Gvir rebukes police over 'collective punishment' of settlers",
    "Germany's far-right AfD wins vote to lead district for first time",
    "Russian jets said to step up strikes on Syrian rebel enclave",
    "Montana bridge collapse sends tank cars into Yellowstone River",
    "US officials see weakened Putin as Russia turmoil reveals 'cracks'",
    "Mercenaries return to bases after challenge to Putin's authority",
    "Zelenskiy discusses Russian turmoil with Biden, Trudeau, Duda",
    "Russia back in investors' focus after weekend mutiny",
    "Trump says 'vital' federal role remains for regulating abortion",
    "U.S. state abortion legislation to watch in 2023",
    "Conservative former judge calls Trump support 'colossal political miscalculation'",
    "US Coast Guard investigating cause of Titanic submersible implosion",
    "One killed, nine injured in roller coaster crash in Sweden",
    "Greek conservatives storm to victory in repeat election",
    "Breakingviews: Canada is calling Meta’s bluff",
    "Cocaine market is booming as meth trafficking spreads, U.N. report says",
    "US special counsel seeks delay to start of Trump documents trial until December",
    "U.S. attorney general denies allegations that Hunter Biden tax probe was stymied",
    "Remains found in California mountains where actor Julian Sands went missing",
    "World economy at critical juncture in inflation fight, central-bank body warns",
    "Russia turmoil to fuel market volatility, flight to safety",
    "Wall St Week Ahead Lofty valuations on US stocks a growing worry for investors",
    "Belgian shot putter Boumkwo runs 100m hurdles to save team from disqualification",
    "Griner named WNBA All-Star for ninth time",
    "Alcaraz claims Queen's title and top ranking",
    "Australia inch towards Ashes test win with England 116-5 chasing 268",
    "In pictures: Rebel Russian mercenaries halt advance on Moscow",
    "Our top photos of the week",
    "Fairy-tale return for London ballet company’s ‘Cinderella’",
    "Elton John to thrill sun-drenched Glastonbury in final UK show",
    "Singapore’s LGBT community feels safer as end of ban brings change",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Hong Kong's international dragon boat races return after 4-year hiatus",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]