[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Fed's Powell says risks more balanced, June policy decision unclear",
    "Breakingviews: Disney can play Scrooge with Florida",
    "Bezos' Blue Origin wins NASA contract to build astronaut lunar lander",
    "India to withdraw 2,000-rupee notes from circulation",
    "Wall St Week Ahead Artificial intelligence gives real boost to U.S. stock market",
    "Exclusive: India plans action against Google after antitrust breaches",
    "Morgan Stanley CEO Gorman to hand reins to successor within a year",
    "Deep in the Amazon, scientists race against time to identify unknown pathogens",
    "Bats carry killer viruses. Scientists suggest ways to cope.",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "US debt ceiling talks pause; negotiators stuck as default date nears",
    "Wall St slips as debt ceiling talks pause",
    "Syria's Assad wins warm welcome at Arab summit after years of isolation",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Russian forces dig in at Ukrainian nuclear plant, witnesses say",
    "From sunglasses to milking machines, US halts more exports to Russia",
    "Pent-up demand promises record tourist season for southern Europe",
    "U.S. Supreme Court dismisses dispute over Title 42 border expulsions",
    "US military leak suspect got offer to bolster intelligence skills",
    "US Supreme Court leaves protections for internet companies unscathed",
    "Woman who called police on Black bird-watcher faces skeptical court in employment appeal",
    "Pakistan ex-PM Imran Khan refuses home search by police, sets his own terms",
    "Thailand's Move Forward says coalition partners need not support amending royal insult law",
    "US, Taiwan reach deal on first part of '21st Century' trade pact",
    "China's Xi unveils grand development plan for Central Asia",
    "Russian forces in retreat near Bakhmut, Ukraine and Wagner say",
    "EU's Michel calls for 'stable and constructive' cooperation with China",
    "Russia's Prigozhin says Bakhmut will not fall in next two days",
    "UK sanctions target Russian metal, 'shady' resellers of Ukraine's grain",
    "More than half of the world's large lakes are drying up, study finds",
    "In New Mexico, an unlikely wildfire thinning alliance",
    "Wildfire risk spurs Alberta to close parks, urge caution ahead of holiday weekend",
    "Myanmar junta says 145 died in cyclone, NGOs fear higher toll",
    "Israel's 'Flag March' in Jerusalem rattles Palestinians",
    "Analysis: Qatar takes diplomatic back seat as Saudi flexes political muscle",
    "Erdogan rival pledges to repatriate all refugees before Turkey runoff",
    "Factbox: Then and now: How Arab states changed course on Syria",
    "MLB roundup: Stars homer in Angels' win over Orioles",
    "USC, NCAA face US agency's claims that college athletes are employees",
    "Kim has no regrets after crawling through the mud at PGA Championship",
    "Man Utd defender Jones to leave club after 12 years",
    "Our top photos of the week",
    "Spain braces for summer of drought",
    "Style from the Cannes red carpet",
    "Soggy Cannes premiere for Turkish director Ceylan's 'About Dry Grasses'",
    "Captive breeding helps endangered Iberian lynx population hit record",
    "Mick Jagger's daughter Jade arrested in Ibiza",
    "The bullwhip is back: Harrison Ford in Cannes for 'Indiana Jones' premiere",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]