[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Wall St rallies on debt ceiling optimism, regional bank rise",
    "US regional bank shares rally after Western Alliance reports deposit growth",
    "Netflix ad tier now has nearly 5 million monthly active users",
    "US supply chain woes shift and persist in 2023",
    "Autos & Transportationcategory",
    "Analysis: Elon Musk's embrace of advertising at Tesla grabs marketers' attention",
    "Walgreens reaches $230 mln opioid settlement with San Francisco",
    "As household budgets tighten, big brands double down in dollar stores",
    "Russia says hypersonic missile scientists face 'very serious' treason accusations",
    "Factbox: What we know about Kinzhal, Russia's hypersonic missile",
    "Kyiv says it shoots down volley of Russian hypersonic missiles",
    "Factbox: Why Ukraine is bidding for F-16 jets and will it succeed?",
    "How a deadly bat virus found new ways to infect people",
    "Bat habitat destruction could spark next pandemic",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "We may never know where the COVID pandemic originated",
    "Nine dead in northern Italy floods, Formula One race called off",
    "Montana to become first US state to ban TikTok",
    "Canada's Alberta blanketed by smoke as wildfire-battle continues",
    "New York bike-path attacker sentenced to life after victims confront him",
    "Prince Harry, Meghan say they were pursued by paparazzi in New York",
    "Southern Europe braces for climate change-fuelled summer of drought",
    "U.S. considers new land swap deal in Alaska wildlife refuge",
    "US EPA tightens rules to clean up toxic coal ash at power plants",
    "US appeals judges express support for opponents of abortion pill",
    "Biden, McCarthy push forward towards deal on US debt ceiling",
    "U.S. Supreme Court leaves in place Illinois assault weapons ban",
    "Man charged in baseball bat attack on two U.S. congressional staffers",
    "Mexican president backs referendum on electing Supreme Court justices",
    "El Salvador forces surround town in north after police killing",
    "Brazil boosts bird flu defense to protect world's top chicken industry",
    "Explainer: Ecuador's Lasso dissolved the legislature. What comes next?",
    "EU's Borrell asks for 3.5 bln boost to fund used for Ukraine military aid",
    "EU pushes forward with post-Brexit forum for EU, UK financial regulators",
    "Jailed Russian opposition figure Kara-Murza faces 'psychological torture', wife says",
    "As Greek elections loom, parties vie for votes of 'lost generation'",
    "Analysis: Why Hamas was not Israel's target in Gaza airstrikes - this time",
    "Erdogan rival sharpens tone on migrants before Turkey runoff",
    "Turkey opposition contests thousands of ballots after election",
    "Syria's Assad to steal spotlight at Arab summit after years in the cold",
    "Man City outclass Real Madrid to reach Champions League final",
    "Rune upsets Djokovic to storm into Rome semi-finals, injured Swiatek retires",
    "Imola F1 race called off as floods devastate region",
    "FIFA, ECA loosen release dates ahead of women's World Cup",
    "Harry and Meghan: Their life together in photos",
    "Style from the Cannes red carpet",
    "One year since COVID claimed 1 million US lives",
    "China's Gong Li: Michelle Yeoh's success encourages Asian actors",
    "World's oldest near-complete Hebrew Bible sells for $38.1 million",
    "Almodovar's gay Western draws Cannes crowd - even without Pedro Pascal",
    "Spanish mountaineer, 84, injured just short of being oldest to scale world's 14 highest peaks",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]