[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Asian shares fall, yen and yuan near 8-month lows on rate risks",
    "Fed's Powell: Most US policymakers see two or more rate hikes ahead",
    "US health department, law firms latest hit in wide-ranging hack",
    "Analysis: Dollar drought haunts frontier economies",
    "Brands focus on stories in refining China livestreaming to boost profits",
    "Toyota's May global sales jump as parts supply shortage eases",
    "Where are Russia's top generals? Rumours swirl after mercenary mutiny",
    "Russian general Surovikin was sympathetic towards Wagner rebellion, US officials say",
    "As Russia teetered, the elite trembled, and some private jets left",
    "EU leaders to debate Russia mutiny, pledge support for Ukraine",
    "Following the George Floyd killing, a Reuters journalist explores his own ties to slavery",
    "Learn how to trace your own family history",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Morning Bid: CPI test for G3 policy hawks - and lone dove",
    "France: 150 arrests in overnight unrest after teenager killed by police",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: WHO's cancer research agency to say aspartame sweetener a possible carcinogen - sources",
    "Sri Lanka asks dollar debt holders for 30% haircut",
    "Corruption inquiry in Australia uncovers China links to state lawmaker",
    "South Korea picks critic of North's rights record as unification minister",
    "Japan, S.Korea to discuss FX swap deal in first finance talks since 2016",
    "US expects more cooperation with India in South China Sea",
    "Biden tries to flip skeptical Americans on his economic plan",
    "US 2024 hopeful DeSantis targets three federal departments for elimination",
    "Smoke hangs over US Midwest, East, hurting air quality",
    "Chinese spy balloon used US tech to spy on Americans-WSJ",
    "Exclusive: U.S. restarts asylum appointments at Mexico border town despite extortion threat",
    "Argentina announces over $1 bln in credit from World Bank, IDB",
    "Mexico's Sheinbaum advances in race for ruling party presidential ticket, polls show",
    "UN expert condemns 'mass deportations' of Haitians fleeing conflict",
    "Analysis: Italy's insurance holes expose state finances to disasters",
    "UK court to rule if plan to relocate asylum seekers to Rwanda is lawful",
    "Protester burns Koran at Stockholm mosque on Eid holiday",
    "Death toll rises to 12 in Ukraine's Kramatorsk after Russian strike",
    "MLB roundup: Yanks' Domingo German fires perfecto vs. A's",
    "Warner bats through pain to move closer to Sydney farewell",
    "Blackhawks draft Bedard in hopes of turning franchise around",
    "Biles to return to competition in August after two-year hiatus",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Muslims around the world celebrate Eid-al-Adha",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Taylor Swift, Ke Huy Quan, Austin Butler join Hollywood's film academy",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]