[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "Healed from the pandemic, U.S. job market may face fresh wounds from the Fed",
    "Investors in biggest climate pressure group don't like to pressure",
    "Exclusive: Broadcom set to win EU nod for $61 bln VMware deal, sources say",
    "Nasdaq to buy financial software firm Adenza for $10.5 bln",
    "OpenAI CEO says 'optimistic' on global AI coordination",
    "Novartis to buy Chinook for up to $3.5 bln in boost to late-stage pipeline",
    "Silvio Berlusconi: former Italian prime minister has died at 86",
    "Silvio Berlusconi obituary: former Italian PM brought burlesque to politics",
    "Silvio Berlusconi’s memorable quotes and quips as he dies at 86",
    "Chechen force signs contract with Russia's defence ministry that  Prigozhin refused",
    "Ukraine says it recaptured fourth village in modest counteroffensive gains",
    "Morning Bid: Markets in a spin ahead of interest rate decisions",
    "Rich US subsidies may hobble Canada's clean-fuel efforts",
    "AB InBev, Molson Coors dent US craft beer competition with cheaper six-packs",
    "Gender biases not improved over past decade, U.N. says",
    "Podcast: Ukraine’s gains, the great US labor reshuffle and Berlusconi dies",
    "Silvio Berlusconi death: who will take over former Italian PM’s business empire?",
    "Silvio Berlusconi: former Italian PM’s court cases and legal battles explained",
    "Spain begins exhumation of 128 Civil War victims from Franco mausoleum",
    "UK PM Sunak pitches Britain as future home for AI regulation",
    "North Korea's Kim vows to 'hold hands' with Putin for strategic cooperation",
    "New Zealand's national broadcaster probes 'inappropriate' editing of Ukraine war stories",
    "Driver charged after Australia's worst bus accident in decades kills 10 wedding guests",
    "Thailand's poll body to investigate PM frontrunner Pita",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Philadelphia bridge collapse may snarl morning commutes in northeast",
    "'Livid' US House conservatives poised for next battle with McCarthy",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "MLB roundup: Andrew McCutchen gets 2,000th, Pirates win",
    "Manchester City's Rodri named Champions League Player of the Season",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Prehistoric bird-wing flutes music to the ears of archaeologists in Israel",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Tony Awards 2023: Highlights and winners",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]