[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Oil rises on Saudi plan to deepen output cuts from July",
    "Euro zone business growth slowed in May as factories struggled-PMI",
    "Dollar bears bide their time as US economic strength persists",
    "UBS expects to seal Credit Suisse takeover as early as June 12",
    "Saudi pledges big oil cuts in July as OPEC+ extends deal into 2024",
    "Analysis: Smaller UK firms attractive targets for PE buyouts",
    "Signs of de-dollarisation emerge, but dollar top currency: JPMorgan",
    "US Navy shows Chinese warship's 'unsafe interaction' near Taiwan",
    "China says clash with US would be 'unbearable disaster'",
    "Police detain 23 people in Hong Kong on Tiananmen anniversary",
    "Russia says it thwarted major Ukrainian offensive, Kyiv says Moscow spreads lies",
    "Russian police arrest more than 100 Navalny supporters, group says",
    "Morning Bid: Hawkish pause for thought?",
    "Fighter jets chase small plane in Washington area before it crashes in Virginia",
    "Exclusive: Crypto giant Binance controlled ‘independent’ U.S. affiliate’s bank accounts",
    "France rolls out the red carpet for EV battery factories",
    "OpenAI CEO sees 'huge' Israeli role in reducing risks from the technology",
    "Probe into Indian rail disaster opens as trains start running",
    "United Nations 'alarmed' by Hong Kong June 4 detentions",
    "Support dips for Indigenous recognition referendum in Australia, poll shows",
    "Hong Kong journalist wins appeal over accessing records to research attack on protesters",
    "Analysis: Analysis: A crowded 2024 Republican race helps clear the way for a Trump victory",
    "Republican White House hopeful Nikki Haley attacks Trump, DeSantis over Ukraine",
    "McCarthy lauds U.S. debt ceiling deal, House conservatives divided",
    "Body of man missing in Iowa building collapse found",
    "Mexico's rulers scoop up opposition bastion ahead of presidency vote",
    "Panama ex-President Martinelli chosen as RM candidate for elections",
    "Mine collapse kills at least 12 in southern Venezuela",
    "Brazil's president Lula to come to Paris on June 22-23-Macron's office",
    "Gabe Vincent helps Heat beat Nuggets, level Finals at 1-1",
    "MLB roundup: White Sox sink Tigers on walk-off grand slam",
    "Djokovic, Alcaraz on track for French Open showdown, Sabalenka snubs press again",
    "Rodri says he is playing his best as Man City eye European glory",
    "Our top photos from the month of May",
    "Peeking into North Korea: Glimpses of daily life from across the border",
    "'Across the Spider-Verse' spins box office with $120.5 million debut",
    "Prince Harry set for London court appearance",
    "After rough start, UN plastic treaty talks end with mandate for first draft",
    "Village garbage man helped unearth ancient bronze statues in Tuscany",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]