[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall St Week Ahead Investor skepticism turns to optimism as U.S. stock rally rolls on",
    "Reddit’s golden geese foul up its IPO plans",
    "Exclusive: Ball Corp explores sale of aerospace unit for more than $5 billion",
    "Humana joins UnitedHealth in flagging cost hit from rising surgeries",
    "S&P 500 ends lower as Microsoft recedes from record high",
    "Exclusive: Twitter to focus on video, commerce in business revamp",
    "Twinkies-maker Hostess fined over preventable amputation of worker's fingertip",
    "Putin says Russia positions nuclear bombs in Belarus as warning to West",
    "African leaders start peace mission in Ukraine despite Russian missile barrage",
    "Ukraine advancing in the south: military chiefs",
    "NATO meeting fails to approve first defense plans since Cold War",
    "Exclusive: Mondelez 'singled out' in boycott over Russia business, exec says",
    "Xi Jinping meets Bill Gates in China, calls him 'an old friend'",
    "Daniel Ellsberg, who leaked 'Pentagon Papers,' dies at 92",
    "Lawyer splits with Trump in CNN case, citing 'irreconcilable differences'",
    "U.S. Energy Dept gets two ransom notices as MOVEit hack claims more victims",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Australian PM pledges $1.4 bln for afforable homes",
    "Protests planned for Modi's US visit over India's human rights",
    "North Korea starts key party meeting to discuss defence strategy - KCNA",
    "Exclusive: Thailand seeking to re-engage Myanmar junta with ASEAN meeting",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Abortion remains legal in Iowa as top court refuses to revive ban",
    "US imposes visa restrictions on Uganda officials after anti-LGBTQ law",
    "U.S. Supreme Court allows Justice Department to toss whistleblower cases",
    "Stoltenberg likely to be asked to remain as NATO chief for another year",
    "IAEA's Grossi: Water for cooling a priority at Zaporizhzhia nuclear plant",
    "Greece gets new alert about migrant vessel two days after disaster",
    "As Canada mourns 15 killed in road crash, investigators review video footage",
    "Ecuador authorities confiscate pigs, fighting cocks from prison",
    "Bolsonaro aide sought legal advice for Brazil coup, police say",
    "Mexico swelters as 'atypical' heat wave grips nation",
    "Spieth, Thomas headline notable players to miss U.S. Open cut",
    "Buzz and smiles growing after Mercedes tops Canada practice",
    "MLB roundup: Shohei Ohtani wins, homers in Texas",
    "Fowler stays hot to maintain U.S. Open lead",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Valentino returns to Milan Fashion Week with flowery menswear show",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]