[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Tesla's China expansion hits speed bump amid industry overcapacity",
    "Micron says it is committed to China, invests $602 million in plant",
    "BOJ keeps ultra-low rates as it looks past inflation risks",
    "China's President Xi to meet with Bill Gates in Beijing -state media",
    "Google, one of AI’s biggest backers, warns own staff about chatbots",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "US grand jury indicts Pentagon leak suspect Teixeira, Justice Department says",
    "Russia tries to signal normalcy as Ukraine forces advance",
    "Exclusive: African leaders to propose 'confidence building measures' to Russia, Ukraine",
    "US criticizes Russia in annual human trafficking report",
    "Chechen fighters sent to Russian border with Ukraine, leader Kadyrov says",
    "Morning Bid: The UK consumer is feeling the heat",
    "Cheap 'like cabbage' apartments in some Chinese cities draw buyers, and caution",
    "Australia's visa overhaul leaves Chinese millionaires in limbo",
    "Protests planned for Modi's US visit over India human rights",
    "At least 15 killed in Canada highway crash after truck hits bus in Manitoba",
    "Japan hopes to shore up Philippines' defence amid Taiwan conflict fears",
    "South Korea recovers part of rocket used in North's failed satellite launch",
    "Tropical Cyclone Biparjoy: Trees uprooted, roofs blown off in India's Gujarat",
    "China calls European Parliament's Hong Kong resolutions 'publicity stunt'",
    "U.S. nuclear-powered submarine arrives at South Korea's Busan port",
    "Japan parliament passes watered-down LGBT understanding bill",
    "Australia's top companies back Indigenous Voice as public support wavers",
    "Australian senator asked to resign after allegations of misconduct",
    "Chinese e-commerce giants entice cautious consumers with steep mid-year discounts",
    "Brutal heat wave to scorch US South through holiday weekend",
    "Texas panhandle town hit by tornado, deaths reported",
    "E. Jean Carroll defamation trial against Donald Trump set for January 2024",
    "Texas governor signs law shutting diversity offices at public universities",
    "Pope Francis orders ex-aide of Pope Benedict to leave Vatican",
    "How is Ukraine’s counter-offensive going so far?",
    "Tourist dies after attack near Germany's Neuschwanstein Castle",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "US, Iran in talks to cool tensions with a mutual 'understanding'",
    "Qatar to invest $5 billion in Iraq over coming years",
    "Syrians need 'way more' than pledged relief funds, ICRC says",
    "New case against Istanbul mayor another setback for Turkey's fractured opposition",
    "Johnson leads LIV charge at U.S. Open, two back of leaders",
    "Australia recommends testosterone limits for transgender athletes in elite female sport",
    "Exclusive: Brazil forward Vinicius Jr to lead new anti-racism committee, FIFA says",
    "Hamilton expects wins mark to fall to Verstappen",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Our top photos of the week",
    "In shadow of war, Ukrainians flee towns submerged by dam burst",
    "New 'Black Mirror' season begins by tackling actors' anxiety about AI",
    "Take That turn 'Greatest Days' film premiere into a performance",
    "Art Basel draws surge in Asian collectors",
    "Mexico says mass bird deaths likely caused by El Niño's hotter waters",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]