[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Oil rises 1% on Saudi plan to deepen output cuts from July",
    "Apple expected to reveal mixed-reality headset at developer conference",
    "Spotify to lay off 200 workers in podcast division",
    "Global airlines target Europe over green policies",
    "Ferrari does not need to buy other supercar makers, CEO says",
    "Analysis: US hotel developers run out of cash as construction lending dries up",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "Exclusive: Crypto giant Binance controlled ‘independent’ U.S. affiliate’s bank accounts",
    "Who is Binance billionaire Changpeng Zhao?",
    "Russia says it thwarts big attack in Ukraine",
    "Russian statement on what it says was a major Ukrainian attack",
    "Ukraine fights back near Bakhmut, Wagner boss and Russian official say",
    "Papal envoy heads to Ukraine to 'listen carefully' to possible peace plans",
    "S&P 500, Nasdaq climb as Apple hits record high",
    "Analysis: Crowded 2024 Republican race helps clear way for Trump's nomination",
    "Exclusive: Musk's Neuralink valued at about $5 bln despite long road to market",
    "Fighter jets chase small plane in Washington area before it crashes in Virginia",
    "India investigates rail disaster as trains crawl through crash site",
    "Republican White House hopeful Nikki Haley attacks Trump, DeSantis over Ukraine",
    "Former VP Mike Pence officially enters 2024 Republican presidential race",
    "US Supreme Court takes up dispute over 'Trump Too Small' trademark",
    "Trump lawyers visit U.S. Justice Department amid documents probe",
    "NATO says reinforcements arriving in Kosovo after clashes last week",
    "UK's Sunak says plan stopping small migrant boats is working",
    "UK PM Sunak signals support for defence minister's NATO bid",
    "Who are the Freedom of Russia Legion and Russian Volunteer Corps?",
    "US Navy shows Chinese warship's 'unsafe interaction' near Taiwan",
    "Aid group NRC resumes work with female staff in Taliban heartland",
    "Pakistan's embattled Imran Khan faces blackout on local media",
    "United Nations 'alarmed' by Hong Kong June 4 detentions",
    "Shelling, looting in Sudan's capital as military factions battle for eighth week",
    "Senegalese man warned of gun violence the day he was shot dead in riots",
    "Libya political leaders to meet on electoral laws",
    "Israel demands Egypt help in full probe of deadly attack at border",
    "Ruud roars, Jabeur races into French Open quarter-finals",
    "Argentina's Messi keen on rejoining Barcelona, says father",
    "Gauff charges past Schmiedlova into quarter-finals",
    "Saudi wealth fund to take control of soccer star Ronaldo's club",
    "Celebrating Buddha's birthday",
    "Peeking into North Korea: Glimpses of daily life from across the border",
    "Absent Prince Harry not suing publisher because of press 'vendetta', lawyer says",
    "Drought drives economic exodus from Iraq's rivers and marshlands",
    "'Across the Spider-Verse' spins box office with $120.5 million debut",
    "After rough start, UN plastic treaty talks end with mandate for first draft",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]