[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Tesla standard: BTC Power joins move to add to EV chargers",
    "Paris air show: India centre stage as another big jet deal lands",
    "S&P 500 ends lower, pausing rally with Powell testimony in view",
    "Ghosn to fight 'to the end' as sues Nissan in Lebanon",
    "New US home construction surges by most in 3 decades in May",
    "KKR to buy up to $44 billion of PayPal's buy now, pay later loans in Europe",
    "Biden administration taps Google chair for chips research effort",
    "Hunter Biden to plead guilty to tax crimes, reaches deal on gun charge",
    "What are the federal charges against Hunter Biden?",
    "Who is David Weiss, US prosecutor in Hunter Biden case?",
    "Russian air strikes hit Kyiv, other cities; Ukraine reports progress",
    "Ukraine spy chief accuses Russia of 'mining' cooling pond at Zaporizhzhia nuclear plant",
    "Kyiv official named as suspect in bomb shelter deaths probe",
    "Ukraine repatriates three POWs from Russia via Hungary - Kyiv",
    "Modi heads to US to deepen ties, says no doubting India's position on Ukraine",
    "Titanic tourist sub still missing as rescuers race the clock",
    "U.S. judge sets Aug. 14 trial date for Trump in Florida documents case",
    "Ex New York police sergeant convicted of acting as Chinese agent in 'Fox Hunt' trial",
    "25 dead following reported riot in women's prison in Honduras",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Dimon may have ordered JPMorgan's review of Epstein ties, Virgin Islands says",
    "Dozens of US lawmakers urge Biden to raise rights issues with Modi",
    "U.S. Supreme Court revives South Carolina Planned Parenthood defunding case",
    "Factbox: The challenges of recovering the Titanic submersible",
    "Suspected smugglers deny charges over migrant shipwreck off Greece",
    "Influencer Andrew Tate indicted in Romania for trafficking women",
    "Estonia becomes first central European country to allow same-sex marriage",
    "Exclusive: Gambia tightens rules for Indian drugs after cough syrup deaths - letter",
    "Sudanese civilians killed and shot at as they flee Darfur city by foot",
    "Rwandan genocide accused abandons South African bail, seeks asylum",
    "Ugandan students' parents submit DNA samples to ID massacre victims",
    "Australians say they would support Taiwan if China attacked, with limits, poll shows",
    "Himalayan glaciers on track to lose up to 75% of ice by 2100, report says",
    "Taliban treatment of women could be 'gender apartheid', UN expert says",
    "Philippine central bank on hold for rest of year, cut in early 2024",
    "Cummins the hero as Australia edge England in Ashes thriller",
    "Cummins leads Australia to thrilling victory over England",
    "Sports court rejects IBA appeal, IOC condemns leadership language",
    "Ricciardo says racing for Red Bull again would be 'fairytale'",
    "On the frontlines of Ukraine's counteroffensive",
    "Americans mark Juneteenth with marches, music and reflection",
    "'And Just Like That': Carrie Bradshaw is back for spinoff season two",
    "New V&A show 'DIVA' salutes and studies top stars",
    "UN adopts world's first treaty to protect high seas biodiversity",
    "Two sea turtles nest on Spain's Mediterranean coast as waters warm",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]