[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "The end of King Dollar? The forces at play in de-dollarisation",
    "Energy bills to fall for millions of Britons as regulator slashes price cap",
    "Nvidia close to becoming first trillion-dollar chip firm after stellar forecast",
    "AAArrggh! Stocks in debt ceiling danger zone after U.S. rating warning",
    "Europe hits resistance in race to finalise green laws",
    "Autos & Transportationcategory",
    "Vietnam's VinFast recalls first batch of US-bound EVs over safety risk",
    "Facebook owner Meta slashes business teams in final round of layoffs",
    "Exclusive: From Russia with gold - UAE cashes in as sanctions bite",
    "Russian gold shipments to the UAE, China and Turkey",
    "Central Europe firms stake positions in Ukraine reconstruction race",
    "White House, Republicans seek to close US debt-ceiling deal as deadline nears",
    "Morning Bid: AAA fears vie with AI frenzy",
    "Fitch puts US rating on negative watch as debt deadline looms",
    "German economy entered recession as inflation hurts consumers",
    "Analysis: Can Ron DeSantis take his Miami miracle national in 2024?",
    "Kurds fear Erdogan win amid sharper nationalist rhetoric",
    "Chinese hackers spying on US critical infrastructure, Western intelligence says",
    "AI-powered monocle seeks to add sparkle to dull human chats",
    "Oath Keepers founder faces sentencing for sedition in US Capitol attack",
    "With butterflies and candles, Americans remember Uvalde's tragedy",
    "Why is Ron DeSantis in a feud with Disney World Florida?",
    "Ukraine says Russian soldiers replace Wagner units in Bakhmut outskirts",
    "Net migration to UK hits record 606,000 in 2022",
    "German economy minister's office receives envelope with white powder",
    "French PM sues biography publisher for violating her privacy",
    "Taiwan says software problems delaying new F-16 deliveries",
    "North Korea constructing satellite launch pad with 'new urgency' - report",
    "South Korea, US hold largest live-fire drills to respond to 'full-scale' attack",
    "Aerospace & Defensecategory",
    "Cathay needs to boost staff morale, union says, after \"blanket-carpet\" furore",
    "Canada and Saudi Arabia normalize diplomatic relations after 2018 split",
    "Analysis: Mexican president ramps up rhetoric, economic intervention as election nears",
    "Ecuador's Lasso seeks 'national agreement' in August elections",
    "Latam 'property tech' startup La Haus to build up digital infrastructure",
    "Iran says it has successfully test-launched ballistic missile",
    "Suez traffic returns to normal after ship briefly stranded",
    "Exclusive: Erdogan party split on economic plan as Turkey runoff looms, sources say",
    "Dubai camel cloning caters to races, beauty pageants",
    "MLB roundup: 8-run inning lifts O's past Yankees",
    "Spain's Badosa ruled out of French Open with spinal fracture",
    "Four detained for alleged hate crime against Vinicius freed on bail",
    "Head of French Olympic Committee Henriques steps down",
    "Mexico's Popocatepetl volcano erupts",
    "Style from the Cannes red carpet",
    "Reflecting on Uvalde: One Year Later",
    "ABBA's Bjorn and Benny dismiss Eurovision reunion in Sweden next year",
    "Italy's Nanni Moretti directs, stars in Cannes entry 'A Brighter Tomorrow'",
    "French cuisine competes on big screen at Cannes in 'The Pot-au-Feu'",
    "Halle Bailey soaks up good vibes for Ariel role in 'Little Mermaid'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]