[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: EV maker Rivian to adopt Tesla's charging standard",
    "Wall St kicks off week on dour note; Tesla climbs",
    "Ghosn to fight 'to the end' as sues Nissan in Lebanon",
    "New US home construction surges by most in 3 decades in May",
    "KKR to buy up to $44 billion of PayPal's buy now, pay later loans in Europe",
    "U.S. Justice antitrust chief urges update of bank merger guidelines",
    "Biden administration taps Google chair for chips research effort",
    "Hunter Biden to plead guilty to tax crimes, reaches deal on gun charge",
    "What are the federal charges against Hunter Biden?",
    "Russian air strikes hit Kyiv, other Ukrainian cities far from front lines",
    "Biden says threat of Putin using tactical nuclear weapons is 'real'",
    "Ukraine says Hungary ignores requests for contact with transferred prisoners of war",
    "Ukraine builds layered air defences as Russia ramps up strikes",
    "Paris air show: India centre stage as another big jet deal lands",
    "U.S. judge sets Aug. 14 trial date for Trump in Florida documents case",
    "Titanic tourist sub still missing as rescuers race the clock",
    "Modi heads to US to deepen ties, says no doubting India's position on Ukraine",
    "Inside China's underground market for high-end Nvidia AI chips",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Dimon may have ordered JPMorgan's review of Epstein ties, Virgin Islands says",
    "Dozens of US lawmakers urge Biden to raise rights issues with Modi",
    "U.S. Supreme Court revives South Carolina Planned Parenthood defunding case",
    "Influencer Andrew Tate indicted in Romania for trafficking women",
    "Estonia becomes first central European country to allow same-sex marriage",
    "Finland's parliament backs Petteri Orpo as PM, replacing Sanna Marin",
    "Countries back contested EU nature law, seek more biodiversity funding",
    "Rwandan genocide accused abandons South African bail, seeks asylum",
    "Ugandan students' parents submit DNA samples to ID massacre victims",
    "Morocco's OCP plans $7 billion green ammonia plant to avert supply problems",
    "Suspended Nigeria central bank chief facing criminal charges -court papers",
    "Australians say they would support Taiwan if China attacked, with limits, poll shows",
    "Himalayan glaciers on track to lose up to 75% of ice by 2100, report says",
    "Taliban treatment of women could be 'gender apartheid', UN expert says",
    "Philippine central bank on hold for rest of year, cut in early 2024",
    "Alcaraz made to sweat on Queen's Club debut",
    "Ricciardo says racing for Red Bull again would be 'fairytale'",
    "MLB roundup: Joey Votto stars in return for streaking Reds",
    "Five decades on, King says birth of WTA among her greatest moments",
    "On the frontlines of Ukraine's counteroffensive",
    "Americans mark Juneteenth with marches, music and reflection",
    "'And Just Like That': Carrie Bradshaw is back for spinoff season two",
    "New V&A show 'DIVA' salutes and studies top stars",
    "UN adopts world's first treaty to protect high seas biodiversity",
    "Two sea turtles nest on Spain's Mediterranean coast as waters warm",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]