[
    "BBC stars who say they're not the accused presenter",
    "BBC suspends presenter accused of paying teen for sexually explicit photos",
    "Timeline leading up to suspension of presenter accused in BBC scandal",
    "Second eight-year-old girl dies after Wimbledon school crash",
    "Monday's national newspaper front pages",
    "Wimbledon crowd boo Belarusian player after losing to Ukrainian",
    "France bans fireworks sales ahead of Bastille Day after violent riots",
    "Man arrested after two stabbed at hotel and garage in southwest London",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "Everything we know about claims a BBC presenter paid teen for sexually explicit photos",
    "Culture sec avoids questions on BBC scandal",
    "Questions BBC must answer over presenter accused of paying for explicit photos",
    "BBC statement in full as presenter suspended",
    "BBC presenter scandal is sleazy and depressing - but at the heart of this a family is suffering",
    "What we know about claims against BBC star",
    "BBC needs to 'get a grip' says Rachel Reeves",
    "Are daffodils key to cutting methane?",
    "Joe Biden departs US for UK",
    "Cars plough through flooded roads in Sheffield",
    "'Terrorists' will go to 'prison or grave'",
    "Divers attend underwater music show in Florida",
    "Sir Elton John fans lament end of farewell tour",
    "How UK debt compares to other countries",
    "Mob storms LGBT event in Georgia",
    "Orange confetti thrown over former chancellor",
    "Pilot asks volunteers to leave 'heavy' plane",
    "Off-duty police volunteer disarms gunman",
    "Whitehall on Colman accent 'diss'",
    "Palestinian fighter says Israel failed",
    "'Hopefully he never sees Christmas again'",
    "Russian jets 'harass' US drones again",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "PM on use of cluster munitions",
    "Ukrainian medics fight to keep casualties alive",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "MP responds to child mural removal",
    "Mum's anguish at police tweet",
    "Mamoudou Athie on Pixar's Elemental",
    "In full: Blair on the future of AI",
    "Why Sunak and Biden are struggling to keep spark of special relationship alive",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Chart shows how England won the third Test and stayed in the Ashes",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "Just Stop Oil denies link to woman who threw confetti over George Osborne at wedding",
    "Boy, 11, killed and two seriously injured in car crash near Stonehenge",
    "NATO head 'absolutely' confident allies will agree on formal wording about Ukraine's membership",
    "England win third Test against Australia to keep Ashes challenge alive",
    "Cabinet ministers being sued by asylum seekers 'falsely imprisoned' on remote island",
    "Boy dies after e-scooter involved in car crash",
    "Radars detect mile-long swarm of flying ants near UK's south coast",
    "Boohoo takes Revolution row to junior market regulator",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "Yes to trees, not tree-huggers | Rachel Reeves and Victoria Atkins",
    "Company flotations, government bonds and online safety",
    "Stokes: Headingley win 'just the start' as England stay in Ashes fight",
    "Verstappen beats Norris, Hamilton at British GP to extend winning streaks",
    "Azarenka criticises 'drunk, unfair' Wimbledon fans after being booed"
]