[
    "Two children in life-threatening condition after knife attack in southeast France",
    "Boy who died after 'playground incident' named as mosque appeals against 'speculation'",
    "Australia to ban sale and display of Nazi symbols after rise in far-right activity",
    "Actress reveals cancer has spread to her brain",
    "Major Clubcard changes next week - as 'storm clouds gather' for UK housing market",
    "Ex-Mirror royal journalist denies 'closing her eyes' to alleged unlawful activities",
    "Watch reconstructions of key moments from Prince Harry's first day in court",
    "People Harry names in witness statement - from the King and Kate to Caroline Flack and Chelsy Davy",
    "Special programme: Harry in court",
    "Soft-spoken prince kept emotions in check during arduous day",
    "'I'll read about it in his next book' - Piers Morgan hits back at Harry's criticism",
    "'Cocaine parties' and 'beach bum Harry': Which articles have been brought up in the duke's case?",
    "Harry in court: A reconstruction",
    "Prince Harry was 'extremely worried' he would be expelled from Eton over 'untrue' drugs story",
    "Harry v Daily Mirror publisher: What happened on day one?",
    "Multiple children injured in knife attack",
    "Minute silence held for Annecy victims",
    "Zelenskyy visits flood-hit Kherson",
    "Drone delivers water to stranded boy",
    "Kherson floods: 'There are floating land mines here'",
    "Watch as Hawaii volcano erupts",
    "People and pets rescued from Kherson floods",
    "Archaeologists discover Neolithic Road",
    "Prince Harry court case evidence explained",
    "'Mass plague of fish' wash up in Ukraine",
    "Tonnes of glue spills over NZ road",
    "MP mimics Willoughby asking ITV exec: 'Are you okay?'",
    "Bear freed after trapping itself in truck",
    "Rare Florida panther stares through window",
    "Duke of Sussex arrives to give evidence",
    "Sonic boom interrupts music video",
    "Crocodile capture caught on bodycams",
    "Flooded house collapses after dam attack",
    "Fleeing Ukrainians 'under attack'",
    "Kherson main square 'awash with water'",
    "Ukraine War: Major dam attack",
    "'Floodwaters keep rising' in Kherson",
    "This Morning boss's 'ill-judged' remark",
    "Ukraine Dam attack explained",
    "What's included in Prince Harry's evidence?",
    "Ukrainian dam attack 'a war crime'",
    "How 'serial killer' mum was proven innocent",
    "Why is Prince Harry's US visa under scrutiny?",
    "Is Iran helping Russia in Ukraine war?",
    "India train crash: What happened?",
    "PM: 'On me' if inflation not halved",
    "Sunak warns against AI 'scaremongering'",
    "'If my economic policies fail it's on me'",
    "Health sec admits missing targets",
    "'He strangled me' - Andrew Tate 'victim'",
    "Is President Biden too old?",
    "‘I don’t want it to be a witch hunt’",
    "Schofield's lawyer's role 'to get truth out'",
    "'Never interview here!' Johnson's edict",
    "'Iran might be ripping off the Russians'",
    "Sunak insists he won't pass the buck if he misses key inflation pledge | Beth Rigby",
    "Putin's dam attack is a dangerous escalation that takes the war in an even more perilous direction",
    "'Ecological catastrophe': Five environmental impacts of Ukraine dam collapse",
    "Heathrow summer strikes: What you need to know",
    "Before-and-after images reveal scale of devastation after dam destroyed",
    "What we know about stabbing attack in France playground",
    "Man charged over death of 'much-loved' father",
    "Sex education campaigners lose bid to appeal High Court ruling",
    "Teenager in court charged with murder of man in street",
    "Caroline Lucas to stand down as Green Party MP",
    "'This is insane': Revolt from Republican hardliners shuts down Congress until next week",
    "WhatsApp adding Twitter-like ability to follow with new feature",
    "Dramatic changes to polar ice caps revealed on new map of Arctic and Antarctica",
    "Shell hits back at 'misleading' advert ban with warning on renewable energy",
    "Scotland's bottles and cans deposit return scheme 'can't go ahead as planned'",
    "UK set for hottest day of year so far this week",
    "Oil boss running COP28 under pressure to present plan",
    "New York issues air quality alert as wildfire smoke shrouds landmarks",
    "Businessman walks over 2,600 miles from London to Istanbul to promote carbon capture",
    "All aboard the new generation of night trains",
    "Cyclist sets off on 3,000-mile bamboo bike journey",
    "Are sleeper trains a genuine alternative to flying?",
    "Inside the battle to stop new gold mine in the 'wild west of Europe'",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "Controls on crypto adverts, space-comm and Wizz Air",
    "Harry v Daily Mirror publisher: Day three and what happens next",
    "Inflation, Telegraph sale and AI",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "Liverpool sign Mac Allister from Brighton",
    "Sullivan confirms Rice will leave West Ham: 'We promised him he could go'",
    "Transfer Centre LIVE! Who should Rice sign for this summer? Have your say!",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Thursday's national newspaper front pages"
]