[
    "BBC boss admits he has not spoken to presenter; police ask corporation to pause investigation",
    "Stars who've denied it's them",
    "Everything we know about claims",
    "BBC didn't put allegations to presenter for seven weeks, corporation says",
    "Alarming rise in 'zombie drug' deaths in America, weeks after first UK fatality",
    "BBC's highest-paid stars revealed in latest report",
    "Carrie and Boris Johnson announce birth of third child",
    "Olympic champion Caster Semenya wins human rights court appeal over athletics testosterone rules",
    "Fixed mortgage rates now higher than those under Truss's government",
    "Six killed after tourist helicopter crashes near Everest",
    "How the BBC says it handled complaint into presenter",
    "Sunak says BBC presenter allegations 'shocking' but confident 'rigorous' investigation under way",
    "BBC presenter scandal: Young person's parents and lawyer at odds",
    "Everything we know about claims a BBC presenter paid teen for sexually explicit photos",
    "Timeline of events in BBC presenter scandal",
    "Why hasn't the BBC presenter been named publicly?",
    "BBC presenter claims: Questions over trust and transparency",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "BBC presenter should only be named after 'full' investigation, says justice secretary",
    "Culture sec avoids questions on BBC scandal",
    "Questions BBC must answer over presenter accused of paying for explicit photos",
    "BBC statement in full as presenter suspended",
    "Ukraine forces 'strike Russian position'",
    "BBC boss 'not spoken to accused presenter'",
    "Israel's 'day of resistance'",
    "PM: BBC allegations are 'shocking'",
    "Czech leader warns of 'war fatigue'",
    "Elevated road collapse in Bangkok",
    "Back from the Ashes - Broad on pub fire",
    "Oppenheimer film 'puts audience in bunker'",
    "11 million on New England flood alert",
    "Death of pregnant YouTuber left mum 'numb'",
    "Harry Styles hit in face at show",
    "The King welcomes Biden to Windsor",
    "Dramatic rescue over India flood waters",
    "Armed man lunges at Tesco staff",
    "Largest “mirror” in universe",
    "Bulgaria PM on cluster bombs in Ukraine",
    "Ukraine will be 'relieved' after NATO summit",
    "Return of missing Russian general explained",
    "Kremlin confirms Putin met with Prigozhin",
    "General seen for first time since failed mutiny",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "PM on use of cluster munitions",
    "Ukrainian medics fight to keep casualties alive",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "What happened in Zaporizhzhia?",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "Should MPs name BBC presenter?",
    "BBC 'may need to be investigated'",
    "Chesney Hawkes recounts 'horror flight'",
    "MP responds to child mural removal",
    "Wage growth figures defy economic gravity - but there are some signs of a labour market slowdown",
    "Despite major lobbying by Kyiv, speedy accession to NATO is very unlikely",
    "Rail and Tube strikes: Full list of dates and services affected",
    "Landslides, heat warnings and deadly flash floods in week of wild world weather",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Theranos fraudster has prison sentence shortened by two years",
    "Svitolina in quarter-final against Swiatek | Wimbledon live",
    "Rapist condemned by judge for blaming his female victims",
    "Aretha Franklin's sons in legal fight over hidden handwritten wills",
    "EasyJet summer cancellations - what are your rights if your flight is cancelled?",
    "Baby hit by car outside hospital died of severe traumatic brain injuries",
    "Ozempic and Saxenda under investigation in EU",
    "'Gold rush' warning over plans to mine precious metals in deep sea",
    "Extreme heat 'killed more than 60,000 people in Europe last year'",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Scottish isles with sharks and minke whales to receive National Trust protection",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Wage inflation, cricket and business and pensions plans",
    "Robinson included but no Foakes in England squad for fourth Ashes Test",
    "Man Utd 'edging closer' to Onana deal",
    "Wimbledon: Swiatek in quarter-final against Svitolina LIVE!",
    "BBC chief to face reporters - as parents respond to young person rubbishing story | Live updates",
    "Turkey makes U-turn on Sweden as NATO summit begins | War latest",
    "Tuesday's national newspaper front pages",
    "Fixed mortgage rate at 2008 high after exceeding mini-budget peak"
]