[
    "New plans to tackle NHS staffing crisis include shorter degrees and cash for training",
    "Paris riots: A youth told us, in the most blunt terms possible, that we weren't welcome",
    "Royal Air Force unlawfully discriminated against white male recruits in bid to boost diversity",
    "Race must not determine university admissions, US Supreme Court rules",
    "Almost 16 million people hit by postal delays, charity says",
    "Australia invites 16m Britons to work 'down under' after extending working holiday visa age limit",
    "Travis Scott will not face criminal charges over deadly crowd crush at festival",
    "Friday's national newspaper front pages",
    "'He's my baby' - Grandmother of killed teen",
    "CCTV shows burglary destruction",
    "Virgin Galactic's first commercial space flight",
    "RAF diversity recruitment policy 'wrong'",
    "Biden reponds to decision on affirmative action",
    "Iconic Tiffany's NYC store on fire",
    "'That is a witness box, not a soapbox'",
    "Home sec 'fully committed' to Rwanda policy",
    "Police fire teargas at march for French teen",
    "Report finds undercover tactics unjustified",
    "Jacob Rees-Mogg approached by reporters",
    "CCTV shows robbery destruction",
    "Nose gear fails to deploy on plane",
    "Putin makes surprise appearance",
    "Titan debris brought to shore",
    "Rainbow lollies for London Zoo animals",
    "Biden mistakes Ukraine for Iraq",
    "Russian general 'missing' after mutiny",
    "Russia confirms Kramatorsk strike",
    "Drone video of missile aftermath",
    "Victim of Russian missile attack speaks",
    "Children injured in deadly attack on Kramatorsk",
    "Aftermath of deadly Kramatorsk missile strike",
    "Aftermath of deadly Russian strike",
    "Who is connected to Wagner boss?",
    "What is Russia's Wagner group doing in Africa?",
    "What's going on with mortgages?",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "'What's it like living on a bus?'",
    "'Heartbreaking' letter to Primal Scream singer",
    "'I have hopes things will get better'",
    "Business sec 'very concerned' about Thames Water",
    "'We shouldn't be worried about asteroid'",
    "Bereaved families tell Hancock to go away",
    "'Report shows courage of the 4,000 people'",
    "Rwanda scheme 'difficult to justify'",
    "The ghost of Johnson is still haunting Sunak",
    "Royal accounts lift the lid on spending - but do not tell us their true cost",
    "Londoners deserve a better choice of mayoral candidates",
    "Ex-sheriff's deputy found not guilty of failing to protect students at school mass shooting",
    "Sweetener commonly used in diet drinks and chewing gum 'possibly causes cancer'",
    "Tear gas and stun grenades won't stop protests as long as fear persists in Paris",
    "Baby deaths scandal fails to convince government to increase maternity budget",
    "Fears for British car production unless deal struck with EU despite best May in four years",
    "Being lonely may increase risk of heart disease in diabetics",
    "Why is Kevin Spacey in court and what are the allegations against him?",
    "'It's never too late': Naomi Campbell welcomes second child",
    "Ram-raid gang jailed over £1.2m crime spree using high-end stolen cars",
    "Teams on stand-by to pump England's rivers with oxygen to protect fish",
    "Just Stop Oil protesters charged after Lord's pitch invasion",
    "Satellite images show smoke from Canada wildfires across UK - as fresh alerts issued in US",
    "Sadiq Khan denies ULEZ scheme change is part of 'war on motorists'",
    "Warning over invasive pink salmon set to arrive in UK waters",
    "Scottish government scraps controversial marine conservation plan",
    "Government progress on net zero 'worryingly slow', report says",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Sex, Lies and Police spies: The Met's undercover police scandal",
    "The future of Thames Water, the rise of AI and global monetary policy",
    "Sewage, leaks and hosepipe bans: Should our water companies be nationalised?",
    "Crawley misses chance to dine out on fine day for batting",
    "A Glenn McGrath moment? Lyon injury 'doesn't look good'",
    "Man Utd agree £60m deal for Mount",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime."
]