[
    "Sub wreckage 1600ft from Titanic",
    "WhatsApp message reveals debris find",
    "'Two friends of mine are gone'",
    "'We're all very troubled by this'",
    "Moment 'debris field' announced",
    "'Why were you worried about Titan?'",
    "Five major pieces of Titan debris found",
    "The Explorers Club pays tributes to 'dear friend'",
    "Titan crew members would have died 'instantaneously'",
    "The five men who were on board Titan",
    "'Tragic news', foreign secretary pays tribute to Titan passengers",
    "Five men aboard missing Titan sub believed to be dead after 'catastrophic implosion'",
    "'Father Neptune has no patience for humanity': Expert's warning about Titan in 2018 was ignored",
    "Prince Harry 'has taken flak' says Furnish | Beth Rigby interviews",
    "Neo-Nazi group disrupts drag story hour for children",
    "Railway workers announce three fresh strike dates in July",
    "'Ringleader' of gang that 'smuggled thousands of people from Africa to Europe' arrested in UK",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "UK did not have ability to scale up quickly during COVID pandemic - Whitty",
    "Man jailed after murdering love rival and dumping body in wheelie bin in lake",
    "What it's like being in a fully-certified submersible - and how it differs from missing Titan",
    "2018: OceanGate CEO christens Titan sub",
    "Marine traffic shows all Titan search vessels now in place - as submersible robot joins hunt",
    "Fate of missing Titan submersible's passengers may rest on one man",
    "Major search continues for missing sub as half the rescue boats still on way",
    "Timeline, passengers and rescue efforts: What we know of Titanic submersible that vanished",
    "Missing submersible may have suffered 'catastrophic implosion'",
    "'This is how it is going to end' - Scientist recounts trapped Titanic submersible experience",
    "Investigation into underwater noises in search for missing submersible 'negative'",
    "Search for missing Titanic submersible expanded as air supply dwindles",
    "Titanic: What's left to see of the world's most famous shipwreck?",
    "'Like being in space': Why the hunt for Titanic submersible is so difficult",
    "Missing sub: Timelapse shows marine traffic",
    "'Catastrophic loss of pressure chamber'",
    "Cruise on huge Mission Impossible stunt",
    "Crew on missing sub 'have sadly been lost'",
    "Four killed by 'unprecedented' tornado",
    "Singer Ava Max slapped in face",
    "'Like walking round ballroom with flashlight'",
    "Missing sub: 'Expanding search capability'",
    "'Reaching end of search and rescue phase'",
    "Putin: West wants 'fight with Russia'",
    "Before and after: Ukraine reservoir dries up",
    "Ukraine war: Aftermath of Russian missile",
    "'Protect Ukraine, protect freedom'",
    "Sewage tsunami floods Kherson",
    "Russian diplomat quizzed over dam claims",
    "'Supportive' for Ukraine NATO fast track",
    "Is Russia 'preventing access' to dam?",
    "Russia use bomb tank, blogger claims",
    "Ukraine 'destroys ammunition depot'",
    "Sub search reaches critical point",
    "What is a resignation honours list?",
    "'Sticky' inflation explained",
    "What we know about the Titan vessel",
    "How the missing sub saga unfolded",
    "'Time running out' for missing submersible",
    "What's in Labour's Green Energy plan?",
    "'Will this cost you at ballot box?'",
    "Prince Harry is 'doing really well'",
    "Labour has 'five-point' mortgage plan",
    "Schofield reaction 'points to homophobia'",
    "'He came out of hospital with pickaxe'",
    "'Why can't Ukraine use UK missiles?'",
    "Furnish on Rowling: 'I don't agree or approve'",
    "Scale of rate hike is shock therapy for UK's inflation problem | Ed Conway",
    "The descendants of the Windrush generation who changed Britain",
    "How are political parties performing as an election looms? Find out with Sky's live poll tracker",
    "What are the devices that picked up noises in search for missing Titanic sub?",
    "'Bittersweet' 75th Windrush anniversary marked across UK",
    "New drugs to be tested to combat 'cruel and devastating' motor neurone disease",
    "Child in 'critical condition' after car hits pedestrians outside hospital",
    "'Slap in the face': Marvel criticised for using AI to make new show's art",
    "Family of boy, 15, who died at beach call for better safety measures after 'preventable tragedy'",
    "More misery for borrowers after shock hike; experts answer your questions | Interest rates latest",
    "Cost of living crisis a factor in 17% rise in abortions, charity says",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "How modern tech relies on raw materials",
    "Can National Grid really provide emergency energy this winter?",
    "'Very high' risk of wildfires over England and parts of Wales",
    "Windrush: Trevor Phillips assesses the impact 75 years on",
    "Inflation rate stays the same, rebuilding Ukraine and cybersecurity",
    "The far-right is on the rise in Germany, but could it go mainstream across Europe?",
    "Australia on top despite England's Ecclestone-inspired fightback",
    "Dettori claims ninth Gold Cup with Courage Mon Ami",
    "Havertz to have Arsenal medical this weekend | Rice talks continue",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "'Landing frame and rear cover' found at debris field in hunt for missing sub",
    "'Debris is from sub,' says expert"
]