[
    "ITV announces external review over Phillip Schofield's departure from This Morning",
    "Key extracts from ITV boss's letter to culture secretary on Phillip Schofield departure",
    "Applicants seeking to join RAF described as 'useless white male pilots' in leaked emails",
    "Explosion at border crossing; Russian 'spy whale' in Swedish waters | Live updates",
    "UFO sightings meeting at NASA | Live updates",
    "Alec Baldwin given new 'quality of life' with surgery after suffering 'intense chronic pain'",
    "England announce Women's World Cup squad - as big names miss out",
    "13 family members die after eating 'toxic' porridge",
    "Wiegman: 'Everyone is welcome in the game'",
    "Which jobs are overlooked by young people?",
    "DeSantis: Send Biden 'back to his basement'",
    "'If someone needs help you have to help'",
    "England captain revealed for Women's World Cup",
    "Missile debris hits busy Kyiv road",
    "Just Stop Oil activist dragged by police",
    "Injured Swiss cow rescued by helicopter",
    "Sweet-toothed bear raids bakery",
    "Man caught slashing speed camera van's tyre",
    "Terrifying shootout aboard moving bus",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "Crew parachute back to earth after space mission",
    "Car flies through the air at full speed",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Drone 'attack' damages Moscow buildings",
    "Rocket debris hits car in Kyiv",
    "What Kyiv attacks can tell us",
    "Kyiv metro becomes shelter amid air strikes",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "'We're not heading to the 1970s'",
    "'AI could put us in a fragile position'",
    "'Friendship and love' behind Rob Burrow marathon",
    "PM: Govt 'cooperating with COVID inquiry'",
    "Johnson refutes 'COVID rule breaches'",
    "Praise for Mermaid star Halle Bailey",
    "How The Little Mermaid came to life",
    "'An incredible human' Mead on Wiegman",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "UK government not the first to consider food price cap as poorest hit hardest by inflation",
    "The UK trains impacted by strike action this week",
    "The rise and fall of Phillip Schofield: A timeline of his departure from ITV",
    "Chris Christie set to enter Republican presidential nomination race",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Tributes paid to 16-year-old who died after suspected asthma attack at festival",
    "Reason for Venice canal turning bright green revealed",
    "Boris Johnson hands COVID material to Cabinet Office in 'full and in unredacted form'",
    "Sherpa guides rescue freezing climber from Everest 'death zone' in 'almost impossible' mission",
    "Monty Python star Sir Michael Palin among famous faces marking NHS milestone",
    "'Jealous' ex-boyfriend gets life for woman's 'barbaric' murder in alleyway",
    "The Office is getting a post-COVID remake - in Australia with a female lead",
    "Little-known STI may increase risk of cervical cancer in women",
    "Smoke from massive wildfire in Scottish Highlands visible from space",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The 'black gold' that could help fight climate change for centuries to come",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "Burgers, books and mortgages",
    "Migrant crisis: The people found at sea",
    "The price of food, carbon extraction and bowling",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Europa League final: Sevilla vs Roma team news LIVE!",
    "Bright, England included in Lionesses World Cup squad",
    "England's Women's World Cup squad: Meet the Lionesses",
    "8 dedicated sports channels, including Premier League, F1® & more."
]