[
    "Trump indicted for second time, amid allegations he mishandled classified files",
    "Refugee who stabbed British child and five others was denied asylum in France",
    "'Hanging by a thread': Public trust in police has fallen to its lowest level ever, watchdog warns",
    "Israel will do 'whatever we need to do to defend ourselves' against Iran, Netanyahu says",
    "As smoke blankets parts of US, unexpected symptoms of poor air quality revealed",
    "Friday's national newspaper front pages",
    "No matter how this trial goes, this won't be the last we hear of Prince Harry | Adam Boulton",
    "Union calls on DVLA to provide free sanitary products amid cost of living crisis",
    "Ex-Mirror royal journalist denies 'closing her eyes' to alleged unlawful activities",
    "Watch reconstructions of key moments from Prince Harry's first day in court",
    "People Harry names in witness statement - from the King and Kate to Caroline Flack and Chelsy Davy",
    "Special programme: Harry in court",
    "Soft-spoken prince kept emotions in check during arduous day",
    "'I'll read about it in his next book' - Piers Morgan hits back at Harry's criticism",
    "'Cocaine parties' and 'beach bum Harry': Which articles have been brought up in the duke's case?",
    "Harry in court: A reconstruction",
    "Prince Harry was 'extremely worried' he would be expelled from Eton over 'untrue' drugs story",
    "Harry v Daily Mirror publisher: What happened on day one?",
    "'I'm an innocent man,' Trump says",
    "We'll 'do whatever' to defend Israel",
    "Why has Trump been indicted again?",
    "Moments before police sergeant's fatal shooting",
    "Knifeman attacks children in playground",
    "West Ham lift Europa Conference League trophy",
    "Ukraine war day 470: Zelenskyy visits Kherson",
    "Sunak warns alliance will not give up on Ukraine",
    "Did Russia 'blow the dam' early?",
    "‘It’s back to masks in the US'",
    "New York before and after smog",
    "Watch as Hawaii volcano erupts",
    "Drone delivers water to stranded boy",
    "Tonnes of glue spills over NZ road",
    "MP mimics Willoughby asking ITV exec: 'Are you okay?'",
    "Bear freed after trapping itself in truck",
    "Rare Florida panther stares through window",
    "Zelenskyy visits flood-hit Kherson",
    "'People targeted as they try to flee floods'",
    "Kherson floods: 'There are floating land mines here'",
    "Flooded house collapses after dam attack",
    "People and pets rescued from Kherson floods",
    "'Mass plague of fish' wash up in Ukraine",
    "Prince Harry court case evidence explained",
    "This Morning boss's 'ill-judged' remark",
    "Ukraine Dam attack explained",
    "What's included in Prince Harry's evidence?",
    "Ukrainian dam attack 'a war crime'",
    "How 'serial killer' mum was proven innocent",
    "Why is Prince Harry's US visa under scrutiny?",
    "Is Iran helping Russia in Ukraine war?",
    "Knife attack 'happened in front of my kids'",
    "PM: 'On me' if inflation not halved",
    "Sunak warns against AI 'scaremongering'",
    "'If my economic policies fail it's on me'",
    "Health sec admits missing targets",
    "'He strangled me' - Andrew Tate 'victim'",
    "Is President Biden too old?",
    "‘I don’t want it to be a witch hunt’",
    "Schofield's lawyer's role 'to get truth out'",
    "Dangerous times as tensions boil between Israel and Iran over nuclear programme",
    "PM makes some progress with Biden, but promised free trade deal with US is yet to materialise",
    "What to look out for as 'heat health alert' issued in England with temperatures set to rise",
    "'Ecological catastrophe': Five environmental impacts of Ukraine dam collapse",
    "Heathrow summer strikes: What you need to know",
    "'This kind of thing never happens here': Residents shaken after playground stabbing",
    "Diabetes drug could reduce chances of getting long COVID, study suggests",
    "Boy, 15, dies in crash with ambulance after police e-bike pursuit",
    "Sunak and Biden agree 'Atlantic Declaration' to boost economic security",
    "Tearful Ukrainian reunions interrupted by explosions - as Russian troops swim to escape floods",
    "Explosives most likely cause of Ukraine dam collapse, experts say",
    "CCTV footage shows moments before police officer was shot dead",
    "What do we know about the Annecy knife attacker?",
    "El Nino returns and could bring record hot temperatures",
    "World has lost battle to stop glaciers melting and sea level rising, UN meteorological chief says",
    "Climate change is causing more turbulence on flights, say scientists",
    "Canada on course for worst year of wildfires on record",
    "Dramatic changes to polar ice caps revealed on new map of Arctic and Antarctica",
    "Artificial lawns could be banned in Wales, minister says",
    "Shell hits back at 'misleading' advert ban with warning on renewable energy",
    "Scotland's bottles and cans deposit return scheme 'can't go ahead as planned'",
    "UK set for hottest day of year so far this week",
    "Oil boss running COP28 under pressure to present plan",
    "New York issues air quality alert as wildfire smoke shrouds landmarks",
    "Is the Nova Kakhovka dam breach the most significant moment in the war so far?",
    "Controls on crypto adverts, space-comm and Wizz Air",
    "Harry v Daily Mirror publisher: Day three and what happens next",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "Guardiola, 'overthinking' and Man City's final hurdle",
    "On the bus with West Ham as huge crowds turn out for trophy parade!",
    "Vieira: Influence of Man City’s vision | My time in Milan",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Britain's Got Talent star Kerri-Anne Donaldson dies aged 38"
]