[
    "'Tragic end of term for the girls'",
    "Girl dies and woman arrested",
    "Eight-year-old girl killed, police confirm",
    "Resident says incident is 'terrible'",
    "People at the scene 'very stressed' over 'worst possible news'",
    "'Thoughts are with the local community' - London Fire Brigade",
    "Girl dies after Land Rover crashes into primary school",
    "Putin won't 'whack' Prigozhin but he's in Russia - Belarus leader",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Govt loses legal battle over Boris Johnson's COVID Whatsapp messages",
    "Starmer announces education reforms - as big speech interrupted by protesters",
    "Funeral held for teens who died in crash that sparked riot",
    "'Absolutely shell-shocked' parents carry limping girl away from Wimbledon crash scene",
    "Plans for new Iran sanctions regime after 15 'credible threats' to kill or kidnap people in UK",
    "Kevin Spacey blamed actions on being gay, says accuser; actor 'looked disheveled' | Trial latest",
    "What Britons really think about the NHS as UK falls behind other countries",
    "Barclay denies cuts are to blame as he points to three reasons NHS is struggling",
    "NHS honoured at Westminster Abbey",
    "NHS in 'critical condition' at 75 years",
    "First NHS baby says service is 'creaking at the seams'",
    "NHS at 75: Who was founder Aneurin 'Nye' Bevan?",
    "Is life expectancy in your local area higher or lower than average?",
    "NHS at 75: What’s the story for maternity services?",
    "How does the NHS compare globally?",
    "Swimmers flee water after shark spotted",
    "Gun found after police chase rapper",
    "'It's not always about spending more money'",
    "Russian police raid Wagner leader's property",
    "'Labour government takes education seriously'",
    "Protesters interrupt Starmer speech",
    "'Wagner boss back in Russia'",
    "Rollercoaster riders trapped upside down",
    "'Government will appeal Rwanda court decision'",
    "Trapped cows rescued from barn fire",
    "Could AI replace news organisations?",
    "House collapses into China river",
    "Stolen car driven wrong way during chase",
    "Man rescued from train tracks in NY",
    "Woman rescued from burning car",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "Russia to increase military salaries by 10.5%",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "Michael Rosen: NHS model 'not wrong'",
    "'We're not being honest about healthcare'",
    "'How high will NHS waiting list go?'",
    "'You can bank at Natwest, Nigel'",
    "Health secretary: 'The NHS needs to evolve'",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Key questions to the PM were cut short - but that didn't stop Sunak getting skewered",
    "Video: Women at war in Mexico",
    "What we know about the teenager who was shot dead by police",
    "How the junior doctors' strike will affect the NHS and what to do if you need care",
    "Brother on trial accused of sexually assaulting and murdering his sister",
    "Man charged after putting dead companion in freezer and cashing in her pension",
    "Queen adds final stitch to new panel on Great Tapestry of Scotland",
    "Banking lobby says accounts should not be shut for political reasons",
    "Four retired Met officers will not face prosecution over Stephen Lawrence investigation",
    "Peaky Blinders makers 'strongly disapprove' of 'homophobic' video shared by DeSantis campaign",
    "Andy Murray, Katie Boulter and Jan Choinski all in action at Wimbledon today | follow latest",
    "Judge 'appeared on TikTok lip-syncing rap and lying partially dressed in bed'",
    "Chris Pincher facing Commons suspension after groping allegations report",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Currys results, digital transformation and start-up struggles",
    "Could AI make this podcast?",
    "Top 1,000 World Banks ranking and Leicester City fined",
    "Robinson off the field; Marsh, Head share 100 stand for Australia LIVE!",
    "Transfer Centre LIVE! Kane, Rice, De Gea latest",
    "Wimbledon LIVE! Brits Broady and Boulter in action with Murray playing later",
    "Girl dies after Land Rover crashes into school; woman in 40s arrested | Wimbledon crash latest",
    "Child dies after Land Rover crashes into primary school",
    "Disney star and pop singer dies aged 48",
    "Wigs, guns and gold bars found in Russian raid of palace abandoned by Wagner boss"
]