[
    "'Horrendous' police tweet used Top Gun GIF to celebrate identifying woman's dead daughter",
    "Girl killed in Wimbledon school crash named",
    "'Household name' BBC presenter 'paid teen for sexually explicit photos'",
    "Biden admits 'not easy' to send Ukraine cluster bombs - as conflict enters 500th day | War latest",
    "Cluster bombs deal is clear signal that war is not going well for Ukraine",
    "Putin to step foot on NATO territory for first time since Ukraine war",
    "British lorry that only emits water starts trials",
    "Saturday's national newspaper front pages",
    "Paris Hilton accused of 'problematic puppy purchase'",
    "Dutch PM resigns after collapse of coalition government",
    "Top Gun police tweet 'horrendous'",
    "Off-duty police volunteer disarms gunman",
    "Palestinian fighter says Israel failed",
    "Mamoudou Athie on Pixar's Elemental",
    "'Hopefully he never sees Christmas again'",
    "'Dangerous' killer jailed for shooting",
    "Inside camp 'offered' to Wagner group",
    "Police 'tried desperately' to rescue boys",
    "Tributes to girl killed in school car crash",
    "Russian jets 'harass' US drones again",
    "Smuggler caught after high-speed chase",
    "Police chase pig on the loose",
    "Drones search for sharks after bite reports",
    "Near-extinct African wild donkey born",
    "Rabbit hunt: Police seek bunny burglar",
    "Swimmers flee water after shark spotted",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "In full: Blair on the future of AI",
    "'Teachers don't want to strike'",
    "'We want to resolve teachers' strike'",
    "Users react to Meta's launch of Threads",
    "'How will Labour level up schools?'",
    "'Tragic end of term for the girls'",
    "'It's not always about spending more money'",
    "China risks falling further behind US in AI race with 'heavy-handed' regulation",
    "Chart shows who's most likely to win Ashes third Test after another thrilling day",
    "Mysterious shapes spotted in satellite images of Russian-occupied nuclear plant in Ukraine",
    "This is how AI could change the future of journalism",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Watch: Could AI do the job of a news organisation?",
    "Biden admits 'difficult decision' to send cluster bombs to Ukraine",
    "New HIV cases linked to spa that closed after 'vampire facial' clients tested positive for virus",
    "Five dead after 'condemned' building collapses during heavy rain",
    "Former Man Utd keeper van der Sar in intensive care after bleed around brain",
    "Britney Spears 'hit herself in face' during alleged slap by NBA star's security",
    "School run by teacher who took own life after Ofsted inspection is upgraded",
    "'Goodbye lad': Elle Edwards' family shout at killer as he is jailed for 48 years",
    "'Danger to life': Thunderstorm warning for most of UK this weekend - with flash flooding risk",
    "The training facility where Wagner Group fighters 'would be welcome'",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "Company flotations, government bonds and online safety",
    "What's the future for the NHS? | Steve Barclay and Wes Streeting",
    "Elemental, The Afterparty and Then You Run",
    "Councillor whose long COVID diagnosis turned out to be cancer dies",
    "Stokes conjures up another crucial Headingley innings",
    "'Winning British GP best thing ever' | Hamilton recounts Silverstone success",
    "Murray suffers five-set defeat to Tsitsipas while Norrie, Broady also bow out",
    "Jackass star detained by police after jumping off London's Tower Bridge",
    "Wagner troops leave Central African Republic after 'refusing contracts with Russia'"
]