[
    "Analysis: Aggrieved royal has score to settle",
    "Prince Harry blames tabloids for 'inciting hatred' - and casting him as a 'thicko' and 'playboy'",
    "State of emergency declared after major dam breach in Russia-controlled Kherson region",
    "Gonorrhoea and syphilis diagnoses in England hit record levels",
    "Pope Francis in hospital for check-up",
    "Arnold Schwarzenegger apologises for groping women 20 years on from allegations",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "Watch live: Scene outside High Court as Prince Harry gives evidence",
    "Harry v Daily Mirror publisher: What happened on day one?",
    "Prince Harry subject of US court case which could result in his removal from the country",
    "'Cocaine parties' and 'beach bum Harry': Which articles have been brought up in the duke's case?",
    "Harry accused of wasting court's time - as Diana's letters to Michael Barrymore read out",
    "‘I don’t want it to be a witch hunt’",
    "Duke of Sussex arrives to give evidence",
    "'Never interview here!' Johnson's edict",
    "'We support Ukraine's self-defence'",
    "Aerial view of Kakhovka dam damage",
    "Suspect sets fire to US jail",
    "Why is Prince Harry's US visa under scrutiny?",
    "Man caught stealing 144 chocolate bars",
    "Targets attacked in south Donetsk",
    "Prince Harry case: Today in court",
    "Sonic boom interrupts music video",
    "Manchester City players meet Elton John",
    "Man rugby tackled after invading race",
    "Drone footage shows extent of train crash",
    "Police find boy who slept as car was stolen",
    "Inside Indian hospital after fatal train crash",
    "Large sandstorm over Suez Canal",
    "'Almost impossible’ rescue from Mt. Everest",
    "Zelenskyy meets UK foreign secretary in Kyiv",
    "Is Iran helping Russia in Ukraine war?",
    "'Iran might be ripping off the Russians'",
    "Ukraine urges silence on counteroffensive",
    "Why hasn't the spring offensive started yet?",
    "Rescuers dig through rubble after Dnipro airstrike",
    "How 'serial killer' mum was proven innocent",
    "India train crash: What happened?",
    "Explained: Schofield's interviews",
    "Why watch thefts are on the rise",
    "Which jobs are overlooked by young people?",
    "US debt ceiling: Why is it important?",
    "This Morning row explained",
    "Schofield's lawyer's role 'to get truth out'",
    "COVID inquiry: Govt shouldn't hand in 'unrelated' documents",
    "Driscoll: 'Shocking' to be barred from running as mayor",
    "'What do you mean by the word cannibalising?'",
    "This Morning editor: 'Scores are being settled'",
    "Spidey star 'optimistic' about future films",
    "'The stench of death hangs in the air': On the ground at aftermath of India train crash",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Geraint Davies: The suspended Labour MP at the centre of sexual harassment allegations",
    "'Ticking time bomb' over 'widespread' meter tampering during cost of living crisis",
    "'Glory to Hong Kong' song branded 'insulting' as government seeks ban",
    "Grilling of ITV bosses in front of MPs 'not a witch hunt' against Schofield",
    "Teenager charged in connection with death of man in street",
    "Fresh wave of NHS strikes as nurses walk out over pay",
    "Jim Hines - first sprinter to run 100m in under 10 seconds - dies aged 76",
    "Children's doctors call for ban on disposable vapes 'epidemic'",
    "Taylor Swift and Matty Healy 'no longer romantically involved'",
    "UK set for hottest day of year so far this week",
    "Oil boss running COP28 under pressure to present plan",
    "Businessman walks over 2,600 miles from London to Istanbul to promote carbon capture",
    "All aboard the new generation of night trains",
    "Cyclist sets off on 3,000-mile bamboo bike journey",
    "Are sleeper trains a genuine alternative to flying?",
    "Inside the battle to stop new gold mine in the 'wild west of Europe'",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "The secret Iranian-Russian arms deal",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "Postecoglou appointed Tottenham head coach",
    "Postecoglou profile: What Spurs fans need to know about their new boss",
    "How Mac Allister could help Liverpool rebuild midfield",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "'Softly spoken' Harry giving evidence in High Court | Live updates",
    "Tuesday's national newspaper front pages",
    "Cyber security breach exposes tens of thousands of UK workers' personal details"
]