[
    "'Cocaine parties' and 'beach bum Harry': Which articles have been brought up in the duke's case?",
    "Prince Harry blames tabloids for 'inciting hatred' - and casting him as a 'thicko' and 'playboy'",
    "State of emergency declared after major dam breach in Russia-controlled Kherson region",
    "300 animals die at zoo after dam disaster; 'catastrophic nuclear risk' explained | Live updates",
    "Shock merger agreed between PGA Tour and LIV Golf after year of legal disputes",
    "Former SNP Westminster leader Ian Blackford standing down at next election",
    "Oscar-winning actor settles case with woman who claimed he raped her",
    "Chinese 'police stations' in UK are 'unacceptable'",
    "Drink and drug driver who killed 'beautiful' 17-year-old girl in car crash is jailed",
    "Prince Harry was 'extremely worried' he would be expelled from Eton over 'untrue' drugs story",
    "The key people named in Prince Harry's witness statement",
    "Watch live: Scene outside High Court as Prince Harry gives evidence",
    "Harry v Daily Mirror publisher: What happened on day one?",
    "Harry accused of wasting court's time - as Diana's letters to Michael Barrymore read out",
    "Prince Harry subject of US court case which could result in his removal from the country",
    "Prince Harry has left the High Court",
    "Ukrainian dam attack 'a war crime'",
    "Harry in court: A reconstruction",
    "House roof floats down Dnipro river",
    "Sky reporter in flooded Ukraine region",
    "Bear freed after trapping itself in truck",
    "What's included in Prince Harry's evidence?",
    "Crocodile capture caught on bodycams",
    "Swans swim through submerged Ukrainian town",
    "Senior ITV boss 'wouldn't endorse' Frizell remark",
    "Duke of Sussex arrives to give evidence",
    "Sonic boom interrupts music video",
    "Manchester City players meet Elton John",
    "Man rugby tackled after invading race",
    "Drone footage shows extent of train crash",
    "Suspect sets fire to US jail",
    "Aerial view of Kakhovka dam damage",
    "Ukraine dam: 'Both sides blaming each other'",
    "Targets attacked in south Donetsk",
    "'We support Ukraine's self-defence'",
    "Zelenskyy meets UK foreign secretary in Kyiv",
    "How 'serial killer' mum was proven innocent",
    "Why is Prince Harry's US visa under scrutiny?",
    "Is Iran helping Russia in Ukraine war?",
    "India train crash: What happened?",
    "Why hasn't the spring offensive started yet?",
    "Explained: Schofield's interviews",
    "Why watch thefts are on the rise",
    "Which jobs are overlooked by young people?",
    "Is President Biden too old?",
    "‘I don’t want it to be a witch hunt’",
    "Schofield's lawyer's role 'to get truth out'",
    "'Never interview here!' Johnson's edict",
    "'Iran might be ripping off the Russians'",
    "COVID inquiry: Govt shouldn't hand in 'unrelated' documents",
    "Driscoll: 'Shocking' to be barred from running as mayor",
    "'What do you mean by the word cannibalising?'",
    "This Morning editor: 'Scores are being settled'",
    "Destruction of Nova Kakhovka dam could be most damaging single event of Ukraine war so far",
    "What are the STIs that are seeing record diagnoses?",
    "Baroness Hallett: Who is the chair of the COVID inquiry?",
    "'The stench of death hangs in the air': On the ground at aftermath of India train crash",
    "All boat trips suspended from Bournemouth pier following deaths of boy, 17, and girl, 12",
    "Embattled CBI secures hope as members approve conduct scandal reform package",
    "Warning issued over Scotland's lochs - as illustrations show how dangerously deep they really are",
    "COVID inquiry chair refuses to withdraw order for government to hand over unredacted material",
    "Man jailed for killing his best friend with single punch",
    "COVID rule-breaking MP Margaret Ferrier suspended from House of Commons for 30 days",
    "Boy, 12, taken to hospital after 'explosion' at industrial estate",
    "Scotland's transport minister quits due to poor mental health",
    "Police investigating disappearance of woman more than 17 years ago search river",
    "UK set for hottest day of year so far this week",
    "Oil boss running COP28 under pressure to present plan",
    "Businessman walks over 2,600 miles from London to Istanbul to promote carbon capture",
    "All aboard the new generation of night trains",
    "Cyclist sets off on 3,000-mile bamboo bike journey",
    "Are sleeper trains a genuine alternative to flying?",
    "Inside the battle to stop new gold mine in the 'wild west of Europe'",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "The secret Iranian-Russian arms deal",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "PGA Tour, DP World Tour and LIV Golf agree to stunning merger",
    "Reaction to shock PGA, DP World Tour, LIV Golf merger announcement LIVE!",
    "Postecoglou appointed Tottenham head coach",
    "8 dedicated sports channels, including Premier League, F1® & more."
]