[
    "Madeleine McCann: Police recover items in Portuguese reservoir search",
    "Police rule out boat hitting swimmers in beach tragedy that killed boy and girl, aged 17 and 12",
    "Labour MP suspended over 'serious allegations of unacceptable behaviour'",
    "Phillip Schofield's British Soap Awards replacement announced",
    "South Korea uses AI to 'weigh' Kim Jong Un",
    "Biggest annual house price drop for 14 years",
    "Joy as baby donkey stolen from farm is reunited with her mother",
    "Man accused of robbing store using Nintendo Duck Hunt pistol",
    "Bereaved parents whose children took own lives demand internet histories be taken into account",
    "Bournemouth witness: 'We knew it was serious'",
    "Crowds gather at Bournemouth beach scene",
    "Vitali Klitschko thanks British people",
    "Record-breaking fires in Nova Scotia",
    "Kyiv missile 'landed in residential area'",
    "Wiegman: 'Everyone is welcome in the game'",
    "US court to hear challenge over Prince Harry's visa",
    "'Monthly mortgage £1,450 from £790'",
    "Which jobs are overlooked by young people?",
    "DeSantis: Send Biden 'back to his basement'",
    "'If someone needs help you have to help'",
    "Just Stop Oil activist dragged by police",
    "Sweet-toothed bear raids bakery",
    "Man caught slashing speed camera van's tyre",
    "Terrifying shootout aboard moving bus",
    "Missile debris hits busy Kyiv road",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Drone 'attack' damages Moscow buildings",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Millennials not getting right wing with age",
    "'We're not heading to the 1970s'",
    "'AI could put us in a fragile position'",
    "'Friendship and love' behind Rob Burrow marathon",
    "PM: Govt 'cooperating with COVID inquiry'",
    "Johnson refutes 'COVID rule breaches'",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "UK government not the first to consider food price cap as poorest hit hardest by inflation",
    "Everything you need to know about Glasgow's LEZ as enforcement begins",
    "The UK trains impacted by strike action this week",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Remains of woman found strangled in trunk identified 53 years later",
    "New anti-LGBTQ+ law with powers to 'kill' defended by Uganda's president",
    "50 Cent announces new tour dates in Australia and New Zealand",
    "Uri Geller thanks brave swimmers for collecting rock from his 'mystic' island micronation",
    "Ex-SAS soldier loses war crimes case in Australia",
    "Kim Cattrall to make cameo return in Sex and the City spin-off",
    "Manufacturing downturn deepens amid weak demand for UK goods",
    "LGBTQ flag burned at school ahead of Pride event as some parents launch protest",
    "Woman jailed for helping orchestrate attacks on neo-Nazis",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "Cars, cruises and the cost of a house",
    "'I'm scared': What it's like to be LGBTQ+ in a country where you could be killed",
    "Migrant crisis: The people found at sea",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Leach snares Stirling to end partnership; Ireland four down LIVE!",
    "Why Mourinho has gone too far this time",
    "Man Utd to approach Chelsea over Mount this week",
    "8 dedicated sports channels, including Premier League, F1® & more."
]