[
    "Bakhmut is 'not occupied': Zelenskyy denies claim Russia has taken control of Ukrainian city",
    "Sunak refuses to publicly back Suella Braverman after speeding course row",
    "Andy Murray withdraws from French Open",
    "China poses 'biggest challenge of our era' to global security, PM says",
    "Popcorn at the ready, Suella Braverman's bad week could be followed by a very tough one indeed",
    "Stadium stampede leaves at least 12 dead and several injured",
    "Prince of Wales takes to the water in rowing challenge",
    "Anti-G7 protesters scuffle with police",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Biden's Ukraine jets pledge",
    "Russians 'destroyed everything' in Bakhmut",
    "'Do you have full confidence' in Home Sec?",
    "Are  F-16s a game changer for Ukraine?",
    "Minister 'pretty fed up' with water firms",
    "City players celebrate Premier League win",
    "Man City win league without playing",
    "Mercenaries: 'Bakhmut is taken'",
    "Ukraine war: Inside the battle for Bakhmut",
    "Spending accusations cast cloud over City's glory",
    "Testing how bad sheep burps are for the planet",
    "Angry passer-by throws protester to the ground",
    "Suspects try to ditch phones on roof",
    "Musk: 'One hell of a plasma beam!'",
    "G7 leaders plant trees in Hiroshima",
    "Arab League summit: Zelenskyy and Assad speak",
    "More than 1,000 air rage cases last year",
    "'You made it': Sunak and Zelenskyy meet",
    "US Security briefing on F-16s to Ukraine",
    "Plane carrying Zelenskyy lands in Japan",
    "Russia strikes Zelenskyy's hometown",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What happened on Zelenskyy's visit?",
    "Damon Albarn: Brexit 'diminished value of arts'",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "China calls the G7 a 'clique'",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "Martin Amis remembered: Self-aware, considerably critical, and a man who once ate his cigarettes",
    "Sinn Fein may have won but the DUP hasn't lost its mandate for Stormont boycott",
    "From Johnny Depp's comeback to Indiana Jones - the biggest moments at Cannes Film Festival",
    "What is the F16 fighter jet, why does Ukraine want it - and how soon can it be delivered?",
    "Phillip Schofield and Holly Willoughby - their onscreen relationship and rumours of a rift",
    "The murder that may have changed the course of a country's history - and still remains unsolved",
    "Mother arrested four years after baby left for dead in plastic bag",
    "Renowned British novelist Martin Amis dies",
    "Phillip Schofield leaves This Morning after more than 20 years",
    "Woman credits electric headset with treating her depression - now it's being trialled by the NHS",
    "Sudan's warring factions agree to new ceasefire",
    "'Momentous' result for Sinn Fein as count ends in NI's council elections",
    "Sunday's national newspaper front pages",
    "Manchester City crowned Premier League champions",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Fifteen dogs seized and woman arrested after man mauled to death",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "Could AI really take your job?",
    "Water firms apologise, BT shrinks workforce, and Royal Mail in the red",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "WSL: Reiten gives Chelsea lead vs Arsenal LIVE!",
    "West Ham vs Leeds team news LIVE!",
    "Brighton change five to face Southampton LIVE!",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Phillip Schofield's statement in full - and Holly Willoughby's response"
]