[
    "Polls close in presidential election run-off after millions cast their votes | Turkey latest",
    "Candidates cast their votes",
    "What is a run-off election?",
    "PSG goalkeeper Sergio Rico in intensive care",
    "Two men in 20s die after being pulled from sea",
    "Girl, 5, dies in house fire",
    "Boy, 16, dies on opening day of music festival",
    "Plane passenger could face years in jail for 'opening door mid-flight'",
    "Two million litres of water drained from reservoir in search for phone",
    "Why Phillip Schofield's admission should kill off his career",
    "Phillip Schofield 'took us for fools', says ex-This Morning presenter",
    "Phillip Schofield admits affair with much younger man - and steps down from ITV",
    "Schofield's agent cites 'honesty and integrity' after dropping him - their statements in full",
    "Attacks for Kyiv's anniversary",
    "Why carbon capture is controversial",
    "Erdogan and Kilicdaroglu vote in Turkey",
    "'No mistakes' were made says ITV boss",
    "'Explosive' volcanic activity continues",
    "What makes a good football manager?",
    "'This is a pretty historic day for Turkey'",
    "How Sudan ended up in a humanitarian crisis",
    "'You've been pretty blunt on WhatsApp'",
    "Dogs defend owner against bear invasion",
    "Dermot O'Leary asked about Phillip Schofield",
    "Huge caterpillar cobweb in Shrewsbury",
    "Johnson refutes 'COVID rule breaches'",
    "Clashes with police in Kosovo",
    "Russia 'invading Belarus by stealth'",
    "Dnipro clinic destroyed in missile strike",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Wagner 'withdrawing' from Bakhmut",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "'An incredible human' Mead on Wiegman",
    "Female gamers face hate 'all the time'",
    "World Cup 'too soon' for Lioness",
    "Hunt should be 'applauded'",
    "Hunt: Inflation fall not 'automatic'",
    "Ursula in The Little Mermaid 'based on Divine'",
    "Sunak now oversees a government unable to do anything new, complex or difficult",
    "The West will be disappointed with Erdogan's likely electoral success",
    "The 'black gold' that could help fight climate change for centuries to come",
    "Boris Johnson failed to answer key question after Sky News 'doorstep'",
    "'They set us on fire and took everything': Inside refugee camps as thousands flee Sudan",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Olympic wrestlers who 'broke barricades' at sexual harassment protest detained",
    "Luton player who collapsed on pitch gives update on condition",
    "Man in serious condition after assaults during Celtic title win celebrations",
    "Johnson ally: 'The left got what they want' and need to 'leave Boris alone now' | Politics latest",
    "Convicted murderer boss of charity backed by Princess of Wales 'deeply regrets' past",
    "Delays to driving licences as DVLA workers announce 15 days of strikes",
    "Orphaned fox cub found with 'heartbreaking' message on Greggs bag",
    "Ratcliffe remains lead bidder despite inconclusive Manchester United board meeting",
    "Ancient tombs and mummification workshops unearthed in Egypt",
    "Man charged with murder of woman who died from 'multiple injuries'",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Monaco GP: Rain causes chaos as Verstappen leads LIVE!",
    "League Two play-off final goes to extra time LIVE! & highlights",
    "Gray starts for Everton vs Bournemouth LIVE! & highlights",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "The Papers: 'ITV to axe This Morning' and how $10bn Captagon trade impacting UK"
]