[
    "British child among four with 'life-threatening injuries' after knife attack in France",
    "Knifeman attacks children in playground",
    "What do we know about the Annecy knife attacker?",
    "Desperate evacuees are under attack inside Ukraine's flood zone",
    "Rishi Sunak arrives at the White House ahead of key meeting with President Biden | Politics latest",
    "Amber heat alert issued as temperatures set to hit 30C in parts of UK",
    "Jurors in murder trial allowed to fire gun 'used to kill police officer'",
    "Nurse accused of murdering baby boy 'sabotaged his care to get attention of her crush'",
    "Britain's Got Talent star Kerri-Anne Donaldson dies aged 38",
    "Ex-Mirror royal journalist denies 'closing her eyes' to alleged unlawful activities",
    "Watch reconstructions of key moments from Prince Harry's first day in court",
    "People Harry names in witness statement - from the King and Kate to Caroline Flack and Chelsy Davy",
    "Special programme: Harry in court",
    "Soft-spoken prince kept emotions in check during arduous day",
    "'I'll read about it in his next book' - Piers Morgan hits back at Harry's criticism",
    "'Cocaine parties' and 'beach bum Harry': Which articles have been brought up in the duke's case?",
    "Harry in court: A reconstruction",
    "Prince Harry was 'extremely worried' he would be expelled from Eton over 'untrue' drugs story",
    "Harry v Daily Mirror publisher: What happened on day one?",
    "'There's no intelligence' on Annecy attacker",
    "US-UK relationship 'in real good shape'",
    "'Stand in strong solidarity with France'",
    "'People targeted as they try to flee floods'",
    "Knife attack 'happened in front of my kids'",
    "New York before and after smog",
    "Knife attacker chased in Annecy",
    "Multiple children injured in knife attack",
    "Minute silence held for Annecy victims",
    "Watch as Hawaii volcano erupts",
    "Drone delivers water to stranded boy",
    "Tonnes of glue spills over NZ road",
    "MP mimics Willoughby asking ITV exec: 'Are you okay?'",
    "Bear freed after trapping itself in truck",
    "Rare Florida panther stares through window",
    "Duke of Sussex arrives to give evidence",
    "Zelenskyy visits flood-hit Kherson",
    "Kherson floods: 'There are floating land mines here'",
    "Flooded house collapses after dam attack",
    "People and pets rescued from Kherson floods",
    "'Mass plague of fish' wash up in Ukraine",
    "Fleeing Ukrainians 'under attack'",
    "Kherson main square 'awash with water'",
    "Ukraine War: Major dam attack",
    "Prince Harry court case evidence explained",
    "This Morning boss's 'ill-judged' remark",
    "Ukraine Dam attack explained",
    "What's included in Prince Harry's evidence?",
    "Ukrainian dam attack 'a war crime'",
    "How 'serial killer' mum was proven innocent",
    "Why is Prince Harry's US visa under scrutiny?",
    "Is Iran helping Russia in Ukraine war?",
    "India train crash: What happened?",
    "PM: 'On me' if inflation not halved",
    "Sunak warns against AI 'scaremongering'",
    "'If my economic policies fail it's on me'",
    "Health sec admits missing targets",
    "'He strangled me' - Andrew Tate 'victim'",
    "Is President Biden too old?",
    "‘I don’t want it to be a witch hunt’",
    "Schofield's lawyer's role 'to get truth out'",
    "'Never interview here!' Johnson's edict",
    "AI's rapid revolution - can we keep up?",
    "Canada on course for worst year of wildfires on record",
    "What to look out for as 'heat health alert' issued in England with temperatures set to rise",
    "'Ecological catastrophe': Five environmental impacts of Ukraine dam collapse",
    "Heathrow summer strikes: What you need to know",
    "Ex-Mirror royal reporter quizzed about private conversation between Harry and William",
    "Hundreds of trapped children saved from orphanage after 71 died",
    "World has lost battle to stop glaciers melting and sea level rising, UN meteorological chief says",
    "Matt Hancock tells court he feared anti-vaxxer would push him down escalator",
    "Challenger banks respond to MPs' profiteering accusations",
    "Men rescued from sinking boat after day trip to buy pasties goes wrong",
    "He's warned his creation is a threat to humanity, but who is ChatGPT boss Sam Altman?",
    "Boy who died after 'playground incident' named - as mosque appeals against 'speculation'",
    "Murder investigation launched after police identify remains of man who died 56 years ago",
    "Climate change is causing more turbulence on flights, say scientists",
    "Dramatic changes to polar ice caps revealed on new map of Arctic and Antarctica",
    "Artificial lawns could be banned in Wales, minister says",
    "Shell hits back at 'misleading' advert ban with warning on renewable energy",
    "Scotland's bottles and cans deposit return scheme 'can't go ahead as planned'",
    "UK set for hottest day of year so far this week",
    "Oil boss running COP28 under pressure to present plan",
    "New York issues air quality alert as wildfire smoke shrouds landmarks",
    "Businessman walks over 2,600 miles from London to Istanbul to promote carbon capture",
    "All aboard the new generation of night trains",
    "Controls on crypto adverts, space-comm and Wizz Air",
    "Harry v Daily Mirror publisher: Day three and what happens next",
    "Inflation, Telegraph sale and AI",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "Liverpool sign Mac Allister from Brighton",
    "Sullivan confirms Rice will leave West Ham: 'We promised him he could go'",
    "Transfer Centre LIVE! Who should Rice sign for this summer?",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "'I've lived through hell': X Factor star calls for investigation into reality TV",
    "Interest rate decision could cost you £61 a month; major Clubcard changes next week"
]