[
    "Phillip Schofield leaves This Morning after more than 20 years",
    "Phillip Schofield's statement in full - and Holly Willoughby's response",
    "Renowned British novelist Martin Amis dies aged 73",
    "What is the F16 fighter jet, why does Ukraine want it - and how soon can it be delivered?",
    "Manchester City crowned Premier League champions after Arsenal lose to Nottingham Forest",
    "Fifteen dogs seized and woman arrested after man mauled to death",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "This G7 summit stands out as memorable - and not just because Zelenskyy jetted in",
    "A timeline of Harry and Meghan's 'car chase'",
    "Harry & Meghan's 'car chase' route",
    "What have people said about the 'paparazzi chase'?",
    "A hounded couple or a pair of hypocrites? Public opinion on Harry and Meghan as divided as ever",
    "It's impossible not to be reminded of Diana after 'dangerous' pursuit of Harry and Meghan",
    "A history of Harry v the paparazzi",
    "Mercenaries: 'Bakhmut is taken'",
    "Mass paddle-out over sewage pollution",
    "'You made it': Sunak and Zelenskyy meet",
    "Plane carrying Zelenskyy lands in Japan",
    "US Security briefing on F-16s to Ukraine",
    "Rushdie thanks 'heroes' who saved his life",
    "Arab League summit: Zelenskyy and Assad speak",
    "Ukraine war: Inside the battle for Bakhmut",
    "Testing how bad sheep burps are for the planet",
    "Angry passer-by throws protester to the ground",
    "Suspects try to ditch phones on roof",
    "Musk: 'One hell of a plasma beam!'",
    "G7 leaders plant trees in Hiroshima",
    "More than 1,000 air rage cases last year",
    "US Councilman arrested with crack pipe",
    "Rishi Sunak: The full interview",
    "Russia strikes Zelenskyy's hometown",
    "Russia's latest missile attacks",
    "Putin accuses West of trying to 'divide' Russia",
    "Kyiv hit by fresh wave of missiles",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What happened on Zelenskyy's visit?",
    "Ukraine: What aid has UK provided?",
    "What could happen next in Ukraine?",
    "Damon Albarn: Brexit 'diminished value of arts'",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "China calls the G7 a 'clique'",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "PM building strong ties with Tokyo",
    "Putin's 'undefeatable' missile was a costly illusion - the West can't make the same mistake",
    "Syria's neighbours have accepted Assad has won the war - and he's not going anywhere",
    "Terror and desperation inside Bakhmut's blackened nightmare as Ukrainians refuse to yield",
    "Absence in schools is now at crisis point. This is Teddy's story",
    "Abandoned camps hint at a far darker next chapter for China's Uyghur people",
    "Sinn Fein wins but the DUP hasn't lost its mandate for Stormont boycott",
    "Sadiq Khan says death threats, disasters and terror attacks gave him PTSD",
    "Bomb squad called in as weapons and ammunition discovered in gun factory raid",
    "Princess of Wales pictured wearing keeper's suit to tend beehive",
    "Damon Albarn says Brexit has made UK 'more remote'",
    "Former Wimbledon champion charged with second doping offence over biological passport",
    "YouTuber Hank Green reveals he has cancer",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Def Leppard play homecoming gig in front of 850 people in bid to save local venue",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "Could AI really take your job?",
    "Water firms apologise, BT shrinks workforce, and Royal Mail in the red",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Man City win Premier League title for fifth time in six years",
    "PGA Championship: McIlroy makes fast start in rainy R3 LIVE!",
    "Forest beat Arsenal to clinch survival as Man City crowned champions",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "'Numb to life': Victim tells court of ordeal as Philip Schofield's brother jailed for 12 years",
    "Saturday's national newspaper front pages"
]