[
    "Deaths of two teenagers in crash may have sparked Cardiff riot, says police boss",
    "Search of reservoir by police investigating Madeleine McCann's disappearance to begin",
    "Police target organised crime group in 'largest single operation' to close down county lines",
    "Grocery inflation eases for second consecutive month",
    "Truck crash near White House 'may have been intentional'",
    "Amazon founder Jeff Bezos engaged to former broadcaster",
    "SAS soldier who famously stormed Iranian embassy to end six-day siege dies",
    "Car burns after Cardiff riot",
    "Sleeping staff at one NHS mental health unit",
    "Who is winning battle for Bakhmut?",
    "CCTV shows man attacking dog",
    "Royals attend Chelsea Flower Show",
    "Manchester Attack: Calls for support",
    "Police appeal for help after wigs theft",
    "Suella Braverman 'regrets' speeding",
    "Presenters pay tribute to Schofield",
    "Brawl breaks out in Kurdish parliament",
    "Bear wheels bin down driveway",
    "Ukraine war: Inside the battle for Bakhmut",
    "Man City win league without playing",
    "Spending accusations cast cloud over City's glory",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Are  F-16s a game changer for Ukraine?",
    "'You made it': Sunak and Zelenskyy meet",
    "US Security briefing on F-16s to Ukraine",
    "Testing how bad sheep burps are for the planet",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What happened on Zelenskyy's visit?",
    "Khan speaks out over 'minor heart attack'",
    "Russia 'handicapped' after Bakhmut",
    "Minister 'pretty fed up' with water firms",
    "Damon Albarn: Brexit 'diminished value of arts'",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "China calls the G7 a 'clique'",
    "Sting: 'We can't be complacent' about AI",
    "Keir Starmer's NHS ambitions are laudable - but how will he pay for them?",
    "Why footballers facing racism will fear being abused, doubted and denounced in Spain",
    "Who is Tim Scott? The Republicans' only black senator set to challenge Donald Trump",
    "What has Suella Braverman allegedly done wrong?",
    "Eight years after lion killing photo shocked the world - the row over trophy hunting rages on",
    "Real Madrid star who spoke out against racist abuse reveals death threats",
    "Hippos and killer whales among five more species to be added to ivory ban list",
    "Dominic Raab to stand down as MP at next general election",
    "Ancient distant galaxy thought to have supermassive black hole in centre",
    "Man arrested by police after reports of TikTok 'prankster'",
    "'More than just a pet': Paris Hilton pays tribute to 'precious' chihuahua after dog dies",
    "Tuesday's national newspaper front pages",
    "Blood test breakthrough to help alleviate sickle-cell and thalassemia transfusion side effects",
    "Junior doctors to strike next month after 'paltry' pay offer",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Suella Braverman and the speeding ticket row",
    "Record fine for Meta, Ryanair profits and house prices",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Newcastle secure CL to leave Leicester on brink | Howe: We want silverware",
    "What does Champions League qualification mean for Newcastle's transfer plans?",
    "'You are not football' - Vinicius Jr repeats call for action against racism",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Ray Stevenson dies: Actor in RRR and Thor films was 58"
]