[
    "Nine hurt as Land Rover crashes into primary school in Wimbledon",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Protesters interrupt Starmer's big speech to demand 'no more U-turns'",
    "Putin won't 'wipe out' Prigozhin but he's in Russia - Belarus leader",
    "Peaky Blinders makers 'strongly disapprove' of 'homophobic' video shared by DeSantis campaign",
    "Four retired Met officers will not face prosecution over Stephen Lawrence investigation",
    "Boy, 10, suffers 'potentially life-changing' injuries in crash",
    "What Britons really think about the NHS as UK falls behind other countries",
    "Barclay denies cuts are to blame as he points to three reasons NHS is struggling",
    "NHS honoured at Westminster Abbey",
    "NHS in 'critical condition' at 75 years",
    "First NHS baby says service is 'creaking at the seams'",
    "NHS at 75: Who was founder Aneurin 'Nye' Bevan?",
    "Is life expectancy in your local area higher or lower than average?",
    "NHS at 75: What’s the story for maternity services?",
    "How does the NHS compare globally?",
    "'Tragic end to term for the girls'",
    "Scene of primary school car crash",
    "'It's not always about spending more money'",
    "Russian police raid Wagner leader's property",
    "'Labour government takes education seriously'",
    "Protesters interrupt Starmer speech",
    "'Wagner boss back in Russia'",
    "Rollercoaster riders trapped upside down",
    "'Government will appeal Rwanda court decision'",
    "Trapped cows rescued from barn fire",
    "Could AI replace news organisations?",
    "House collapses into China river",
    "Stolen car driven wrong way during chase",
    "Man rescued from train tracks in NY",
    "Woman rescued from burning car",
    "King receives Scotland's crown jewels",
    "Protesters drown out national anthem",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "Russia to increase military salaries by 10.5%",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "Michael Rosen: NHS model 'not wrong'",
    "'We're not being honest about healthcare'",
    "'How high will NHS waiting list go?'",
    "'You can bank at Natwest, Nigel'",
    "Health secretary: 'The NHS needs to evolve'",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Key questions to the PM were cut short - but that didn't stop Sunak getting skewered",
    "Video: Women at war in Mexico",
    "What we know about the teenager who was shot dead by police",
    "How the junior doctors' strike will affect the NHS and what to do if you need care",
    "Andy Murray, Katie Boulter and Jan Choinski all in action at Wimbledon today | follow latest",
    "Streeting: Corbyn fans should 'dry their eyes' with Labour 'on course' for victory",
    "Disney star and pop singer dies aged 48",
    "Housebuilding falls sharply as mortgage rates rise",
    "Chris Pincher facing Commons suspension after groping allegations report",
    "England make early breakthrough in crucial test against Australia | Ashes latest",
    "Water suppliers Anglian and Northumbrian wave farewell to business arm",
    "'Let me finish': Climate protesters interrupt Starmer's big speech on education | Politics latest",
    "Home Office to launch appeal in attempt to save Rwanda policy",
    "Two women charged after protests at King's coronation celebrations in Scotland",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Currys results, digital transformation and start-up struggles",
    "Could AI make this podcast?",
    "Top 1,000 World Banks ranking and Leicester City fined",
    "The Ashes: Australia 91-4 at lunch as England fire with the ball LIVE!",
    "Transfer Centre LIVE! Kane, Rice, De Gea latest",
    "Brad Pitt's car for F1-inspired movie revealed at Silverstone",
    "Jigsaw puzzles not being sold at Wimbledon as tournament plays catch up after protests",
    "Wigs, guns and gold bars found in Russian raid of palace abandoned by Wagner boss"
]