[
    "Ministers weigh contingency plan for collapse of Thames Water",
    "British actor Julian Sands confirmed dead after remains identified",
    "Nicola Bulley died accidentally after falling into cold water, coroner concludes",
    "Families who lost loved ones to COVID shun Matt Hancock as he tries to apologise",
    "Man, 36, charged with murder of Sarah Henshaw after body found near M1",
    "Hundreds of Boots stores to close despite just reporting sales growth",
    "Father of three-week-old baby girl accused of killing her with crossbow",
    "Wednesday's national newspaper front pages",
    "'We want children to be safe': Parents call for change after 'humble' son's beach death",
    "'Any blackmail is doomed to failure,' defiant Putin warns after attempted rebellion",
    "UK needs plan for 'implosion of Russia', says ex-PM",
    "Putin risks looking weak if he replaces defence minister Shoigu",
    "On streets of Moscow, people seem shaken up by Wagner rebellion",
    "What does the aborted Russian mutiny mean for the war in Ukraine?",
    "Russian defence minister seen for first time since attempted Wagner coup",
    "Hope turns to indifference in Ukraine - but some believe mutiny was only act one of Putin's drama",
    "It doesn't matter the Wagner rebellion failed - what matters is it was allowed to happen at all",
    "Rebel Wagner troops to be absorbed into Russian military as Prigozhin heads to Belarus",
    "Rebellion in Russia: How the revolt led by 'Putin's Chef' unfolded",
    "How does Wagner's strength measure up to the Russian military?",
    "Hot dog seller to mercenary boss: Who is Wagner Group leader Prigozhin?",
    "Dangerous Wagner mercenary boss was disaster waiting to happen for Putin",
    "Watch Julian Sands in A Room With A View",
    "Watch moment artwork sells for record sum",
    "'Pandemic planning was inadequate'",
    "Prince misses basketball shots then scores",
    "Listen: Secret recording of Donald Trump",
    "Chimp sees open sky for first time",
    "Who is connected to Wagner boss?",
    "'Curious' whale swims alongside kayaker",
    "'I have hopes things will get better'",
    "King and Queen greet spa guests",
    "'It's a family show...or is it?'",
    "Pink fan throws mother's ashes on stage",
    "Moment horse airlifted from pit by helicopter",
    "Putin gives speech thanking military",
    "'Armed rebellion would have been suppressed'",
    "RAF jets 'seen near Russian border'",
    "'We had nothing to do with it'",
    "Prigozhin 'didn't want to shed Russian blood'",
    "Putin doesn't mention rebellion",
    "NATO on 'fragility of Russian regime'",
    "Prigozhin 'destroyed' Putin's case for war",
    "Russian defence minister 'in Ukraine'",
    "What is Russia's Wagner group doing in Africa?",
    "What's going on with mortgages?",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Roe v Wade: US abortion rights a year on",
    "Bereaved families tell Hancock to go away",
    "'Report shows courage of the 4,000 people'",
    "Rwanda scheme 'difficult to justify'",
    "'Can you please stop smiling?'",
    "Harrison Ford on his return as Indiana Jones",
    "Prigozhin 'not welcome in Belarus'",
    "Russians react to rebellion",
    "Will Murray hang up his racket?",
    "PM wants 'responsible' public sector pay",
    "Ending discrimination in cricket won't be easy - it could take years to level the playing field",
    "Prince's homelessness project pushes his political neutrality to its limits",
    "Understanding Tourette's: What is it and how does it affect people?",
    "Why has the price of car insurance gone up so much?",
    "Portrait sells for £85.3m in new European record",
    "Nandy to insist Labour housing policy is not 'Tory-lite'",
    "Zombie knife killer, 18, jailed for murdering teenager in 'planned attack'",
    "Tory mayoral hopeful vows to continue despite MP withdrawing support after grope claim",
    "Father and son who died on Titan submersible described as 'best friends' at memorial",
    "'Distant ancestor' to pizza shown in 2,000-year-old painting - but toppings are a little different",
    "June on course to be hottest on record, Met Office says",
    "Putin's message to his troops after failed Wagner Group mutiny",
    "Prison 'negligence' enabled Jeffrey Epstein to take his own life, report finds",
    "NHS consultants vote to strike for two days next month",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "Wagner mutiny: What’s next for the war and Putin’s Russia?",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Second Ashes Test: Stokes 'won't rein in Robinson' | 'England won't change'",
    "English cricket 'deep-rooted' in racism, sexism, and classism, report finds",
    "Bayern want Kane but verbal offer of £60m rejected",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Lewis Capaldi announces break 'for the foreseeable future'"
]