[
    "Car crashes into primary school in Wimbledon - several hurt",
    "'Let me finish': Climate protesters interrupt Starmer's big speech on education | Politics latest",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Wigs, guns and gold bars found in Russian raid of palace abandoned by Wagner boss",
    "Jigsaw puzzles not being sold at Wimbledon as tournament plays catch up after protests",
    "Two women charged after protests at King's coronation celebrations in Scotland",
    "Meta's Twitter rival attracts 10 million users in first few hours - here's how it works",
    "Chris Pincher facing Commons suspension after groping allegations report",
    "What Britons really think about the NHS as UK falls behind other countries",
    "Barclay denies cuts are to blame as he points to three reasons NHS is struggling",
    "NHS honoured at Westminster Abbey",
    "NHS in 'critical condition' at 75 years",
    "First NHS baby says service is 'creaking at the seams'",
    "NHS at 75: Who was founder Aneurin 'Nye' Bevan?",
    "Is life expectancy in your local area higher or lower than average?",
    "NHS at 75: What’s the story for maternity services?",
    "How does the NHS compare globally?",
    "Protesters interrupt Starmer speech",
    "'Wagner boss back in Russia'",
    "Rollercoaster riders trapped upside down",
    "'Government will appeal Rwanda court decision'",
    "Trapped cows rescued from barn fire",
    "Russian jets 'harass' US drones",
    "Aftermath of deadly missile strike",
    "Could AI replace news organisations?",
    "Sky News trials an AI reporter",
    "Israel’s biggest attack on the West Bank in 20 years",
    "House collapses into China river",
    "Stolen car driven wrong way during chase",
    "Man rescued from train tracks in NY",
    "Woman rescued from burning car",
    "King receives Scotland's crown jewels",
    "Protesters drown out national anthem",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "Russia to increase military salaries by 10.5%",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "Michael Rosen: NHS model 'not wrong'",
    "'We're not being honest about healthcare'",
    "'How high will NHS waiting list go?'",
    "'You can bank at Natwest, Nigel'",
    "Health secretary: 'The NHS needs to evolve'",
    "75-year-old man rescued after almost a week",
    "Murray 'looking good' for Wimbledon",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Key questions to the PM were cut short - but that didn't stop Sunak getting skewered",
    "Video: Women at war in Mexico",
    "What we know about the teenager who was shot dead by police",
    "How the junior doctors' strike will affect the NHS and what to do if you need care",
    "Starmer interrupted by green protesters during speech",
    "Manhunt after woman attacked by intruder at 1am",
    "Wagner boss is in Russia and Putin won't 'wipe' him out - Belarus leader",
    "Cameraman injured by wild throw at Yankees and Orioles game",
    "Disney star and pop singer dies aged 48",
    "£130m worth of cannabis, £636,000 in cash and 20 guns seized in UK-wide crackdown",
    "Currys boss 'wary' of economic optimism as overall profits fall",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Degenerative brain disease CTE found in female athlete for first time",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Could AI make this podcast?",
    "Top 1,000 World Banks ranking and Leicester City fined",
    "The Ashes: Broad removes Warner in first over after England bowl LIVE!",
    "Transfer Centre LIVE! Kane, Rice, De Gea latest",
    "Ben Sulayem: FIA won't stop 'good kid' Red Bull's dominance",
    "Thursday's national newspaper front pages"
]