[
    "Man arrested over deaths of teenager and girl after incident off beach",
    "Bereaved parents whose children took own lives demand internet histories be taken into account",
    "Crunch deal to raise US debt ceiling passes through House of Representatives",
    "US TV star found guilty of two counts of rape",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Thousands of NHS contractors face missing out on pay rise - despite working on same terms",
    "Amazon to pay millions to settle Alexa and Ring doorbell privacy claims",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Thursday's national newspaper front pages",
    "Three dead in overnight attack on Kyiv",
    "Wiegman: 'Everyone is welcome in the game'",
    "US court to hear challenge over Prince Harry's visa",
    "'Monthly mortgage £1,450 from £790'",
    "Which jobs are overlooked by young people?",
    "DeSantis: Send Biden 'back to his basement'",
    "Millennials not getting right wing with age",
    "'If someone needs help you have to help'",
    "Police vehicle hits four-year-old boy",
    "England captain revealed for Women's World Cup",
    "Just Stop Oil activist dragged by police",
    "Sweet-toothed bear raids bakery",
    "Man caught slashing speed camera van's tyre",
    "Terrifying shootout aboard moving bus",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "Crew parachute back to earth after space mission",
    "Car flies through the air at full speed",
    "Missile debris hits busy Kyiv road",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Drone 'attack' damages Moscow buildings",
    "Rocket debris hits car in Kyiv",
    "What Kyiv attacks can tell us",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "'We're not heading to the 1970s'",
    "'AI could put us in a fragile position'",
    "'Friendship and love' behind Rob Burrow marathon",
    "PM: Govt 'cooperating with COVID inquiry'",
    "Johnson refutes 'COVID rule breaches'",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "UK government not the first to consider food price cap as poorest hit hardest by inflation",
    "Everything you need to know about Glasgow's LEZ as enforcement begins",
    "The UK trains impacted by strike action this week",
    "Why there are fears of a summer surge in online child abuse",
    "Kim Jong Un's sister vows North Korea will succeed in launching spy satellite",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Greta Thunberg is returning to Scotland",
    "Alec Baldwin given new 'quality of life' with surgery after suffering 'intense chronic pain'",
    "ITV announces external review over Phillip Schofield's departure from This Morning",
    "'We feel badly let down': Key extracts from ITV boss's letter over Phillip Schofield departure",
    "Applicants seeking to join RAF described as 'useless white male pilots' in leaked emails",
    "Boris Johnson hands COVID material to Cabinet Office in 'full and in unredacted form'",
    "Blood thinners do not reduce miscarriage risk, study suggests",
    "What did we learn from NASA's first ever public meeting on UFOs?",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "'I'm scared': What it's like to be LGBTQ+ in a country where you could be killed",
    "Burgers, books and mortgages",
    "Migrant crisis: The people found at sea",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Mourinho uncertain over Roma future | Fumes at 'Spanish' ref Taylor",
    "Lionesses talking points: Envious No 9 options as Bright, Bronze boost England",
    "England's Women's World Cup squad: Meet the Lionesses",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "England announce Women's World Cup squad - as big names miss out"
]