[
    "Nineteen arrested over plans to disrupt Epsom Derby - as protester runs on to racecourse",
    "At least 280 killed and hundreds injured in India train crash",
    "Woman in her 70s dead after dog attack - as two people arrested",
    "Putin may have made same mistake as Hitler - and it will soon be exploited",
    "FA Cup Final: Man City vs Man Utd LIVE!",
    "Enninful stepping down as British Vogue editor to take on new role",
    "Schofield fears being spat on in the street over affair",
    "Ordering groceries on food delivery apps 'can cost double'",
    "All aboard the new generation of night trains",
    "Phillip Schofield can 'bounce back', PR expert says",
    "The rise and fall of Phillip Schofield: A timeline of his departure from ITV",
    "'I didn't lie to protect my career': What have we learned from the Phillip Schofield interviews?",
    "Schofield: 'Do you want me to die?'",
    "'Unbelievable situation' at train crash site",
    "Police find boy who slept as car was stolen",
    "This Morning editor: ‘Scores are being settled’",
    "Drone footage shows extent of train crash",
    "Aftermath of deadly rail crash",
    "India train crash: What we know",
    "Moments after deadly Indian train collision",
    "Survivor describes train crash",
    "Explained: Schofield's interviews",
    "Large sandstorm over Suez Canal",
    "'Almost impossible’ rescue from Mt. Everest",
    "Moment terror teen targets police",
    "Referee surrounded by Roma fans",
    "Ghost orchid flowers for first time in UK",
    "Essex teen sentenced for acts of terrorism",
    "Where is Russia being attacked?",
    "Kyiv missile 'landed in residential area'",
    "Missile debris hits busy Kyiv road",
    "Kyiv mayor: 'It's genocide against Ukraine'",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Why watch thefts are on the rise",
    "Which jobs are overlooked by young people?",
    "US debt ceiling: Why is it important?",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Spidey star 'optimistic' about future films",
    "Windrush passenger on 75th anniversary",
    "Dailey: Schofield 'in a state of crisis'",
    "Police evict homeless from shelter",
    "'Situation could have been avoided'",
    "'I could have died that day'",
    "Bournemouth witnesses speak out",
    "Government 'carefully considering next steps'",
    "If political culture in Westminster is rotten, bad behaviour will continue",
    "Phillip Schofield's side of the story raises more questions - who knew what, and when?",
    "Everything you need to know about Saturday's rail strikes",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Tasered cousin of BLM founder died from enlarged heart and cocaine",
    "Diesel prices in record 12p monthly fall 'but should be even lower'",
    "Man Utd out to protect a legacy by ending City's treble dream",
    "Rail strikes to hit FA Cup final and Epsom Derby - and even Beyonce isn't safe",
    "Police searching boat at centre of Bournemouth beach deaths",
    "Man, 28, arrested after woman stabbed to death",
    "Saturday's national newspaper front pages",
    "Fallen star Schofield's talent agency YMU in crunch finance talks",
    "Parent gets Bible banned from some schools - and the reason might surprise you",
    "UK ticket-holder wins £111m EuroMillions jackpot",
    "Inside the battle to stop new gold mine in the 'wild west of Europe'",
    "Are sleeper trains a genuine alternative to flying?",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Greedflation: Are businesses profiteering from cost of living crisis?",
    "Cars, cruises and the cost of a house",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "FA Cup final: Sancho starts for Man Utd, Ortega in goal for City LIVE!",
    "Ireland seventh-wicket stand continues to frustrate England LIVE!",
    "Man Utd make approach for Chelsea's Mount",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Nineteen detained over plans to disrupt Epsom Derby - as protester runs on to racecourse",
    "China drilling hole over 11,000m deep into the desert",
    "Eddie Izzard clears up her pronouns and says 'no one can really get it wrong'"
]