[
    "Pizza restaurant death toll rises; Putin was stopped from 'wiping out' Wagner boss | War latest",
    "Russian missile 'designed to bring down a plane' hits crowded pizza restaurant",
    "Government 'prepared for range of scenarios' amid fears of Thames Water collapse",
    "Ashes Test match between England and Australia disrupted by Just Stop Oil protest",
    "Official complaint made against Tory London mayoral hopeful after groping allegation",
    "Passenger rescued after fall from 10th deck of cruise ship in Caribbean",
    "Chess prodigy's defamation lawsuit over cheating claims dismissed",
    "Ashes Test match disrupted by protesters",
    "Moment teen shot dead by Paris police",
    "Children injured in deadly attack on Kramatorsk",
    "Clashes in Paris over teen death",
    "The Wagner march on Moscow in videos",
    "Support for Daniel Korski 'on pause'",
    "Drone show wows wine festival",
    "Spacey arrives at court for sex offences trial",
    "Aftermath of deadly Kramatorsk missile strike",
    "Watch Julian Sands in A Room With A View",
    "Watch moment artwork sells for record sum",
    "Prince misses basketball shots then scores",
    "Chimp sees open sky for first time",
    "Listen: Secret recording of Donald Trump",
    "'Curious' whale swims alongside kayaker",
    "King and Queen greet spa guests",
    "'It's a family show...or is it?'",
    "Moment horse airlifted from pit by helicopter",
    "Aftermath of deadly Russian strike",
    "Who is connected to Wagner boss?",
    "Putin gives speech thanking military",
    "'Armed rebellion would have been suppressed'",
    "RAF jets 'seen near Russian border'",
    "'We had nothing to do with it'",
    "Prigozhin 'didn't want to shed Russian blood'",
    "What is Russia's Wagner group doing in Africa?",
    "What's going on with mortgages?",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Roe v Wade: US abortion rights a year on",
    "'I have hopes things will get better'",
    "Bereaved families tell Hancock to go away",
    "'Report shows courage of the 4,000 people'",
    "Rwanda scheme 'difficult to justify'",
    "'Can you please stop smiling?'",
    "Harrison Ford on his return as Indiana Jones",
    "Prigozhin 'not welcome in Belarus'",
    "Russians react to rebellion",
    "Will Murray hang up his racket?",
    "Ending discrimination in cricket won't be easy - it could take years to level the playing field",
    "Prince's homelessness project pushes his political neutrality to its limits",
    "Pressure on 'rip off' water firms unlikely to go away any time soon",
    "Vaping: What you need to know about e-cigarettes",
    "Warning over invasive salmon species set to arrive in UK waters",
    "BT to be investigated over UK-wide 999 outage",
    "Waving Kevin Spacey in London court as sexual assault trial begins | Trial latest",
    "Loan sharks posing as 'friends' preying on struggling households - and threatening violence",
    "Council leader suspended for leaking confidential information",
    "Chancellor to hold pension fund talks as major reforms loom",
    "Fraudsters tactics are becoming more complex - here is what to look out for",
    "Nicole Scherzinger announces engagement to Scottish rugby star",
    "Six teenagers charged with murder",
    "School building collapse that causes death or injury 'very likely'",
    "Man arrested after woman found dead in house",
    "Government progress on net zero 'worryingly slow', report says",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "COVID Inquiry: Why were we not prepared for a pandemic?",
    "Wagner mutiny: What’s next for the war and Putin’s Russia?",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Bairstow carries protester off field; Australia resume on 20-0 after rain delay LIVE!",
    "Bairstow carries protester off pitch as play halted at Lord's",
    "Man City pull out of Rice race after Arsenal submit £105m bid",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Dramatic footage of Wagner march on Moscow show how events unfolded - and what may happen next",
    "Ministers weigh contingency plan for collapse of Thames Water"
]