[
    "Analysis: What Zelenskyy got from G7",
    "Watch: Russian flag flown in Bakhmut",
    "Sunak refuses to publicly back Suella Braverman after speeding course row",
    "From Guardiola's genius to wise spending decisions - how City became one of the greatest teams",
    "Ten in hospital after bus loses roof from hitting railway bridge",
    "Pensioner arrested after elderly woman 'attacked'",
    "This Morning presenters announced after Phillip Schofield exit",
    "AI will get 'crazier and crazier' without controls, start-up founder warns",
    "Barking dogs alert owners as fire tears through house",
    "Minister 'pretty fed up' with sewage spills after water firms issued apology",
    "Football fans crushed in stadium stampede",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Anti-G7 protesters scuffle with police",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Biden's Ukraine jets pledge",
    "Russians 'destroyed everything' in Bakhmut",
    "'Do you have full confidence' in Home Sec?",
    "Are  F-16s a game changer for Ukraine?",
    "Minister 'pretty fed up' with water firms",
    "Ukraine war: Inside the battle for Bakhmut",
    "Man City win league without playing",
    "Spending accusations cast cloud over City's glory",
    "Testing how bad sheep burps are for the planet",
    "Angry passer-by throws protester to the ground",
    "Suspects try to ditch phones on roof",
    "Musk: 'One hell of a plasma beam!'",
    "G7 leaders plant trees in Hiroshima",
    "Arab League summit: Zelenskyy and Assad speak",
    "More than 1,000 air rage cases last year",
    "Mercenaries: 'Bakhmut is taken'",
    "'You made it': Sunak and Zelenskyy meet",
    "US Security briefing on F-16s to Ukraine",
    "Plane carrying Zelenskyy lands in Japan",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What happened on Zelenskyy's visit?",
    "Damon Albarn: Brexit 'diminished value of arts'",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "China calls the G7 a 'clique'",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "Zelenskyy's visit to the G7 has paid dividends - he can fly home confident in the West's support",
    "Martin Amis remembered: Self-aware, considerably critical, and a man who once ate his cigarettes",
    "From Johnny Depp's comeback to Indiana Jones - the biggest moments at Cannes Film Festival",
    "What is the F16 fighter jet, why does Ukraine want it - and how soon can it be delivered?",
    "Phillip Schofield and Holly Willoughby - their onscreen relationship and rumours of a rift",
    "Andy Murray withdraws from French Open",
    "Prince of Wales takes to the water in rowing challenge",
    "The Russians appear to have captured 'kill box' Bakhmut - is this a turning point in the war?",
    "'There have to be standards in public life' says Tory mayor over Suella Braverman speeding row",
    "China poses 'biggest challenge of our era' to global security, PM says",
    "Vin Diesel champions support for Hollywood writers' strike",
    "Stadium stampede leaves at least 12 dead and several injured",
    "Ministers hunt new chief as GREAT campaign boss quits",
    "Popcorn at the ready, Suella Braverman's bad week could be followed by a very tough one indeed",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "Suella Braverman’s speeding row, Thérèse Coffey and Andy Street",
    "Could AI really take your job?",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "WSL: Ladd screamer puts Man Utd ahead against City LIVE! & highlights",
    "PGA Championship: Koepka leads; McIlroy with birdie start LIVE!",
    "Man City celebrate title with win over Chelsea before trophy lift",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Sunday's national newspaper front pages",
    "Phillip Schofield's statement in full - and Holly Willoughby's response",
    "Putin's 'undefeatable' missile was a costly illusion - the West can't make the same mistake"
]