[
    "'No longer appropriate': Phillip Schofield dropped by charity founded by the King",
    "Video: This Morning row explained",
    "Eamonn Holmes claims there was 'total cover-up'",
    "What online evidence reveals about the drone attack on Moscow",
    "Disgraced Theranos founder Elizabeth Holmes begins prison sentence",
    "'We could go the way of the Neanderthals': AI could lead to human extinction, tech leaders warn",
    "What are the concerns around AI and are some of the warnings 'baloney'?",
    "Trans rights protesters interrupt talk at Oxford Union by 'gender-critical' academic",
    "Glastonbury announces mystery act for prime slot - as full-line up revealed",
    "Murder investigation launched after woman's body found in river",
    "Hottest day so far in the UK - but clouds are coming to parts of the country",
    "Moscow drone attack: Who's responsible?",
    "This Morning row explained",
    "Disgraced Theranos founder enters prison",
    "Aftermath of mass migrant rescue",
    "Drone seen flying over Moscow suburb",
    "Putin: Drone attack 'terrorist act'",
    "Who could be behind Moscow drone attacks?",
    "Djokovic: Kosovo clashes 'very painful'",
    "New deadline for ex-PM's COVID messages",
    "Bull charges into crowd at rodeo event",
    "Wildfires spread in Nova Scotia, Canada",
    "Watch spectacular 'Manhattanhenge' sunset",
    "Inside 'most dangerous' motorsport event",
    "Aftermath as 'overloaded' bus skids off bridge",
    "'Wild celebrations in Istanbul'",
    "Stelling signs off from Soccer Saturday",
    "Woman arrested after driving down beach in US",
    "'Explosive' volcanic activity continues",
    "Drone 'attack' damages Moscow buildings",
    "Rocket debris hits car in Kyiv",
    "What Kyiv attacks can tell us",
    "Kyiv metro becomes shelter amid air strikes",
    "Kyiv hit by barrage of Russian missiles",
    "Attacks on Kyiv's anniversary",
    "Russia 'invading Belarus by stealth'",
    "Dnipro clinic destroyed in missile strike",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "'Friendship and love' behind Rob Burrow marathon",
    "PM: Govt 'cooperating with COVID inquiry'",
    "Johnson refutes 'COVID rule breaches'",
    "Praise for Mermaid star Halle Bailey",
    "How The Little Mermaid came to life",
    "'An incredible human' Mead on Wiegman",
    "'No agenda in casting The Little Mermaid'",
    "What makes a good football manager?",
    "'You've been pretty blunt on WhatsApp'",
    "Female gamers face hate 'all the time'",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "UK government not the first to consider food price cap as poorest hit hardest by inflation",
    "Why have tensions flared up between Serbia and Kosovo?",
    "See the spectacular winning pictures from the Milky Way Photographer Of The Year award",
    "The UK trains impacted by strike action this week",
    "NATO to deploy extra 700 troops to Kosovo as tensions rise",
    "Government stands by refusal to hand over Johnson's 'private' WhatsApp messages to COVID inquiry",
    "Two firefighters airlifted to hospital as crews battle wildfire in Scottish Highlands",
    "'Amazing' grandmother completes 1,000-mile bike ride in memory of her late children",
    "Nun's non decaying body attracts hundreds to US city",
    "Model's noose dress at Cannes branded 'disgraceful'",
    "How to sleep better during the heat",
    "River Wye's health status downgraded after reduction in key fish population",
    "Brazil's President Lula hints at currency to challenge US dollar at 'historic' summit",
    "Rishi Sunak to head to Washington for talks with Joe Biden",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The 'black gold' that could help fight climate change for centuries to come",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "The price of food, carbon extraction and bowling",
    "Student loans in England: Is the degree still value for money?",
    "Inflation, debt, retail and AI",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Tongue to make England debut against Ireland",
    "England: The selection dilemmas facing Wiegman as World Cup nears",
    "Transfer Centre LIVE! 'Felix to return to Atleti as Chelsea reject permanent deal'",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Eamonn Holmes claims there was 'total cover-up' over Phillip Schofield's affair with younger man"
]