[
    "Boris Johnson tells Sky News new allegations of lockdown rule breaking are 'total nonsense'",
    "'No smoke without fire' says Johnson's ex-press chief",
    "Johnson refutes 'COVID rule breaches'",
    "'Doorstepping' denial was typical Johnson but lacked detail - and key question went unanswered",
    "Phillip Schofield admits affair with much younger man - and steps down from ITV",
    "F-16s are heading to Ukraine - but will they pose a credible threat to Russia?",
    "How TV talent show singer survived shooting - and found a new voice on TikTok",
    "Papuan fighters threaten to shoot NZ pilot hostage without independence talks",
    "Balloons fill the sky to remember teenage boys killed in Cardiff bike crash",
    "Saturday's national newspaper front pages",
    "Waterspout spotted in Florida",
    "Analysis: GP closures since 2013",
    "'An incredible human' Mead on Wiegman",
    "'Deeply sorry' Schofield quits ITV",
    "Moment tanker crashes into school bus",
    "Ursula in The Little Mermaid based on Divine",
    "Russia 'invading Belarus by stealth'",
    "Driver mounts pavement to get around activists",
    "Hundreds attend vigil for crash victims",
    "Panic as passenger opens plane door",
    "Elon Musk brain chip firm trials approved",
    "Hong Kong 'Bun Festival' returns",
    "Drone video shows Mexico volcano crater",
    "CCTV shows e-bike battery explode",
    "Trans cycling rule change explained",
    "Dnipro clinic destroyed in missile strike",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Wagner 'withdrawing' from Bakhmut",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "Hunt should be 'applauded'",
    "Hunt: Inflation fall not 'automatic'",
    "'UK in race for green investment'",
    "'Almighty smash at front gate'",
    "'How are we going to cope with migration?'",
    "Tina Turner 'a kind and gentle lady'",
    "The West will be disappointed with Erdogan's likely electoral success",
    "GPs at 'breaking point' in England's most deprived areas",
    "What is security like at Downing Street?",
    "One in 10 female gamers feel suicidal over abuse they face while playing online",
    "Schofield's agent cites 'honesty and integrity' after dropping him - their statements in full",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "Emily Bridges accuses British Cycling bosses of 'furthering a genocide' with transgender ban",
    "Backstage With… The stars and director of new live-action The Little Mermaid",
    "Killer whales 'tear bits off boat' in 'scary' hour-long attack off Spanish coast",
    "Body found in river in search for missing schoolboy, 15",
    "Rookie RAF pilots prompted to quit as they face year-long wait due to training 'shambles'",
    "Parents who murdered baby on Christmas Day after 'savage' abuse jailed",
    "Passenger opens plane door mid-flight",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Skinner: 'We'll keep tabs on Chelsea' | Hayes: WSL decided on final day 'normal'",
    "Toney diagnosed with gambling addiction | 13 bets on his team to lose",
    "Hamilton: 'Shame' improved Mercedes not closer to front",
    "8 dedicated sports channels, including Premier League, F1® & more."
]