[
    "Disgraced entertainer Rolf Harris's cause of death announced",
    "Rolf Harris's greatest fear was not being loved - his depraved crimes ensure he won't be",
    "Killer who murdered seven-year-old Nikki Allan in 1992 jailed",
    "Madeleine McCann police search reservoir after receiving tip-offs",
    "Who is Christian B - the main suspect in the Madeleine McCann case?",
    "Two boys killed in Cardiff crash which was followed by riot are named",
    "Ex-PC who was dishonest in Wayne Couzens flashing investigation guilty of gross misconduct",
    "Home Office to stop overseas students bringing family to UK in bid to curb migration",
    "'Very big lessons to learn': Bank of England chief accepts inflation criticism",
    "Nikki Allan's 'unimaginable terror'",
    "Godmother speaks out over Cardiff teen",
    "Retracing Nikki Allan's last known steps",
    "McCann search: Police scour reservoir area",
    "Rolf Harris's fall from fame to infamy",
    "'Climate criminals!' - oil firm protest",
    "Angry man shoves activist to ground",
    "Smoke rises from Russian checkpoint",
    "'IMF keeps getting things wrong?'",
    "Madeleine search begins on reservoir",
    "CCTV shows man attacking dog",
    "Who is winning battle for Bakhmut?",
    "Brawl breaks out in Kurdish parliament",
    "Bear wheels bin down driveway",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Are  F-16s a game changer for Ukraine?",
    "'You made it': Sunak and Zelenskyy meet",
    "McCann reservoir search explained",
    "Testing how bad sheep burps are for the planet",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "How police caught Nikki Allan's killer",
    "Latest Madeleine search will 'take time'",
    "Shocked residents on Cardiff riot",
    "Khan speaks out over 'minor heart attack'",
    "Russia 'handicapped' after Bakhmut",
    "Minister 'pretty fed up' with water firms",
    "Manchester Attack: Calls for support",
    "Why China has made its feelings known to UK after G7 summit",
    "Raab's exit at next election shows a clear sense of Tory despondency about their prospects",
    "Officials in Madeleine McCann search focussing on concentrated area of reservoir",
    "How events unfolded in the disappearance of Madeleine McCann",
    "Prince Harry loses court battle with Home Office over paying for police protection",
    "Man charged with murder after body of 'beloved grandfather' discovered",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Man scales Mount Everest for a record 28th time",
    "Former Bear Stearns London HQ collapses into insolvency",
    "UK inflation to fall to 8.2% tomorrow, experts predict - but they were wrong last time",
    "Alastair Campbell to give evidence to support Prince Harry and co | Live in High Court",
    "Man jailed for life over murder after burned body found near children's play area",
    "IMF dramatically upgrades outlook for UK economy - but says more cost of living pain to come",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Borrowing, groceries and the avoidance of a UK recession",
    "Suella Braverman and the speeding ticket row",
    "Eight years after lion killing photo shocked the world - the row over trophy hunting rages on",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Seven arrested over separate Vinicius incidents | Ancelotti: He won't leave Real",
    "Saka signs new Arsenal deal until 2027 | 'I have everything here to be my best'",
    "MNF end-of-season awards: Haaland, Saka, Pep among winners",
    "8 dedicated sports channels, including Premier League, F1® & more."
]