[
    "Boy arrested on suspicion of attempted murder of teacher after school stabbing",
    "Met police 'assessing information' after BBC meeting over presenter claims",
    "Why hasn't the BBC presenter been named publicly?",
    "Extreme heat killed more than 60,000 people in Europe last year - study",
    "Disgraced sports coach Larry Nassar stabbed multiple times in prison",
    "Man found dead after being trapped in freezer",
    "BBC presenter should only be named after 'full' investigation, says justice secretary",
    "Everything we know about claims a BBC presenter paid teen for sexually explicit photos",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "Timeline leading up to suspension of presenter accused in BBC scandal",
    "Culture sec avoids questions on BBC scandal",
    "Questions BBC must answer over presenter accused of paying for explicit photos",
    "BBC statement in full as presenter suspended",
    "BBC presenter scandal is sleazy and depressing - but at the heart of this a family is suffering",
    "What we know about claims against BBC star",
    "BBC needs to 'get a grip' says Rachel Reeves",
    "Harry Styles hit in face at show",
    "The King welcomes Biden to Windsor",
    "Dramatic rescue over India flood waters",
    "Jeremy Vine: \"It can't be me\"",
    "Kremlin confirms Putin met with Prigozhin",
    "Biden and Sunak join tea party",
    "General seen for first time since failed mutiny",
    "Largest “mirror” in universe",
    "Injuries at bull run festival",
    "Wrongly named presenter takes legal advice",
    "Cars plough through flooded roads in Sheffield",
    "Orange confetti thrown over former chancellor",
    "Divers attend underwater music show in Florida",
    "Pilot asks volunteers to leave 'heavy' plane",
    "Mob storms LGBT event in Georgia",
    "Off-duty police volunteer disarms gunman",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "PM on use of cluster munitions",
    "Ukrainian medics fight to keep casualties alive",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "What happened in Zaporizhzhia?",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "BBC 'may need to be investigated'",
    "Chesney Hawkes recounts 'horror flight'",
    "MP responds to child mural removal",
    "Robbie and Gosling on Barbie 'absurdity'",
    "How UK debt compares to other countries",
    "Whitehall on Colman accent 'diss'",
    "Mum's anguish at police tweet",
    "Mamoudou Athie on Pixar's Elemental",
    "Why 'steel rain' cluster munitions won't break NATO unity",
    "Rail and Tube strikes: Full list of dates and services affected",
    "Landslides, heat warnings and deadly flash floods in week of wild world weather",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Further tube strike dates announced as drivers plan walkout",
    "Injuries at Pamplona bull runs after protests against 'terrifying mob'",
    "Dad who died in motorbike crash sold car due to cost of living",
    "Biden says US-UK relationship 'rock solid', despite disagreements over Ukraine",
    "Jurors in Lucy Letby baby deaths trial sent out to consider verdicts",
    "Water giant United Utilities strikes £1.8bn pension deal",
    "Aspiring actor 'woke to find Kevin Spacey performing sex act on him'",
    "EasyJet cancels more than 1,000 summer flights",
    "Night bus services in Glasgow scrapped due to lack of passengers",
    "British man dies after falling 160ft during Mont Blanc hike - reports",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Scottish isles with sharks and minke whales to receive National Trust protection",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Thames Water secures cash from shareholders and BT's search for new CEO",
    "Yes to trees, not tree-huggers | Rachel Reeves and Victoria Atkins",
    "Mortgages are going up, why aren’t savings?",
    "Ange: No assurances over Kane's Spurs future",
    "Arsenal hoping to sign Rice before US tour | Timber arrival imminent",
    "Norris explains key factor in holding off Hamilton in Silverstone battle",
    "Met 'assessing information' after BBC meeting over presenter claims"
]