[
    "Government to launch legal action over COVID inquiry demanding Boris Johnson's WhatsApps",
    "Suspended Labour MP 'boasted' about taking sex workers to parliament bar, claim colleagues",
    "Joe Biden trips and falls during graduation ceremony",
    "Man arrested over Bournemouth beach deaths released under investigation",
    "BA hit with $1.1m fine by US government",
    "ITV boss called to answer questions by MPs on safeguarding after Phillip Schofield affair",
    "Revealed: Queen hit Bohemian Rhapsody could have been called something else",
    "Moment Kanye West 'assaults photojournalist'",
    "Ukraine joining NATO 'part of our defence'",
    "Aerial footage shows Highlands wildfire",
    "Bournemouth witnesses speak out",
    "Queen feeds horse: 'Are you a Polo lover?'",
    "Government 'carefully considering next steps'",
    "5G conspiracy theorists found guilty",
    "William and Kate at Jordanian prince's wedding",
    "Bournemouth witness: 'We knew it was serious'",
    "Meet world's first ultra-realistic robot",
    "Bournemouth: 'No physical contact with vessel'",
    "Kyiv mayor: 'It's genocide against Ukraine'",
    "Kyiv missile 'landed in residential area'",
    "Missile debris hits busy Kyiv road",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Drone 'attack' damages Moscow buildings",
    "Which jobs are overlooked by young people?",
    "US debt ceiling: Why is it important?",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Wiegman: 'Everyone is welcome in the game'",
    "US court to hear challenge over Prince Harry's visa",
    "'Monthly mortgage £1,450 from £790'",
    "'If someone needs help you have to help'",
    "Millennials not getting right wing with age",
    "'We're not heading to the 1970s'",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "Why Met chief is confident about plan for cops to stop attending mental health incidents",
    "The UK trains impacted by strike action this week",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "The rise and fall of Phillip Schofield: A timeline of his departure from ITV",
    "William and Kate surprise guests at Jordan royal wedding",
    "Highland wildfire burns nearly six square miles of land as crews tackle hotspots",
    "Gordon Brown forms group with Labour politicians calling for UK democracy reform",
    "Teenage girl dies after swimming in reservoir",
    "Screwdriver killer jailed for life after inflicting 199 injuries on young mum",
    "'Bonnie and Clyde' 5G conspiracy theorists guilty of plotting attacks on masts and MPs",
    "Nadhim Zahawi sparks debate after calling for Sunak to scrap 'morally wrong' inheritance tax",
    "Police search for man after woman attacked with boiling water",
    "Madeleine McCann: Police recover items in Portuguese reservoir search",
    "World's first humanoid robot creates art - but how can we trust AI behaviour?",
    "Confidence in RAF chief and leadership team hits all time low",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "Cars, cruises and the cost of a house",
    "'I'm scared': What it's like to be LGBTQ+ in a country where you could be killed",
    "Migrant crisis: The people found at sea",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Broad and 'Bazball' share centre stage as England dominate",
    "Why Mourinho has gone too far this time",
    "Man Utd to approach Chelsea over Mount this week",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Joy as baby donkey stolen from farm is reunited with her mother"
]