[
    "Parents who murdered baby on Christmas Day after 'savage' abuse jailed",
    "Transgender women banned from competitive female cycling events",
    "Passenger opens plane door mid-flight",
    "Banned footballer bet on own team to lose",
    "Elon Musk wins bid to put microchips in people's brains",
    "Man accused of raping 15-year-old girl in sea",
    "'Killer' bear spared death after being linked to two attacks on humans",
    "TikTok prankster arrested on suspicion of breaching court order issued two days ago",
    "Net migration rises to new record figure for a calendar year",
    "Big new net migration number is like adding a new city to the UK - but it's complicated",
    "'What is the point of her?'",
    "Dnipro clinic destroyed in missile strike",
    "What is quantum navigation?",
    "John Cleese arrives at Prince Harry case",
    "Hunt should be 'applauded'",
    "Drone video shows Mexico volcano crater",
    "Unpaid carer: 'It's very challenging'",
    "Two-minute tornado hits Miami",
    "Child hit by police vehicle",
    "CCTV shows e-bike battery explode",
    "Hunt: Inflation fall not 'automatic'",
    "'Police Scotland is institutionally racist'",
    "McCann search enters third day",
    "Ron DeSantis: Making America anti-woke",
    "Brawl at airport in Chicago",
    "Huge flames engulf Sydney building",
    "Wagner 'withdrawing' from Bakhmut",
    "Charles and Camilla meet mini-mes",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "IMF: Cost of living crisis to continue",
    "'UK in race for green investment'",
    "'Almighty smash at front gate'",
    "'How are we going to cope with migration?'",
    "Tina Turner 'a kind and gentle lady'",
    "Farage on Brexit: 'I was never dishonest'",
    "'We want to do everything we can'",
    "Tina Turner shares secret of her success",
    "Turner 'massive loss to communities'",
    "Government wants pension schemes to invest more in UK - but not everyone is convinced",
    "GPs at 'breaking point' in England's most deprived areas",
    "What is security like at Downing Street?",
    "How Tina Turner inspired domestic violence survivors - but never let abuse define her",
    "Pink Floyd star Roger Waters condemned over 'Nazi costume' at Berlin concert",
    "Mortgage costs rise with 'worse to come' as inflation hits interest rates",
    "11 arrested over attempted murder of senior NI police detective - as CCTV images released",
    "Scotland could pilot UK-wide deposit return scheme",
    "Hugh Grant will take The Sun publisher to High Court over break-in claims",
    "Two killed in 'Russian air strike' on Ukrainian health clinic and vets",
    "Pregnancy test drug campaigners lose legal bid for damages",
    "Hottest day of the year so far forecast for bank holiday weekend",
    "First look inside £85m women-only jail without bars",
    "Chancellor comfortable with recession if it brings down inflation",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Flying debris hits cars in Guam typhoon",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "Net migration: What it means for the UK",
    "Migration, energy and AI in the workplace",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Toney diagnosed with gambling addiction | 13 bets on his team to lose",
    "Premier League final-day build-up: Dyche, Smith & Allardyce speak",
    "Sainz sets Monaco pace as Hamilton impresses in upgraded Mercedes",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Boy, 11, 'shot in the chest' by police officer he had called for help"
]