[
    "Who is Wagner Group leader?",
    "Mercenary boss was disaster waiting to happen for Putin",
    "Rebellion in Russia: How the Wagner Group revolt unfolded",
    "Human remains found in California mountains where actor Julian Sands disappeared",
    "Police looking into deaths of five people on Titanic submersible",
    "Kate joins Roger Federer at Wimbledon",
    "Stars to carry 'baton of hope' to raise awareness of suicide and help save lives",
    "Sunday's national newspaper front pages",
    "Elton John to say goodbye with final UK gig at Glastonbury Festival",
    "How does Wagner's strength measure up to the Russian military?",
    "Hot dog seller to mercenary boss: Who is Wagner Group leader Prigozhin?",
    "Dangerous Wagner mercenary boss was disaster waiting to happen for Putin",
    "Russia civil unrest triggered by Wagner mercenary mutiny offers hope to Ukrainians",
    "What is the threat posed by Wagner boss Yevgeny Prigozhin?",
    "Prigozhin's rebellion triggers Putin's most serious domestic crisis",
    "Putin accuses Prigozhin of treason",
    "Moscow correspondent analyses Prigozhin videos",
    "Heavy vaping risks for children",
    "Wagner group cheered in captured city",
    "Wagner leader's audio message calling off advance",
    "Putin 'very afraid', says Zelenskyy",
    "What's going on with mortgages?",
    "Wagner ad pulled down in Moscow",
    "'I feel good about Prigozhin'",
    "Russian firefighters tackle blaze",
    "Prigozhin: Russian military targeted Wagner",
    "Explosion at Russian oil depot",
    "Mother ship for Titanic sub docks",
    "Titan victim's stepson 'living a nightmare'",
    "Titan sub victim seen in footage",
    "ROV in sub debris search pictured",
    "Two sub victims voiced 'concerns'",
    "Killed CEO: 'I broke rules to make this'",
    "Has OceanGate followed protocols?",
    "Teen on Titan 'had a sense this was not okay'",
    "Missing sub: US Navy reveal new details",
    "Cousin: 'Hamish died doing something he loved'",
    "Wagner 'controls' Russian military HQ in city",
    "Life after Nova Kakhovka Dam breach",
    "Counteroffensive will be 'slow'",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Roe v Wade: US abortion rights a year on",
    "What are the pros and cons of electric cars?",
    "Saudi Arabia 'sportswashing' claims explained",
    "Ex-Russian PM: 'Putin himself curated this problem'",
    "US senator confronted on abortion rights",
    "Elton John 'anxious' ahead of Glastonbury",
    "'These people are all so intimidating'",
    "Sir Elton 'not chilling out' after farewell tour",
    "Rick Astley on being 'Glastonbury virgin'",
    "Killed CEO was 'committed to safety'",
    "Chancellor's mortgage plan might mitigate against chaos - but it will not prevent the pain",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "'My baby lived for just 93 minutes': The reality of life under the new US abortion laws",
    "It was once Europe's second biggest reservoir - now it's nearly empty after 'barbaric act'",
    "What happened to the Titan sub",
    "Train carrying hazardous material crashes into river - yellow liquid pours into water",
    "Ex-Premier League striker dies aged 45",
    "Three-storey house collapses in London",
    "Ross Kemp turned down Titanic sub trip over safety fears",
    "Thunderstorms and 'large hail' forecast as Met Office issues yellow warning",
    "6% public sector pay rises 'may be blocked'",
    "Water company boss blames people working from home for hosepipe ban",
    "Rick Astley plays Glastonbury - and shows off hidden talent on stage",
    "University friends pay tribute to 'generous and kind person' killed in Titan sub implosion",
    "Because they're worth it: How salon tents take Glastonbury from grime to glam",
    "Backstage With… The stars of Wes Anderson's celebrity packed Asteroid City",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "Mortgages, interest rates and women in business",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Mount 'impasse' forces Man Utd to focus on other targets",
    "Beaumont double-ton breaks England record but Australia stretch lead",
    "Transfer Centre LIVE! Mount, Rice, Havertz latest",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime."
]