[
    "'I had a terrible life. I just kept going' - The trauma and triumph of rock icon Tina Turner",
    "Beyonce and Oprah Winfrey lead tributes to rock queen Tina Turner",
    "Ship grounded in Egypt's Suez Canal - one of world's busiest shipping routes",
    "'Zombie drug' claims first victim in UK and could be in widespread use across the country",
    "Anti-Putin paramilitary group says there will be more incursions into Russia",
    "Mum of teen killed in Cardiff crash says son was 'loving' and not 'how media portrayed him'",
    "Police recover body in search for missing woman in Lancashire",
    "GPs will have to give patients the option to go private to help tackle NHS backlog",
    "Paralysed man walks again thanks to 'digital bridge' that reconnects brain and spinal cord",
    "Bags removed by Madeleine McCann police during reservoir search",
    "Officials in Madeleine McCann search focusing on concentrated area of reservoir",
    "How events unfolded in the disappearance of Madeleine McCann",
    "McCann search: Police scour reservoir area",
    "Tina Turner shares secret of her success",
    "Turner 'massive loss to communities'",
    "Timeline of events in Cardiff crash",
    "How do people feel about immigration?",
    "DeSantis: 'We must revitalise America'",
    "Watch: Tina Turner sings 'The Best'",
    "CCTV shows seconds before Cardiff crash",
    "Police continue search for McCann",
    "Tributes paid to Cardiff crash victims",
    "Runaway cow caught on Detroit motorway",
    "Angry Speaker asks MP to leave PMQs",
    "Taylor Swift's piano plays itself",
    "Angry man shoves activist to ground",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Are  F-16s a game changer for Ukraine?",
    "Core inflation worries economists",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "IMF: Cost of living crisis to continue",
    "What is the Ministerial Code?",
    "Retracing Nikki Allan's last known steps",
    "McCann reservoir search explained",
    "People in Cardiff 'angry' at police",
    "'I've complained about Spotify'",
    "People smuggled into UK on worker visas",
    "'Everyone deserves help' when it comes to suicide",
    "'Trump will not be silenced'",
    "'The world has moved on' from partygate",
    "Kanda family speaks about son's murder",
    "Paralysis breakthrough is quite astonishing - and AI is the key",
    "Some good news, but the inflation figures will deeply worry economists",
    "Why Sean Dyche could be the most effective manager in Premier League history",
    "'He's a Trump wannabe': Ron DeSantis as president is exciting for some, but frightening for others",
    "What is the IOPC and what powers does it have over the police?",
    "Thursday's national newspaper front pages",
    "Doing the Nutbush: One country's strange love affair with Tina Turner",
    "Disadvantaged children risk being 'worse off' under childcare plans",
    "Nurse says 'raw sewage' on hospital floor may have contributed to baby deaths",
    "Simply The Best: Tina Turner in pictures",
    "Sunak meets tech bosses over 'existential' artificial intelligence risks",
    "Onlookers in town synonymous with Madeleine McCann case hoping search will finally bring answers",
    "Facebook urged to 'stand up for babies' over unsafe formula milk ads",
    "Shadow chancellor takes inspiration from Biden's economic policy in Washington speech",
    "Woman admits to stalking and harassing two Premier League footballers",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Ron DeSantis: The Republican rival who could trump Trump",
    "The Podcast Show, inflation and special musical guests from The Charlatans and Spandau Ballet",
    "How 'fake' families are smuggled into the UK on skilled worker visas",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Brighton seal Europa League spot after Enciso screamer holds Man City",
    "Sterling, White left out of England squad | Dunk, Eze called up",
    "Rangers end Hearts' third-place hopes after draw",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "'Queen of Rock 'n' Roll' Tina Turner dies"
]