[
    "Fresh allegations made against BBC presenter",
    "Jeremy Vine urges unnamed BBC presenter to come forward",
    "G7's new security arrangement with Ukraine could 'return peace to Europe', PM declares",
    "Woman who helped Charles Manson kill two people released from jail after 53 years",
    "Note found under Aretha Franklin's sofa is legal will, jury rules",
    "Wednesday's national newspaper front pages",
    "Sunak suggests no tax cuts before next election - as he sets out 'overriding priority'",
    "Stabbed teacher addresses 'misinformation' about incident - as boy charged",
    "Has Earth reached the Anthropocene epoch?",
    "What people have been searching online over BBC presenter scandal",
    "Everything we know about claims surrounding BBC presenter",
    "BBC presenter scandal: Second person makes claims as director-general faces questions",
    "How the BBC says it handled complaint into presenter",
    "Timeline of events in BBC presenter scandal",
    "Why hasn't the BBC presenter been named publicly?",
    "What is parliamentary privilege?",
    "Sunak says BBC presenter allegations 'shocking' but confident 'rigorous' investigation under way",
    "BBC presenter scandal: Young person's parents and lawyer at odds",
    "BBC presenter claims: Questions over trust and transparency",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "BBC presenter should only be named after 'full' investigation, says justice secretary",
    "Culture sec avoids questions on BBC scandal",
    "Questions BBC haven't answered",
    "'Armed' man barricades himself in Las Vegas hotel",
    "World leaders take photo after NATO dinner",
    "Online impact of BBC allegations",
    "Notre-Dame roof supports arrive by boat",
    "Zelenskyy arrives at NATO summit dinner",
    "Irish 'Rambo': Ukraine will 'haunt me'",
    "NATO chief: Ukraine will become member",
    "Ukraine will 'make NATO stronger'",
    "People smuggler sentenced over 39 deaths",
    "Deadly flash floods hit India",
    "BBC boss 'not spoken to accused presenter'",
    "Travel through 5,000 galaxies",
    "Ukraine forces 'strike Russian position'",
    "Death of pregnant YouTuber left mum 'numb'",
    "Elevated road collapse in Bangkok",
    "Harry Styles hit in face at show",
    "Bulgaria PM on cluster bombs in Ukraine",
    "Czech leader warns of 'war fatigue'",
    "Ukraine will be 'relieved' after NATO summit",
    "Return of missing Russian general explained",
    "Kremlin confirms Putin met with Prigozhin",
    "General seen for first time since failed mutiny",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "What happened in Zaporizhzhia?",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "'We were walking over eggshells'",
    "Back from the Ashes - Broad on pub fire",
    "Should MPs name BBC presenter?",
    "PM: BBC allegations are 'shocking'",
    "Oppenheimer film 'puts audience in bunker'",
    "BBC 'may need to be investigated'",
    "Chesney Hawkes recounts 'horror flight'",
    "Why it's becoming more difficult for BBC presenter's identity to remain under wraps",
    "Wage growth figures defy economic gravity - but there are some signs of a labour market slowdown",
    "The man spearheading the fastest growing social media app in history",
    "Ireland's national broadcaster RTE is facing a crisis - and this is why",
    "Rail and Tube strikes: Full list of dates and services affected",
    "Russian submarine commander shot dead on morning run",
    "Police have 'no clue' what has happened to toddler missing since Saturday",
    "'It's slaughter': Irishman dubbed 'Rambo' tells of horror of fighting in Ukraine",
    "Liz Truss launches 'Growth Commission'",
    "Asylum seekers to be housed at Essex RAF base from Wednesday",
    "Ireland's biggest TV star says he has been 'cancelled' over RTE secret payment row",
    "Man who killed 39 people jailed",
    "Zelenskyy criticises 'absurd' lack of timetable for Ukraine to join NATO",
    "Competition watchdog to reopen talks with Microsoft over Activision Blizzard merger",
    "Names of Carrie and Boris Johnson's third child revealed - and one is inspired by Greek mythology",
    "Heatwave to grip southern Europe until at least end of next week",
    "Rosebank oil field decision will not come before recess, Sky News understands",
    "'Gold rush' warning over plans to mine precious metals in deep sea",
    "Extreme heat 'killed more than 60,000 people in Europe last year'",
    "Landslides, heat warnings and deadly flash floods in week of wild world weather",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Scottish isles with sharks and minke whales to receive National Trust protection",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Wage inflation, cricket and business and pensions plans",
    "Kane set to return to Tottenham for talks with Postecoglou over future",
    "Ricciardo returns to F1 with AlphaTauri as replacement for sacked De Vries",
    "Djokovic grinds down Rublev to claim Wimbledon semi-final place",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "BBC chief to face reporters - as parents respond to young person rubbishing story | Live updates",
    "Turkey makes U-turn on Sweden as NATO summit begins | War latest",
    "Olympic champion Caster Semenya wins human rights court appeal over athletics testosterone rules",
    "Tuesday's national newspaper front pages",
    "Alarming rise in 'zombie drug' deaths in America, weeks after first UK fatality",
    "Fixed mortgage rate at 2008 high after exceeding mini-budget peak"
]