[
    "Rookie RAF pilots prompted to quit as they face year-long wait due to training 'shambles'",
    "Parents who murdered baby on Christmas Day after 'savage' abuse jailed",
    "Passenger opens plane door mid-flight",
    "Transgender women banned from competitive female cycling events",
    "Wrexham fan with terminal cancer meets Ryan Reynolds as last wish",
    "'Honey Monster' killer jailed for life for double jeopardy murder of escort",
    "Civil Service union suspends strike ballot to start talks with government",
    "Celine Dion 'heartbroken' as she cancels rest of world tour",
    "Panic as passenger opens plane door",
    "Elon Musk brain chip firm trials approved",
    "Boy hit by police car 'in critical condition'",
    "Trans cycling rule change explained",
    "Murdered baby 'in immense pain' in final days",
    "Parents who murdered 10-month-old baby jailed",
    "Finley Boden captured on CCTV before death",
    "Dnipro clinic destroyed in missile strike",
    "What is quantum navigation?",
    "Drone video shows Mexico volcano crater",
    "CCTV shows e-bike battery explode",
    "'Police Scotland is institutionally racist'",
    "McCann search enters third day",
    "Ron DeSantis: Making America anti-woke",
    "Brawl at airport in Chicago",
    "Huge flames engulf Sydney building",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Wagner 'withdrawing' from Bakhmut",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "Hunt should be 'applauded'",
    "Hunt: Inflation fall not 'automatic'",
    "'UK in race for green investment'",
    "'Almighty smash at front gate'",
    "'How are we going to cope with migration?'",
    "Tina Turner 'a kind and gentle lady'",
    "Farage on Brexit: 'I was never dishonest'",
    "'We want to do everything we can'",
    "Tina Turner shares secret of her success",
    "Government wants pension schemes to invest more in UK - but not everyone is convinced",
    "GPs at 'breaking point' in England's most deprived areas",
    "What is security like at Downing Street?",
    "How Tina Turner inspired domestic violence survivors - but never let abuse define her",
    "Killer whales 'tear bits off boat' in 'scary' hour-long experience off Spanish coast",
    "Suffragette Indian princess commemorated with blue plaque",
    "Boy remains in critical condition after being hit by police vehicle",
    "Bomb squad called and school evacuated after unexploded ordnance brought into building",
    "Man accused of raping 15-year-old girl in sea",
    "'Killer' bear spared death after being linked to two attacks on humans",
    "Banned footballer bet on own team to lose",
    "TikTok prankster arrested on suspicion of breaching court order issued two days ago",
    "Community initiative announced after Cardiff riot triggered by teenagers' deaths",
    "Carer who climbed into bed of teenage girl claims he 'may have been sleepwalking'",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Flying debris hits cars in Guam typhoon",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Toney diagnosed with gambling addiction | 13 bets on his team to lose",
    "Verstappen edges Ferraris in Monaco as crash halts Sainz's progress",
    "Premier League final day: What's still left to play for?",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "The tragic story of Tina Turner's sons",
    "Pink Floyd star Roger Waters condemned over 'Nazi costume' at Berlin concert"
]