[
    "Terror and desperation inside Bakhmut's blackened nightmare as Ukrainians refuse to yield",
    "Man dies after attack by 'dangerously out of control' dog",
    "Boris Johnson to become father to eighth child after wife Carrie announces pregnancy",
    "Police officer clings to roof of speeding car",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Met Police officer sacked after sexually assaulting child at a party",
    "'Numb to life': Victim tells court of ordeal as Philip Schofield's brother jailed for 12 years",
    "Daughter of Rolling Stones frontman Mick Jagger fined for attacking police officer",
    "Police officer jailed over Boxing Day crash that left boy, 15, with life-changing injuries",
    "A timeline of Harry and Meghan's 'car chase'",
    "Harry & Meghan's 'car chase' route",
    "What have people said about the 'paparazzi chase'?",
    "A hounded couple or a pair of hypocrites? Public opinion on Harry and Meghan as divided as ever",
    "It's impossible not to be reminded of Diana after 'dangerous' pursuit of Harry and Meghan",
    "A history of Harry v the paparazzi",
    "Arab League summit: Zelenskyy and Assad speak",
    "Police arrest leader of major drug gang",
    "Suspects try to ditch phones on roof",
    "Moment police arrest iSpoof fraudster",
    "Angry passer-by throws protester to the ground",
    "Testing how bad sheep burps are for the planet",
    "Russia strikes Zelenskyy's hometown",
    "China calls the G7 a 'clique'",
    "Ukraine war: Inside the battle for Bakhmut",
    "G7 leaders plant trees in Hiroshima",
    "More than 1,000 air rage cases last year",
    "US Councilman arrested with crack pipe",
    "Rishi Sunak: The full interview",
    "Where are England's missing pupils?",
    "Russia's latest missile attacks",
    "Kyiv hit by fresh wave of missiles",
    "Ukraine commander rallies Bakhmut troops",
    "Inside the battle for Bakhmut",
    "What happened on Zelenskyy's visit?",
    "'You can't believe a word they say'",
    "Ukraine: What aid has UK provided?",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What could happen next in Ukraine?",
    "Pakistan: What we know so far",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "PM building strong ties with Tokyo",
    "UK battery industry 'doomed by govt'",
    "Syria's neighbours have accepted Assad has won the war - and he's not going anywhere",
    "Outrage over massive migration is muted but muddled government really matters",
    "Absence in schools is now at crisis point. This is Teddy's story",
    "Abandoned camps hint at a far darker next chapter for China's Uyghur people",
    "Man caught smuggling scissors in 'peculiar location' of his body",
    "Scale of destruction in Sudan revealed by satellite images before and after conflict",
    "Man, 35, jailed for running multimillion-pound criminal website",
    "Tesco chair to step down early after allegations over personal conduct",
    "Big Ben fails to bong for second time in a week",
    "Syrian President Assad attends Arab League summit after 12-year ban",
    "Who are the UK's richest '35 under 35'? See the full list",
    "Nurse accused of murdering babies denies she 'enjoyed the aftermath' of child's death",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "Could AI really take your job?",
    "Water firms apologise, BT shrinks workforce, and Royal Mail in the red",
    "Cannes Film Festival Special: Johnny Depp, Indiana Jones and Richard Gere",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "PGA Championship: Scheffler leads DeChambeau after fast start LIVE!",
    "Feyenoord fearing manager Slot will move to Tottenham",
    "Play-offs: Barnsley & Bolton battle to reach Wembley LIVE! & highlights",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Paparazzi reject Harry and Meghan's demand to see photos from 'chase' in mocking letter"
]