[
    "This is how AI could change the future of journalism",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Watch: Could AI do the job of a news organisation?",
    "Twitter threatens to sue Facebook owner Meta over new Threads platform",
    "New satellite images show unidentifiable shapes at Zaporizhzhia nuclear plant",
    "Britney Spears 'hit in the face' by 7ft 4in tall NBA star's bodyguard",
    "'Profoundly shocked': Girl, 8, dies after car crashes into school on last day of term",
    "First drug to slow progression of Alzheimer's disease approved in US",
    "Man 'missing' for eight years actually returned home the next day, police discover",
    "Firm that owned submersible Titan suspends commercial operations",
    "Friday's national newspaper front pages",
    "Package holiday boom of 1960s 'fuels record high in skin cancer cases'",
    "How Sky News created an AI reporter",
    "Users react to Meta's launch of Threads",
    "Man handcuffs himself to Buckingham Palace gates",
    "Man guilty of beautician's murder",
    "'How will Labour level up schools?'",
    "Lukashenko: Putin 'won't whack' Prigozhin",
    "Swimmers flee water after shark spotted",
    "Wagner chief's home raided",
    "Gun found after police chase rapper",
    "'Tragic end of term for the girls'",
    "Rabbit hunt: Police seek bunny burglar",
    "Protesters interrupt Starmer speech",
    "Rollercoaster riders trapped upside down",
    "Trapped cows rescued from barn fire",
    "Could AI replace news organisations?",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "'It's not always about spending more money'",
    "'Government will appeal Rwanda court decision'",
    "NHS in 'critical condition' at 75 years",
    "Michael Rosen: NHS model 'not wrong'",
    "'We're not being honest about healthcare'",
    "'How high will NHS waiting list go?'",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Chart shows who's most likely to win Ashes third Test after another thrilling day",
    "Video: Women at war in Mexico",
    "Three charged with terror offence over attempted murder of senior police detective",
    "'Spectacular' thunderstorms to hit England as heat-health warning issued",
    "Ministers told to set out plans for 'floundering' HS2 station",
    "Elle Edwards: Man, 23, guilty of murdering beautician in Christmas Eve shooting",
    "Man cuffs himself to Buckingham Palace and threatens self-harm",
    "Northern Lights could be visible in the UK tonight",
    "New app Threads draws 30 million users on first day – but what do people think about it?",
    "RMT to 'shut down' London Underground during strike action later this month",
    "Six-figure grant given to council for asylum seekers' 'English-speaking lessons' and 'activities'",
    "Villagers forced to boil water before use 'after discovering tadpoles in supply'",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Zuckerberg v Musk: Will Threads 'kill' Twitter?",
    "Currys results, digital transformation and start-up struggles",
    "Could AI make this podcast?",
    "Murray one set away from third round | Tsitsipas clash to resume on Friday",
    "Sizzling Wood shreds Australia after Marsh punishes costly drop",
    "Transfer Centre! Kane, Rice, De Gea latest",
    "A severe money market shift signals worse to come for personal and public finances | Ed Conway",
    "Chesney Hawkes and wife sent tearful voice notes to children as plane plunged 20,000ft"
]