[
    "'Good chance' Rice will leave West Ham - Moyes",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Champions Chiefs to host Lions in NFL opener",
    "Guardiola 'can't understand' Man City scheduling",
    "Sammy named West Indies white-ball coach",
    "Stenson avoids fines by resigning from DP World Tour",
    "Focus on Kane's long-term future can wait - Mason",
    "Live. County Championship, day two",
    "Messi to start for first time since PSG suspension",
    "'Naive' to say players will reject 12-month T20 deals",
    "Russia and Belarus appeal against IPC ban upheld",
    "We may not have Rice next season - Moyes. VideoWe may not have Rice next season - Moyes",
    "Sutton's Premier League predictions v Def Leppard's Joe Elliott",
    "'If backed, Mourinho is the manager for PSG'",
    "Nuggets claim semi-final series win over Suns",
    "Haaland and Kerr win Football Writers' awards",
    "'Humble like a grandad' - why 'special' Allardyce can save Leeds",
    "Dominant Vollering wins Itzulia Women opener",
    "Norrie beats Muller for winning start in Rome",
    "'Baby-faced assassin' leading Chelsea's trophy hunt",
    "De Sousa handed 10-month ban for betting offence",
    "Saracens recall internationals for Saints semi-final",
    "Man Utd fear missing out on Kane - Friday's gossip",
    "Coventry's 'firefighter' Robins going under the radar",
    "Why Beale's Rangers 'revamp' is now huge rebuild",
    "Henshaw back for Leinster's Munster semi-final",
    "Follow the unwritten rule - fantasy football tips",
    "I lost seven years to drink and drugs - O'Sullivan",
    "How Elliott scored Ashes century while breastfeeding at lunch and tea",
    "How green are Premier League clubs in 2023?",
    "How a 'desperation measure' transformed Sevilla",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "Klopp and Ten Hag time-waste too - Allardyce. VideoKlopp and Ten Hag time-waste too - Allardyce",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Scrum V podcast: At home with Dan Biggar. AudioScrum V podcast: At home with Dan Biggar",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "En-Nesyri opener cancelled out by late Gatti goal",
    "Benrahma penalty helps West Ham take slender lead",
    "SA's Liebenberg on skippering Tigers to play-offs",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]