[
    "Djokovic beats ailing Alcaraz to book final with Ruud",
    "India have hope after third-day final fightback",
    "Murray fights back to reach Surbiton semi-finals",
    "West Ham charged by Uefa for incidents in final",
    "Live. Watch: Fightzone Boxing – Farrag v Braithwaite",
    "Sutton's Champions League final prediction v Noel Gallagher & Blanco",
    "Rose & I agreed merger silence in Canada - McIlroy",
    "'Hysterical & hated at times - but Guardiola is already the greatest'",
    "The 'normal one' who turned Inter fortunes around",
    "Stress of facing Djokovic caused cramps - Alcaraz",
    "Panthers cut Stanley Cup finals deficit to 2-1",
    "Women's tennis needs more big rivalries - Barker",
    "Man Utd owners discuss Qatari bid with PSG chairman",
    "Liverpool's Keita to join Werder Bremen this summer",
    "Five games that helped Man Utd win Treble in 1999",
    "New study shows increased dementia risk in football",
    "Bristol to replace London Irish in Champions Cup",
    "Bayern Munich sign RB Leipzig midfielder Laimer",
    "How well do you remember this season's Champions League?",
    "Britons make weight for world-title triple header",
    "Neville joins Canada men's coaching staff",
    "Chelsea sign USA forward Macario from Lyon",
    "Hickman seals record-breaking Superstock TT double",
    "Wheelchair Rugby League World Cup referee suspended",
    "GB's Hewett & Reid reach French Open doubles final",
    "'Taylor & Lopez dislike each other - this is real'",
    "UFC fans will miss me when I retire - Nunes",
    "'He never hides' - new Liverpool signing Mac Allister",
    "Can you name these Ashes cricketers?",
    "Scheduling shows women's tennis is undervalued - Pegula column",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "We've shown up every time - Dias. VideoWe've shown up every time - Dias",
    "De Bruyne on love at first sight with Haaland. VideoDe Bruyne on love at first sight with Haaland",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Chelsea target says Inter 'have nothing to lose'",
    "'My mind wants to get angry but my body can't back it up'",
    "Football in Senegal suspended after deadly protests",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]