[
    "Live. Transfer latest and football news",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Gold medals will not solve my problems - Peaty",
    "Messi? Kane? Bellingham? Epic transfer window awaits",
    "Dhoni's delayed retirement delights cricket fans",
    "Heat beat Celtics in decider to reach NBA finals",
    "Maguire has to decide on Man Utd future - Ten Hag",
    "McCullum relishing 'formidable' Australia challenge",
    "Last-ball drama as Chennai beat Gujarat to win IPL",
    "How did BBC pundits' predictions turn out?",
    "'Chelsea owners cannot afford for Pochettino to fail'",
    "Levy blocks Kane Man Utd move - Tuesday's gossip",
    "Who was on an upward curve and who was sleepwalking?",
    "Nisbet earns Scotland recall as Adams misses out",
    "Player abuse getting worse - Stephens",
    "Leicester chairman was sent 'abusive' messages",
    "Djokovic & Alcaraz begin Paris campaigns with wins",
    "Time to tackle our Manchester derby FA Cup quiz",
    "Sheff Wed promotion the stuff of dreams - Moore",
    "Goodbye FC Hollywood? Bayern Munich plan rebuild",
    "Ireland 'in very different place' to 2019 England Test",
    "Sheff Wed beat Barnsley with 123rd-minute winner",
    "Who is almost unplayable? Garth's Team of the Season",
    "The inside story of Newcastle's Champions League return",
    "Norrie unhappy at 'absurd' call in French Open win",
    "Vote for your Premier League award winners",
    "Wackiest moments of the football season",
    "20 teams, 200 questions - the big Premier League quiz",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "We want to be the real deal - Arteta. VideoWe want to be the real deal - Arteta",
    "Can Everton ever be great again? VideoCan Everton ever be great again?",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Dramatic Doucoure goal keeps Everton in Premier League",
    "Awoniyi scores again as Forest draw at Palace",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]