[
    "Live. Euro 2024 qualifier: England leading Malta through early own goal",
    "Live. US Open round two - Clark leads as McIlroy battles",
    "Root ton steers England to surprise first-day declaration",
    "Live. Euro 2024 qualifier: Wales 1-1 Armenia",
    "Live. Euro 2024 qualifier: NI holding firm against Danes",
    "Live. Euro 2024 qualifier: Greece lead Republic after early penalty",
    "Canadian GP first practice ended by CCTV failure",
    "Woods will miss the Open to continue recovery",
    "Berhalter reappointed United States head coach",
    "Mader, 26, dies after falling into ravine during Tour de Suisse",
    "NBA suspends Morant for 25 games over gun videos",
    "Live. T20 Blast: Surrey set Somerset 196 to win as South Group top two meet - follow eight games",
    "'Have you got your sandpaper, Dave?' - Ashes crowd feast on first morning",
    "Battle Stations: Where the Ashes will be won and lost",
    "All you need to know about the 2023 men's Ashes",
    "Leicester name Man City's Maresca as manager",
    "Felix wants better maternity care for black women after Bowie death",
    "Homophobic chanting stops USA-Mexico as four sent off",
    "Man City v Arsenal Community Shield date confirmed",
    "McGregor accused of sex assault after NBA game",
    "Brighton to sign Dortmund midfielder Dahoud on free",
    "The state of play in Euro 2024 qualifying",
    "Pettis craves legacy in historic Pitbull fight",
    "GB women lose at home to Germany in Pro League",
    "'Rodgers would have it all to prove in more testing arena'",
    "Real Madrid interest gave Bellingham 'goosebumps'",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Zimbabwe ready to shake off global 'bad press'",
    "SA20 boosted economies and 'exceeded expectations'",
    "Central African Republic aim for Afcon history",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]