[
    "Arsenal agree £65m deal for Chelsea forward Havertz",
    "'England, keep creating chaos but please pick your moments'",
    "'Premier League should stop transfers to Saudi'",
    "Chelsea reject second Man Utd bid of £50m for Mount",
    "Man City agree £30m deal for Chelsea's Kovacic",
    "La Rochelle & Leinster to meet in Champions Cup",
    "Maroons retain Origin series with win over Blues",
    "Ronaldo scores winner on historic 200th cap",
    "Chandler casts doubt over McGregor fight",
    "Bowler Filer to make debut in Women's Ashes Test",
    "Williams & Boulter among Wimbledon wildcards",
    "The ruin, rise and revenge of Mitchell Johnson",
    "'How are we supposed to live our normal lives during Ashes?'",
    "When pride of cricket whites meets period anxiety",
    "'Cummins is The Boss but England can fight back'",
    "Players fined for slow over rate in Ashes opener",
    "Almost two-thirds of English fans 'oppose' VAR",
    "'Pivotal' moment in women's tennis where nobody could leave the room",
    "Maguire given retrial date after Greek arrest",
    "Kante agrees to join Saudi champions Al-Ittihad",
    "Kroos signs one-year deal at Real Madrid",
    "'Win puts us within touching distance' - Robertson",
    "Seven PFL fighters hit with doping suspensions",
    "Five players to watch at the Under-21 Euros",
    "Fulham want Man Utd's Fred - Wednesday's gossip",
    "Arsenal withdraw home shirt after 'design error'",
    "'World's fastest accountant' who has stunned Europe",
    "'Starboy smile a sign of how times have changed for England'",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "The football club with no players. VideoThe football club with no players",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Ghana's record goalscorer Gyan retires",
    "Mane double helps Senegal beat Brazil in friendly",
    "'We are the friend' - inspiring those fleeing terror",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]