[
    "Live. Root-inspired England motoring against Australia",
    "Live. Transfer latest and build-up to international matches",
    "Dutch striker Promes jailed for stabbing cousin",
    "'I'd go through 100 Sundays like this to win major'",
    "Verstappen 'in the same sentence as the greats'",
    "Rodgers completes return as Celtic manager",
    "Doubts over Treble frustrating - Man City chairman",
    "Spain win Nations League final on penalties",
    "Clark holds off McIlroy's challenge to win US Open",
    "Sometimes I wish I'd never won US Open - Raducanu",
    "Real Madrid sign ex-Stoke striker Joselu on loan",
    "Arsenal willing to sell Partey - Monday's gossip",
    "Robinson 'does not care' about Khawaja celebration",
    "What is the best moment of the Women's Ashes?",
    "'The 20 minutes when the real Australia turned up'",
    "Ashes digest: Bazball closes on bowling record & Darth Vader is shown the door",
    "Hassell-Collins dropped from England training squad",
    "Shaw 'would love' Kane and Rice at Man Utd",
    "Three Lions tapping up team-mates, jokes Southgate",
    "New research aims to reduce horse racing injuries",
    "Verstappen wins to equal Senna victories total",
    "Can North Macedonia do it again? Rank these international shocks",
    "Boulter wins first WTA title in all-British final",
    "'Magic Haaland upstaged by Scotland's act of escapology'",
    "'Winning gold makes the difficult times worthwhile' - Sawyers column",
    "Maguire wins second LPGA Tour title in Michigan",
    "Ferrari 'making our life way too difficult' - Leclerc",
    "'Shock but no surprise as cycling looks for answers'",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Football Daily: England cruise past Malta. AudioFootball Daily: England cruise past Malta",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Zimbabwe ready to shake off global 'bad press'",
    "SA20 boosted economies and 'exceeded expectations'",
    "Central African Republic aim for Afcon history",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]