[
    "Live. England World Cup squad announcement, football news and transfer latest",
    "'Mourinho feeds Rome with dreams and emotion'",
    "TV gang jailed for illegally streaming Premier League games",
    "How Botox jabs resurrected bowler Tongue's career",
    "Webb announces Wales retirement aged 34",
    "850,000 World Cup tickets sold with 50 days to go",
    "Man Utd's Martial to miss FA Cup final with injury",
    "IOC condemns police action against India wrestlers",
    "Ryder Cup should be best v best, says Rahm",
    "Juventus to pay £620,000 fine in plea deal",
    "Inverness eye 'fairytale' Scottish Cup win over Celtic",
    "Which managers have won most European trophies?",
    "Benzema eyes £346m Saudi move - Wednesday's gossip",
    "Norrie prepared for 'tough moments' in front of Paris crowd",
    "Medvedev 'happy' clay season over after shock French Open loss",
    "Teenager Andreeva credits Murray for French Open win",
    "Tongue to make England Test debut against Ireland",
    "Team of the season? Computer says...",
    "Messi? Kane? Bellingham? Epic transfer window awaits",
    "The big decisions Wiegman faces over World Cup squad",
    "France prop Haouas given jail sentence for hitting wife",
    "Zinchenko & Shevchenko to lead Ukraine charity teams",
    "How did winter World Cup shape Premier League season?",
    "Man City's Guardiola named LMA manager of the year",
    "Spartak Moscow's Promes accused of drug trafficking",
    "Was Monaco Grand Prix one that got away for Alonso?",
    "Ferrari 'far away from expectation' - Vasseur",
    "Gold medals will not solve my problems - Peaty",
    "The tennis generation that changed the world",
    "How did BBC pundits' predictions turn out?",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Lauren calls for tougher racism sanctions in Spain",
    "Jabeur through to second round of French Open",
    "Gbamin wants to leave Everton and end 'nightmare'",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]