[
    "Man City win third successive Premier League title",
    "Premier League: Man City champions as Forest secure safety with Arsenal win - reaction",
    "Live. Listen: US PGA round three - Conners leads as McIlroy falters",
    "Live. La Liga: Champions Barcelona trail Real Sociedad",
    "Forest win to seal safety and end Arsenal title hopes",
    "Firmino equaliser keeps Reds' top-four chances alive",
    "Casemiro stunner leaves Man Utd on brink of top four",
    "Everton boost survival hopes with 99th-minute leveller",
    "La Rochelle comeback stuns Leinster in thriller",
    "Ancelotti says he is staying on as Real Madrid boss",
    "Butler leads Miami to 2-0 advantage against Boston",
    "Casemiro keeps surprising us - Ten Hag. VideoCasemiro keeps surprising us - Ten Hag",
    "Live. US PGA Championship - leaderboard",
    "Chennai and Lucknow win to reach IPL play-offs",
    "Mbeumo double gives Brentford win at Spurs",
    "Halep charged with second anti-doping breach",
    "Spurs win secures WSL safety as Reading face drop",
    "'Massive decisions to make' - will Kane stay at 'shambolic' Spurs?",
    "'I think she can shock the world' - Cameron v Taylor predictions",
    "Thomas loses pink jersey and hits back over safety",
    "Griner feels 'love' from fans on competitive return",
    "'He wants to stay' - Ten Hag on Rashford contract saga",
    "'Going for the title like serving for Wimbledon'",
    "Spurs eye Chelsea keeper Mendy - Saturday's gossip",
    "'You fantasise about being like Bobby'",
    "Wigan come from behind to knock out Leeds",
    "Why Nadal's French Open absence is hard to imagine",
    "Sutton's Premier League predictions v stars of Woolf Women",
    "'I have had so many pinch-myself moments' - Jill Scott column",
    "Man Utd the team to target - fantasy football tips",
    "The 'squeaky-voiced' boss leading Man Utd's title bid",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "Watch Moore's passionate post-match speech. VideoWatch Moore's passionate post-match speech",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Football Daily: Treble time for Man City? AudioFootball Daily: Treble time for Man City?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Basketball fan shot dead at Libyan top-flight match",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]