[
    "Wasteful England defied by classy Khawaja century",
    "Live. Canadian Grand Prix qualifying in damp conditions - radio and text",
    "Scotland score two late goals to stun Norway",
    "McIlroy using 2014 Open win as inspiration as he chases Fowler",
    "'Shock but no surprise as cycling looks for answers'",
    "Arsenal still in talks for Chelsea forward Havertz",
    "Boulter to meet Burrage in all-British WTA final",
    "Murray beats Borges to move into Nottingham final",
    "'Stokes has told Australia \"I'm not scared of you\"'",
    "'Alexander-Arnold gives Southgate food for thought'",
    "Kulusevski completes permanent Tottenham move",
    "Pettis denies Pitbull historic third title",
    "'No excuse' for crucial no-ball, says Broad",
    "Live. England v Australia - first Test scorecard",
    "'Have you got your sandpaper, Dave?' - Ashes crowd feast on first morning",
    "'England land early punches against cagey Australia'",
    "'I don't agree - why do Wales need a slap in the face?'",
    "Berhalter reappointed United States head coach",
    "St Helens beat 12-man Hull to reach semi-finals",
    "Commentator Tyler to leave Sky Sports after 33 years",
    "Three teams pull out of Tour de Suisse after Mader death",
    "Romeo Beckham signs Brentford B deal",
    "Hodgkinson sets 400m record to win U23 title",
    "Woods will miss the Open to continue recovery",
    "Leicester name Man City's Maresca as manager",
    "Great Britain beat Germany in FIH Pro League",
    "Heavyweight stars Jones and Ngannou exchange words at PFL event",
    "Hunter and Wright named in King's Birthday Honours",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Football Daily: England cruise past Malta. AudioFootball Daily: England cruise past Malta",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Zimbabwe ready to shake off global 'bad press'",
    "SA20 boosted economies and 'exceeded expectations'",
    "Central African Republic aim for Afcon history",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]