[
    "Live. Premier League: Newcastle 0-0 Leicester - Isak denied by Iversen as hosts dominate",
    "Juve docked 10 points over transfer dealings",
    "Real report Vinicius Jr racist abuse as hate crime",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "Everton reach exclusivity agreement with MSP over investment",
    "Anthony retires after 20-year NBA career",
    "Twenty years on - how Anderson was shaped for greatness",
    "'We are in the last chance saloon' - who will survive Premier League relegation?",
    "Cavendish to retire at end of season",
    "Miami beat Boston to move closer to NBA finals",
    "Club pro Block steals show at US PGA Championship",
    "Vinicius Jr abuse shows things must change - Balague",
    "Guardiola 'the difference maker' as City eye Treble",
    "Jockey Club applies for injunction against protests",
    "Can Murray make his mark on Wimbledon anniversary?",
    "Life is just as important as football - Hayes",
    "Gaston's fine for conduct is bigger than earnings",
    "O'Gara targets Ireland job after La Rochelle triumph",
    "Mumbai reach IPL play-offs as Bangalore beaten",
    "Can you name all the Premier League-winning captains?",
    "Murray withdraws from French Open",
    "'A big ask' - Leeds fear 'devastating' relegation",
    "'Special night' - but Man Utd 'need miracle' for title",
    "Mark Cavendish to retire: A career in pictures",
    "McNulty edges Healy in sprint to win Giro stage",
    "'We must win Champions League to be one of best'",
    "'Brighton in Europe bigger than title win for top-six club'",
    "From snubbed to main spotlight - Cameron emerges as pound-for-pound contender",
    "Farah eighth in penultimate race of career",
    "Ten moments that defined Premier League title race",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "It's a really sad day for Arsenal - Arteta. VideoIt's a really sad day for Arsenal - Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "5 Live Boxing: Taylor v Cameron - The debrief. Audio5 Live Boxing: Taylor v Cameron - The debrief",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Bono explains mysterious World Cup absence",
    "Awoniyi keeps Forest up and ends Arsenal title hopes",
    "Mbeumo and Wissa goals give Brentford win at Spurs",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]