[
    "Live. US PGA Championship round two - Rose one behind DeChambeau",
    "Jones and Tipuric announce shock Wales retirements",
    "'Going for the title like serving for Wimbledon'",
    "Violins & adoring fans - Taylor & Cameron weigh in",
    "Murray inspires Nuggets to victory over Lakers",
    "F1 to donate 1m euros to relief fund for flooding",
    "Klopp will pay FA fine if it goes to 'good cause'",
    "Live. County Championship, day two - Surrey lead against Kent, radio & text",
    "O'Gara ready to enter Leinster's 'lion's den'",
    "AZ Alkmaar sorry for 'night to reflect on with shame'",
    "Punjab Kings v Rajasthan Royals - IPL scorecard",
    "'You fantasise about being like Bobby'",
    "Charles-Barclay to miss race due to visa issues",
    "Rubio wins shortened stage at weather-hit Giro",
    "Leinster make 12 changes for Champions Cup final",
    "Basketball fan shot dead at Libyan top-flight match",
    "Swiatek optimistic of being fit for French Open",
    "Toney future is with Brentford despite ban - Frank",
    "Why Nadal's French Open absence is hard to imagine",
    "Arsenal have 'made strong steps' this season - Arteta",
    "Vaughan to return to BBC as cricket pundit",
    "Jones to leave Man Utd after 'difficult' few years",
    "Powell joins England men's U20 set-up for World Cup",
    "'I have had so many pinch-myself moments' - Jill Scott column",
    "'I don't think anyone has a bigger heart than me'",
    "Sutton's Premier League predictions v stars of Woolf Women",
    "Man Utd the team to target - fantasy football tips",
    "The 'squeaky-voiced' boss leading Man Utd's title bid",
    "'Football's literally given me my world' - Wales legend Ward set for her final game",
    "'That's it, boys. I'm off' - Gower's 'nightmare' Ashes",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "Watch Moore's passionate post-match speech. VideoWatch Moore's passionate post-match speech",
    "Toney's future 'is at Brentford' - Frank. VideoToney's future 'is at Brentford' - Frank",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "South Africa, Fiji, Qatar express World Cup interest",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]