[
    "Dortmund draw gifts Bayern title on thrilling final day",
    "PSG win historic title as Messi breaks Ronaldo record",
    "Live. Lara v Wood & Okolie v Billam-Smith - live text",
    "Luton win play-off shootout to reach Premier League",
    "No Alonso fairytale, but there's bromance in the air",
    "Roglic set to win Giro after overhauling Thomas",
    "Benfica pip Porto to Portuguese title on final day",
    "Powerful Lopez stops Conlan to retain world title",
    "Rodrygo double gives Real victory at Sevilla",
    "Chelsea beat Reading to seal fourth successive WSL title",
    "Munster edge out Stormers to win URC Grand Final",
    "Part of me is leaving too - Djokovic on Nadal 'shock'",
    "Haaland wins player and young player awards",
    "'Formal offer' sent to Joshua for Fury fight",
    "Svitolina donates winnings to Ukrainian children",
    "Saracens beat Sale to win sixth Premiership title",
    "Australia captain Lanning out of Women's Ashes",
    "Valencia racist abuse punishment reduced on appeal",
    "The secrets of Chelsea's success under Hayes",
    "Man Utd pipped to WSL title despite beating Liverpool",
    "'My love for tennis never died' - Thiem on arduous return from injury",
    "Messi: Destiny - inside Argentina's World Cup win",
    "Hearts secure Conference League spot by drawing with Hibs",
    "Paddington wins Irish 2,000 Guineas at the Curragh",
    "How WSL top-scorer Daly surpassed all expectations",
    "20 teams, 200 questions - the big Premier League quiz",
    "Nadal's successor? A new 'big three'? A very open Roland Garros",
    "Sutton's Premier League final-day predictions v The National drummer Bryan Devendorf",
    "Who are India's next cricketing stars?",
    "'Fight for us' - fans on Premier League relegation showdown",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "Johnson & Naismith react in touchline bust-up. VideoJohnson & Naismith react in touchline bust-up",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Salah 'devastated' to miss out on Champions League",
    "Mpanzu's remarkable journey to Premier League",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]