[
    "Live. Euro 2024 qualifying: Scotland on course to go eight points clear in group",
    "'Cummins is The Boss but England can come back'",
    "Ronaldo scores winner on historic 200th cap",
    "West Ham reject Arsenal's second bid for Rice",
    "Versatile and ruthless - what Nkunku offers Chelsea",
    "England denied by Australia in Ashes classic",
    "Murray won't 'overreact' to chastening Queen's defeat",
    "Moldova, ranked 171st, stun Poland in comeback win",
    "Haaland double as Norway beat Cyprus in qualifier",
    "Colombia beat wobbling Germany in friendly",
    "Police raid Paris 2024 Olympics organisers' office",
    "'Money doesn't matter' - Son wants to stay in Premier League",
    "England players in 'absolute pieces' - Stokes",
    "Ashes digest: Aussie resistance & Stokes defiance",
    "Meet the man trying to topple 'dominant' Australia in women's Ashes",
    "England v Australia - first Test scorecard",
    "Mane double helps Senegal beat Brazil in friendly",
    "Fulham want Man Utd's Fred - Wednesday's gossip",
    "Ferrari 'going in the right direction' - Vasseur",
    "Doyle triumph and O'Brien record at Royal Ascot",
    "Eight English players on list for Golden Boy award",
    "Sabalenka & Rybakina win on grass before Wimbledon",
    "Switzerland's Reusser wins Tour de Suisse title",
    "'World's fastest accountant' who has stunned Europe",
    "'Starboy smile a sign of how times have changed for England'",
    "Former world No 2 Kontaveit to retire at 27 because of back condition",
    "Daly has found 'happy place' before World Cup",
    "'Ifs, buts & fine margins' - McIlroy's familiar tale of woe",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "The football club with no players. VideoThe football club with no players",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'We are the friend' - inspiring those fleeing terror",
    "Sudan players hope to 'bring joy' to war-torn nation",
    "Osimhen scores twice as Nigeria qualify for Afcon",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]