[
    "Arsenal agree £65m deal for Chelsea forward Havertz",
    "'England, keep creating chaos but please pick your moments'",
    "'Premier League should stop transfers to Saudi'",
    "Chelsea reject second Man Utd bid of £50m for Mount",
    "Mourinho banned for four matches over Taylor rant",
    "La Rochelle & Leinster to meet in Champions Cup",
    "West Ham fans banned for one European away game",
    "Man City agree £30m deal for Chelsea's Kovacic",
    "Maroons retain Origin series with win over Blues",
    "Chandler casts doubt over McGregor fight",
    "Williams & Boulter among Wimbledon wildcards",
    "The ruin, rise and revenge of Mitchell Johnson",
    "Bowler Filer to make debut in Women's Ashes Test",
    "'How are we supposed to live our normal lives during Ashes?'",
    "When pride of cricket whites meets period anxiety",
    "'Cummins is The Boss but England can fight back'",
    "Almost two-thirds of English fans 'oppose' VAR",
    "Norrie fights back to reach Queen's quarter-finals",
    "Scotland edge Ireland in World Cup Qualifier thriller",
    "Morgan and Rapinoe named in USA World Cup squad",
    "Mostahdaf stuns rivals to triumph at Royal Ascot",
    "Maguire given retrial date after Greek arrest",
    "Kroos signs one-year deal at Real Madrid",
    "'Pivotal' moment in women's tennis where nobody could leave the room",
    "Five players to watch at the Under-21 Euros",
    "Seven PFL fighters hit with doping suspensions",
    "Fulham want Man Utd's Fred - Wednesday's gossip",
    "Arsenal withdraw home shirt after 'design error'",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "The football club with no players. VideoThe football club with no players",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Ghana's record goalscorer Gyan retires",
    "Mane double helps Senegal beat Brazil in friendly",
    "'We are the friend' - inspiring those fleeing terror",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]