[
    "'Golf merger brings peace, but turmoil lies ahead'",
    "Live. Europa Conference League build-up & transfer news",
    "Liang and Li handed lifetime bans for match-fixing",
    "Rice 'set for top' and can bow out a West Ham hero",
    "'From shock to anger' - how golf reacted to historic merger",
    "Benzema agrees to join Saudi champions Al-Ittihad",
    "Alcaraz crushes Tsitsipas to set up Djokovic clash",
    "Australia and India set for WTC final showdown",
    "How Kenworthy’s coming out inspired a generation",
    "'He makes you feel invincible' - what will Postecoglou bring to Spurs?",
    "Swiatek ready for Gauff rematch in quarter-finals",
    "Can you name these Fiorentina legends?",
    "Juve signal intention to quit Super League project",
    "I don't support Lukashenko right now - Sabalenka",
    "Moyes confident 'best is yet to come' after European final",
    "Five things we learned from new BBC Ashes film",
    "AC Milan sack technical director Maldini",
    "Spanish rider Torras Martinez killed in TT crash",
    "Ex-captain Henry recalled by France for World Cup",
    "Brighton's Mac Allister set for Liverpool medical",
    "Sabalenka fuelled boos by waiting at net - Svitolina",
    "London Irish suspended from Premiership by RFU",
    "Villa want Tielemans and Laporte - Wednesday's gossip",
    "'He was four guys in one' - how do Celtic replace Postecoglou?",
    "Pimblett targets UFC return before end of year",
    "The 41-year-old who became world champion in five fights",
    "Can you name these Ashes cricketers?",
    "How Postecoglou made his 'fantasy football world' a reality",
    "Spurs should 'cash in' on Kane for rebuild - Richards",
    "Zhang and McKibbin - the 20-year-olds on path to greatness?",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Tailenders podcast: Men's Ashes preview. AudioTailenders podcast: Men's Ashes preview",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Former LA Laker says basketball 'saved his life'",
    "Van Niekerk 'uncomfortable' in cricket kit",
    "Middlesbrough to sign Man City youngster Agyemang",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]