[
    "Murray leads Tsitsipas but stopped by curfew",
    "Wood thrills but crucial Ashes Test in the balance",
    "Djokovic set for 'duel of the veterans of the tour'",
    "Broady fulfils childhood dream with Centre Court win",
    "Rybakina labours to win over injured Cornet",
    "Pogacar beats Vingegaard in epic mountain battle",
    "Bayer Leverkusen sign Xhaka from Arsenal for £21.4m",
    "'Wood's searing pace brings extra buzz to Ashes'",
    "Man Utd close to sealing Onana deal - Friday's gossip",
    "Joshua-Whyte rematch agreed for 12 August in London",
    "Coming out was the right choice - Kasatkina. VideoComing out was the right choice - Kasatkina",
    "Hamilton still has '100% faith' in Mercedes",
    "'The first man to score a hundred on a UK holiday'",
    "Fritz falls but Wawrinka sets up Djokovic match",
    "Broady stuns fourth seed Ruud in biggest career win",
    "Scots miss World Cup on run rate with loss to Dutch",
    "McCabe injured as Republic lose warm-up to France",
    "Ashes digest: Rapid Wood and Marsh's onslaught",
    "F1 drivers back trial of spray-reducing device",
    "Britain's fastest ever man Hughes on flying on and off the track",
    "Usyk to defend belts against Dubois in August",
    "Cameraman hurt by wild throw at Yankees game",
    "Van Vleuten extends Giro dominance with stage seven win",
    "Real sign Turkish wonderkid Guler from Fenerbahce",
    "'Turkish Messi' signs for Madrid - who is Arda Guler?",
    "'Door open' to talk with protest groups - Lord Coe",
    "How tennis stars are trying to lower carbon footprints",
    "US Women's Open making history as 2023 edition begins",
    "The Australian spinner plucked from Warne's old side",
    "Behind the 'Bazball' buzz - why there is no turning back for England",
    "'No peace' - the plot to burn down Wimbledon",
    "Old Firm, new friends - the day Celtic and Rangers played as one",
    "'Your life changed' – Wimbledon's ball boys from Barnardo’s",
    "The draft star and his overdose - a death that changed America",
    "The ruin, rise and revenge of Mitchell Johnson",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "TMS podcast: Smith on his 100th Test. AudioTMS podcast: Smith on his 100th Test",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Saudi goals - how Africans have long led the attack",
    "Rwanda's Kagame aims to tackle witchcraft in football",
    "Durham add SA seamer Pretorius to bowling roster",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]