[
    "Live. Premier League: Leicester & Leeds down as Everton survive - reaction",
    "Everton secure safety with Bournemouth win",
    "Verstappen beats Alonso to win rain-affected Monaco GP",
    "Kostyuk booed after avoiding Sabalenka handshake",
    "Dundee United down after defeat at Motherwell",
    "Tsitsipas makes winning start at French Open",
    "Leicester relegated despite win over West Ham",
    "Cavendish wins last Giro stage as Roglic takes title",
    "Leeds relegated after heavy home loss to Spurs",
    "IPL final to be played on Monday after heavy rain",
    "'Deja vu' as Muchova upsets eighth seed Sakkari",
    "How French Open is using AI to protect players online",
    "Villa qualify for Europe after 13-year absence",
    "Kool wins RideLondon Classique with Deignan third",
    "Carlisle promoted with shootout win over Stockport",
    "PSG keeper Rico in intensive care after riding accident",
    "Man Utd fight back to beat Fulham and secure third",
    "Ex-St Helens coach Anderson paralysed in accident",
    "Brentford miss out on Europe despite beating Man City",
    "Tahiyra storms to victory in Irish 1,000 Guineas",
    "Arsenal thrash Wolves to finish season off in style",
    "Live. Listen: T20 Blast - Somerset v Glamorgan after wins for Durham & Sussex",
    "Southampton and Liverpool play out 4-4 thriller",
    "Folau booed as Jones' Barbarians beat World XV",
    "'Historic title but the end for PSG boss & stars'",
    "Luton's throwback stadium set to host Premier League football",
    "How did each WSL club do this season?",
    "Nadal's successor? A new 'big three'? A very open Roland Garros",
    "The English clubs to have done the 'three-peat'",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "Can Everton ever be great again? VideoCan Everton ever be great again?",
    "Johnson & Naismith react in touchline bust-up. VideoJohnson & Naismith react in touchline bust-up",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Dramatic Doucoure goal keeps Everton in Premier League",
    "Awoniyi scores again as Forest draw at Palace",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]