[
    "West Ham reach Europa Conference League final",
    "Newcastle win to move closer to Champions League",
    "Mourinho's Roma into Europa League final",
    "DeChambeau sets clubhouse lead at frost-hit US PGA",
    "West Ham players confront AZ fans after family section attacked",
    "Why Nadal's French Open absence is hard to imagine",
    "Sheff Wed reach play-off final with stunning win",
    "Brentford striker Toney facing worldwide ban",
    "Klopp receives two-match ban for referee comments",
    "Kohli equals IPL century record as RCB beat Sunrisers",
    "Man Utd & Newcastle want Mane - Friday's gossip",
    "'That's it, boys. I'm off' - Gower's 'nightmare' Ashes",
    "What is the latest on investment in Everton?",
    "Denz takes first Grand Tour stage win at Giro",
    "Nadal out of French Open & plans to retire in 2024",
    "Glasgow desire takes on Toulon riches in final",
    "McLaren calls for sustainability changes in F1",
    "Taylor vows to 'make history' in homecoming fight",
    "Wasps to play 'at bottom of English pyramid'",
    "Arsenal keeper Ramsdale signs new 'long-term' deal",
    "Medvedev to face Tsitsipas in Rome semi-final",
    "Moura to leave Tottenham at end of season",
    "Vernier named player of Women's Six Nations",
    "England flanker Ben Curry set to miss World Cup",
    "Sutton's Premier League predictions v stars of Woolf Women",
    "'Two undefeated champions, two undisputed champions - it doesn't get bigger'",
    "What is going on with the Man Utd sale?",
    "'No-one will want to marry you if you're out boxing'",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "Newcastle 'excellent' in Brighton win - Howe. VideoNewcastle 'excellent' in Brighton win - Howe",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "South Africa, Fiji, Qatar express World Cup interest",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]