[
    "Live. Transfer latest and football news",
    "England choose Tongue in all-pace Ashes attack",
    "Man City sign midfielder Kovacic for initial £25m",
    "For the first time, I'm calling the shots - Jonas",
    "Dettori to miss July Cup bid because of whip ban",
    "Brazil forward Marta in squad for sixth World Cup",
    "Ex-NFL player Mallett, 35, dies in apparent drowning",
    "Kane wants to join Bayern - Wednesday's gossip",
    "Tottenham sign Empoli goalkeeper Vicario",
    "GB's Boulter loses in Eastbourne first round",
    "Italian FA bans 88 on shirts in anti-Semitism drive",
    "'If Australia win at Lord’s, the Ashes are done and dusted'",
    "'My best years are still ahead of me' - Root on scoops, captaincy & future",
    "England must 'go harder' at 'boring' Australia",
    "Pick your England team for second Ashes Test",
    "How Bolt took huge step with 'scariest thing I've posted'",
    "Stokes 'deeply sorry' to hear of discrimination",
    "Arsenal? Chelsea? Man Utd? - where next for Caicedo?",
    "Pirlo appointed Sampdoria boss",
    "Staniforth skips Ibiza after England standby call",
    "Bright 'really confident' of World Cup fitness",
    "Miyazaki, Bains & Brogan win qualifying openers",
    "England start World Cup defence v New Zealand",
    "West Ham reject Man City's £90m bid for Rice",
    "No alcohol sales at 2024 Paris Olympics stadiums",
    "From Iceland to Wembley - the Champions League begins",
    "'Brown was charmer who never got due appreciation'",
    "The draft star and his overdose - a death that changed America",
    "The ruin, rise and revenge of Mitchell Johnson",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Watch: Washington manager's umpire meltdown. VideoWatch: Washington manager's umpire meltdown",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "The Sports Desk: Cricket's day of reckoning. AudioThe Sports Desk: Cricket's day of reckoning",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Zaha buys local club with rapper Stormzy",
    "'Education is so important' - Itoje's Africa mission",
    "Fishing and safaris help Zimbabwe into Super Six",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]