[
    "Real players & fans show support for Vinicius Jr",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Brighton seal Europa League place with Man City draw",
    "Mumbai thrash Lucknow by 81 runs in IPL Eliminator",
    "Dainese wins stage 17 sprint as Thomas retains lead",
    "Alba and Barcelona agree to terminate contract",
    "Tebas apologises for Twitter 'attack' on Vinicius",
    "Man Utd lead race for £55m Mount - Thursday's gossip",
    "Inter beat Fiorentina to win Coppa Italia",
    "Blackmore given five-day ban for controversial ride",
    "Rangers draw ends Hearts' hopes of third place",
    "Mercedes upgrade will not be a 'silver bullet' - Wolff",
    "'Eze call-up a fresh & exciting input for England'",
    "Fourth place goes to the wire as Hibs shock Celtic",
    "Van Nistelrooy leaves PSV with immediate effect",
    "Chelsea struggles a warning sign, says Ten Hag",
    "Starc dismisses Broad's 'void' Ashes claim",
    "Smith-Eubank rematch postponed as Marshall headlines",
    "Is India batter Gill cricket's next big thing?",
    "It's time I went belt collecting, says Cameron",
    "Tongue added to England squad for Ireland Test",
    "Eze called up to England squad but Sterling left out",
    "Jones will 'love' Twickenham return with Barbarians",
    "Woman admits stalking Mount and Gilmour",
    "Celtics win to keep alive play-off hopes",
    "Is it time for French Open to use electronic line calls?",
    "Meet the NFL prospect that has Umenyiora 'afraid'",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "Can you name these Ashes cricketers?",
    "Why one French Open match will get extra scrutiny each day",
    "Hooked on risk - gambling's grip on elite sport",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "We'll see what happens - James. VideoWe'll see what happens - James",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Rugby Union Daily: Premiership final preview. AudioRugby Union Daily: Premiership final preview",
    "TMS podcast: When Tuffers met Leach. AudioTMS podcast: When Tuffers met Leach",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'Desperation' to 'best thing' - Kenya's female caddy",
    "South Africa scrum-half Van Zyl's new Saracens deal",
    "Everton trigger one-year Doucoure deal extension",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]