[
    "Live. Reaction after ruthless Man City charge into Champions League final",
    "'Moment of greatness from perfectionist Guardiola'",
    "'Unstoppable' Man City banish 'pain' of last year",
    "Butler shines as Heat win opener against Celtics",
    "Toney banned for eight months over betting",
    "What are the key US PGA Championship talking points?",
    "'That's it, boys. I'm off' - Gower's 'nightmare' Ashes",
    "Kyrgios foot injury behind French Open absence - agent",
    "Emilia Romagna GP called off after flooding",
    "Coventry beat Boro to set up play-off final with Luton",
    "Bairstow has 'huge sympathy' for dropped Foakes",
    "Djokovic loses in Rome quarter-finals",
    "Milner & Firmino among four set to leave Liverpool",
    "Man City thrash Real to reach Champions League final",
    "Britain's Geoghegan Hart fractures hip in Giro crash",
    "No-one is treating me like the champion - Cameron",
    "Fitzpatrick relishing US PGA's 'brute of a course'",
    "US PGA Championship tee-times for first two rounds",
    "Arsenal prepare £92m Rice bid - Thursday's gossip",
    "Chelsea return to top of WSL with win over West Ham",
    "Murray suffers another early exit on clay",
    "What is going on with the Man Utd sale?",
    "Italy and Juve captain Bonucci to retire next year",
    "Arsenal win to consolidate top-three spot in WSL",
    "'No-one will want to marry you if you're out boxing'",
    "Two mass brawls and four red cards in chaotic final",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "'Wear the right sports bra and you will be in a much better place'",
    "Can you name these Ashes cricketers?",
    "How The Rock is helping others live his NFL dream",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "From the Ashes podcast: David Gower. AudioFrom the Ashes podcast: David Gower",
    "All about the PGA Championship 2023. AudioAll about the PGA Championship 2023",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Keita to leave Liverpool at the end of the season",
    "Aubameyang announces Gabon retirement U-turn",
    "Smart ball tech to trial at U20 World Cup in SA",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]