[
    "Live. Bright to captain England at World Cup - Wiegman news conference",
    "Mead left out of England World Cup squad",
    "'Mourinho feeds Rome with dreams and emotion'",
    "How Botox jabs resurrected bowler Tongue's career",
    "Webb quits Wales 100 days before World Cup",
    "Djokovic's political message 'not appropriate'",
    "'It's a spiritual surface' - Tsitsipas on Paris clay",
    "850,000 World Cup tickets sold with 50 days to go",
    "Stearns shocks ex-French Open champion Ostapenko",
    "Ireland out to complete treble over England",
    "Inverness eye 'fairytale' Scottish Cup win over Celtic",
    "Pick your combined Man City-Man Utd XI",
    "Benzema eyes £346m Saudi move - Wednesday's gossip",
    "IOC condemns police action against India wrestlers",
    "Which managers have won most European trophies?",
    "The double chasers desperate to destroy Treble dream",
    "Chelsea pair named in Germany World Cup squad",
    "Norrie prepared for 'tough moments' in front of Paris crowd",
    "Olympians & other heroes - LGBT podcast hits 300 not out",
    "Brentford sign Netherlands keeper Flekken",
    "Young to leave Aston Villa after two-year stint",
    "TV gang jailed for illegally streaming Premier League games",
    "Man Utd's Martial to miss FA Cup final with injury",
    "Team of the season? Computer says...",
    "How did winter World Cup shape Premier League season?",
    "Messi? Kane? Bellingham? Epic transfer window awaits",
    "Juventus to pay £620,000 fine in plea deal",
    "Ryder Cup should be best v best, says Rahm",
    "Zinchenko & Shevchenko to lead Ukraine charity teams",
    "The tennis generation that changed the world",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Oosthuizen to exit Sale for return to South Africa",
    "Lauren calls for tougher racism sanctions in Spain",
    "Jabeur through to second round of French Open",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]