[
    "Live. Cup final reaction, Benzema to leave Real & transfer latest",
    "Live. Spanish Grand Prix build-up",
    "Benzema set for Saudi move after Real confirm exit",
    "Man City have set the standard - how can Man Utd catch up?",
    "Australia's Hazlewood out of Test against India",
    "'England in best possible shape for Ashes tilt'",
    "Sabalenka & Stephens get primetime Paris billing",
    "How do Real Madrid prepare for life after Benzema?",
    "'Gundogan once again the man for the big moments'",
    "'In with great chance' - McIlroy shares Memorial lead",
    "River Plate game abandoned after fan falls to death",
    "'Postecoglou future ominous as his history Bhoys triumph in present'",
    "Ancelotti wants Kane at Real Madrid - Sunday's gossip",
    "Stokes 'on course' to bowl in first Ashes Test",
    "Shields beats Cornejo in homecoming fight",
    "Messi and Ramos sign off with PSG defeat",
    "Golden Knights win game one of Stanley Cup finals",
    "'I saw Man City lose at York... now we can win the Treble'",
    "Verstappen on Spanish pole after dramatic qualifying",
    "Swiatek through with 51-minute 'double bagel' in Paris",
    "Barcelona come from 2-0 down to win second Champions League title",
    "I am playing to raise money for Ukraine - Tsurenko",
    "England break Ireland spirit to record big win",
    "Man Utd optimistic about Mount deal",
    "Celtic overcome Inverness to complete treble",
    "Tongue and Bairstow in England Ashes squad",
    "Nadal out for five more months after surgery",
    "Rune has 'dreams' of lifting French Open trophy",
    "Blue v Red: The battle for Manchester",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Stumped podcast: Is Dhoni the IPL's Tom Brady? AudioStumped podcast: Is Dhoni the IPL's Tom Brady?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Kenya's Faith Kipyegon breaks 1500m world record",
    "Former Olympic champion Cissé focused on Paris",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]