[
    "'This is the dream' - all you need to know about Champions League final",
    "India have hope after third-day final fightback",
    "Hodgkinson sets British record in Diamond League win",
    "Swiatek ready for unknown against Muchova in final",
    "Stress of facing Djokovic caused cramps - Alcaraz",
    "Leeds chairman agrees £170m deal to sell to 49ers",
    "Sutton's Champions League final prediction v Noel Gallagher & Blanco",
    "Murray fights back to reach Surbiton semi-finals",
    "The 'normal one' who turned Inter fortunes around",
    "Rose & I agreed merger silence in Canada - McIlroy",
    "West Ham target midfield duo - Saturday's gossip",
    "'Taylor & Lopez dislike each other - this is real'",
    "'Hysterical & hated at times - but Guardiola is already the greatest'",
    "Rekabi makes climbing return after headscarf row",
    "Djokovic beats ailing Alcaraz to book final with Ruud",
    "Moeen shines while Surrey smash club record in T20 Blast",
    "West Ham charged by Uefa for incidents in final",
    "Liverpool's Keita to join Werder Bremen this summer",
    "How well do you remember this season's Champions League?",
    "Britons make weight for world-title triple header",
    "Women's tennis needs more big rivalries - Barker",
    "Man Utd owners discuss Qatari bid with PSG chairman",
    "Bayern Munich sign RB Leipzig midfielder Laimer",
    "Wheelchair Rugby League World Cup referee suspended",
    "Panthers cut Stanley Cup finals deficit to 2-1",
    "Five games that helped Man Utd win Treble in 1999",
    "UFC fans will miss me when I retire - Nunes",
    "'I didn't feel like me so I had to step back'",
    "'He never hides' - new Liverpool signing Mac Allister",
    "Four British fighters, three world titles - Wembley's Saturday showdown",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "We've shown up every time - Dias. VideoWe've shown up every time - Dias",
    "De Bruyne on love at first sight with Haaland. VideoDe Bruyne on love at first sight with Haaland",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Chelsea target says Inter 'have nothing to lose'",
    "'My mind wants to get angry but my body can't back it up'",
    "Football in Senegal suspended after deadly protests",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]