[
    "Live. West Ham reach Europa Conference League final after 1-0 win at AZ",
    "Live. Premier League: Newcastle thrash Brighton to strengthen place in top four",
    "Live. US PGA Championship - DeChambeau leads, Mickelson among late starters",
    "Klopp receives two-match ban for referee comments",
    "Nadal out of French Open & plans to retire in 2024",
    "Brentford striker Toney facing worldwide ban",
    "Kohli equals IPL century record as RCB beat Sunrisers",
    "Newcastle win to move closer to Champions League",
    "'That's it, boys. I'm off' - Gower's 'nightmare' Ashes",
    "Live. Sheff Wed fight back from 4-0 down v Posh to send amazing tie to extra time",
    "Denz takes first Grand Tour stage win at Giro",
    "McLaren calls for sustainability changes in F1",
    "What is the latest on investment in Everton?",
    "Swiatek awaits update after retiring in Rome",
    "Taylor vows to 'make history' in homecoming fight",
    "Medvedev reaches Italian Open semi-final",
    "Wasps to play 'at bottom of English pyramid'",
    "Moura to leave Tottenham at end of season",
    "Semi-final win banishes last year's 'pain' - Guardiola",
    "'Moment of greatness from perfectionist Guardiola'",
    "Mentor to retire from England duty after 22 years",
    "Kyrgios foot injury behind French Open absence - agent",
    "Coventry-Luton final 'one for romantics' - Robins",
    "Vernier named player of Women's Six Nations",
    "England flanker Ben Curry set to miss World Cup",
    "Chelsea captain Eriksson & Harder to leave in summer",
    "'Two undefeated champions, two undisputed champions - it doesn't get bigger'",
    "What is going on with the Man Utd sale?",
    "'No-one will want to marry you if you're out boxing'",
    "Two mass brawls and four red cards in chaotic final",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "South Africa, Fiji, Qatar express World Cup interest",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]