[
    "Live. Reaction to West Ham's first major trophy in 43 years & transfer news",
    "West Ham win dramatic Europa Conference League final",
    "Surviving Hitler - the Jewish star who shone amid Berlin's ruins",
    "'I've taken the decision' - Messi to join Inter Miami",
    "Real Madrid agree 103m euro deal to sign Bellingham",
    "Head ton gives Australia control over India",
    "Scheduling shows women's tennis is undervalued - Pegula column",
    "Shock merger will be 'good for golf' - McIlroy",
    "'Moments Moyes and West Ham will never forget'",
    "Newcastle and Man Utd want Kim - Thursday's gossip",
    "‘Golf truce shows how Saudi money is changing world sport’",
    "All to gain and 'nothing to lose' in women's semi-finals",
    "West Ham condemn fan behaviour after Biraghi hit by object",
    "Quiz: How well do you know Messi?",
    "Ruud beats Rune to book semi-final against Zverev",
    "'Grief but peace' for the dream ended by long Covid",
    "'Moeen return the best move England could make'",
    "Sheikh Jassim makes fifth and final Man Utd bid",
    "'Golf merger brings peace, but turmoil lies ahead'",
    "Ferguson's finest? Guardiola's greatest? Who would you pick?",
    "IOC recommends stripping IBA of recognition",
    "Murray through to Surbiton Trophy quarter-finals",
    "How Kenworthy’s coming out inspired a generation",
    "Liang and Li handed lifetime bans for match-fixing",
    "Ex-Tottenham striker Rebrov named Ukraine coach",
    "'He makes you feel invincible' - what will Postecoglou bring to Spurs?",
    "Teenager Bellingham's rapid rise to football stardom",
    "Five things we learned from new BBC Ashes film",
    "Benzema agrees to join Saudi champions Al-Ittihad",
    "The 41-year-old who became world champion in five fights",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Jabeur beaten in French Open quarter-final",
    "Kenya international Oduor joins Bradford City",
    "Namibia's Wiese rescues Yorkshire with T20 fifty",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]