[
    "Live. Premier League latest: Leicester in survival fight",
    "Nuggets reach first NBA finals after clean sweep",
    "Robinson given all-clear for Ireland Test",
    "Doping hearing delay is against my rights - Halep",
    "Champions League was only a dream - Howe",
    "Tebas comments make my blood boil - Richards",
    "Woods misses US Open to continue recovery",
    "Australia are 'human' and 'not perfect' - Lamb",
    "Who is like prime Hoddle? Garth's Team of the Week",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "'I have a lot to think about' - James on future",
    "Why one French Open match will get extra scrutiny each day",
    "Hooked on risk - gambling's grip on elite sport",
    "Club pro Block steals show at US PGA Championship",
    "Cavendish to retire at end of season",
    "Bayern to challenge Arsenal for Rice - Tuesday's gossip",
    "Gaston's fine for conduct is bigger than earnings",
    "Two Thailand players banned for six months after brawls",
    "Pick your England team for Women's Ashes Test",
    "Life is just as important as football - Hayes",
    "Juve docked 10 points over transfer dealings",
    "‘Anxiety everywhere' - Leicester need ‘mad final day’",
    "McClenaghan moves back home for Olympic build-up",
    "What next for Wales after Jones and Tipuric retirements?",
    "Jockey Club applies for injunction against protests",
    "Three teams, one day - who will stay in Premier League?",
    "Can Murray make his mark on Wimbledon anniversary?",
    "Twenty years on - how Anderson was shaped for greatness",
    "Quiz! Name Newcastle's last Champions League side",
    "Can you name all the Premier League-winning captains?",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "It's a really sad day for Arsenal - Arteta. VideoIt's a really sad day for Arsenal - Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "TMS podcast: When Tuffers met Leach. AudioTMS podcast: When Tuffers met Leach",
    "5 Live Boxing: Taylor v Cameron - The debrief. Audio5 Live Boxing: Taylor v Cameron - The debrief",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Bono explains mysterious World Cup absence",
    "Awoniyi keeps Forest up and ends Arsenal title hopes",
    "Mbeumo and Wissa goals give Brentford win at Spurs",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]