[
    "Live. England win but Wales & Northern Ireland lose - Euro 2024 reaction",
    "Spirit of 2005 fuels prospect of Edgbaston classic",
    "'Starboy smile a sign of how times have changed for England'",
    "Mbappe scores as France maintain perfect record",
    "'World's fastest accountant' who has stunned Europe",
    "PSG close to appointing ex-Spain boss Luis Enrique",
    "Emotional Williams wins Birmingham thriller against Giorgi",
    "Courtois 'deeply disappointed' over captaincy row",
    "Gerrard 'won't be taking up' Saudi job offer",
    "Dettori ready for final Royal Ascot meeting",
    "Wales' Euro hopes in tatters after defeat in Turkey",
    "Can you name these England hat-trick heroes?",
    "Broad wickets sway Ashes classic England's way",
    "'I wanted to create theatre' - England's Mr Ashes rises again",
    "Ashes digest: Reverse ramps & Root's unwanted first",
    "England v Australia - first Test scorecard",
    "Meet the man trying to topple 'dominant' Australia in women's Ashes",
    "An overachiever who grew up with Arteta - who is Iraola?",
    "Kyrgios a Wimbledon doubt after Halle withdrawal",
    "Dutch striker Promes jailed for stabbing cousin",
    "'Ifs, buts & fine margins' - McIlroy's familiar tale of woe",
    "PSG make Kane top priority - Tuesday's gossip",
    "Saints' Crowl 'racially abused and attacked in Spain'",
    "'I'd go through 100 Sundays like this to win major'",
    "Verstappen 'in the same sentence as the greats'",
    "'Winning gold makes the difficult times worthwhile' - Sawyers column",
    "'Rodgers has it all to prove in more testing arena'",
    "Ferrari 'making our life way too difficult' - Leclerc",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Sudan players hope to 'bring joy' to war-torn nation",
    "Osimhen scores twice as Nigeria qualify for Afcon",
    "Zimbabwe ready to shake off global 'bad press'",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]