[
    "@konstantin@digitalcourage …",
    "Apple Warns the UK's Online Safety Bill Threatens Citizens' Privacy and Security",
    "Apple opposes UK's Online Safety Bill, citing risks to privacy and security",
    "An encryption exodus looms over UK's Online Safety Bill",
    "Apple opposes UK bill that could mandate backdoor scanning in iMessage",
    "Apple says proposed UK law ‘poses a serious threat’ to end-to-end encryption",
    "Apple speaks out against bill that could mandate CSAM scanning in iMessage",
    "Apple urges UK to rethink anti-encryption Online Safety Bill",
    "Apple officially opposes proposed UK law that would weaken iMessage encryption",
    "Apple Joins Opposition Against Message Scanning in Online Safety Bill",
    "Apple Joins Opposition to U.K. ‘Online Safety Bill’",
    "@konstantin@digitalcourage.social",
    "Apple joins opposition to encrypted message app scanning",
    "Apple Joins Opposition in UK To Encrypted Message App Scanning",
    "@joshsternberg.bsky.social",
    "Google Is Placing Ads for Top Brands on Spammy, Chatbot-Generated Blogs",
    "Google fires back after study claims “80%” of video ads violate its own terms of service",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google Misled Advertisers About Video Ads, Study Says",
    "Transparency and brand safety on Google Video Partners",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "This is amazing contextual advertising.  —  https://www.wsj.com/...  [image]",
    "holy fudge I did NOT KNOW YouTube does audience extension campaigns https://www.wsj.com/...",
    "This report if confirmed impacts the entire media industry. https://www.wsj.com/...",
    "WSJ News Exclusive |  Google Violated Its Standards in Ad Deals, Research Finds",
    "Microsoft wants to bring Windows 11 to the cloud for ALL users, including you",
    "Microsoft attempts to pick apart US legal argument against deal to buy Activision",
    "Is Microsoft shoving Windows 11 cloud PC down our throats?",
    "Windows could soon live in the cloud, if Microsoft gets its way",
    "Windows 11 Cloud PC subscription is coming to consumers",
    "Windows 11 may become a cloud based operating system",
    "Jim Ryan Says Publishers “Unanimously” Hate Xbox Game Pass",
    "Microsoft Sees Cloud-Based Windows 11 as a Long-Term Goal",
    "Microsoft's Long-Term Vision: Windows Transition to Cloud-based Experience",
    "Microsoft Plots Cloud-Based Windows 11",
    "Microsoft wants to put Windows PCs fully in the cloud - but what will that mean for you?",
    "I wouldn't mind streaming Windows 11 from the cloud to my Vision Pro",
    "Microsoft is working on a full cloud-based Windows OS",
    "Microsoft Wants to Shoot Windows 11 Into the Cloud",
    "Windows 11's Potential Subscription-Based Cloud Future Revealed by FTC",
    "Microsoft is planning to put Windows in the cloud for consumers",
    "Microsoft's looking into offering a version of cloud-based Windows 365 for consumers",
    "Report: Microsoft Wants to Bring Windows 365 Cloud PCs to Consumers",
    "Microsoft Plans to Turn Windows into Cloud-Streamed Operating System",
    "Microsoft wants to move Windows fully to the cloud",
    "@tetherpoint@mastodon.social",
    "Has Apple Overshot the Market with the New Mac Pro?",
    "Mac Pro market even smaller than expected, as high-end pros choose 16-inch MBP",
    "Did Apple accidentally make Mac Pro unnecessary?",
    "M2 Ultra Mac Pro review shows Apple's powerhouse hasn't left the worst of the Intel era",
    "4 Reasons the Apple Silicon Mac Pro Is Not Worth Your Money",
    "@macstories@mastodon.macstories.net",
    "Has Apple Overshot the Market with the New Mac Pro? https://www.macstories.net/...",
    "The Mac Pro's biggest problem is the MacBook",
    "Google Kills Augmented Reality Glasses Project",
    "Google's next-gen AR glasses join the Google graveyard",
    "Google's Next Gen AR Glass 2.0 May Not Launch After All",
    "Google kills off the latest iteration of its AR glasses",
    "Looks like Google might have canceled its new AR glasses",
    "Report: Google killed Iris smart glasses, going all-in on Android OEM model for XR",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "@cawhitworth@mastodon.online",
    "Silicon Valley Is On Drugs",
    "Musk v. Zuckerberg and Silicon Valley's Dangerous Road",
    "Elon Musk reportedly microdoses ketamine to treat depression",
    "Elon Musk Touts Ketamine For Depression Following Report On His Use Of Drug",
    "Drugs have never seemed less cool.Do you want to party like a tech executive?",
    "FDA creates path for psychedelic drug trials",
    "Silicon Valley Is on Drugs",
    "Magic Mushrooms.  LSD.  Ketamine.  The Drugs That Power Silicon Valley.",
    "US considering new restrictions on AI chip exports to China - WSJ",
    "US weighs tougher restrictions on AI chip exports to China",
    "U.S. Mulls New Restrictions on AI Chip Exports to China",
    "Nvidia Leads Selloff After Report of More US AI Chip Curbs",
    "Asia Markets Mixed as Australia Inflation Slows and China Industrial Profits Sink",
    "Yellen Plans July China Trip While US Preps Investment Curbs",
    "Supreme Court of the United States",
    "Supreme Court Raises Bar on Prosecuting Online Stalkers",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "Supreme Court says a conviction for online threats violated 1st Amendment",
    "The Supreme Court Made It Harder — Again — For Women to Get Justice",
    "Supreme Court rules for online stalker convicted of making ‘true threats’",
    "Supreme Court makes it more difficult to convict someone of making a threat",
    "International Business Times",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram tests feature to block explicit images in direct message requests",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Both TikTok and Meta introduce new parental controls",
    "What to know about the new parental supervision tools on Instagram",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "Facebook Messenger launches “parental control” mode",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Meta Announces New Teen Safety Tools, Including Updated Parental Oversight and Messaging Controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "New Tools in Messenger, Instagram Give Parents More Control",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Parents can now see more of what their kids are up to on Messenger and Instagram",
    "Meta launches more parental supervision tools for Instagram. Is it enough?",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Meta guardrails: More safeguards, monitoring tools for teens launch across social platforms",
    "Facebook adds parental control tools to Messenger",
    "Meta launches parental controls for Messenger. Here's how to use them.",
    "Three Arrows Capital Liquidators Seek $1.3B From Bankrupt Hedge Fund's Founders: Bloomberg",
    "3AC liquidators seek $1.3 billion from Zhu, Davies: Bloomberg",
    "Three Arrows Capital Founders In Legal Battle Over $1.3 Billion In Funds",
    "Bankrupt Crypto Hedge Fund Three Arrows Capital Pursued by Liquidators for $1,300,000,000: Report",
    "Three Arrows Capital Liquidators Seek a Staggering $1.3B from Founders of Insolvent Hedge Fund",
    "3AC liquidators look to recoup $1.3B from founders",
    "Bankrupt Three Arrows' liquidators seek $1.3 bln from fund's founders - source",
    "@overcastfm@mastodon.social",
    "@numbercrow@techhub.social",
    "So Long, Stitcher: SiriusXM to Shut Down Podcast App, Website",
    "SiriusXM to Shut Down Stitcher Podcast App",
    "Popular podcast app Stitcher is shutting down August 29th",
    "Why Brad Pitt's Plan B is looking to do audio as others pull out",
    "Stitcher podcast app is shutting down in August after 15 years",
    "Podcast app Stitcher is shutting down in August",
    "@Techmeme Say it with me: enshittification.",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok Is Funding Montana Users' Lawsuit After Ban: Report",
    "Introducing Unity Muse and Unity Sentis, AI-powered creativity",
    "Gaming industry puts generative AI to the test",
    "Unity Launches New AI Marketplace as Premier Destination for AI Solutions",
    "Unity Announces Big ‘AI’ Plans, Developers Have Concerns",
    "Unity releases deeply upsetting trailer for its new AI development tools",
    "Why Unity is using its new AI platforms to become more accessible to brands and agencies",
    "Insider Q&A: John Riccitiello, CEO of video game software company Unity, on AI and gaming's future",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "TikTok Launches ‘Creative Challenge’ to Provide More Income Opportunities for Creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "Personal Data About Paid U.S. TikTok Creators Is Probably Stored in China",
    "Chat-GPT Could Be Changing The Way You Think, And You Might Not Even Realize It",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT for iOS now lets paid subscribers use Bing right from the app",
    "China's Baidu Ernie Chatbot Update Outperforms OpenAI's ChatGPT on Key AI Tests",
    "59% of U.S. internet users are already on ChatGPT, BofA survey finds",
    "People Love OpenAI, Bing and Bard, Survey Finds. What It Says About Stocks.",
    "Augmedics gets $82.5 million in funding round for AR spinal surgery tool",
    "Augmedics Raises $82.5 Million to Boost Adoption of Augmented Reality Spine Surgery",
    "Augmedics closes $82.5M Series D, marks 4,000 U.S. patients treated with Xvision",
    "Augmedics raises $82.5 million to accelerate adoption of augmented reality spine surgery",
    "Augmedics Raises $82.5M for Augmented Reality Spine Surgery Platform",
    "Augmedics Raises $82.5M in Series D Funding",
    "Augmedics raises $82.5 million amid Series D decline",
    "EncroChat takedown led to 6,500 arrests and $979 million seized",
    "Encrypted phone service ‘Encrochat’ shutdown leads to 6,500 arrests - Europol",
    "EncroChat Disruption Leads to Arrest of Over 6,000 Suspects",
    "Cops' total pwnage of ‘secure’ EncroChat nets 6,500+ arrests, €740m in funds - so far",
    "Investigation Into Encrypted Phone Network Leads to 6,500 Arrests",
    "Seizure of EncroChat Enables Police Access to 115 Million Conversations",
    "Three years on, EncroChat cryptophone hack nets 6,500 arrests and seizures of €900 million",
    "EncroChat Bust Leads to 6,558 Criminals' Arrests and €900 Million Seizure",
    "EncroChat dismantling lead to 6500 arrests, EUR 900 million seized",
    "3-Year Probe Into Encrypted Phones Led To Seizure of Hundreds of Tons of Drugs, Prosecutors Say",
    "@ravirockks@infosec.exchange",
    "@SloanStudio@mastodon.social",
    "@danielfgom@social.vivaldi.net",
    "Creating fully immersive experiences in your app",
    "Why the Meta Quest 2 Is Better Than the Apple Vision Pro for Fitness",
    "Vision Pro may stop working entirely when moving too fast",
    "Multiple new Vision Pro headsets are already being developed at Apple",
    "Meta launches Quest+ subscription for its VR headsets as Apple Vision Pro debut nears",
    "Apple Vision Pro Cinema Environments revealed — here's what we know",
    "So much for any New Yorkers having sufficient space in their apartment to use one [embedded post]",
    "@SloanStudio I would suspect it is not a hardware limitation.  Then again, why do it otherwise?",
    "@SloanStudio Pretty wild limitation considering the Oculus Quest is $400 and supports 50x50 ft.",
    "Possibly to limit the potential for Vision Pro fail videos ... https://twitter.com/...",
    "Vision Pro safe area limited to 10x10 feet for VR experiences",
    "Anzu completes $48 million Series B for in-game advertising solution",
    "Deal of the day: SanDisk 64GB Extreme PRO CFexpress Type B memory card now only $60",
    "Anzu Completes $48 Million Series B Funding Round Led by Emmis to Accelerate In-Game Advertising",
    "In-game Ads solution Anzu raises $48M in Series B funding",
    "Personalized wealth management, built for tech people",
    "@williamgunn@mastodon.social",
    "There's one reason why I won't buy a Pixel Fold — and it isn't the price",
    "Google Teams With iFixit To Offer DIY Repair Parts For Pixel Fold",
    "Google's Pixel Fold is a well-rounded take on the foldable form factor",
    "These are the top five apps to use on your Pixel Fold according to Google",
    "Pixel Fold repair parts will be available through iFixit",
    "Google to Offer A Self-Repair Option for the Pixel Fold",
    "Google and iFixit join forces again to DIY repairs for Pixel Fold",
    "Google supports you fixing your Pixel Fold yourself, a first for any foldable",
    "Brave Pixel Fold owners can try to repair hardware issues with iFixit's help",
    "It's official — the Pixel Fold has something we've never seen before",
    "You'll soon be able to repair your Google Pixel Fold with parts from iFixit",
    "Google and iFxit will offer Pixel Fold repair parts, tools and manuals",
    "The Pixel fold will have parts available from ifixit your move Samsung.",
    "Marques Brownlee on YouTube",
    "@jstevenyork@mastodon.social",
    "Apple inventing tech to make iPhone & Apple Watch screens last longer",
    "A Pixel Fold's OLED Died in Just 4 Days Thanks to Flat Bezels",
    "Foldable phone cases are finally good, and Google Pixel Fold is the proof",
    "A Google Pixel Fold's screen broke already. Should you be concerned?",
    "Reminder, Those $1800 Foldables Aren't Impervious to Damage",
    "The first deflating report of Pixel Fold screen failure is pretty rough",
    "Google Pixel Fold will reportedly have DIY repair guides and genuine parts via iFixit",
    "Gurmanizing Apple's OLED Plans With Added Kuo",
    "Google Pixel Fold vs Samsung Galaxy Z Fold 4: Which one should you get?",
    "The Pixel Fold is brilliant, according to reviews, but is Google's quality control a problem?",
    "Google Pixel Fold display breaks already — and this could be the cause",
    "Ron Amadeo's Pixel Fold Lasted Four Days",
    "I lost interest in Google's Pixel Fold after this story about a display breaking",
    "Google Pixel Fold: 7 unfiltered thoughts after 8 days with the device",
    "A Google Pixel Fold has died after just four days: Questions on durability",
    "Google Pixel Fold review: The first foldable phone that gets it right",
    "Reviewer's Pixel Fold unit display wrecked exposing potential design vulnerability",
    "Pixel Fold Breaks in Just 4 Days For High-Profile Reviewer",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Google Pixel Fold Review: A Folding Phone That Still Has Some Wrinkles to Work Out",
    "Google Pixel Fold review: It's what's on the inside that counts",
    "Google Pixel Fold Review: Maybe Next Year!",
    "Google Pixel Fold is a quality first swing at a foldable",
    "Google Pixel Fold Review: Smooth Innovation At A Considerable Cost",
    "Google Pixel Fold review: it surprised the heck out of me",
    "Google Pixel Fold review: First impressions of Google's $1800 folding phone",
    "Sorry. https://arstechnica.com/...",
    "Ars Technica: “RIP to my Pixel Fold: Dead after four days”",
    "RIP to my Pixel Fold: Dead after four days",
    "Ron from ars technica's pixel fold broke",
    "Ars Technica: RIP To My Pixel Fold After Four Days",
    "Announcing our $58M funding to Build Generative Models and Advance AI Research",
    "Generative AI startup Reka emerges from stealth with $58 million in its pocket",
    "AI model startup Reka raises $50 million led by DST Global Partners",
    "Free compensation benchmarking data from 3,000 startups",
    "5 common data and analytics pitfalls businesses should avoid",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/27 - What If OpenAI Did Its Own Copilot?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "Data act: Council and Parliament strike a deal on fair access to and use of data",
    "Announcing Our $20M Series-A Funding",
    "Faros AI raises $20M to make software engineering teams smarter",
    "Faros AI raises $20M to bring AI insights to software engineering",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "BETR RAISES $35M IN SERIES A2 AT $300M PRE-MONEY VALUATION",
    "Jake Paul's Betr Raises $35M at $300M Value Led by Roger Ehrenberg",
    "Prosus cuts Byju's valuation to $5.1 billion, writes off ZestMoney investment",
    "Edtech firm Byju's making up shortfall to EPFO: report",
    "Byju Investor Prosus Cuts Indian Tech Company's Valuation by 15%",
    "Byju's likely in advance talks to raise $1 billion funding to prevent investors revolt: Report",
    "Prosus further slashes Byju's fair value to $5.1 billion",
    "Prosus cuts Byju's valuation to $5.1b",
    "EdTech is a notorious way to lose money.  [embedded post]",
    "Cart.com Valued at $1.2 Billion Following $60 Million Series C",
    "Cart.com Raises $60M Series C Funding at $1.2 Billion Valuation",
    "Cart.com Announces $60 Million Series C Funding Round at $1.2 Billion Valuation",
    "Identity fraud prevention provider Socure acquires Berbix for $70M",
    "Socure Acquires Berbix to Bulk Up ID Verification Toolbox",
    "Socure Acquires Berbix for Approx. $70M",
    "Socure Buys Berbix for $70M to Fortify Identity Verification",
    "Socure's $70 million acquisition of Berbix: What it means for the identity verification market",
    "Socure Acquires ID Verification Company Berbix for $70 Million",
    "Data security startup Cyera lands a $100M investment",
    "Cyera Raises $100M to Bring Data Protection to Hybrid Cloud",
    "Cyera Nabs $100M To Protect Data",
    "Cyera bags $100M to improve cloud data security with large language models",
    "Our Continued Investment in Cyera: Filling the Data Gap in Today's Modern Security Stack",
    "Data Security Firm Cyera Attracts $100M Investment",
    "TikTok Scraps Feature Called TikTok Now That Mirrored BeReal",
    "TikTok is jumping off the BeReal bandwagon by killing TikTok Now",
    "TikTok kills BeReal clone TikTok Now after less than a year",
    "TikTok Discontinues its ‘TikTok Now’ BeReal Clone",
    "TikTok To Discontinue TikTok Now, Its BeReal Clone",
    "TikTok Kills Its BeReal Clone",
    "TikTok Now, the BeReal clone you never used, is being discontinued",
    "TikTok Discontinues BeReal Clone, Adds Parental Filters",
    "It Looks Like TikTok's BeReal Competitor Is Dead",
    "TikTok kills off its BeReal clone, likely because it knows BeReal is dying off on its own",
    "TikTok Now is the latest BeReal knockoff",
    "TikTok is shutting down its BeReal clone https://www.theverge.com/...",
    "Amazon Fulfillment Chief Leaves for Delivery Startup",
    "Meet the robots attending the UN's ‘AI for Good Global’ summit",
    "Amazon's AI-powered robots to revolutionise warehouse automation",
    "Shailene Woodley's Robot Falls Head Over Heels In The Trailer For Amazon's Sci-Fi Comedy ‘Robots’",
    "How Amazon deploys collaborative robots in its operations to benefit employees and customers",
    "OpenAI reportedly plans “supersmart” ChatGPT business assistant",
    "Would an OpenAI work assistant put the company in conflict with Microsoft?",
    "OpenAI Plans ChatGPT ‘Supersmart Personal Assistant for Work,’ Setting Up Microsoft Rivalry 1",
    "Making it Easier for Small Businesses to Connect with More Customers",
    "Mark Zuckerberg announced upcoming release of new business features for WhatsApp",
    "WhatsApp Adds New Promotional Options to Help Brands Connect with Customers",
    "WhatsApp Business Adds Features as It Hits 200M Monthly Users",
    "WhatsApp Business users jump four-fold in three years",
    "WhatsApp Business Announces 200M Active Users and Launches Personalized Customer Messages",
    "WhatsApp Business reaches 200 million users, will allow Facebook ads without an account",
    "WhatsApp Business Gains 150 Million Users in 3 Years",
    "Good news - WhatsApp will soon let businesses send you personalized messages",
    "Here's how WhatsApp Business app's new features will benefit small businesses",
    "You may soon see more ads from small companies on Facebook thanks to WhatsApp Business",
    "Zuckerberg announces new features coming on WhatsApp Business app",
    "When The AI Is More Compassionate Than The Doctor",
    "Look mom, we made the paper! Exciting time for the team at @AbridgeHQ. https://twitter.com/...",
    "More about Telegram Stories t.me/durov /214",
    "For years, our users have been asking us to implement Stories in Telegram. …",
    "You Can't Escape Stories, Now Coming to Telegram",
    "Stories Are Headed to Telegram, but With Their Own Kind of Twist",
    "Telegram will get Stories feature before Samsung's Unpacked event",
    "Telegram Stories with customizable expiration times are coming next month",
    "Telegram Stories feature is coming in July 2023: Here's the first look",
    "Telegram will introduce Stories in July, it's official",
    "Telegram CEO Pavel Durov confirms Stories are coming to the messaging app next month",
    "Telegram announces Stories with lifespan from 6 hours",
    "Telegram is soon getting its own version of Stories: Check details inside",
    "Telegram gets new feature ‘Stories’; Arriving in early July",
    "@FrankPasquale@mastodon.social",
    "Is Goodreads down? Outage reports for book review site continue",
    "Romance Novel Recommendations From Authors Who Love the Genre"
]