[
    "Read the new Twitter CEO's first email to employees",
    "New Twitter CEO wants to create ‘global town square’: report",
    "Twitter CEO Linda Yaccarino Says Twitter Will Be World's Most Accurate Information Source",
    "Twitter 2.0: New CEO's Vision for the World's Most Accurate Information Source",
    "Twitter boss Linda Yaccarino gives first hint on shake-up plans",
    "Twitter's New CEO Makes It Clear: This Is Elon's Ship, She's Just Running It,",
    "Twitter Sends First Comms Email Since Takeover",
    "Twitter's new CEO has shared her first email to employees",
    "Twitter's new CEO wants to turn it into the 'world's most accurate real-time information source'",
    "Elon Musk Successor Reveals Real Reason She Chose Twitter",
    "Twitter CEO Linda Yaccarino echoes Musk in emphasizing freedom of speech in debut tweet thread",
    "Twitter's new CEO just sent her first email to employees, then posted it on Twitter",
    "excruitiatingly hollowed words.  the glass cliff is real.",
    "Hello Twitter. People keep asking me: Why Twitter? So, I'll tell you. 👇",
    "Fire your ghostwriter, Linda https://twitter.com/...",
    "Good luck but extremely skeptical it'll go as she envisions https://www.theverge.com/...",
    "never on this app lol https://twitter.com/...",
    "Has she told Elmo this? https://twitter.com/...",
    "Breaking Points on YouTube",
    "EXCLUSIVE: Jack Dorsey On RFK Jr. Elon Musk, AI Regulation | Breaking Points",
    "India Clashes With Twitter Ex-CEO Dorsey Over Removal of Posts",
    "India threatened to block Twitter, raid employees: former CEO Jack Dorsey",
    "India denies Dorsey's claims it threatened to shut down Twitter",
    "Breaking: Jack Dorsey Alleges Indian Govt Threatened To Shut Down Twitter, Raid Employees",
    "Centre dismisses Jack Dorsey's claims of Twitter shutdown over farmer protests",
    "Jack Dorsey Claims Indian Govt Raided Twitter Employees' Homes, Shut Down Offices, MoS IT Denies",
    "Government rejects ex-Twitter CEO Dorsey's ‘Shut Down’ claim as ‘outright lie’",
    "India Refutes Jack Dorsey's Allegations On Pressure During Farmers' Protests",
    "Murder of democracy...: BJP, Congress spat over Twitter co-founder Jack Dorsey's claim. Watch",
    "India threatened to shut down Twitter, says ex-CEO Jack Dorsey; govt says ‘outright lie’",
    "Outright lie, no one was raided or sent to jail: Rajeev Chandrasekhar to Dorsey",
    "India threatened to shut down Twitter and raid employees' homes, Jack Dorsey says",
    "India threatened to shut Twitter down, co-founder Jack Dorsey says",
    "United States District Court, Northern District of California",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC files to block Microsoft from buying Activision Blizzard",
    "Federal Trade Commission v. Microsoft Corp. and Activision Blizzard, Inc.",
    "FTC Seeks Injunction to Stop Microsoft From Closing Activision Deal",
    "US FTC seeks court order to block Microsoft acquisition of Activision -source",
    "FTC to seek federal court order temporarily blocking Microsoft-Activision deal",
    "FTC files to temporarily block the Microsoft-Activision deal",
    "FTC asks federal judge to block Microsoft's $69 billion Activision deal",
    "FTC Files for Temporary Restraining Order against Acquisition of Activision Blizzard by Microsoft",
    "FTC Motions for an Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "FTC sues to block Microsoft's takeover of video game maker Activision Blizzard",
    "FTC Officially Moves To Block Microsoft's Activision Blizzard Acquisition",
    "FTC Files Injunction to Block Microsoft's Activision Deal: What to Know",
    "FTC Sues to Block Massive Tech Deal",
    "US regulators move to block Microsoft's acquisition of Activision Blizzard",
    "Microsoft Welcomes FTC's Injunction on Xbox's Activision Blizzard Buyout",
    "FTC files injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC asks judge to put a stop to Microsoft-Activision deal immediately",
    "FTC files lawsuit to block Microsoft deal to buy Activision Blizzard",
    "FTC tries to block Microsoft Activision deal",
    "Report: FTC seeking injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC Files Temporary Restraining Order and Preliminary Injunction Against Microsoft",
    "FTC Reportedly Plans to File an Injunction Against Microsoft's Acquisition of Activision Blizzard",
    "Microsoft Met With Another Roadblock in Activision Blizzard Acquisition",
    "The FTC Is Reportedly Filing To Block Microsoft's Activision Blizzard Acquisition",
    "FTC asks US court to block Microsoft-Activision Blizzard deal",
    "FTC reportedly seeks injunction to stop Microsoft's Activision Blizzard deal",
    "FTC to Sue Microsoft to Block $69 Billion Activision Deal: Report",
    "FTC files injunction to temporarily block Microsoft's Activision Blizzard deal",
    "The FTC doubles down on its opposition to Microsoft acquiring Activision with a new injunction",
    "The FTC is reportedly filing an injunction against the Xbox-Activision deal",
    "The FTC May File an Injunction to Block Microsoft's Activision Blizzard Purchase",
    "FTC to Seek Injunction Blocking Microsoft Purchase of Activision-Blizzard",
    "FTC seeks injunction to block $68.7B Microsoft acquisition of Activision Blizzard",
    "The FTC Is Trying To Stop The Microsoft, Activision Blizzard Deal Again",
    "FTC files to block Microsoft's $69B Activision Blizzard acquisition [Updated]",
    "FTC files for an injunction against Microsoft's purchase of Activision Blizzard [Update]",
    "FTC to file injunction blocking Microsoft, Activision Blizzard transaction",
    "FTC Moves to Block Microsoft's Activision Blizzard Deal",
    "FTC aiming to block Microsoft's Activision Blizzard acquisition with injunction",
    "The FTC is filing an injunction to block Microsoft's Activision acquisition",
    "FTC To Seek Injunction Halting Microsoft-Activision Deal, And The Xbox Company Is Happy About It",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard",
    "FTC expected to block Microsoft's $69B purchase of Activision Blizzard: report",
    "Report: FTC to file injunction to block Microsoft-Activision merger",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "The FTC can change the venue, but not the facts. https://twitter.com/...",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft, Activision Deal",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "Office of the Director of National Intelligence",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data, U.S. Says",
    "The U.S. Is Openly Stockpiling Dirt on All Its Citizens Thanks to Commercial Data Brokers",
    "ODNI Declassified Report on CAI",
    "The US government is buying troves of data about Americans",
    "@rodhilton@mastodon.social",
    "@ericleamen@mastodon.social",
    "@codinghorror@infosec.exchange",
    "API pricing protests caused Reddit to crash for 3 hours",
    "Reddit sees more than 6,000 communities ‘go dark’ in protest over API changes",
    "Reddit communities go dark in protest at changes",
    "The Why of Reddit Protests",
    "Reddit says protesting communities crashed the site",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "What is Reddit blackout protest: Explained",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Reddit Blackout Begins as Forums Protest Charges for Developers",
    "Apple Subreddit Goes Dark in Protest of Reddit's API Pricing Changes",
    "Reddit's massive ‘blackout’ protest, explained",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Over 7k Subreddits Go Private in Protest Over API Pricing Increase",
    "This third-party Reddit app may survive — but only with a paid subscription",
    "Reddit Crashed Because Too Many Users Are Protesting Site Changes",
    "Reddit's Crypto Communities Go Dark In Support of Protest Against API Changes",
    "Subreddits Go Dark As Reddit Power Users Protest API Changes",
    "Reddit blackout: Thousands of subreddits go dark as user protest begins",
    "Reddit faces mass protest over its API changes",
    "Apollo To Shut Down June 30th, Leading Many of the Largest Subreddits to Stage a Blackout",
    "Reddit's Site-Wide Protests Resulted In A Major Outage",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "Reddit Goes Down As Communities Protest Wildly Unpopular Changes [UPDATE]",
    "48-hour Reddit user blackout kicks off, affecting 8K subreddits",
    "Reddit Communities Go Private in Protest Over Policy Adjustments",
    "Over 2.5B Reddit users flee to protest API changes",
    "It Sounds Like The Widespread Reddit Blackout Has Crashed The Overall Site, Too",
    "Reddit went down amid blackout protest over company's new policy",
    "Reddit down amid major protest",
    "Is Reddit Down? How To Check Server Status",
    "Reddit blackout: What, why and how it is impacting users",
    "Reddit Blackout darkens popular Windows and Microsoft subreddits",
    "@viticci@mastodon.macstories.net",
    "@mainframed767@infosec.exchange",
    "This one should stay locked just because of the jokes. [image]",
    "the west has fallen [image]",
    "According to https://reddark.untone.uk/, 92.6% (7234/7806) of subreddits have gone private.",
    "Reddit is having server issues right now on top of the subreddit blackout. What a dumpster fire.",
    "the ongoing Reddit drama is once again a reminder that adtech is a horrible business model",
    "The Reddit strike has begun, and there's a great site to track it. https://reddark.untone.uk/",
    "Reddit crashed because of the growing subreddit blackout",
    "Why The Blackout's Happening- From The Beginning",
    "Reddit's users and moderators are pissed at its CEO",
    "Reddit's users and moderators are revolting against its CEO",
    "Reddit is Crashing Because of the Growing Subreddit Blackout",
    "@davidgerard@circumstances.run",
    "Emmer, Davidson Introduce ‘SEC Stabilization Act’ to Remove Chair Gary Gensler",
    "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "Maybe Coinbase Should Never Have Gone Public",
    "U.S. Congressman Officially Files Bill to Fire SEC Chair Gary Gensler",
    "Former SEC Official Says Coinbase Is Committing ‘Criminal Offense’ in Its Defense Against SEC",
    "US Congressman Files Legislation to Fire SEC Chair Gary Gensler",
    "Republican lawmakers take shot at SEC's Gensler with proposal to oust him",
    "The SEC has spoken: The future of finance is not in America",
    "Coinbase Is the Latest Target of the SEC's Crypto Crackdown—How U.S. Investors May Be Affected",
    "“But the SEC let us go public” and other flawed arguments in Coinbase's defense",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "M2 Ultra Mac Studio review: Top of the line",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "Apple Mac Studio (M2 Max) review: Re-filling the need for speed",
    "New Mac Studio and M2 Ultra Mac Pro now available to pick up in store as deliveries begin today",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "M2 Mac Studio Review: This is the New Pro Mac",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "New 2023 Mac Studio Review Roundup [Video]",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Mac Studio review roundup: The Pro's choice",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "Breakup of Google Ad-Tech Business Now on Table in Europe, Too",
    "EU weighs push to break up Google's ad-tech business: WSJ",
    "Google could be forced to sell parts of its advertising business",
    "The EU could force Google to break up its ad business",
    "EU to file a formal antitrust complaint against Google's advertising business",
    "EU regulators may demand Google to sell part of ad-tech business - source",
    "EU regulators may demand Google to sell part of adtech business",
    "Thoma Bravo Hits Home Run With Adenza Deal",
    "EU regulators may demand Google to sell part of advertising-technology business: Report",
    "Google's ad tech dominance spurs more antitrust charges, report says",
    "Google reportedly faces fresh EU antitrust charges over ad tech policies",
    "Google to get hit with EU antitrust charges",
    "Brace for it... https://twitter.com/...",
    "Google To Get Hit With EU Antitrust Charges for Ad Tech Abuses",
    "NYC food delivery gig workers score a big minimum wage victory",
    "EU countries amend draft proposal on gig workers' rights, companies unhappy",
    "NYC Food Delivery Workers Secure Landmark Minimum Pay Rate",
    "NYC establishes first minimum wage for food delivery workers",
    "NYC mandates minimum wage for app-based delivery workers",
    "New York City Sets New Minimum Wage for Food Delivery Workers",
    "Uber, DoorDash, and Other Delivery Apps Will Now Have to Pay Workers a Minimum Wage in NYC",
    "These food delivery drivers will get the nation's first minimum wage for app-based workers",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "New York City introduces new minimum pay rate for food delivery workers",
    "EU countries back overhaul of app workers' conditions",
    "Google Search Generative Experience Gets Major Update to Improve Answers",
    "Oracle Announces Fiscal 2023 Fourth Quarter and Fiscal Full Year Financial Results",
    "Oracle cloud revenue up 54 percent in fourth quarter",
    "Oracle Reports Record Revenue of $50 Billion in FY23, Driven by Cloud Growth",
    "Oracle beats quarterly revenue estimates on cloud services demand",
    "Oracle 4Q Revenue, Net Income Beat Estimates — Earnings Review",
    "Oracle Pushes to Record High as AI-Frenzy Spurs Cloud Demand",
    "Oracle beats on top and bottom lines as cloud revenue jumps",
    "Oracle Earnings Day Is Here. The Focus is on Cloud and AI.",
    "Seems nobody gets fired for buying Oracle. Sadly. https://twitter.com/...",
    "Personalized wealth management, built for tech people",
    "Salesforce dives into the AI cloud",
    "Salesforce's VC arm doubles fund size for generative AI to $500 million",
    "Salesforce pledges to invest $500M in generative AI startups",
    "Salesforce Launches AI Cloud to Transform Customer Relationship Management",
    "Salesforce unveils AI Cloud offering, doubles fund for AI startups to $500 mln",
    "AAA's second-largest club taps Salesforce for generative AI push",
    "Salesforce launches AI Cloud to bring models to the enterprise",
    "Salesforce Ups Generative AI Fund to $500M, Launches AI Cloud",
    "Salesforce to invest $500 million in generative AI startups; unveils new AI Cloud offering",
    "Salesforce Ventures Doubles Down on Generative AI Fund",
    "Salesforce Ventures Doubles Down On AI Investments",
    "Salesforce bets big on AI, with new products and increased investment",
    "Salesforce announces AI Cloud to empower enterprises with trusted generative AI",
    "Salesforce adds generative AI support across its application portfolio",
    "Amazon cracks down on fake reviews with AI",
    "Free compensation benchmarking data from 3,000 startups",
    "Embrace the future of note-taking with Noteboard",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/12 - Why Your Favorite Subreddit Might Go Dark.",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Netflix weighs live broadcast of golf tournament, its first foray into live sports, WSJ says",
    "Netflix Stock Rises After Report It May Start Live-Streaming Sports Events",
    "Netflix is reportedly getting ready to stream its first-ever sporting event",
    "Lolwut  —  Not sure what the opposite of clickbait is (click repellent?) but this qualifies",
    "Together at last: the two dullest non-sports on the planet https://twitter.com/...",
    "I would very much watch this please and thank you https://twitter.com/...",
    "Embracer announces restructuring program, studio closures expected",
    "TCV Misses $5.5 Billion Fundraising Goal, Filings Show",
    "Sequoia will still stand tall in China after VC firm's breakup",
    "CloudZero nabs $32m investment in new era for cloud cost management",
    "CloudZero raises $32M to nearly double size of team",
    "CloudZero Raises $32 Million To Transform Cloud Cost Management",
    "Cloud cost intelligence platform CloudZero raises $32M",
    "CloudZero Raises $32M in Series B Funding",
    "Site inspection drone company Percepto raises $67m",
    "Israeli drone maker Percepto raises $67 million after US regulatory nod",
    "Percepto raises $67M for industrial inspection drone technology platform",
    "Percepto Raises $67M in Series C Funding",
    "Robinhood sees May crypto trading volume tumble 68% from a year ago",
    "Robinhood Markets, Inc. Reports May 2023 Operating Data",
    "Robinhood reports mixed operating data for May 2023, user engagement down",
    "Robinhood's Crypto Trading Takes a Major Hit: May Volume Falls 68% to $2.1B",
    "Robinhood Reports 68 Percent Decline in Crypto Trading Compared to 2022",
    "AI could be used to provide ‘personalised learning’ to schoolchildren, Rishi Sunak says",
    "A Massive Vaccine Database Leak Exposes IDs of Millions of Indians",
    "Personal data of COVID vaccine recipients ‘leaked on Telegram messenger’",
    "India probes medical info ‘leak’ to Telegram",
    "CoWin portal safe, reports of data breach ‘mischievous’, asserts govt",
    "No leak of users' data from CoWIN portal, adequate safety measures in place: Govt",
    "CERT-In looking into CoWIN data breach issue claims Centre",
    "Hint of past Covid vaccine data breach puts Narendra Modi government under the pump",
    "CoWIN vaccination data out, Centre denies breach",
    "Government refutes claims of CoWIN data breach; CERT-In reviews matter",
    "CoWIN data ‘leak’: Why the govt statement raises more questions than it answers",
    "Government to probe alleged CoWin data leak, MoS Rajeev Chandrasekhar says not a direct breach",
    "India Investigates COVID Vaccine Data Breach",
    "Telegram bot leaks CoWIN data",
    "Marques Brownlee on YouTube",
    "15-inch MacBook Air review: Sometimes bigger is better",
    "MacBook Air 15-inch vs Dell XPS 15 OLED: Which laptop wins?",
    "MacBook Air 15: Bigger screen is a huge hit, largest ever in a MacBook Air",
    "Apple 15-inch M2 MacBook Air review",
    "Apple MacBook Air 15-Inch Review: Finally, Big for Less",
    "The 15-inch MacBook Air offers superb battery life and portability at an aggressive price",
    "Apple MacBook Air 15-Inch Review",
    "First 15-inch MacBook Air and Apple Silicon Mac Pro orders now arriving to customers",
    "Apple MacBook Air 15\" Gives Consumers What They Want",
    "15-inch M2 MacBook Air reviews are out — 3 things people hated about it",
    "15\" MacBook Air M2 Review: The Obvious Thing!",
    "15\" M2 MacBook Air Review - FINALLY!",
    "MacBook Air 15-inch: At last, Apple fills a glaring gap in its line-up",
    "15-inch MacBook Air review: The best is still the best, just bigger",
    "Review: Apple's 15-inch MacBook Air says what it is and is what it says",
    "Apple MacBook Air 15-inch (2023) review",
    "15-Inch MacBook Air Reviews: The Sweet Spot for Performance, Size, and Value",
    "15-inch M2 MacBook Air reviews: Big screen, bigger value",
    "15-inch MacBook Air review roundup: Big screen, big value",
    "15-inch MacBook Air review roundup: Killer for consumers",
    "Apple 15-inch M2 MacBook Air Review Roundup [Video]",
    "Apple MacBook Air 15-inch review: Bigger screen is an absolute dream",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "15-inch M2 MacBook Air (2023) Unboxing & Comparison",
    "MacBook Air M2 15-inch review: the best laptop you can buy under €2,000",
    "15in MacBook Air review: Apple's best consumer laptop, just bigger",
    "Evergreen summary of every new Apple product. HT @Techmeme [image]",
    "NEW VIDEO - 15\" M2 MacBook Air Review: The Obvious Thing! https://www.youtube.com/... [image]",
    "Ex-Samsung Elec executive accused of stealing secrets for China chip factory",
    "Ex-Samsung exec indicted for stealing trade secrets to build copycat plant in China",
    "Former Samsung exec accused of stealing data to build copycat chip plant in China",
    "Ex-Samsung executive alleged to have stolen tech to recreate chip plant in China",
    "U.S. Government to Allow Chipmakers to Expand Facilities in China",
    "Ex-Samsung exec arrested for trying to steal a ‘complete copy’ of a factory.",
    "Ex-Samsung exec charged with stealing trade secrets to create copycat chip factory in China",
    "Ex-Samsung executive accused of audacious chip factory plan",
    "Asia Markets Mostly Rise as U.S. Inflation Forecasts Fall, Nikkei to Reach New 2023-Highs",
    "Samsung Ex-Executive Arrested for Alleged Chip Tech Theft #1674",
    "Ex-Samsung executive faces trial for stealing chip secrets",
    "Former Samsung executive indicted for stealing chip tech",
    "Former Samsung Exec Indicted for Stealing Secrets for Chinese Chip Plant",
    "Reddit revolt puts CEO Steve Huffman in a tough position",
    "Former Samsung exec allegedly stole blueprints to build a factory a mile away",
    "Ex-Samsung Executive Accused of Stealing Secrets for China Chip Factory",
    "Bethesda Softworks on YouTube",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Xbox's Bright Future, and How We'll Get There",
    "Giant Bomb at Nite: Night 3",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Starfield Direct - Gameplay Deep Dive",
    "Starfield PC System Requirements Revealed, Stuck at 30 FPS on Xbox",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "A PS5 PRO WITHOUT COMPETITION?  MICROSOFT DOESN'T SEE THE NEED FOR A NEW XBOX",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Why Microsoft Is Excited About the Future of Gaming on the Xbox",
    "Microsoft exec says Starfield has ‘the fewest bugs any Bethesda game ever shipped with’",
    "Xbox says PC audience 'isn't a window, it's a market that deserves our games day 1'",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Microsoft unveils black 1TB Xbox Series S, doesn't see the need for mid-cycle console refresh",
    "Don't expect a more powerful Xbox Series X anytime soon",
    "Don't Expect an Xbox Series X Pro Console",
    "Will There Be A New Xbox In 2023?  Don't Get Your Hopes Up  —  Microsoft is in no rush …",
    "Game Pass and Xbox are profitable, Phil Spencer reiterates",
    "Microsoft's Phil Spencer Says No Urgency for Major Xbox Console Upgrade",
    "Microsoft's revamped Xbox Home UI is finally launching soon",
    "Xbox Isn't Currently Planning a Mid-Gen Console Upgrade",
    "Bethesda and NASA created a new punk genre just for Starfield",
    "Playing Xbox games on a Mac will soon be way easier",
    "Phil Spencer Says Don't Expect A New Xbox Anytime Soon",
    "Xbox Finally Flexes Some Muscle After Years Of Atrophy",
    "Phil Spencer Says Mid-gen Xbox Upgrade Doesn't “Feel an Imperative”",
    "Microsoft's PC Game Pass titles will start streaming on GeForce Now",
    "Microsoft Gaming CEO Phil Spencer doesn't see imperative for Xbox Series X|S hardware revision",
    "The biggest announcements from the Xbox Games Showcase 2023 and Starfield Direct",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition",
    "Watch 45 minutes of new Starfield gameplay",
    "Microsoft announces black Xbox Series S with 1TB of storage for $349",
    "AI is polluting the Internet, so one writer bought a physical encyclopedia set instead",
    "Gensyn Raises £33.8M in Series A Funding",
    "Andreessen Horowitz (\"a16z\") Announces its First International Expansion to the United Kingdom",
    "Expanding to the UK  —  Over the last year it has become clear that blockchains …",
    "A16z Chooses London as Destination for First Office Outside U.S.",
    "London crypto move is a sign of desperate times",
    "a16z Expands To London Citing Favorable Crypto Regulatory Environment",
    "a16z Chooses the U.K. for First International Expansion",
    "VC Firm Andreessen Horowitz Lured By UK's Crypto Regulatory Environment To Open London Office",
    "Andreessen Horowitz is opening its first international office in London",
    "Andreessen to Open London Office for Crypto Startups Amid Scrutiny in U.S.",
    "A16z picks crypto-friendly London for first non-US base",
    "a16z leads $43m funding round for Gensyn AI",
    "Blockchain-based, AI compute protocol Gensyn raises $43 million in a16z-led round",
    "Andreessen Horowitz has announced plans for a London-based crypto accelerator",
    "London lures a16z's first international office with ‘predictable’ crypto regs",
    "Gensyn AI Secures $43M for Decentralized Machine Learning Led by a16z",
    "Andreessen Horowitz to open London crypto office in first push overseas",
    "Sunak Keeps Up Push To Make UK a Leader in AI Regulation",
    "Absolutely mad https://twitter.com/...",
    "it's called u16k now actually https://twitter.com/...",
    "This is a win for the UK. Congrats to @a16z and the UK Crypto community. https://twitter.com/...",
    "Are US politicians paying attention? https://twitter.com/...",
    "UK is having its “How can I help” Miami moment for crypto.... https://twitter.com/...",
    "BRITISH DYNAMISM https://twitter.com/... [image]"
]