[
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 13%",
    "US SEC sues crypto exchange Coinbase, one day after suing Binance",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "SEC sues Coinbase in widening crackdown on crypto exchanges",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker-Dealer",
    "Coinbase Violated Securities Laws With Staking Program, Multiple U.S. State Regulators Allege",
    "Are Centralized Exchanges in the U.S. Doomed?",
    "‘We will continue to operate our business as usual’ says Coinbase legal chief",
    "Crypto Wilts in Summer Heat as SEC Charges Both Binance and Coinbase",
    "Coinbase is being sued by the SEC",
    "Coinbase sued by SEC in New York Federal court",
    "SEC Chair Gensler lambasts crypto industry after agency charges Binance, Coinbase",
    "SEC to Coinbase: You're Making Billions But Failing to Protect Investors",
    "SEC Charges Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "SEC accuses Coinbase cryptocurrency exchange of breaking US regulations",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "Coinbase sued in the US for breaking securities laws",
    "Coinbase Caught In SEC Legal Crossfire, COIN Price Suffers",
    "US Crypto Crackdown Reaches Fever Pitch as SEC Sues Coinbase",
    "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market",
    "SEC charges Coinbase with running an illegal exchange in fresh blow for crypto",
    "Crypto Twitter abuzz with Coinbase banter after SEC lawsuit",
    "SEC Sues Coinbase for Violating Securities Law, Exposing Customers to ‘Significant Risk’",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "SEC cracking down on crypto: Coinbase, Binance face charges",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "Elon Musk Shills Dogecoin as SEC Designates Top Cryptos as Securities",
    "SEC Goes After Coinbase, Biggest US Crypto Exchange",
    "Coinbase (COIN) Shares Tumble 9% amid SEC's Binance Securities Violation Allegations",
    "Coinbase Stock Price: Can Crypto Exchange Survive COIN Shares Slump, SEC Charges?",
    "SEC Sues Coinbase Over Alleged Securities Violations",
    "Coinbase May Face Cease & Desist Orders From 10 States Following SEC's Lawsuit",
    "How are the “we take a long view of crypto” people doing today",
    "mission driven company, where the mission is failure",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "Yes. https://twitter.com/...",
    "Gary upping the ante this week. https://twitter.com/...",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "BREAKING WE'RE ALL CRIMINALS",
    "Mistakes were apparently made... https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "SEC is going crazy https://twitter.com/...",
    "SEC brings charges against cryptocurrency trading platform Coinbase",
    "SEC sues Coinbase over alleged violations of securities laws",
    "Coinbase Staking Program Targeted by Alabama Securities Regulator",
    "SEC claims Coinbase's staking service is an investment contract in lawsuit",
    "SEC sues Coinbase over exchange and staking programs",
    "Crypto stocks fall after US SEC sues Coinbase over failure to register",
    "Coinbase Drops 9% Post Binance Lawsuit: Company Rallies for ‘Clear’ Crypto Rules",
    "Marques Brownlee on YouTube",
    "Apple Vision Pro Impressions!",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "Even with so many demonstrated use cases, Apple Vision Pro might not yet have a purpose",
    "Apple made the best face computer.  But it's still a face computer.",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Apple Stock Falls As Critics Call Vision Pro Headset ‘Nerd Goggles’",
    "Why AR is the future despite Apple Vision Pro backlash, and one thing Google Glass did right",
    "Wear glasses? Apple's already expensive Vision Pro headset will cost you even more",
    "I tried Apple's new headset. Here's what it's like to use",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Why I Can't Bet Against Apple's Mixed-Reality Prowess",
    "Tim Cook says $3,500 Apple Vision Pro is ‘a great value’",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Apple Vision Pro looks insanely impressive - but my Vision Air 2 guess still feels right",
    "I tried the Apple Vision Pro mixed-reality headset — here's what it's like",
    "Apple Vision Pro tidbits: launch time, prescription, accessories and more",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple Vision Pro is not just an AR/VR Headset",
    "Apple's Vision Pro is a genuine leapfrog in mixed-reality capabilities",
    "The Apple Vision Pro is the company's first VR headset",
    "Apple Unveils Vision Pro: A $3,499 Headset That Blends AR and VR like Microsoft's HoloLens",
    "Did Apple just make a move into the Metaverse?",
    "Apple Vision Pro first look",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro demo roundup: Here's what everyone is saying",
    "In defense of the Apple Vision Pro battery pack (with one major concession)",
    "TechScape: Is Apple's $3,500 Vision Pro more than just another tech toy for the rich?",
    "This is all the futuristic tech inside the Apple Vision Pro headset",
    "Apple's new Vision Pro headset will support Microsoft Word, Excel, and Teams",
    "Wow, Very cool: Apple Vision Pro's first reviewers are impressed",
    "EyeSight Is One Of Apple Vision Pro's Wildest Features",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "This is not the final form https://9to5mac.com/...",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "I gotta admit, this part made me a bit sad. [image]",
    "Do not dismiss Apple's pricey new headset too prematurely",
    "My Thoughts After Using Apple Vision Pro",
    "Apple's AR Vision Pro headset isn't the HoloLens competitor I thought it was going to be",
    "The Apple Vision Pro is the strangest camera ever made",
    "I got to play with the Apple Vision Pro and saw the future of computing. Again.",
    "If Apple Vision Pro is the answer, what's the question?",
    "Apple Thinking About the Next Decade & Beyond with Vision Pro Announcement",
    "No Tim Cook, the Apple Vision Pro headset does not cost ‘$34.99’",
    "WWDC 2023: Apple launches Vision Pro and raft of products powered by new chipsets",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "The Apple Vision Pro marks a turning point in the AR/VR market",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple Vision Pro vs. Meta Quest 3: The next generation of VR",
    "Apple's Vision Pro Is Pricey, but It Has a Chance",
    "Apple's Vision Pro Joins Crowded Field Trying to Make Headsets the Next Big Thing",
    "Want to develop apps for Apple Vision Pro? Here's Apple's top tips",
    "I wanted the “Wow” factor for the Apple Vision Pro reveal, but all I got was a “Why?”",
    "Word, Excel and Teams are coming to the Apple Vision Pro AR headset",
    "The Future Of Spatial Computing: Apple Unveils The Vision Pro AR Headset",
    "Apple CEO Tim Cook says Vision Pro is 'tomorrow's engineering, today': Exclusive",
    "You can make the Apple Vision Pro even more expensive with a luxury leather headband",
    "Unity Software stock price surges on news of Apple's Vision Pro headset. Here's what's happening",
    "Vision Pro: Apple Finally Unwraps Ambitious, Long-Rumored VR Headset at WWDC",
    "Apple Is Coming Out With A New VR Headset",
    "Apple just revealed its first major product in over 8 years — meet the $3,499 ‘Vision Pro’",
    "Apple is expected to unveil sleek headset aimed at thrusting the masses into alternate realities",
    "Apple Vision Pro + cooperation with Disney is 🔥🔥🔥 #WWDC23",
    "The Disney vision for Apple AR/VR is far more compelling than Apple's demo was [video]",
    "Yeah, Apple just killed Meta and Oculus with this Disney partnership.",
    "Unity + Apple Disney + Apple Meta is done.",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia Splits Its Global Fund Into Three Separate Businesses",
    "VC Firm Sequoia Capital to Divide Into 3 Independent Companies",
    "Sequoia Splits Into Three Entities, Makes China Standalone Firm",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Sequoia Capital to carve off China and India units as it faces ‘increasingly complex’ pressures",
    "Sequoia India, SE Asia Team Rebrands To Peak XV With $2.5 Bn Dry Powder",
    "Sequoia Capital to split into three parts, separating its China and India businesses",
    "Sequoia splitting into three independent entities for India & SEA, China, US & Europe",
    "Sequoia rebrands to Peak XV Partners in India and SEA",
    "Sequoia India and SEA rebrands as Peak XV Partners",
    "Sequoia Capital's Chinese Arm to Split From U.S. Firm",
    "Sequoia Spins Off India Unit; Rebrands To Peak XV Partners",
    "Sequoia to separate China, India and Southeast Asia by March 2024",
    "Sequoia splits China and India arms from US mothership",
    "Here is the global business update we shared with our LPs. [image]",
    "really solid piece from @alexrkonrad https://www.forbes.com/...",
    "👀😳 https://twitter.com/...",
    "End of an era. https://twitter.com/...",
    "Massive moment for venture in India https://www.forbes.com/...",
    "Binance Withdrawal On Track to be Largest Since March Crypto Banking Crisis",
    "Binance Users Pull $778 Million Amid SEC Crackdown",
    "SEC/crypto: the knives are out for exchanges",
    "Investors pull $790 million from crypto exchange Binance after SEC charges",
    "Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours",
    "Binance Reportedly Bleeds $790M in Investor Funds Following SEC's Damning Charges",
    "Binance experience massive outflows in the wake of SEC lawsuit",
    "U.S. SEC sues Coinbase, one day after Binance lawsuit",
    "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen",
    "Binance adds Bitcoin NFTs to its marketplace one day after SEC lawsuit",
    "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "Coinbase CEO Calls on Congress to ‘Fix the Situation’ After SEC Lawsuit",
    "SEC sues Coinbase alleging that it's operating an unregistered exchange",
    "Coinbase Stock Down 18% in Pre-Market Trading in Wake of SEC Lawsuit",
    "Binance lawsuit adds another 10 cryptos to SEC securities list",
    "Binance Responds to SEC's Complaint, Pledges “Vigorous” Defense Amid Overwhelming Industry Support",
    "Binance Sees Massive Outflows Following SEC Lawsuit: Data",
    "SEC vs. Binance: $115 billion battle over crypto regulation",
    "Bitcoin (BTC) and Broader Crypto Market Come Crashing Down Following SEC Lawsuit on Binance",
    "Coinbase COIN Stock Drops 10% Following SEC's Lawsuit Against Binance",
    "BREAKING: Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "Crypto liquidations peak as SEC's Binance lawsuit shakes crypto markets",
    "Shiba Inu Investors Go All-In: 338 Billion Token Accumulation Signals Bullish Cue",
    "SEC Calls Solana, Cardano, Polygon Securities In Binance Lawsuit",
    "BNB price prediction: Is it safe to buy Binance Coin now?",
    "US District Court for the District of Columbia",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "SEC Sues Coinbase for Breaking Securities Laws",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "CFTC Chair Behnam Will Testify at a House Hearing on Bitcoin Futures",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "SEC's ‘Scathing’ Charges Against Binance Deal a Big Blow to US Crypto",
    "Coinbase CEO Confident in Impending Court Battle With The SEC",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "Binance vs. SEC: Top 5 Current Lawsuits Against Crypto in the U.S.",
    "Altcoins Dip Following Second SEC Lawsuit Against Crypto Exchange",
    "House Debate Over New Crypto Bill Comes As Binance Suit Shows Regulatory Cracks In U.S.",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "The SEC is suing Binance, the world's largest crypto exchange",
    "SEC Sues Binance Over Violations of US Securities Rules, Exchange Hits Back",
    "Breaking: Coinbase Sued by SEC Just a Day After Binance Lawsuit - Which Firm is Next?",
    "SEC Wants Blood: Coinbase Sued 1 Day After Binance",
    "NFT Mogul Transfers NFTs Worth Millions To Show Support For Binance",
    "The Hill's Morning Report — Can Pence stand with — and apart — from Trump?",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "Those Binance charges in full",
    "SEC sues crypto giant Binance and its CEO",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "Strong together. https://twitter.com/...",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "we welcome clarity and guida— NOT THAT KIND OF CLARITY AND GUIDANCE",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "Potential bankrun type situation 👀 https://twitter.com/...",
    "The gears of justice grind slowly but they grind exceedingly fine. https://twitter.com/...",
    "Those Binance charges in full https://www.ft.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "[DB] SEC Alleges BNB, BUSD Are Securities in Lawsuit",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "And another one bites the dust (maybe?) https://markets.businessinsider.com/ ...",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "SEC charges Binance with the exact same accusations as FTX: https://www.nytimes.com/... [image]",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Some users without developer accounts still seeing iOS 17 beta, but don't expect it to last",
    "iOS 17 Developer Beta accidentally made available to all",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple redesigns its Shortcuts app in iOS 17 to be easier to use",
    "Apple accidentally releases public iOS 17 beta early",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "iOS 17 beta is here, but only for developers",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "Here Are the iPhone and iPad Models That Will Get the iOS 17 and iPadOS 17",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple confirms eligible devices for iPadOS 17, iOS 17, watchOS 10 and macOS Sonoma upgrades",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "iOS 17 Tidbits: Enhanced Siri Suggestions, Multiple Timers, Recipe Visual Look Up, and More",
    "Apple announces powerful new privacy and security features",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "Sharing your phone number will get much easier with iOS 17",
    "Apple WWDC: New Macs, Vision Pro Headset, macOS Sonoma, and iOS / iPadOS 17",
    "Craig Federighi on new Apple privacy features; how Apple will protect us from AI",
    "For better or worse, Apple is avoiding the AI hype train",
    "Why AI wasn't mentioned at all during Apple's big WWDC presentation",
    "‘Ducking hell’ to disappear from Apple autocorrect",
    "Apple avoids the AI trap at WWDC",
    "Apple's Vision Pro: Where's the 5G?",
    "Apple users can now type what they ducking want",
    "Apple Ghosts the Generative AI Revolution",
    "Apple's practical approach to A.I.: No bragging, just features",
    "Apple WWDC AI word count: 0",
    "“Transformer-based” in the keyboard. First LLM mention. Everyone take a drink. #WWDC",
    "Not sure why anyone thought there would be an AI focus today... https://twitter.com/...",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft to pay $20 million for XBOX children privacy violations",
    "Microsoft to pay $20 million to settle Xbox Live privacy allegations",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "Microsoft to pay $20M FTC fine over Xbox child account data collection practices",
    "Microsoft Fined $20 Million by FTC Over Storage of Xbox Data",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Microsoft to Pay $20M to Settle FTC Charges It Violated Children's Privacy",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Kids' Xbox Data",
    "Microsoft Settles FTC Charges for $20 Million over Xbox Child Privacy Violations",
    "Microsoft Charged $20 Million by FTC Over ‘Illegally Collected’ Children's Information on Xbox",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Children's Data",
    "Microsoft to pay $20 million for violating children's privacy laws",
    "Microsoft will pay the FTC $20 million to settle charges over collecting children's data",
    "Microsoft To Settle FTC Kids' Privacy Case With $20M",
    "Microsoft to pay $20 million FTC settlement over improperly storing Xbox account data for kids",
    "US fines Microsoft $20m over child data violations",
    "Microsoft hit with $20 million fine after collecting children's data on Xbox consoles",
    "Microsoft settles with FTC for $20 million over Xbox child data violations",
    "Microsoft Must Pay US Government $20 Million Over Xbox Privacy Violations",
    "FTC Fines Microsoft For COPPA Violations Affecting Younger Xbox Users",
    "Microsoft fined $20m for violating online child protection laws",
    "That fine is 49 minutes of Microsoft's revenue.",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "Next Challenger, Please: Reshaping The Tech Landscape Using AI",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Important new post from @pmarca https://a16z.com/...",
    "r/Save3rdPartyApps on Reddit",
    "Reddit's plan to kill third-party apps sparks widespread protests",
    "The Battle for Reddit: Users and Developers Unite in Protest against Unfair API Fees",
    "Here's why so many Reddit communities are planning to go offline for 48 hours (or more)",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "Top Reddit communities going dark to protest third-party API charges",
    "Reddit in Mass Revolt Over Astronomical API Fees That Would Kill Third Party Apps",
    "Reddit communities are ‘going dark’ to protest changes that would hurt third-party apps",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "Instagram Tests New AI Chatbot Experience in DMs",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Instagram works on AI Chatbots in DMs",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Payroll platform Immedis snapped up by US workforce management firm",
    "Terry Clune-owned Immedis sold in deal valued at nearly €600m",
    "Payroll provider UKG to acquire Immedis from CluneTech",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Digital asset-denominated life insurer Meanwhile snags $19 million funding round",
    "AI-Enhanced Business Services Startup Instabase Raises At $2B Valuation",
    "TSMC can help ‘stabilize’ U.S.-China relations: Chairman",
    "TSMC identifies two challenges with German plan",
    "TSMC feeling ‘good’ about possible Germany plant, in talks on subsidies",
    "TSMC Says Capex to Be Near Low End of Target at $32 Billion",
    "TSMC expects H2 performance to be better than H1",
    "“Going to the US is not all downside” https://www.ft.com/...",
    "Made it. $TSM AGM. I'm at the back, final row. 🙃 [image]",
    "Mobileye Stock Falls. Intel Found a Way to Cash in on AI.",
    "Intel Details PowerVia Backside Power Delivery Technology",
    "Intel has unveiled a weapon against TSMC and Samsung. PowerVia technology is unparalleled",
    "Intel Shows Off Bottleneck-Busting PowerVia Tech, On Schedule For 2024 Arrival",
    "Intel's backside power delivery process could make CPUs a whole lot more efficient",
    "Intel gets a speed boost from its PowerVia power delivery tech for its 2024 Arrow Lake CPUs",
    "Intel Claims It's 2 Years Ahead of Its Rivals With Backside Power Delivery",
    "Intel's 2024 PC Chips Getting a Speed Boost From New Power Tech",
    "Intel researchers claim to be two years ahead with breakthrough PowerVia tech",
    "A Long, Strange Trip for the ‘Uber for Nurses’",
    "AI generated content should be labelled, EU Commissioner Jourova says",
    "EU Urges Tech Giants to Label AI-Generated Content to Fight Disinformation",
    "GIGABYTE releases new firmware to fix recently disclosed security flaws",
    "Gigabyte rolls out update to fix dangerous backdoor in its motherboards",
    "You can now update your Gigabyte motherboard BIOS to fix that security backdoor",
    "New Gigabyte motherboard BIOS adds support for ‘next-gen Intel CPUs’",
    "This one, crucial thing will make or break the Apple Vision Pro",
    "Apple's Vision Pro Will Have Prescription Inserts For Glasses Wearers",
    "Me, accepting GDPR popups next year: [image]",
    "Zuck at the Oculus team rn [Image: “Code. I wanna see some fucking code!\"]",
    "mfw watching #WWDC23 [image]",
    "me using the new apple headset [video]",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "Apple worked with Zeiss to create custom inserts for glasses wearers. #WWDC23 [image]",
    "@chrismessina@mastodon.xyz",
    "@parismarx@mastodon.online",
    "Functional Not Flashy: The Top 6 New Features in MacOS Sonoma",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "These are the macOS Sonoma features that aren't available to Intel Macs",
    "macOS Sonoma drops support for another wide swath of Intel Macs",
    "Apple debuts macOS 14 Sonoma",
    "macOS Sonoma Drops Support for These Macs",
    "WWDC: What's new in macOS Sonoma?",
    "'Death Stranding: Director's Cut' walking onto Mac",
    "Apple reveals macOS Sonoma with screensavers and widgets",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Which Macs support macOS 14? Mostly only Apple Silicon models. Here's the list ...",
    "Apple reveals macOS Sonoma at WWDC 2023",
    "Apple Announces macOS Sonoma with Game Mode, Upgraded Widgets and More",
    "MacOS 14 Sonoma Launches at WWDC 2023",
    "macOS Sonoma adds Game Mode, a new design for desktop widgets, and more",
    "Apple announces macOS Sonoma with iMessage enhancements and aerial screensavers",
    "Apple announces macOS Sonoma with aerial screensavers, Game Mode, and more",
    "Twitter and Bluesky as web apps on Sonoma, with widgets in background.  Coolio.",
    "Presenter Overlay is going to kill many indie apps #WWDC23 [image]",
    "Literally no one plays AAA games on Mac and this changes nothing. And will change nothing.",
    "it looks like the Windows 11 version of Bliss too, with all those ripples https://twitter.com/...",
    "Windows Vista lives on with MacOS Sonoma widgets. Yey! #WWDC2023 #WWDC23 [image]",
    "Safari getting a web app feature (I billed it's better than the iPadOS version). [image]",
    "Apple Webapps: “Please please please don't make us add third-party app stores” [image]",
    "Netflix is gonna hate family passwords in iCloud PWAs for Safari is sick",
    "Next year's improvement to macOS Sonoma will be called macOS Napa. [image]",
    "Safari web apps on dock. Back to the future again. My head is spinning.",
    "MacOS Sonoma wallpaper Has some windows XP vibes [image]",
    "OK I wasn't going to be that mean. https://twitter.com/...",
    "macOS S̶o̶n̶o̶m̶a̶ Windows XP looks alright [image]",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "What we know about the MOVEit vulnerability and compromises",
    "BBC and British Airways affected by data breach at payroll company Zellis",
    "Clop Ransom Gang Breaches Big Names Via MOVEit Flaw",
    "British Airways, BBC and Boots were impacted the by Zellis data breach",
    "Clop Hits British Airways, BBC and Boots as Organizations Brace for More Attacks",
    "Extent of N.S. software breach still unknown, Microsoft blames ransomware gang",
    "Boots, BA and BBC have data stolen in cyber attack",
    "MOVEit victims emerge: British Airways, BBC and Nova Scotia",
    "Major Data Breach Exposes BA, BBC and Boots to File Transfer Hack: What You Need to Know",
    "Several Major Organizations Confirm Being Impacted by MOVEit Attack",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "British Airways, Boots and BBC among companies hit by cyber security attack"
]