[
    "This is the most beautiful pivot to AI I have ever seen https://twitter.com/...",
    "Sony CEO Hands Microsoft a Golden Assist by Downplaying Cloud Gaming Importance",
    "Sony's CEO admits that cloud gaming is still “very tricky” technically",
    "PlayStation Boss Says Cloud Gaming Has Too Many Technical Difficulties",
    "Sony may use proprietary AI to augment PlayStation cloud gaming",
    "Sony CEO warns technical issues still remain for cloud gaming",
    "Sony CEO Says Significant Barriers to Cloud Gaming Remain: FT",
    "Sony chief plays down threat to consoles from cloud gaming https://www.ft.com/...",
    "TSMC Arizona job hiring hurt by ‘brutal’ culture",
    "@dcseifert@mastodon.social",
    "What is Telly and is there a catch with its free 55-inch 4K TV?",
    "everything about this sounds absolutely awful https://www.theverge.com/...",
    "ISS U.S. National Laboratory",
    "US Space Force plans to launch its own cybersecurity satellite this week",
    "World's 1st ‘hacking sandbox’ satellite and more to ride on SpaceX's next NASA cargo launch",
    "Moonlighter space-hacking satellite readies for launch https://www.theregister.com/ ...",
    "Consumer Financial Protection Bureau",
    "Analysis of Deposit Insurance Coverage on Funds Stored Through Payment Apps",
    "Money stored in Venmo and other payment apps could be vulnerable, financial watchdog warns",
    "Money stored on apps like PayPal and Venmo could be at risk, feds warn",
    "U.S. financial agency says if you have money in PayPal or Venmo, get it out now",
    "Don't store money in Venmo, Cash App or PayPal, regulator says",
    "Federal Watchdog: Move Cash Out of CashApp, PayPal, Venmo or Risk Losing It",
    "Don't Store Your Money on Venmo, U.S. Govt Agency Warns",
    "Crypto and Fiat Stored on Apps Might Not Be Insured by The FDIC",
    "I feel pretty good about my $ in Apple Cash.",
    "Meta Is Trying, and Failing, to Crush Unions in Kenya",
    "Kenyan court declares Meta as the primary employer in its lawsuit",
    "Court blocks sacking of content moderators, holds Meta liable",
    "Kenyan Court Halts Mass Layoff of Facebook Moderators, Orders Support and Care",
    "Meta blocked from firing content moderators",
    "Kenya court orders suspension of mass layoff of Facebook moderators",
    "The Google Pixel Watch is randomly popping open for some",
    "Users report their Pixel Watch backplates randomly falling off",
    "Google Pixel Watch backplate coming undone for some users",
    "Google Pixel Watch Owners Report Issue With Backplate Falling Off",
    "Some Pixel Watch owners are reporting backplates falling off",
    "Some Pixel Watch owners are seeing the back panel fall off without clear cause",
    "Oof, some Pixel Watch units are randomly popping open (Update: Google statement)",
    "Google Pixel Watch's back is falling off and causing major frustrations",
    "Some Google Pixel Watch Units Are Falling Apart on Their Own",
    "Our Teardown Engineer's Favorite Pixel Watch Feature: Mystery Adhesive",
    "The back of the Pixel Watch is popping off for some people",
    "Pixel devices and random hardware issues go hand in hand https://www.androidpolice.com/ ...",
    "Unlock a new pipeline channel: your existing customers",
    "The legal case for Montana's TikTok ban",
    "Agencies issue rule to ban TikTok on contractor devices",
    "Hubble Network Targets Bluetooth-Enabled Satellite Network with $20M Series A",
    "Hubble Network Raises $20M in Series A Funding",
    "@kentborg@social.tchncs.de",
    "@Techmeme Sounds like a blessing, other languages being less attacked by LLMs.",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Swing Education Raises $38 Million in Series C Funding",
    "Swing Education Completes $38 Million In Series C To Connect Schools And Substitute Teachers",
    "Swing Education Raises $38M in Series C Funding",
    "Google Wallet Now Saves Passes, Tickets and Driver's License ID",
    "Google Wallet's latest update lets you save more than just your money",
    "Google's Wallet app is adding support insurance cards, driver's licenses, and more",
    "Big things in digital identity https://arstechnica.com/...",
    "This could be Apple's biggest product launch since the Apple Watch",
    "What our primate relatives can teach us about our own genomes",
    "Hundreds of new primate genomes offer window into human health—and our past",
    "AI trained on ape DNA predicts genetic disease risks for humans",
    "Best Infosec-Related Long Reads of the Week, 6/3/23",
    "Here's our @citizenlab report on BellTroX referenced in the piece https://citizenlab.ca/...",
    "AI gold rush: Nvidia joins the trillion-dollar club",
    "They couldn't upgrade to Hobees? https://www.wsj.com/...",
    "Harvard University's popular online computer course to use AI to for grading of assignments",
    "CS50, the World's Most Popular Online Programming Class, Turns to AI for Help",
    "Fallen Pizza Startup Zume Shuts Down After Raising Millions",
    "The $500 million robot pizza startup you never heard of has shut down, report says",
    "SoftBank-backed robot pizza Zume shuts down",
    "Another unicorpse https://www.theinformation.com/ ...",
    "Europe is against network fee charges on tech giants",
    "How EU member states voted on EU ‘traffic tax’ on tech firms",
    "A majority of EU states don't want big tech to pay for the infrastructure they benefit from",
    "@matthewrodier.bsky.social",
    "An update on our approach to US election misinformation",
    "YouTube now allows videos that falsely claim Trump won 2020 election",
    "YouTube reverses its election misinformation policy",
    "YouTube will stop removing false claims of 2020 US election fraud",
    "YouTube rolls back its rules against election misinformation",
    "YouTube to stop deleting false claims about 2020 election",
    "YouTube will stop removing false presidential election fraud claims",
    "YouTube faces backlash as it halts removal of false claims about 2020 US Presidential election",
    "After Ban, YouTube Will Allow Videos That Back 2020 Election Fraud Claims",
    "YouTube will no longer take down false claims about U.S. elections",
    "YouTube will stop removing false claims about 2020 election fraud",
    "YouTube Revises Its U.S. Election Misinformation Policy Amid Election Season",
    "YouTube says it will stop removing false claims about past elections",
    "YouTube reverses course, will not take down controversial or disproven political content",
    "YouTube will now allow 2020 election denialism content, in policy reversal",
    "YouTube Reverses Policy That Banned Claims Of Fraud In 2020 Election",
    "YouTube reverses policy, will allow election denial",
    "YouTube Will No Longer Remove US Election Fraud Content",
    "YouTube Will Stop Removing Videos Pushing Lies About the 2020 U.S. Presidential Election",
    "YouTube Nukes Policy Banning Election Denialism",
    "YouTube to stop removing content making false claims on past elections",
    "YouTube changes policy to allow false claims about past US presidential elections",
    "What's the worst that could happen?",
    "Why would you replace a good policy with a terrible one"
]