[
    "International Business Times",
    "Reddit hackers threaten to leak data stolen in February breach",
    "Hackers Threaten to Release Reddit Data Unless API Changes Are Rolled Back",
    "BlackCat Claims Hit on Reddit, Threatens Sensitive Data Leak",
    "Hacked Reddit Data To Be Published Unless API Changes Dropped, Hackers Say",
    "Hackers Say They'll Leak Reddit Data If API Pricing Changes Aren't Reversed",
    "BlackCat hackers threaten to leak 80GB worth of Reddit data",
    "Reddit hacker's demands include reversing API changes",
    "Hackers threaten to leak stolen data if Reddit doesn't reverse API changes",
    "Reddit Ransomware Raid Redux: BlackCat/ALPHV Demands $4.5M",
    "BlackCat ransomware gang demands $4.5M, API changes for 80GB leaked Reddit data",
    "BlackCat claims Reddit ransomware attack and calls for end to API pricing changes",
    "Reddit hackers want the company to roll back API changes or else",
    "BlackCat Hackers Threaten Reddit With Huge Data Leak Unless It Rolls Back API Changes",
    "Hackers demand Reddit pay millions and reverse API changes if it wants to keep data private",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "The BlackCat ransomware gang is now threatening to leak stolen Reddit data",
    "Reddit hackers issue ransom demands for cash and API changes",
    "BlackCat claims they hacked Reddit and will leak the data",
    "Hackers Threaten to Leak Confidential Reddit Data, Demand $4.5 Million",
    "Reddit fiasco: Now hackers steal 80GB of data, demand $4.5 million",
    "Hackers threaten to leak 80GB of stolen Reddit data; demands $4.5 million to delete it [details]",
    "Reddit Files: BlackCat/ALPHV ransomware gang claims to have stolen 80GB of data from Reddit",
    "Hackers threaten to leak 80GB of confidential data stolen from Reddit",
    "Hackers Threaten To Leak 80GB of Confidential Data Stolen From Reddit",
    "@williamgunn@mastodon.social",
    "Apple wants to control every image of an apple, says Swiss fruit firm",
    "Apple is trying to trademark depictions of actual apples",
    "Apple is forcing a 111-year old fruit company to change its logo in a weird trademark battle",
    "Apple, the company, wants to trademark images of apple, the fruit",
    "Is Apple bullying small firms? Swiss Fruit Union could be forced to change the logo",
    "Apple could force a 111-year-old fruit company to change its apple logo",
    "Apple, the company, looks to secure rights to the image of apples, the fruit, in Switzerland",
    "Apple moves to trademark actual apples in Switzerland",
    "Bananas IP case sees Apple seeking rights over actual apples",
    "Apple wants to force a fruit company to change its logo",
    "Apple wants rights to the image of apples in Switzerland",
    "Apple (those bâtards) vs. Swiss Apple Association",
    "First Mover Asia: Bitcoin ‘Looks Vulnerable’: Analyst",
    "Crypto.com operates internal proprietary trading desks: Financial Times",
    "Crypto.com says operating in-house trading team, market maker not ‘controversial’",
    "Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest",
    "Crypto.com Is Trading on Its Own Exchange, Insists That's Totally Fine",
    "Contention arises over Cryptocom trading teams",
    "Internal Teams at Crypto.com Trade Tokens for Profit: Report",
    "Crypto.com Refutes Accusations of Proprietary Trading (Report)",
    "Crypto.com denies allegations of market prices manipulation",
    "Crypto Live News: Intra-team Conflict Emerges Among Trading Groups at Crypto.com Exchange",
    "Crypto.com Uses ‘Internal Teams’ to Trade Assets for ‘Profit’: Report",
    "Reports of Controversial Trading Practices at Crypto.com Emerge, Exchange Responds",
    "Fortune favors market manipulation, apparently https://twitter.com/...",
    "wonder how much he regrets the deal https://twitter.com/... [image]",
    "What could possiblity go wrong? https://twitter.com/...",
    "@tchambers@indieweb.social",
    "@nexusofprivacy@mastodon …",
    "Update from Lemmy after the Reddit blackout",
    "Unofficial Subreddit Migration List (Lemmy, Kbin)",
    "Looking for a Reddit alternative? Lemmy tell you, they currently kinda suck",
    "Second Life in the Threadiverse",
    "@mastodonmigration@mastodon.online",
    "222,397 Lemmy/kbin accounts  —  +23,441 in the last hour  —  71,331 monthly active users",
    "@nexusofprivacy@mastodon.social",
    "Eight days later: Kbin, Lemmy, the landed gentry, and the rise of “threadiverse”",
    "Cyber heists in digital playground, school-age hackers steal millions in NFTs",
    "School Kids Reportedly Phishing Millions in NFTs for Roblox Skins",
    "Damn kids. https://twitter.com/...",
    "guess the real play isn't buying NFTs, it's buying Roblox skins https://www.theblock.co/...",
    "School kids are stealing millions of dollars to buy Robloxx skins",
    "School kids are stealing millions of dollars of NFTs — to buy Roblox skins",
    "Opaque Algorithm Changes by Facebook Leave Publishers in the Dark #1675",
    "Website Owners Say Traffic Is Plunging After Facebook Algorithm Change",
    "Facebook rocks publishers' worlds again. https://gizmodo.com/...",
    "Website Owners Say Traffic Is Plummeting After a Facebook Algorithm Change",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ claim",
    "Elon Musk's ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter - What's Going On?",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ allegations",
    "Elon Musk Accuses AI Twitter Account ‘Explain This Bob’ As Meme Coin Scam",
    "Twitter AI Bot Gets Suspended after Elon Musk Accuses It of Being ‘Scam Crypto Account’",
    "@ExplainThisBob This sure looks like a scam crypto account. If so, it will be suspended.",
    "this is an extremely funny series of events [image]",
    "Free Figma template of onboarding & activation designs",
    "iPhone Maker Foxconn Plans To Launch Electric Car Factory In India!",
    "Foxconn to establish EV manufacturing line in India",
    "Snapchat My AI Vs. ChatGPT: Which AI Chatbot Is Best?",
    "He Went After Crypto Companies.  Then Someone Came After Him.",
    "Trial Lawyer Went After Crypto Companies.  Then Someone Went After Him.",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Make panel interviews worth the hassle",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Alibaba's Taobao & Tmall Attracts Record Number of Merchants During 6.18 Shopping Festival",
    "Consumption soft even amid deep discounts during major China shopping festival, analysts say",
    "Slower Growth During China's 618 Shopping Festival Signals Lagging Consumer Confidence",
    "JD.com sales during China shopping festival beat expectations",
    "JD.com's 2023 618 Grand Promotion: Surpassing Expectations and Setting New Records",
    "Bargain hunting drives up retailers' sales as 618 shopping gala ends",
    "Taobao, JD.Com, and Pinduoduo Hail Success of ‘618’ E-Commerce Festival",
    "China's online shopping bonanza loses sheen as consumption sags",
    "China's 6.18 shopping fest sets record on Alibaba platforms",
    "Brussels Playbook: It's raining cash — Paris defense meeting — Ukraine accession",
    "Intel spends $48 billion in Germany in landmark expansion",
    "Intel to build two chip fabs in Germany as part of expanded €30B+ investment",
    "Intel, German Government Agree on Increased Scope for Wafer Fabrication Site in Magdeburg",
    "‘Silicon Junction:’ Intel picks Germany for $33B chip project",
    "Intel confirms deal for $33 billion German factories",
    "Germany, Intel Agree Chip Plant Subsidies Worth €10 Billion",
    "@sarahemclaugh.bsky.social",
    "SpaceX launches SATRIA-1 communications satellite for Indonesia, lands rocket at sea (video)",
    "SpaceX launches powerful Indonesian communications satellite",
    "SpaceX launch a communication satellite to provide internet to rural parts of Indonesia",
    "Indonesia launches country's largest telco satellite with SpaceX",
    "Indonesia, SpaceX launch satellite to boost internet connectivity",
    "Indonesia, SpaceX Launch Satellite To Boost Internet Connectivity",
    "Why Pixar's new movie Elemental is bombing at the box office, despite solid reviews",
    "Is Elemental streaming on Disney+?",
    "Pixar's Elemental is the new Cars",
    "‘The Flash,’ Pixar's ‘Elemental’ Disappoint in Muted Box Office",
    "Elemental has single worst box office opening weekend in Pixar history",
    "Duolingo describes its marketing strategy as “unhinged.” And it's working. https://www.wsj.com/...",
    "@jeffjarvis@mastodon.social",
    "The future of design is at the hands of Adobe Photoshop AI's generative fill",
    "Health tech company ObservSMART partners with addiction-focused provider",
    "The Hill's Morning Report — Shutdown talk to dominate the summer",
    "Microsoft confirms Azure, Outlook outages caused by DDoS attacks",
    "Recent Teams, Office outages were caused by cyberattacks: Microsoft",
    "Microsoft Security Response Center",
    "Microsoft Response to Layer 7 Distributed Denial of Service (DDoS) Attacks",
    "Microsoft says early June service outages were cyberattacks",
    "Microsoft June Outage: DDoS Attack Took Down Outlook, OneDrive Earlier—Possibly Pro-Russian Ties",
    "Microsoft Blames Massive DDoS Attack for Azure, Outlook, and OneDrive Disruptions",
    "Microsoft Confirms Recent Cloud Outages Caused By Storm-1359 DDoS Attacks",
    "Expensive Proxies Underpin ‘Anonymous Sudan’ DDoS Attacks",
    "Hacktivist group Anonymous Sudan a 'bear in wolf's clothing'",
    "Microsoft confirms recent service disruptions were caused by Russian hacking group",
    "Microsoft Confirms DDoS Attack Caused June Outage on Teams, Office, and Other Services",
    "Microsoft blames DDoS attack for Office 365 disruptions earlier this month",
    "Outlook, OneDrive outages caused by DDoS attack, Microsoft says",
    "Recent Microsoft Outages Were Caused by Multiple Cyberattacks",
    "Microsoft admits early June DDoS attacks impacted its cloud services (and maybe yours, as well)",
    "Microsoft Discloses DDoS Attack Impact with Limited Details",
    "Microsoft Says Cyberattacks Caused Early June Cloud Service Outages",
    "Microsoft confirms it was attacked, causing an outage that may have affected millions",
    "Microsoft Says DDoS Attack Caused Outlook, OneDrive Service Disruption",
    "Early June Microsoft outages were result of large-scale DDoS hit",
    "Microsoft says June Azure, Outlook outages were caused by DDoS attack",
    "Microsoft confirms DDoS attack caused Azure, Outlook outages",
    "Microsoft quietly admits DDoS cyberattacks took down Office 365 and Outlook",
    "Microsoft Azure and Outlook outages were caused by DDoS attacks",
    "Microsoft says June Outlook outages were a DDoS attack",
    "Microsoft confirms recent service outages were DDoS attacks",
    "Microsoft discloses detailed analysis of Layer 7 DDoS attacks",
    "With dead-time dump, Microsoft revealed DDoS as cause of recent cloud outages",
    "Microsoft: June Outlook and cloud platform outages were caused by DDoS",
    "Microsoft confirms June Outlook and OneDrive outages were caused by DDoS attacks",
    "Microsoft says the early June outage to its services was due to a DDoS cyberattack",
    "DDoS Attacks Culprit of Recent Azure, Microsoft 365 Outages",
    "People dismiss dos... most orgs aren't protected against them https://twitter.com/...",
    "The recommendations section is odd when this impacted the provider https://msrc.microsoft.com/...",
    "Microsoft Says Early June Disruptions To Outlook, Cloud Platform, Were Cyberattacks"
]