[
    "Bethesda Softworks on YouTube",
    "Starfield Direct - Gameplay Deep Dive",
    "Xbox's Bright Future, and How We'll Get There",
    "Everything you need to know about Starfield - the most anticipated game of the year",
    "The biggest announcements from the Xbox Games Showcase 2023 and Starfield Direct",
    "Watch 45 minutes of new Starfield gameplay",
    "Giant Bomb at Nite: Night 3",
    "Starfield's Planets Will Be Different for Everyone",
    "Bethesda's “Starfield Direct” shows off a massive, galactic-scale space RPG",
    "Microsoft announces black Xbox Series S with 1TB of storage for $349",
    "Microsoft Introduces New Carbon Black Xbox Series S - 1TB",
    "Phil Spencer Says Console Is ‘Critical’ to Future of Xbox",
    "Microsoft launches new Xbox and brings PC Game Pass titles to NVIDIA GeForce NOW",
    "Game Pass Is Coming to GeForce NOW, Albeit with Select Games",
    "Microsoft is bringing Xbox Game Pass to Nvidia GeForce Now",
    "NVIDIA GeForce Now streaming service will soon add “select” PC Game Pass titles",
    "Xbox's PC Game Pass is coming to GeForce Now with ‘select’ games",
    "PC Game Pass Ultimate titles coming to NVIDIA GeForce Now devices",
    "‘Select’ PC Game Pass games coming to Nvidia's GeForce Now streaming",
    "Certain PC Game Pass Games Will Soon be Playable on GeForce Now",
    "PC Game Pass will leverage GeForce Now in the coming months",
    "Microsoft PC Game Pass is coming to NVIDIA GeForce NOW later this year",
    "Game Pass is coming to NVIDIA GeForce Now",
    "Xbox's Bright Future, and How We'll Get There - Xbox Wire",
    "@codinghorror@infosec.exchange",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Apple Subreddit Goes Dark in Protest of Reddit's API Pricing Changes",
    "All the Apple subreddits set to go dark in protest of Reddit's API charges",
    "Reddit Blackout Begins as Forums Protest Charges for Developers",
    "Reddit crypto community goes offline: Here's why",
    "Reddit not working today? It's a protest, and here's what you need to know",
    "Overwatch, CS:GO among thousands of Reddit communities going dark in protest of platform changes",
    "Reddit moderators go on strike to protest against changes in the platform's data API policy",
    "Major Windows-themed subreddits will be going dark Monday to protest Reddit's API prices",
    "iPhone subreddit starting protest early, going dark indefinitely",
    "Reddit's CEO's AMA turns into disaster",
    "@viticci@mastodon.macstories.net",
    "@mainframed767@infosec.exchange",
    "Reddit is shutting down [image]",
    "The r/Monero subreddit has gone dark in protest of Reddit's latest policy changes.",
    "livewatching the death of reddit. r/gaming has fallen. [image]",
    "The Reddit strike has begun, and there's a great site to track it. https://reddark.untone.uk/",
    "Statut des sous-reddit virés privés",
    "Reddit's users and moderators are revolting against its CEO",
    "Is r/MadisonWI joining the Reddit strike?",
    "Reddit's users and moderators are pissed at its CEO",
    "/r/gaming will go dark on June 12th in protest of reddit's API changes",
    "r/pics will go dark on June 12th in protest of Reddit's API changes that will kill 3rd party apps",
    "Andreessen Horowitz Picks Crypto-Friendly London as International Base",
    "Gensyn AI Secures $43M for Decentralized Machine Learning Led by a16z",
    "A16z crypto opens first overseas office in UK",
    "Sunak praises a16z's UK expansion, Winklevoss twins warn ‘war on crypto’ hurts Democrats",
    "Andreessen Horowitz to open first international office in London",
    "Blockchain-based marketplace for compute power Gensyn raises $43 million",
    "Andreessen Horowitz announces first international expansion—a U.K. crypto outpost",
    "Andreessen Horowitz sees UK as future home of crypto",
    "Andreessen Horowitz to open London crypto office in first push overseas",
    "Andreessen Horowitz (\"a16z\") Announces its First International Expansion to the United Kingdom",
    "Breaking: UK PM Rishi Sunak Welcomes a16z Crypto First Expansion Amid US Woes",
    "a16z opening London crypto office citing ‘predictable’ environment",
    "Blockchain-Based, AI Compute Protocol Gensyn Closes $43M Series A Funding Round Led by a16z",
    "Sunak Keeps Up Push To Make UK a Leader in AI Regulation",
    "US VC firm Andreessen Horowitz to open its first international office in London",
    "it's called u16k now actually https://twitter.com/...",
    "BRITISH DYNAMISM https://twitter.com/... [image]",
    "UK is having its “How can I help” Miami moment for crypto.... https://twitter.com/...",
    "Are US politicians paying attention? https://twitter.com/...",
    "This is a win for the UK. Congrats to @a16z and the UK Crypto community. https://twitter.com/...",
    "We're all in this together, I suppose. https://www.nytimes.com/...",
    "The A.I. Revolution Will Change Work.  Nobody Agrees How.",
    "Audiocraft  —  Audiocraft is a library for audio processing and generation with deep learning.",
    "MusicGen Demo  —  MusicGen This is the demo for MusicGen, a simple and controllable model …",
    "Simple and Controllable Music Generation",
    "making foley percussion loops with musicgen [video]",
    "@_akhaliq That is by far some of the cleanest AI generated music I have ever seen (and heard😅)",
    "This new MusicGen model from Meta is seriously impressive! https://twitter.com/... [image]",
    "MusicGen can be conditioned on a chromagram. https://twitter.com/...",
    "Meta's MusicGen is insanely good - this is the StableDiffusion moment for music: [video]",
    "Take On Me - AI Cover #MusicGen [video]",
    "oh this is fun! https://twitter.com/...",
    "Having lot's of fun with this, especially the melody conditioning feature. https://twitter.com/...",
    "MusicGen: Simple and controllable music generation",
    "Meta just released MusicGen",
    "Rejoice: It's 2023 and you can still buy a 22-volume paper encyclopedia",
    "International Business Times",
    "Twitter Isn't Paying its Google Cloud Bill",
    "Twitter reportedly refusing to pay Google Cloud bills",
    "Twitter has reportedly refused to pay its Google Cloud contract",
    "Twitter is refusing to pay its Google Cloud bills- Platformer",
    "Twitter blatantly refuses to pay its Google Cloud bills",
    "Twitter refuses to pay its Google Cloud bills, puts Trust and Safety services at risk",
    "Twitter says won't pay Google for its cloud services, trust and safety teams at risk",
    "Twitter Refuses To Pay Google Cloud Bill; Trust And Safety Services At Risk [Details]",
    "Elon Musk still hasn't paid Twitter's Google Cloud bill.",
    "Awwwe they can repurpose Elon's old laptop and host it there https://twitter.com/...",
    "Good thing enterprise migrations between cloud providers is trivial... https://twitter.com/...",
    "Pepperidge farm remembers https://blog.twitter.com/... https://twitter.com/...",
    "Google is pretty good at shutting down its own products, but... https://twitter.com/...",
    "You good, @lindayacc? https://twitter.com/...",
    "Elon be stiffin' https://twitter.com/...",
    "Twitter is refusing to pay its Google Cloud bills, Platformer reports",
    "HK Court Plans Hearing on Interim Ban of Protest Song in July",
    "Ex-Samsung Elec executive indicted over alleged data theft for China factory",
    "Samsung Chip Division Back in Action: Approves First Investment in Half a Year",
    "BREAKING: Ex-Samsung employee charged for leaking chip technology to China",
    "Samsung's chip division to introduce custom AI Services for employees",
    "How AI art killed an indie book cover contest",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "(IHP) Microsoft CTO Kevin Scott",
    "Jun 8-12VIRTUAL: Summer Game Fest",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "HSBC Innovation Banking launches at London Tech Week",
    "HSBC UK CEO Ian Stuart: ‘Challenger banks have given us a massive wake-up call’",
    "Silicon Valley Bank UK set for London Tech Week charm offensive",
    "Hundreds Hear ChatGPT Sermon, Sometimes Snickering",
    "AI-Powered Chatbot ChatGPT Meets Spirituality: A Revolutionary Leap in Church Sermons",
    "Lutheran church in Germany has AI deliver sermon",
    "300 People Attend a Church Sermon Generated by ChatGPT",
    "@BenPatrickWill@mastodon …",
    "Kids keep bringing guns to school. Can AI weapons detectors help?",
    "Korean Public Schools to Use AI in Teaching",
    "@BenPatrickWill@mastodon.social",
    "Verizon DBIR: Social Engineering Breaches Double, Leading to Spiraling Ransomware Costs",
    "2023 Data Breach Investigations Report (DBIR)",
    "2023 DBIR Executive Summary",
    "Seven key insights from the 2023 Verizon Data Breach Investigations Report",
    "DBIR Report 2023 - Master's Guide",
    "Verizon 2023 DBIR: Human Error Involved in Many Breaches, Ransomware Cost Surges",
    "DOS Attacks Dominate, but System Intrusions Cause Most Pain",
    "Verizon 2023 DBIR: Credential Leaks Continue To Be A Major Issue",
    "Report Details Three Top Cyber Threats for Public Sector",
    "Verizon DBIR: Ransomware accounts for one in four data breaches",
    "Verizon 2023 Data Breach Investigations Report: 74% of breaches involve human element",
    "The Vision Pro's biggest advantage isn't Apple's hardware",
    "Germany Refuses to Increase Subsidies for Intel's Fab",
    "Germany Turns Down Intel's Request for More Fab Fund Subsidies",
    "Germany refusing Intel's additional demand for subsidies for chip plant: report",
    "A new tool can tell if your paper was written by AI",
    "AI detecting AI.....I sense a never ending loop here... https://twitter.com/...",
    "Was the science paper written by a scientist or a LLM? https://www.cell.com/... [image]",
    "ChatGPT's Humor Barely Extends Beyond The Same 25 Jokes, Researchers Find",
    "Here are the 25 jokes that ChatGPT tells over and over again",
    "Standup Isn't ChatGPT's Strength",
    "ChatGPT's Humor Isn't Quite Human Yet, Study Finds",
    "ChatGPT can only tell 25 jokes, and can't come up with new ones, researchers find",
    "So it's just like your dad then. https://arstechnica.com/...",
    "Researchers discover that ChatGPT prefers repeating 25 jokes over and over",
    "Sberbank, Russia's Biggest Lender, To Offer Crypto Asset Trading This Month",
    "Credit Suisse CEO teases UBS deal finalization",
    "New Crypto Banking System Coming Amidst Coinbase and Binance Crackdown",
    "Nigeria regulator says local Binance operations ‘illegal’",
    "The Securities and Exchange Commission, Nigeria",
    "Circular on the Activities of Binance Nigeria Limited",
    "Nigeria's SEC Says Binance Operations in Country Are ‘Illegal’",
    "Binance Faces Regulatory Hurdle in Nigeria: Ordered to Cease Operations",
    "Nigerian Regulator: Binance Operations in Country Are Illegal",
    "Nigerian Regulator Labels Binance Affiliate's Local Operations Illegal",
    "Binance Hit With Suspension Notice In Nigeria By Market Regulator",
    "Binance ordered out of Nigeria",
    "Nigeria SEC declares Binance operations in country illegal",
    "Nigeria's SEC orders Binance Nigeria Limited to stop operations",
    "Nigeria's SEC declares Binance Nigeria's operations illegal",
    "Nigeria regulator says Binance not registered and must stop soliciting investors: Reuters",
    "These guys are really running out of road, eh? https://www.bloomberg.com/...",
    "Binance getting pressure from other jurisdictions now. https://twitter.com/...",
    "Does anyone remember Pink Care Token? https://twitter.com/...",
    "This is terrible news for scammers. https://twitter.com/...",
    "The crypto pivot to Africa just took a hit https://twitter.com/... [image]",
    "Binance Declared Illegal By Nigeria SEC"
]