[
    "The Official Microsoft Blog",
    "Microsoft Developer on YouTube",
    "@thekenyeung@mastodon.social",
    "Bing at Microsoft Build 2023: Continuing the Transformation of Search",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Here are the biggest announcements coming out of Microsoft Build 2023",
    "Empowering every developer with plugins for Microsoft 365 Copilot",
    "Windows Copilot: Your new AI assistant for Windows 11",
    "Microsoft integrates AI front & centre into Windows 11 with Windows Copilot",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "New Windows 11 File Explorer design gets teased by Microsoft during Build 2023",
    "A livestream of the Microsoft Build 2023 keynote",
    "Hallelujah! Windows 11 is finally introducing RGB lighting standards",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft Build 2023: What businesses need to know",
    "Microsoft Build 2023: Copilots & Plugins",
    "Microsoft wants you to think inside the Dev Box from July",
    "Microsoft CTO tells devs to ‘do legendary sh*t’ with AI at 2023 Build conference",
    "Microsoft Build 2023: Microsoft Fabric and oodles of Azure AI integrations announced",
    "For Microsoft, AI belongs everywhere",
    "Microsoft flaunts redesigned and modern File Explorer in Windows 11",
    "Microsoft Build 2023: Every major AI and Bing Chat announcement",
    "OpenAI's Brockman: Industry use cases, developers next stage for generative AI, ChatGPT",
    "Bing Integrates With ChatGPT",
    "Microsoft Build 2023: CEO Satya Nadella's Boldest Statements",
    "Microsoft & OpenAI to create a new ecology of chat robot plugins",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft launches generative AI tools for developers",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "The man who put Microsoft in the AI lead",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Microsoft confirms 365 Copilot AI will be ‘natively integrated’ into Edge",
    "Bing Search is coming to ChatGPT",
    "With Windows Copilot, every Windows user can be a power user. https://blogs.windows.com/...",
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix Launches Paid Sharing in U.S., Will Start Blocking Users With Unauthorized Passwords",
    "Netflix beginning revamp on password-sharing in U.S.",
    "Netflix's password crackdown has started in the U.S.",
    "Netflix cracks down password-sharing in Malaysia: extra user slot costs RM13 per month",
    "Netflix Password Sharing Crackdown Begins in the U.S.",
    "The Netflix password sharing crackdown is here. Check your inbox.",
    "Netflix's Password-Sharing Crackdown Finally Hits The US, Here's What It Means",
    "Netflix's password shakedown begins now, $8 per user",
    "Silicon Valley Business Journal",
    "Netflix has begun crackiung down on password sharing in the U.S.",
    "Want to share your Netflix account? That'll be an extra $8",
    "It's time: Netflix's account sharing fee is now live in the US for $7.99 a month per user",
    "Netflix Tells US Members Accounts Are for One Household",
    "Netflix's controversial password-sharing crackdown hits the US",
    "Netflix Password Sharing Crackdown Rolls Out in the U.S.",
    "Netflix's password-sharing crackdown is here: How much it'll cost you now",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix paid password sharing hits the U.S., but Americans shouldn't be too worried",
    "Netflix U.S. Password Sharing Crackdown Begins, Joining Canada",
    "If you said you'd cancel Netflix before paying for account sharing, time is up",
    "The Netflix crackdown on password sharing in the US has arrived",
    "Sharing a Netflix password will now cost $7.99 a month per additional user",
    "Netflix Starts to Roll Out its Password Sharing Crackdown In The United States",
    "Netflix Starts Cracking Down On Password Sharing In The US",
    "Pay up!  Netflix begins account sharing crackdown in the U.S.",
    "Adding Extra Members to Your Netflix Account Costs $8 a Pop",
    "Netflix's password sharing clampdown reaches the UK",
    "Netflix starts charging for account sharing in the US",
    "Netflix Bill Comes Due As Streaming Giant Begins Clampdown On Password Sharing In U.S.",
    "Breaking: Netflix Announces Official Password-Sharing Policy, Notifies U.S. Customers of New Rules",
    "@campuscodi@mastodon.social",
    "DeSantis Set to Announce 2024 Run on Twitter With Elon Musk",
    "Elon Musk wants ‘someone fairly normal’ to be elected president in 2024",
    "Musk scores Daily Wire's full set of podcasts to put on Twitter",
    "Musk's Twitter tries to recapture the political spotlight post Trump with DeSantis 2024 run",
    "With DeSantis campaign event, Musk seeks to shore up a sinking Twitter",
    "Explainer: What is Twitter Spaces where DeSantis will announce his presidential run?",
    "Ron DeSantis to Join Elon Musk on Twitter Wednesday to Announce 2024 Run",
    "DeSantis sees a path to the White House — 240 characters at a time",
    "Is Elon Musk's Twitter about to supplant Fox News?",
    "Ron DeSantis to announce presidential run on Elon Musk's Twitter",
    "DeSantis to announce 2024 bid on Twitter Spaces meeting with Elon Musk",
    "Elon Musk Is Going to Try to Make Ron DeSantis Cool",
    "Elon Musk will launch Ron DeSantis' presidential campaign on Twitter Spaces",
    "DeSantis to Announce 2024 Presidential Run in Interview with Elon Musk",
    "Ron DeSantis to announce presidential bid in Twitter Space with Elon Musk",
    "@lauren@mastodon.laurenweinstein.org",
    "Well this ‘analysis’ from the Times aged wonderfully... https://twitter.com/... [image]",
    "Musk hasn't even endorsed DeSantis and praised one of his opponents last week lmao [image]",
    "Unsafe levels of dork energy in one place https://twitter.com/...",
    "So much free speech, it's blinding. https://twitter.com/...",
    "Wonder if this is going to be the thing that makes Trump start tweeting again?",
    "Elon Musk: Twitter must be politically neutral also Elon Musk: [image]",
    "This is a real slap in Fox's face https://www.semafor.com/... [image]",
    "Worth noting Sacks is belligerently isolationist on Ukraine https://twitter.com/...",
    "That's one way to make your candidate seem human! https://www.nytimes.com/...",
    "The guy DeSantis is launching his campaign with hasn't even endorsed him lmao [image]",
    "Ron DeSantis to Launch 2024 Presidential Run in Twitter Talk With Elon Musk",
    "Introducing a new era of AI-powered ads with Google",
    "Google Will Soon Show You AI-Generated Ads",
    "Google to test ads in generative AI search results",
    "Who Said What at Google's Advertising Exhibition",
    "Inside Google's plans for improving paid search with generative AI",
    "Here's how ads might look in Google's new AI-powered search experience",
    "Google debuts new generative AI advertising tools",
    "Google details plans for AI-generated ads in Search",
    "@chrismessina@mastodon.xyz",
    "New tools to help small businesses connect with online shoppers",
    "Google Product Studio brings AI-generated images to advertisers",
    "Google Introduces Chatbot, Other Generative AI Creation Tools for Marketers",
    "Google Marketing Live 2023: What you need to know",
    "What ads will look like in Google's Search Generative Experience [Gallery]",
    "Google Product Studio Lets Merchants Create Product Imagery With Generative AI",
    "Google Search Generative Experience integrates Search, Shopping ads",
    "Yes, Google's AI-infused search engine will have ads",
    "The problem with the search engine business is that the money's in the searching, not the finding.",
    "Welcoming AI to the Microsoft Store on Windows",
    "Microsoft puts a spotlight on AI in its Windows app store",
    "Microsoft Store gets AI-generated review summaries, keywords and a dedicated AI Hub",
    "Microsoft Store hones in on AI in Windows with new section and AI-generated reviews",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft pledges to watermark AI-generated images and videos",
    "Microsoft Designer and Bing Image Creator will soon tag images and videos with metadata info",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "Microsoft integrates Bing Search with ChatGPT, launches common plugins platform",
    "ChatGPT Will Use Bing to Answer Questions",
    "Microsoft to add Bing search to OpenAIs ChatGPT in battle with Google",
    "Microsoft Bing search is being added to ChatGPT; new Bing Chat plugin partners revealed",
    "Microsoft to Integrate Bing Search into OpenAI's ChatGPT",
    "Google Bard AI Can Now Retrieve Images, And That's Just The Start",
    "ChatGPT is about to integrate Bing and leave Google in the dust",
    "OpenAI makes Microsoft Bing the default search in ChatGPT",
    "Kane and Pia Muehlenbeck on YouTube",
    "Final Cut Pro and Logic Pro for iPad are here",
    "First Impressions: Final Cut Pro for iPad",
    "Final Cut Pro and Logic Pro are finally available on your iPad - here's how to get them",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro on iPad Feels Like a Great and Optional Upgrade",
    "Final Cut Pro iPad hands-on - one of Apple's best multi-touch apps on iPad",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut Pro For iPad 1st Review: Smooth, Fast And Affordable",
    "Final Cut Pro for iPad Reviews: Worth the Wait, But Some Limitations",
    "Final Cut Pro for iPad is finally here - and its secret weapon is the Apple Pencil",
    "Final Cut Pro on iPad is a game changer for content creators — here's why",
    "Apple Updates Final Cut Pro and Logic Pro for Mac to Support New iPad Apps",
    "2023 Apple Design Awards finalists announced",
    "Apple has officially released Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad now available on the App Store",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "Apple Final Cut for iPad Review: Lots Here, But Some Things Still Missing",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro on iPad is AMAZING - Hands on Review!",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "FINAL CUT PRO FOR IPAD - First impressions for travel vlogging",
    "Final Cut Pro on iPad: Effortless Editing",
    "Oh nooo, my beloved Markers are not in FCP for iPad 🥲",
    "@johnvoorhees@mastodon.macstories.net",
    "Final Cut Pro on iPad is working properly now and is glorious. [image]",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Hands-On With Apple's Logic Pro for iPad",
    "Hands On With Apple's Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Final Cut Pro and Logic Pro for macOS updated with new features and support for iPad apps",
    "No subscriptions in Final Cut Pro and Logic Pro for Mac following iPad versions.  Yet...",
    "Apple updates Final Cut Pro, Logic Pro, Motion, Compressor for Mac with support for iPad apps",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "Chip war: Apple strikes major US-made semiconductor deal",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple Teamed Up with Broadcom for 5G Components",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple and Broadcom sign multi-year deal to develop made-in-USA chips",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple Strikes Multibillion-Dollar Deal to Use U.S.-Made Chips",
    "Apple secures supply of 5G components as it signs new multibillion-dollar deal with Broadcom",
    "FirstFT: Multibillion-dollar chip deal",
    "Apple Extends Broadcom Pact With Multibillion-Dollar 5G Deal",
    "Apple enters multibillion-dollar mobile chip deal with Broadcom",
    "Apple Partners with Broadcom to Develop USA-Made 5G Components",
    "Apple Partners with Broadcom in a Multibillion-Dollar Deal to Reduce Dependence on China",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple Strikes Multibillion-Dollar Supply Deal With Broadcom",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Apple inks multi-billion-dollar deal with Broadcom for US-made chips",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Chinese Businesses Fueling the Fentanyl Epidemic Receive Tens of Millions in Crypto Payments",
    "Chinese companies selling synthetic opioid chemicals raked in $27M in crypto payments",
    "@ravirockks@infosec.exchange",
    "Google Mobile Vulnerability Reward Program Rules",
    "Google Launches Bug Bounty Program for Mobile Applications",
    "Google announced its Mobile VRP (vulnerability rewards program)",
    "Google Unveils Bug Bounty Program For Android Apps",
    "Google wants to pay you for finding security flaws in its biggest Android apps",
    "Find Android bugs, earn up to $30k",
    "Android should become a more secure platform thanks to new bug bounty program for Google apps",
    "Microsoft wants to help you build a website with Copilot AI",
    "Microsoft beats Google by integrating an AI assistant straight into its OS",
    "Windows 11 to get a new AI assistant - Copilot",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Safety. https://twitter.com/...",
    "Spotify may use AI to make host-read podcast ads that sound like real people",
    "AI Voices Could Soon be Reading Ads on Spotify Podcasts",
    "Binance Denies Commingling ‘Billions’ in Customer Funds",
    "Former Binance Insiders Claim Exchange Commingled User Funds and Revenue: Report",
    "Binance Refutes Reuters' Claims of Commingling: “Story is so weak”",
    "Binance Blasts Reuters Report It Mixed Customer/ Company Funds",
    "Inside Binance Scandal: Former Insiders Claim Customer Funds Were “Mishandled”",
    "Crypto Giant Binance Commingled Customer Funds and Revenue: Report",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "Adobe Photoshop (beta) x Adobe Firefly: Announcing Generative Fill",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Adobe Integrates Firefly Directly Into Photoshop, Brings Generative AI to Creative Cloud",
    "Adobe Unleashes Generative AI in Photoshop Beta",
    "Adobe introduces generative AI in Photoshop to transform professional creativity",
    "Adobe Photoshop's new “Generative Fill” AI tool lets you manipulate photos with text",
    "Adobe is adding an AI-powered image generator to Photoshop",
    "Adobe Photoshop's AI art tools are now available for you to try",
    "Adobe introduces ‘generative fill’ to Photoshop with its Firefly AI tool",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use,",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Introducing Microsoft Fabric: Data analytics for the era of AI",
    "Microsoft announces unified analytics platform Fabric",
    "At Build 2023, Microsoft unveils new Fabric OneLake Shortcuts for ADLS, AWS, Google Storage",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "Free compensation benchmarking data from 3,000 startups",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Shutterstock to Acquire GIPHY, the World's Largest GIF Library and Search Engine",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta has no choice but to sell Giphy at $262M loss to Shutterstock",
    "Meta forced to sell Giphy, takes 87% loss in Shutterstock deal",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "Meta unloads Giphy in the fire sale of the year",
    "Meta Sells Giphy To Shutterstock For $53M Following Antitrust Lawsuit",
    "From $400M to $53M: Shutterstock Acquires Giphy from Meta at Fraction of Price",
    "Meta selling Giphy for fraction of purchase price",
    "Shutterstock to buy GIPHY after CMA forced Meta to sell it",
    "Shutterstock Acquires Giphy from Meta in $53 Million Deal",
    "Shutterstock buys Giphy app from Meta for $53M",
    "Meta sells Giphy for $53M to Shutterstock after UK blocked GIF platform purchase",
    "Giphy/Meta: the cost of doing business overseas keeps rising",
    "Meta sells Giphy to Shutterstock at huge loss following antitrust ruling",
    "How Meta's Acquisition of Giphy Went South",
    "Feels like a steal https://www.reuters.com/...",
    "Facebook tracking pixels to be smaller, much less funny. https://twitter.com/...",
    "Center for Democracy and Technology",
    "Lost in Translation: Large Language Models in Non-English Content Analysis",
    "Samsung unveils a 12.4-inch rollable OLED panel",
    "Samsung shows off several exciting displays including one that expands more than 5 times",
    "Samsung Display makes screen that can recognize several fingers",
    "Samsung's new OLED display tech has a built-in blood pressure sensor",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sony claims PS VR2 sales are ahead of projections and is outselling original headset",
    "Sony Confirms PSVR 2 Sold 600k Units Up To April, Outpacing Original PSVR Launch",
    "Sony Prepares ‘Aggressive’ Cloud Gaming Push in Coming Months",
    "PlayStation is betting big on new franchises and live service games",
    "PSVR2 Sales at 600,000 Six Weeks After Launch, Sony Confirms",
    "Ahoy, matey! Windows 11 will soon have native RAR support",
    "Microsoft uses open source to kill WinRAR by adding native .rar support to Windows 11",
    "Windows 11 finally gets native RAR support",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "AI Now Has a Key to Spotify's Songwriting Fortress",
    "Universal Music Group partners with Endel for AI-generated wellness soundscapes",
    "Flipboard is ready to work with Bluesky and Pixelfed",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton the rebrand: High end exercise bike maker says it's now a health company for all",
    "Peloton Works to Stay Relevant With Massive Rebrand",
    "Peloton relaunches its workout app with new free and pricier subscription tiers",
    "Peloton App Gets a Free Tier",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "BuzzFeed's Chatbot Mistake, Bing's Big Goal",
    "Pixar meets The Last of Us movie about botulism toxin controlling a chef https://twitter.com/...",
    "A little too botulism evoking for me https://twitter.com/...",
    "Waymo's self-driving cars will be available on Uber's app, starting in Phoenix",
    "Uber taps into self-driving tech of former rival Waymo",
    "Waymo and Uber Partner to Bring Waymo's Autonomous Driving Technology to the Uber Platform",
    "Waymo Partners With Rival Uber In Phoenix For Rides And Food",
    "Uber teams up with Google's Waymo on self-driving cars",
    "Waymo's robotaxis are coming to Uber's ridesharing app",
    "Uber to offer autonomous ride-hailing and delivery using Waymo's robotaxis",
    "Uber will now let you book a Waymo self-driving car through its app",
    "Uber and Waymo sign partnership to enhance access to autonomous vehicles",
    "Robotaxis Are Coming to Phoenix, and You Can Ride Them on Uber",
    "Despite Bruising Court Battle, Uber to Offer Self-Driving Rides From Rival Waymo",
    "Waymo robotaxis to be available through Uber",
    "Uber adds Waymo's self-driving cars to its rideshare network, but only in one city",
    "Uber and Waymo fought in court over self-driving trucks. Now they're teaming up",
    "So excited to bring Waymo's incredible technology to the @Uber platform 🙌 https://twitter.com/...",
    "A Waymo car stopping to do food delivery seems less than ideal: https://www.theverge.com/...",
    "Uber and Waymo team up to bring autonomous taxis to Phoenix. [ai] https://www.theverge.com/...",
    "headlines i would never imagine a mere six years ago https://blog.waymo.com/... [image]",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "Anthropic Raises $450 Million to Fuel AI Work",
    "Google-backed Anthropic raises $450 million in latest AI funding",
    "Caroline Ellison's ‘diary’ a key piece of evidence in Sam Bankman-Fried's FTX fraud case: report",
    "The 6 best features of Amazon's new Fire Max 11, our biggest and most powerful tablet yet",
    "Amazon launches its biggest tablet, the $230 Fire Max 11",
    "Fire Max 11 is Amazon's largest and most powerful tablet yet",
    "Introducing the All-New Fire Max 11: Amazon's Biggest and Most Powerful Tablet Yet",
    "The Fire Max 11 Is Amazon's Largest Tablet Yet (and the First With Fingerprint Recognition)",
    "Good luck getting work done on Android 9 ! https://twitter.com/...",
    "reminder: the 11-inch Fire Max 11 is now Max https://twitter.com/...",
    "Department of Health & Human Services",
    "@caseynewton@mastodon.social",
    "Social Media and Youth Mental Health",
    "The surgeon general's warning is a wake-up call for social networks",
    "US Surgeon General warns social media is driving a mental health crisis in the young",
    "Surgeon General Issues New Advisory About Effects Social Media Use Has on Youth Mental Health",
    "US Surgeon General says social media may be hazardous to teen health",
    "Social media could have a ‘profound risk’ on kids and teens, US surgeon general warns",
    "Social Media and Youth Mental Health: The U.S. Surgeon General's Advisory (Executive Summary)",
    "Surgeon general: Social media presents ‘profound risk’ for kids",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Surgeon general issues advisory about social media risks for kids",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Social media could harm youth mental health, U.S. Surgeon General warns",
    "The US surgeon general thinks social media poses a “profound risk” to teenagers' mental health",
    "Social media can put young people in danger, U.S. surgeon general warns",
    "Social Media a ‘Profound Risk’ to Kids, Warns U.S. Surgeon General",
    "‘Profound risk of harm’: Surgeon General issues warning about youth social media use",
    "A guide to teens, smartphones and social media settings",
    "‘Take action and protect our kids’: U.S. Surgeon General warns of social media risks",
    "US Surgeon General says social media can pose ‘a profound risk’ to teens' mental health",
    "Social media may harm kids.  US Surgeon General says so",
    "Surgeon general issues urgent warning about kids and social media",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "How to unblock Max for free from anywhere in the world",
    "WB's rebranded Max app launch has some issues on Apple TV",
    "Max makes its U.S. debut, giving subscribers 35K hours of content",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "Peacock Weighs In On HBO Max's Rebranding With R-Rated Name Change Suggestion Of Its Own",
    "‘Max’ Streaming Service Celebrates Launch With Huge Deluge Of 4K Movies And TV Shows",
    "With the Launch of “Max,” Streaming Enters a New Era of Consolidation",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "The slow descent into madness. [image]",
    "how do you fuck up this badly https://twitter.com/...",
    "I keep clicking “Start Streaming” and nothing happens. Great product launch. No notes. [image]",
    "why are all the streaming services blue now [image]",
    "Securities & Futures Commission of Hong Kong",
    "SFC concludes consultation on regulation of virtual asset trading platforms",
    "Hong Kong's SFC starts accepting applications for crypto trading platform licenses on June 1",
    "First Mover Asia: Crypto's Narrative of This Season Is No Narrative at All",
    "Hong Kong Unveils Crypto Rulebook: Will Allow Retail Trading",
    "Hong Kong Expected to Lift Crypto Retail Trading Ban Next Month",
    "Hong Kong to Permit Licensed Crypto Exchanges to Offer Services to Retail Investors",
    "International Watchdog Eyes Crypto's Future as Hong Kong Releases Rulebook",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "European Data Protection Board",
    "How Meta got caught in tensions between the US and EU",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Meta has a $11 billion reason not to leave the EU",
    "TikTok's lead privacy regulator in Europe takes heat from MEPs",
    "Q&A: Is Meta data-transfer fine enough to allay privacy concerns?",
    "The GDPR Fine Against Meta Is Significant But Not For The Reasons You Think",
    "What Would a U.S. Debt Default Mean for the World?",
    "EU Committee Probes TikTok, UK's Updated GDPR",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "DPC fine should be a wake-up call for government",
    "EU hits Meta with record €1.2B privacy fine",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes."
]