[
    "We've reached peak tech bro, with billionaires suggesting cage fights and bench-press contests",
    "Khai Wu, Mark Zuckerberg's MMA Trainer Talks Potential Cage Fight With Elon Musk And More",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Musk Says Cage Match With Zuckerberg ‘Might Actually Happen’",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "@ianbetteridge@writing.exchange",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "@Techmeme This company is a dumpster fire 🔥",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "@lauren@mastodon.laurenweinstein.org",
    "LastPass users locked out (again) with infinite 2FA loop",
    "LastPass users furious after being locked out due to MFA resets",
    "@tananarivedue.bsky.social",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "The iPad was meant to revolutionize accessibility. What happened?",
    "American TikTok user data stored in China, video app admits",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "This is a good read: https://blog.bloonface.com/...",
    "@summeremacs@fashionsocial.host",
    "It didn't fail, it was impossible, the wrong idea. more later... https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "Starfield exclusivity was the last straw for Microsoft, led to $7.5 billion ZeniMax buyout",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Xbox Says That The Console War Is Just A Social Construct",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "FTC vs. Xbox: Sony ‘uses revenue’ from Microsoft's games to block games from coming to Xbox",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Has Xbox lost the console wars?",
    "Free Figma template of onboarding & activation designs",
    "New Technologies and Jobs in Europe",
    "Who could have known?! https://twitter.com/...",
    "The Flex Report (June 2023)",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "Flex Report: Tech Industry Deep Dive",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Effective scheduling is key to workforce optimization",
    "Google: Bring questions. Build answers.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio: Report",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "Amazon to invest $15 billion more in India, says CEO Andy Jassy",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "Amazon to take its India investment to $26 billion by 2030",
    "What Amazon, Google, And Microsoft Announced After PM's ‘Hi-Tech Handshake’",
    "Amazon CEO Andy Jassy says ready to invest $15 billion more in India",
    "Modi in US: Amazon CEO Andy Jassy commits to $15 billion investment in India",
    "Amazon to invest $15b more in India",
    "Amazon Plans To Invest Another $15 Billion in India By 2030",
    "Meta CEO Mark Zuckerberg and OpenAI CEO Sam Altman support EU AI Act",
    "EU welcomes Meta plans for tough content rules",
    "Meta agrees to July ‘stress test’ on new EU content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "EU, Meta agree to July stress test on EU online content rules",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "Google's next gaming play might be mini ‘Playables’ in YouTube",
    "YouTube Playables: Online Games Are Coming to YouTube",
    "Google is reportedly testing a product to play games via YouTube",
    "YouTube is planning to expand into online gaming with ‘Playables’: Report",
    "Online games will appear on YouTube: Google is testing it right now",
    "YouTube could host mobile and desktop video games",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering"
]