[
    "@film_girl@mastodon.social",
    "@noracodes@tenforward.social",
    "@tchambers@indieweb.social",
    "@rodhilton@mastodon.social",
    "@trochee@dair-community.social",
    "This is Instagram's new Twitter competitor",
    "Instagram Readies Twitter Competitor for Summer Release",
    "Look Out Bluesky, Instagram's Twitter Clone Could Launch in June,",
    "Instagram's Twitter-Like App Could Be Released Next Month",
    "Meta's top secret Twitter-killer app is coming soon",
    "Everything we know about Instagram's Twitter clone, due this summer",
    "Meta has been working on a new Twitter competitor, and here's what it looks like",
    "Meta's Instagram is working on a text-based app to rival Twitter",
    "Meta's Twitter Competitor App is Set to be Launched Some Time Next Month",
    "Meta's Twitter rival Instagram app “P92” reportedly coming in June",
    "Meta's rumored Twitter competitor could launch as early as next month",
    "Instagram prepares Twitter competitor for summer release - Bloomberg News",
    "Instagram's text-based app might make Twitter users jump ship",
    "Instagram will soon release a text-based app to take on Twitter",
    "Instagram's New Twitter Competitor Revealed",
    "Instagram's Twitter Clone Leaks: Here are the Features",
    "Leaked Image Shows What Instagram's New Twitter Competitor Looks Like",
    "If this is Instagram's Twitter competitor, I'm ready to jump ship",
    "Instagram to Launch Twitter Competitor with New Text-Based App",
    "Instagram readies Twitter competitor",
    "Satisfied With Its TikTok Clone, Meta Is Working on a Twitter Clone",
    "... are you seriously telling me Facebook is pushing “pivot to text?” https://twitter.com/...",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "curious to see how well this does... https://twitter.com/...",
    "Let's see how this goes. https://www.theverge.com/...",
    "Instagram joins Fediverse? https://twitter.com/...",
    "This is Instagram's new Twitter rival app https://www.theverge.com/...",
    "@mattmday Right??? I think I've joined like 9 new apps in the last 6 months",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]",
    "Sorry Bing, Samsung's sticking with Google as its default mobile search engine",
    "Samsung not planning to replace Google with Bing in phones, Wall Street Journal reports",
    "Samsung decides to keep Google as its default device search engine after all",
    "Samsung puts its move to Bing search on pause for now",
    "Report: Samsung Galaxy phones no longer considering switch from Google to Bing",
    "Are You Loyal to a Smartphone Brand, Like Google or Samsung?",
    "Samsung pauses on plan to replace Google Search with Bing on Galaxy devices",
    "Samsung reportedly won't drop Google as its default search engine — for now",
    "Samsung backs down from its threat to switch its Android phones to Bing",
    "Samsung's plan to replace Google with Bing might be dead",
    "Sorry Bing, Samsung is sticking with Google",
    "Report: Samsung Has Dropped its Plan to Replace Google with Bing on Galaxy Phones",
    "Google Can Stop Panicking, Samsung Phones Aren't Switching to Bing",
    "Samsung sticking with Google Search (for now)",
    "Samsung Reportedly Sticking With Google As Search Engine Of Choice For Its Phones",
    "Samsung Stands by Google, Will Not Choose Bing for Its Galaxy Smartphones",
    "Report says Samsung has decided not to replace Google with Microsoft's Bing in its phones",
    "Samsung Decides Not to Replace Google With Bing as Default Search on Phones: Report",
    "Google keeps default search engine status on Samsung phones, but for how long?",
    "Samsung abandons plans to switch default search engine to Microsoft's Bing",
    "Good news for Google! Samsung may not replace its Search with Bing",
    "Samsung realized ditching Google for Bing isn't such a great idea after all",
    "Samsung's Bid to Swap Google with Bing on Smartphones Put on Hold",
    "Google Parent Alphabet Stock Rises. It Got Some Big News From Samsung.",
    "Bank of England plans to reject Revolut's bid for banking licence",
    "SoftBank Butts Heads with Revolut Over Plan to Secure Banking License",
    "Revolut's application for a UK banking license may be rejected: Telegraph",
    "Revolut's Application For A UK Banking License May Be Rejected",
    "Revolut Could See License Application Denied, But Crypto Offerings Unaffected",
    "Revolut May Not Get Banking License From Bank Of England",
    "Revolut Introduces Multi-Currency Business Accounts in Australia",
    "Revolut UK Banking License Application Faces Rejection by Bank of England",
    "Bank of England reportedly plans to reject Revolut's banking licence bid",
    "Revolut faces reported rejection for a UK banking license; offers to withdraw application",
    "Not terribly surprising. https://twitter.com/...",
    "@chrismessina@mastodon.xyz",
    "2022 App Store Transparency Report",
    "Apple shares App Store Transparency report, detailing removals & data requests",
    "The App Store had 1,783,232 apps as of 2022",
    "Apple Releases 2022 App Store Transparency Report",
    "Apple Publishes First-Ever App Store Transparency Report",
    "Australia's Stock Exchange ASX Axes Blockchain Initiative—for Good",
    "Australian Stock Exchange Scraps Blockchain Project",
    "Australian stock exchange officially abandons blockchain plans: Report",
    "Australian Stock Exchange Drops Plans for Blockchain Implementation",
    "Blockchain Plans Scrapped By Australian Stock Exchange - Here's Why",
    "Australia's Top Stock Exchange Says No to Blockchain",
    "The open secret about “web3” is that the technology is actually shit. https://twitter.com/...",
    "Apple restricts employees from using ChatGPT over fear of data leaks",
    "Apple has posted at least a dozen job ads on its career page seeking experts in generative AI",
    "Apple restricts use of OpenAI's ChatGPT for employees, Wall Street Journal reports",
    "Apple becomes the latest company to ban ChatGPT for internal use",
    "Silicon Valley Business Journal",
    "Apple is limiting its employees' use of ChatGPT for fear of leaks",
    "Apple Bans Employees From Using ChatGPT Over AI Privacy Fears: WSJ",
    "Fearing leaks, Apple restricts ChatGPT use among employees",
    "SiriGPT? Apple is working on a ChatGPT rival — everything we know (report)",
    "Apple Joins A Growing List Of Companies Cracking Down On Use Of ChatGPT By Staffers—Here's Why",
    "Apple bans its employees from using ChatGPT and other generative AI platforms for work",
    "China's ChatGPT rival bans users who ask AI about Xi Jinping and Winnie the Pooh",
    "Terrified of leaks, Apple is banning employees from using ChatGPT and other AI tools",
    "Apple Warns Employees to Stay Away From ChatGPT While It Builds Its Own AI",
    "Apple restricts ChatGPT, GitHub Copilot use over data worries: report",
    "Apple bans employees from using ChatGPT",
    "Apple Bans ChatGPT Use For Employees Due To Fear Over Data Leaks",
    "Is Apple making its own version of ChatGPT?  It seems that way",
    "Apple reportedly limits internal use of AI-powered tools like ChatGPT and GitHub Copilot",
    "Apple Employees Forbidden From Using ChatGPT",
    "Apple Bans ChatGPT for Employees, As It Launches iOS App",
    "Apple bans employees from using ChatGPT. Should you?",
    "Apple staff restricted from using ChatGPT, GitHub Copilot",
    "Apple Bans Use of ChatGPT by Staff, Fearing Data Leaks",
    "Apple restricts employee use of ChatGPT. Here's why",
    "Apple Is the Latest Tech Firm to Block Employees From Using ChatGPT",
    "2 reasons Apple's internal ChatGPT ban is great news for iPhone",
    "Apple Restricts Employee Use of ChatGPT and AI Tools, Report Claims",
    "Apple Bans ChatGPT, GitHub Copilot, and Other Generative AI Services",
    "Apple reportedly bans some employees from using ChatGPT as it works on its own AI model",
    "Apple bans ChatGPT use by employees",
    "Apple bans ChatGPT at work for its employees",
    "Apple's data privacy fears lead to ChatGPT ban for employees",
    "Apple bans ChatGPT use among its employees",
    "Apple doesn't want its employees to use ChatGPT in case they blab company secrets",
    "Apple Bans Employees From Using ChatGPT Amid Its Own AI Efforts",
    "Apple bans ChatGPT use by employees, report says",
    "Apple bans employees from using ChatGPT and other generative AI tools",
    "Apple bans employees from using ChatGPT — here's why",
    "Apple Restricts Employees From Using ChatGPT",
    "Apple bans ChatGPT use for employees over fears of data leaks",
    "Apple may have restricted employee use of ChatGPT due to privacy concerns",
    "Apple is banning employees from using ChatGPT and other AI chatbots",
    "Apple Limits Employee Use of ChatGPT Over Leak Fears",
    "Apple Bans Some Staff From Using ChatGPT. But iPhone Users Now Have an App for It.",
    "Apple Has Restricted Employees From Using ChatGPT, Bard, Others, Over Fear Of Future Product Leaks",
    "Apple tells employees not to use AI chatbots like ChatGPT over confidential data leak fears",
    "Apple bans internal use of ChatGPT-like tech over fear of leaks, according to leaked document",
    "Apple Restricts Internal Use of ChatGPT",
    "Apple restricts use of ChatGPT for its employees",
    "now we're never going to get xcode that actually works https://www.wsj.com/...",
    "Breaking news: Apple employees are now 80% less efficient at coding 😂 https://twitter.com/...",
    "Pretty much guarantees that Siri won't get better now 😂😂😂 https://twitter.com/...",
    "Kia and Hyundai agree to $200M settlement for making cars viral theft targets",
    "Hyundai, Kia agree to $200 million settlement over US car thefts",
    "Hyundai Motor America and Kia America Resolve Consumer Litigation in Response to Vehicle Thefts",
    "Hyundai and Kia agree to $200 million settlement over TikTok car theft challenge",
    "Kia and Hyundai agree to $200M settlement over car thefts",
    "Hyundai to pay $200 million thanks to a security flaw discovered by TikTok",
    "Hyundai and Kia will pay $200 million over car thefts prompted by ‘Kia Boyz’ TikTok videos",
    "Hyundai and Kia will pay $200 million in settlement over ‘Kia Challenge’ car thefts",
    "Kia and Hyundai settled a class-action lawsuit accusing their cars of being too easy to steal",
    "Hyundai, Kia agree to pay $200 million to settle lawsuit after rise in thefts",
    "How to optimize your LinkedIn profile and grow it to get noticed by recruiters",
    "This website has a fake commenter problem  —  https://www.ft.com/...",
    "Big tech still advertising on Twitter despite rise in hate speech",
    "Twitter's biggest ad buyer no longer considers it ‘high risk,’ says report",
    "Turkey troubles and a Microsoft tussle: The latest on Twitter",
    "Top Advertising Firm Removes ‘High Risk’ Label From Twitter",
    "Top ad group says Twitter no longer ‘high risk’ after new chief appointed- FT",
    "@Techmeme It's gotten even worse, what are they talking about?",
    "Just as Musk is descending into full-blown antisemitism. https://twitter.com/...",
    "Bankrupt Crypto Lender Celsius Network Makes Massive $780M Withdrawal from Staked Ethereum",
    "Bankrupt Crypto Firm Celsius May Receive Second Chance from Wall Street",
    "Wall Street Giants Battling to Restart Celsius With $50M Injections",
    "Celsius Plans To Conclude Bankruptcy Auction Within A Week",
    "Report: Auction for Bankrupt Crypto Firm Celsius Network Lasts Weeks",
    "Nearly 30% of Instacart's revenue is from advertising",
    "Electronic Frontier Foundation",
    "Supreme Court hands tech companies a win, and not just about Section 230",
    "What are the key takeaways of the decisions? How important are they?",
    "Supreme Court rules against reexamining Section 230",
    "Twitter, Google win big at Supreme Court",
    "Section 230 Just Survived a Brush with Death",
    "Supreme Court Sidesteps Ruling on Scope of Internet Liability Shield",
    "In cases involving Google and Twitter, the Supreme Court chooses to defend Section 230",
    "Technology & Marketing Law Blog",
    "The Internet Survives SCOTUS Review (This Time)-Twitter v. Taamneh and Gonzalez v. Google",
    "SCOTUS spares Section 230, rules Google, Twitter not liable for aiding ISIS",
    "The Internet Dodges Censorship by the Supreme Court",
    "Supreme Court ruling continues to protect Google, Facebook and Twitter from what users post",
    "Supreme Court hands Twitter, Google wins in internet liability cases",
    "Google & Other Tech Giants Not Liable For Terrorist Content",
    "Q&A: Section 230 is at the Supreme Court. Here's Why that Matters for Free Expression",
    "The first AI navigator for your entire network",
    "San Francisco Business Journal",
    "The Funded: A16z's Jeff Jordan, who led investments in companies such as Airbnb, is moving on",
    "Andreessen Horowitz's Jordan Steps Back",
    "Jeff Jordan steps back from Andreessen Horowitz",
    "GOAT investor, operator, human being ⁦@jeff_jordan⁩ https://www.forbes.com/...",
    "The only person at a16z who has ever made sensible investments https://twitter.com/...",
    "“you start doing the math, and you're like, holy shit” https://twitter.com/...",
    "Restaurant365 Announces $135M Funding Round Co-Led by KKR and L Catterton",
    "Restaurant365 Raises $135M in Funding",
    "I've now confirmed the valuation is above $1B for R365. Updating story... https://twitter.com/...",
    "How many Instagram followers you need to start making money",
    "How Much Should an Influencer Marketing Campaign Cost?  A Marketer's Guide",
    "TikTok influencers sue Montana to overturn state's ban",
    "The medium is the menu https://www.grubstreet.com/...",
    "what are we even doing https://www.grubstreet.com/... [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "TikTok: Inspire creativity and bring joy.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/19 - ChatGPT Comes To The App Store",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Fraudster jailed for running multimillion-pound website iSpoof",
    "Sabi Raises $38 Million for B2B Marketplace Serving African Retailers",
    "Nigerian E-Commerce Startup Sabi Raises USD 38 M Series B Round",
    "UK court tosses class-action style health data misuse claim against Google DeepMind",
    "International Business Times",
    "BGMI's return may spur investments, gaming prize money",
    "BattleGrounds Mobile India is back: So what happened?",
    "BGMI unban: How Krafton got a 3-month lease on life and should you be excited",
    "BGMI game returns to India under strict conditions; close watch on user harm, addiction [details]",
    "Authorities grant Battleground Mobile India a three-month trial period",
    "As BGMI returns, government outlines 3-month probation, conditions for Krafton",
    "Krafton's BGMI To Make A Comeback In India, But T&C Apply",
    "Krafton's BGMI game set for comeback after government lifts ban temporarily",
    "India lifts ban on Krafton's battle-royale game after a year",
    "How AI and Apple iPhone Could Digitally Preserve Your Voice for Eternity",
    "Everyone should use Personal Voice; it does in 15 minutes what currently takes several weeks",
    "A cyber scare for public transit",
    "Anti-Choice Groups Used Geolocation Data to Target Planned Parenthood Visitors",
    "Location Data About Abortion Provider Visitors Is Still Being Stored and Exploited",
    "This is so evil https://www.wsj.com/...",
    "New York City Schools Lift Ban on ChatGPT, Say Initial Fear ‘Overlooked the Potential’ of AI",
    "Head of New York City's public schools lifts ban on ChatGPT",
    "Transforming Education: NYC Schools Shift from Fear to Embracing ChatGPT",
    "Boston Isn't Afraid of Generative AI",
    "New York City Public Schools chancellor reverses ChatGPT restrictions: report",
    "ChatGPT is now available as an app on iOS",
    "New York City rescinds ban on ChatGPT use in public schools",
    "ChatGPT Launches First-Ever App On iPhones",
    "Celebrate National Streaming Day with the most popular streaming services out there",
    "ESPN's streaming plan a major blow to pay-TV",
    "Disney is reportedly preparing a standalone ESPN streaming service",
    "Disney is reportedly laying the groundwork for its standalone ESPN streaming service",
    "Your Disney Plus and Hulu TV show libraries are about to get much smaller",
    "Gradually, then Suddenly, Obviously",
    "Disney explores ditching cable for streaming-only version of ESPN",
    "We've Been Hearing About Cord-Cutting For Years, But Is Cable Finally Dying For Real?",
    "Disney Plans to Launch ESPN Streaming Service: Report",
    "ESPN is preparing for its “flagship” streaming future.",
    "Breaking: Disney Reportedly Has Begun Negotiations to Roll Out Streaming-Only Version of ESPN",
    "Let me know when the bricks show up. https://twitter.com/...",
    "The Week's 10 Biggest Funding Rounds: Big Money Flows To Water Tech Startup Gradiant",
    "Course5 Intelligence raises $28 mn to boost investments in generative AI",
    "New £1 billion strategy for UK's semiconductor sector",
    "UK Lays Out £1 Billion Plan to Invest in Domestic Chip Sector",
    "Britain Joins Semiconductor Chips Race, Introduces $1.2B Plan",
    "UK seeks to dominate chip industry with £1bn funding",
    "UK's £1BN semiconductor plan branded ‘disappointing’ by chip sector",
    "UK unveils £1bn chip strategy amid criticism over lack of ambition",
    "UK unveils £1bn semiconductor strategy",
    "UK unveils its long-awaited £1bn semiconductor strategy",
    "Britain launches $1.2 billion semiconductor plan after U.S. and EU splurge on chips",
    "New £1bn UK semiconductor strategy finally unveiled",
    "UK plays catch-up in chips war with £1B semiconductor strategy",
    "UK joins global chip race with wafer thin commitment.",
    "UK's $1.25 Billion Strategy for Semiconductor Industry Lacks Ambition, Say Critics",
    "UK Unveils £1 Bn Semiconductor Strategy",
    "UK government unveils long-awaited £1bn semiconductor strategy",
    "Critics say £1bn for UK chip industry not enough",
    "UK plans 1 bln pounds of semiconductor investment in new strategy",
    "Why Montana's TikTok ban may not work",
    "How Montana could enforce a TikTok ban",
    "TikTok Creators Sue Montana Over State's Ban of Short-Video Platform",
    "TikTok users take legal action against Montana over controversial ban",
    "US TikTok users file lawsuit to block Montana ban",
    "Montana's TikTok ban ‘wields a sledgehammer’ to First Amendment rights, creators say",
    "TikTok creators sue Montana over statewide ban of the app",
    "SECURITY EXPERTS: MONTANA'S BAN ON TIKTOK ‘POINTLESS AND TECHNICALLY NAÏVE’",
    "Montana becomes the first state to ban TikTok",
    "Montana TikTok users file lawsuit challenging ban",
    "Montana banned TikTok. Creators in the state are bracing for what's next.",
    "TikTokers immediately sue to block Montana's “unconstitutional” ban",
    "TikTok Users Waste No Time: Sue Montana Same Day TikTok Ban Was Signed",
    "TikTok creators file suit against Montana's statewide ban of the app",
    "How You, or Anyone, Can Dodge Montana's TikTok Ban",
    "Creators Sue Over Montana TikTok Ban",
    "Twitter advertising now safe, says biggest spender; TikTok ban challenged in court",
    "TikTok users may look to sue Montana over app ban",
    "Montana TikTok users denounce ban: 'We have terrible roads but they're banning an app'",
    "TikTok ban in Montana triggers lawsuit by content creators",
    "Montana TikTok ban faces First Amendment legal challenge",
    "Montana's TikTok ban is already facing its first legal challenge",
    "Montana can ban TikTok, but it probably can't enforce it",
    "TikTok creators sue Montana over app ban",
    "Hours After First State Bans TikTok, It Gets Sued",
    "TikTok users sue to stop app ban in Montana",
    "Montana Sets Itself Up for First Amendment Lawsuits With TikTok Ban",
    "Critics Say Montana's TikTok Ban Is a Violation of Free Speech. Here's What to Know",
    "ACLU Slams Montana's Unconstitutional TikTok Ban as Governor Signs Law",
    "TikTok users sue to overturn Montana's statewide ban of app",
    "TikTok creators sue to block Montana's ban on the platform",
    "TikTok Ban in Montana Draws Suit From Ranch Mom, Marine, Student",
    "Montana TikTok ban faces first court challenge",
    "Montana's TikTok Ban Uses Chinese Tactics To Guard Against China",
    "Should governments ban TikTok?  Can they?",
    "NVIDIA GeForce RTX 4060 to cost €329 in Europe",
    "NVIDIA Confirms Founders Edition Only for RTX 4060 Ti 8 GB",
    "GeForce RTX 4060 & RTX 4060 Ti Announced: Available From May 24th, Starting At $299",
    "NVIDIA's massive RTX 4060 GPU giveaway comes with hints of overcompensation",
    "NVIDIA Takes A Deep Dive On VRAM For Its GeForce RTX 40 Series GPUs",
    "Nvidia Brings Ada Lovelace Architecture To Mainstream Gaming",
    "NVIDIA GeForce RTX 4060 Ti & RTX 4060 Custom Models Roundup: From ITX To Triple-Fans!",
    "NVIDIA Brings the Ada Lovelace Architecture to the Masses With GeForce RTX 4060 Family",
    "Nvidia's RTX 4060 and 4060TI are actually priced like mid-tier cards",
    "Nvidia is giving away RTX 4060, 4060 Ti, 4080, and 4090 cards this summer",
    "Nvidia introduces us to the RTX 4060 family",
    "Nvidia Announces a $299 RTX 4060 With the 4060 Ti Arriving May 24 For $399",
    "Nvidia debuts GeForce RTX 4060 family, GeForce Now teams with Xbox",
    "ASUS Unveils NVIDIA GeForce RTX 4060 and 4060 Ti Graphics Cards",
    "NVIDIA announces GeForce RTX 4060 Ti at $399, RTX 4060 to launch in July at $299",
    "Nvidia GeForce RTX 4060 GPUs Announced, Starts at $299",
    "NVIDIA Announces Latest Ada Lovelace Additions: GeForce RTX 4060 Ti & RTX 4060",
    "Nvidia Reveals RTX 4060 Ti, 4060 with Prices Starting at $299",
    "Nvidia stock rises after company announces new graphics cards in GeForce RTX 4060 family",
    "Nvidia RTX 4060 Ti vs. RTX 4060: here's how they stack up",
    "Nvidia announces GeForce RTX 4060 series starting at $299",
    "NVIDIA GeForce RTX 4060 Ti and RTX 4060 Launched",
    "Nvidia's RTX 4060 series is official & it's good news for budget gamers",
    "Nvidia unveils 3 GeForce RTX 4060s starting at $299: DLSS 3 goes mainstream",
    "Nvidia Tips GeForce RTX 4060 Ti for Fast 1080p Play, With RTX 4060 Close Behind",
    "NVIDIA's $299 GeForce RTX 4060 is the cheapest 40-series card yet",
    "DLSS 3 + AV1 + Super low power consumption = 👍👍👍 https://twitter.com/...",
    "@MikeElgan@mastodon.social",
    "About longer videos for Twitter Blue subscribers",
    "Twitter's new 2-hour video feature is already making it a hub for pirated movies",
    "Twitter now supports 2 hour video uploads, and you can guess what happened next",
    "One Degree Friday May 19 2023  —  Twitter now allows paid users to upload two-hour videos",
    "Twitter users upload movies illegally after company rolls out feature to allow two-hour videos",
    "Twitter Blue subscribers can now upload videos as long as two hours",
    "Twitter Blue Subscribers Can Now Upload 2-Hour Videos in the App",
    "Twitter Blue Debuts 2-Hour Long Video Uploads",
    "Twitter Blue Enables Two-Hour Video Uploads — And the Piracy Ensues",
    "Twitter Blue users get another perk: two-hour video uploads",
    "Twitter Videos Go Feature-Length With Support For Two-Hour Uploads",
    "Piracy-loving Twitter Blue users exploit new 2-hour video limit",
    "Twitter Blue Verified Subscribers Can Now Upload 2-Hour Videos",
    "Twitter will now let you upload 2-hour videos, but why would you?",
    "Twitter Blue benefits now include two-hour video uploads, says Elon Musk",
    "Twitter now lets Blue subscribers upload two-hour videos",
    "Twitter Blue Subscribers Can Now Post Full-Length Videos up to Two Hours Long",
    "Twitter Adds New Video Playback Speed Controls, Flags Coming Video Updates",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "this entire platform was made with brevity in mind https://twitter.com/...",
    "Feels like the current owner of this app doesn't know what made it good. https://twitter.com/...",
    "Just what the blue checks need https://twitter.com/...",
    "More movies coming to Twitter https://twitter.com/...",
    "“We wanted flying cars, instead we got two-hour-long tweets” https://twitter.com/...",
    "Meta Custom Silicon: What's Old Is New",
    "Reimagining Our Infrastructure for the AI Age",
    "Microsoft offers electrical engineers a lifeline as it pursues custom cloud silicon",
    "MTIA v1: Meta's first-generation AI inference accelerator",
    "Meta Platforms Crafts Homegrown AI Inference Chip, AI Training Next",
    "Meta is building a new custom chip to run AI models",
    "Meta built a code-generating AI model similar to Copilot",
    "Meta Announced New Chips Specifically Designed for AI Models",
    "Meta is developing its own AI chip - here's hoping it goes better than the Metaverse",
    "Meta is working on a new chip for AI: What meta plans to do with it",
    "It's a wrap: News this week (May 13-19)",
    "Meta AI plans: Optimised data centres, supercomputers and custom chips",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Data Center Design",
    "Meta is working on its own chip, data center design for AI workloads",
    "Meta is working on a new chip for AI",
    "Meta unveils its first custom AI chip",
    "Meta announces AI training and inference chip project",
    "Meta pulls the curtain back on its A.I. chips for the first time",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Coder Tools",
    "Meta Platforms unveils next-generation AI infrastructure and data center designs",
    "@aphysicist @ArturTanona Nope",
    "@ylecun @ArturTanona Did you get an invite to testify in front of congress yet?",
    "The next stages of Privacy Sandbox: General availability and supporting scaled testing",
    "Google's turning off third-party cookies for 1 percent of Chrome users early next year",
    "Privacy Sandbox Initiative: Google to Phase Out Third-Party Cookies Starting 2024",
    "Google Chrome 3rd Party Cookies Crumbling — Finally!",
    "Google to Disable Third-Party Cookies for ‘Privacy’",
    "Google's Privacy Sandbox updates are met with both skepticism and a little more optimism",
    "Google will start phasing out third-party cookies from Q1 2024",
    "Google Chrome is turning off third-party cookies for some users - but it probably won't be you",
    "Google to Phase Out Cookies for 1% of Chrome Users in Early 2024",
    "Google will deprecate cookies for 1% of users in Q1 2024",
    "Privacy Sandbox APIs set to launch in Chrome from July",
    "The Chrome Privacy Sandbox APIs Will Be Generally Available For All Users In July",
    "Google details its next steps for wiping out Chrome tracking cookies",
    "Brace yourselves for YouTube's 30-second unskippable ads",
    "YouTube to soon get 30-seconds long unskippable ads on connected TVs",
    "YouTube is introducing a new ad format that everyone will hate",
    "YouTube to introduce unskippable 30-second ads in TV environment",
    "YouTube is bringing unskippable 30-second ads to TV",
    "YouTube to offer unskippable 30-second ads on connected TV",
    "The world watches YouTube: Highlights from Brandcast 2023",
    "YouTube's Rolling Out 30-Second Unskippable Ads to Connected TVs",
    "If you're not paying for YouTube Premium yet, you might regret that very soon"
]