[
    "European Data Protection Board",
    "Data Protection Commission",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "EU hits Meta with record €1.2B privacy fine",
    "Facebook to be fined £648m for mishandling user information",
    "Meta fined $1.3B for violating EU GDPR data transfer rules on privacy",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "Meta Receives $1.3 Billion Fine For Sending EU Facebook Data to the US",
    "Facebook owner Meta expected to face record fine over transfer of European data to US servers",
    "Meta: Facebook fine is data pointer on EU's approach to Big Tech",
    "EU hands Meta record $1.3 billion fine over data transfers to US",
    "EU hits Meta with $1.3 billion fine for transferring European user data to the US",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "EU slaps Meta with $1.3 billion fine for moving data to US servers",
    "Meta Platforms receives $1.3B European fine for failure to protect user data and privacy",
    "Record Meta fine masks Europe's privacy struggle",
    "EU Regulators Fine Meta $1.3B Over Data Transfers",
    "Meta's €1.2bn fine for breaching GDPR could have a big impact on EU-US data transfers",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Irelands slaps Meta with $1.3B fine over GDPR data privacy violations",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Meta fined $1.3 billion for violating European data privacy rules",
    "Meta hit with record €1.2 billion fine for transferring European Facebook user data to the US",
    "EU slaps Meta with record $1.3 billion fine over data privacy",
    "EU slaps Meta with $1.3 billion fine over data privacy concerns",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta Executives Respond to Record $1.3 Billion GDPR Fine",
    "Meta Was Just Fined a Record-Breaking $1.3 Billion by E.U. Regulators",
    "Facebook Fined $1.3B — Zuckerberg Furious in GDPR Fight",
    "EU fines Meta €1.2bn over transfer of data to US",
    "Facebook Fined €1.2 Billion for Transferring EU User Data to the US",
    "EU fines Facebook $1.3 billion for privacy violations",
    "Meta breached your privacy for the sake of adverts — and has been fined $1.3bn as a result",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Breaking Meta fined €1.2 billion by Irish data watchdog",
    "EU Slaps Meta With Record €1.2 Billion Fine Over Sending User Data To US",
    "Meta gets hit with a $1.3 billion fine by the EU for sending personal data to the US",
    "Meta Fined €1.2bn for Violating GDPR",
    "Facebook hit with record $1.3B fine in European privacy case",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "Meta slapped with massive $1.3B fine for EU-U.S. data transfers",
    "Meta receives record €1.2bn GDPR fine for US data transfers",
    "Facebook privacy breach sees parent company Meta fined a record $1.3B",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers",
    "Meta ordered to pay a $1.3 billion fine because they're bad with data",
    "Irish DPA Finally Fines Facebook",
    "Meta fined 1.2 billion euro for violating GDPR in the EU",
    "Meta Fined $1.3bn In Europe's Largest GDPR Punishment to Date",
    "Meta Down 1.4% Premarket After $1.3B Fine Over US Data Transfers",
    "Meta hit with €1.2B fine over data privacy rules",
    "Facebook's Meta fined a record $1.3 billion for transferring EU users' data to the US",
    "Biggest fines under EU privacy law",
    "Meta slapped with record $1.3 billion fine over EU-US data transfers",
    "EU regulators hit Meta with record $1.3B fine in data privacy inquiry",
    "Meta Fined Record $1.3 Billion in EU Over US Data Transfers",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "It's always fun when reporters don't respect embargoes.",
    "US supers maintain grip on Top500 list as China seemingly hides its powers",
    "Top500: Frontier Gains 92 Petaflops; Henri Gets a Little Greener",
    "TOP500 List Updated With Frontier Remaining At The Top",
    "AMD Now Powers 121 of the World's Fastest Supercomputers",
    "Top500 List Shows AMD Leading With 121 Supercomputers In Its Bag, 168 Powered By NVIDIA GPUs",
    "TOP500 supercomputers list: US continues to dominate, number of AMD-powered systems increases 29%",
    "Frontier still reigns as world's fastest supercomputer",
    "Frontier Remains As Sole Exaflop Machine on TOP500 List",
    "Nvidia, HPE Announce Superchip-Powered ‘Isambard 3’ Supercomputer",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers",
    "Nvidia Has Gone Big Into AI. Its Chips Will Now Power Supercomputers.",
    "Now you can edit your WhatsApp messages",
    "WhatsApp finally rolls out message editing for the masses",
    "Introducing WhatsApp's latest superpower: edit your sent messages!",
    "WhatApp is borrowing one massive iMessage feature, and it's about time",
    "Mark Zuckerberg announces new feature that lets users edit WhatsApp messages",
    "Now You Can Edit Your WhatsApp Messages",
    "Message editing is coming to WhatsApp",
    "You can finally edit WhatsApp messages, with one major limitation",
    "WhatsApp finally lets you fix typos in sent messages",
    "WhatsApp allows users to edit messages",
    "Editable WhatsApp messages are coming to help you fxi silly typos",
    "WhatsApp will now let you edit messages with iMessage-style time limit and more",
    "WhatsApp finally rolls out the ability to edit messages",
    "WhatsApp's latest update lets you edit messages within 15 minutes of sending them",
    "WhatsApp Now Lets You Edit Your Messages",
    "WhatsApp Now Lets You Edit Messages for 15 Minutes After Sending Them",
    "WhatsApp Is Getting iMessage-Like Edit Feature",
    "WhatsApp Now Lets You Edit Messages Within 15 Minutes Of Sending",
    "WhatsApp Edit Messages feature soon to be there",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "Wait what? https://twitter.com/...",
    "Attacker Takes Over Tornado Cash DAO With Vote Fraud, Token Slumps 40%",
    "Tornado Cash DAO Attacker Proposes Restoring Governance Control",
    "Tornado Cash attacker to potentially give back governance control, proposal reveals",
    "DeFi has rough weekend with Aave and Tornado Cash chaos",
    "Tornado Cash attacker proposes to return control",
    "Tornado Cash attacker creates proposal that could restore governance",
    "Tornado Cash Attacker Funnels 360 ETH Through Crypto Mixer After Weekend Governance Exploit",
    "Hijacker's Remorse in Tornado Cash Governance Tussle?",
    "Tornado Cash Hacker Hints of Undoing Attack Pushing Price of Torn Up by 10%",
    "Tornado Cash attacker considers returning governance control",
    "Tornado Cash Attacker Proposes To Give Back Control, TORN Price Spikes | Coingape",
    "Tornado Cash DAO suffers hostile takeover",
    "Hackers Exploit Sanctioned Crypto Mixer Tornado Cash, Unleashing Chaos",
    "TORN price dumps 50% after attacker takes over Tornado Cash DAO",
    "Tornado Cash (TORN) Suffers 27% Drop As Hackers Strike",
    "Malicious Proposal Exploits Tornado Cash Governance",
    "Attacker uses malicious proposal to take over Tornado Cash governance",
    "Uber suspends diversity chief over 'Don't Call Me Karen' events",
    "Uber Puts Diversity Head on Leave After Worker Backlash Over 'Don't Call Me Karen' Events",
    "Uber's 'Don't Call Me Karen' Diversity Chief Placed on Leave",
    "Uber suspended its DEI chief after she hosted events titled “Don't Call Me Karen”",
    "Uber's diversity chief put on leave after complaints of insensitivity",
    "This is everything all at once https://www.nytimes.com/...",
    "iPhone maker Wistron calls it quits, saying Apple didn't allow it to make a profit",
    "Unable to make a profit, Wistron is giving up iPhone assembly in India",
    "Wistron quits making iPhones in India to focus on Vietnam",
    "Wistron is Selling Its India iPhone Assembly Business to Tata Group [Report]",
    "Wistron To Exit Apple's India Business, Bengaluru Plant To Be Acquired By Tata Group",
    "Wistron drops out of iPhone assembly in India",
    "International Business Times",
    "South Korea signals its chipmakers can fill gap after China's ban on Micron",
    "China's Micron ban creates chip dilemma for Samsung, SK Hynix",
    "China imposes sales restrictions on Micron as it escalates tech battle with Washington",
    "With Ban on Micron, China Escalates Microchip Clash With U.S.",
    "Micron expects Chinese ban to affect revenue up to high-single digits",
    "China bans Micron from being used for major infrastructure projects in the country",
    "Petrol dealers face change shortage after ₹2000 note withdrawal",
    "Who will benefit from China's Micron ban?",
    "China bans US chipmaker Micron from key infrastructure projects",
    "China wants U.S. to meet it halfway and fix ties",
    "Micron Stock Sinks on China Sales Ban. Why Intel, Nvidia, AMD Look Safe for Now.",
    "China: Tech manufacturers must stop using chips from US-based Micron Technology",
    "China Says US Chipmaker Micron Failed National Security Review",
    "China says US chipmaker Micron failed security review",
    "South Korea's SK Hynix shares rise slightly after China fails U.S. rival Micron in security review",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "China bans major chip maker Micron from key infrastructure projects",
    "China bans Micron's products from key infrastructure, citing security risk",
    "China bans US chipmaker Micron in apparent retaliation for sanctions",
    "China bans chip maker Micron from its key information infrastructure",
    "Revelations of surveillance misuse complicate policy fight",
    "China bans Micron's products from key infrastructure over security risk",
    "China Bans Micron Chips Claiming They Pose a Risk to National Security",
    "China bans chip maker Micron from key infrastructure projects",
    "China bans some Micron products",
    "Chinese agency claims U.S. chipmaker Micron poses national security risk",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "China Issues Ban on US Chipmaker Products",
    "3 US chip stocks to watch as China cracks down on Micron",
    "Pressure mounts on Korean chipmakers as China restricts Micron chip sales",
    "China hits back, bans major US chip maker Micron",
    "China bans Micron chips over security concerns",
    "China bans Micron chips over “network security risks”",
    "China chip stocks rally after Beijing said U.S. chip giant Micron is ‘major security risk’",
    "China hits back, bans chips from US company",
    "China bans Micron chips in key infrastructure over ‘national security’ risks",
    "China Bans Some Sales of Chips From U.S. Company Micron",
    "China Bars Purchases of Micron Chips, Escalating US Conflict",
    "China Limits Use Of Chips From US-Based Micron Over Security Concerns",
    "China bans Micron products after security review finds unspecified flaws",
    "China Goes Ahead with Micron Technology Sales Ban",
    "China Orders Halt To Using Micron Chips Claiming Security Concerns In Rising Tech War",
    "China Bans Micron Chips in Wake of Cybersecurity Review",
    "China bars US chipmaker Micron from key infrastructure projects",
    "China fails Micron's products in security review, bars some purchases",
    "China says US chip maker Micron failed security review",
    "The first AI navigator for your entire network",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Blockchain Gaming Platform STEPN Integrates With Apple Pay, Here's What We Know",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "BETTER SOUND! (IHP) Amazon's First Employee Shel Kaphan",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "President Biden nominates a fresh face to break FCC deadlock",
    "Biden Names FCC Picks, Pushes for Democratic Majority at Deadlocked Agency",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden nominates Anna Gomez for FCC commissioner vacancy",
    "Biden to nominate Dem Anna Gomez for key FCC seat after Gigi Sohn flap",
    "FlowX.AI Raises USD35M in Series A Funding",
    "AI enterprise innovator FlowX.AI rakes in $35m, eyes global expansion",
    "Romanian insurtech FlowX.ai raises $35M in a Series A round",
    "He Was Investigating Mexico's Military. Then the Spying Began. https://www.nytimes.com/...",
    "Meta and data, chips and dips, crypto and meltdowns",
    "Silicon Valley Business Journal",
    "Applied Materials to create multibillion-dollar R&D facility in Silicon Valley",
    "Silicon Valley company plans to build $4-billion computer chip research center",
    "Applied Materials to invest $4 bln in Silicon Valley chip research center",
    "Applied Materials to Build $4 Billion Chip Research Facility in Silicon Valley",
    "Semiconductor manufacturer to invest $4B for new facility in California",
    "Vice President Kamala Harris to Visit Bay Area Monday",
    "Dentistry software provider Patient21 raises healthtech's biggest round of 2023",
    "Patient21 Raises €100M in Series C Funding",
    "Bitcoin Mining  —  Mining Purpose and Function:  —  Miners are an essential component …",
    "Global Crypto Mining News (May 15 to May 21)",
    "Dogecoin, Litecoin Transactions ‘Spike’ After Ordinals Intervene",
    "Saylor advocates Ordinals Protocol, eyes global Bitcoin adoption",
    "Ordinals boost Litecoin and Dogecoin's network activities",
    "Bitcoin Mining Revenue Surges after Increased Interest in Memecoins and NFTs on Blockchain",
    "Bitcoin Blockchain Continues to See Growth in Ordinal Inscriptions and BRC20 Tokens",
    "@dangillmor@mastodon.social",
    "Popular Android TV boxes sold on Amazon are laced with malware",
    "Lemon Group's Cybercriminal Businesses Built on Preinfected Devices",
    "Millions of Android devices are infected with malware before they leave the factory",
    "Popular Chinese Android TV boxes are preloaded with malware: Report",
    "Millions of Android Phones and TVs May Come with Preinstalled Malware"
]