[
    "Apple's Vision Pro can boost Europe's XR kingpin — in the short-term, at least",
    "Apple is reportedly working on several Mac models",
    "Here's everything Apple could launch in the next 12 months",
    "Apple Watch Ultra refresh coming this year, larger 30-inch plus iMac in early development",
    "Apple's Upcoming Products: From iPhone 15 to New Macs",
    "Apple reportedly working on iMac with 30-inch+ screen",
    "Apple's Vision Pro and Beyond: A Comprehensive Look at the Tech Giant's Product Roadmap",
    "Apple Vision Pro May Have A Surprising Omission, New Leak Says",
    "Second-gen Apple Watch Ultra to launch this fall",
    "Gurman: Apple working on a new iMac with a display larger than 30 inches",
    "Apple's Vision Pro headset may not come with a top strap in the box",
    "Mark Gurman: To finish Vision Pro, Apple is roping in 1000s of employees",
    "Apple “insider” reveals list of upcoming devices including the second-gen Watch Ultra",
    "Apple working on second-gen Apple Vision Pro and all-new cheaper version, says Gurman",
    "Apple's fall roadmap reportedly revealed, including a 30-inch iMac and a M3 MacBook",
    "Apple Vision Pro still has a way to go",
    "Rumor | M3 MacBook Pros of all sizes appear on new 2024 Apple product roadmap",
    "Apple Has Finally Unveiled the Vision Pro.  Here's What It's Launching Next",
    "The real story of how Facebook almost acquired Waze, but we ended up with Google",
    "@amandamarcotte.bsky.social",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "How to Kill a Decentralised Network (such as the Fediverse)",
    "Mastodon (and the Fediverse) is failing.  Here is why.",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "This is a good read: https://blog.bloonface.com/...",
    "@summeremacs@fashionsocial.host",
    "It didn't fail, it was impossible, the wrong idea. more later... https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "@javahippie@freiburg.social",
    "American TikTok user data stored in China, video app admits",
    "Some LastPass users are locked out of their accounts after trying to reset their authenticator app",
    "@Techmeme This company is a dumpster fire 🔥",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "@lauren@mastodon.laurenweinstein.org",
    "LastPass users locked out due to MFA resets",
    "LastPass users furious after being locked out due to MFA resets",
    "Free Figma template of onboarding & activation designs",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "The FTC-Sony Case Against The Microsoft Activision Deal Is Very Bad",
    "Activision acquisition not expected to grow Xbox's console business",
    "Phil Spencer: I think Call of Duty “will play as a great Switch game”",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Xbox Says That The Console War Is Just A Social Construct",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "Has Xbox lost the console wars?",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Effective scheduling is key to workforce optimization",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "45,000 NYC students among the victims of MOVEit global data breach, DOE officials say",
    "NYC student data breached in worldwide MOVEit cyberattack, say city Education Department officials",
    "Community Letter on Data Incident",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "New York City Department of Education impacted by online security breach",
    "NYC schools hacked with sensitive info on 45,000 students compromised: DOE",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Apollo Global leads debt investment in chipmaker Wolfspeed, media report",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "The iPad was meant to revolutionize accessibility",
    "New Technologies and Jobs in Europe",
    "Who could have known?! https://twitter.com/...",
    "@tananarivedue.bsky.social",
    "Reddit plans accessibility changes to iOS app as community fury continues",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "Draft EU plans to allow spying on journalists are dangerous, warn critics |  Surveillance",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "Why the Elon Musk and Mark Zuckerberg fight may be much deeper than it appears",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Khai Wu, Mark Zuckerberg's MMA Trainer, Talks Potential Cage Fight With Elon Musk",
    "We've reached peak tech bro, with billionaires suggesting cage fights and bench-press contests",
    "Mark Zuckerberg vs Lex Fridman in Jiu Jitsu",
    "UFC star offers to train Elon Musk ahead of the fight against Mark Zuckerberg",
    "Musk Says Cage Match With Zuckerberg ‘Might Actually Happen’",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "@ianbetteridge@writing.exchange",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "IBM set to close $5bn Apptio takeover?",
    "IBM Nears Deal for Vista-Owned Apptio",
    "IBM reportedly close to acquiring software company Apptio for $5B",
    "IBM nears US$5 billion deal for Apptio",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio: Report",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "The Flex Report (June 2023)",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "YouTube to launch its own gaming platform called ‘Playables’",
    "Google testing Playables that will let you play games in YouTube",
    "Son Of Stadia: Google May Resurrect Parts Of Tech For Instant YouTube Games",
    "Google Is Reportedly Testing Playable Games Within YouTube",
    "Google Reportedly Testing Online Games for YouTube",
    "Google's next gaming play might be mini ‘Playables’ in YouTube",
    "YouTube Playables: Online Games Are Coming to YouTube",
    "Online games will appear on YouTube: Google is testing it right now",
    "YouTube is planning to expand into online gaming with ‘Playables’: Report",
    "Google is reportedly testing a product to play games via YouTube",
    "YouTube could host mobile and desktop video games",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering"
]