[
    "@profcarroll@federate.social",
    "Google's Online Advertising Practices Violate Antitrust Laws, E.U. Says",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Google risks forced breakup of ad business as EU alleges shocking misconduct",
    "The European Union threatens to break up Google's ad business",
    "EU charges Google with anti-competitive practices in ad tech business",
    "Google gets EU antitrust charges on ad tech business",
    "Google/EC: regulators' current zeal is a function of past failures",
    "EU suggests breaking up Google's display ad business over antitrust concerns",
    "EU regulator orders Google to sell part of ad-tech business",
    "EU Hits Google With Antitrust Complain Over its Ad Tech Business",
    "Google releasing new data around ads it serves the EU and Turkey",
    "Google must break up digital ad business over competition concerns, European regulators say",
    "Google's ad business violates antitrust laws, EU regulator says",
    "Europe seeks break-up of Google ad business, adding to antitrust woes",
    "Today's European Commission announcement about our advertising technology",
    "European Commission has accused Google of violating anti-trust laws",
    "The EU Wants to Break Up Google's Biggest Business",
    "EU Commission: Google must break up its ad business or face a massive fine",
    "Google may be forced to break up its ad business after EU charges",
    "Google's ads business violates antitrust laws, should break up, EU says",
    "Google Ad Business Accused of Breaking EU Antitrust Laws",
    "European Commission says Google is partaking in ‘abusive’ ad tech practices",
    "Google's Ad Tech Dominance Sparks Breakup Threat From EU",
    "The EU is going after Google's bread and butter",
    "EU officials accuse Google of antitrust violations in its ad tech business",
    "EU slaps Google with antitrust charges over ad tech policies",
    "Brussels ramps up Google antitrust case with break-up threat",
    "EU Says It May Seek Breakup of Google's Ad-Tech Business",
    "European Commission files antitrust complaint against Google's ad business",
    "EU orders Google break up digital ad business for ‘abusing dominant position’",
    "Google should break up digital ad business over competition concerns, European regulators say",
    "Google's ads business under threat from EU Commission",
    "EU proposes breaking up Google over anti-competition concerns",
    "Google Faces Breakup of Ads Business Over EU Antitrust Concerns",
    "EU antitrust authorities are ready to strike Google's advertising business",
    "The EU is determined to crush Silicon Valley. https://twitter.com/...",
    "Google response to ⁦@EU_Competition⁩ antitrust charges today. [image]",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling - The Verge",
    "Publications press releases",
    "MEPs ready to negotiate first-ever rules for safe and transparent AI",
    "Europe takes another big step towards agreeing an AI rulebook",
    "EU Lawmakers Vote to Restrict AI Use, Ban Public Face-Scanning",
    "Everything You Need to Know About the EU's Game-Changing AI Legislation",
    "EU Parliament approves AI Act, moving it closer to becoming law",
    "EU moves ahead with draft law to regulate AI",
    "EU lawmakers approve tougher rules as AI Act moves closer to becoming law",
    "European lawmakers vote to adopt EU AI Act",
    "Europe plans to put guardrails on ChatGPT and other AI apps",
    "European Parliament Preps AI Regulation Targeting Apps Like ChatGPT",
    "When generative AI lies, who is liable?",
    "E.U. Takes a Step Closer to Passing the World's Most Comprehensive AI Regulation",
    "European Parliament adopts AI Act position",
    "EU Parliament approves strengthened protections for consumers on AI",
    "Europe Closes in on Rules for Artificial Intelligence",
    "EU AI act passes a significant milestone",
    "EU lawmakers pass landmark artificial intelligence regulation",
    "AI Regulation Is Here.  Almost.",
    "EU Parliament Approves AI Act as a Step towards Global AI Regulation",
    "EU moves closer to passing one of world's first laws governing AI",
    "EU outlines rules aiming to make it clear when content has been generated by an AI",
    "European parliament votes through world's first draft AI bill",
    "Discrimination is a bigger AI risk than human extinction - EU commissioner",
    "Europe Moves Ahead on AI Regulation, Challenging Tech Giants' Power",
    "Markets Await a Fed Pause — but Not an End to Rate Increases",
    "No shit https://twitter.com/...",
    "The Reddit blackout has left Google barren and full of holes",
    "Parts of Reddit are staying dark.  Our search results may suffer for it.",
    "Electronic Frontier Foundation",
    "Subreddits Are Planning an Indefinite Blackout in Response to Leaked Reddit CEO Memo",
    "Thousands of Subreddits Pledge to Remain Dark to Protest Reddit API Change",
    "The Reddit blackout shows no signs of stopping",
    "Many Reddit subreddits, including popular Windows communities, are still “dark” right now",
    "Reddit Communities Decide To Extend Boycott After CEO Says It's Almost Over",
    "How to view Reddit posts during the indefinite blackout",
    "Hundreds of subreddits plan to go dark indefinitely after Reddit CEO's internal memo",
    "What Reddit Got Wrong  —  The monetization creep has been evident for a while. …",
    "Reddit CEO says blackout protest “will pass”, pissed-off moderators pledge indefinite shutdowns",
    "Reddit Blackout: Top subreddits pledge revolt will “continue indefinitely”",
    "Top Reddit Communities Make Blackout Indefinite Following Leaked Memo",
    "Reddit protests see some of the most useful Android subreddits ‘go dark’ [U]",
    "Here are some of the major subreddits that will stay down indefinitely",
    "Subreddits respond to CEO's comments by extending blackouts indefinitely",
    "Popular subreddits plan to extend API protests indefinitely",
    "Rolling strikes in force, as a summer of discontent hits Reddit. https://twitter.com/...",
    "“Will pass” .... Maybe not https://t.co/mTERSe2VTx",
    "Indefinite Blackout: Next Steps, Polling Your Community, and Where We Go From Here",
    "/r/linux_gaming should extend the blackout",
    "Reddit subs with millions of followers plan to extend the blackout indefinitely",
    "AMD aims to dethrone Nvidia in the AI-chip wars",
    "Stocks Making the Biggest Moves Midday: Logitech, Toyota, UnitedHealth, AMD & More",
    "AI chip race heats up as AMD introduces rival to Nvidia technology",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "AMD's New Chip Fails to Impress Investors. It's Still an AI Winner, Analyst Says.",
    "Cloud Division Of Amazon is Investing in AMD's New AI Chips",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "AWS is Considering AMD's New AI Chips",
    "Function calling and other API updates",
    "OpenAI Announces API Updates and Price Cuts for Developers",
    "OpenAI updates GPT-4 with new features",
    "OpenAI: Function calling and other API updates.  Huge set of announcements from OpenAI today. …",
    "ChatGPT Owner OpenAI Announces API Updates and Price Reduction",
    "OpenAI rolls out new features while also reducing pricing",
    "OpenAI brings new features to the API of GPT-4 and GPT-3",
    "OpenAI Updates API, GPT-3.5 Turbo, And GPT-4 For Enhanced Generative AI Applications",
    "OpenAI Upgrades GPT-4 and GPT-3.5 Turbo Models, Reduces API Prices",
    "OpenAI rolls out big chatbot API upgrades for developers",
    "lots of good updates including function calling and 16k context 3.5-turbo: https://openai.com/...",
    "16k 3.5 turbo is my hot new friend https://twitter.com/...",
    "New OpenAI update: lowered pricing and a new 16k context version of GPT-3.5",
    "OpenAI intros new generative text features while reducing pricing",
    "Google Claims Its AI Can Guess How a Shirt Will Fit on Every Body Type",
    "New Google Shopping feature uses AI to model clothing on different body types",
    "Virtually try on clothes with a new AI shopping feature",
    "Google's New AI Tool Is About to Make Online Shopping Even Easier",
    "Here's how to directly report spam sites to Google",
    "Google Is Using AI to Show How Clothes Look on Real People Before You Buy",
    "Google Is Weaving Generative AI Into Online Shopping Features",
    "With AI, Google Can Now Shows How Clothes Fit on Different Models",
    "8 ways Google Lens can help make your life easier",
    "Google Search can now help detect skin conditions and show how clothes look on AI models",
    "Google Lens can now search for skin conditions",
    "Google Lens makes it easy to search about skin conditions",
    "Google Lens now uses AI to help you identify that weird rash",
    "Google Lens, Bard, Search AI, and online shopping just got new AI features",
    "IBM's Latest Research Paper Signals A New Era Of Quantum Computing Is Here",
    "Evidence for the utility of quantum computing before fault tolerance",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "What IBM's result means for quantum computing",
    "Quantum Error Mitigation and the Path to Useful Quantum Computing",
    "IBM quantum computer beat a supercomputer in a head-to-head test",
    "It's a big day. https://www.nytimes.com/...",
    "5 key highlights of the SEC's lawsuit against Binance",
    "Binance under fire: accused of using Ethereum account to comingle client funds",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "Binance's Cyprus unit seeks deregistration as crypto service provider",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "Judge Tries To Broker A Compromise In SEC Versus Binance Case",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "Binance.US and SEC Working to Avoid Asset Freeze",
    "SEC vs Binance: Judge Denies Restraining Order, Calls For Negotiation",
    "Court wants Binance.US, SEC to avoid full asset freeze",
    "Binance gets more time to protest US exchange asset freeze",
    "Binance.US Assets Freeze: Judge Urges SEC to Allow Binance to Operate in the U.S.",
    "Binance.US agrees with SEC to avoid full asset freeze",
    "Crypto Scores 4 Major Victories Vs SEC, Is the US Industry Winning?",
    "Binance.US Strives to Prevent Asset Freeze Through Negotiations with SEC",
    "Breaking: US Federal Judge Rejects SEC's Request to Freeze Binance.US Funds",
    "How American courts have become central to crypto law",
    "Binance.US and SEC told to reach compromise on restraining order",
    "SEC founder shares interesting insights about Binance-SEC debacle",
    "Binance.US, SEC agree to work out deal to avoid full asset freeze: Bloomberg",
    "Binance.US Says SEC's Attempt To Freeze Assets Will Effectively Put it Out of Business: Court Docs",
    "Phil Spencer Wants You To Stop Reading Into His T-Shirt Choices",
    "Phil Spencer talks AI, “living games” and more in new interview",
    "Phil Spencer Teases Multiple Games That Weren't Shown In This Year's Xbox Showcase",
    "Starfield Will Help the Growth of PC and Xbox Game Pass - Phil Spencer",
    "Arm in talks with Apple, Intel, others over IPO investments",
    "Samsung might pour a lot of cash into Arm this year",
    "Intel approached to take on key investor role in Arm IPO",
    "Silicon Valley Business Journal",
    "Intel is reporteldy considering taking a big stake in Arm as part of Arm's IPO",
    "Intel in talks to be anchor investor in Arm IPO - source",
    "Fewer people trust traditional media, more turn to TikTok for news, report says",
    "Worldwide, online news is looking a lot more like TikTok and a lot less like “shared articles”",
    "Sharp decline in appetite for news in recent years, Reuters Institute says",
    "Influencers overtaking journalists as news source: report",
    "Social media eclipses publishers as entry point for news: But Facebook fading",
    "TikTok a growing source for news - but from influencers, not journalists",
    "Publishers enjoy a trust bump as more Australians take up digital subscriptions",
    "Leftwing audiences value ABC and SBS much more than rightwing viewers do, survey finds",
    "TikTok and Instagram influencers top list of trusted news sources for today's youth: report",
    "More young people are using TikTok to access news, research finds",
    "Poor Mastodon https://reutersinstitute.politics.ox.ac .uk/ ... [image]",
    "Researchers Demo Alarming Exploit That Steals Encryption Keys By Recording Power LEDs",
    "This reads like a plot device from a lame 80s hacker flick https://arstechnica.com/...",
    "Hackers can steal cryptographic keys by video-recording power LEDs 60 feet away",
    "Hackers Can Steal Cryptographic Keys By Video-Recording Power LEDs 60 Feet Away",
    "International Business Times",
    "FTC awarded temporary restraining order to halt Microsoft's Activision Blizzard deal",
    "Microsoft-Activision Blizzard deal temporarily blocked by US judge",
    "Microsoft-Activision: US judge temporarily blocks $69bn deal",
    "Microsoft Purchase of Activision Temporarily Blocked by Judge",
    "FTC secures restraining order temporarily prohibiting Microsoft-Activision merger from closing",
    "US Judge Temporarily Blocks Microsoft Activision-Blizzard Deal Following FTC Motion",
    "Xbox officially can't buy Activision Blizzard... for now",
    "Microsoft Blocked From Buying Activision For Now, As Judge Grants Temporary Restraining Order",
    "Microsoft-Activision Blizzard merger temporarily blocked by US judge",
    "Court Temporarily Blocks Microsoft's $69B Buyout Of Activision Blizzard After FTC Intervention",
    "Microsoft's Activision acquisition temporarily blocked by US judge",
    "Judge Grants FTC's Temporary Restraining Order Against Xbox & Activision Blizzard",
    "FTC wins a temporary restraining order blocking the Microsoft—Activision deal",
    "FTC has been granted its restraining order to keep Microsoft from buying Activision Blizzard",
    "Judge temporarily blocks Microsoft's $69 billion purchase of Activision",
    "FTC Files Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "Microsoft/Activision Merger Provisionally Blocked",
    "Microsoft Buy Of Activision Blizzard Temporarily Blocked",
    "FTC looks to hit the pause button on Microsoft's Activision Blizzard deal",
    "Microsoft's $69B Activision Blizzard deal temporarily blocked in U.S.",
    "Microsoft has been temporarily restrained from buying Activision Blizzard, judge rules",
    "Bipartisan U.S. bill would end Section 230 immunity for generative AI",
    "Bipartisan bill seeks to deny AI companies liability protections",
    "@dcseifert@mastodon.social",
    "Amazon Fire Max 11 review: I miss Google apps",
    "Amazon Fire Max 11 review: Easily the best Fire tablet yet",
    "Fire Max 11 Review: Amazon Ups Its Tablet Game",
    "Amazon Fire Max 11 Review: The Best Roblox Tablet On The Market Today",
    "Amazon Fire Max 11 review: Punching way above its weight class",
    "Cybersecurity and Infrastructure Security Agency",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "U.S. and International Partners Release Comprehensive Cyber Advisory on LockBit Ransomware",
    "CISA, Partners Release LockBit Ransomware Cybersecurity Advisory",
    "Understanding Ransomware Threat Actors: LockBit",
    "MERGER OF VODAFONE UK & THREE UK TO CREATE ONE OF EUROPE'S LEADING 5G NETWORKS",
    "Vodafone and Three Merging Networks to Form UK's Largest Mobile Operator",
    "Vodafone and Three agree UK merger, but will regulator block the deal?",
    "UK carriers are taking a page out of US carriers' playbook",
    "Vodafone and Three, two of the UK's biggest carriers, will merge",
    "Vodafone, CK Hutchison agree UK mobile business merger",
    "Vodafone, Hutchison unveil UK mobile merger",
    "Vodafone to merge with Three to create UK giant",
    "Vodafone and Three announce UK mega-merger",
    "It's official: Vodafone and Three to tie the knot in the UK",
    "CK Hutchison, Vodafone to merge units to form UK's biggest mobile provider",
    "Vodafone, Three to merge UK businesses, create largest UK MNO",
    "Vodafone and CK Hutchison agree UK mobile merger",
    "Vodafone, Three Merge U.K. Operations to Create 5G Giant, Promise $14 Billion Investment",
    "Vodafone and Three plan to merge in the UK in a $19B deal (if regulators approve)",
    "Vodafone and Three agree merger to form UK's largest mobile operator",
    "Vodafone and Three plan merger to create UK's biggest mobile carrier",
    "Vodafone and Three merger will be UK's largest network, here's what it could mean for you",
    "Vodafone and Three agree to £15bn UK merger",
    "Vodafone, Three to merge UK mobile phone operations to capitalize on 5G rollout",
    "Vodafone and Three agree UK merger to create biggest mobile player worth £15bn",
    "Vodafone and Three agree to merger in the UK",
    "Vodafone and Three confirm UK merger agreement",
    "Sequoia Is Hunting for Early Deals and More AI as It Splits From China",
    "VC Firm Sequoia India & Southeast Asia Is Now Peak XV Partners",
    "Will Peak XV be able to scale the heights reached by Sequoia?",
    "Peak XV Partners to target US software deals post split",
    "Free Figma template of onboarding & activation designs",
    "Informatica acquires Privitar to strengthen privacy controls",
    "Informatica to acquire Privitar, a data access management company",
    "Informatica bets big on data privacy with Privitar acquisition",
    "Informatica acquires Privitar to boost data access management",
    "Samsung to give staff Friday off once a month in latest embrace of 4-day work week",
    "Samsung Electronics picked as most preferred employer after a decade",
    "More flexible workweeks at Samsung, large firms",
    "Cyber liability insurance vs. data breach insurance: What's the difference?",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "TechRadar ranks Zoho Recruit as 2023's best recruitment CRM",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/14 - EU Threatens Google With A Breakup",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Hong Kong Protest Song Unavailable on iTunes After Government Seeks Ban",
    "@paul@social.paulkedrosky.com",
    "Is AI The Cause Of Job Cuts This Year?",
    "New Revelations About Shopify's Deliverr Sale Spotlights CEO",
    "Machines are helping doctors become more like humans. https://www.nytimes.com/...",
    "Europe is funding Huawei in 6G and AI research: Report",
    "EU demonstrates double standards over Huawei",
    "EU funds multiple Huawei projects despite European ban",
    "Medivis Raises $20M Series A to Advance Surgery with Augmented Reality",
    "Mayo Clinic, Disney CEO back AR medtech's $20M investment round",
    "Medivis Raises $20M in Series A Funding",
    "NSO vets raise $18 million Series A for cyber startup Kodem",
    "Kodem Launches with $25M in Funding From Greylock and TPY Capital to Fix Application Security",
    "Kodem employs runtime intelligence to assess application risk for AppSec teams",
    "Application security startup Kodem emerges from stealth with $25M",
    "Cloudera's CEO is stepping down",
    "SEC lawyers say ‘Coinbase is not entitled’ to lawsuit response",
    "SEC Says It May Make a Recommendation on Coinbase Petition Within 4 Months",
    "SEC asks for more time to respond to Coinbase call for crypto clarity",
    "US SEC Plans To Take Four Months to Coinbase's Rulemaking Petition",
    "SEC Anticipates Responding to Coinbase Petition in 120 Days",
    "SEC Requests Extension to Respond to Coinbase Regulation Request",
    "SEC refuses to make any decision on Coinbase's rulemaking petition",
    "Just-In: US SEC Refuses To Commit Deadline in Coinbase Crypto Clarity Case",
    "SEC Responds to Coinbase's “Baseless” Demand for Regulatory Framework: Says No",
    "SEC snubs Coinbase's seven-day rulemaking request but could act by October",
    "SEC Responds to Coinbase Request for Crypto Clarity, Wants More Time",
    "SEC Indicates Potential Decision on Coinbase Petition Expected in Upcoming 4 Months",
    "SEC responds to Coinbase's second request for action: ‘Still no’",
    "Over 90% of developers use AI tools at work: Survey",
    "Most developers are already pretty on board with AI",
    "AI and coding: How these tech companies are using generative AI for programming",
    "Developer sentiment around AI/ML",
    "GitHub Survey Finds 92% of Programmers Are Using AI Tools",
    "OpenAI's push to own embedding models",
    "Databricks hits $1B revenue milestone as it doubles down on AI with Rubicon acquisition",
    "Welcome Rubicon to Databricks: The Future of AI Storage and Serving Systems",
    "Google Bard was reportedly launching in the EU this week, delayed over privacy concerns",
    "Google's AI ambitions just hit another major roadblock",
    "Google's Bard chatbot has been blocked in the European Union over privacy concerns",
    "Bard: EU data protectors question Google about chatbot",
    "Irish DPC delays Google Bard AI chatbot launch in the EU",
    "Google's Bard AI Chatbot Delayed in EU Due to Privacy Concerns",
    "Google Delays Bard AI Launch in the EU Over Privacy Concerns",
    "Google delays EU launch of its AI chatbot after privacy regulator raises concerns",
    "Google Bard's EU launch gets delayed due to privacy issues",
    "Irish data watchdog blocks Google from launching Bard in the EU: Report",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "Jack Dorsey-Backed Damus App to Suspend Tipping Feature as App Store Threatens Removal",
    "Elon Musk fires back at Apple over bitcoin app removal",
    "Apple wants Bitcoin tipping feature Damus removed from store",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Apple will remove Damus app unless it drops Bitcoin tipping feature",
    "Apple to delist Nostr-based Damus app over Bitcoin tip feature",
    "Apple threatens to ban popular social media App over Bitcoin tipping",
    "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted",
    "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "Due To Bitcoin Payments, Apple Bans Nostr Client Damus From App Store",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/...",
    "Logitech Announces CEO Departure",
    "Logitech CEO Bracken Darrell resigns",
    "Logitech CEO is stepping down",
    "Logitech's CEO is leaving for another job",
    "Open letter by Embracer Group CEO on restructuring program",
    "Embracer Group announces comprehensive restructuring program with immediate implementation",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Embracer was not the one group to rule them all after $2 billion deal falls through",
    "Embracer Group Is Closing Studios And Cancelling Projects In A Major Restructure",
    "Swedish gaming giant Embracer Group to cut studios",
    "Embracer announces restructuring program, studio closures expected",
    "Tomb Raider, Lord of the Rings owner Embracer to close studios, cancel games",
    "Advanced Micro Devices, Inc.",
    "The Third Time Charm Of AMD's Instinct GPU",
    "AMD Has a GPU to Rival Nvidia's H100",
    "AMD says Meta is using its cloud chip as it rolls out AI strategy update",
    "AMD takes on Nvidia with MI300X AI GPU - could it land AWS as a client?",
    "AMD reveals new AI chip challenging Nvidia's dominance",
    "AMD Instinct MI300X accelerator for AI revealed, combines CPU, GPU, and 192 GB of HBM3 memory",
    "AMD launches new Instict MI300X AI chip to take on Nvidia's GPUs",
    "AMD reveals new A.I. chip to challenge Nvidia's dominance",
    "Is The New AMD MI300X Better Than The NVIDIA H100?",
    "AMD Preps GPU to Challenge Nvidia's Grip on the Generative AI Market",
    "AMD Eyes AI, Cloud Expansion With Instinct MI300X, EPYC 97X4 Chips",
    "AMD unveils MI300x AI chip as ‘generative AI accelerator’",
    "AMD Expands MI300 With GPU-Only Model, Eight-GPU Platform with 1.5TB of HBM3",
    "AMD unveils new wave of Data Center and AI hardware",
    "AMD makes its case for generative AI workloads vs. Nvidia",
    "AMD Instinct MI300 is THE Chance to Chip into NVIDIA AI Share",
    "AMD Talks Up Open-Source Software For AI, Introduces Instinct MI300X",
    "AMD's Instinct MI300X GPU targets generative AI workloads",
    "What are the odds Nvidia will be pushing out a 144GB H100 in Q4? 🤔 https://twitter.com/...",
    "AMD Expands AI Product Lineup with GPU-Only Instinct Mi300X with 192GB Memory",
    "AMD Expands AI/HPC Product Lineup With Flagship GPU-only Instinct Mi300X with 192GB Memory"
]