[
    "Lawyer cites fake cases invented by ChatGPT, judge is not amused",
    "Mata v. Avianca, Inc. (1:22-cv-01461)",
    "A Lawyer's Filing “Is Replete with Citations to Non-Existent Cases”—Thanks, ChatGPT?",
    "A lawyer used ChatGPT and now has to answer for its ‘bogus’ citations",
    "Lawyer Uses ChatGPT In Federal Court And It Goes Horribly Wrong",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "ChatGPT: US lawyer admits using AI for case research",
    "A lawyer used ChatGPT for legal filing. The chatbot cited nonexistent cases it just made up",
    "Lawyer faces punishment after ChatGPT gave him fake cases to cite on a court-submitted brief",
    "ChatGPT's Erroneous Legal Citations Land Lawyer in Trouble",
    "Lawyer ‘Greatly Regrets’ Relying on ChatGPT After Filing Motion Citing Six Non-Existent Cases",
    "@kendraserra@dair-community.social",
    "grabbed the funniest bit of that legal case where someone used ChatGPT to write a brief [image]",
    "AI will make idiots dumber. https://twitter.com/...",
    "Dolphin on Steam Indefinitely Postponed",
    "Dolphin Emulator release on Steam is “indefinitely postponed”",
    "Dolphin Emulator Steam Release ‘Indefinitely Postponed’ After Cease and Desist From Nintendo",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Dolphin emulator's Steam launch blocked by Nintendo DMCA notice to Valve",
    "Nintendo filed a DMCA notice against Dolphin emulator's release on Steam",
    "Buzzkill Nintendo Slams Valve With DMCA Takedown Over Dolphin Wii Emulator",
    "Nintendo Hits Valve With Steam DMCA Takedown Notice",
    "Nintendo Sends DMCA to Wii/Game Cube Emulator Dolphin Ahead of Steam Launch",
    "Nintendo serves Valve a takedown notice to remove an emulator from Steam",
    "Wii emulator Dolphin hit with DMCA notice by Nintendo to block Steam launch",
    "Nintendo Sends Valve DMCA Notice Over Wii Emulator Listing On Steam",
    "Dolphin Emulator Steam release Indefinitely Postponed due to Nintendo DMCA",
    "Blur Dominates 82% of the NFT Lending Market",
    "Blend's Unprecedented Surge: Dominating 82% of the NFT Lending Market in 22 Days",
    "New Crypto Protocol Captures More Than 80% of the NFT Lending Market in Just One Month: DappRadar",
    "Blur's NFT lender Blend sees volume reach $225 million in less than a month",
    "More NFT Holders On Blur Are Taking Loans, Not Trading",
    "Blur's Lending Protocol Blend Commands 82% of NFT Lending Market Share",
    "Market Monopoly: Blur Claims 82% Share in NFT Lending, DappRadar Report Reveals",
    "Blur's Blend protocol facilitates nearly 170,000 ETH loans in 22 days",
    "Binance launches NFT loan service to rival Blend",
    "Pinduoduo-owner PDD beats quarterly revenue estimates, shares rise",
    "BigTech is Dead. Long Live #BigTech https://twitter.com/...",
    "How the Internet Shrank Musk and DeSantis",
    "Twitter Space team narrowed down from 100 to roughly three employees",
    "DeSantis' Twitter launch disaster shows Musk's platform isn't ready for prime time",
    "A top Twitter engineering boss says he quit the day of Ron DeSantis' botched campaign launch",
    "Elon Musk And Ron DeSantis Prove That Twitter Spaces Is Kind Of A Joke",
    "The GOP girlies are fighting",
    "Platformer: 'Inside Twitter's Failed Space Launch'",
    "US Commerce Secretary: US 'Won't Tolerate' China's Ban on Micron Chips",
    "U.S. 'won't tolerate' China's ban on Micron chips-Raimondo",
    "Pressure Mounts for U.S. Response After China's Micron Ban",
    "Funny watching the US throw its toys out of the pram. https://www.bnnbloomberg.ca/ ... [image]",
    "what happens when US bans $NVDA and $AMD from selling to china? https://twitter.com/...",
    "Office of the Arizona Attorney General",
    "Office of Attorney General …",
    "48 states sue phone company that allegedly catered to needs of robocallers",
    "Case 4:23-cv-00233-EJM  —  INTRODUCTION 19.  Every day, millions of American consumers receive …",
    "Avid Telecom sued by multistate task force for making billions of unauthorized robocalls",
    "Forty-eight states sue Avid Telecom over robocalls",
    "Nearly 50 state AGs sue company that allegedly facilitated billions of spam calls",
    "Office of Attorney General for the District …",
    "AG Schwalb Sues Avid Telecom Over Illegal Robocalls",
    "Company Behind Billions of Robocalls Is Being Sued by Nearly Every State",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Maryland sues Avid Telecom over alleged robocall scheme",
    "Billions of Robocalls and Alleged Scams Gets Telecom Sued by 48 States",
    "New Jersey Office of Attorney General",
    "Firm Hit With Robocalls Suit: ‘Americans Are Sick and Tired’",
    "There is a New Plan to Stop Robocalls",
    "Robocalls are out of control but this could change things",
    "Information for Japan Resident Customers of Binance.com About Transition to the New Local Platform",
    "Binance kicks off transition to new platform in Japan",
    "Binance makes return into Japan under a new subsidiary",
    "Breaking: Binance To Suspend Crypto Services For Japan By November 30 | Coingape",
    "Stablecoins Are the ‘Glue’ Between the Real Economy and Blockchain: Binance Japan General Manager",
    "Australian Financial Review",
    "How chipmaker Nvidia struck AI gold",
    "AI Stocks Are Flying, but Don't Call the Craze a Bubble",
    "Silicon Valley Business Journal",
    "5 questions for Ampere CEO Renee James",
    "What Factors Contributed to Nvidia's Astonishing Rise as Top-Tier Global Corporation?",
    "Riding on AI wave, Nvidia inches closer to trillion-dollar market cap",
    "Elon Musk takes Twitter out of the EU's Disinformation Code of Practice",
    "Twitter set to exit EU Code of Practice on Disinformation, sources say",
    "Twitter to pull back from Europe's disinformation crusade",
    "Twitter likely to quit EU code against disinformation, EU official says",
    "Twitter pulls out of voluntary EU disinformation code",
    "Twitter cannot hide from EU rules after exit from code, EU's Breton says",
    "Twitter pulls out of EU's voluntary Code of Practice against disinformation",
    "EU: Twitter Dropped Out of Disinformation Agreement",
    "Elon Musk pulls Twitter from EU Code against disinformation",
    "Twitter quits EU's voluntary disinformation Code of Practice",
    "Twitter quits EU disinformation code: EU industry commissioner Thierry Breton",
    "EU's Breton says Twitter 'can't hide' after platform ditches disinformation code",
    "Twitter Withdraws From EU Disinformation Code, Commissioner Says",
    "Twitter leaves EU's voluntary pact on fighting disinformation",
    "Twitter withdraws from EU disinformation code ahead of landmark new rules",
    "Musk's Twitter Ditches EU Code of Practice on Disinformation",
    "Google removes ‘Slavery Simulator’ game from store following a wave of criticism in Brazil",
    "Google pulls ‘Slavery Simulator’ from app store after backlash from Brazilian gamers",
    "Google removes “Slavery Simulator” game from Play Store",
    "How could Google have ever allowed this to be sold, even for a second? https://www.bbc.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "(IHP) The History Of Internet Porn",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Portugal moves closer to banning Chinese suppliers from 5G",
    "This newly-discovered malware could disrupt power generation — and do physical damage",
    "Portugal Effectively Bans Chinese Companies From 5G Network",
    "Portugal gov't could ban Huawei from country's 5G network",
    "Azure Linux released at Build - where Microsoft revealed why it did not fork Fedora",
    "Introducing the Azure Linux container host for AKS",
    "Update Regarding Shipment Zero",
    "Sekoia.io Raises €35M in Series A Financing",
    "Cybersecurity firm Sekoia.io secures €35m in fresh funding",
    "Sastrify, the platform for managing SaaS Subscriptions raises $32m",
    "Streamlining SaaS usage: Sastrify raises $32M to transform procurement process",
    "German SaaS platform Sastrify raises Series B",
    "Sastrify Raises $32 Million to Tackle ‘SaaS Sprawl’",
    "SaaS tool procurement platform Sastrify raises $32 million",
    "Germany's Sastrify raises €29.6M in Series B funding led by Amsterdam-based Endeit Capital",
    "OpenAI CEO Reverses Threat to Leave Europe",
    "OpenAI has no plans to leave Europe - Sam Altman makes a U-Turn",
    "Europe pitches ‘AI Pact’ to curtail the booming tech's risks",
    "Sam Altman's threat to quit EU is met with criticism from lawmakers",
    "Sam Altman Says OpenAI Will Not Leave Europe",
    "OpenAI's Sam Altman Promises His Company Won't Leave the EU, Actually",
    "OpenAI CEO Altman ‘Blackmails’ EU Over AI Regulation",
    "Tech lords threatening to pull services should stop crying wolf",
    "OpenAI's Sam Altman charmed lawmakers in DC. In Europe, it's a different story",
    "OpenAI's Sam Altman downplays fears ChatGPT maker could leave Europe over AI rules",
    "OpenAI's Sam Altman makes U-turn, says ‘no plans of leaving Europe’",
    "OpenAI CEO Sam Altman Says the Company May Remove ChatGPT from Europe Then Backtracks",
    "OpenAI has ‘no plans to leave’ Europe due to regulations, CEO says",
    "OpenAI Considers Withdrawing from Europe Amid Regulatory Pressure",
    "OpenAI's Sam Altman reverses threat to cease European operations",
    "OpenAI CEO Reverses Threat to Leave Europe Due to Regulations",
    "OpenAI says it's not going to leave Europe",
    "ChatGPT Could be Pulled from Europe, OpenAI CEO Warns",
    "Sam Altman reverses threat to ‘leave Europe’ over AI regulations",
    "No plans to leave Europe: OpenAI CEO Sam Altman",
    "ChatGPT-maker U-turns on threat to leave EU over AI law",
    "Methinks the lad doth protest too much https://twitter.com/...",
    "When life comes at you fast! https://twitter.com/...",
    "Tesla-Files nähren Zweifel an Elon Musks Versprechen",
    "Report: ‘massive’ Tesla leak reveals data breaches, thousands of safety complaints",
    "Huge Tesla leak reveals thousands of safety concerns, privacy problems",
    "Shocking Leaked Tesla Documents Hint at Cybertruck Problems",
    "Tesla employee leaks thousands of safety and privacy breach reports",
    "This is your brain on Elon Musk",
    "Huge Tesla data leak reportedly reveals thousands of safety complaints. 4 things to know",
    "Tesla could face a $3.3 billion fine over a massive data leak",
    "Tesla Whistleblower Leaks 100 Gb of Data to German News Outlet",
    "Tesla Whistleblower Leaks 100GB of Data, Revealing Safety Complaints",
    "Tesla Keeps Doing Something No Other Company Dares To",
    "Tesla Data Leak Tips Thousands of Autopilot Safety Complaints",
    "Tesla data breach? 100GB of company information ‘leaked by whistleblower’",
    "Tesla's FSD Beta Goes Live Internationally, But Not Everywhere Just Yet",
    "Tesla customers reported thousands of Full Self-Driving complaints, leaked data shows",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Tesla leak reveals thousands of safety complaints",
    "Whistleblower Drops 100 Gigabytes Of Tesla Secrets To German News Site: Report"
]