[
    "Marques Brownlee on YouTube",
    "@jstevenyork@mastodon.social",
    "Apple inventing tech to make iPhone & Apple Watch screens last longer",
    "A Google Pixel Fold's screen broke already. Should you be concerned?",
    "Ron Amadeo's Pixel Fold Lasted Four Days",
    "Reminder, Those $1800 Foldables Aren't Impervious to Damage",
    "The first deflating report of Pixel Fold screen failure is pretty rough",
    "Google Pixel Fold: 7 unfiltered thoughts after 8 days with the device",
    "Does the Google Pixel Fold have a pen?",
    "The Pixel Fold is brilliant, according to reviews, but is Google's quality control a problem?",
    "I lost interest in Google's Pixel Fold after this story about a display breaking",
    "Gurmanizing Apple's OLED Plans With Added Kuo",
    "Google Pixel Fold vs Samsung Galaxy Z Fold 4: Which one should you get?",
    "A Google Pixel Fold has died after just four days: Questions on durability",
    "Google Pixel Fold display breaks already — and this could be the cause",
    "The Pixel Fold shows how far ahead Samsung's folding phones are",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Google Pixel Fold Review: Foldable Phones Are Improving",
    "Google Pixel Fold review: The first foldable phone that gets it right",
    "Pixel Fold Breaks in Just 4 Days For High-Profile Reviewer",
    "Someone's Pixel Fold has died already and the bezels may be to blame",
    "Reviewer's Pixel Fold unit display wrecked exposing potential design vulnerability",
    "Google Pixel Fold Review: A Folding Phone That Still Has Some Wrinkles to Work Out",
    "Google Pixel Fold review: It's what's on the inside that counts",
    "Google Pixel Fold Review: Maybe Next Year!",
    "Google Pixel Fold Review: A Promising Start, but Not Perfect",
    "Google Pixel Fold is a quality first swing at a foldable",
    "Google Pixel Fold Review: Smooth Innovation At A Considerable Cost",
    "Google Pixel Fold review: it surprised the heck out of me",
    "Google Pixel Fold review: First impressions of Google's $1800 folding phone",
    "Sorry. https://arstechnica.com/...",
    "RIP to my Pixel Fold: Dead after four days",
    "Ars Technica: “RIP to my Pixel Fold: Dead after four days”",
    "Ron from ars technica's pixel fold broke",
    "Ars Technica: RIP To My Pixel Fold After Four Days",
    "@williamgunn@mastodon.social",
    "Brave Pixel Fold owners can try to repair hardware issues with iFixit's help",
    "Google supports you fixing your Pixel Fold yourself, a first for any foldable",
    "You'll soon be able to repair your Google Pixel Fold with parts from iFixit",
    "Pixel Fold repair parts will be available through iFixit",
    "Google and iFixit join forces again to DIY repairs for Pixel Fold",
    "Google Pixel Fold will reportedly have DIY repair guides and genuine parts via iFixit",
    "It's official — the Pixel Fold has something we've never seen before",
    "Google and iFxit will offer Pixel Fold repair parts, tools and manuals",
    "Silicon Valley Is On Drugs",
    "FDA creates path for psychedelic drug trials",
    "Magic Mushrooms.  LSD.  Ketamine.  The Drugs That Power Silicon Valley.",
    "@konstantin@digitalcourage …",
    "Apple speaks out against bill that could mandate CSAM scanning in iMessage",
    "Apple says proposed UK law ‘poses a serious threat’ to end-to-end encryption",
    "Apple urges UK to rethink anti-encryption Online Safety Bill",
    "Apple opposes UK bill that could mandate backdoor scanning in iMessage",
    "Apple officially opposes proposed UK law that would weaken iMessage encryption",
    "@konstantin@digitalcourage.social",
    "Apple joins opposition to encrypted message app scanning",
    "Apple Joins Opposition in UK To Encrypted Message App Scanning",
    "International Business Times",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram tests feature to block explicit images in direct message requests",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "New Tools in Messenger, Instagram Give Parents More Control",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Meta launches parental controls for Messenger. Here's how to use them.",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Facebook adds parental control tools to Messenger",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Meta guardrails: More safeguards, monitoring tools for teens launch across social platforms",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Parents can now see more of what their kids are up to on Messenger and Instagram",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Microsoft wants to bring Windows 11 to the cloud for ALL users, including you",
    "Microsoft Sees Cloud-Based Windows 11 as a Long-Term Goal",
    "Microsoft Wants to Shoot Windows 11 Into the Cloud",
    "Microsoft is working on a full cloud-based Windows OS",
    "Report: Microsoft Wants to Bring Windows 365 Cloud PCs to Consumers",
    "Windows 11's Potential Subscription-Based Cloud Future Revealed by FTC",
    "Microsoft is planning to put Windows in the cloud for consumers",
    "Microsoft's Long-Term Vision: Windows Transition to Cloud-based Experience",
    "Microsoft wants to put Windows PCs fully in the cloud - but what will that mean for you?",
    "Microsoft Plots Cloud-Based Windows 11",
    "I wouldn't mind streaming Windows 11 from the cloud to my Vision Pro",
    "Microsoft Plans to Turn Windows into Cloud-Streamed Operating System",
    "Microsoft's looking into offering a version of cloud-based Windows 365 for consumers",
    "Microsoft wants to move Windows fully to the cloud",
    "@tetherpoint@mastodon.social",
    "Mac Pro market even smaller than expected, as high-end pros choose 16-inch MBP",
    "Did Apple accidentally make Mac Pro unnecessary?",
    "M2 Ultra Mac Pro review shows Apple's powerhouse hasn't left the worst of the Intel era",
    "Has Apple Overshot the Market with the New Mac Pro?",
    "4 Reasons the Apple Silicon Mac Pro Is Not Worth Your Money",
    "Mac Studio With M2 Ultra Review: Apple's Real Pro Machine",
    "EncroChat takedown led to 6,500 arrests and $979 million seized",
    "Encrypted phone service ‘Encrochat’ shutdown leads to 6,500 arrests - Europol",
    "EncroChat Bust Leads to 6,558 Criminals' Arrests and €900 Million Seizure",
    "EncroChat dismantling lead to 6500 arrests, EUR 900 million seized",
    "3-Year Probe Into Encrypted Phones Led To Seizure of Hundreds of Tons of Drugs, Prosecutors Say",
    "Three Arrows Capital Liquidators Seek $1.3B From Bankrupt Hedge Fund's Founders: Bloomberg",
    "3AC liquidators seek $1.3 billion from Zhu, Davies: Bloomberg",
    "Three Arrows Capital Liquidators Demand $1.3B from Bankrupt Fund's Founders in Legal Battle",
    "3AC liquidators look to recoup $1.3B from founders",
    "Three Arrows Capital Liquidators Seek a Staggering $1.3B from Founders of Insolvent Hedge Fund",
    "Microsoft considered acquiring Bungie and Sega to bolster Xbox Game Pass, internal emails show",
    "Lawyers: Email proves Microsoft's Activision bid is designed to eliminate PlayStation",
    "Bethesda exec was “confused” over double standard for multi-console Call of Duty",
    "Bethesda Didn't Understand Why ‘Starfield’ Was Xbox Exclusive But ‘Call Of Duty’ Wasn't",
    "Xbox Exec Thought Microsoft Could “Go Spend Sony Out of Business”",
    "Jim Ryan Says Publishers “Unanimously” Hate Xbox Game Pass",
    "Xbox Acquired Hellblade Developer Ninja Theory for $117 Million",
    "Microsoft Responds To Old Xbox Comment About ‘Spending Sony Out Of Business’",
    "Microsoft seriously considered acquiring Sega and Bungie to bolster Xbox Game Pass",
    "Microsoft's Potential Game Plan in 2020: ‘Spend Sony Out of Business’",
    "Microsoft wanted to buy Sega, Bungie and Io Interactive before Activision Blizzard",
    "Xbox exec Matt Booty wanted to “spend Sony out of business”",
    "Pete Hines Email Indicates “Confusion” About Starfield, Elder Scrolls 6 Exclusivity",
    "Microsoft Considered Xbox Acquisition Push to Drive Sony out of Business",
    "All the new things we've learned from Microsoft and the FTC's internal documents at court",
    "Xbox Game Studios Head Wanted to “Spend Sony Out of Business” in December 2019",
    "More Microsoft Xbox email and document leaks show cloud investment plans and more",
    "Xbox Game Studios' VP Was Prepared to ‘Spend Sony Out of Business’ to Grow the Xbox Brand",
    "Bethesda Executive “Confused” By Microsoft's Willingness To Keep Call Of Duty On PlayStation",
    "Xbox Looked at Acquiring Sega, Supergiant, Bungie",
    "Xbox Studios Head Said Microsoft Could ‘Spend Sony Out of Business’ in 2019 Email",
    "Xbox Aimed to “Spend Sony Out of Business,” Acquisitions/Cloud Prioritized over XSX Supply",
    "Microsoft's Proposed Strategy To “Spend Sony Out Of Business” Revealed In 2019 Internal Email",
    "Xbox internal emails: Microsoft ‘positioned’ to ‘spend Sony out of business’",
    "Microsoft was ready to ‘go spend Sony out of business’ to strengthen Xbox",
    "Microsoft was ready to “go spend Sony out of business” to strengthen Xbox",
    "Microsoft Exec Was Ready To ‘Go Spend Sony Out of Business’ To Strengthen Xbox",
    "Creating fully immersive experiences in your app",
    "Why the Meta Quest 2 Is Better Than the Apple Vision Pro for Fitness",
    "Why the Vision Pro automatically stops VR when you move more than five feet",
    "Multiple new Vision Pro headsets are already being developed at Apple",
    "Meta launches Quest+ subscription for its VR headsets as Apple Vision Pro debut nears",
    "Apple Vision Pro Cinema Environments revealed — here's what we know",
    "Apple Vision Pro: your $3.5K might not stretch to a headband",
    "So much for any New Yorkers having sufficient space in their apartment to use one [embedded post]",
    "Possibly to limit the potential for Vision Pro fail videos ... https://twitter.com/...",
    "Vision Pro safe area limited to 10x10 feet for VR experiences",
    "Introducing ERNIE 3.5: Baidu's Knowledge-Enhanced Foundation Model Takes a Giant Leap Forward",
    "These two AI models claim to be better than ChatGPT. Here's what we know",
    "Chinese ChatGPT competitor claims it can beat GPT-4",
    "China's Baidu says its new AI beat ChatGPT on some metrics",
    "Baidu claims Ernie Bot's language model has surpassed ChatGPT",
    "Baidu's Ernie Bot Outperforms OpenAI's ChatGPT in Key Tests, Propelling AI Competition",
    "Baidu's ERNIE 3.5 Claims Superiority Over ChatGPT 3.5 in Comprehensive Abilities",
    "China's Baidu Ernie Chatbot Update Outperforms OpenAI's ChatGPT on Key AI Tests",
    "Baidu's ERNIE 3.5 LLM outperforms OpenAI's GPT-4",
    "Baidu Says Ernie 3.5 Outdid ChatGPT and GPT-4 in Key Metrics",
    "Baidu vs ChatGPT: Chinese giant made bold claims that it's outpowered OpenAI in benchmark tests",
    "China's Baidu claims its Ernie Bot beats ChatGPT on key tests as A.I. race heats up",
    "Baidu Claims Ernie Bot Outperforms OpenAI's ChatGPT",
    "Baidu's Ernie AI chatbot outperforms ChatGPT, company says",
    "Baidu incorporates plugin functionality into ERNIE Bot",
    "@Techmeme I'm really excited to have Ernie summarize the Tiananmen Square Massacre.",
    "TikTok Kills Its BeReal Clone",
    "TikTok Discontinues BeReal Clone, Adds Parental Filters",
    "TikTok is jumping off the BeReal bandwagon by killing TikTok Now",
    "TikTok kills BeReal clone TikTok Now after less than a year",
    "TikTok Now, the BeReal clone you never used, is being discontinued",
    "It Looks Like TikTok's BeReal Competitor Is Dead",
    "TikTok Now is the latest BeReal knockoff",
    "TikTok kills off its BeReal clone, likely because it knows BeReal is dying off on its own",
    "TikTok is shutting down its BeReal clone https://www.theverge.com/...",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "Personal Data About Paid U.S. TikTok Creators Is Probably Stored in China",
    "Byju Investor Prosus Cuts Indian Tech Company's Valuation by 15%",
    "Prosus slashes India's Byju's valuation to $5 bln",
    "Prosus slashes Byju's valuation to $5 billion",
    "Prosus cuts Byju's valuation to $5.1b",
    "Behind the scenes: What happened between Byju's and board members?",
    "EdTech is a notorious way to lose money.  [embedded post]",
    "Byju's likely in advance talks to raise $1 billion funding to prevent investors revolt: Report",
    "India's Byju's seeks to raise $1 bln to stave off investor revolt - Bloomberg News",
    "Amid Mounting Troubles, BYJU'S Seeks $1 Bn To Fight Off Investor Pressure",
    "Mark Zuckerberg announced upcoming release of new business features for WhatsApp",
    "WhatsApp Business users jump four-fold in three years",
    "WhatsApp Business Gains 150 Million Users in 3 Years",
    "Making it Easier for Small Businesses to Connect with More Customers",
    "You may soon see more ads from small companies on Facebook thanks to WhatsApp Business",
    "WhatsApp Business Adds Features as It Hits 200M Monthly Users",
    "WhatsApp Business reaches 200 million users, will allow Facebook ads without an account",
    "WhatsApp Business now has over 200 million users, launches new paid features",
    "WhatsApp Business Announces 200M Active Users and Launches Personalized Customer Messages",
    "Good news - WhatsApp will soon let businesses send you personalized messages",
    "Zuckerberg announces new features coming on WhatsApp Business app",
    "Look mom, we made the paper! Exciting time for the team at @AbridgeHQ. https://twitter.com/...",
    "Someone has made ChatGPT for Windows 3.1 and it's hilarious",
    "OpenAI reportedly plans “supersmart” ChatGPT business assistant",
    "Would an OpenAI work assistant put the company in conflict with Microsoft?",
    "OpenAI Plans ChatGPT ‘Supersmart Personal Assistant for Work,’ Setting Up Microsoft Rivalry 1",
    "Snowflake Forecasts New Flurry Of Data Programmability",
    "Snowflake stresses app development in flurry of rollouts",
    "Snowflake's finding NeMo to train custom AI models",
    "Snowflake-Nvidia partnership could make it easier to build generative AI applications",
    "Snowflake Gets Closer to Nvidia, Microsoft in Generative AI Push",
    "Snowflake partners with Nvidia, expands Microsoft partnership",
    "Snowflake, Nvidia partner to enable generative AI app development in the Snowflake Data Cloud",
    "Snowflake launches Snowpark Container Services, linchpin to generative AI strategy",
    "Nvidia, Snowflake to help enterprises build customised AI apps",
    "Snowflake and Nvidia bring generative AI to Data Cloud",
    "Nvidia, Snowflake announce partnership for custom generative AI models",
    "Snowflake adds partnerships with Nvidia and Microsoft for AI double play",
    "Snowflake and Nvidia partner to let businesses use their own data to build custom AIs",
    "Nvidia Partners With Snowflake to Bring More AI Power to Corporations",
    "UT Mourns Lithium-Ion Battery Inventor and Nobel Prize Recipient John Goodenough",
    "Co-creator of lithium-ion battery and the oldest Nobel winner dies at age 100",
    "John Goodenough, The Scientist Who Helped Revolutionize Lithium-Ion Batteries, Dies at 100",
    "Oldest person to win Nobel Prize, a force lithium battery development, dies",
    "John Goodenough, creator of the lithium-ion battery, dies at 100",
    "Lithium-ion battery pioneer John Goodenough dies, aged 100",
    "Lithium-ion battery creator John Goodenough dies at 100",
    "John Goodenough, Creator Of The Lithium Ion Battery, Dead At 100",
    "John Goodenough, Nobel laureate and battery pioneer, dies at 100",
    "After decades contributing to science, John Goodenough powers down",
    "Will sodium-ion battery launch stabilize lithium carbonate prices?",
    "John Goodenough, Nobel laureate and Li-ion battery inventor, dies at 100",
    "John B. Goodenough, who shared a Nobel Prize for his work on the lithium-ion battery, has died",
    "John Goodenough, Pioneering Creator of the Lithium-Ion Battery, Dies at 100",
    "The Electric: Inside the White House Plan to Speed Battery Metals Mining",
    "John B. Goodenough, 100, Dies; Nobel-Winning Creator of the Lithium-Ion Battery",
    "John Goodenough, Lithium-Ion Battery Inventor and Nobel Prize Recipient, Dies",
    "Cyera bags $100M to improve cloud data security with large language models",
    "Data security startup Cyera lands a $100M investment",
    "Data Security Firm Cyera Attracts $100M Investment",
    "Jake Paul's Betr Raises $35M at $300M Value Led by Roger Ehrenberg",
    "5 common data and analytics pitfalls businesses should avoid",
    "@FrankPasquale@mastodon.social",
    "Is Goodreads down? Outage reports for book review site continue",
    "Romance Novel Recommendations From Authors Who Love the Genre",
    "Thomson Reuters to acquire legal AI firm Casetext for $650 mln",
    "Garry Tan breaks down the key metric in Y Combinator's new list of top startups",
    "Thomson Reuters Corporation Signs Definitive Agreement to Acquire Casetext",
    "Inaugural YC Top Companies List by Revenue",
    "Thomson Reuters Adds to AI Stable With $650M Casetext Deal",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Lightmatter: Next-gen computing built for AI.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/27 - What If OpenAI Did Its Own Copilot?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Unity Launches New AI Marketplace as Premier Destination for AI Solutions",
    "Unity releases deeply upsetting trailer for its new AI development tools",
    "Why Unity is using its new AI platforms to become more accessible to brands and agencies",
    "Insider Q&A: John Riccitiello, CEO of video game software company Unity, on AI and gaming's future",
    "Faros AI raises $20M to make software engineering teams smarter",
    "Faros AI raises $20M to bring AI insights to software engineering",
    "@numbercrow@techhub.social",
    "SiriusXM to Shut Down Stitcher Podcast App",
    "@Techmeme Say it with me: enshittification.",
    "Cart.com Raises $60M Series C Funding at $1.2 Billion Valuation",
    "Cart.com Announces $60 Million Series C Funding Round at $1.2 Billion Valuation",
    "Identity fraud prevention provider Socure acquires Berbix for $70M",
    "Socure Acquires Berbix for Approx. $70M",
    "Socure's $70 million acquisition of Berbix: What it means for the identity verification market",
    "Socure Buys Berbix for $70M to Fortify Identity Verification",
    "Socure Acquires ID Verification Company Berbix for $70 Million",
    "Redpanda raises $100M as streaming data demand grows",
    "Redpanda Raises $100M in Series C Funding",
    "Redpanda lands $100M to expand its streaming data pipelines",
    "Weird rebranding for Firefox [embedded post]",
    "NoTraffic closes on $50M funding round to accelerate smart traffic management",
    "NoTraffic Raises $50 Million For Its AI Powered Traffic Monitoring Platform",
    "Israeli mobility platform NoTraffic raises $50m",
    "Can AI help reduce traffic jams? NoTraffic raises $50M to outfit roads with smart sensors",
    "Meet the robots attending the UN's ‘AI for Good Global’ summit",
    "Amazon's AI-powered robots to revolutionise warehouse automation",
    "How Amazon deploys collaborative robots in its operations to benefit employees and customers",
    "Stories Are Headed to Telegram, but With Their Own Kind of Twist",
    "Telegram will introduce Stories in July, it's official",
    "Telegram Stories with customizable expiration times are coming next month",
    "Telegram announces Stories with lifespan from 6 hours",
    "Telegram CEO Pavel Durov confirms Stories are coming to the messaging app next month",
    "Telegram Stories feature is coming in July 2023: Here's the first look",
    "Telegram will get Stories feature before Samsung's Unpacked event",
    "Telegram is soon getting its own version of Stories: Check details inside",
    "Telegram gets new feature ‘Stories’; Arriving in early July",
    "First pushback against EU's Digital Services Act and it's not Google",
    "Legal battle erupts over EU's groundbreaking digital rules",
    "Zalando Takes the EU to Court Over Its New Digital Rules",
    "Zalando sues EU Commission over landmark online content rules",
    "Twitter's new TikTok copycat is filled with animal cruelty videos. Elon calls content “Edgy”",
    "Just swipe up to see the next video",
    "Stability AI's head of research quits",
    "Jack Dorsey Questions Apple's Tim Cook Over Bitcoin Support as Damus Deplatforming Looms",
    "Decentralized Twitter rival Damus will be removed from the App Store over Bitcoin tipping",
    "Jack Dorsey to Tim Cook: 'Why Doesn't Apple Pay Support Bitcoin'",
    "Twitter Founder Questions Why Apple Pay Doesn't Support Bitcoin",
    "Decentralised social network Damus to be kicked from App Store",
    "Apple Boots Out Jack Dorsey-Backed Damus From App Store Over Bitcoin Tipping Feature",
    "Bitcoin Tipping Service Damus Gets Booted From Apple App Store",
    "Damus Zaps vs. the App Store",
    "Tips aren't unlocking content, @Apple https://twitter.com/...",
    "Why doesn't Apple Pay support bitcoin @tim_cook? https://twitter.com/...",
    "Apple must be stopped. https://twitter.com/...",
    "This is why I prefer web apps! We need decentralization!! https://twitter.com/...",
    "App Store policies becoming too aggressive?",
    "Decentralized Twitter rival Damus removed from Apple Store for allowing Crypto tipping.",
    "New Irish law might make data protection procedures confidential",
    "‘Last minute’ law change bid to ‘muzzle’ critics of Data Protection Commission - ICCL",
    "Irish Gov makes critizising Big Tech and Irish DPC a crime!",
    "Irish Council for Civil Liberties",
    "Last-minute Government amendment seeks to muzzle DPC critics",
    "ICCL says “last minute” amendments to bill aim to “muzzle” critics of DPC",
    "ICCL accuses government of seeking to ‘muzzle’ DPC critics",
    "Irish Government Accused of Trying to Muzzle Privacy Critics",
    "Irish government criticized over proposed law-change that would ‘muzzle’ Big Tech critics",
    "Irish Gov Makes Critizising Big Tech and Irish DPC a Crime"
]