[
    "Joint Cybersecurity Advisory",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection",
    "Chinese hackers targeting critical US infrastructure, says Microsoft",
    "Microsoft says China installed malware in US systems in Guam",
    "Microsoft says China-backed hacker targeted critical infrastructure in Guam, U.S.",
    "Microsoft Catches Chinese .Gov Hackers in Guam Critical Infrastructure Orgs",
    "https://www.reuters.com/... - interesting response from the Kenyan Govenrment as well: [image]",
    "iOS 17 will reportedly turn your locked iPhone into a smart display",
    "iOS 17 to Include Dedicated Journaling App and Mood Tracking",
    "Apple iOS 17 might turn your iPhone into a smart display",
    "Apple Plans New Smart Home Style iPhone Interface",
    "iOS 17 will turn locked iPhones into smart home-style displays, report says",
    "Apple rumored to adopt another Pixel feature on iPhones",
    "iOS 17 rumored to turn an iPhone lock screen into a smart home display",
    "iOS 17 could turn your iPhone into a smart home display of sorts",
    "Apple might add a smart display-like iPhone lock screen in iOS 17",
    "iOS 17 will make iPhone always-on display more functional with smart display feature",
    "iOS 17 Will Turn Your iPhone Lock Screen Into a Smart Home Display",
    "iOS 17 might add smart home display mode to iPhone",
    "iOS 17 to feature new smart display mode, improvements to SharePlay and AirPlay",
    "Apple's iOS 17 to turn locked iPhones into smart displays",
    "Your iPhone could steal this Pixel Tablet feature when it gets iOS 17",
    "iOS 17 will reportedly turn your iPhone into a smart display when it's locked",
    "iOS 17 Lock Screen to Turn iPhone Into Smart Home Display [Report]",
    "iOS 17 to Transform iPhone Lockscreens, Says Report",
    "HealthcareInfoSecurity.com",
    "U.S. Department of the Treasury",
    "Treasury Targets DPRK Malicious Cyber and Illicit IT Worker Activities",
    "US Treasury sanctions four North Korean entities engaged in malicious cyber activities",
    "N. Korean Lazarus Group Targets Microsoft IIS Servers to Deploy Espionage Malware",
    "US sanctions North Korean operatives, reveals DPRK's exploitation of remote IT workers",
    "US Sanctions North Korean Entities for Sending Regime Funds",
    "US sanctions four North Korean entities for global cyberattacks",
    "US Sanctions North Korean University for Training Hackers",
    "US government targets North Korea's illicit IT workforce with new sanctions",
    "US Sanctions North Korean Entities Training Expat IT Workers in Russia, China and Laos",
    "US Sanctions N. Korean Entities for Sending Funds to Regime",
    "US bans North Korean outsourcer and its feisty freelancers",
    "US imposes sanctions on four N. Korean organizations, one individual for illegal cyber activities",
    "Treasury sanctions cyber actors tied to North Korea",
    "@rodhilton@mastodon.social",
    "Twitter Is a Far-Right Social Network",
    "Elon Musk Wants to Challenge Google and Microsoft in AI",
    "How to Listen to DeSantis's Presidential Announcement With Elon Musk on Twitter",
    "How Elon Musk turned Twitter into a big nest for the right wing",
    "Ron DeSantis is playing with fire launching a presidential bid alongside Elon Musk",
    "Ron DeSantis's Twitter Launch Signals the Culture-War Campaign to Come",
    "On DeSantis' Big Day, Twitter Gets Picked Apart",
    "Elon Musk Is Going to Try to Make Ron DeSantis Cool",
    "With DeSantis campaign event, Musk seeks to shore up a sinking Twitter",
    "Ron DeSantis to Join Elon Musk on Twitter Wednesday to Announce 2024 Run",
    "Musk's Twitter tries to recapture the political spotlight post Trump with DeSantis 2024 run",
    "Explainer: What is Twitter Spaces where DeSantis will announce his presidential run?",
    "Breaking: DeSantis To Declare Presidential Bid In A Twitter Space With Elon Musk | Coingape",
    "Elon Musk will launch Ron DeSantis' presidential campaign on Twitter Spaces",
    "@GossiTheDog@cyberplace.social",
    "All Microsoft Surface Pro X Cameras Stopped Working Tuesday",
    "Is your Microsoft Surface Pro X camera not working? Here's the fix",
    "Surface Pro X Owners Are Currently Unable to Use Their Cameras",
    "Microsoft Surface Pro X Cameras Stop Working, Temporary Fix Found",
    "Several users reporting that camera has stopped working on Microsoft Surface Pro X",
    "Surface Pro X cameras aren't working — here's what we know so far",
    "Surface Pro X cameras have suddenly stopped working",
    "Microsoft Update Wipes Out Cameras On Surface Pro X",
    "Microsoft Surface Pro X Cameras Have Stopped Working",
    "Surface Pro X owners report cameras suddenly stopped working",
    "The cameras on Microsoft's Surface Pro X have ceased functioning for all users",
    "China hawks are coming for Shein",
    "TikTok CEO updates on Project Texas, says US user data will be in Oracle's hands soon",
    "TikTok's Answer to Security Concerns? Grant Oracle Full Source Code Access",
    "TikTok Sues Montana After Statewide Ban",
    "TikTok Responds to Montana Ban With a Lawsuit",
    "The Exclusive College Club Training Student Influencers",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "TikTok Fights Back: Sues Montana Over Controversial App Ban",
    "TikTok Giving Oracle Code Access Amid Security Concerns",
    "Now TikTok Sues To Stop Montana's TikTok Ban",
    "TikTok CEO says ‘we will prevail’ against Montana ban",
    "Montana's attempt to ban TikTok is facing multiple legal challenges",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "International Business Times",
    "Meta is laying off employees for the third time in less than three months",
    "Meta has started its latest round of layoffs, focusing on business groups",
    "Facebook owner Meta begins final round of mass layoffs",
    "Meta Announces Layoffs on Business Teams",
    "Silicon Valley Business Journal",
    "Meta has begun a new set of cuts as part of its 10,000-person layoff",
    "Meta conducts yet another round of layoffs",
    "Report: Meta Begins Last Round of Planned Layoffs",
    "Meta Lays Off Another 5000 Staff In ‘Final’ Major Wave, Including From AR/VR Division",
    "Meta just laid off a bunch of employees right before its big VR showcase",
    "Meta's business groups cut in latest round of layoffs",
    "Meta Completes Another Round of Layoffs in its ‘Year of Efficiency’",
    "Meta Begins Its Next Round of Mass Layoffs",
    "Meta laid off 6,000 employees to save “billion dollars”",
    "Around 490 jobs to go at Meta Ireland",
    "Facebook's Meta starts its third-round of layoffs to eliminate 10,000 jobs",
    "Meta Ireland to lose 490 workers as part of global layoffs",
    "Meta reduces workforce by 6,000 in latest round of layoffs",
    "Year of Inefficiency: Meta is laying off employees, again...",
    "Meta begins third round of layoffs",
    "Fears for Irish jobs in Meta's latest round of layoffs",
    "Meta Layoffs: Partnerships And Marketing Divisions To Be Hit Hard, Report Says",
    "Embracer's shares plummet after $2bn partnership deal evaporates",
    "Embracer loses $2 billion deal, shares plummet",
    "Embracer shares have nosedived after the collapse of a $2 billion deal",
    "$2 billion partnership deal falls through for Embracer Group",
    "Embracer shares plummets after huge partnership falls through",
    "What It Looks Like When A $2 Billion Gaming Deal Collapses Overnight",
    "Embracer Group Cuts Earnings Forecast After $2 Billion Deal Falls Through",
    "Embracer shares plummet after proposed $2bn partnership collapses",
    "Embracer Group Stock Crashes Following Cancellation of Transformative $2 Billion Deal",
    "Embracer Group Loses Undisclosed $2 Billion Deal Amid “Challenging Year”",
    "Embracer cuts forecast after collapse of “groundbreaking” $2 billion partnership deal",
    "Embracer Group Stock Drops 40% After $2 Billion Mystery Deal Self-Destructs",
    "Embracer loses out on $2bn deal at the eleventh-hour",
    "Oh sheeeeeeesh I'd hoped Embracer would actually ship games... https://twitter.com/...",
    "ghosted for 2 bil lmao https://twitter.com/...",
    "US lawmaker demands action against Chinese chip firm CXMT after Micron",
    "US mulls retaliation for China blacklisting Micron without evidence of security threat",
    "Nvidia chief warns US-China chip war could hurt American chipmakers",
    "DeSantis's 2024 Campaign Announcement Shows Twitter's Move to the Right",
    "Nvidia CEO warns US of dangers surrounding Chinese chip war",
    "S. Korea asks US to give more leeway on chip expansion in China",
    "South Korea warns US could ‘overburden’ its chipmakers with China limits",
    "Skepticism Rises Over AWS's AI Strategy",
    "Public cloud providers play an integral part in business strategic planning by providing access …",
    "AWS doubles size of first AI accelerator cohort after flurry of interest",
    "Bill Gates lays AI tombstone on Amazon and Google",
    "Amazon's Answer To ChatGPT Seen as Incomplete",
    "EU court rejects Meta challenge against EU antitrust requests for information",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "Meta's antitrust challenge rejected by EU court",
    "Meta loses court battle with European Commission over request to hand over documents",
    "Facebook-owner Meta must hand over data to European regulators in anti-competitive probe",
    "META LOSES ITS FIGHT OVER EU'S HUNT FOR ANTITRUST PROBE EVIDENCE.",
    "Bad week for surveillance capitalism. fka Facebook. https://www.bloomberg.com/...",
    "digital nomads still thriving, homogenizing the world https://restofworld.org/... [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "The Electric Sea: An AI-generated experiment",
    "PlayStation Showcase 2023 | [ENGLISH]",
    "Sony's PlayStation VR2 Headset Sold 600,000 Units in Six Weeks",
    "9 Things We Just Learned About Sony's Big Playstation Plans",
    "Sony Reveals Surprising PlayStation VR2 Sales For PS5 And Exciting Games Lineup",
    "The massive hour-long 2023 summer PlayStation Showcase starts now!",
    "Join us right here for the May 2023 PlayStation Showcase stream!",
    "Sony says the PlayStation VR2 sold 600,000 units in the first six weeks and I'm shocked",
    "Live: Watch the PlayStation Showcase Livestream Right Here",
    "PSVR2 launch sales significantly outpace PSVR despite $549 price tag",
    "Sony claims its PS VR2 sales are actually surpassing those of the first PS VR headset",
    "Sony claims PSVR 2 is selling okay, actually",
    "The PlayStation VR 2 Sold Better At Launch Than Original PSVR",
    "Sony says the PSVR 2 outsold its predecessor during first 6 weeks after launch",
    "How to watch Sony's 2023 PlayStation Showcase",
    "PS VR2 sales surpass expectations, Sony confirms",
    "Is The PSVR2 Doing “Better” Than The Original?",
    "PSVR 2 sold just shy of 600,000 units in six weeks",
    "Sony says it sold 600,000 PS VR 2 units in six weeks",
    "PSVR 2 Outsold Original PSVR in First 6 Weeks, Sony Confirms",
    "The PlayStation VR2 outsold the original PlayStation VR during its first six weeks",
    "PS VR2's launch sales surpass original headset, Sony says",
    "PSVR2 Sales at 600,000 Six Weeks After Launch, Sony Confirms",
    "Sony Prepares ‘Aggressive’ Cloud Gaming Push in Coming Months",
    "PlayStation VR2 Has Strong Launch Despite Reports, Outselling Original PSVR",
    "Sony claims PS VR2 sales are ahead of projections and is outselling original headset",
    "PlayStation VR2 Has Sold Almost 600,000 Units Since Launch",
    "Sony Confirms PSVR 2 Sold 600k Units Up To April, Outpacing Original PSVR Launch",
    "PlayStation is betting big on new franchises and live service games",
    "Montenegro Court Says Terra Founder Do Kwon Should Remain in Jail",
    "Fallen crypto titan Do Kwon to stay in Montenegro jail after bail revoked: Report",
    "Terra Founder Do Kwon Back in Jail in Montenegro, Bail Revoked",
    "Montenegro High Court Says No Bail for Terra's Do Kwon in Fake Passport Case: Bloomberg",
    "Montenegro court scraps bail for crypto entrepreneur Do Kwon",
    "Do Kwon's bail revoked by Montenegro court: Bloomberg",
    "Cryptocurrency founder Do Kwon's release revoked by Montenegro high court",
    "Terraform Labs CEO Do Kwon Denied Bail by Montenegrin High Court; Extradition Requests Loom",
    "Do Kwon's Bail Hopes Dashed By Montenegro High Court",
    "Do Kwon's Bail Revoked; Terra Execs to Stay in Jail in Montenegro: Bloomberg",
    "Montenegrin high court revokes bail for Do Kwon and former CFO",
    "Higher court in Montenegro overturns bail request for Terra's Do Kwon",
    "Crypto Giant Do Kwon's Legal Woes Continue, Bail Revoked In Montenegro",
    "Terraform Labs' Do Kwon's Bail Revoked in Montenegro Court: Bloomberg",
    "Breaking: Do Kwon's $473K Bail Scrapped, To Remain Behind Bars",
    "Terra's Do Kwon Faces Bail Revocation in Montenegro",
    "Montenegrin court revokes Do Kwon's bail",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/24 - Microsoft Build Wrapup",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Wall Street Thinks Microsoft's Activision Deal Faces Long Odds. This Analyst Is Upbeat.",
    "Microsoft to lodge appeal again UK regulator's block of Activision deal: report",
    "Microsoft to lodge appeal against UK regulator's block of Activision deal - Sky News",
    "Microsoft officially files appeal of the UK CMA ruling against the Activision Blizzard deal",
    "Microsoft files appeal against UK decision to block its Activision Blizzard deal",
    "NVIDIA GeForce RTX 4060 Ti drops €20 below MSRP in Germany, just four hours after launch",
    "AMD Introduces AMD Radeon RX 7600 Graphics Card for Superb, Next-Gen 1080p Gaming",
    "AMD announces $269 Radeon RX 7600 RDNA3 graphics card",
    "The RTX 4060 Ti shows the hard limits of Nvidia's Frame Generation technology",
    "RX 7600 Full Specs Leaked: Up to 2,625 MHz at 165W, Listed For Over $300",
    "AMD's new $269 Radeon RX 7600 GPU targets the 1080p ‘sweet spot’",
    "AMD releases the Radeon RX 7600, undercutting Nvidia's RTX 4060",
    "AMD Radeon RX 7600 Challenges RTX 4060 Ti For Budget GPU Dominance",
    "AMD Radeon RX 7600 review: Another water-treading midrange GPU for $269",
    "AMD Radeon RX 7600 Review: A Good 1080p Gaming Value, With Caveats",
    "NVIDIA GeForce RTX 4060 Ti 8 GB Graphics Card Is Now Available For $399, Here's Where To Buy",
    "AMD Radeon RX 7600 Vs RTX 4060 Ti: Which Should You Buy?",
    "AMD's $270 RX 7600 will go head-to-head with Nvidia's RTX 4060",
    "AMD's RX 7600 graphics card promises smooth 1080p gaming for lower $269 price",
    "AMD Radeon RX 7600: a major gift for gamers on a budget",
    "Where to buy the Nvidia RTX 4060 Ti",
    "AMD Radeon RX 7600 to undercut NVIDIA GeForce RTX 4060 with European and US pricing",
    "The $399 RTX 4060 Ti 8GB Review - A decent buy for 1080p",
    "Nvidia GeForce RTX 4060 Ti Founders Edition review: gunning for GTX",
    "More Big Money For AI: Insider Raises $105M",
    "Turkish AI-Powered Marketing Platform Insider Raises $105 Million to Fuel M&A Strategy",
    "OpenAI Beats Elon Musk to Market: AI Humanoid Robots Are Already Taking Your Jobs",
    "AI robotics firm Figure raises $70M to build robots with a human form",
    "Figure announces $70M Series A to support commercialization of Figure 01 humanoid robot",
    "AI startup Figure raises $70 million to build humanoid robots",
    "Figure Raises $70 Million to ‘Deploy Humanoids Into the Workforce’",
    "U.S. startup Figure raises $70 million to make a humanoid robot",
    "AI startup Figure raises $70M to build autonomous humanoid robots; now valued at $400 million",
    "Figure raises $70M to commercialize humanoids",
    "AI Startup Figure Raises $70 Million for Humanoid Robot",
    "Figure Raises $70M in Series A Funding",
    "OpenAI-backed robot startup beats Elon Musk's Tesla, deploys AI-enabled robots in real world",
    "Xiaomi reports an 18.9% drop in quarterly revenue",
    "Xiaomi Q1 2023 Report Reveals Leading Smartphone Market Took Hit on Poor Product Sales",
    "Xiaomi Q1 revenue falls 18.9%, net income up 13.1%",
    "Xiaomi expands AI-related user scenarios with large-scale model team",
    "Logitech tries to fix hotdesking headaches with $699 Logi Dock Flex",
    "Logitech Introduces Smart Scheduling Logi Dock Flex To Ease Hotdesking Headaches",
    "The Logi Dock Flex Is Designed To Entice Workers Back To The Office",
    "Logitech Launches Desk Booking Service for Enhanced Hotdesking Experience",
    "Logitech G Pro X 2 Lightspeed review: You'll really hear the difference",
    "Logitech's Pro X 2 gaming headset promises longer battery life",
    "Logitech's new G Pro X 2 gaming headset has graphene audio drivers",
    "Encoding of speech in convolutional layers and the brain stem based on language experience",
    "Alibaba Cloud is allegedly cutting 7% of its workforce",
    "Alibaba Cloud to cut 7 per cent of staff ahead of planned IPO",
    "Alibaba's Cloud arm plans workforce reduction of 7% in overhaul: Report",
    "Alibaba to cut 7% of cloud unit workforce in preparation for separate IPO",
    "Alibaba's Cloud Arm to Cut 7% of Staff in Overhaul, Sources Say",
    "Alibaba Cloud to Downsize Headcount by 7%, with Layoff Signaling Beginning of Its Spinoff Process",
    "Alibaba to cut 7% of workforce in its cloud unit as it pursues IPO for the division",
    "Alibaba Cloud is laying off 7% of its workforce",
    "Alibaba to lay off 7% of workforce in its cloud division ahead of the unit IPO",
    "The AlleyWatch Startup Daily Funding Report: 5/24/2023",
    "Bank Platform OpenFin Raises $35 Million Series D",
    "OpenFin Raises $35M in Series D Funding",
    "Bank of America leads $35 million round in OpenFin",
    "Center for Democracy and Technology",
    "Lost in Translation: Large Language Models in Non-English Content Analysis",
    "Chinese Businesses Fueling the Fentanyl Epidemic Receive Tens of Millions in Crypto Payments",
    "Crypto and the Opioid Crisis: What Blockchain Analysis Reveals About Global Fentanyl Sales",
    "Bitcoin and tether accepted by Chinese fentanyl chemical vendors",
    "Crypto payments to China chemical suppliers fuel US fentanyl epidemic",
    "Suspected fentanyl chemical suppliers have received $38 mln in crypto -Chainalysis",
    "Crypto Cartels: Chinese firms receive millions in Bitcoin for fentanyl precursor",
    "Crypto's Fentanyl Trade Worth Tens of Millions: Security Researchers",
    "China firms have earned millions in crypto for supplying fentanyl substances",
    "Chinese Companies Selling Fentanyl Received More Than $27 Million In Crypto Payments: Report",
    "Chinese companies selling synthetic opioid chemicals raked in $27M in crypto payments",
    "Windows 11 getting native support for 7-Zip, RAR, and GZ archives",
    "Ahoy, matey! Windows 11 will soon have native RAR support",
    "Don't pay for WinRAR! Windows 11 will soon support RAR files",
    "Microsoft finally listens to its users by adding this missing Windows 11 feature",
    "Microsoft finally gets around to supporting rar, gz and tar files in Windows",
    "Windows 11 Is Getting Native RAR, 7-ZIP, TAR, GZ File Compression Support",
    "Adios, WinRAR: Windows 11 is getting native RAR archive support",
    "Windows 11 will soon extract RAR, 7z and other archive formats natively",
    "Microsoft uses open source to kill WinRAR by adding native .rar support to Windows 11",
    "Opening RAR files natively in Windows 11 is coming and people online are going crazy over it",
    "Thanks for everything, WinRAR: Windows is finally getting native RAR support",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix tests its staying power with global password crackdown",
    "Netflix's Password-Sharing Crackdown Starts in the US and Other Big Markets",
    "Netflix's password crackdown has started in the U.S.",
    "Netflix Is Not Messing Around, Restricts Account Sharing to 2 Extra People",
    "Netflix Launches Paid Sharing in U.S., Will Start Blocking Users With Unauthorized Passwords",
    "Netflix cracks down password-sharing in Malaysia: extra user slot costs RM13 per month",
    "Netflix expands controversial password sharing crackdown in Europe",
    "Netflix's password-sharing crackdown has come to Ireland",
    "Netflix Begins Crackdown on Password Sharing in US and UK",
    "Netflix's Password Sharing Crackdown Is Now Live In The US, Here's What It Costs",
    "Netflix's crackdown on password sharing expands to the US",
    "Netflix extends password sharing crackdown",
    "Netflix's password sharing crackdown has arrived in the US and another 100-odd countries",
    "Netflix will start charging US customers for sharing account passwords",
    "Netflix's global password crackdown is off to a terrible start",
    "Netflix Launches Paid Account Sharing in the US, Will Start Blocking Unauthorized Accounts",
    "Netflix begins password sharing crackdown in the US, UK, and other regions",
    "The Netflix password sharing crackdown is here. Check your inbox.",
    "Netflix's password-sharing crackdown is here: How much it'll cost you now",
    "It's time: Netflix's account sharing fee is now live in the US for $7.99 a month per user",
    "Adding Extra Members to Your Netflix Account Costs $8 a Pop",
    "Sharing a Netflix password will now cost $7.99 a month per additional user",
    "Netflix password sharing crackdown finally hits the United States",
    "Want to share your Netflix account? That'll be an extra $8",
    "Netflix expands password-sharing crackdown worldwide",
    "Pay up!  Netflix begins account sharing crackdown in the U.S.",
    "The Netflix crackdown on password sharing in the US has arrived",
    "Netflix reveals cost of adding members in password-sharing crackdown",
    "Netflix finally brings its password-sharing crackdown to the US, its biggest market",
    "Netflix Announces Extra Member Tier as First Step of U.S. Password-Sharing Crackdown",
    "The free ride is over. https://about.netflix.com/...",
    "Kane and Pia Muehlenbeck on YouTube",
    "Final Cut Pro for iPad reviews roundup: Great touch experience but with limited features",
    "Hands On With Apple's New Final Cut Pro for iPad",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "Apple releases Final Cut Pro and Logic Pro for iPad",
    "First Impressions: Final Cut Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad are here",
    "Final Cut Pro and Logic Pro are finally available on your iPad - here's how to get them",
    "Final Cut Pro on iPad Feels Like a Great and Optional Upgrade",
    "Final Cut Pro and Logic Pro for iPad now available on the App Store",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Apple Brings Final Cut Pro And Logic Pro To iPad",
    "Final Cut Pro For iPad 1st Review: Smooth, Fast And Affordable",
    "The biggest features missing from Final Cut Pro for iPad at launch",
    "Final Cut Pro iPad hands-on - one of Apple's best multi-touch apps on iPad",
    "How to Fix Can't Add Phone Number to iMessage on iPad",
    "Final Cut Pro for iPad: Release date, features, compatibility, price",
    "Get creative: Final Cut Pro and Logic Pro launch for iPad",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Final Cut Pro for iPad Now Available",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "No subscriptions in Final Cut Pro and Logic Pro for Mac following iPad versions.  Yet...",
    "Apple has officially released Final Cut Pro and Logic Pro for iPad",
    "Apple Updates Final Cut Pro and Logic Pro for Mac to Support New iPad Apps",
    "FINAL CUT PRO FOR IPAD - First impressions for travel vlogging",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "Final Cut Pro for iPad is finally here - and its secret weapon is the Apple Pencil",
    "Final Cut Pro on iPad is a game changer for content creators — here's why",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro on iPad: Effortless Editing",
    "Apple Final Cut for iPad Review: Lots Here, But Some Things Still Missing",
    "Final Cut Pro on iPad is AMAZING - Hands on Review!",
    "Oh nooo, my beloved Markers are not in FCP for iPad 🥲",
    "@johnvoorhees@mastodon.macstories.net",
    "Final Cut Pro on iPad is working properly now and is glorious. [image]",
    "Welcoming AI to the Microsoft Store on Windows",
    "AI Driven Hub Added to Microsoft Store",
    "How to use the AI features in Microsoft Store on Windows",
    "This is how you do it now: Microsoft adds AI-generated review summaries to Store apps",
    "Microsoft opens the door to allow more Android apps on Windows 11",
    "Build 2023: Microsoft Store Adds AI Hub and AI Summaries to Showcase AI Apps",
    "Microsoft Store hones in on AI in Windows with new section and AI-generated reviews",
    "Microsoft Store gets AI-generated review summaries, keywords and a dedicated AI Hub",
    "AI is headed to the Microsoft Store on Windows",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "Apple Unveils Multibillion-Dollar Strategic Partnership With Broadcom",
    "Apple partners with Broadcom for USA-made components",
    "Apple agrees multibillion-dollar deal with Broadcom for USA-made 5G components",
    "Apple, Broadcom enter deal for US-made components",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple partners with Broadcom for developing 5G components: Check details",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple secures supply of 5G components as it signs new multibillion-dollar deal with Broadcom",
    "Apple enters multibillion-dollar mobile chip deal with Broadcom",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple Extends Broadcom Pact With Multibillion-Dollar 5G Deal",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO"
]