[
    "International Business Times",
    "Montana becomes first US state to ban TikTok",
    "Montana Governor Signs Total Ban of TikTok in the State",
    "TikTok is now banned in Montana",
    "Montana Bans TikTok: What Does This Mean For Individual Users?",
    "TikTok: Montana to become first US state to ban app on personal devices",
    "Montana will offically ban the use of TikTok for all its citizens starting January 1, 2024",
    "Montana legislature passes TikTok ban (Update: Ban is now law)",
    "TikTok faces first US state ban in Montana",
    "Montana's TikTok ban is unconstitutional and makes no sense",
    "Montana governor bans TikTok. But can the state enforce the law?",
    "Montana Becomes First State to Ban TikTok, Setting Up Legal Test",
    "Montana becomes first state to ban TikTok after governor signs bill into law",
    "TikTok ban: all the news on attempts to ban the video platform",
    "Montana becomes first state to ban TikTok, but court challenges are likely",
    "TikTok Ban Signed Into Montana Law By Governor, Challenges Loom From App's Defenders",
    "Montana Becomes First State to Ban TikTok, App Maker Says It Will ‘Defend the Rights of Our Users’",
    "Montana first U.S. state to ban TikTok",
    "Montana Becomes the First US State to Issue a Full Ban on TikTok",
    "TikTok has been banned in Montana, but chances of the law surviving are slim",
    "Montana governor bans TikTok",
    "Montana becomes first state to ban TikTok",
    "Montana just banned TikTok",
    "TikTok faces outright ban in first U.S. state",
    "Montana becomes first US state to fully ban TikTok",
    "Montana's governor signs bill banning TikTok",
    "Montana Governor Signs TikTok Ban Into Law",
    "First US state officially bans TikTok, $10,000 fine per violation",
    "Montana Is The First State To Fully Ban TikTok",
    "Montana bans TikTok for all residents",
    "Is the US banning TikTok? Montana governor signs bill to ban app",
    "State OKs Total TikTok Ban",
    "Montana governor signs ban on second trimester abortion procedure",
    "Seriously though- this is absurd: https://www.nytimes.com/...",
    "Way to waste everyone's time with dumb stunt politics, Montana. https://www.nytimes.com/...",
    "is this in any way enforceable - or just pure GOP theatre? https://www.nytimes.com/...",
    "Montana Blocks TikTok in First Statewide Ban",
    "Montana to become first US state to ban TikTok",
    "Tether Says It Will Buy Bitcoin for Stablecoin Reserves Using Realized Profits",
    "Tether Pledges to Plow 15% of Profits into Bitcoin",
    "Tether Commits to Buying Bitcoin ($BTC) Using 15% of Net Realized Profits",
    "Tether To Invest 15% Of Its Net Monthly Profits in Bitcoin",
    "Tether's Latest Investment Strategy: Make Profits, Buy Bitcoin",
    "Tether Bets On Bitcoin: Allocates Up To 15% Of Profits For BTC Purchases",
    "Billions of Dollars To Flow Into Bitcoin As Tether Announces Up to 15% of Profits Will Go to BTC",
    "Tether to Use 15% of Profits to Grow Bitcoin Holdings",
    "USDT Issuer Tether to Enhance Reserves via Regular Bitcoin Purchase",
    "Tether shifts investment focus to Bitcoin",
    "Best Crypto to Buy Now 17 May - Conflux, Render, Litecoin",
    "Stablecoin Issuer Tether Reveals Plan to Allocate Profits Into Bitcoin",
    "Tether uses Bitcoin to strengthen its reserves",
    "Tether Bought $1.5 Billion Bitcoin, Will Buy More",
    "Tether to Purchase Bitcoin as Part of Reserves Strategy Shift",
    "Tether bets big on Bitcoin plans to invest up to 15% of profits in BTC",
    "New survey says Bitcoin is safer than the US dollar — Watch The Market Report",
    "Tether USDT to strengthen reserves with Bitcoin purchase",
    "Breaking: Tether To Invest Monthly Net Profit Into Bitcoin",
    "Tether Reveals Strategy to Invest up to 15% of Profits in Bitcoin",
    "Tether buys bitcoin with a portion of its net profit to back USDT stablecoin",
    "Tether Will Buy Bitcoin: Allocating 15% of Net Realized Operating Profits Regularly in BTC",
    "Tether to Allocate up to 15% of its Profits Towards Purchasing Bitcoin",
    "This will end well https://twitter.com/...",
    "Logitech Repair  —  Broken Gear?  We've Got the Fix.  —  Click your device's model to find …",
    "Logitech Partners with iFixit to Advance Circularity Goals",
    "iFixit to Offer Genuine Parts, Repair Guides for Logitech Devices",
    "Logitech, iFixit to offer parts to stop folks binning their computer mouse",
    "Logitech taps iFixit to sell mouse parts for DIY repairs",
    "Logitech Partners with iFixit to Improve Repairability and Address E-Waste Challenge",
    "Logitech Teams Up With iFixit To Support User Repairs",
    "Logitech Teams Up With iFixit to Offer Mouse Self-Repair Kits",
    "Logitech partners with iFixit for self repairs, pointing to high global e-waste levels",
    "Logitech partners with iFixit to let you repair your own mouse",
    "Logitech and iFixit team up to let you officially replace your MX Master battery and more",
    "Logitech partners with iFixit to offer spare parts and repair guides",
    "Logitech teams up with iFixit to help you repair broken peripherals",
    "Logitech joins the growing list of companies with self-repair programs",
    "Logitech partners with iFixit to enable more DIY repairs",
    "Logitech doesn't want you to buy new mice, it wants you to fix the one you have",
    "Logitech Teams With iFixIt On Self-Repair Program For These 11 Mouse Models",
    "Logitech and iFixit partner to reduce e-waste",
    "How U.S. adults on Twitter use the site in the Elon Musk era",
    "Pew: 60% of U.S. Twitter users have ‘taken a break’ from the platform in the past year",
    "Twitter's top users are posting less since Musk takeover last year, Pew Survey shows",
    "New Study Shows that 25% of Twitter Users Don't Expect to Still be Using Twitter in 12 Months Time",
    "US adults are spending less time on Twitter since Elon Musk took over",
    "Majority of U.S. Twitter users took a break from the platform in past year: poll",
    "Short answer: not nearly as much as before elon https://twitter.com/...",
    "Soooo Reply Guys *do* have a political leaning... https://www.pewresearch.org/ ... [image]",
    "Report: Snowflake is in advanced talks to acquire AI search startup Neeva",
    "FTC says popular fertility app gave advertisers pregnancy data without permission",
    "Fertility app fined $200,000 for leaking customer's health data",
    "FTC Fines Fertility App Vendor, Bars It From Data-Sharing",
    "FTC says fertility tracking app Premom shared sensitive health data with third parties",
    "New Relic discussing possible $5B sale to private equity firms",
    "New Relic Surges On Report Private Equity Firms Readying Bid",
    "TPG, Francisco Partners In Talks to Buy Software Firm New Relic",
    "New Relic in talks to be sold",
    "Software company New Relic in talks to be sold - WSJ",
    "SEC warns that Filecoin ‘meets definition of a security’ — Grayscale",
    "US SEC Says Filecoin Is a Security in Comment Letter to Grayscale",
    "Grayscale: SEC staff believe Filecoin ‘meets the definition of a security’",
    "SEC Believes Filecoin Is a Security, Grayscale Warns Investors",
    "SEC deems Filecoin a security, asks Grayscale to withdraw trust registration",
    "SEC clarifies Filecoin's FIL token as security, Greyscale pushes back",
    "SEC staff suggest Filecoin (FIL) is a security: Grayscale",
    "“might be”...?? come on in and register to queue up for a Wells notice https://twitter.com/...",
    "Failed Crypto Broker Voyager Digital Cleared to Start Repaying Customers' Frozen Funds",
    "Voyager Creditors to Receive 35% of Claims in New Liquidation Plan: Report",
    "Court Approves Voyager's Plan To Payback Customers Just 35% Of Their Claims",
    "First Voyager payouts should begin by June 1, creditors' committee says",
    "Voyager Digital Customers Will Recover 35% of Their Crypto Deposits",
    "Voyager Approved to Start Repaying Frozen Customers' Accounts",
    "Voyager Digital Customers Left High And Dry With Only 35% Crypto Deposit Recovery",
    "Voyager bankruptcy plan approved, customers may recover 35.7% of claims initially",
    "Hope for investors as Voyager Digital gets green light to repay frozen funds",
    "Voyager liquidation could start Friday, customers could see cash and crypto starting June 1",
    "Turn your Pixel Smartphone Into a Dashcam with Google's Latest Update",
    "It looks like Google's working on a dashcam feature for Android phones",
    "Google might soon let you use your Pixel phone as a dashcam",
    "Your Pixel phone may replace your dash cam with this potential new feature",
    "Google wants to turn your Android phone into a dash cam",
    "Google Turning Your Pixel Phone Into a Dashcam",
    "Google wants to turn your Pixel phone into a car dashcam",
    "Google might let you use your Pixel phone as a dashcam",
    "Google could transform your Android phone into a dashcam with future update",
    "Google is working on a new feature that turns Pixel phones into dashcams",
    "Google is working on making your Android phone into a dashcam",
    "Your Google Pixel phone could soon double as a very basic dash cam",
    "Google's turning your Pixel Phone into a dashcam",
    "Google is working on a dash cam mode for Pixels, and here's how it works",
    "Google is adding the ability to use your Pixel as a dashcam",
    "Google Pixel phones may soon work as dashcams, and it makes total sense",
    "Google Could Activate Dashcam Mode on Android and Pixel Soon",
    "Surprising no one, Google will reportedly use generative AI for ads and customer service",
    "Inside GitHub: Working with the LLMs behind GitHub Copilot",
    "Meet “AI”, your new colleague: could it expose your company's secrets?",
    "What's more important for training AI — data or compute?",
    "From “you are the product” to “you are the input into a LLM” https://twitter.com/...",
    "Netflix Advertisers Clamor for Fledgling Ad Tier to Grow Faster",
    "Netflix's new ad-supported subscription plan attracts 5 million monthly users in just 6 months",
    "Netflix ad tier has five million monthly active users six months after launch",
    "Netflix 2023 Upfront Takeaways: Streamer Hits Scripted Drama Hard When TV Cannot",
    "In Virtual Upfront, Netflix Says It Has Nearly 5 Million Monthly Ad-Tier Users",
    "Netflix touts nearly 5M monthly active users for ad-supported tier",
    "Netflix ad tier now has nearly 5 mln monthly active users",
    "Netflix Says It Has 5 Million Ad-Supported Viewers, but Doesn't Reveal Subscriber Figures",
    "Netflix Says It Has 5 Million Users for Its Cheaper Plan With Ads",
    "Cisco Reports Third Quarter Earnings",
    "Projecting what the future may hold following Cisco's earnings results",
    "Cisco CEO Sees Growth From Security, Software, Generative AI",
    "Cisco Systems Reports Earnings Today. It's All About Orders.",
    "Cisco's Q3 posts strong networking gear sales, ups outlook",
    "Cisco beats quarterly revenue estimates",
    "Cisco earnings beat, but the stock is falling on concerns about declining orders",
    "How This Customer Frill Could Boost Cisco Earnings For July Quarter",
    "Meta faces record privacy fine for data transfers to the US",
    "Meta to face record EU privacy fine over Facebook data transfer to US",
    "Meta to face record EU privacy fine",
    "Meta likely to face record EU fine: report",
    "San Francisco Business Journal",
    "Ripple Takes on the Crypto Custody Market with Metaco",
    "Ripple buys crypto custody firm Metaco for $250 million",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for $250M",
    "Ripple Buys Crypto Custody Firm Metaco for $250M",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for US$250M",
    "Crypto firm Ripple buys Swiss startup as SEC crackdown forces companies to consider overseas moves",
    "Ripple Acquires Crypto Custody Firm Metaco for $250M in Tokenization Push",
    "Crypto firm Ripple acquires custody provider Metaco for $250m",
    "Latest global payments news",
    "Ripple acquires Swiss blockchain custody firm Metaco for $250M",
    "Ripple Acquires Crypto Custody Provider Metaco for $250M",
    "Ripple Spends $250,000,000 on Institutional Digital Asset Custody Firm Metaco",
    "Ripple acquires Metaco for $250M to diversify services into crypto custody",
    "Ripple Acquires Crypto Custody Firm Metaco In $250 Million Deal",
    "Ripple Buys Swiss Crypto Custodian Metaco for $250 Million",
    "Ripple Acquires Crypto Custody Provider Metaco For $250M As XRP Lawsuit Nears End-Game",
    "Ripple Acquires Swiss Crypto Custody Platform Metaco for $250M as Part of Push toward Tokenization",
    "Ripple acquires Swiss blockchain custody firm Metaco for $250 Million",
    "Why US Crypto Firm Ripple's $250M Acquisition Of This Swiss Company Matters",
    "Ripple buys controlling interest in Metaco, a digital technology company",
    "Ripple Acquires Swiss-based Digital Asset Custody Provider Metaco",
    "Ripple Acquires Metaco in $250M Crypto Custody Deal, XRP Price Surge Nearly 6%",
    "Ripple acquires crypto custody firm Metaco in $250M deal",
    "Ripple acquires Switzerland-based crypto custody startup Metaco for $250 million",
    "Ripple Buys Crypto Custody Firm Metaco for $250 Million",
    "Ripple acquires crypto custody startup Metaco for $250 million",
    "Ripple acquires crypto custodian Metaco for $250 million",
    "Ripple Labs acquires digital asset custody provider Metaco for US$250 mln",
    "San Francisco's Ripple buys Swiss crypto custody startup for $250M",
    "Ripple shells out $250 million as it acquires crypto custody firm Metaco",
    "Amazon unveils a new lineup of Echo devices—here's your first look",
    "Amazon pops out a new Echo smart speaker",
    "Amazon's 2023 Echo Show is faster and offers improved audio",
    "Amazon Launches $40 Eero-Equipped Echo Pop Speaker, $50 Echo Buds",
    "Amazon undercuts the Echo Dot with the $40 Echo Pop",
    "Amazon Echo News (2023): Echo Show 5, Echo Buds, Echo Pop",
    "Amazon's latest Echo Buds have an all-new design and much cheaper price",
    "New Amazon Echo Devices Are Up for Preorder",
    "Alexa-Enabled Device Sales Pass 500M As Amazon Unveils New and Upgraded Echo Devices",
    "Amazon Refreshes Echo Lineup With New Echo Pop, Redesigned Echo Show 5, and More",
    "Amazon expands Echo lineup with new smart speaker, earbuds, and more",
    "Amazon adds 4 products to Echo lineup: Alexa gets new speakers, displays, and earbuds",
    "Amazon launches new Echo devices, including a $40 smart speaker and inexpensive wireless earbuds",
    "Don't like Echo Dot? Amazon has two new smart speakers for you",
    "Today Amazon Introduced 4 All-New Echo Devices with multiple redesigns",
    "Amazon unveils Echo Pop, new Echo Buds; reports >500M Alexa device sales as AI upends market",
    "Amazon releases four new Echo devices & discloses over half-billion sold",
    "Amazon expands its Echo portfolio with a new speaker and a few hardware upgrades",
    "Amazon Announces New Alexa-Powered Echo Devices",
    "Amazon's new Echo Pop speaker looks cheap and cheerful at $40",
    "Amazon Echo Lineup Expands With Next-Gen Buds, Pop, And Show 5",
    "Amazon Introduces Four All-New Echo Devices",
    "A fresh batch of Amazon Echo devices is here and one of them is brand new!",
    "Amazon Unveils New Gadgets as AI Race Heats Up",
    "Amazon announces new Echo with funky design and revamped earbuds",
    "Amazon's redesigned Echo Buds are only $50",
    "Amazon unveils the $40 Echo Pop, a semi-spherical smart speaker",
    "Telcos draw up proposal to charge Big Tech for EU 5G rollout",
    "European telcos draw up proposal to charge Apple, other Big Tech firms for EU 5G rollout",
    "Network Fee Proposals Will Ultimately Hurt European Businesses and Consumers",
    "Beats Studio Buds Plus review: A worthy upgrade",
    "Beats Studio Buds Plus Review: Transparently Special",
    "Status Between 3ANC review: Great audio in a bulky package",
    "Apple's Beats launches Studio Buds Plus - and makes them transparent",
    "Beats Studio Buds+ hands-on review",
    "Beats Studio Buds + review: A little bit better in every way",
    "Beats launches $169 Studio Buds + with a transparent option",
    "First Impressions of the Beats Studio Buds +: Don't Believe the Hype",
    "The Beats Studio Buds+ deliver better ANC and a truly standout design",
    "The Beats Studio Buds + Are Apple's Best Wireless Headphones Bargain",
    "Beats Studio Buds+ debut, Project Titan theft",
    "Beats Studio Buds+ vs Beats Studio Buds: What's the difference?",
    "Beats Studio Buds+ are available to order now in Canada",
    "The Beats Studio Buds+ Are Here With Better ANC And Battery Life",
    "Beats' New Earbuds Are Inspired by Nothing's Transparent Design",
    "Apple Unveils Beats Studios Buds+",
    "Beats debuts the Studio Buds + with a transparent design and improved ANC",
    "Review roundup: New Beats Studio Buds+ win with cool clear case and audio upgrades",
    "Beats Studio Buds Plus have landed and it's clear they're a hit",
    "Beats Studio Buds+ Review: A Snug-Fitting Sweet Spot For ANC Earbuds",
    "Beats Studio Buds+ review: clearly better buds",
    "Beats Studio Buds+ review: Immersive soundscapes",
    "Beats is back with new Studio Buds Plus that are made by Apple but work with Android",
    "Beats Studio Buds+ vs Studio Buds: what's the difference?",
    "Beats Studio Buds + Review",
    "Beats Studio Buds+ now available to order with better ANC, transparent option",
    "Beats Studio Buds + Deliver Improved Performance and a Transparent Design Option for $169.99",
    "Hands-on: Beats Studio Buds+ are the transparent AirPods we wish Apple would make",
    "Can't beat Verge photography. So good. Clear all the gadgets again. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Micron poised to get $1.5 bln from Japan for next-gen chips - Bloomberg News",
    "Micron to Bring EUV Technology to Japan, Advancing Next-Generation Memory Manufacturing",
    "AWS to invest INR 1,05,600 crores (US $12.7 billion) into cloud infrastructure in India",
    "Amazon to Invest $12.7 Billion in India Cloud Services by 2030",
    "Amazon's cloud unit to invest $12.7 billion in India by 2030",
    "Amazon's AWS to invest $12 bn into India's cloud infra, confirms CEO Selipsky",
    "Amazon's cloud unit to invest $12.7 billion in India by 2030, reports say",
    "YouTube on TVs getting unskippable 30-second and pause screen ads",
    "The world watches YouTube: Highlights from Brandcast 2023",
    "YouTube Unveils 30-Second Select Spots, Pause Ads at Brandcast Event",
    "Upfronts: YouTube Adopts Non-Skippable 30-Second CTV Commercials",
    "YouTube debuts unskippable 30-second ads to target brands' TV ad dollars",
    "YouTube's Brandcast Leans on AI, the NFL and CTV",
    "YouTube Bringing Unskippable 30-Second Ads To The Living Room",
    "Turn product data into revenue without engineers",
    "The first AI navigator for your entire network",
    "ProTips: 4 reasons why integrating your CRM and sales engagement tool is crucial for sales success",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/17 - Open Source Vs. Centralized AI, Part II",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Socket Adds ChatGPT to Its Vulnerability Detection Arsenal",
    "IBM and Google commit $150M to quantum computing research",
    "A quantum computing partnership with the University of Chicago and the University of Tokyo",
    "Minnesota bill regulating Uber and Lyft advances",
    "Uber will now let teens ride in cars alone",
    "Uber is adding new features to make group rides and activities cheaper and easier to split",
    "Uber for teens will accept unaccompanied minors",
    "Here's everything Uber just announced at its annual Go/Get product event",
    "Uber to allow Canadian teens to set up ride-share accounts this summer",
    "Parents can now stalk their kids with new Uber features",
    "Uber Taps New User Base With Ride, Delivery Option For Teens",
    "Uber puts family (even teens) at the center of its new products and features",
    "Uber rolls out updates, including a way for teens to book rides",
    "You can now call an Uber like a normal taxi",
    "Uber Wants to Be Your Kids' Chauffeur",
    "You can now hail an Uber by calling a number",
    "Stability AI Releases StableStudio, the Open-Source Future of DreamStudio",
    "Stability-AI / StableStudio Public",
    "Stability AI releases StableStudio to become an open-source platform for AI",
    "Latest moves show Stability AI is fully committed to open source — well, mostly",
    "Introducing New Features to Make the Most of Your Instagram Experience",
    "Instagram users can finally comment on posts with GIFs",
    "Instagram to finally let users comment on posts using GIFs",
    "Meta Announces Coming Reels Editing Tools and India Showcase Event",
    "Instagram Now Lets Everyone Use GIFs In Comments",
    "Instagram will soon support GIF comments on posts and Reels",
    "GIFs are finally coming to Instagram comments",
    "Instagram will now allow you to respond to posts with a GIF and further edit your Reels",
    "Instagram comments can now be overrun by GIFs",
    "Commenting gets animated with GIFs on Instagram",
    "Instagram rolls out new features - gif comments, edit tools",
    "You can now comment with GIFs on Instagram, here's how",
    "Instagram will Now Let Users Post GIFs in Comments",
    "Instagram enables GIF comments on posts, Reels; previews Gifts, Reels editing, more",
    "Instagram enables the ability to comment using GIFs",
    "instagram announcing gifs in the comments section feels very 2016",
    "huge news for aunts everywhere https://twitter.com/...",
    "*checks date* Welcome to 2023 https://twitter.com/...",
    "India introduces a $2B program to boost local IT hardware production",
    "iPad production in India likely to start soon, as Apple gets tax deal",
    "India devises bumper scheme for laptop, tablet makers with four-fold jump in incentives",
    "Govt makes renewed push to boost hardware manufacturing",
    "India introduces $2B incentive package to boost IT hardware",
    "India renewed efforts to attract Mac and iPad suppliers by US$2 billion incentive",
    "India expands production incentive plan for IT products to $2 bln",
    "India launches $2 billion incentive plan to court laptop, tablet makers like Apple",
    "India Launches $2 Billion Drive To Woo Laptop Makers Like Apple",
    "China has too much invested in AI to smother its development",
    "bolttech Raises US$196M in Series B; Valued at US$1.6 Billion",
    "International insurtech bolttech valued at $1.6 billion in Series B up-round",
    "Insurtech Unicorn Bolttech Raises $196 Million, Nudging Up Valuation",
    "Insurtech Unicorn Bolttech Raises $196 Million",
    "SG insurtech unicorn bolttech raises $196m Series B round at $1.6b valuation",
    "Ministers looking at body-worn facial recognition technology for police",
    "One of the many reasons I quit my job in facial recognition. https://twitter.com/...",
    "Poll: 61% of Americans say AI threatens humanity's future",
    "Most Americans Consider AI a Threat to Humanity, New Poll Finds",
    "70% of Trump Voters Think AI Threatens Humanity, Poll Finds",
    "Most Americans Fear AI Is A Threat To Humanity And This Poll Proves It",
    "6 in 10 view AI as threat to humanity's future: poll",
    "Shein raises $2 billion at a valuation a third lower than a year ago: WSJ",
    "Shein raises $2b, valuation drops to $66b amid concerns: report",
    "Shein's Valuation Drops 34% in $2 Billion Funding Round",
    "Report: Shein Raises $2 Billion but Slashes Valuation by 1/3",
    "Fashion giant Shein raises $2 billion but lowers valuation by a third",
    "@campuscodi@mastodon.social",
    "Lancefly: Group Uses Custom Backdoor to Target Orgs in Government, Aviation, Other Sectors",
    "Sophisticated Merdoor backdoor long used in Lancefly APT attacks",
    "New APT targets South and Southeast Asia with custom-written backdoor",
    "Stealthy MerDoor malware uncovered after five years of attacks",
    "Lancefly APT uses powerful Merdoor backdoor in attacks on Asian orgs",
    "Researchers Uncover Powerful Backdoor and Custom Implant in Year-Long Cyber Campaign",
    "Lancefly APT Custom Backdoor Targets Government and Aviation Sectors",
    "Threat Actor Uses Merdoor Backdoor to Hit Asian Orgs",
    "Lancefly APT Targeting Asian Government Organizations for Years",
    "Huawei ADS 2.0: A Promising New ADAS in Market",
    "Volkswagen China Responds to Talks with Huawei Over the Use of Its Software",
    "German Volkswagen met Huawei for car software",
    "Google's new “inactive account” policy won't delete years of YouTube videos",
    "YouTube's recommendations send violent and graphic gun videos to 9-year-olds, study finds",
    "YouTube found to push content about guns to children watching games videos",
    "Okay, Google, How Are Your Fancy Math Recommendation Procedures Working? Just Great, You Say",
    "Study shows YouTube is recommending gun videos to young gamers",
    "YouTube Accused Of Pushing Violent Content To Children",
    "Disturbing Results: YouTube's Algorithm Recommends Harmful Content to Young Viewers",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "How Apple's App Store saved consumers from $2b fraud in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "Apple Boots a Half-Million Developers From Official App Store",
    "Apple blocked over $2B of fraudulent App Store transactions in 2022",
    "Apple Blocked 1.7 Million Applications From App Store in 2022",
    "Record $2 billion in fraudulent App Store transactions blocked in 2022, Apple says",
    "Apple: App Store Blocked $2+ Billion in Fraud in 2022",
    "Apple's App Store is a fortress; over $2 bn in fraudulent transactions in 2022 [details]",
    "App Store's anti-fraud measures halt more than $2 billion in 2022",
    "Apple's App Store stopped over $2 billion in fraudulent transactions last year",
    "App Store stopped over $2 billion in fraudulent transactions in 2022, Apple claims",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "@DavidNielsen@mastodon.social",
    "Apple accessibility improvements welcomed by disabled people, with more opportunities ahead",
    "Apple unveils Assistive Access, Live Speech, and more accessibility features for iPhones/iPads",
    "iPhones will be able to speak in your voice with 15 minutes of training",
    "iOS 17 Will Let You Create a Voice Sounding Like You in Just 15 Minutes",
    "Apple's 2023 Accessibility Feature Preview",
    "Apple Previews New Accessibility Features for iPhone, iPad",
    "Apple Previews Major New Accessibility Features for iOS",
    "Your iPhone will soon be able to speak with your voice",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Apple to Expand Accessibility Options in 2023",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "@viticci@mastodon.macstories.net",
    "@blakereid@mastodon.lawprofs.org",
    "@johnvoorhees@mastodon.macstories.net",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2"
]