[
    "U.S. District Court, District of Columbia",
    "Amazon's Ring used to spy on customers, FTC says in privacy settlement",
    "Ring's Response to Our Recent Settlement With the FTC",
    "FTC Orders Ring to Pay $5.8 Million in Refunds For Surveilling Customers, Failing to Stop Hackers",
    "Amazon settles FTC claims that Ring doorbell spied on users",
    "Amazon's Ring and FTC Settle Charges of Privacy Violations",
    "Amazon's Ring agrees to pay $5.8 million to settle FTC spying suit",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "Amazon gets slap on the wrist over privacy violations with Ring cameras",
    "Amazon to pay $30 million in Ring doorbell camera and Alexa settlements",
    "Ring Settles FTC Allegations of Poor Cybersecurity, Privacy",
    "FTC's Ring Settlement Shows Why Companies Don't Respect User Privacy",
    "Federal Trade Commission v. Ring LLC",
    "This no-brainer deal scores you a Ring video doorbell for just $39",
    "U.S. District Court, Western District of Washington",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "Amazon to pay $30m over Alexa and Ring privacy violations",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Federal regulators fine Amazon $25 million over child privacy issues",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "Amazon.com to pay $25 million to settle Alexa privacy lawsuit with FTC",
    "Kotick blames scandals on “a very aggressive labor movement”",
    "Activision Blizzard CEO claims widespread toxic workplace allegations are ‘mischaracterizations’",
    "Call Of Duty CEO Says Activision Never Had A ‘Systemic Issue With Harassment’",
    "Bobby Kotick Denies All Allegations Of Activision's “Systemic Issue With Harassment”",
    "Bobby Kotick blames Activision toxicity on ‘outside forces’ - but he's pro-union",
    "Activision Blizzard wanted to acquire Time Warner, says Bobby Kotick",
    "Activision CEO responds to harassment allegations, comments on labor unions",
    "Activision never had “systemic issue with harassment”, says CEO Bobby Kotick",
    "https://twitter.com/... [image]",
    "Supply Chain Risk from Gigabyte App Center Backdoor",
    "Gigabyte firmware component can be abused as a backdoor",
    "Gigabyte brought new top-tier motherboards and more to Computex 2023",
    "Gigabyte Sold Millions of Motherboards with Firmware Backdoor",
    "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
    "Gigabyte shipped hundreds of models of motherboards with a hidden firmware backdoor",
    "Organizations Warned of Backdoor Feature in Hundreds of Gigabyte Motherboards",
    "Millions of PCs could be targeted by hackers in firmware blunder",
    "Tons of Gigabyte motherboards come with a hidden firmware backdoor",
    "Definitely be aware if your mobo is on the list. https://www.wired.com/...",
    "Scream in supply chain security... https://twitter.com/...",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Apple App Commerce Climbed 29% Last Year to $1.1 Trillion",
    "Report shows the amazing strength of the global App Store ecosystem last year",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "International Business Times",
    "Fidelity marks down value of Twitter stake again",
    "Twitter value keeps falling under Musk, now worth a third of what he paid",
    "The Founders and Coaches Addressing Burnout",
    "Twitter only worth 33% of what Musk-led investors paid, Fidelity says",
    "Twitter has lost 66% of its value since Elon Musk bought it",
    "Twitter Is Now Worth a Third of What Musk Paid for It, Fidelity Says",
    "Twitter now worth just a third of what Musk paid for it",
    "Twitter's value down two-thirds since Musk takeover, says investor",
    "Twitter may be worth only a third of its pre-Musk value, Fidelity says",
    "Fidelity Values Twitter At Roughly $15 Billion—A Third Of The Sticker Price Paid By Musk",
    "Elon Musk's most controversial moments",
    "Twitter is Approving Far More Government Censorship Requests Under Elon Musk",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Report: Twitter Now Worth a Third of $44B Purchase Price",
    "Twitter may be worth one-third what Musk paid for it last fall as Fidelity marks down investment",
    "Twitter is now worth one-third what Elon Musk paid",
    "Twitter is only worth a third of what Elon Musk paid for it, major asset manager says",
    "Twitter's worth down to just $15 bn under Musk: Report",
    "Fidelity Slashes Value of Its Twitter Stake Once Again",
    "Twitter's Value Dives Again. Elon Musk's Purchase Is Looking Even Worse.",
    "Fidelity: Twitter is Now Only Worth a Third of What Elon Musk Paid for It",
    "how many D is this chess? https://www.bloomberg.com/...",
    "Yikes. This means Fidelity values Twitter around ~$15 billion [image]",
    "The idea that billionaires can run things better than anyone else is dumb https://twitter.com/...",
    "Only took seven months, too. https://www.bloomberg.com/... [image]",
    "Destroying that much value in such a short period isn't easy to do. https://twitter.com/...",
    "Elon took on $13bn of debt to buy Twitter https://twitter.com/...",
    "Twitter Extends Community Notes to Images After Pentagon Explosion Tweet",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter will now put Community Notes ‘fact checks’ on images",
    "Twitter Community Notes for images is currently in the testing stage",
    "Twitter launches Community Notes to tackle the spread of misleading media",
    "Twitter launches Community Notes for images",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter is testing Community Notes for images",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Reddit app developer says the site's new API rules will cost him $20 million a year",
    "Popular Reddit app Apollo may go out of business over Reddit's new, unaffordable API pricing",
    "Reddit might destroy third-party Reddit apps if it sticks to policy change",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "The best Reddit client app is in danger due to price demands",
    "Apollo for Reddit might shut down due to Reddit's new API pricing",
    "Reddit has it in for third-party clients ↦",
    "API Extortion Era https://twitter.com/...",
    "Magic announces $52M Strategic Funding Round led by PayPal Ventures",
    "PayPal Ventures Leads $52M Round for Crypto Firm Magic",
    "Magic Raises $52M in Strategic Funding",
    "Web3 Firm Magic Summons $52 Million With PayPal Ventures' Help",
    "PayPal Ventures invests in web3 onboarding startup Magic",
    "Crypto wallet Magic raises $52M to expand ‘wallet-as-a-service’ solution",
    "Magic raises $52m despite crypto bear market",
    "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "Web3 Infrastructure Company Magic Raises $52M in a Round Led By PayPal Ventures",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Salesforce Q1 better than expected, margins improve",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Lightmatter reels in $154M for its optical interconnect and chips",
    "Lightmatter Raises $154M in Series C Funding",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "Italy to launch €150M fund for AI startups",
    "Stories like this get my ears ringing https://twitter.com/...",
    "Europe turns to existing laws to regulate cutting-edge AI",
    "ChatGPT Risks Divide Biden Administration Over AI Rules in EU",
    "BabyLM Challenge  —  Summary: This shared task challenges community members to train …",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "CrowdStrike Reports First Quarter Fiscal Year 2024 Financial Results",
    "Bluesky vs. Nostr — Which Should Developers Care About More?",
    "Cool article about @fiatjaf, @arcbtc and the beginnings of nostr https://www.forbes.com/...",
    "U.S. Manufacturers Seek China Alternatives as Tensions Rise",
    "Armchair Warriors Are Getting Taiwan All Wrong",
    "Taiwan invasion in 2025 gaining credibility; no time for Apple and others to prepare",
    "The interactive is also beautifully produced. https://twitter.com/...",
    "Personalized wealth management, built for tech people",
    "Meta Platforms Asks Federal Court to Block FTC in Privacy Fight",
    "Binance Faces Probe By Canadian Securities Regulator",
    "Bybit Follows Binance's Footsteps, Exits Canadian Market Amid Regulatory Concerns",
    "Ah. So that's why it has barred Canadians. https://twitter.com/...",
    "Nvidia, the world's newest, AI-amped tech giant",
    "Talis Capital Holds First Close of $175M Fund III",
    "Free compensation benchmarking data from 3,000 startups",
    "What is Generative AI and how does AI improve customer experience?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Amazon Echo Pop Review: An Alexa Speaker That Looks Nice And Talks Back",
    "Amazon Echo Pop review: A portable smart speaker for small spaces",
    "Amazon Echo Pop Review: a perfectly priced Alexa",
    "Amazon Echo Pop review: The latest Echo flops rather than pops",
    "Hostaway's $175M Raise Is A Rarity In The Travel Industry",
    "PSG makes investment in Hostaway to expand its vacation-rental software amid travel rebound",
    "Hostaway raises $175M for vacation rental tech expansion",
    "Finnish founded Hostaway secures $175 million to take its vacation rental platform global",
    "Garmin unveils new Fenix 7 Pro and Epix Pro Gen 2 series watches",
    "Garmin's new epix Pro and fenix 7 Pro want to pull me away from my Apple Watch Ultra",
    "Garmin Epix 2 Pro & Fenix 7 Pro are official: here's what's new & different",
    "Epix 2 Pro: Garmin announces new smartwatches in three sizes with flashlight and improved sensors",
    "British digital bank Monzo hits monthly profitability for the first time after spike in lending",
    "UK Neobank Monzo Records First Monthly Profits",
    "Monzo Narrows Losses as Customer Numbers and Staff Costs Grow",
    "Neobanks should take heart from Monzo's performance in 2022",
    "Monzo hits monthly profitability",
    "💸 Revenues more than doubled to £356m (+130% YoY)  —  📈 Net operating income is up 88% YoY …",
    "Ireland-based fintech platform NomuPay secures €50.1M for cross-border payments; Know more",
    "NomuPay Raises $53.6M in Funding",
    "Dublin fintech NomuPay raises $53.6m for payments platform",
    "Removing the multiples, Ireland's NomuPay nomz nomz on $53.6 million",
    "Dublin-Headquartered NomuPay Raises $53.6 Million to Expand X-Border Payment Platform",
    "Unified payments platform NomuPay raises $53.6M in Series A round",
    "‘All access pass’ payments platform NomuPay raises $53.6 million",
    "Dublin-based fintech NomuPay raises €50m from backers",
    "Foxconn's Young Liu says AI demand to boost server business",
    "Foxconn Expects Growing AI Demand to Boost Its Server Business This Year",
    "Taiwan's Foxconn predicts huge growth in AI server business",
    "Apple's iPhone Maker Expects to More Than Double AI Server Sales",
    "Foxconn sees AI driving strong server demand, but full year to be flat",
    "Purdue Pharma's Bankruptcy Works Now",
    "Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges",
    "Crypto is surely dead this time... https://www.ft.com/...",
    "The Download: meet the longevity obsessives, and how China's regulating AI",
    "A new verb. https://www.reuters.com/...",
    "Get your cheap memory while growing stockpiles push prices low",
    "Block Party Resource Center",
    "Block Party's Twitter product is on indefinite hiatus as of May 31",
    "Anti-harassment service Block Party leaves Twitter amid API changes",
    "Twitter moderation is about to get much worse - and its all Elon Musk's fault",
    "Popular anti-troll tool Block Party shuts down",
    "You Do It: Twitter Outsources AI Image Detection to Its Users",
    "Product FAQ  —  Twitter Product Hiatus Why is Block Party's Twitter product on indefinite hiatus?",
    "just fell to my knees. this app has been so vital to my safety on here https://twitter.com/...",
    "Baidu to Launch $145M VC Fund for AI-focused Startups in China",
    "Baidu Launches $145 Million VC Fund to Back AI Startups",
    "Google Pixel Watch 2 May Use More Power-Efficient Qualcomm Chip",
    "Google's Pixel Watch 2 could drop Samsung's processors for better battery life",
    "Google Pixel Watch 2 rumours: Everything we have heard so far",
    "Pixel Watch 2 key specifications leaked, a more powerful chipset expected",
    "The Pixel Watch 2 will reportedly get a significant upgrade this year",
    "Report: Google may use Qualcomm Snapdragon processor for Pixel Watch 2 to improve battery life",
    "Google Pixel Watch could get a massive battery life upgrade",
    "Google Will Fix The Worst Thing About The Pixel Watch",
    "Google Pixel Watch 2 could fix its predecessors' biggest flaw",
    "Google Pixel Watch 2: Rumoured battery life leap set to impress",
    "Google's next Pixel Watch could sport better battery life",
    "Pixel Watch 2 to have a better battery life and chip",
    "The Pixel Watch 2 might have much better battery life",
    "Report: Pixel Watch 2 ditches Exynos for Snapdragon",
    "Google Pixel Watch 2 to ditch Samsung-made Exynos processor",
    "Google to say goodbye to Exynos chips with Pixel Watch 2",
    "Google's Pixel Watch 2 May Have Insane Battery Life",
    "The Pixel Watch 2 might kiss Samsung chips goodbye to improve battery",
    "Thought the first one would get W5 but it makes sense here https://twitter.com/...",
    "Data about Apple's AR headset screens has been leaked",
    "Apple Reality Pro VR Headset: New Report Claims Massive Leak",
    "Apple Reality Pro VR Headset Could Be 50X Brighter Than The Quest 2 And Support HDR",
    "Apple's Reality Pro headset specs just leaked",
    "Curved Apple headset design is manufacturing's worst nightmare",
    "Apple mixed reality headset specs leak right before WWDC 2023 — here's what you get",
    "Display analyst Ross Young tweets out possible specs for Apple's AR headset",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Rumored 4K screens could let Apple VR/AR headset offer real world-like clarity",
    "Apple's mixed reality headset will reportedly have some insane brightness levels",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate",
    "John Battelle's Search Blog",
    "@yaeleisenstat.bsky.social",
    "AI ‘godfather’ Yoshua Bengio feels ‘lost’ over life's work",
    "AI's “Oppenheimer Moment” Is Bullshit.",
    "Silicon Valley Business Journal",
    "ChatGPT has attracted 180 million users, but few Americans have tried it",
    "AI Poses ‘Risk of Extinction’ on Par With Pandemics and Nuclear War, Tech Executives Warn",
    "Artificial intelligence could lead to extinction, experts warn",
    "OpenAI's Altman and other AI giants back warning of advanced AI as ‘extinction’ risk",
    "A.I. poses human extinction risk on par with nuclear war, Sam Altman and other tech leaders warn",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in 22-word statement",
    "‘Extinction risk’: Could code-writing AI wipe out humans via software backdoors?",
    "Experts and CEOs warn of extinction risk posed by AI, compare dangers to nuclear war",
    "The Morning After: Industry leaders say AI presents ‘risk of extinction’ on par with nuclear war",
    "Researchers and industry leaders warn about AI and a ‘risk of extinction’",
    "Microsoft President Brad Smith Calls for Generative AI Regulations",
    "AI leaders warn about ‘risk of extinction’ in open letter",
    "Top AI titans unite to sign a letter against AI dangers",
    "AI poses existential risk, warn tech leaders in open letter",
    "AI poses “risk of extinction,” leading researchers and CEOs warn in 22-word statement",
    "Next generation arms race could cause ‘extinction’ event akin to nuclear war, pandemic: tech chief",
    "What is the real point of all these letters warning about AI?",
    "AI, extinction, nuclear war, pandemics ... That's expert open letter bingo",
    "Runaway AI Is an Extinction Risk, Experts Warn",
    "Industry leaders warn ‘AI poses risk of extinction’",
    "Leading experts warn of a risk of extinction from AI",
    "Prominent AI leaders warn of ‘risk of extinction’ from new technology",
    "The AI hallucinations intensify",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "AI is an ‘extinction risk’ for humanity, say tech industry leaders",
    "Artificial Intelligence leaders warn of ‘risk of extinction’ from AI",
    "Artificial intelligence threatens extinction, experts say in new warning",
    "AI executives warn its threat to humanity rivals ‘pandemics and nuclear war’",
    "The hotdog guy in this instance is the New York Times lol https://twitter.com/...",
    "Couldn't buy better PR if you tried https://twitter.com/...",
    "This has quickly become the self aggrandizement super bowl https://twitter.com/...",
    "They're not warning they're bragging https://www.nytimes.com/...",
    "Panicky or visionary? https://twitter.com/...",
    "This seems promising https://www.safe.ai/... (organized by @ai_risks) [image]",
    "I was proud to sign this statement alongside a remarkable list of experts https://twitter.com/..."
]