[
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 12%",
    "US SEC sues crypto exchange Coinbase, one day after suing Binance",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "SEC sues Coinbase, continues major crackdown on cryptocurrency exchanges",
    "SEC Sues Coinbase on Unregistered Securities Exchange Allegations",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "Coinbase Violated Securities Laws With Staking Program, Multiple U.S. State Regulators Allege",
    "SEC sues Coinbase in widening crackdown on crypto exchanges",
    "Coinbase is being sued by the SEC",
    "SEC to Coinbase: You're Making Billions But Failing to Protect Investors",
    "Coinbase sued by SEC in New York Federal court",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "Coinbase short sellers set to rake in $307m on stock crash",
    "Coinbase, don't feel left out. SEC has a lawsuit for you, too",
    "CNBC Daily Open: New Highs for the S&P and Nasdaq",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "Former Twitter CEO Claims Ethereum Is A Security, Will This Affect Prices?",
    "SEC Says Coinbase Made Billions of Dollars Unlawfully",
    "SEC Charges Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "US Crypto Crackdown Reaches Fever Pitch as SEC Sues Coinbase",
    "SEC Goes After Coinbase, Biggest US Crypto Exchange",
    "Crypto Twitter abuzz with Coinbase banter after SEC lawsuit",
    "Coinbase responds to SEC lawsuit - Here is what they said",
    "SEC files complaint against Coinbase",
    "Coinbase Stock Price: Can Crypto Exchange Survive COIN Shares Slump, SEC Charges?",
    "SEC accuses Coinbase cryptocurrency exchange of breaking US regulations",
    "Coinbase Sued By SEC, Regulator Says Crypto Exchange Is Offering Unregistered Securities",
    "SEC Named 16 Cryptos As Unregistered Securities Between Binance and Coinbase Lawsuits",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "How are the “we take a long view of crypto” people doing today",
    "mission driven company, where the mission is failure",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "Yes. https://twitter.com/...",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "Gary upping the ante this week. https://twitter.com/...",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "They didn't sue FTX. https://twitter.com/...",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "BREAKING WE'RE ALL CRIMINALS",
    "Mistakes were apparently made... https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "SEC is going crazy https://twitter.com/...",
    "Doubling Down: SEC Charges Coinbase For Operating Illegally, A Day After Charging Binance",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "This Is What the Government Strangling Crypto Looks Like",
    "Bitcoin Rallies Above $27K as Crypto Market Shrugs Off SEC Lawsuits Against Binance, Coinbase",
    "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market",
    "SEC sues Coinbase for breaking US securities rules",
    "Binance, Coinbase CEOs together lost $1.7B of personal wealth after SEC charges",
    "US securities regulator sues cryptocurrency platform Coinbase",
    "Coinbase Sued by SEC; Another Violation of Securities Laws",
    "Round 2: SEC Charges Coinbase for Operating as an Unregistered Securities Exchange, Shares Plunge",
    "SEC cracking down on crypto: Coinbase, Binance face charges",
    "SEC Sues Coinbase Over Alleged Securities Violations",
    "SEC Sues Coinbase, Alleging It Acted As An Unregistered Broker",
    "Coinbase May Face Cease & Desist Orders From 10 States Following SEC's Lawsuit",
    "New Jersey Office of Attorney General",
    "Coinbase Crackdown Widens as US States Push to Halt Staking Product",
    "Stakes High for Stablecoins as Staking Draws SEC Scrutiny",
    "SEC Sues Coinbase for Breaking Securities Laws",
    "Secretary of State Giannoulias Charges Coinbase in Groundbreaking Suit",
    "US States Are Going After Coinbase Following SEC Lawsuit — Here's How",
    "The Department of Financial Protection …",
    "DFPI Issues Action Against Coinbase Citing Staking Rewards Program Violates Securities Law",
    "The 3 Takeaways From the Lawsuit Between the SEC and Coinbase",
    "The Best- and Worst-Case Scenarios for Coinbase",
    "SEC sues Coinbase over alleged violations of securities laws",
    "SEC brings charges against cryptocurrency trading platform Coinbase",
    "Apple Makes Developer Betas Free to Download and Install",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Apple will let you install its newest developer betas right now — for free",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple's developer betas are now free to download and install",
    "iPhone users can try out new iOS 17 features without any repercussions or cost",
    "Anyone Can Install iOS 17 Beta Right Now, But You Shouldn't",
    "How to download the watchOS 10 beta on your Apple Watch",
    "Rare bug allows non-developer iPhone users to download and install iOS 17 beta",
    "Apple briefly made the iOS 17 Developer Beta available to all",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "How to install the watchOS 10 Developer Beta",
    "Download the new iPadOS 17 wallpapers right here",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "iOS 17 beta is here, but only for developers",
    "Apple made the iOS 17 developer beta available to everyone — but you probably shouldn't install it",
    "iOS 17 Developer Beta made available to all",
    "Apple macOS Sonoma: Features, compatibility, more",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "How to download the iOS 17 beta on your iPhone right now",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "How to get iOS 17 — Quick! You might get it for free",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "@williamgunn@mastodon.social",
    "iMessage group chats with Android users are better, but also worse in iOS 17",
    "iOS 17 beta brings changes to SMS texting, including ability to edit messages and more",
    "Apple is changing how Android affects iMessage, but not in the ways you want",
    "WWDC: What's new and coming in iOS 17 for iPhone?",
    "Here are 20 Top Features in iOS 17 [VIDEO]",
    "iOS 17 will finally cover up AirDrop flashers",
    "Contact Posters: iOS 17 Makes the iPhone Even More Yours",
    "The iOS 17 Features We'd Love to See on Android",
    "iOS 17's best features could have been app updates — Android does it better",
    "StandBy might just be the killer iOS 17 feature, but only if you have an iPhone 14 Pro",
    "Apple Music on iOS 17 Introduces Crossfade, Collaborative Playlists, and New Music Player",
    "iOS 17 Lets You Insert Contacts and Passwords into Any Text Field",
    "Whatever you do, don't download the iOS 17 developer beta - Apple made a huge mistake",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "iOS 17 Tidbits: Enhanced Siri Suggestions, Multiple Timers, Recipe Visual Look Up, and More",
    "Apple Music Gains Crossfade, Collaborative Playlists, And More With iOS 17",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple WWDC: New Macs, Vision Pro Headset, macOS Sonoma, and iOS / iPadOS 17",
    "United States District Court for the District of Columbia",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "SEC files motion to freeze cryptocurrency held by Binance.US",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "SEC Asks Court to Freeze Binance.US Assets",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "Binance.US says user funds ‘remain safe’ amid SEC attempt to freeze assets",
    "U.S. SEC Files Emergency Motion To Freeze Binance US' Assets",
    "Why Did the SEC File Charges Against Binance? What You Need to Know",
    "Fineqia: SEC's Actions Against Coinbase Could Push Digital Asset Exchanges Outside the US",
    "SEC Strikes: Seeks Temporary Restraining Order To Freeze Binance.US Assets",
    "SEC Files Motion to Freeze Crypto Held by Binance.US",
    "SEC requests asset freeze on Binance.US amidst lawsuit alleging compliance failures",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "Binance Withdrawal On Track to be Largest Since March Crypto Banking Crisis",
    "Investors pull $790 million from crypto exchange Binance after SEC charges",
    "Binance Reportedly Bleeds $790M in Investor Funds Following SEC's Damning Charges",
    "Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours",
    "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen",
    "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "Robinhood ‘actively reviewing’ the listing of SOL, other tokens named in SEC lawsuits",
    "SEC v. Binance: “A web of deception”",
    "Kevin O'Leary: Binance Will Be “Starved of Oxygen” by SEC's Lawsuit",
    "US District Court for the District of Columbia",
    "Coinbase Is Facing a ‘Life or Death’ Battle With the SEC",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "SEC files motion for restraining order to freeze Binance US assets",
    "House Debate Over New Crypto Bill Comes As Binance Suit Shows Regulatory Cracks In U.S.",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "Coinbase and Binance Lawsuits Put Crypto on Ice",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "Binance Saw Net Outflows of $69 Million in One Hour",
    "Crypto Stocks Plunge As SEC's Lawsuit Against Binance And Coinbase Intensfies",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "The SEC is suing Binance, the world's largest crypto exchange",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "Those Binance charges in full",
    "SEC sues crypto giant Binance and its CEO",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "Strong together. https://twitter.com/...",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "we welcome clarity and guida— NOT THAT KIND OF CLARITY AND GUIDANCE",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "Potential bankrun type situation 👀 https://twitter.com/...",
    "The gears of justice grind slowly but they grind exceedingly fine. https://twitter.com/...",
    "Those Binance charges in full https://www.ft.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "[DB] SEC Alleges BNB, BUSD Are Securities in Lawsuit",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "And another one bites the dust (maybe?) https://markets.businessinsider.com/ ...",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "SEC charges Binance with the exact same accusations as FTX: https://www.nytimes.com/... [image]",
    "Apple's Vision Pro Is A Technical Tour De Force, But Accessibility Fascinates Most",
    "Why I Can't Bet Against Apple's Mixed-Reality Prowess",
    "Apple launches Vision Pro mixed reality headset into unproven niche market",
    "Apple Vision Pro AR Headset: 5 Reasons We're Excited",
    "Apple is going out of its way to make sure Vision Pro doesn't look dorky",
    "Apple's AR headset is a game-changer for startups",
    "Apple's new headset still has more potential than any wearable Google ever built",
    "Apple's Vision Pro Is A New Spatial Computing Device — Not A Headset",
    "Apple's Vision Pro is an incredible machine. Now to find out what it is for",
    "Apple Reveals the Metaverse",
    "Apple's Vision Pro AR/VR Headset: Bold, Innovative, and Ridiculously Expensive",
    "Eyes (and head) on with the Apple Vision Pro",
    "Apple and the two-track future for the metaverse",
    "The Apple Vision Pro marks a turning point in the AR/VR market",
    "iOS 17: Apple Reveals Exactly Which iPhones Will Run The Blockbuster New Software",
    "How Apple Vision Pro Works With the Mac",
    "I wanted the “Wow” factor for the Apple Vision Pro reveal, but all I got was a “Why?”",
    "Apple Vision Pro hands-on impressions make it seem cool, but not essential",
    "WWDC 2023: Apple launches Vision Pro and raft of products powered by new chipsets",
    "This First Reaction To Vision Pro's Price Probably Wasn't What Apple Hoped For",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "Marques Brownlee on YouTube",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "Apple Vision Pro Impressions!",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "3 things I learned by trying Apple's Vision Pro headset (and 3 I didn't)",
    "Hands on: Apple Vision Pro: I just wore the future",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Even with so many demonstrated use cases, Apple Vision Pro might not yet have a purpose",
    "Vision Pro first look: Apple makes its case for a computer on your face",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Apple's AR headset suffers from a lack of vision",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Check out Apple Vision Pro in 3D Here",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple's Vision Pro is a genuine leapfrog in mixed-reality capabilities",
    "Here's What Early Testers Are Saying About Apple's Vision Pro Headset",
    "What Resolution Is Apple's New Vision Pro AR/VR Headset?",
    "Apple Vision Pro is not just an AR/VR Headset",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "I tried the Apple Vision Pro mixed-reality headset — here's what it's like",
    "Apple Vision Pro demo roundup: Here's what everyone is saying",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro first look",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "Markup on Apple Vision Pro #AppleVisionPro #visionOS #WWDC23 #SpatialComputing #AR #VR #MR [video]",
    "wow this is a way better demo than what Apple showed during its keynote https://twitter.com/...",
    "You're a rock star #WWDC23 [video]",
    "Incredibly clear and lifelike. Best I've seen yet. https://twitter.com/...",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "This is not the final form https://9to5mac.com/...",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "These are the people you are up against if you think the Apple Vision Pro will fail [image]",
    "I gotta admit, this part made me a bit sad. [image]",
    "Report: Apple Acquires AR Headset Maker Mira",
    "Apple acquires Mira, a startup building lightweight AR hardware",
    "Apple bought the AR company behind the tech in Nintendo's ‘Mario Kart’ ride",
    "Mira made AR headsets for the US Military — and Apple owns the company now",
    "Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World",
    "Apple reportedly acquired AR start-up Mira as it pushes new headset vision",
    "Apple buys AR headset startup Mira - The Verge",
    "Apple acquires AR headset startup Mira",
    "@RichLightShed ... Funny part there is Apple looked at buying Within first!",
    "What Sequoia Should Have Said  —  I remember my jaw dropping last year when The Information's …",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia Splits Into Three Entities, Makes China Standalone Firm",
    "Sequoia's three-way split brings abrupt end to global strategy",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Why Did Sequoia India Change Its Structure And Brand Identity To Peak XV Partners?",
    "Sequoia rebrands to Peak XV Partners in India and SEA",
    "Sequoia Spins Off India Unit; Rebrands To Peak XV Partners",
    "Sequoia to separate China, India and Southeast Asia by March 2024",
    "Sequoia splits China and India arms from US mothership",
    "Here is the global business update we shared with our LPs. [image]",
    "really solid piece from @alexrkonrad https://www.forbes.com/...",
    "👀😳 https://twitter.com/...",
    "End of an era. https://twitter.com/...",
    "Massive moment for venture in India https://www.forbes.com/...",
    "Reddit to lay off about 5% of its workforce as tech job cuts top 200,000",
    "Reddit Laying Off 5% of Workforce, Trims Hiring Plans",
    "Marc Andreessen has a plan to use ‘AI to save the world’ - and it doesn't involve regulation",
    "A.I. doomers are a ‘cult’ — here's the real threat, according to Marc Andreessen",
    "Andreessen Horowitz Co-Founder Marc Andreessen on ‘Why AI Will Save the World’",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Important new post from @pmarca https://a16z.com/...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Instagram appears to be developing an AI chatbot with 30 different personalities to choose from",
    "Instagram May Be The Next Social Media App To Get An AI Chatbot",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response",
    "Instagram might be working on an AI chatbot",
    "Instagram works on AI Chatbots in DMs",
    "Instagram AI Chatbot: Leaked Image Hints to Upcoming “AI Agents”",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Personalized wealth management, built for tech people",
    "For better or worse, Apple is avoiding the AI hype train",
    "Apple avoids the AI trap at WWDC",
    "‘Ducking hell’ to disappear from Apple autocorrect",
    "Edtech giant Byju's launches transformer models in AI push",
    "Why AI wasn't mentioned at all during Apple's big WWDC presentation",
    "Apple's Vision Pro: Where's the 5G?",
    "Apple isn't labeling its AI products ‘AI.’ Here's why that's important.",
    "Apple Ghosts the Generative AI Revolution",
    "Apple's practical approach to A.I.: No bragging, just features",
    "Apple WWDC AI word count: 0",
    "Not really, they just use a different buzzword called ML. https://www.theverge.com/...",
    "“Transformer-based” in the keyboard. First LLM mention. Everyone take a drink. #WWDC",
    "Not sure why anyone thought there would be an AI focus today... https://twitter.com/...",
    "Now in beta: Save and sign in with passkeys using 1Password in the browser",
    "1Password rolls out Chrome passkeys with latest beta, how to use it",
    "Google Workspace users can now log in without a password, thanks to passkeys",
    "Google Workspace Now Supports Passkey Login",
    "1Password rolls out support for Passkeys in beta for browsers, with limited support on mobile",
    "Samsung's next-generation foldables will be revealed at Galaxy Unpacked in July",
    "Samsung's next foldable-focused Galaxy Unpacked will take place in late July",
    "Samsung Galaxy Z Fold 5 and Flip 5 launching late July at Unpacked in South Korea",
    "Samsung confirms Galaxy Z Flip 5, Fold 5 launch details",
    "Samsung to hold Galaxy Unpacked event next month in S. Korea",
    "Samsung Confirms Galaxy Unpacked for Galaxy Fold 5 Happening in July",
    "The press release (archived): [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Actor Leonardo DiCaprio Invests in NUVIEW's LiDAR Satellite Constellation",
    "GitLab Reports First Quarter Fiscal Year 2024 Financial Results",
    "Payroll provider UKG to acquire Immedis from CluneTech",
    "Payroll platform Immedis snapped up by US workforce management firm",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Digital asset-denominated life insurer Meanwhile snags $19 million funding round",
    "Instabase lands $45M investment to help companies automate document processing",
    "TSMC boss tells investors everything's fine, that ten percent revenue drop is a blip",
    "TSMC Says Capex to Be Near Low End of Target at $32 Billion",
    "TSMC Employees Experiencing Problems in Arizona",
    "TSMC feeling ‘good’ about possible Germany plant, in talks on subsidies",
    "TSMC expects H2 performance to be better than H1",
    "“Going to the US is not all downside” https://www.ft.com/...",
    "Made it. $TSM AGM. I'm at the back, final row. 🙃 [image]",
    "What's Behind the Redditor API Strike",
    "These 21 Subreddits Are Going Dark to Protest Reddit's API Changes",
    "Redditors to shut down communities in response to API price changes",
    "Popular Subreddits Going Dark to Protest Reddit Charging for API Access",
    "Reddit in Mass Revolt Over Astronomical API Fees That Would Kill Third Party Apps",
    "Reddit communities are ‘going dark’ to protest changes that would hurt third-party apps",
    "Intel has unveiled a weapon against TSMC and Samsung. PowerVia technology is unparalleled",
    "Intel Shows Off Bottleneck-Busting PowerVia Tech, On Schedule For 2024 Arrival",
    "Intel's backside power delivery process could make CPUs a whole lot more efficient",
    "Intel gets a speed boost from its PowerVia power delivery tech for its 2024 Arrow Lake CPUs",
    "Intel Claims It's 2 Years Ahead of Its Rivals With Backside Power Delivery",
    "Intel's 2024 PC Chips Getting a Speed Boost From New Power Tech",
    "Intel researchers claim to be two years ahead with breakthrough PowerVia tech",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft to pay $20 million for XBOX children privacy violations",
    "Microsoft to pay $20 million to settle Xbox Live privacy allegations",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Children's Data",
    "Xbox fined $20M for child privacy violations by FTC",
    "Microsoft to Pay $20M to Settle FTC Charges It Violated Children's Privacy",
    "Microsoft To Settle FTC Kids' Privacy Case With $20M",
    "The FTC issued Xbox with a hefty fine for collecting children's data",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Kids' Xbox Data",
    "Microsoft to pay $20 million for violating children's privacy laws",
    "Microsoft Settles FTC Charges for $20 Million over Xbox Child Privacy Violations",
    "Microsoft Charged $20 Million by FTC Over ‘Illegally Collected’ Children's Information on Xbox",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Microsoft Fined $20 Million by FTC Over Storage of Xbox Data",
    "Microsoft to pay $20M FTC fine over Xbox child account data collection practices",
    "Microsoft cops $20M slap on the wrist for mishandling kids' Xbox data",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "That fine is 49 minutes of Microsoft's revenue.",
    "BBC, BA and Boots issued with ultimatum by cyber gang Clop",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "Several Major Organizations Confirm Being Impacted by MOVEit Attack",
    "Clop Ransom Gang Breaches Big Names Via MOVEit Flaw",
    "BA, BBC and Boots hit by cyber security breach with contact and bank details exposed",
    "Extent of N.S. software breach still unknown, Microsoft blames ransomware gang",
    "What we know about the MOVEit vulnerability and compromises",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "British Airways, Boots and BBC among companies hit by cyber security attack"
]