[
    "U.S. District Court, Western District of Washington",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "Amazon will pay over $30 million for Alexa and Ring privacy violation allegations",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "Amazon Settles Complaints Over Ring Surveillance, Use of Children's Voice Recordings",
    "FTC fines Amazon $25M for violating children's privacy with Alexa",
    "Amazon settles with FTC for $25M after ‘flouting’ kids' privacy and deletion requests",
    "Amazon to pay $30 million in Ring doorbell camera and Alexa settlements",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "Amazon to pay $30m over Alexa and Ring privacy violations",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "Federal regulators fine Amazon $25 million over child privacy issues",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "Amazon.com to pay $25 million to settle Alexa privacy lawsuit with FTC",
    "U.S. District Court, District of Columbia",
    "Amazon's Ring used to spy on customers, FTC says in privacy settlement",
    "Ring's Response to Our Recent Settlement With the FTC",
    "Amazon's Ring used to spy on customers, FTC says",
    "Amazon will pay more than $30M for Alexa and Ring privacy violation allegations",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Federal Trade Commission v. Ring LLC",
    "Amazon will pay more than $30M to settle FTC complaints over Alexa and Ring privacy issues",
    "How to be sure your home security isn't spying on you",
    "FTC: Security failings at Amazon's Ring let hackers, employees access customer videos",
    "Ring Settles FTC Allegations of Poor Cybersecurity, Privacy",
    "Amazon to pay $30M in FTC settlements over Alexa, Ring privacy violations",
    "FTC Orders Ring to Pay $5.8 Million in Refunds For Surveilling Customers, Failing to Stop Hackers",
    "Amazon's Ring agrees to pay $5.8 million to settle FTC spying suit",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "Amazon's Ring and FTC Settle Charges of Privacy Violations",
    "Amazon gets slap on the wrist over privacy violations with Ring cameras",
    "FTC's Ring Settlement Shows Why Companies Don't Respect User Privacy",
    "Crypto Bridging Protocol Multichain ‘Unable to Contact’ CEO Zhaojun",
    "Multichain team cannot locate CEO, halts service for affected chains",
    "“China Could Be Responsible for Multichain's Missing CEO”: Fireblocks Head of Security",
    "Multichain (MULTI) team locked out as CEO goes missing",
    "Multichain unable to contact CEO, has no access to project servers",
    "Breaking: Multichain Suspends Cross-Chain Services, Fails To Contact CEO",
    "PKI at its finest. One man has the private 🔑 everyone else... not so much https://twitter.com/...",
    "interesting, ceo is gone $multi https://www.theblock.co/... [image]",
    "I don't know a single chain mentioned in this tweet https://twitter.com/...",
    "Multichain team says it can't contact CEO amid protocol problems https://www.theblock.co/...",
    "📣 Had a call with Reddit to discuss pricing. …",
    "Reddit's API pricing results in shocking $20 million-a-year bill for Apollo",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "The best Reddit client app is in danger due to price demands",
    "Proposed changes to Reddit API could mean the end of third-party apps like Apollo",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Reddit wants to make a ‘million dollars’ from API following Twitter",
    "Reddit app developer says the site's new API rules will cost him $20 million a year",
    "Popular Reddit app Apollo may go out of business over Reddit's new, unaffordable API pricing",
    "Reddit might destroy third-party Reddit apps (Update: Reddit stands firm)",
    "Apollo for Reddit might shut down due to Reddit's new API pricing",
    "Reddit Joins Twitter In Squeezing Devs With Unreasonable Fees",
    "Reddit has it in for third-party clients ↦",
    "API Extortion Era https://twitter.com/...",
    "bro is there even gonna be any of the Old Internet left by the end of 2023 https://twitter.com/...",
    "Two new Macs with M2 Max & M2 Ultra being tested ahead of WWDC",
    "New Desktop Macs With M2 Ultra and M2 Max Chips Could See WWDC Debut",
    "Apple Tests High-End Mac Desktops Ahead of WWDC: Report",
    "Apple preps first Mac with M2 Ultra chip and M2 Max desktop ahead of WWDC",
    "Apple might announce ‘several’ Macs at WWDC",
    "Apple is Testing New M2 Max and M2 Ultra Macs Ahead of WWDC [Report]",
    "M2 Mac Studio guide: Is there a future for Apple's mini powerhouse?",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "Apple App Store Commerce Climbed 29% Last Year to $1.1 Trillion",
    "Report shows the amazing strength of the global App Store ecosystem last year",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "Supply Chain Risk from Gigabyte App Center Backdoor",
    "Firmware Backdoor Discovered in Gigabyte Motherboards, 250+ Models Affected",
    "Gigabyte Sold Millions of Motherboards with Firmware Backdoor",
    "Gigabyte brought new top-tier motherboards and more to Computex 2023",
    "Gigabyte firmware component can be abused as a backdoor",
    "Gigabyte shipped hundreds of models of motherboards with a hidden firmware backdoor",
    "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
    "Tons of Gigabyte motherboards come with a hidden firmware backdoor",
    "Millions of PCs could be targeted by hackers in firmware blunder",
    "Organizations Warned of Backdoor Feature in Hundreds of Gigabyte Motherboards",
    "Definitely be aware if your mobo is on the list. https://www.wired.com/...",
    "Scream in supply chain security... https://twitter.com/...",
    "Activision Blizzard substantiated more than two dozen misconduct incidents by employees last year",
    "Activision Blizzard Investigators Confirm 29 Cases Of Harassment Last Year",
    "Activision Boss Hyped About AI, Suggests It Could Be Used In A New Guitar Hero [Update]",
    "Bobby Kotick “broke his silence”—but his claims don't add up",
    "Activision Blizzard seriously considered buying Time Warner",
    "Activision CEO responds to harassment allegations, comments on labor unions",
    "Kotick blames scandals on “a very aggressive labor movement”",
    "Activision Blizzard CEO claims widespread toxic workplace allegations are ‘mischaracterizations’",
    "Bobby Kotick blames Activision toxicity on ‘outside forces’ - but he's pro-union",
    "Activision never had “systemic issue with harassment”, says CEO Bobby Kotick",
    "Activision Blizzard wanted to acquire Time Warner, says Bobby Kotick",
    "https://twitter.com/... [image]",
    "Cortex Raises $35M in Series B Funding",
    "Cortex Applications raises $35M to bring visibility into microservices quality",
    "A new standard for Internal Developer Portals - Putting our new Series B financing to work",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "RARBG: Over 267,000 Movie & TV Show Magnet Links Appear Online",
    "Rarbg: Popular movie and TV torrent site shuts down",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Lightmatter's photonic AI hardware is ready to shine with $154M in new funding",
    "Lightmatter triples valuation to solve generative AI's energy crunch",
    "Lightmatter reels in $154M for its optical interconnect and chips",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "Italy to launch €150M fund for AI startups",
    "How Activists Proved to be Salesforce's ‘Superpower’",
    "Amazon Implementing AI Solution to Spot Damaged Items Before Shipping",
    "Amazon is using AI in its warehouses to spot damaged items.",
    "Damn the Amazon AI just identified me as damaged goods :(",
    "Proptech Firm Measurabl Closes $93 Million Series D Raise",
    "Measurabl raises $93M Series D for real estate ESG",
    "Measurabl Raises $93M in Series D Funding",
    "Measurabl Snags $93M For Carbon Footprint Management",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Salesforce delivers to expectations but contract delays and rising capital costs weigh on stock",
    "Salesforce CEO Benioff Predicts AI Spending Boom",
    "Salesforce Delivers On Margin Improvement But Sales Outlook Only Edges By Views",
    "Salesforce Q1 better than expected, margins improve",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Google's Communications Chief to Depart",
    "Silicon Valley Business Journal",
    "Google head of communications and advisor to CEO Sundar Pichai to exit",
    "Says a lot about where Google is right now. https://twitter.com/...",
    "CrowdStrike Earnings Top Estimates, But Recurring Revenue Metric Disappoints",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "Rahul Gandhi says his disqualification from Lok Sabha has given him huge opportunity",
    "SaaS startup Capillary Technologies secures $45M from Avataar Ventures, others",
    "After Deferring IPO Plan, Capillary Bags $45 Mn Funding From Avataar Ventures And Its LPs",
    "Personalized wealth management, built for tech people",
    "Magic announces $52M Strategic Funding Round led by PayPal Ventures",
    "PayPal Ventures Leads $52M Round for Crypto Firm Magic",
    "Crypto Startup Magic Raises $52M in Round Led by PayPal Ventures",
    "Magic raises $52m despite crypto bear market",
    "Magic Raises $52M in Strategic Funding",
    "Crypto wallet Magic raises $52M to expand ‘wallet-as-a-service’ solution",
    "Web3 Infrastructure Company Magic Raises $52M in a Round Led By PayPal Ventures",
    "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "Web3 Firm Magic Summons $52 Million With PayPal Ventures' Help",
    "PayPal Ventures invests in web3 onboarding startup Magic",
    "Ultraleap launches Leap Motion Controller 2",
    "Leap Motion's gesture control quest continues with the Leap Motion Controller 2",
    "Ultraleap launches second generation of iconic hand tracking camera - Leap Motion Controller 2",
    "Vive XR Elite Getting New Tracking And Mixed Reality Features & Improvements",
    "Twitter Extends Community Notes to Images After Pentagon Explosion Tweet",
    "Twitter will now put Community Notes ‘fact checks’ on images",
    "You Do It: Twitter Outsources AI Image Detection to Its Users",
    "Twitter launches Community Notes to tackle the spread of misleading media",
    "Twitter Community Notes for images is currently in the testing stage",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Twitter Adds Crowdsourced Fact Checks To Images",
    "Twitter launches Community Notes for images",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter is testing Community Notes for images",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Twitter Expands Crowdsourced Fact-Checking Following Phony Viral Photo",
    "Free compensation benchmarking data from 3,000 startups",
    "What is Generative AI and how does AI improve customer experience?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta Platforms asks federal court to halt further FTC restrictions: WSJ",
    "Meta Platforms Asks Federal Court to Block FTC in Privacy Fight",
    "Facebook Accuses FTC of Power Grab Over Proposed Changes to $5 Billion Privacy Settlement",
    "Binance Faces Probe By Canadian Securities Regulator",
    "Bybit follows Binance in departure from Canadian market",
    "Ah. So that's why it has barred Canadians. https://twitter.com/...",
    "The new Amazon Echo Pop is stylish, affordable, and offers good sound for small spaces",
    "Amazon Echo Pop review: The latest Echo flops rather than pops",
    "Amazon Echo Pop Review: An Alexa Speaker That Looks Nice And Talks Back",
    "Amazon Echo Pop Review: a perfectly priced Alexa",
    "Amazon Echo Pop review: A portable smart speaker for small spaces",
    "Talis Capital Holds First Close of $175M Fund III",
    "PSG makes investment in Hostaway to expand its vacation-rental software amid travel rebound",
    "Hostaway's $175M Raise Is A Rarity In The Travel Industry",
    "Hostaway raises $175M for vacation rental tech expansion",
    "Finnish founded Hostaway secures $175 million to take its vacation rental platform global",
    "Garmin unveils next-gen fēnix 7 Pro Series",
    "Conquer every day and every adventure with epix Pro Series from Garmin",
    "Garmin unveils new Fenix 7 Pro and Epix Pro Gen 2 series watches",
    "Garmin's New Fēnix 7 Pro Smartwatch Offers Better Displays and Battery for Weeks",
    "Garmin's New Smartwatches Expect You'll Pay More For AMOLED And Longer Battery Life",
    "Garmin reveals high-end smartwatches for explorers with deep pockets",
    "Garmin Epix 2 Pro & Fenix 7 Pro are official: here's what's new & different",
    "Epix 2 Pro: Garmin announces new smartwatches in three sizes with flashlight and improved sensors",
    "British digital bank Monzo hits monthly profitability for the first time after spike in lending",
    "Neobanks should take heart from Monzo's performance in 2022",
    "UK Neobank Monzo Records First Monthly Profits",
    "Monzo Narrows Losses as Customer Numbers and Staff Costs Grow",
    "Monzo hits monthly profitability",
    "💸 Revenues more than doubled to £356m (+130% YoY)  —  📈 Net operating income is up 88% YoY …",
    "Europe turns to existing laws to regulate cutting-edge AI",
    "ChatGPT Risks Divide Biden Administration Over AI Rules in EU",
    "Dublin fintech NomuPay raises $53.6m for payments platform",
    "Dublin-Headquartered NomuPay Raises $53.6 Million to Expand X-Border Payment Platform",
    "NomuPay Raises $53.6M in Funding",
    "Ireland-based fintech platform NomuPay secures €50.1M for cross-border payments; Know more",
    "Dublin-based fintech NomuPay raises €50m from backers",
    "Unified payments platform NomuPay raises $53.6M in Series A round",
    "Removing the multiples, Ireland's NomuPay nomz nomz on $53.6 million",
    "‘All access pass’ payments platform NomuPay raises $53.6 million",
    "Stories like this get my ears ringing https://twitter.com/...",
    "Bluesky vs. Nostr — Which Should Developers Care About More?",
    "Twitter Alternative Bluesky Hits 100k Members Before Exiting Beta",
    "Cool article about @fiatjaf, @arcbtc and the beginnings of nostr https://www.forbes.com/...",
    "BabyLM Challenge  —  Summary: This shared task challenges community members to train …",
    "Four LLM trends since ChatGPT and their implications for AI builders",
    "U.S. Manufacturers Seek China Alternatives as Tensions Rise",
    "Taiwan invasion in 2025 gaining credibility; no time for Apple and others to prepare",
    "Armchair Warriors Are Getting Taiwan All Wrong",
    "The interactive is also beautifully produced. https://twitter.com/...",
    "Data about Apple's AR headset screens has been leaked",
    "Apple Reality Pro VR Headset: New Report Claims Massive Leak",
    "Curved Apple headset design is manufacturing's worst nightmare",
    "Display analyst Ross Young tweets out possible specs for Apple's AR headset",
    "Apple mixed reality headset specs leak right before WWDC 2023 — here's what you get",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Rumored 4K screens could let Apple VR/AR headset offer real world-like clarity",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Apple's MR headset tipped to have dual 4K displays with an eye-popping 4,000ppi",
    "Here are the specs for Apple's ‘Reality One’ XR headset displays",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate"
]