[
    "Apple's AR/VR Headset Expected to Enter Mass Production in October Ahead of Late 2023 Launch",
    "Beyond WWDC  —  A variety of developer organizations will host events throughout the week of WWDC.",
    "What I'm watching for at the WWDC keynote",
    "Reality Pro's library of Apple Music VR concerts has been a decade in the making",
    "Apple's New VR Headset Will Disappoint, but That's OK",
    "Apple's rumoured mixed reality headset may be the miracle the European XR industry needs",
    "Apple has built a special hands-on area inside Apple Park for AR/VR headset demos",
    "WWDC 2023: Here's the new hardware Apple is expected to announce",
    "Apple Is Stepping Into the Metaverse. Will Anyone Care?",
    "Apple Reality Pro release date just tipped for December — here's what we know",
    "Apple may ship its upcoming AR/VR headset with some very important warnings",
    "Apple conference kicks off June 5. Here's everything you need to know about WWDC 2023.",
    "Join CNET's WWDC 2023 Watch Party: Live Reactions to Apple's New Reveals",
    "Why Apple's VR headset could succeed where every similar product has failed",
    "Apple WWDC 2023: How to Watch Live and What to Expect",
    "Apple's new headset will land in an AI-crazed world",
    "Reality Pro could be the ultimate Mac display that Apple would never make",
    "New iOS 17 Apple Wallet rumor: This new feature will help you stay on top of things",
    "Apple Watch's Biggest Update In Years Could Be Revealed In Days",
    "1 big thing: Apple's new headset will land in an AI-crazed world",
    "Apple highlights ‘Beyond WWDC’ events happening next week around the world",
    "Apple's ‘Reality Pro’ will likely offer an in-depth catalog of live concerts",
    "Apple needs to prove why its mixed reality headset matters",
    "Can Apple make its headset inevitable?",
    "New Mac Studio Now Expected To Be Announced At WWDC",
    "WWDC predictions  —  Plus: Meta tries to crash Apple's party  —  Welcome back to Multicore …",
    "What to Expect at WWDC 2023: AR/VR Headset, New Mac Studio, Mac Pro",
    "Apple rumored to redesign core apps in watchOS 10 for larger watch displays",
    "Apple reportedly builds hands-on area inside Apple Park for AR/VR headset demos",
    "Apple's Ultra-Premium Mixed Reality Headset: Everything We Think We Know",
    "A new Mac Studio might be unveiled by Apple during WWDC 2023",
    "Apple may soon show off its biggest and riskiest new hardware product in years",
    "watchOS 10 reportedly revamps core apps for the Apple Watch Ultra's larger display",
    "The Why of Apple XR Headset",
    "WWDC: Morgan Stanley says December launch for Apple Reality",
    "What to Expect from Apple's WWDC 2023",
    "Apple to unveil refreshed Mac Studio at WWDC 23, confirms Mark Gurman",
    "Apple's AR/VR Headset May Be Here By The End Of 2023",
    "Gurman: iOS 17 Wallet App May Show Additional Credit Card Balances",
    "Apple Will Likely Release a New Mac Studio at WWDC 2023",
    "reading the warning pamphlet for Reality Pro be like: https://twitter.com/... [image]",
    "i expect some things will happen at WWDC https://www.multicore.blog/...",
    "Protip: You can't be a status symbol if you have a battery pack https://twitter.com/...",
    "ADHD makes sense to some extent actually https://twitter.com/...",
    "Progress Software Corporation",
    "Cybersecurity and Infrastructure Security Agency",
    "@GossiTheDog@cyberplace.social",
    "MOVEit Transfer Critical Vulnerability (May 2023)",
    "Rapid7 Observed Exploitation of Critical MOVEit Transfer Vulnerability",
    "MOVEit Transfer Critical Vulnerability CVE-2023-34362 Rapid Response",
    "Critical Vulnerability in Progress MOVEit Transfer: Technical Analysis and Recommendations",
    "Zero-Day Vulnerability in MOVEit Transfer Exploited for Data Theft",
    "Progress Software Releases Security Advisory for MOVEit Transfer",
    "CVE-2023-34362  —  Assigner: MITRE Corporation Published: 2023-06-02Updated …",
    "CISA adds Progress MOVEit Transfer zero-day to its Known Exploited Vulnerabilities catalog",
    "Hackers launch another wave of mass-hacks targeting company file transfer tools",
    "Zero-Day In MOVEit File Transfer Software Exploited To Steal Data From Organizations",
    "Hackers use flaw in popular file transfer tool to steal data, researchers say",
    "MOVEit Transfer vulnerability appears to be exploited widely",
    "Malicious hackers target vulnerable file-transfer tool",
    "Update now! MOVEit Transfer vulnerability actively exploited",
    "MOVEit Transfer Zero Day Under Attack",
    "MOVEit Transfer Tool Leveraged By Hackers To Steal User Data: US Security Researchers",
    "MOVEit Transfer Zero-Day: What We Know So Far",
    "Zero-day vulnerability in MoveIt Transfer under attack",
    "Millions of users vulnerable to zero-day in MOVEit file transfer app",
    "Hackers Exploit Progress MOVEit File Transfer Vulnerability",
    "Experts warn of MOVEit Transfer tool exploitation using zero-day bug",
    "MOVEit MFT 0-day Vulnerability is Used to Steal Corporate Data",
    "Deployed publicly accessible MOVEit Transfer?  Oh no. Mass exploitation underway",
    "MOVEit Transfer Under Attack: Zero-Day Vulnerability Actively Being Exploited",
    "MOVEit Transfer has a major security issue - here's what you need to know",
    "MOVEit Transfer zero-day attacks: The latest info",
    "MOVEit file transfer vulnerability exploited by hackers",
    "Hackers exploit MOVEit file transfer vulnerability",
    "Threat Actors Exploiting MOVEit Transfer Zero-Day",
    "MOVEit Transfer software zero-day actively exploited in the wild",
    "Security flaw in MOVEit file transfer tool allowed hackers to steal user data",
    "MOVEit Transfer Vulnerability",
    "@PhilGastwirth@worldkey.io",
    "Amazon in talks to offer low-cost or free mobile service to Prime customers, report says",
    "Has Amazon found the ultimate lock-in?  Cheap cellphone service for Prime",
    "Amazon reportedly in talks to bundle mobile phone service as Prime perk",
    "Free mobile service for Amazon Prime members under discussion",
    "Amazon may provide free cellular service to Prime members",
    "Some other ideas for bundling with Amazon Prime",
    "Amazon may give Prime customers a cheaper monthly cellular plan",
    "Analyst: Wireless Providers Unlikely to Let the Amazon Fox into Their Hen House",
    "Amazon Prime could include phone plans for free — here's what we know",
    "Amazon in Talks with Wireless Carriers to Offer Low-Cost Mobile Phone Service to Prime Members",
    "Telecom stocks fall on report Amazon considers launching mobile service for Prime members",
    "US telecom stocks fall on report Amazon in talks for wireless services",
    "Amazon talking to carriers about cheap (or free) mobile service for Prime subs report",
    "Amazon in Talks to Offer Cheap or Free Mobile Plans to Prime Members",
    "Amazon reportedly in talks to sell phone service as part of Prime",
    "Amazon in talks to add low-cost or free 5G wireless service to Prime",
    "Report: Amazon Prime Member Might Get Free Mobile Phone Service",
    "Report: Amazon Wants to Give Cheap or Free Phone Plans to US Prime Members",
    "Amazon to Offer Free Mobile Service to US Prime Members: Bloomberg",
    "Amazon denies reports of a Prime wireless plan, but I hope it happens",
    "Your Next Amazon Prime Perk: Cheap or Even Free Cell Phone Plans?",
    "Amazon might be getting into the phone service game, but is it a good idea?",
    "Amazon Reportedly In Talks With Carriers To Add Mobile Service To Prime",
    "Amazon is reportedly in talks to provide cheap or free unlimited mobile phone service",
    "Possible Amazon Entry Into Wireless Services Sends Telecom Stocks Down",
    "There's two ways to make money online: Bundling and Unbundling https://twitter.com/...",
    "@matthewrodier.bsky.social",
    "An update on our approach to US election misinformation",
    "After Ban, YouTube Will Allow Videos That Back 2020 Election Fraud Claims",
    "YouTube now allows videos that falsely claim Trump won 2020 election",
    "YouTube will no longer take down false claims about U.S. elections",
    "YouTube will stop removing false presidential election fraud claims",
    "YouTube to stop removing content making false claims on past elections",
    "YouTube reverses policy, will allow election denial",
    "YouTube Reverses Policy That Banned Claims Of Fraud In 2020 Election",
    "YouTube will stop removing false claims about 2020 election fraud",
    "YouTube will now allow 2020 election denialism content, in policy reversal",
    "YouTube to Stop Removing Content Denying 2020 US Election Result",
    "YouTube says it will stop removing false claims about past elections",
    "YouTube Revises Its U.S. Election Misinformation Policy Amid Election Season",
    "YouTube reverses course, will not take down controversial or disproven political content",
    "YouTube changes policy to allow false claims about past US presidential elections",
    "YouTube Will No Longer Remove US Election Fraud Content",
    "YouTube Will Stop Removing Videos Pushing Lies About the 2020 U.S. Presidential Election",
    "YouTube Nukes Policy Banning Election Denialism",
    "What's the worst that could happen?",
    "Why would you replace a good policy with a terrible one",
    "Japan privacy watchdog warns ChatGPT-maker OpenAI on user data",
    "How ChatGPT Can Help You Land Your Dream Job",
    "ChatGPT and Generative AI Around the World: Maturity, Opportunities, and Hurdles in Key Regions",
    "Gosh I wonder what they'll choose?? https://www.washingtonpost.com/ ... [image]",
    "@erininthemorning.bsky.social",
    "Twitter's head of brand safety and ad quality has left the company",
    "Twitter safety chief resigns after Musk criticizes decision to restrict film",
    "Musk's response to an anti-trans video sparks 24 hours of chaos at Twitter",
    "Twitter loses second head of Trust and Safety under Musk",
    "Elon Musk and Twitter face growing brand safety concerns after execs depart",
    "Twitter loses two executives in charge of trust and safety",
    "Right-wing Musk fans win Twitter CEO's loyalty. Staff loses.",
    "Twitter Sees Two Key Ad-Related Executives Depart",
    "Twitter reportedly loses second top safety executive in two days",
    "Twitter Loses Its Second Trust and Safety Head Under Elon Musk's Reign",
    "he really seems determined to destroy the company https://twitter.com/...",
    "ads on here have gone full late night infomercial",
    "Dogfood left in bowl. https://www.bloomberg.com/...",
    "Apple's mixed reality headset is a hedge against disruption",
    "Introducing Meta Quest 3 | Coming This Fall",
    "Meta Shows First Glimpse of Quest 3 Mixed Reality Gameplay and Improvements Over Quest Pro",
    "Meta Announces $500 Quest 3 Headset Just Ahead of Apple Launch",
    "Meta unveils Quest 3 mixed reality headset ahead of Apple's VR debut",
    "Meta announces its Quest 3 VR headset, which will cost $499.99",
    "Meta Reveals Quest 3 VR Headset: Higher Resolutions and Next-Gen Snapdragon SoC",
    "Meta Will Continue to Support Quest 2 After Quest 3 Launch",
    "Watch The First Quest 3 Mixed Reality Gameplay Footage Here",
    "The Morning After: Meta announces its new mixed-reality headset, the Quest 3",
    "Meta Quest 3 announced: mixed reality headset launching this year for £500",
    "Meta unveils Meta Quest 3 headset ahead of Apple's big reveal",
    "Meta unveils Quest 3 VR headset, available in the fall for $499.99",
    "Meta teases new Quest 3 VR headset as Apple gears up for a launch of its own",
    "Quest 3 won't replace Quest 2 for ‘quite a while,’ confirms Meta",
    "Meta unveils Quest 3 mixed reality headset: But you probably can't but it yet",
    "Meta beats Apple to the mixed-reality punch with $499 Quest 3 coming this fall",
    "Mark Zuckerberg randomly unveiled the Meta Quest 3 just days before Apple unveils Reality Pro",
    "Zuckerberg unveils Meta Quest 3 VR headset days before Apple reveals its own",
    "The Meta Quest 3 is a $499 mixed reality headset with full-color passthrough",
    "Meta Announces Autumn 2023 Launch for Quest 3 VR and MR Headset",
    "Meta Announces Quest 3 VR and Mixed-Reality Headset, Starting at $500",
    "Meta unveils new virtual reality device ahead of Apple headset launch",
    "Meta's $499 Quest 3 headset arrives this fall",
    "Meta Unveils Quest 3 Ahead of Apple's VR Headset News",
    "Best thing about this is how ridiculous it makes their own Quest Pro look",
    "Say what you will about Meta, but at least they can count to three.",
    "The Metaverse is so back https://twitter.com/...",
    "@boztank @Qualcomm Congrats Boz. Lighter, thinner, faster and still affordable!",
    "Meta Quest 3 behind the scenes - via Zuck's Instagram [video]",
    "No reason behind this choice I'm sure https://twitter.com/...",
    "sorta reminds me of maelstrom gang faces in cyberpunk... [image]",
    "Meta spoiler ahead of Monday... https://www.meta.com/...",
    "Quest 3. The VR headsets are coming fast and furious now. https://www.cnet.com/...",
    "RIP: Microsoft is finally killing Cortana on Windows",
    "Microsoft is killing Cortana on Windows starting late 2023",
    "Microsoft will end support for Cortana on Windows later this year",
    "Windows 11 Adoption Slowed Down In May",
    "With Bing Chat Thriving, Microsoft to End Cortana Support on Windows",
    "RIP Cortana on Windows: You should never have left Master Chief",
    "Microsoft will kill support for the Cortana Windows app in late 2023",
    "Microsoft to kill Cortana app for Windows 10 and 11 later this year",
    "This AI used GPT-4 to become an expert Minecraft player",
    "GPT-4 Powered Minecraft Playing Bot Suggests AI Could Automate Some Workplace Tasks",
    "@securopean@infosec.exchange",
    "Microsoft stashes nearly half a billion in case LinkedIn data drama hits",
    "Microsoft expects to pay $425 million fine for LinkedIn privacy violations",
    "Microsoft sets aside $425M to help cover potential LinkedIn targeted advertising fine",
    "Microsoft says it may pay a $425 million fine over alleged Linkedin privacy violations",
    "Microsoft Braces for $425 Million Fine over LinkedIn GDPR Privacy Violations",
    "Clickbait Rewriting on Artifact: Behind the Scenes",
    "An app might rewrite this clickbait headline — here's why",
    "Artifact's AI Will Rewrite Clickbaity Headlines, Though Don't You Dare Rework Mine",
    "That's a good use of GPT-4",
    "Ooh.  I love this.  I think I am a fan of algorithms doing the work for me.",
    "Unlock a new pipeline channel: your existing customers",
    "International Business Times",
    "Insider trading lawsuit: Here's how much Elon Musk pumped DOGE",
    "Elon Musk hit with insider trading claims over his Dogecoin crypto-hype",
    "DOGE Investors Sue Elon Musk Over Alleged Insider Trading in Crypto Market",
    "Elon Musk Accused of Dogecoin Insider Trading Offences by Aggrieved Investors",
    "Plaintiffs in Dogecoin Lawsuit Against Musk Make Wild New Allegations",
    "DOGE Questioned as a Security in Musk's Class-Action Lawsuit",
    "Elon Musk Faces Insider Trading Accusations in Dogecoin Lawsuit Over Twitter Logo Change",
    "Elon Musk accused of manipulating Dogecoin price in $258 billion lawsuit",
    "Dogecoin investors strike Elon Musk with market manipulation lawsuit",
    "Elon Musk's Twitter-to-Doge logo switch raised as evidence in lawsuit",
    "Elon Musk Accused Of Insider Trading, Amended Lawsuit Blames His Bullish DOGE Moves",
    "Twitter's trust and safety lead Ella Irwin resigns",
    "Center for Countering Digital Hate",
    "Twitter fails to act on 99% of Twitter Blue accounts tweeting hate",
    "Twitter's Top Content Moderation and Safety Executive Leaves",
    "Twitter's Head of Trust and Safety Resigns",
    "Twitter head of trust and safety Ella Irwin has resigned",
    "Twitter loses another trust and safety head",
    "Twitter's head of safety and content moderation has left the company",
    "Twitter trust and safety chief Ella Irwin resigns",
    "Twitter loses its second head of trust and safety since Musk take-over",
    "Twitter Head of Trust and Safety Resigns",
    "Twitter top safety exec Ella Irwin resigns",
    "Twitter head of trust and safety Ella Irwin reportedly resigns",
    "Twitter Loses Another Head of Trust and Safety",
    "Twitter's head of trust and safety resigns: reports",
    "I'm shocked to realize Twitter still had a VP of Trust and Safety",
    "surely this has nothing to do with that daily wire publicity stunt earlier",
    "Confirmed, Ella Irwin tells me she resigned today https://twitter.com/...",
    "So, trust and safety are gone? https://www.reuters.com/...",
    "She's been replaced by a 💩 emoji https://www.reuters.com/...",
    "I assume these two developments are related. https://twitter.com/...",
    "Another one bites the dust https://twitter.com/...",
    "Well, she really had no work to do since new ownership took control. https://twitter.com/...",
    "Trust left the office long before this. https://twitter.com/...",
    "Twitter had a head of trust and safety?! 🤨 https://twitter.com/...",
    "job that seems about as desirable as being George Santos' treasurer https://twitter.com/...",
    "Advertisers love this shit. This is what they crave https://twitter.com/...",
    "Wow, Twitter's head of trust and safety is out for a second time. https://twitter.com/...",
    "wheee! https://fortune.com/...",
    "Twitter loses its top content moderation official at a key moment",
    "Elon Musk Personally Elevates Transphobic Video Originally Flagged as Hate Speech",
    "The exit of a top Twitter executive highlighted the platform's content moderation challenge",
    "Apple prepares for a platform shift",
    "Elon Musk's new Twitter pronoun rule invites bullying, LGBTQ groups say",
    "It would be funny if Elon Musk's Twitter has “gone woke” in an attempt to avoid “going broke”",
    "@stevenmarkryan The Streisand Effect on this will set an all-time record!",
    "Wonder what stage of @mmasnick's moderation learning curve this is https://twitter.com/...",
    "Whoaaaaaa not good, hope @elonmusk rectifies this immediately https://twitter.com/...",
    "rare twitter W https://twitter.com/...",
    "Facts don't care about your feelings https://twitter.com/...",
    "increasingly rare Twitter W https://twitter.com/...",
    "no one is falling for this publicity stunt right https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Fri. 06/02 - An Amazon Prime Phone Service?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Malaysia goes its own Huawei, won't ban Chinese vendor from 5G network",
    "The Best Laptops and Desktops of Computex 2023",
    "Dell's XPS 13 Plus with brilliant OLED display sees aggressive $750 discount",
    "AI Responsible for 4.8% of US Job Cuts in May: Report",
    "Challenger, Gray & Christmas, Inc.",
    "May 2023 Layoffs Jump on Tech, Retail, Auto; YTD Hiring Lowest Since 2016",
    "Job Cuts From AI Are Just Beginning, the Latest Challenger Report Suggests",
    "Tech layoffs have soared to the highest level in more than two decades",
    "Layoffs Rise 20% in May Led by Technology and Retail",
    "Build more connections with new communities in Microsoft Teams and GroupMe features",
    "Microsoft Teams App on Windows 11 Adds New Features for Consumers",
    "Microsoft Teams Free Version Gets New Features",
    "Microsoft Teams is getting new AI tools — and they're free",
    "Microsoft updates Teams with communities and AI-powered Designer support",
    "Microsoft Teams on Windows 11 is getting a major facelift, and I'm excited",
    "Microsoft Teams Free Announces Its Biggest Upgrade Yet",
    "Microsoft rolls out AI-powered “Designer” for Teams along with bunch of other features",
    "Microsoft's AI-powered Designer tool comes to Teams",
    "Meta Calls Employees Back to Office Three Days a Week",
    "Meta will require staff to be in the office at least three days a week",
    "Meta orders employees back to office 3 days per week after slashing 21K jobs",
    "Meta tells staff to return to office three days a week",
    "Mark Zuckerberg Mandates Meta Employees Return to the Office Three Days a Week",
    "Meta Enforces Three-Day Office Attendance for Employees",
    "Meta Platforms rethinks hybrid-work policy, to bring some employees back to office 3x a week",
    "Facebook Parent ‘Meta Platforms’ Mandates Three-Day Office Work Week from September",
    "Meta: Many employees need to return to in-person work 3 days a week",
    "Meta wants staff back in the office three days a week",
    "Meta will require employees to return to the office three days a week starting in September",
    "Now Meta is forcing all its employees back to the office",
    "Meta employees need to work from office staring September; check details",
    "Meta Requires Office Workers To Return To Desks Three Days a Week",
    "About two years too late. https://www.theinformation.com/ ...",
    "Meta institutes a 3-day work week. https://www.theinformation.com/ ...",
    "This is not going to be more efficient. 🤦🏻‍♀ ️ https://www.theinformation.com/ ...",
    "Apple unveils opening date for new retail store at London's Battersea Power Station",
    "Apple Store Battersea Power Station store opens on June 15; Wallpaper available",
    "Apple considering relocating Apple Store in Reading, UK to new remodeled space",
    "Apple Battersea Retail Store to Open on June 15",
    "Some Apple stores earning $100+ million yearly, with 50 new ones planned",
    "Buying Apple gear could get easier than ever with 50+ new or refreshed Apple Stores on the way",
    "Apple's store expansion plan skips NC - but one Charlotte store is moving",
    "53 new Apple stores targeted for opening or renovation by 2027",
    "Apple plans big retail push in Asia-Pacific through 2027",
    "Apple may open more physical stores in India as existing stores are a hit",
    "Each Apple Store in India has earned 22-25 crores in just one month",
    "Apple Planning 53 New or Revamped Apple Store Locations Through 2027",
    "Pentagon buying Starlink dishes for Ukraine after funding dispute with SpaceX",
    "Pentagon discloses it's paying for Elon Musk's Starlink internet in Ukraine",
    "Pentagon to Pay Starlink for Ukraine's Satellite Broadband",
    "Starlink bags US defense contract to keep war-torn Ukraine connected",
    "SpaceX's Starlink wins Pentagon contract for satellite services to Ukraine",
    "Pentagon awards SpaceX with Ukraine contract for Starlink satellite internet",
    "Pentagon Buying Musk's Starlink for Ukraine",
    "The Pentagon Cuts a Deal With Elon Musk's SpaceX to Aid Ukraine",
    "Pentagon Picks Musk's SpaceX Starlink for Ukraine Comms",
    "Pentagon Buys Up Starlink Terminals for Ukrainian Military, Despite Musk's ‘WW3’ Fears",
    "Starlink Lands Pentagon Contract To Provide Internet To Ukraine",
    "More SpaceX Starlink terminals will go to Ukraine following new order from Pentagon",
    "Musk's SpaceX wins Pentagon contract for satellite in Ukraine",
    "Marques Brownlee on YouTube",
    "Reimagine the possibilities with the new motorola razr family",
    "Motorola makes its 4th-gen foldable, the Moto Razr+, official",
    "The Motorola Razr+ might finally be the flip-style foldable I've been waiting for",
    "RAZR+ Impressions: Is This What You Wanted?",
    "Tether USD₮ Reaches All-Time High, Surpasses Previous Market Cap High of $83.2B",
    "Tether Reaches New High Despite Market Turbulence",
    "Tether's Market Cap Reached New All-Time High Levels This Month",
    "Tether reaches new all-time high (ATH) market cap",
    "Tether Market Cap Climbs to All-Time High of $83.2B, Even as Stablecoin Market Sinks",
    "Tether's Market Cap Reaches New High, Exceeding $83.2B",
    "Good job! https://twitter.com/..."
]