[
    "@WarnerCrocker@mastodon.social",
    "@jeffjarvis@mastodon.social",
    "@mercedesallen@mastodon.social",
    "@joshmcconnell@mastodon.nz",
    "Can Canada make big tech pay for news?",
    "Our approach to news regulation",
    "Google says it will start blocking Canadian news stories in response to new law",
    "Google to Remove News Links from Search, News, and Discover in Canada",
    "A Massive Own-Goal for the Government: Google to Stop News Links in Canada Due to Bill C-18",
    "Google set to remove links to Canadian news sites from search engines in the country",
    "Google says it will remove Canadian news links from searches in the country",
    "Google to block access to Canadian news for anyone living in Canada",
    "Google Says It Would Rather Shut Off Canadian News Links Than Pay Publishers",
    "Google to end news access in Canada after bill to pay news publishers passes",
    "Google to remove links to Canadian news websites from search results",
    "Google to Yank All Links to Canadian News Outlets, Citing New Media Law",
    "Google confirms it will remove Canadian news links from Search and more in Canada",
    "Google to remove Canadian news links from Search, News, and Discover",
    "Google will locally remove Canadian news sites from Search, Discover over new law",
    "Google to Block News Search Products in Canada",
    "Google to scrap local news links in Canada over Online News Act",
    "Google will pull news links in Canada in response to new law",
    "Google to block news in Canada on Search and other services over new law",
    "Google is dropping local news links in Canada",
    "Canada fucked around and found out https://twitter.com/...",
    "This went well for other countries that went this route... https://twitter.com/...",
    "Bill C-18: Google to remove news links in Canada over online news law",
    "Niantic Organizational Update",
    "Pokemon Go maker Niantic cuts a quarter of its workforce",
    "Pokémon GO maker says Apple Vision Pro validates their work as it closes studio and cancels games",
    "Pokemon Go's Developer Niantic Is Laying Off 230 Employees And Cancelling Its Marvel Game",
    "This Week In XR: Augmedics Raises $82.5 Million, Niantic Layoffs, Googles Kills AR Glasses, Again",
    "Niantic lays off 230 employees, cancels NBA and Marvel games",
    "Pokémon Go dev Niantic lays off hundreds, cancels Marvel game",
    "Pokemon Go Dev Lays Off 230 Employees, Marvel And NBA Games Cancelled",
    "Pokemon Go maker Niantic lays off 230 employees, cancels games",
    "Pokemon Go Developer Niantic Shuttering LA Studio, Canceling Marvel: World of Heroes",
    "Pokémon Go developer Niantic laying off hundreds of staff",
    "Pokemon Go developer Niantic Labs lays off 230 team members, cancels Marvel-based AR game",
    "Pokémon Go maker Niantic laying off hundreds, cancels NBA and Marvel games",
    "Niantic lays off staff and shuts down games as it focuses on Pokémon Go",
    "Niantic Layoffs Leave Hundreds Out of Work at Pokémon Go Developer, Cancels Marvel Game",
    "‘Pokémon Go’ developer Niantic is laying off 230 employees",
    "Niantic lays off 230 employees and cancels Marvel AR game",
    "Niantic Is Laying Off 230 Employees, Shutting Down Some Games",
    "Niantic is laying off 230 employees, cancels upcoming Marvel game",
    "Despite praise for Apple Vision Pro, ‘Pokemon Go’ dev evolves into smaller company",
    "Pokemon Go Dev Cancels Marvel Game, Lays Off 230 People",
    "Niantic shutters LA office, lays off 230 employees",
    "Niantic lays off 230 staff, cancels two games, closes LA studio",
    "Developer of Pokemon GO closes studio, cancels two games, and lays off 230 workers",
    "Pokemon GO Developer Niantic is Laying Off Over 200 People",
    "Pokemon Go still “top priority” as Niantic lays off 230 employees",
    "Niantic cancels projects, closes LA office to prioritize Pokémon Go",
    "Pokémon Go maker to close LA studio",
    "Pokemon GO dev Niantic is laying off 230 employees",
    "Niantic is sunsetting NBA All-World",
    "San Francisco Business Journal",
    "Inflection AI Raises $1.3 Billion to Continue Developing ‘Personal AI’",
    "Inflection AI raises $1.3 bln in funding from Microsoft, others",
    "Inflection AI — Reid Hoffman's new AI startup — scores $1.3B in new funding",
    "Microsoft and NVIDIA Lead $1.3 Billion Investment in Inflection AI for Personal AI Development",
    "Inflection lands $1.3B investment to build more ‘personal’ AI",
    "Inflection AI Announces $1.3 Billion of Funding Led by Current Investors, Microsoft, and NVIDIA",
    "Inflection AI Secures $1.3 Billion Funding Led by Tech Titans and Industry Giants",
    "AI Funding Explosion: Inflection AI Nabs $1.3B, Runway and Typeface Also Raise Big",
    "Inflection raises $1.3 billion from Microsoft, Nvidia, and others for generative AI",
    "Inflection AI: Maker of Personal AI Chatbot Raises $1.3 Billion from Microsoft and Others",
    "AI Chatbot Startup Rockets to $4 Billion Valuation With Microsoft, Nvidia Backing",
    "Microsoft and Nvidia join $1.3bn fundraising for Inflection AI",
    "Inflection AI Raises $1.3 Billion From Reid Hoffman, Bill Gates and Nvidia",
    "Reid Hoffman personally invested in ...the AI company he co-founded? https://www.forbes.com/...",
    "Not concerning at all https://twitter.com/...",
    "YouTube could be testing a three-strikes policy for ad blocking",
    "YouTube is testing a more aggressive approach against ad blockers",
    "YouTube tests disabling videos for people using ad blockers",
    "YouTube may be stepping up its fight against ad blockers",
    "YouTube Ramps Ups Its Efforts In Fight Against Ad Blockers",
    "YouTube is Showing New Alerts to Free Users With Ad Blockers",
    "Is this just a contest to see which platform can become the most unusable?",
    "what if someone invents an ad blocker blocker blocker?  [embedded post]",
    "Meta wants to turn Facebook into an App Store replacement, at least in the EU",
    "Meta's Experimenting with its Own In-Facebook App Store to Compete with Apple and Google",
    "@Techmeme Meta plans to become the number one Android malware distributor",
    "Begun the app store war has https://twitter.com/...",
    "@Tarun78354271 Time for ATT PAYBACK",
    "Meta Is Planning To Let People In the EU Download Apps Through Facebook",
    "U.S. Securities and Exchange Commission",
    "Fidelity Refiles for Spot Bitcoin ETF",
    "Fidelity joins the rush for a bitcoin ETF, following BlackRock, Ark Invest and others",
    "Fidelity's Renewed Bid for a Spot Bitcoin ETF",
    "Bitcoin gains with all top 10 crypto, Fidelity confirms Bitcoin ETF bid, U.S. economy rebounds",
    "Fidelity renews push for spot Wise Origin BTC Trust, making it 7th applicant this year",
    "Fidelity submits renewed application for spot bitcoin ETF",
    "Fidelity Officially Files for Spot Bitcoin ETF",
    "Fidelity rejoins rush to spot bitcoin ETF with fresh filing",
    "Exchange operator Cboe files with US SEC to list Fidelity's spot bitcoin ETF",
    "Fidelity reapplies for spot Bitcoin ETF despite 2022 rejection",
    "Just In: Fidelity Official Files Application for Spot Bitcoin ETF",
    "Fidelity refiles for a Bitcoin spot ETF, mimicking structure of BlackRock filing",
    "Fidelity Refiles Bitcoin ETF Application With SEC as BlackRock Renews Hope",
    "Fidelity officially files for spot bitcoin ETF in second attempt",
    "Fidelity files new spot bitcoin ETF application, following BlackRock, Invesco",
    "Fidelity becomes latest firm to re-up bid for spot bitcoin ETF",
    "Fidelity Refiles Bitcoin Spot ETF Application After BlackRock",
    "Please sir, may we have some more porridge please? 😂 https://www.cnbc.com/...",
    "@TradingPlacesResearch@econtwitter.net",
    "An Interview with Marc Andreessen about AI and How You Change the World",
    "New AI-powered Microsoft Shopping tools arrive on the new Bing and Edge",
    "New AI-based Microsoft Shopping features added to Bing search, Bing Chat, and Edge browser",
    "New Bing and Edge features give online shopping an AI makeover",
    "Microsoft Adds New AI-Powered Shopping Tools in Bing and Edge",
    "Microsoft announces new AI-powered Microsoft Shopping tools on the new Bing and Edge",
    "Microsoft Rolls Out AI-Generated Buying Guides In Bing And Edge",
    "New Bing & Edge Features Use AI To Streamline Shopping",
    "Microsoft gives Bing and Edge new AI tools to help you shop",
    "Bing adds new AI-powered shopping tools",
    "Microsoft will use AI to help you save money online when shopping with Edge and Bing",
    "Microsoft Taps Bing AI to Generate Shopping Guides",
    "Bing with ChatGPT now produces AI-generated shopping guides for you",
    "Microsoft announces new AI-powered shopping tools in Bing and Edge",
    "Bing will now surface AI-generated buying guides",
    "@aristeon89@mastodon.online",
    "@colincornaby@mastodon.social",
    "@therealahall@infosec.exchange",
    "@emilygorcenski@indieweb …",
    "@MagentaRocks@mastodon.coffee",
    "@juandesant@astrodon.social",
    "New Twitter CEO Outlines Her Key Points of Focus in Re-Building Opportunities",
    "Twitter Moves to Rejoin Industry Group to Fight Child Sexual Abuse Material Online",
    "Inside Linda Yaccarino's ambitious plan for Twitter 2.0",
    "@emilygorcenski@indieweb.social",
    "wait what why would you hire someone with an active non-compete clause https://twitter.com/...",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Twitter's New Chief Eases Into the Hot Seat",
    "Linda Yaccarino's vision for Twitter 2.0 emerges",
    "Court filing shows Microsoft Azure generated lower-than-expected $34B in revenue in 2022",
    "FTC Microsoft docs also spilled Azure revenue.",
    "Wait less than half? Time to get stronger on AWS 😩 https://twitter.com/...",
    "god bless discovery https://twitter.com/...",
    "FTC prepares “the big one,” a major lawsuit targeting Amazon's core business",
    "FTC reportedly plans major antitrust lawsuit against Amazon",
    "FTC reportedly finalizing its biggest Amazon antitrust case yet",
    "FTC Preps for Battle With Amazon. It's the Big One.",
    "FTC Set to File Major Amazon Antitrust Suit Over Marketplace Practices",
    "Amazon Faces Broadscale FTC Antitrust Suit",
    "Amazon to soon face big FTC antitrust suit over online marketplace power, report says",
    "FTC Prepares ‘the Big One,’ a Major Lawsuit Targeting Amazon's Core Business",
    "SEC Charges Former DWAC Board Member and Others for Insider Trading in DWAC Securities",
    "Investors charged with insider trading in Trump Media merger deal",
    "Three charged with insider trading on Trump's SPAC deal",
    "3 investors face insider trading charges related to merger with owner of Trump's Truth Social",
    "Three men charged with insider trading related to Trump media Spac",
    "3 charged in insider trading case linked to Trump media firm, accused of making $22 million",
    "@brendannyhan@mastodon.social",
    "How AI Influences What You See on Facebook and Instagram",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta's Nick Clegg on how AI is reshaping the feed",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "Meta Publishes New Guide on How to Create Standout Reels Content",
    "Meta Shares How AI Dictates Instagram and Facebook Feeds",
    "Meta explains how AI influences content on your Facebook and Instagram feeds",
    "Nick Clegg Is Meta's Transparency Man",
    "The Lawfare Podcast: Talking Transparency With Meta's Nick Clegg",
    "Meta Explains How AI Determines What You See on Instagram",
    "Meta reveals how its AI systems show you posts on Facebook and Instagram",
    "Meta outlines AI use on platforms",
    "Meta's new feature will tell you all about reels that you on Instagram, Facebook",
    "How Facebook ranks content in 2023: Feed, Stories, Reels and more",
    "Our Approach to Facebook Feed Ranking",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Is this when you desperately want your stock to go up? https://twitter.com/...",
    "Passage lands C$40 Million in Seed Funding to Address Canada's Skilled Workers Shortage",
    "Passage Raises C$40M in Seed Funding",
    "@williamgunn@mastodon.social",
    "Ad-Fraud Claims Could Force Google to Pay Billions. But Don't Hold Your Breath.",
    "Google accused of ripping off advertisers with video ads no one saw. Now, the expert view",
    "Why does this keep happening? I know why and you will below.",
    "Transparency and brand safety on Google Video Partners",
    "The Problem With ‘Independent’ Third-Party Verification On YouTube (Is That It Ain't)",
    "Google Accused of ‘Ad Fraud’ and Misleading Advertisers",
    "Advertisers demand billions in refunds from YouTube over skippable ads",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "For the crowd seeking us to give in to Google's intimidation tactics... https://twitter.com/...",
    "Google needs to be broken up https://gizmodo.com/...",
    "ASUS Announces the New Zenfone 10",
    "Asus Zenfone 10 Packs a Punch with SD8 Gen2 and Stunning Camera Upgrades",
    "The new ASUS Zenfone 10 packs a lot of performance into a small package",
    "Asus Zenfone 10 review: Rinse and repeat",
    "Asus continues its legacy of compactness with the Asus Zenfone 10 smartphone",
    "The Zenfone 10 is the one Android phone that could pull me away from my iPhone 14 Pro",
    "The Asus Zenfone 10 is a flagship in almost every department",
    "Zenfone 10: Unleashing Compact Power with Snapdragon 8 Gen 2",
    "ASUS's New Zenfone 10 Boasts Stronger Performance and Cameras in a Compact Frame",
    "ASUS Shows Off Zenfone 10, Keeping the Little Flagship Phone Dream Alive",
    "Asus Zenfone 10 launched with 5.9-inch 144Hz display and SD 8 Gen 2 chipset",
    "Asus Zenfone 10 review: a gimble-toting compact superphone",
    "Asus Zenfone 10 Review: Small Yet Beautiful Smartphone",
    "Asus Zenfone 10: 5.9-inch display, Snapdragon 8 Gen 2, wireless charging, €799/$699",
    "Asus Zenfone 10: Everything you need to know",
    "ASUS Zenfone 10 review: Should you buy it?",
    "Asus Zenfone 10 review: a true flagship Android phone... but smaller",
    "Asus Zenfone 10 arrives with Snapdragon 8 Gen 2 chipset and surprisingly small display",
    "Asus Zenfone 10 Review: A Small Phone With Some Big Compromises",
    "Asus Zenfone 10 review: The best small smartphone gets even better",
    "Asus Zenfone 10 review: The last of the (good) small phones",
    "Asus Zenfone 10 review: The compact phone of your dreams",
    "Asus Zenfone 10 review: A mighty mini phone",
    "The Asus Zenfone 10 is your best bet for a high-powered, small Android phone",
    "Asus Zenfone 10 review: meet the anti-Galaxy S23 Ultra",
    "The ASUS Zenfone 10 is bringing compact smartphones back",
    "@mattburgess@infosec.exchange",
    "Pornhub accused of abusing user data",
    "Pornhub Is Being Accused of Illegal Data Collection",
    "Secure Bring-Your-Own-PC Technology",
    "NewSpring leads $29M round for remote work security company Venn",
    "Venn Raises $29M to Safeguard Data on Employee-Owned Laptops",
    "Venn Unveils Secure Enclave Tech To Control Remote Work Computers",
    "Venn Software Raises $29M in Series A Funding",
    "Venn's remote work security tech fetches $29m Series A",
    "Oversight Board overturns Meta's decision in “Cambodian prime minister” case",
    "Cambodian PM Hun Sen dumps Facebook on eve of poll campaign",
    "Oversight Board Tells Facebook to Remove Video of Cambodian Prime Minister Threatening Opponents",
    "Cambodian PM Hun Sen's Facebook account faces 6-month ban",
    "Cambodian PM Launches Official TikTok Account",
    "Cambodia PM Hun Sen accused of inciting violence on social media",
    "Cambodian PM Hun Sen deletes Facebook page after criticism",
    "Meta oversight board wants Cambodian leader's account suspended",
    "Police Killing Sparks Outrage in France",
    "Meta's Oversight Board urges Facebook to suspend Cambodia's Prime Minister",
    "Oversight board recommends Facebook suspend Cambodian premier's account for violent language",
    "Meta oversight board orders firm to take down video by Cambodian leader",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "That's a lot of words to say “no bid” and “inflated marks” https://twitter.com/...",
    "Binance's European banking partner Paysafe to withdraw support",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Paysafe Ends European Binance Partnership",
    "German Regulator Denies Binance's Request For Crypto Custody License",
    "Binance Loses Another Banking Partner Amid Global Regulatory Storm",
    "Binance's euro banking partner pulls support - Why?",
    "Binance's European Banking Service Provider Paysafe to Halt Support",
    "Binance Loses European Banking Partner Paysafe",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "TSMC sending more workers to speed up building of new Arizona plant",
    "TSMC to Send More Taiwanese Workers to U.S. to Speed Up Arizona Fab",
    "TSMC Arizona chip plant over budget and behind schedule; US workers blamed",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/29 - Big Interesting (AI) Raises",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Official Tesla Support For Third-Party API-Based Services Is Coming, What Could This Mean?",
    "How is it some apps are staying up with subscriptions in the $4-7 range and Apollo isn't?",
    "Narwhal will continue to be available even after the new API pricing kicks in on July 1st",
    "At least one big third-party Reddit iOS app will live on",
    "Bitpanda Pro spins out as One Trading and raises €30M",
    "One Trading springs from Bitpanda Pro rebrand and secures $33m investment",
    "Digital Assets: Bitpanda Pro Becomes One Trading After Finalizing Series A",
    "Snapchat+ Reaches 4 Million Subscribers a Year After Launch",
    "Snapchat+ gains 4 million paying subscribers in its first year",
    "Snapchat+ gained four million subscribers in its first year",
    "Snapchat+ reaches 4 million paid subscribers since launching a year ago",
    "Snapchat has found more than 4 million people willing to pay it $4/month",
    "Snapchat+ Marks One Year Anniversary with 4 Million Subscribers",
    "Pretty damn impressive https://twitter.com/...",
    "Nvidia, Salesforce Ventures Back AI Video Startup Runway",
    "Runway Announces $141M in Funding to Expand Multi-Modal AI Research and Product Deployment",
    "Runway raises $141 million to continue building the future of creativity",
    "Runway, a startup building generative AI for content creators, raises $141M",
    "Runway AI Raises $141M From Investors Like Google and NVIDIA",
    "Inflection, Runway and Stability get new funding as capital pours into generative AI startups",
    "Runway draws fresh $141 million as next-level generative AI video begins to emerge",
    "Runway Raises $141M in Addiditional Series C Funding",
    "AI company Runway valued at $1.5 bln in latest funding -source",
    "More gasoline for awesome things! https://twitter.com/...",
    "Is this the return of “vendor financing” from 2000? https://twitter.com/...",
    "Meituan buys founder's months-old ‘OpenAI for China’ for $234M",
    "Chinese food delivery giant Meituan acquires four-month-old AI startup for $234 million",
    "Meituan Buys Co-Founder's Months-Old AI Startup for $234 Million",
    "Meituan to buy all shares of AI startup Light Year from HongShan, co-founder",
    "I see AI has reached the “acquisitions mad lib” stage.  [embedded post]",
    "Three Reasons to Look Past the 40% Drop in VC Funding",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple and Spotify Clash in Ongoing EU Antitrust Case",
    "Apple is attempting to defend itself against an EU antitrust charge based on Spotify's allegation",
    "Apple to fight EU's Spotify charges at closed-door hearing",
    "Competition Policy International",
    "Apple Argues Against EU Antitrust Charge From Spotify Claims",
    "Apple to defend itself against Spotify's antitrust accusations in the EU",
    "Apple to argue against EU antitrust charge at hearing triggered by Spotify",
    "@danilo.redeem-tomorrow.com",
    "@EshuMarneedi@mastodon.social",
    "Reddit Ramps Up Its Threats To Protesting Mods, As Ad Buyers Leave",
    "Minecraft Developers Quit Reddit After Company's Controversial Changes",
    "Minecraft Developers Are Dropping Reddit For Community Feedback",
    "Minecraft Devs Are Leaving the Subreddit Behind",
    "Minecraft Developers Leave Subreddit with 7.5m Members amid Controversial Reddit API Changes",
    "Mojang leaving official Minecraft subreddit amid current protests",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "Generative AI Startup Typeface Now Worth $1 Billion Thanks to Salesforce, Google",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "San Francisco AI marketing startup Typeface lands megaround, unicorn status",
    "Generative AI Startup Typeface Raises $100M for Branded Synthetic Media Platform",
    "AI Firm Typeface Valued at $1 Billion After Salesforce/Google Funding",
    "Generative AI Platform Typeface Bags $100M in Series B, Hitting Unicorn Status",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface lands $100M for its generative AI content creation engine",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "AI-generated text is hard to spot. It could play a big role in the 2024 campaign",
    "Exploring How Image Upscalers Can Integrate Into Existing Design Workflows & Tools",
    "Oracle Bets On AMD, Ampere CPUs; Ellison Says ‘Intel x86 Architecture’ Is ‘Reaching Its Limit’",
    "Oracle Ports Database to Arm-Based Ampere CPUs: Might Ditch Intel and AMD",
    "NVIDIA's GPU Roadmap Teases When To Expect GeForce RTX 50 Series GPUs",
    "Building Momentum for the Sustainable Cloud",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Binance to lose support of its euro banking partner",
    "Mastercard Introduces ‘Multi-Token Network’ to Support Wider Digital Asset Industry",
    "Mastercard's MTN network is groundbreaking, but crypto connection is unclear",
    "Mastercard announces plan to launch its blockchain",
    "Mastercard Goes All-In On Crypto: Imminent Launch Of ‘Multi Token Network’ Product",
    "Mastercard Unveils Multi Token Network (MTN) to Scale, Secure Blockchain Tech",
    "Tokenized Deposits: Unlocking New Possibilities in Finance",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "Microsoft, OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "OpenAI Sued for Using ‘Stolen’ Data, Violating Your Privacy With ChatGPT",
    "OpenAI Legal Troubles Mount With Suit Over AI Training on Novels",
    "Microsoft and OpenAI face $3B lawsuit alleging privacy violations with ChatGPT",
    "OpenAI sued for ‘stealing’ data from the public to train ChatGPT",
    "Lawsuit says OpenAI violated US authors' copyrights to train AI chatbot",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "Lawsuit says OpenAI violated US authors' copyrights",
    "You may be entitled to financial compensation... for your data",
    "OpenAI faces class-action lawsuit over how ChatGPT uses data — here's what we know",
    "The AI Arms Race and Why We Need to Come Together Now",
    "OpenAI is being sued for training ChatGPT with ‘stolen’ personal data",
    "OpenAI and Microsoft Sued for $3 Billion Over Alleged ChatGPT ‘Privacy Violations’",
    "OpenAI, Microsoft face class-action suit over internet data use for AI models",
    "OpenAI and Microsoft Accused of Scraping and Exploiting Private Data for AI Training",
    "OpenAI and Microsoft face new class-action lawsuit over ChatGPT",
    "OpenAI Faces Class-Action Lawsuit Over Alleged Data Theft by ChatGPT",
    "Authors Sue OpenAI Claiming Mass Copyright Infringement of Hundreds of Thousands of Novels",
    "OpenAI and Microsoft Hit With $3 Billion Data Theft Lawsuit",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "Online Hate and Harassment: The American Experience 2023",
    "More than half of Americans have experienced online harassment, says ADL report",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech is Up on Twitter Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey"
]