[
    "Apple's new Proton-like tool can run Windows games on a Mac",
    "Bring your game to Mac, Part 1: Make a game plan - WWDC23 - Videos",
    "Wine comes to macOS: Apple's Game Porting Toolkit powered by CrossOver source code",
    "Apple hid something AMAZING for Mac gaming at WWDC",
    "Apple's new toolkit makes it easier for developers to bring Windows games to Mac",
    "Unleashing the Gaming Revolution: CrossOver Mac's DirectX 12 Support Update!",
    "Apple Makes Developer Betas Free for All",
    "CrossOver announces DirectX 12 support coming to macOS this summer",
    "Apple is stealing a trick from the Steam Deck for macOS gaming",
    "Apple introduces Proton-like emulation for Windows games on Macs",
    "Windows games can run on Mac thanks to Apple's Proton-like Game Porting Toolkit",
    "Apple simplifies porting Windows games to Mac",
    "Apple's Game Porting Toolkit Can Run DirectX 12 Games on macOS",
    "New DirectX 12-to-Metal translation could bring a world of Windows games to macOS",
    "Apple unveils new Game Porting Toolkit that runs Windows games on Mac",
    "Mac Gaming to Gain DirectX 12 Support via CrossOver 23",
    "Stanford Cyber Policy Center",
    "Addressing the distribution of illicit sexual content by minors online",
    "Meta vows to take action after report found Instagram's algorithm promoted pedophilia content",
    "Meta is setting up a taskforce after Instagram was found to guide users to child-sex context",
    "Meta starts task force in fight against child pornography on Instagram",
    "Instagram algorithm boosted ‘vast pedophile network,’ alarming report claims",
    "Instagram's Algorithm Promotes and Connects ‘Vast’ Network of Pedophiles",
    "Meta now lets you buy blue tick for your Facebook, Instagram profile in India",
    "Extremely concerning [image]",
    "Well this seems terrible https://www.wsj.com/...",
    "Instagram Connects Vast Pedophile Network $META https://www.wsj.com/...",
    "Amazon is mulling an ad-supported Prime Video tier",
    "Amazon to Launch Prime Video Plan With Ads, Report Says",
    "Amazon is reportedly planning to launch an ad-supported tier on Prime Video",
    "Amazon Plans to Launch Ad-Supported Prime Video Tier",
    "Amazon Prime Video is reportedly planning an ad-supported tier",
    "Are Ad-Supported Tiers of Max, Paramount+ Coming to Prime Video Channels?",
    "Amazon reportedly plans ad-tier for Prime Video streaming service",
    "Prime Video Planning Ad Tier, Report Says",
    "Amazon to Launch Ad-Supported Tier for Prime Video: Report",
    "How to cancel Amazon Prime Video channel and app subscriptions",
    "Every streaming network be like “what if we invented... television” https://twitter.com/...",
    "Everything is an ad network. https://www.wsj.com/...",
    "Apple previews new features coming to Apple services this fall",
    "Here's What's New for CarPlay on iOS 17 Ahead of Next-Generation CarPlay Later This Year",
    "Need to charge your EV? Apple Maps will show open spots near you",
    "Apple Maps is finally getting offline navigation",
    "Apple to expand how digital IDs can be used this fall",
    "Apple Announces Businesses Can Accept iPhone IDs Later This Year",
    "Apple adding new Apple Music Collaborative Playlists with iOS 17",
    "More features are coming to Apple devices alongside iOS 17",
    "iOS 17 will add support for recurring payments to Apple Cash",
    "WWDC: 25+ new Apple Services features coming this fall",
    "These are all the features coming to Apple services this fall",
    "Apple Highlights the Best New Features Coming to its Services",
    "Apple Highlights New Features Coming to Apple Services This Fall",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Priceline Partnering with Google on New AI Tools",
    "Priceline joins A.I. chatbot race, signing on with Google to help ease travel booking",
    "Priceline partners with Google to deploy generative AI",
    "Priceline Charts Businesswide Generative AI Deployments with Google Cloud",
    "Google Brings AI to Priceline to Help Plan Your Vacations",
    "Google and Mayo Clinic Partner to Infuse AI Into Health Care",
    "Google Cloud and Mayo Clinic to explore uses of generative AI in healthcare",
    "Google Cloud Collaborates with Mayo Clinic to Transform Healthcare with Generative AI",
    "Google Cloud, Mayo Clinic Strike Generative AI Partnership",
    "Use AI to regulate AI, Google executive says",
    "Google Cloud and Mayo Clinic Developing Generative AI for Healthcare",
    "Google Cloud teams with Mayo Clinic on generative AI effort",
    "Mayo Clinic, Google Cloud partner on generative AI to power enterprise search",
    "Mayo Clinic to Deploy Google Cloud's Generative AI Capabilities",
    "Google Cloud, Mayo Clinic make generative AI play",
    "Google Cloud and Mayo Clinic to boost healthcare efficiency with genAI",
    "Google Cloud lays out generative AI partnerships, Mayo Clinic deal, customer wins",
    "Google, Mayo Clinic Launch Generative Artificial Intelligence Collab",
    "Mayo Clinic to use Google Cloud for generative AI trials",
    "STAT+: Google strikes deal with Mayo Clinic to comb patient records using generative AI",
    "WordPress has a new AI tool that will write blog posts for you",
    "Meet Your New Creative Writing Partner — The Jetpack AI Assistant",
    "Introducing Jetpack AI Assistant in WordPress.com",
    "WordPress is getting an AI assistant that will write blog posts for you",
    "WordPress's New AI Tool Can Write Entire Blog Posts For You",
    "I hate WordPress' new generative AI tool - and you should too",
    "WordPress gets an AI assistant that can write blog posts, correct grammar, translate content",
    "Wordpress' Jetpack AI will write your blog posts for you",
    "WordPress Now Has An OpenAI Powered Content Generator - Free Access Available",
    "Wordpress' New AI Lets You Blog Without Actually Blogging",
    "Lionel Messi to join Inter Miami after leaving PSG",
    "Messi's move to MLS is a big deal for Apple",
    "MLS, Inter Miami Reportedly in Talks to Sign Lionel Messi",
    "Lionel Messi's MLS Move Already Improving Inter Miami Odds",
    "Lionel Messi Agrees To Join Inter Miami: Reports",
    "Apple to offer Messi MLS revenue share to seal move to Inter Miami",
    "Lionel Messi, Soccer's Most Coveted Free Agent, Picks Miami",
    "Lionel Messi Docuseries Gets Green Light At Apple TV+",
    "Report: Lionel Messi Will Come To MLS And Join Inter Miami",
    "Lionel Messi to Reportedly Join American Soccer Club Inter Miami",
    "Barcelona Paris Saint-Germain Argentina Apple TV+",
    "Messi has decided. His destination: Inter Miami Leo Messi se va al Inter Miami",
    "MLS broadcaster Apple TV tweeted about Messi to Miami before deleting the tweet. [image]",
    "so this is what swayed his decision https://twitter.com/...",
    "MLS, Apple, and Adidas preparing the Messi deal https://twitter.com/... [image]",
    "they're so funny for this [image]",
    "Twitch apologises as streamers leave after adverts row",
    "Twitch bans stream sponsor overlays, and “I've never seen creators so pissed”",
    "Twitch rolls back controversial ad guidelines after outcry from creators",
    "Twitch Is Shafting Streamers, Again",
    "Twitch responds to overwhelming backlash toward new ad policies",
    "Twitch Continues To Excel At Bad Decisions And Worse Communication",
    "Adin Ross Names Two Big Streamers Who Are Not Allowed on Kick",
    "Twitch Takes Steps To Limit Sponsorships For Streamers And Then Takes A Step Back",
    "“This is f*cking everybody over” Asmongold on Twitch's new brand guidelines [video]",
    "@dangillmor@mastodon.social",
    "@metacurity@infosec.exchange",
    "Big Tech rolls back misinformation measures ahead of 2024",
    "Minecraft officially launches for Chromebooks",
    "The best Chromebooks for students (and how to choose the right one)",
    "Minecraft is Now Officially Available on Chromebooks",
    "Minecraft for Chromebook FAQ",
    "Build the world of your dreams: Minecraft officially launches on Chromebooks",
    "Minecraft for Chromebooks officially launches",
    "Minecraft now available natively on Chromebooks",
    "Minecraft For Chromebooks Exits Early Access - Here Are The Machines It'll Run On",
    "Minecraft: Bedrock Edition is Now Officially Available for Chromebooks",
    "Minecraft is releasing a new version for Chromebooks",
    "Minecraft: Trails and Tales update is live, along with official Chromebook support",
    "Minecraft arrives on the Play Store for all Chromebook users",
    "Minecraft for Chromebook has finally arrived",
    "Minecraft Leaves Early Access, Fully Launches on Chromebooks",
    "Minecraft is now available on Chromebook",
    "HealthcareInfoSecurity.com",
    "@dannyjpalmer@infosec.exchange",
    "Russian-speaking cyber gang claims credit for hack of BBC and British Airways employee data",
    "Ransomware group Clop issues extortion notice to ‘hundreds’ of victims",
    "Clop cyber gang claims MOVEit attack and starts harassing victims",
    "BBC, British Airways among big-name victims in MOVEit software hack",
    "Clop Ransomware Gang Asserts It Hacked MOVEit Instances",
    "Feds: Florida Man Pleads Guilty In Counterfeit Cisco Case",
    "Cisco Counterfeiter Pleads Guilty to $100m Scheme",
    "Florida man (not that one) sold $100M-plus in counterfeit network gear",
    "How US-China tensions shattered Sequoia's venture capital empire",
    "Sequoia Capital Announces Upcoming Split amid Growing Brand Confusion and Other Reasons",
    "Venture Capital Giant Sequoia Spins Off China and India Units",
    "Will greater local autonomy take Sequoia to new heights?",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "What Sequoia Should Have Said  —  I remember my jaw dropping last year when The Information's …",
    "Sequoia splits China and India arms from US mothership",
    "Reddit Blackout Planned In Protest Of API Fee Change, What You Need To Know",
    "The 12 best third-party Reddit apps for your phone or tablet",
    "Why Some Major Subreddits Are Going Dark for 48 Hours",
    "Unlock new insights with Azure OpenAI Service for government",
    "The Defense Department Now Has GPT-4 Thanks to Microsoft",
    "Microsoft to offer OpenAI's GPT models to government cloud customers",
    "Microsoft will provide the US government agencies with OpenAI's GPT-4 AI model",
    "Microsoft unveils OpenAI service for government customers",
    "Microsoft Azure OpenAI Service now available for government customers",
    "Microsoft launches generative AI service for government agencies",
    "Announcing our $20m seed round to build the next generation of language models",
    "Introducing Our Latest Investment: Contextual AI",
    "Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Yes, you'll be able to keep ‘Hey Siri’ as Siri's only trigger phrase",
    "Apple Makes Developer Betas Free to Download and Install",
    "How to install the free iOS 17 developer beta",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple adds a free tier for its developer program",
    "How to install the iOS 17 beta on your iPhone",
    "Apple is making developer betas free and accesible to everyone",
    "Now anyone can download the iOS 17 Developer Beta 1 for free",
    "4 Reasons Why You Shouldn't Install the iOS 17 Beta on Your iPhone",
    "Apple makes iPhone developer accounts (and betas) free for everyone",
    "Apple's iOS 17 Developer Beta is now free for everyone — but some users are furious",
    "Apple makes downloading iOS 17, iPadOS 17 and other developer betas free",
    "iOS 17, iPadOS 17 Developer Beta Available For Free For All",
    "Apple will let you install its newest developer betas right now — for free",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Apple makes OS betas free for all users",
    "Apple's iOS 17 developer beta is now free to install",
    "It wasn't a mistake — Apple betas are now free",
    "Apple Developer Program access no longer requires $99 subscription",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple's iOS 17 developer beta is available for free",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "How to get iOS 17 — Quick! You might get it for free",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "iOS 17 Developer Beta made available to all",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "iOS 17 beta is here, but only for developers",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "@williamgunn@mastodon.social",
    "Group chats between Android and iOS might be getting better — but only for iPhones",
    "iOS 17 makes iMessage group chats with Android users more bearable - sort of",
    "iOS 17 will make green bubble group chats better, but only for iPhones",
    "Apple quietly tests iMessage feature that might reduce green bubble bullying",
    "iOS 17 will make life worse for Android users - here's why",
    "iOS 17 might just make iPhone owners hate green bubbles less",
    "iOS 17 swerves around Android to fix green bubble group chats for iPhones",
    "Chatting with iPhone users from Android will be even worse in iOS 17",
    "Can crypto survive in Biden's America?",
    "Explainer: -What makes a crypto asset a security in the U.S.?",
    "Prices of Some Crypto Coins Drop After SEC Says They're Securities",
    "The SEC Says These Crypto Assets Are Securities: Their Reasoning Is Wrong",
    "The Feds Are Going After Coinbase. But They Have a Bigger Target.",
    "SEC lawsuits against Coinbase and Binance could result in massive payday for lawyers",
    "SEC charges Coinbase over illegally listing securities",
    "Crypto Crackdown: Coinbase and Binance Lawsuits Shake Markets",
    "Why did the SEC let Coinbase go public?",
    "Seven bombshells from the SEC's Coinbase suit",
    "Coinbase is being sued by the SEC",
    "Coinbase sued by SEC in New York Federal court",
    "International Business Times",
    "Will Recent U.S. Crackdown On Crypto Affect Venture?",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "U.S. Securities and Exchange Commission",
    "Binance and Coinbase Show Knives Out for Crypto",
    "SEC lawsuits against Binance and Coinbase unify the crypto industry",
    "‘Fundamental Difference’ Between SEC's Binance, Coinbase Suits",
    "Breaking Down the SEC's Double Whammy",
    "Crypto industry unites as SEC targets Binance and Coinbase",
    "Billionaire Mike Novogratz Predicts SEC Lawsuits Will Continue Ahead",
    "Coinbase CEO Brian Armstrong Unfazed By SEC Lawsuit",
    "Binance, Coinbase CEOs Collectively Lost $1.7 Billion Of Personal Wealth After SEC Crackdown",
    "No More Wild West: SEC Introduces New Era for Crypto",
    "Binance and Coinbase CEOs lose billions over SEC suit",
    "Binance Lawsuit: SEC Now Considers 61 Cryptocurrencies as Securities",
    "Crypto CEOs See Wealth Crushed After SEC's Twin Lawsuits",
    "Crypto chaos as the sector faces SEC crackdown",
    "With Coinbase lawsuit, the US ramps up crypto crackdown",
    "Free Figma template of onboarding & activation designs",
    "Replika's New AI App Is Like Tinder but With Sexy Chatbots",
    "Introducing Blush, the AI that Improves Romantic Intimacy and Gives Real-Life Dating a Boost",
    "The creators of Replika unveil a new AI dating app called Blush",
    "United States District Court for the District of Columbia",
    "Press Release SEC Seeks Emergency Relief to Ensure Binance.US Customers' Assets are Protected",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "Binance.US Customers Withdrawing Crypto in Aftermath of SEC Lawsuit",
    "Binance CEO's trading firm received $11 bln via client deposit company, SEC says",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "Evidence in SEC suit includes 2022 testimony of Binance.US' long silent ex-CEO",
    "Binance.US To Remove Over 100 Trading Pairs by Thursday Days After SEC Charges",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "CZ Charges: Will DoJ Charge Binance Chief Changpeng Zhao With Fraud, Other Offences?",
    "Asset Freeze Bombshell: SEC Takes Aggressive Stand Against Binance.US",
    "Bitcoin price commands premium on Binance.US after SEC lawsuit",
    "SEC's probe on Binance.US was initiated in 2020, recent court filings reveal",
    "Binance.US Says SEC Lawsuit Is Unjustified",
    "Bitcoin Trades for a Premium on Binance.US Amidst SEC Lawsuit",
    "SEC seeks to freeze $2bn in Binance.US assets, Coinbase vows to take legal fight to Supreme Court",
    "SEC Goes to War With Crypto: Bitcoin Pumps!",
    "SEC Files Emergency Action Application To Freeze Binance.US Assets",
    "SEC Seeks Freeze of Binance.US Assets",
    "Woo: “Binance customers don't care” about SEC enforcement action",
    "SEC files motion for restraining order to freeze Binance US assets",
    "SEC Seeks to Freeze Binance.US Assets, Files Temporary Restraining Order",
    "Binance says US users' crypto is safe after SEC files to freeze assets",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "SEC Seeks Court Approval to Freeze Binance US Crypto Assets, Citing Customer Safety Concerns",
    "SEC Wants to Freeze Binance Assets to Protect US Customers",
    "[DB] SEC Seeks Temporary Restraining Order to Freeze Binance US Assets: Court Filing",
    "OMG OMG OMG OMG OMG [image]",
    "Her name was Catherine Coley",
    "Withdraw from Binance US if you have any funds on the platform. https://twitter.com/...",
    "🤔 I wonder if Catherine Coley was an informant? https://www.cnbc.com/...",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "Elusive Ex-Binance.US CEO Catherine Coley Reemerges in SEC Suit",
    "Binance.US addresses SEC motion amid assets freeze concerns",
    "SEC Accuses Binance.US, CZ of Billion-Dollar Investor Fund Risk",
    "SEC Files Motion To Freeze Assets Of Two Binance.US Units",
    "Binance.US Says Customer Funds Are Safe As SEC Requests Restraining Order To Freeze Assets",
    "SEC seeks freeze on Binance.US assets amid claims",
    "SEC seeks express court order to freeze BinanceUS's assets",
    "Binance.US raked in $410 million of revenue since inception, accounts show",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Marketing strategies & tips for startups",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/07 - Maybe Apple DOES Want To Get Serious About Mac Gaming",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta to introduce new accounts centre after talks -German cartel office",
    "Germany welcomes Meta plan for ‘more transparent’ data use",
    "Meta to give users more control over data following German antitrust order",
    "Amazon Pay taps Affirm to be its first buy now, pay later player",
    "Amazon Pay Adds Affirm, Providing Customers and Merchants with Another Flexible Payment Option",
    "San Francisco Business Journal",
    "OpenAI's Sam Altman complained chip shortage ‘delaying’ ChatGPT plans: deleted post",
    "This Is How Sam Altman Works the Press and Congress. I Know From Experience.",
    "Tim Cook reveals he uses ChatGPT and comments on Apple's keen observation of the technology",
    "OpenAI Inc. CEO Sam Altman says company won't compete with its clients",
    "OpenAI still not training GPT-5, Sam Altman says",
    "ChatGPT Maker OpenAI Is Staying Private So It Can Make ‘Strange’ Decisions",
    "Salesforce CEO Benioff shakes up executive team with new hires",
    "Daily Digest: Marc Benioff tips hand on Salesforce succession plans; Layoffs at Reddit",
    "Salesforce CEO Benioff shakes up top ranks - source",
    "Louis Vuitton Vends $41k NFTs to Elite Customers",
    "Louis Vuitton To Debut New NFT Collection For Top Customers",
    "Digital Luxury Unleashed as Louis Vuitton Presents NFT ‘VIA Treasure Trunk’ Experience",
    "Louis Vuitton Selling $41K NFTs That Can't Be Resold",
    "Louis Vuitton Set to Launch $42,000 Physical-Backed NFT Trunks",
    "Louis Vuitton embraces Web3, launches its iconic trunk as a digital collectible",
    "Louis Vuitton To Release $42,000 Physical-Backed NFTs",
    "Tingo Group: Fake Farmers, Phones, and Financials—The Nigerian Empire That Isn't",
    "Fintech Tingo's shares slump as Hindenburg takes short position",
    "Tingo lost 94% of value of US-traded shares in 16 months before Hindenburg published allegations",
    "Tingo Group Refutes Malicious and Misleading Allegations in Hindenburg Research Report",
    "The Tingo Tangle: Hindenberg Research Alleges Fabricated Figures, An ‘Exceptionally Obvious Scam’",
    "👨🏿‍🚀TechCabal Daily - An “exceptionally obvious” Bingo play?",
    "US-Listed Nigerian ‘Agri-Fintech’ Firm Tingo Rocked By Allegations Of Brazen Fraud",
    "Hindenburg Research publishes investigation into fintech Tingo Group claiming financial fraud",
    "Shortseller Hindenburg Research calls Tingo Group an exceptionally obvious scam",
    "That @HindenburgRes report on tingo is devaststing",
    "The A.I. safety debate isn't just polarized—it's worse than that",
    "Cyberdefenders respond to hack of file-transfer tool",
    "EU considers mandatory ban on using Huawei to build 5G - FT",
    "Huawei could be banned from 5G networks across the EU",
    "EU mulling 5G ban for Huawei and others report",
    "The Download: ocean-based carbon removal, and Musk's untweeted trip to China",
    "EU considering ban on Huawei 5G - FT",
    "Everyone points to Huawei.  But ZTE is still all over the place",
    "e-Conomy India 2023  —  Executive Summary A continued shift in consumer and merchant behaviour …",
    "Smaller cities key to India's digital decade",
    "India's digital economy to register 6x growth, reach $1 trillion by 2030",
    "'India's Internet economy to reach $1 trillion by 2030'",
    "India's Internet Economy To Grow Sixfold To $1 Trillion By 2030, Says Google-Temasek-Bain Report",
    "India's internet economy to reach $1T by 2030, contribute 12-13% to GDP: Report",
    "India's Internet economy to grow six-fold to $1 trillion by 2030",
    "India's internet economy to reach US$1 trillion by 2030: Google, Temasek and Bain & Company report",
    "e-Conomy India 2023: Strategies for growth in India's digital decade",
    "GetHarley secures $52M in funding to revolutionize the medical aesthetic industry",
    "GetHarley raises £42m for digital dermatological platform",
    "GetHarley Closes $52 Million Funding Round Led by Index Ventures",
    "GSoft announces CA$125 million investment from CDPQ to accelerate growth strategy",
    "Caisse Invests $93 Million in GSoft to Fund Global Acquisitions",
    "Samsung Expected to Show Off Galaxy Z Flip 5 in First-Ever Seoul Unpacked",
    "It's official - Samsung will launch the Galaxy Z Flip 5 and Z Fold 5 in late July",
    "The Galaxy Z Fold 5 and Z Flip 5 are coming sooner than expected",
    "Samsung's next foldable-focused Galaxy Unpacked will take place in late July",
    "Samsung Foldable Unpacked to be held in South Korea this year",
    "Samsung's Galaxy Unpacked will take place in South Korea",
    "Samsung picks Seoul to unveil new foldable phones for 1st time",
    "Samsung confirms details about its upcoming Galaxy Unpacked event: Here's what we know",
    "Samsung will focus on foldables in its upcoming July Unpacked event",
    "Samsung's new foldables will be launching this July",
    "The Galaxy Z Flip 5, Fold 5 are officially coming earlier than expected",
    "BREAKING: Samsung confirms Galaxy Z Flip 5, Z Fold 5 will launch in July",
    "Its official: Samsung Galaxy Z Fold 5 launching on July 26 in Korea",
    "Official: Samsung confirms first Korea Unpacked, Galaxy Z Fold 5 launch on July 27",
    "Samsung confirms Galaxy Unpacked 2023 event in July: What to expect",
    "Samsung Galaxy Unpacked 2023: New foldables launching in Seoul next month [details]",
    "Samsung's next Unpacked event is all about foldables - and it's happening sooner than usual",
    "Samsung's next-generation foldables will be revealed at Galaxy Unpacked in July",
    "Samsung Galaxy Z Fold 5 and Flip 5 launching late July at Unpacked in South Korea",
    "Samsung confirms Galaxy Z Flip 5, Fold 5 launch details",
    "Samsung Confirms Galaxy Unpacked for Galaxy Fold 5 Happening in July",
    "The press release (archived): [image]",
    "Instagram is apparently testing an AI chatbot that lets you choose from 30 personalities",
    "Meta's Instagram Is Rumoured to Launch AI Chatbots With 30 Personalities",
    "Instagram reportedly testing an AI chatbot with 30 personalities to choose from",
    "Instagram will soon release an AI chatbot, what if its actually risky",
    "Instagram Reportedly Developing AI Chatbot With 30 Personalities",
    "Instagram AI chatbot is in the works - a new companion is coming",
    "Social-Media-Platform-Instagram- Possibly-Working-on-an-AI-Chatbot",
    "Instagram may be looking into ways of thinking instead of its users",
    "Instagram reportedly testing an AI chatbot with 30 personalities",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Instagram works on AI Chatbots in DMs",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response"
]