[
    "Instagram's Threads surpasses 100 million users",
    "Twitter's future is in doubt as Threads tops 100 million users",
    "Instagram Threads hits 100 million users, becoming easily the fastest growing app ever",
    "Threads already has 100 million users, and a surprising number of them are on Android",
    "Meta's Threads races to 100 million users in under a week",
    "Threads Hits 100 Million Users Faster Than ChatGPT. Now It Needs Them to Stay.",
    "Threads hits 100 million users in just 5 days, toppling record set by ChatGPT",
    "Meta's ‘Threads’ reaches 100 million users, and now you can follow us there too",
    "All the major retailers have started using Meta's new Threads platform — except Costco",
    "Threads hits 100 million users in five-day record surge",
    "Threads app signs up 100m users in less than a week",
    "Zuck Mocks Musk as Threads Hits 100 Million Users",
    "Meta's Twitter rival Threads overtakes ChatGPT as fastest-growing platform",
    "Threads is the fastest-growing app in history with 100 million new users in less than a week",
    "Threads becomes fastest-growing app ever, with 100 million users in under a week",
    "Meta's Threads reaches 100M users, despite delayed EU launch",
    "Threads will soon allow users to view a chronological feed",
    "Instagram Threads Sets An App Record With Over 100 Million Users In Under A Week",
    "Threads Hits 100 Million Users Days After Launch",
    "Meta's new Threads app ‘murderous’ for phone batteries, users say",
    "Threads Reaches 100 Million Members in Record Time",
    "Threads Has Passed 100 Million Users in Less Than One Week",
    "Threads passes another huge user milestone",
    "Meta's Twitter competitor ‘Threads’ surpasses 100 million users",
    "Threads hits 100 million users in less than five days",
    "Threads number of users exceeds 100 million sign-ups, while Twitter tanks",
    "Instagram's Threads crosses 100 Mn users, India drives download growth",
    "Meta's new ‘Twitter killer’ app, Threads, hits over 100 million users",
    "Meta's App Threads Reaches 100 Million Users - This Is Why",
    "Instagram's Threads Hits 100M Users to Become Fastest-Growing App Ever",
    "Instagram's Threads Crosses 100 Million Users in Five Days to Become Fastest Growing App",
    "Twitter rival Threads signs up 100 million users in five days",
    "Meta's New Social App Threads Surpasses 100M Users in One Week",
    "Meta's Threads app is on track to 100 million users as it reaches 70 million in just 5 days",
    "Instagram Threads reaches 100 million users in just 5 days",
    "As Threads Hits 100 Million Users, Musk Ramps Up Rivalry",
    "Threads Hits 100 Million Sign-Ups in Just 5 Days",
    "Threads reaches 100 million users",
    "Meta's firehose (or: the wrong lesson from Threads' 100MM users)",
    "Apple Plants Roots in Threads as Users Approach 100 Million",
    "100 million “sign ups”. Wonder what usage looks like. [image]",
    "It really should just count as instagram. This wasn't organic growth. https://twitter.com/...",
    "more than 1/5th of Twitter now. https://twitter.com/...",
    "@themckenziest.bsky.social",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Threads hits 100 million sign-ups within first week",
    "Twitter's traffic is taking a dive, according to Cloudflare's CEO.",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "Elon Musk says ‘Zuck is cuck’ as Threads inches closer to 100m users",
    "ElonJet, the banned Twitter bot that tracked Elon Musk's jet, is now on Threads",
    "Twitter traffic really is tanking, Cloudflare reveals, but is anyone that surprised?",
    "Twitter vs Threads: Musk gets personal, punches below the belt in battle with Zuckerberg",
    "Musk Melts Down as Threads Nears 100M Users: ‘Zuck is a Cuck’",
    "Elon Musk snipes ‘Zuck is a cuck’ about Meta boss Zuckerberg after rival Twitter app launch",
    "Elon Musk calls Mark Zuckerberg a “cuck” and proposes a “dick” measuring contest",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "Twitter traffic tanking. https://radar.cloudflare.com/ domains [image]",
    "@brettdash_ @charliewrich Censorship pays them well",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "META'S TWITTER RIVAL THREADS OVERTAKES CHATGPT AS FASTEST-GROWING PLATFORM $META",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "The censorship on Meta's new app is insane. They even want to control whom you follow. [image]",
    "Elon: Protects free speech Zuck: Protects brand speech https://twitter.com/... [image]",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "Zuck is actually doing it lmaooooo [image]",
    "A @Techmeme headline for the history books [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "@SOClALRATE This platform will protect anons for this reason particularly",
    "International Association …",
    "Social networks can keep storing EU user data in the US under new agreement",
    "Europe signs off on a new privacy pact that allows people's data to keep flowing to US",
    "European Commission gives EU-US data transfers third round at CJEU",
    "EU adopts more robust data privacy agreement with US",
    "New EU deal legalizes transatlantic data transfers once again",
    "EU, US attempt to escape data-flows limbo with new transatlantic deal",
    "EU and US agree new transatlantic data transfer deal",
    "The Privacy Advisor European Commission adopts EU-U.S. adequacy decision",
    "U.S. and E.U. Finalize Long-Awaited Deal on Sharing Data",
    "EU-US data-sharing deal comes into force amid threats of legal challenge",
    "EU signs off on data transfers deal with US",
    "International Business Times",
    "Foxconn, Vedanta committed to semicon mission, make in India: Union Minister Ashwini Vaishnaw",
    "iPhone manufacturer drops $19.5 billion chip production deal with firm in India",
    "Foxconn withdraws from $19.5bn chip JV with India's Vedanta",
    "Apple supplier Foxconn pulls out of $19.5 billion India chip project",
    "India Billionaire's Chip Foray Faces Setback as Foxconn Exits",
    "Foxconn's withdrawal from JV for chip manufacture has no impact on India's chip dream; here's why",
    "Foxconn withdraws from $19.5 billion semiconductor joint venture project with Vedanta",
    "Foxconn Pulls Out Of $19.5 Bn Semiconductor Manufacturing JV With Vedanta",
    "Foxconn Withdraws from Indian Semiconductor Joint Venture with Vedanta",
    "Timeline of the $19.5 billion Foxconn-Vedanta chip plan in India",
    "Foxconn pulls out of $19.5 billion India chip joint venture",
    "India's Vedanta to take over Foxconn chip joint venture from holding company",
    "Foxconn dumps $19.5 bln Vedanta chip plan in blow to India",
    "Foxconn Dumps $19.5 Billion Chip Plan in Blow To India",
    "What AI can do with a toolbox... Getting started with Code Interpreter",
    "Best 30 Prompts for ChatGPT's Code Interpreter: No Code Data Visualization",
    "ChatGPT's Code Interpreter - Top 6 uses",
    "OpenAI's Code Interpreter Brings New Power to ChatGPT Plus",
    "Analyzing Humanitarian Data Unstructured Excel Tables with ChatGPT Code Interpreter",
    "OpenAI-Releases-Code-Interpreter- Plugin-for-ChatGPT-Plus-Users",
    "ChatGPT introduces new code interpreter feature to all ChatGPT Plus users",
    "ChatGPT Code Interpreter Released: Here are 10 Mind-blowing Use Cases",
    "ChatGPT's new feature, code interpreter, is now available to all plus subscribers",
    "Massachusetts might ban sales of cellphone location data.",
    "This is an excellent step... https://twitter.com/...",
    "First U.S. ban on sale of cellphone location data might be coming",
    "Evernote has laid off most of its US staff and will move most operations to Europe",
    "Moving the Evernote center of operations to Europe",
    "Evernote layoffs announced after sale of company; relocates to Europe",
    "Evernote Lays Off Most of Staff, Triggering Fears of Closure",
    "Evernote lays off US-based employees as it shifts base to Europe",
    "Evernote lays off most of its US workers and will relocate its base of operations to Europe",
    "Evernote fires nearly every US employee as it shifts operations to Europe",
    "Evernote lays off US employees and moves to Europe",
    "Early App Store star Evernote is packing up its trunk, leaving the U.S., and is moving to Europe",
    "Evernote undergoes major layoffs, shifts operations to Europe",
    "For your eyes only, my unedited 2013 TIME Magazine story about Evernote",
    "Evernote is relocating to Europe after laying off most of its US workforce",
    "Evernote is laying off staff and relocating to Europe",
    "in a blistering defeat for nominative determinism, evernote not looking very ever [image]",
    "What's going on at Evernote? I'd move my notes away from there if I had any [image]",
    "Old enough to remember when Evernote was on track to be a 100-year startup https://twitter.com/...",
    "Not good news for us Evernote fans. https://news.ycombinator.com/ ...",
    "Tell HN: Nearly all of Evernote's remaining staff has been laid off",
    "Bay Area tech company Evernote lays off most staff, relocating to Europe",
    "Sarah Silverman sues Meta, OpenAI for copyright infringement",
    "Sarah Silverman sues OpenAI and Meta claiming AI training infringed copyright",
    "Not Funny: Sarah Silverman Sues ChatGPT and Meta After AI Allegedly Trained on Her Book",
    "Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "These authors are suing OpenAI and Meta for copyright infringement now",
    "Comedian Sarah Silverman sues OpenAI and Meta over copyright infringement",
    "Sarah Silverman Sues Meta, OpenAI For Copyright Infringement",
    "Sarah Silverman sues OpenAI, Meta over use of her book in training AI programs",
    "Comedian Sarah Silverman, authors join class-action lawsuits against Meta Platforms, OpenAI",
    "Sarah Silverman Sues Meta, OpenAI for Copyright Infringement of Her Memoir ‘The Bedwetter’",
    "What Can Help Meta and OpenAI Potentially Win the Copyright Infringement Lawsuits?",
    "Sarah Silverman sues Meta and OpenAI for copyright violations",
    "Authors sue OpenAI and Meta in latest generative AI lawsuit",
    "Popular comedian and author sues ChatGPT maker OpenAI and Meta for copyright infringement",
    "Comedian Sarah Silverman Takes on Meta and OpenAI in Copyright Infringement Lawsuit",
    "Sarah Silverman Sues OpenAI And Meta Over Copyright Infringement",
    "Sarah Silverman, novelists sue OpenAI for scraping their books to train ChatGPT",
    "Authors sue Meta and OpenAI for possible AI copyright infringement",
    "Authors sue OpenAI and Meta for copyright infringement",
    "OpenAI, Meta Hit With Copyright Infringement Lawsuit Led by Sarah Silverman",
    "Sarah Silverman sues OpenAI and Meta for copyright infringement",
    "Sarah Silverman Sues Meta, OpenAI for Training AI Models on Her Book",
    "Comedian Sarah Silverman Sues OpenAI, Meta for Copyright Infringement",
    "Comedian Sarah Silverman, 2 authors file copyright infringement lawsuits against Meta, OpenAI",
    "Sarah Silverman, authors sue Meta, OpenAI for alleged copyright infringement",
    "Sarah Silverman Sues ChatGPT's Creator Over Alleged Copyright Infringement",
    "This is why comedian Sarah Silverman is suing OpenAI, the company behind ChatGPT",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement.",
    "Revolut lost $20 million to criminals exploting payment loophole",
    "A flaw in Revolut US payments resulted in the theft of $20 Million",
    "Hackers Exploit Flaws in Revolut's Payment System, Stealing $20 Million",
    "Hackers steal millions after cracking Revolut payment systems",
    "Thieves steal $20m via Revolut US payment flaw",
    "Report: Revolut US Payments Flaw Leads to $20 Million Theft",
    "Flaw in Revolut payment systems exploited to steal $20 million",
    "Hackers Steal $20 Million by Exploiting Flaw in Revolut's Payment Systems",
    "Thieves Stole $20 Million Via Revolut US Payment Flaw, FT Says",
    "yeah this is why regulators are paying closer attention. good. https://www.ft.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "@carlypage@mastodon.social",
    "A major UK hospital trust is investigating a ransomware attack.",
    "TSMC Records High Sales amid Increased Demand for AI Tools and Chips",
    "Personalized wealth management, built for tech people",
    "2 essentials, because too many sales tools spoil the art of selling",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Ampere: Help us build the future of the cloud.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Mon. 07/10 - Evernote Deadpool?",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Could fitness propel VR into the mainstream spotlight?",
    "Apple's taking it slow with the Vision Pro",
    "Move over teenage gamers - women wanting to get fit are the new frontier for VR headsets",
    "Snap is teaming up with Linktree to let users include links in their profiles",
    "Snapchat Reportedly Reaps Benefits From Creator Revenue-Sharing Program",
    "Some of Snapchat's creators are doing well for themselves.",
    "Peak XV says will ‘collaborate’ as HongShan makes Southeast Asia entry",
    "Sequoia's Chinese unit to set up base in Singapore",
    "Sequoia China to compete with Peak XV in Singapore",
    "HongShan sets up Singapore office for SE Asia bets: Report",
    "Sequoia China enters Singapore, sparking competition with Indian branch: report",
    "Google is testing its medical AI chatbot at the Mayo Clinic",
    "Google's medical AI chatbot is already being tested in hospitals",
    "Your next medical consultation could be assisted by Google's AI chatbot",
    "AI doctors? Google already testing AI chatbots similar to Bard, ChatGPT in hospitals",
    "Google To Test AI Chatbot That Is Trained to Answer Medical Questions",
    "Google's Medical Chatbot is Being Tested in Hospitals",
    "Google testing AI chatbot to expertly answer medical questions",
    "Google is field-testing its generative medical language model in a clinical setting",
    "Google is testing a AI-model to answer all your health-related questions"
]