[
    "The White House on YouTube",
    "Schumer to call for AI regulation in keynote address",
    "Biden meets with tech company critics on AI",
    "Biden meets with AI experts on managing risks",
    "US must manage AI risks to society and national security, Biden says",
    "The Hill's Morning Report — Trump: Double standard in Hunter Biden plea deal",
    "Biden staff are meeting regularly to develop AI strategy, White House says",
    "President Biden Participates in a Meeting on Artificial Intelligence with Civil Society Leaders",
    "President Biden's Vision for AI: Seizing Opportunities and Managing Risks",
    "Biden says there is need to address security, economic risks posed by AI",
    "Biden to discuss dangers of AI in San Francisco meeting with experts",
    "President Biden wraps up Bay Area visit",
    "In San Francisco, Biden says AI has 'enormous promise but comes with risks",
    "Biden to meet with A.I. experts in San Francisco",
    "President Biden Gathers Experts in San Francisco to Discuss Responsible AI",
    "Biden meeting with technology leaders, academics on AI regulation",
    "How the White House is moving into the action phase of its effort to regulate AI",
    "Biden Says He's ‘Very Proud’ of Son Hunter After Plea Deal",
    "This is so important. I hope we get a strong readout of the discussion. https://twitter.com/...",
    "Honored to meet with President Biden. https://thehill.com/...",
    "Important person for Biden to meet on AI issues. https://twitter.com/...",
    "A nuanced and well-researched piece on AI x-risk: https://www.technologyreview.com/ ...",
    "Thousands of Reddit Communities Stay Dark as App Policy Protest Continues",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "What we're learning from the Reddit blackout",
    "Reddit Is Removing Mods Over NSFW Protests",
    "Reddit communities adopt alternative forms of protest as the company threats action on moderators",
    "Uhhhh, What the fuck is happening at /mildlyinteresting???",
    "Reddit starts removing moderators who changed subreddits to NSFW, behind the latest protests",
    "Reddit starts removing moderators behind the latest protests",
    "Removed from /r/searchandrescue, which was public, in retaliation for other subs being private.",
    "Reddit is bringing in scabs to replace mods",
    "Introducing Content Classification Labels",
    "Twitch replaces its mature content mode with more granular ‘labels’",
    "Twitch introduces new content classification labels",
    "Twitch introduces new labels to classify mature content",
    "Twitch adds new labels for streams with mature content",
    "What is Kick, and how does it compare to Twitch?",
    "Twitch streamer catches live purse-snatching outside Gucci store in Paris",
    "Twitch introduces content classification labels",
    "Content Classification Labels",
    "Amouranth Follows xQc's Lead And Leaves Twitch",
    "Twitch's new Partner Plus tier strains an already tense relationship with creators",
    "xQc signs deal to stream on Kick worth up to $100 million",
    "Empowering our Creative Leaders to Drive Growth",
    "EA Sports and EA Games Are Splitting Up",
    "Electronic Arts Restructures, Names New Head of Entertainment",
    "EA announces major restructure, splits EA Entertainment and EA Sports",
    "EA Is Splitting Into Two Separate Organisations",
    "Electronic Arts Restructures Its Studios Into Two Organisations",
    "Electronic Arts is realigning studios into EA Sports and EA Entertainment",
    "EA Games Changes Name After Massive Restructuring",
    "EA Games to Become EA Entertainment in Major Corporate Reshuffle",
    "EA Games And EA Sports Are Splitting In Two To “Empower” Creative Teams",
    "EA Games becomes EA Entertainment, splits from EA Sports in restructuring",
    "EA Games splits with EA Sports and becomes EA Entertainment",
    "EA Implements Reorganization, Divides into EA Entertainment and EA Sports",
    "EA realigns into EA Sports and EA Entertainment divisions",
    "Electronic Arts is restructuring its studios into two organisations",
    "EA splits into EA Entertainment and EA Sports",
    "Electronic Arts Is Changing Its Game Studio Structure Into EA Entertainment And EA Sports",
    "Electronic Arts Shake-Up: New CFO and Studio Reorganization",
    "EA splits Sports and Games in major organization shakeup",
    "Electronic Arts is Splitting into EA Entertainment and EA Sports",
    "EA undergoes C-suite and division restructure",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup - IGN",
    "Amazon Prime Day is back July 11-12! Here are 5 shopping tips to help you prepare.",
    "Best Prime Day AirPods deals 2023",
    "Amazon Prime Day is July 11 & 12 — with new invitation deals",
    "The best Amazon Prime Day deals",
    "Amazon Prime Day is officially coming July 11-12, but the deals actually start right now",
    "Amazon Prime Day 2023 Announced: 48-Hour Sale Kicks Off July 11",
    "Best Prime Day Apple Watch Deals 2023",
    "Will iPhones be cheaper on Prime Day 2023? Our prediction",
    "Amazon will hold its Prime Day shopping event on July 11-12",
    "Amazon Prime Day 2023: 12 early deals and offers to shop now",
    "When is Amazon Prime Day in 2023?  —  Amazon has announced the dates for Prime Day 2023 …",
    "Amazon Prime Day dates are here!",
    "Amazon Prime Day 2023 starts July 11 — here's what to expect",
    "Amazon Prime Day 2023 Dates Officially Announced",
    "Prime Day 2023 start date is July 11 — here are the first confirmed deals",
    "Amazon Prime Day 2023 will take place on July 11th and 12th",
    "Amazon Prime Day kicks off July 11th this year",
    "Amazon Prime Day 2023: July 11 & 12 locked in for the huge sale",
    "Server Subscriptions Just Got Super Powered: Introducing Media Channels, Tier Templates and more!",
    "Discord just ramped up monetization again with new subscription tiers",
    "Discord adds ‘Media Channels’ and tests ‘Server Shop’ feature",
    "Xbox Activision deal allegedly aimed to put PlayStation out of business",
    "Microsoft is rallying its executives to defend Activision Blizzard acquisition in the US",
    "Major FTC Hearing Begins This Week With Microsoft & Activision CEOs In Attendance",
    "Microsoft, Activision CEOs to Defend $69 Billion Deal in Fight With FTC",
    "Microsoft, Activision CEOs on witness list for hearing on FTC bid to block merger",
    "Microsoft CEO Satya Nadella and many Xbox executives are set to defend its FTC case",
    "International Business Times",
    "A message from the CEO  —  Anthony Tan, Group CEO and Co-Founder",
    "Grab cuts around 1,000 jobs in biggest round of layoffs since the pandemic",
    "Singapore's Grab Plans Biggest Round of Job Cuts Since Pandemic",
    "Making sense of Grab's surprising U-turn from ‘no layoffs’ stance",
    "Singaporean superapp Grab delivers massive job cuts with after hours email",
    "Grab cuts 1,000 jobs, its biggest round of layoffs since the pandemic",
    "Tech Layoffs: Grab Cuts 1,000 Jobs; Olx Group Sacks 800 Employees, Closes Some Operations",
    "Singapore ride-hailing firm Grab slashes 1000 jobs in biggest layoff since pandemic",
    "Singapore's Grab cuts 1,000 jobs in first layoffs since 2020",
    "Singapore tech giant Grab to lay off over 1,000 employees",
    "Grab Prepares for Layoffs Amid Slowing Growth",
    "The government is helping Big Telecom squeeze out city-run broadband",
    "YouTube to launch its first official shopping channel in South Korea -Yonhap",
    "How to unsubscribe to a YouTube channel",
    "YouTube to debut live shopping channel in South Korea",
    "YouTube To Launch Its First Official Shopping Channel In South Korea 1",
    "Masayoshi Son is back and it's beautiful",
    "SoftBank's Son Goes Back on Offense to Cement His Tech Legacy",
    "SoftBank's Masayoshi Son Had His Cry. Now He's in Love Again—With ChatGPT.",
    "SoftBank to shift from ‘defense mode’ to ‘offense mode,’ says CEO Masayoshi Son",
    "Masayoshi Son launches ‘offensive’ on tech startups, boosts AI focus",
    "Bernie Sanders Opens Investigation Into ‘Dangerous and Illegal’ Amazon Warehouse Conditions",
    "Bernie Sanders launches Senate investigation into Amazon labor practices",
    "Are Amazon warehouses safe? US Senator Bernie Sanders launches a probe",
    "Bernie Sanders launches Senate probe into Amazon warehouse safety conditions",
    "US Senate is the latest to look into Amazon's warehouse safety practices",
    "Bernie Sanders announces investigation into Amazon's safety record",
    "Bernie Sanders Launches Senate Probe Into Amazon Workplace Safety",
    "Bernie Sanders launches investigation into working conditions at Amazon",
    "Amazon faces Senate probe over warehouse safety",
    "Intel soaks up Europe's chip anxieties and subsidies by the billions",
    "Chipmakers' plans for factories in Europe, US and Asia",
    "Intel spends $48 billion in Germany in landmark expansion",
    "Alibaba's Jack Ma and Joe Tsai show up at offices in Hangzhou amid restructuring",
    "Cloud unit spinoff approaches ‘crucial stage’: Alibaba CEO",
    "Alibaba Restructure Sees Zhang Replaced as CEO; EU to Probe Adobe-Figma Deal",
    "Alibaba's crypto-friendly transition: Joseph Tsai takes the helm as chairman",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Alibaba CEO Daniel Zhang Steps Down, Eddie Wu and Joseph Tsai Step up",
    "Crypto Proponent Joseph Tsai Becomes the New Chairman of Alibaba",
    "Alibaba Names Crypto-Friendly Joseph Tsai as New Chairman",
    "Crypto enthusiast Tsai to steer Alibaba",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Alibaba's New Chairman ‘Likes’ Crypto",
    "Crypto curious Joseph Tsai to take over as chair at Alibaba",
    "Alibaba Shakeup Brings Pro-Crypto Brooklyn Nets Owner to Top of China's Tech Giant",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Ant Group confirms it is working on own AI large language model",
    "17 Best ChatGPT Plugins You Can Use Right Now",
    "Ant Group to develop AI model for ChatGPT-like services",
    "Apple machine learning chief is the new CEO of Allen Institute for AI",
    "Apple's machine learning head departs to run AI thinktank",
    "Allen Institute for Artificial Intelligence (AI2) Announces New CEO",
    "Apple vet to return to Allen Institute for AI as CEO",
    "Apple's ‘next-gen machine learning’ leader departs for AI non-profit",
    "Apple Machine Learning Head Departs to Become CEO of the AI2 Research Institute",
    "Personalized wealth management, built for tech people",
    "Cannes Briefing: TikTok, Netflix, others expand presence at Cannes",
    "Real-time payments infrastructure provider Volt recharges with another $60 million",
    "Payments provider Volt scores £47m Series B round",
    "Volt raises $60m Series B round led by Silicon Valley investor IVP",
    "Instagram finally lets users download Reels",
    "Instagram reels can now be downloaded on your device, says IG head",
    "This is how much Samsung Galaxy Watch 6, Watch 6 Classic might cost..",
    "Instagram now lets users download Reels, but Indian users can not download it yet!",
    "Now you can officially download Reels from the Instagram app",
    "Instagram now lets you download Reels from public accounts",
    "Instagram now lets some users download Reels, here is how",
    "Free compensation benchmarking data from 3,000 startups",
    "Data-driven customer experience on a unified platform",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/20 - Spotify To Go \"Supremium\"",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Crib raises seed round from founders of Paytm, CRED, Mamaearth, and others",
    "San Francisco Business Journal",
    "A mining tech unicorn: KoBold's $195M round",
    "Bill Gates-backed Berkeley metal mining startup KoBold doubles funding",
    "Mining Startup KoBold Metals Hits Unicorn Status After $195M Raise",
    "The top of AI hysteria can't be far away if this is happening https://twitter.com/...",
    "Twitter workers sue over unpaid bonuses they were promised",
    "Easily Replaceable Smartphone Batteries Could Make A Comeback",
    "EU could force Apple to make iPhone batteries replaceable — what you need to know",
    "Apple braces for change as EU demands easy battery replacement for smartphones",
    "Future iPhones might have an easily replaceable battery due to new EU law",
    "It's a bad idea for the EU to force Apple into making iPhone batteries easily replaceable",
    "New European Union law requires smartphones, laptops to have easily replaceable batteries",
    "EU wants “readily removable” batteries in devices soon—but what does that mean?",
    "Pick a voice, any voice: Voicemod unleashes “AI Humans” collection of real-time AI voice changers",
    "The AI voice-generating platform that shocked the world is getting an update to fight abuse",
    "ElevenLabs Raises $19M in Series A Funding",
    "Now hear this: Voice cloning AI startup ElevenLabs nabs $19M from a16z and other heavy hitters",
    "Synthetic voice AI firm ElevenLabs raises $19M along with a new detection tool",
    "ElevenLabs' Powerful New AI Tool Lets You Make a Full Audiobook in Minutes",
    "Real estate investment and property management platform Picket lands $20M",
    "Generative AI Speech Startup ElevenLabs Raises $19M and Releases Deepfake Voice Detector",
    "Credo Ventures joins €17.3M round for ElevenLabs, voice technology research company",
    "Andreessen Horowitz co-leads £15m ElevenLabs Series A",
    "Quotient to Combine with Neptune Retail Solutions",
    "Quotient Technology Gets Buyout Offer From Neptune Retail Solutions",
    "Neptune Retail to buy Coupons.com parent company for $430 million in cash",
    "Spotify Desktop App Updated With Redesigned ‘Your Library’ and ‘Now Playing’ Views",
    "Spotify overhauls design of its desktop app",
    "Trevor Noah Signs With Spotify for Weekly Podcast Series (EXCLUSIVE)",
    "You can now use Spotify's new design on your Galaxy Book",
    "Spotify's desktop app gets new sections to show what's playing and what's in your library",
    "Prince Harry and Meghan Markle cut ties with Spotify.  So why are they facing backlash?",
    "Spotify's got a new desktop app, but it won't make me switch from Apple Music",
    "Spotify Desktop app gets a new look and upgraded library features",
    "Spotify updates Mac app with Your Library, Now Playing changes",
    "Spotify on desktop is about to look very different - here are the two big changes",
    "Spotify Launches Redesigned Desktop Experience",
    "Spotify's Bitter Break With Royals Also Ends Exclusive Podcast Deals Era",
    "Spotify launches new desktop experience for Mac and PC with three-column UI",
    "Spotify desktop app gets a brand-new look",
    "Spotify for Desktop Gets UI Makeover",
    "Trevor Noah to launch original Spotify podcast",
    "Trevor Noah To Make Weekly Spotify Podcast",
    "Spotify launching weekly podcast with Trevor Noah",
    "Trevor Noah to host new podcast on Spotify",
    "DOJ establishes cybercrime enforcement unit as U.S. warnings mount over Chinese hacking",
    "Justice Department expands cybersecurity efforts with new NatSec Cyber",
    "DOJ launches cyber unit with national security focus as China, Russia threats mount",
    "Justice Department adds new cyber-threat focused litigating section",
    "DOJ launches new cyber unit targeting nat'l security threats",
    "Render's $50 Million Series B",
    "Render ushers in a modern age of application development in the cloud",
    "DevOps platform-as-a-service startup Render raises $50M",
    "Render Raises $50M in Series B Funding",
    "Best Cryptocurrency To Buy Now - June 2023 Top 5",
    "Render Raises $50M Series B",
    "Rose Rocket Raises $38M USD in Series B Funding",
    "Rose Rocket raises $50.2 million CAD Series B to expand trucking solution",
    "Rose Rocket raises $38M for its transportation management system",
    "Rose Rocket closes $38M Series B to expand into enterprise fleet solutions",
    "Chrome on iOS is getting new Google Maps, Translate, Calendar and Lens features",
    "4 new ways to use Chrome on iOS",
    "Chrome browser for iOS upgrades 4 new functions/features",
    "Chrome for iOS adding mini Google Maps and integrating Calendar, Translate",
    "Chrome for iOS to add support for Maps, Calendar and Google Lens",
    "Google apps like Maps, Translate, Calendar and Lens are getting integrated into the iOS Chrome app",
    "Google Chrome for iOS gains Calendar and Maps integration",
    "Chrome Browser for iOS Getting Improved Translation, Google Lens and Maps Features",
    "Google Adding Four New Features to Chrome for iOS",
    "Google is Bringing Four New Features to Chrome for iPhone and iPad",
    "Google Chrome on iOS gets several new features",
    "Google Chrome for iPhone is getting some huge new features",
    "Chrome on iOS to get built-in Lens support, along with new Maps and Calendar integrations",
    "New Maps, Calendar, and search integrations are coming to Chrome on iOS",
    "Google Chrome update for iOS users brings new handy features",
    "Chrome on iOS can now show maps and create calendar items without switching apps",
    "Introducing Experiences for People 17 and Older",
    "Roblox is starting to allow 17+ rated experiences with ‘violence, blood or crude humour’",
    "Roblox invites its community to build mature experiences for 17+ users",
    "Roblox will allow exclusive experiences for people 17 and over",
    "Roblox to Officially Allow 17+ Restricted Content on Its Gaming Platform",
    "Roblox now allows creators to build content for people 17 and older",
    "Roblox is adding content for its growing adult user base",
    "Phasing Out Passwords: Apple To Automatically Assign Each User a Passkey",
    "Apple Introduces easy sign-in with Face ID and Touch ID for Apple ID accounts. All details here",
    "Apple ID on web offers passkeys support with iOS 17, iPadOS 17; boosts security [details]",
    "iOS 17 and macOS Sonoma Add Passkey Support to Your Apple ID",
    "Apple iOS / iPadOS 17 and macOS Sonoma start enabling Passkey support",
    "Apple Passkeys in More Websites For iPhones and MacBooks Enabled",
    "iOS 17 will support Apple passkeys at launch and you can try them out today",
    "Apple IDs now support passkeys — if you're on the iOS 17 or macOS Sonoma betas",
    "Apple adds passkeys to Apple ID, iCloud logins",
    "Apple websites start implementing passkeys in place of passwords",
    "The apple.com website adds passkey support, but there's a catch",
    "Is this what we're calling it? “Sign in with iPhone”? 🤔 https://9to5mac.com/...",
    "@s_carruthtx When you click sign in with iPhone, you get this popup which says iOS 16 [image]",
    "‘Sign in with iPhone’ passkey support comes to Apple․com",
    "Gannett CEO: Here's why we are suing Google for deceptive business practices",
    "Gannett sues Google, alleges it monopolizes online ads",
    "Google's web ad choke-hold prompts lawsuit from largest publisher in US",
    "Gannett Sues Google, Accusing It of Dominating the Ad Market",
    "Gannett Files Federal Lawsuit Against Google",
    "News publishing giant Gannett sues Google for monopolizing ad tech",
    "Gannett sues Google over alleged antitrust practices in advertising",
    "Gannett Blames Google for Newspapers Shuttering in Digital Advertising Monopoly Lawsuit",
    "Gannett Sues Google, Alleges Monopolization of Ad-Tech Markets",
    "Google sued by USA Today publisher amid falling ad revenue fears",
    "The US's largest news publisher sues Google over alleged digital ad monopoly",
    "Where's my money?! Now USA Today publisher sues Google over online advertising",
    "The largest newspaper publisher in the US sues Google, alleging online ad monopoly",
    "America's Largest Newspaper Publisher Sues Google Over Alleged Advertising Monopoly",
    "Gannett sues Google, Alphabet claiming they have a monopoly on digital advertising",
    "Gannett sues Google over ‘deceptive scheme’ to gain online ad monopoly",
    "US largest publisher Gannett sues Google, alleges it monopolises online ads: Report",
    "Apple expands Self Service Repair and updates System Configuration process",
    "Apple simplifies Self Service Repair and adds cover for newer iPhones and Macs",
    "Apple expands Self Service Repair with iPhone 14, M2 Macs, system config changes, more",
    "Apple's self-service repairs no longer require a call to Apple when you're done",
    "Apple's Self Service Repair now lets you fix your iPhone 14 and new MacBook at home",
    "iPhone 14 users just got a great reparability upgrade",
    "Apple adds the iPhone 14 lineup to its Self Service Repair",
    "Apple's Self Service Repair programme now available for iPhone 14 lineup [details]",
    "Apple's Self Service Repair program updates make it easier for DIY fixers",
    "Apple Self Service Repair program now includes iPhone 14 series and M2 MacBooks",
    "Apple's expanded self-repair program covers the iPhone 14 and newer MacBooks",
    "Apple will now sell you the parts and tools to fix your iPhone 14 at home",
    "Apple Self Service Repair Now Includes iPhone 14 Lineup, More Macs",
    "iPhone 14 and M2 MacBooks join Apple's self-repair program",
    "Apple Expands Self-Repair to iPhone 14 and M2-Powered 13-Inch MacBook Air",
    "Apple Simplifies Self Service Repair with New System Configuration Process",
    "Apple's Self Service Repair Program is Available iPhone 14 and 14-inch, 16-inch MacBook Pro Models",
    "Apple expands Self Service Repair program with iPhone 14 and M2 MacBooks",
    "Self Service Repair of Apple's Products Can Now Be Completed Without a Phonecall",
    "Apple's self-repair service now includes these new iPhones and MacBooks",
    "Apple Extends Self-Service Repair to iPhone 14, M2 MacBooks",
    "Apple Expands Self Service Repair Program to iPhone 14, Additional Macs",
    "Broken iPhone or MacBook? Apple expands Self Service Repair so you can fix them at home",
    "You can now repair your iPhone 14 and M2 MacBook at home",
    "iPhone 14 and M2 MacBooks Join Apple's Self Service Repair Program",
    "Apple expands Self Service Repair program to iPhone 14 lineup and additional Mac models",
    "Apple expands Self Service Repair to M2 Macs and iPhone 14",
    "Apple adds the iPhone 14 and new Macs to its Self Service Repair Program",
    "Apple adds iPhone 14 lineup and more Macs to its Self Service Repair program",
    "Apple just fixed the most annoying part of its Self Service Repair program",
    "Apple Broadens DIY Repair Program and Enhances System Configuration Tool",
    "iPhone 14 and M2 Macs get added to Apple's Self Service Repair program",
    "Fixing your iPhone 14 and 2022 MacBook models just got easier",
    "iPhone 14 now supports Apple Self Service Repair along with M2 MacBook Air and Pro",
    "Apple expands Self Service Repair to include new iPhone and MacBook models",
    "Apple Expanding Self-Service Repair Program To iPhone 14 Lineup and More Macs",
    "Apple Expanding Self-Service Repair Program to iPhone 14 Lineup and More Macs"
]