[
    "@williamgunn@mastodon.social",
    "Apple wants to “own the rights to an actual apple” according to Swiss fruit firm",
    "Apple wants to control every image of an apple, says Swiss fruit firm",
    "Apple wants to own the rights to images of real apples around the world",
    "Apple could force a 111-year-old fruit company to change its apple logo",
    "Apple is trying to trademark depictions of actual apples",
    "Apple is forcing a 111-year old fruit company to change its logo in a weird trademark battle",
    "Bananas IP case sees Apple seeking rights over actual apples",
    "Is Apple bullying small firms? Swiss Fruit Union could be forced to change the logo",
    "Apple moves to trademark actual apples in Switzerland",
    "Apple, the company, looks to secure rights to the image of apples, the fruit, in Switzerland",
    "Apple, the company, wants to trademark images of apple, the fruit",
    "Apple wants to force a fruit company to change its logo",
    "Apple wants rights to the image of apples in Switzerland",
    "Apple Is Taking On Apples in a Truly Weird Trademark Battle",
    "Apple (those bâtards) vs. Swiss Apple Association",
    "Daniel Zhang May Focus on Cloud and Step Down as CEO of Alibaba",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Alibaba replaces longtime chief and chair in management shake-up",
    "Alibaba announces chairman and CEO succession plan",
    "Daniel Zhang steps down amid Alibaba's major organizational shift",
    "Daniel Zhang to focus on Alibaba Cloud Intelligence Group",
    "Alibaba co-founder Joe Tsai to take over as chairman from Daniel Zhang",
    "Alibaba Group Announces Chairman and CEO Succession Plan",
    "Alibaba says Eddie Wu to succeed Daniel Zhang as CEO in surprise move",
    "Alibaba CEO Daniel Zhang to pass the torch and focus on cloud",
    "Joe Tsai to Become Alibaba Group Chairman, Eddie Wu Appointed CEO",
    "Alibaba Says Its Chairman, Daniel Zhang, Will Leave Post in September",
    "Alibaba's Daniel Zhang to step down as group chairman and CEO",
    "Meet the new CEO of Alibaba",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Alibaba Group says Eddie Wu to succeed Daniel Zhang as CEO",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Live news: Korean crypto crash firm founder Kwon sentenced in Montenegro",
    "Eddie Wu to succeed Daniel Zhang as Alibaba Group CEO in major executive reshuffle",
    "Alibaba mulls restructuring, CEO Zhang may step down",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election.  [ A legal campaign...",
    "@tchambers@indieweb.social",
    "@nexusofprivacy@mastodon …",
    "Update from Lemmy after the Reddit blackout",
    "Unofficial Subreddit Migration List (Lemmy, Kbin)",
    "Looking for a Reddit alternative? Lemmy tell you, they currently kinda suck",
    "Second Life in the Threadiverse",
    "Neowin mentioned Lemmy, Kbin, and Mastodon in their Reddit coverage today",
    "@mastodonmigration@mastodon.online",
    "222,397 Lemmy/kbin accounts  —  +23,441 in the last hour  —  71,331 monthly active users",
    "@nexusofprivacy@mastodon.social",
    "Eight days later: Kbin, Lemmy, the landed gentry, and the rise of “threadiverse”",
    "International Business Times",
    "Reddit hackers demand $4.5 million ransom and API pricing changes",
    "Reddit hackers threaten to leak data stolen in February breach",
    "Hackers Threaten to Release Reddit Data Unless API Changes Are Rolled Back",
    "BlackCat Claims Hit on Reddit, Threatens Sensitive Data Leak",
    "Ransomware gang threatens Reddit with blackmail over recent changes, demands hit $4.5 million",
    "Reddit hacker demands $4.5M and a change to new API rule",
    "Hacked Reddit Data To Be Published Unless API Changes Dropped, Hackers Say",
    "Hackers Say They'll Leak Reddit Data If API Pricing Changes Aren't Reversed",
    "BlackCat Hackers Threaten Reddit With Huge Data Leak Unless It Rolls Back API Changes",
    "Hackers threaten to leak stolen data if Reddit doesn't reverse API changes",
    "Reddit faces $4.5M threat if pricing policy isn't changed",
    "BlackCat ransomware gang demands $4.5M, API changes for 80GB leaked Reddit data",
    "Hackers demand Reddit pay millions and reverse API changes if it wants to keep data private",
    "Hackers Threaten to Leak Confidential Reddit Data, Demand $4.5 Million",
    "Reddit hackers want the company to roll back API changes or else",
    "Reddit Ransomware Raid Redux: BlackCat/ALPHV Demands $4.5M",
    "BlackCat claims Reddit ransomware attack and calls for end to API pricing changes",
    "BlackCat hackers threaten to leak 80GB worth of Reddit data",
    "Reddit hacker's demands include reversing API changes",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "The BlackCat ransomware gang is now threatening to leak stolen Reddit data",
    "Reddit hackers issue ransom demands for cash and API changes",
    "Hackers threaten to leak 80GB of stolen Reddit data; demands $4.5 million to delete it [details]",
    "Reddit fiasco: Now hackers steal 80GB of data, demand $4.5 million",
    "Reddit Files: BlackCat/ALPHV ransomware gang claims to have stolen 80GB of data from Reddit",
    "Reddit claimed to have been hacked by BlackCat, and it has threatened to leak the data [Update]",
    "Reddit says ransomware posting connected to February incident",
    "How long till u/Spez states blaming Christian for the hack?",
    "Hackers threaten to leak 80GB of confidential data stolen from Reddit",
    "BlackCat claims they hacked Reddit and will leak the data",
    "Hackers Threaten To Leak 80GB of Confidential Data Stolen From Reddit",
    "Berlin to sign agreement with Intel after chip plant talks",
    "Intel to build $33-billion chip plant in Germany after government pledges to cover 1/3rd of cost",
    "Intel will invest over $50 billion in Germany and Israel to build chip plants",
    "Brussels Playbook: It's raining cash — Paris defense meeting — Ukraine accession",
    "Intel spends $48 billion in Germany in landmark expansion",
    "Intel to build two chip fabs in Germany as part of expanded €30B+ investment",
    "‘Silicon Junction:’ Intel picks Germany for $33B chip project",
    "Germany to subsidize Intel €10B for ‘Silicon Junction’ fab",
    "Berlin, Intel strike controversial chip plant subsidy deal",
    "Intel to double its investment in German semiconductor factories",
    "Intel confirms deal for $33 billion German factories",
    "Intel Reaches Agreement to Build New Fabs in Germany and Israel",
    "Intel, German Government Agree on Increased Scope for Wafer Fabrication Site in Magdeburg",
    "Intel and Germany to sign agreement on Dresden factory today",
    "Berlin, Intel strike deal on $33 billion chip plant after months of subsidy talks",
    "Germany, Intel Agree Chip Plant Subsidies Worth €10 Billion",
    "Intel To Spend $33 Billion in Germany in Landmark Expansion",
    "AI and Fame: How Celebrities are Embracing Their Digital Duplicates",
    "Courts Put Privacy Over Transparency in FTX, Other Crypto Bankruptcies",
    "Crypto.com's Trading Practices Raise Concerns About Potential Conflicts",
    "Crypto.com operates internal proprietary trading desks: Financial Times",
    "First Mover Asia: Bitcoin ‘Looks Vulnerable’: Analyst",
    "Crypto.com Refutes Accusations of Proprietary Trading (Report)",
    "Crypto.com Is Trading on Its Own Exchange, Insists That's Totally Fine",
    "Contention arises over Cryptocom trading teams",
    "Crypto.com says operating in-house trading team, market maker not ‘controversial’",
    "Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest",
    "Internal Teams at Crypto.com Trade Tokens for Profit: Report",
    "Crypto.com denies allegations of market prices manipulation",
    "Crypto Live News: Intra-team Conflict Emerges Among Trading Groups at Crypto.com Exchange",
    "Crypto.com Uses ‘Internal Teams’ to Trade Assets for ‘Profit’: Report",
    "Reports of Controversial Trading Practices at Crypto.com Emerge, Exchange Responds",
    "Fortune favors market manipulation, apparently https://twitter.com/...",
    "wonder how much he regrets the deal https://twitter.com/... [image]",
    "What could possiblity go wrong? https://twitter.com/...",
    "School Kids Reportedly Phishing Millions in NFTs for Roblox Skins",
    "Cyber heists in digital playground, school-age hackers steal millions in NFTs",
    "Damn kids. https://twitter.com/...",
    "guess the real play isn't buying NFTs, it's buying Roblox skins https://www.theblock.co/...",
    "School kids are stealing millions of dollars to buy Robloxx skins",
    "School kids are stealing millions of dollars of NFTs — to buy Roblox skins",
    "Free Figma template of onboarding & activation designs",
    "FTX incurs over $120m in advisor fees as bankruptcy costs mount",
    "$10 million per week leaving FTX None going to victims https://twitter.com/...",
    "This is absolutely insane. The level of injustice is mind boggling. https://twitter.com/...",
    "Opaque Algorithm Changes by Facebook Leave Publishers in the Dark #1675",
    "Website Owners Say Traffic Is Plunging After Facebook Algorithm Change",
    "Facebook rocks publishers' worlds again. https://gizmodo.com/...",
    "Website Owners Say Traffic Is Plummeting After a Facebook Algorithm Change",
    "Alibaba's Taobao & Tmall Attracts Record Number of Merchants During 6.18 Shopping Festival",
    "Chinese online shoppers are enticed by deep discounts, payment plans as zest for spending lags",
    "Consumption soft even amid deep discounts during major China shopping festival, analysts say",
    "Slower Growth During China's 618 Shopping Festival Signals Lagging Consumer Confidence",
    "JD.com sales during China shopping festival beat expectations -analysts",
    "JD.com's 2023 618 Grand Promotion: Surpassing Expectations and Setting New Records",
    "Taobao, JD.Com, and Pinduoduo Hail Success of ‘618’ E-Commerce Festival",
    "Bargain hunting drives up retailers' sales as 618 shopping gala ends",
    "China's online shopping bonanza loses sheen as consumption sags",
    "China's 6.18 shopping fest sets record on Alibaba platforms",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Make panel interviews worth the hassle",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Vimeo Wants ChatGPT to Write Execs' Video Scripts Then Fix It When They Inevitably Screw Up",
    "Vimeo intros a trio of AI-powered editing features",
    "Snapchat My AI Vs. ChatGPT: Which AI Chatbot Is Best?",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ claim",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ allegations",
    "Elon Musk's ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter - What's Going On?",
    "Elon Musk Accuses AI Twitter Account ‘Explain This Bob’ As Meme Coin Scam",
    "Twitter AI Bot Gets Suspended after Elon Musk Accuses It of Being ‘Scam Crypto Account’",
    "@ExplainThisBob This sure looks like a scam crypto account. If so, it will be suspended.",
    "this is an extremely funny series of events [image]",
    "@sarahemclaugh.bsky.social",
    "SpaceX launches SATRIA-1 communications satellite for Indonesia, lands rocket at sea (video)",
    "SpaceX launches powerful Indonesian communications satellite",
    "SpaceX launch a communication satellite to provide internet to rural parts of Indonesia",
    "Indonesia launches country's largest telco satellite with SpaceX",
    "Indonesia, SpaceX launch satellite to boost internet connectivity",
    "Indonesia, SpaceX Launch Satellite To Boost Internet Connectivity",
    "Foxconn hedges its bets: US and China will make up, but diversify just in case",
    "iPhone Maker Foxconn Plans To Launch Electric Car Factory In India!",
    "Foxconn to establish EV manufacturing line in India",
    "Why Pixar's new movie Elemental is bombing at the box office, despite solid reviews",
    "Is Elemental streaming on Disney+?",
    "Pixar's Elemental is the new Cars",
    "‘The Flash,’ Pixar's ‘Elemental’ Disappoint in Muted Box Office",
    "Elemental has single worst box office opening weekend in Pixar history",
    "Trial Lawyer Went After Crypto Companies.  Then Someone Went After Him."
]