[
    "Apple is on the hunt for generative AI talent",
    "Apple becomes the latest company to ban ChatGPT for internal use",
    "Apple restricts employees from using ChatGPT over fear of data leaks",
    "Apple restricts employee use of ChatGPT. Here's why",
    "Apple Restricts Employee Use of ChatGPT and AI Tools, Report Claims",
    "Apple Warns Employees to Stay Away From ChatGPT While It Builds Its Own AI",
    "Apple Joins A Growing List Of Companies Cracking Down On Use Of ChatGPT By Staffers—Here's Why",
    "Apple Is the Latest Tech Firm to Block Employees From Using ChatGPT",
    "Apple bans its employees from using ChatGPT and other generative AI platforms for work",
    "Apple reportedly limits internal use of AI-powered tools like ChatGPT and GitHub Copilot",
    "Apple restricts use of ChatGPT - WSJ",
    "Apple's data privacy fears lead to ChatGPT ban for employees",
    "Apple bans ChatGPT at work for its employees",
    "Apple Bans Employees From Using ChatGPT Amid Its Own AI Efforts",
    "Apple doesn't want its employees to use ChatGPT in case they blab company secrets",
    "Apple Bans ChatGPT, GitHub Copilot, and Other Generative AI Services",
    "Apple bans employees from using ChatGPT over fears of leaks",
    "Apple Bans ChatGPT for Employees, As It Launches iOS App",
    "Apple Bans Use of ChatGPT by Staff, Fearing Data Leaks",
    "Apple bans ChatGPT use by employees",
    "Apple Employees Forbidden From Using ChatGPT",
    "SiriGPT? Apple is working on a ChatGPT rival for iPhone — everything we know (report)",
    "Apple bans employees from using ChatGPT — here's why",
    "Apple may have restricted employee use of ChatGPT due to privacy concerns",
    "Apple is banning employees from using ChatGPT and other AI chatbots",
    "Apple Has Restricted Employees From Using ChatGPT, Bard, Others, Over Fear Of Future Product Leaks",
    "Apple bans ChatGPT use for employees over fears of data leaks",
    "Apple bans ChatGPT use by employees, report says",
    "Apple bans employees from using ChatGPT and other generative AI tools",
    "Apple Restricts Employees From Using ChatGPT",
    "Apple tells employees not to use AI chatbots like ChatGPT over confidential data leak fears",
    "Apple bans internal use of ChatGPT-like tech over fear of leaks, according to leaked document",
    "Apple Restricts Internal Use of ChatGPT",
    "Apple Limits Employee Use of ChatGPT Over Leak Fears",
    "Apple restricts use of ChatGPT for its employees",
    "Pretty much guarantees that Siri won't get better now 😂😂😂 https://twitter.com/...",
    "Electronic Frontier Foundation",
    "Supreme Court hands tech companies a win, and not just about Section 230",
    "Supreme Court rules against reexamining Section 230",
    "Twitter, Google win big at Supreme Court",
    "Supreme Court Sidesteps Ruling on Scope of Internet Liability Shield",
    "Supreme Court's Social Media Ruling Is a Temporary Reprieve",
    "SCOTUS spares Section 230, rules Google, Twitter not liable for aiding ISIS",
    "Supreme Court ruling continues to protect Google, Facebook and Twitter from what users post",
    "Section 230 Just Survived a Brush with Death",
    "Technology & Marketing Law Blog",
    "The Internet Survives SCOTUS Review (This Time)-Twitter v. Taamneh and Gonzalez v. Google",
    "The Internet Dodges Censorship by the Supreme Court",
    "Tech keeps liability shield in Supreme Court win",
    "Google & Other Tech Giants Not Liable For Terrorist Content",
    "Supreme Court rules in favor of Twitter and Google, avoiding the issue of Section 230 for now",
    "Supreme Court sides with tech giants over legal shield for content",
    "Supreme Court unanimously sides with Twitter in ISIS attack case",
    "Supreme Court sides with Twitter, Google over tech platform liability",
    "Supreme Court: Lazy Content-Moderation Doesn't Mean Platforms Aided Terrorists",
    "The Supreme Court decides not to break the internet",
    "Q&A: Section 230 is at the Supreme Court. Here's Why that Matters for Free Expression",
    "Supreme Court Rules in Favor of Twitter in Taaamneh, Remands Gonzalez",
    "Samsung abandons plans to switch default search engine to Microsoft's Bing",
    "Report: Samsung Has Dropped its Plan to Replace Google with Bing on Galaxy Phones",
    "Samsung not planning to replace Google with Bing in phones, Wall Street Journal reports",
    "Google Can Stop Panicking, Samsung Phones Aren't Switching to Bing",
    "Samsung realized ditching Google for Bing isn't such a great idea after all",
    "Google Parent Alphabet Stock Rises. It Got Some Big News From Samsung.",
    "Report says Samsung has decided not to replace Google with Microsoft's Bing in its phones",
    "Samsung's plan to replace Google with Bing might be dead",
    "Samsung pauses on plan to replace Google Search with Bing on Galaxy devices",
    "Good news for Google! Samsung may not replace its Search with Bing",
    "Introducing the ChatGPT app for iOS",
    "OpenAI ChatGPT 12+  —  iPhone Screenshots",
    "OpenAI launches an official ChatGPT app for iOS",
    "ChatGPT now has a dedicated iOS app, Android version incoming",
    "He Helped Train ChatGPT. It Traumatized Him.",
    "Don't get scammed by fake ChatGPT apps: Here's what to look out for",
    "OpenAI launches free ChatGPT app for iOS",
    "The Morning After: ChatGPT has an official iPhone app",
    "Apple Bans Some Staff From Using ChatGPT. But iPhone Users Now Have an App for It.",
    "OpenAI Has Launched a Free iOS App for ChatGPT",
    "A Look Inside The New ChatGPT iPhone App From OpenAI",
    "OpenAi Launches ChatGPT Mobile App for iOS with Android Coming Soon",
    "OpenAI launches ChatGPT app for iOS, Android coming soon",
    "ChatGPT now has an official app on iPhone",
    "OpenAI Launches a ChatGPT App for iOS (With Android to Follow)",
    "OpenAI's ChatGPT Hits Apple's App Store in US But What About Android Users?",
    "OpenAI releases an official ChatGPT app for iOS",
    "ChatGPT lands on iPhones worldwide hinting upcoming Android version",
    "OpenAI now has an official ChatGPT app for iOS",
    "OpenAI's ChatGPT app soars to the top of the App Store charts less than a day after launch",
    "You can now download ChatGPT directly from the App Store, but there's a catch",
    "OpenAI launches official ChatGPT app for iOS, Android coming ‘soon’",
    "OpenAI releases official ChatGPT app for iOS; coming soon to Android",
    "ChatGPT will make an appearance for official Android app soon",
    "OpenAI launches free ChatGPT for iPhone app with Whisper support and more",
    "ChatGPT app is finally on iOS — how to get it",
    "OpenAI introduces ChatGPT app for iOS, bringing most popular AI chatbot to iPhones",
    "ChatGPT gets first official app on iOS, Android app not far behind",
    "OpenAI's new ChatGPT app is free for iPhone and iPad",
    "OpenAI Releases ChatGPT App for iOS",
    "ChatGPT launches iPhone app for iOS; Android coming soon",
    "OpenAI to introduce ChatGPT app for iOS",
    "OpenAI launches a ChatGPT app for iOS, with an Android version coming soon",
    "OpenAI's ChatGPT now has an official iPhone app with an Android version coming soon",
    "OpenAI Releases Official ChatGPT App for iOS, Syncs Your Conversations and Supports Voice Input",
    "Now Available for iPhones: ChatGPT App",
    "ChatGPT Goes Mobile With iOS App",
    "OpenAI debuts ChatGPT app for iPhone, Android version coming soon",
    "OpenAI Launches ChatGPT App for Apple iOS",
    "OpenAI launches free ChatGPT app for iPhone users",
    "OpenAI's ChatGPT has an app now, and it lets you speak prompts",
    "OpenAI launches a free ChatGPT app for iOS",
    "ChatGPT now has an official iPhone app",
    "OpenAI Launches ChatGPT Mobile App for iOS",
    "A standalone ChatGPT app lands on iOS, and Android users are next in line",
    "OpenAI launches ChatGPT for iPhones in US",
    "ChatGPT Launches First-Ever App On iPhones",
    "You can download ChatGPT on iOS for free right now",
    "What smartphone can now download the ChatGPT app?",
    "Here's the best way to access ChatGPT on your iPhone",
    "OpenAI Launches Official ChatGPT App for iPhone and iPad",
    "OpenAI launches ChatGPT app for iPhone users",
    "OpenAI's new ChatGPT app for iOS got here just in time",
    "OpenAI just released an official ChatGPT app for the iPhone",
    "ChatGPT creator releases iPhone app in step toward broader consumer appeal",
    "OpenAI's ChatGPT Finally Comes to Smartphones With iOS App",
    "ChatGPT's Official App For iPhone Arrives In The App Store",
    "OpenAI launches an iOS app for ChatGPT",
    "OpenAI Debuts ChatGPT App for Apple iPhone, Says Android Coming Soon",
    "The official ChatGPT app for iPhones is here",
    "OpenAI Has Announced “ChatGPT” For iOS, Includes Several New Features",
    "ChatGPT iPhone app puts AI ‘at your fingertips’",
    "AI in Your Pocket: OpenAI Rolls Out ChatGPT App for iOS Users",
    "OpenAI Releases Official ChatGPT App for iPhone",
    "ChatGPT will get an official Android app ‘soon’",
    "ChatGPT makes its debut as a smartphone app on iPhones",
    "How to get the official ChatGPT app for iPhone",
    "Open AI Announces New ChatGPT App for iOS",
    "OpenAI releases its official ChatGPT app for iOS devices in the US",
    "OpenAI launches ChatGPT on Apple's app store",
    "OpenAI releases iPhone version of ChatGPT",
    "ChatGPT for iPhone is here, and it's pretty incredible 🙌",
    "US users can download the app here: https://apps.apple.com/...",
    "ChatGPT on iOS live in the US and rolling out to other countries soon! https://apps.apple.com/...",
    "RIP to all the ChatGPT apps 😅. https://twitter.com/...",
    "It's 2023 and they are still treating Android as a second class citizen https://twitter.com/...",
    "It's like having a media ceo in your pocket. https://twitter.com/...",
    "RIP those AI Chatbot apps https://openai.com/...",
    "App looks much better than the website. https://twitter.com/...",
    "Finally all those scammy apps can disappear https://twitter.com/...",
    "A professor accused his class of using ChatGPT, putting diplomas in jeopardy",
    "New York City Public Schools chancellor reverses ChatGPT restrictions: report",
    "New York City Schools Lift Ban on ChatGPT, Say Initial Fear ‘Overlooked the Potential’ of AI",
    "Head of New York City's public schools lifts ban on ChatGPT",
    "Transforming Education: NYC Schools Shift from Fear to Embracing ChatGPT",
    "ChatGPT is now available as an app on iOS",
    "New York City rescinds ban on ChatGPT use in public schools",
    "New York City public schools remove ChatGPT ban",
    "San Francisco Business Journal",
    "Elon Musk's lawyer accuses Microsoft of abusing its access to Twitter data",
    "Twitter accuses Microsoft of refusing to pay for tweets and abusing its data access",
    "Microsoft CEO receives letter from Elon Musk's lawyer regarding Twitter's data access abuse",
    "Elon Musk's lawyer just accused Microsoft of violating the Twitter developer agreement",
    "Twitter sends Microsoft letter alleging data abuse, demands audit and adherence to agreements",
    "Twitter Says Microsoft May Have Violated API Policies",
    "Read the letter: Twitter accuses Microsoft of using its data in unauthorized ways",
    "Twitter accuses Microsoft of misusing its data, foreshadowing a fight over AI",
    "Elon Musk Uses Lawyer to Directly Accuse Microsoft of Abusing Twitter Data to Train AI",
    "Elon Musk's Lawyer Sends Letter to Microsoft CEO due to Abusing Twitter's Data Access",
    "Elon Musk lawyer says Microsoft abused official API to access Twitter data",
    "Twitter reportedly accuses Microsoft of violating its data use policy",
    "Twitter accuses Microsoft of improperly using its data - NYT",
    "Twitter Says Microsoft Broke Its Rules For Developers",
    "Twitter Accuses Microsoft Of Data Violations Following Musk's Lawsuit Tweet",
    "Musk's Lawyer Sends Letter to Microsoft on Twitter Data Misuse",
    "Twitter has sent a letter to Microsoft claiming it used data without paying for it",
    "AI War Just Warming Up. Winners Will Be Data Owners. https://twitter.com/...",
    "Twitter's biggest ad buyer no longer considers it ‘high risk,’ says report",
    "Top Advertising Firm Removes ‘High Risk’ Label From Twitter",
    "Top ad group says Twitter no longer ‘high risk’ after new chief appointed- FT",
    "@Techmeme It's gotten even worse, what are they talking about?",
    "Just as Musk is descending into full-blown antisemitism. https://twitter.com/...",
    "TikTok users take legal action against Montana over controversial ban",
    "Why Montana's TikTok ban may not work",
    "How Montana could enforce a TikTok ban",
    "TikTok Creators Sue Montana Over State's Ban of Short-Video Platform",
    "US TikTok users file lawsuit to block Montana ban",
    "TikTok creators sue Montana over statewide ban of the app",
    "TikTok content creators file lawsuit against Montana over first-in-nation law banning app",
    "Twitter advertising now safe, says biggest spender; TikTok ban challenged in court",
    "Montana TikTok users file lawsuit challenging ban",
    "Creators Sue Over Montana TikTok Ban",
    "How You, or Anyone, Can Dodge Montana's TikTok Ban",
    "TikTok Users Sue Montana Over its Banning of the App",
    "Montana TikTok ban faces First Amendment legal challenge",
    "Montana Sets Itself Up for First Amendment Lawsuits With TikTok Ban",
    "ACLU Slams Montana's Unconstitutional TikTok Ban as Governor Signs Law",
    "TikTok creators sue Montana over app ban",
    "Hours After First State Bans TikTok, It Gets Sued",
    "Montana can ban TikTok, but it probably can't enforce it",
    "Montana's TikTok ban is already facing its first legal challenge",
    "TikTok users sue to stop app ban in Montana",
    "TikTok users sue to overturn Montana's statewide ban of app",
    "TikTok creators sue to block Montana's ban on the platform",
    "TikTok Ban in Montana Draws Suit From Ranch Mom, Marine, Student",
    "Montana TikTok ban faces first court challenge",
    "Critics Say Montana's TikTok Ban Is a Violation of Free Speech. Here's What to Know",
    "Montana's TikTok Ban Uses Chinese Tactics To Guard Against China",
    "You can still use TikTok even if it's banned",
    "Montana governor defends decision to ban TikTok from state: ‘I wish it was broader’",
    "Should governments ban TikTok?  Can they?",
    "He's the ‘unofficial ambassador’ of Montana — and isn't buying its TikTok ban",
    "Montana Violates U.S. Constitution By Implementing TikTok Ban",
    "Hyundai and Kia agree to $200 million settlement over TikTok car theft challenge",
    "Kia and Hyundai settled a class-action lawsuit accusing their cars of being too easy to steal",
    "Hyundai, Kia agree to pay $200 million to settle lawsuit after rise in thefts",
    "Hyundai, Kia agree to $200 million settlement over US car thefts",
    "Hyundai and Kia Owners to Receive $200M+ in ‘Kia Boys’ Class Action Suit",
    "How Much Should an Influencer Marketing Campaign Cost?  A Marketer's Guide",
    "Trans influencers find it harder to get deals after Bud Light's Dylan Mulvaney fiasco",
    "For Influencer Marketing, AI May Not Be Just a New Tool, but a Sea Change",
    "The medium is the menu https://www.grubstreet.com/...",
    "what are we even doing https://www.grubstreet.com/... [image]",
    "@MikeElgan@mastodon.social",
    "About longer videos for Twitter Blue subscribers",
    "Twitter Blue subscribers can now upload videos as long as two hours",
    "One Degree Friday May 19 2023  —  Twitter now allows paid users to upload two-hour videos",
    "Twitter users upload movies illegally after company rolls out feature to allow two-hour videos",
    "Twitter Blue Subscribers Can Now Upload 2-Hour Videos in the App",
    "Twitter Blue Debuts 2-Hour Long Video Uploads",
    "Twitter Blue users get another perk: two-hour video uploads",
    "Twitter Videos Go Feature-Length With Support For Two-Hour Uploads",
    "Piracy-loving Twitter Blue users exploit new 2-hour video limit",
    "Twitter Blue Verified Subscribers Can Now Upload 2-Hour Videos",
    "Twitter will now let you upload 2-hour videos, but why would you?",
    "Twitter Blue benefits now include two-hour video uploads, says Elon Musk",
    "Twitter now lets Blue subscribers upload two-hour videos",
    "Twitter Blue subscribers can add up to two hour long videos, says Elon Musk",
    "Twitter Blue Subscribers Can Now Post Full-Length Videos up to Two Hours Long",
    "Twitter Adds New Video Playback Speed Controls, Flags Coming Video Updates",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "this entire platform was made with brevity in mind https://twitter.com/...",
    "Feels like the current owner of this app doesn't know what made it good. https://twitter.com/...",
    "Just what the blue checks need https://twitter.com/...",
    "More movies coming to Twitter https://twitter.com/...",
    "“We wanted flying cars, instead we got two-hour-long tweets” https://twitter.com/...",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]",
    "UK Lays Out £1 Billion Plan to Invest in Domestic Chip Sector",
    "New £1 billion strategy for UK's semiconductor sector",
    "UK's £1BN semiconductor plan branded ‘disappointing’ by chip sector",
    "Semiconductor strategy funding ‘disappointing’, says UK tech industry",
    "UK unveils £1bn chip strategy amid criticism over lack of ambition",
    "UK unveils its long-awaited £1bn semiconductor strategy",
    "New £1bn UK semiconductor strategy finally unveiled",
    "UK plays catch-up in chips war with £1B semiconductor strategy",
    "UK Unveils £1 Bn Semiconductor Strategy",
    "UK government unveils long-awaited £1bn semiconductor strategy",
    "Critics say £1bn for UK chip industry not enough",
    "UK plans 1 bln pounds of semiconductor investment in new strategy",
    "Britain launches $1.2 billion semiconductor plan after U.S. and EU splurge on chips",
    "UK joins global chip race with wafer thin commitment.",
    "Nvidia's RTX 4060 and 4060TI are actually priced like mid-tier cards",
    "GeForce RTX 4060 & RTX 4060 Ti Announced: Available From May 24th, Starting At $299",
    "ASUS Unveils GeForce RTX 4060 Ti and GeForce RTX 4060 Graphics Cards",
    "NVIDIA announces GeForce RTX 4060 Ti at $399, RTX 4060 to launch in July at $299",
    "Nvidia debuts GeForce RTX 4060 family, GeForce Now teams with Xbox",
    "Nvidia Announces a $299 RTX 4060 With the 4060 Ti Arriving May 24 For $399",
    "Nvidia is giving away RTX 4060, 4060 Ti, 4080, and 4090 cards this summer",
    "Nvidia Reveals RTX 4060 Ti, 4060 with Prices Starting at $299",
    "Nvidia introduces us to the RTX 4060 family",
    "ASUS Unveils NVIDIA GeForce RTX 4060 and 4060 Ti Graphics Cards",
    "Nvidia GeForce RTX 4060 GPUs Announced, Starts at $299",
    "NVIDIA confirms no Founders Edition for GeForce RTX 4060 and RTX 4060 Ti 16GB is planned",
    "Nvidia announces GeForce RTX 4060 series starting at $299",
    "Nvidia stock rises after company announces new graphics cards in GeForce RTX 4060 family",
    "Nvidia RTX 4060 Ti vs. RTX 4060: here's how they stack up",
    "DLSS3 Technology on a Budget: NVIDIA's RTX 4060 Series",
    "NVIDIA GeForce RTX 4060 Ti and RTX 4060 Launched",
    "Nvidia's RTX 4060 series is official & it's good news for budget gamers",
    "Nvidia unveils 3 GeForce RTX 4060s starting at $299: DLSS 3 goes mainstream",
    "Nvidia Tips GeForce RTX 4060 Ti for Fast 1080p Play, With RTX 4060 Close Behind",
    "NVIDIA's $299 GeForce RTX 4060 is the cheapest 40-series card yet",
    "DLSS 3 + AV1 + Super low power consumption = 👍👍👍 https://twitter.com/...",
    "The first AI navigator for your entire network",
    "Jeff Jordan steps back from Andreessen Horowitz",
    "GOAT investor, operator, human being ⁦@jeff_jordan⁩ https://www.forbes.com/...",
    "“you start doing the math, and you're like, holy shit” https://twitter.com/...",
    "Everyone should use Personal Voice; it does in 15 minutes what currently takes several weeks",
    "Guide: What is Personal Voice on iPhone, iPad and Mac?  How does it work?",
    "Restaurant365 Raises $135M in Funding",
    "Cloud-based Restaurant365 hits unicorn status after $135 mln funding round",
    "Restaurant365 Announces $135M Funding Round Co-Led by KKR and L Catterton",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/19 - ChatGPT Comes To The App Store",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Fraudster jailed for running multimillion-pound website iSpoof",
    "Nigerian E-Commerce Startup Sabi Raises USD 38 M Series B Round",
    "UK court tosses class-action style health data misuse claim against Google DeepMind",
    "International Business Times",
    "Authorities grant Battleground Mobile India a three-month trial period",
    "BGMI unban: How Krafton got a 3-month lease on life and should you be excited",
    "BGMI is coming back to app stores in India a year after ban",
    "BGMI game returns to India under strict conditions; close watch on user harm, addiction [details]",
    "Krafton's BGMI To Make A Comeback In India, But T&C Apply",
    "Krafton's BGMI game set for comeback after government lifts ban temporarily",
    "BattleGrounds Mobile India to be ‘unbanned’",
    "India lifts ban on Krafton's battle-royale game after a year",
    "A cyber scare for public transit",
    "Anti-Choice Groups Used Geolocation Data to Target Planned Parenthood Visitors",
    "Location Data About Abortion Provider Visitors Is Still Being Stored and Exploited",
    "This is so evil https://www.wsj.com/...",
    "Disney is reportedly preparing a standalone ESPN streaming service",
    "Your Disney Plus and Hulu TV show libraries are about to get much smaller",
    "Gradually, then Suddenly, Obviously",
    "Disney explores ditching cable for streaming-only version of ESPN",
    "We've Been Hearing About Cord-Cutting For Years, But Is Cable Finally Dying For Real?",
    "Disney Plans to Launch ESPN Streaming Service: Report",
    "ESPN is preparing for its “flagship” streaming future.",
    "Breaking: Disney Reportedly Has Begun Negotiations to Roll Out Streaming-Only Version of ESPN",
    "Let me know when the bricks show up. https://twitter.com/...",
    "Course5 Intelligence raises $28 mn to boost investments in generative AI",
    "AmpereOne with 192 Cores 128x PCIe Gen5 Lanes and DDR5 in 2023",
    "Ampere launches 192-core AmpereOne server processor",
    "AI Data-Center Boom Will Spur Energy Crisis, Chip CEO Warns",
    "Ampere Gets Out In Front Of X86 With 192-Core “Siryn” AmpereOne",
    "Ampere Launches Next-Generation 192-Core Server Processor",
    "Silicon Valley Business Journal",
    "Ampere spent more than $1 billion on developing its chips",
    "Hands On With Spacetop, the First Augmented Reality Laptop",
    "Spacetop Is A New Kind Of Laptop With Tethered AR Glasses Instead Of A Screen",
    "This Augmented Reality Laptop Can Beam a 100-Inch Screen to Your Eyes",
    "I used the world's first augmented reality laptop",
    "This AR laptop gives you infinite screens while having none",
    "Spacetop: The worlds first AR laptop, but will it be the future of computing",
    "Spacetop is the World's First Augmented Reality Laptop, Offers 100-inch Virtual Canvas",
    "Take Your Ultrawide Monitors Everywhere With an AR Laptop",
    "Spacetop: The Groundbreaking Screenless Laptop Revolutionizing the Future of AR Technology",
    "Startup founded by Magic Leap execs introduces the world's first AR laptop",
    "This new laptop replaces the physical screen with a 100-inch virtual display",
    "Sightful's AR Laptop Promises a Portable 100-inch Screen",
    "An AR Laptop Is Not as Crazy an Idea as You Might Think",
    "@JsonCulverhouse@flipboard.social",
    "Instawork Raises $60M in Series D Funding",
    "MTIA v1: Meta's first-generation AI inference accelerator",
    "Meta Platforms Crafts Homegrown AI Inference Chip, AI Training Next",
    "Reimagining Our Infrastructure for the AI Age",
    "Microsoft offers electrical engineers a lifeline as it pursues custom cloud silicon",
    "Meta is working on its own chip, data center design for AI workloads",
    "Meta built a code-generating AI model similar to Copilot",
    "Meta is working on a new chip for AI: What meta plans to do with it",
    "It's a wrap: News this week (May 13-19)",
    "Meta Announced New Chips Specifically Designed for AI Models",
    "Meta unveils its first custom AI chip",
    "Meta is working on a new chip for AI",
    "Meta announces AI training and inference chip project",
    "Meta pulls the curtain back on its A.I. chips for the first time",
    "Meta reveals new details about in-house AI chips",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Coder Tools",
    "Meta Platforms unveils next-generation AI infrastructure and data center designs",
    "@aphysicist @ArturTanona Nope",
    "@ylecun @ArturTanona Did you get an invite to testify in front of congress yet?",
    "The next stages of Privacy Sandbox: General availability and supporting scaled testing",
    "Google's turning off third-party cookies for 1 percent of Chrome users early next year",
    "Privacy Sandbox Initiative: Google to Phase Out Third-Party Cookies Starting 2024",
    "Google's Privacy Sandbox updates are met with both skepticism and a little more optimism",
    "Google will start phasing out third-party cookies from Q1 2024",
    "Preparing to ship the Privacy Sandbox relevance and measurement APIs",
    "Google Chrome is turning off third-party cookies for some users - but it probably won't be you",
    "Google to Phase Out Cookies for 1% of Chrome Users in Early 2024",
    "Google will deprecate cookies for 1% of users in Q1 2024",
    "Privacy Sandbox APIs set to launch in Chrome from July",
    "Google will disable third-party cookies for some Chrome users in early 2024",
    "Google's Privacy Sandbox is ready. Chrome to drop third-party cookies in 2024",
    "The Chrome Privacy Sandbox APIs Will Be Generally Available For All Users In July",
    "Google details its next steps for wiping out Chrome tracking cookies",
    "Australian Financial Review",
    "Westpac places immediate ban on payments to Binance crypto exchange",
    "Westpac trials new cryptocurrency blocks to prevent scam losses",
    "World's biggest crypto exchange banned by Westpac, cut off by provider",
    "Binance Australia partner hints at rising ‘scams’ after debanking exchange",
    "Westpac Enforces Urgent Prohibition On Payments To Binance Crypto Exchange",
    "Binance Australia suspends AUD services",
    "Binance Australia Halts Australian Dollar Bank Transfers",
    "Binance Australia says banking disrupted as payment provider cuts service",
    "Binance Australia halts Aussie dollar deposits, citing third-party issues",
    "Binance just got de-banked in Australia 📣 which country is next? [image]",
    "Oh no, Binance fraud cut off from Australia. [image]",
    "Treasury Committee - UK Parliament",
    "The UK can't figure out if crypto is gambling or a financial service. Why not both?",
    "Regulating Crypto  —  Summary So-called “cryptoassets” span a wide and rapidly evolving range …",
    "UK Parliament's Treasury Committee wants crypto regulated as gambling",
    "This is the way https://committees.parliament.uk/ ... [image]",
    "if i had more time i'd start a website called old people yelling at crypto https://twitter.com/...",
    "Brace yourselves for YouTube's 30-second unskippable ads",
    "The world watches YouTube: Highlights from Brandcast 2023",
    "YouTube is bringing unskippable 30-second ads to TV",
    "YouTube to soon get 30-seconds long unskippable ads on connected TVs",
    "YouTube to introduce unskippable 30-second ads in TV environment",
    "YouTube's Rolling Out 30-Second Unskippable Ads to Connected TVs",
    "If you're not paying for YouTube Premium yet, you might regret that very soon",
    "YouTube Announces Unskippable Ads for TVs, NFL Partnership, and More",
    "YouTube Introduces Non-Skippable 30-Second TV Ads",
    "YouTube Unveils 30-Second Select Spots, Pause Ads at Brandcast Event",
    "Upfronts: YouTube Adopts Non-Skippable 30-Second CTV Commercials",
    "YouTube debuts unskippable 30-second ads to target brands' TV ad dollars",
    "YouTube Bringing Unskippable 30-Second Ads To The Living Room"
]