[
    "Progress Software Corporation",
    "Cybersecurity and Infrastructure Security Agency",
    "@GossiTheDog@cyberplace.social",
    "MOVEit Transfer Critical Vulnerability (May 2023)",
    "Rapid7 Observed Exploitation of Critical MOVEit Transfer Vulnerability",
    "Zero-Day Vulnerability in MOVEit Transfer Exploited for Data Theft",
    "MOVEit Transfer Critical Vulnerability CVE-2023-34362 Rapid Response",
    "Critical Vulnerability in Progress MOVEit Transfer: Technical Analysis and Recommendations",
    "Progress Software Releases Security Advisory for MOVEit Transfer",
    "Hackers launch another wave of mass-hacks targeting company file transfer tools",
    "CVE-2023-34362  —  Assigner: MITRE Corporation Published: 2023-06-02Updated …",
    "Zero-Day In MOVEit File Transfer Software Exploited To Steal Data From Organizations",
    "Hackers use flaw in popular file transfer tool to steal data, researchers say",
    "Hackers Exploit Progress MOVEit File Transfer Vulnerability",
    "Malicious hackers target vulnerable file-transfer tool",
    "Millions of users vulnerable to zero-day in MOVEit file transfer app",
    "MOVEit Transfer Zero Day Under Attack",
    "MOVEit Transfer has a major security issue - here's what you need to know",
    "Zero-day vulnerability in MoveIt Transfer under attack",
    "MOVEit Transfer Tool Leveraged By Hackers To Steal User Data: US Security Researchers",
    "Threat Actors Exploiting MOVEit Transfer Zero-Day",
    "MOVEit Transfer Zero-Day: What We Know So Far",
    "Update now! MOVEit Transfer vulnerability actively exploited",
    "MOVEit file transfer vulnerability exploited by hackers",
    "Experts warn of MOVEit Transfer tool exploitation using zero-day bug",
    "MOVEit MFT 0-day Vulnerability is Used to Steal Corporate Data",
    "CISA adds Progress MOVEit Transfer zero-day to its Known Exploited Vulnerabilities catalog",
    "Deployed publicly accessible MOVEit Transfer?  Oh no. Mass exploitation underway",
    "MOVEit Transfer Under Attack: Zero-Day Vulnerability Actively Being Exploited",
    "Hackers exploit MOVEit file transfer vulnerability",
    "MOVEit Transfer software zero-day actively exploited in the wild",
    "MOVEit Transfer vulnerability is being exploited widely",
    "MOVEit Transfer zero-day attacks: The latest info",
    "MOVEit Transfer Vulnerability",
    "Security flaw in MOVEit file transfer tool allowed hackers to steal user data",
    "Apple's mixed reality headset is a hedge against disruption",
    "Beyond WWDC  —  A variety of developer organizations will host events throughout the week of WWDC.",
    "Apple's rumoured mixed reality headset may be the miracle the European XR industry needs",
    "Apple's New VR Headset Will Disappoint, but That's OK",
    "What I'm watching for at the WWDC keynote",
    "Apple has built a special hands-on area inside Apple Park for AR/VR headset demos",
    "Reality Pro's library of Apple Music VR concerts has been a decade in the making",
    "Apple WWDC: Everything to know about major live event, as headset and new iPhone features expected",
    "Apple Reality Pro release date just tipped for December — here's what we know",
    "What We Expect From Apple's WWDC 2023 Mac Lineup",
    "What to Expect at Apple's WWDC 2023",
    "Why Apple's VR headset could succeed where every similar product has failed",
    "Apple bulls are bracing for a Tim Cook ‘flex’ moment",
    "Apple Is Stepping Into the Metaverse. Will Anyone Care?",
    "Apple's new headset will land in an AI-crazed world",
    "1 big thing: Apple's new headset will land in an AI-crazed world",
    "Apple's Mixed Reality Bet Comes Due | PRO Insight",
    "Try on Apple's upcoming mixed-reality headset with this new Snapchat filter",
    "Apple expected to unveil mixed-reality headset",
    "Apple WWDC 2023: How to Watch Live and What to Expect",
    "Apple plans ‘controlled’ demos of new AR/VR headset",
    "Apple mixed reality headset to bring a lot of much needed excitement to the space - Barclays",
    "Apple's Reality (Headset) Plans (Above Avalon Report)",
    "Apple Watch's Biggest Update In Years Could Be Revealed In Days",
    "WWDC 2023: Here's the new hardware Apple is expected to announce",
    "Apple's ‘Reality Pro’ will likely offer an in-depth catalog of live concerts",
    "Apple headset revenue estimate: ‘A huge leap of faith’ says Barron's",
    "Apple may ship its upcoming AR/VR headset with some very important warnings",
    "Can Apple make its headset inevitable?",
    "What to Expect at WWDC 2023: AR/VR Headset, New Mac Studio, Mac Pro",
    "Apple to warp reality for real dollars",
    "Apple rumored to redesign core apps in watchOS 10 for larger watch displays",
    "No one has done AR or VR well. Can Apple?",
    "Apple needs to prove why its mixed reality headset matters",
    "Apple reportedly builds hands-on area inside Apple Park for AR/VR headset demos",
    "Apple's $3,000 XR headset is a little pricey; could subscription pricing help?",
    "Road to WWDC: What to expect from Reality Pro and AR/VR",
    "Apple's Ultra-Premium Mixed Reality Headset: Everything We Think We Know",
    "Apple WWDC 2023 is where the new virtual reality headset rumors face a reality test",
    "Can Apple Save the Metaverse?  These Startups Hope So.",
    "Apple Shares ‘Beyond WWDC’ Events for Developers, Uploads Themed Apple Music Playlists",
    "New iOS 17 Apple Wallet rumor: This new feature will help you stay on top of things",
    "Apple casts big shadow over the XR industry | The DeanBeat",
    "Don't judge Apple's VR headset too soon",
    "Apple highlights ‘Beyond WWDC’ events happening next week around the world",
    "watchOS 10 reportedly revamps core apps for the Apple Watch Ultra's larger display",
    "What to Expect from Apple's WWDC 2023",
    "WWDC 2023 Preview  —  Hartley Charlton:  —  Apple is overtly teasing the start of “a new era” …",
    "Apple's Mixed Reality Bet Comes Due",
    "You should lower your expectations for Apple's magic headset",
    "Apple to unveil refreshed Mac Studio at WWDC 23, confirms Mark Gurman",
    "Apple conference kicks off June 5. Here's everything you need to know about WWDC 2023.",
    "Apple's AR/VR headset might be 2023's most sought after Christmas present",
    "What ad products might Apple announce at WWDC 2023?",
    "Apple Highlights ‘Beyond WWDC’ Events Taking Place This Month",
    "Everything Mark Gurman knows about Apple's headset",
    "Join CNET's WWDC 2023 Watch Party: Live Reactions to Apple's New Reveals",
    "Should you be concerned about health and safety with Apple's mixed reality headset?",
    "Gurman: iOS 17 Wallet App May Show Additional Credit Card Balances",
    "Reality Pro could be the ultimate Mac display that Apple would never make",
    "WWDC: Morgan Stanley says December launch for Apple Reality",
    "Apple's AR/VR Headset May Be Here By The End Of 2023",
    "WWDC predictions  —  Plus: Meta tries to crash Apple's party  —  Welcome back to Multicore …",
    "Apple may soon show off its biggest and riskiest new hardware product in years",
    "The Why of Apple XR Headset",
    "New Mac Studio Now Expected To Be Announced At WWDC",
    "Apple WWDC 2023—What It Means for You",
    "A new Mac Studio might be unveiled by Apple during WWDC 2023",
    "The Download: AI films, and the threat of microplastics",
    "reading the warning pamphlet for Reality Pro be like: https://twitter.com/... [image]",
    "i expect some things will happen at WWDC https://www.multicore.blog/...",
    "Protip: You can't be a status symbol if you have a battery pack https://twitter.com/...",
    "@counternotions It appears that way. Life comes at you fast.",
    "ADHD makes sense to some extent actually https://twitter.com/...",
    "@matthewrodier.bsky.social",
    "An update on our approach to US election misinformation",
    "YouTube will stop removing false presidential election fraud claims",
    "YouTube now allows videos that falsely claim Trump won 2020 election",
    "After Ban, YouTube Will Allow Videos That Back 2020 Election Fraud Claims",
    "YouTube will stop removing false claims about 2020 election fraud",
    "YouTube will now allow 2020 election denialism content, in policy reversal",
    "YouTube Reverses Policy That Banned Claims Of Fraud In 2020 Election",
    "YouTube will no longer take down false claims about U.S. elections",
    "YouTube says it will stop removing false claims about past elections",
    "YouTube Will Stop Removing Videos Pushing Lies About the 2020 U.S. Presidential Election",
    "YouTube Revises Its U.S. Election Misinformation Policy Amid Election Season",
    "YouTube Nukes Policy Banning Election Denialism",
    "YouTube Will No Longer Remove US Election Fraud Content",
    "YouTube to stop removing content making false claims on past elections",
    "YouTube reverses course, will not take down controversial or disproven political content",
    "YouTube reverses policy, will allow election denial",
    "YouTube changes policy to allow false claims about past US presidential elections",
    "What's the worst that could happen?",
    "Why would you replace a good policy with a terrible one",
    "Japan privacy watchdog warns ChatGPT-maker OpenAI on user data",
    "It is official: ChatGPT has started taking human jobs",
    "ChatGPT and Generative AI Around the World: Maturity, Opportunities, and Hurdles in Key Regions",
    "How ChatGPT Can Help You Land Your Dream Job",
    "Gosh I wonder what they'll choose?? https://www.washingtonpost.com/ ... [image]",
    "@PhilGastwirth@worldkey.io",
    "Amazon in talks to offer low-cost or free mobile service to Prime customers, report says",
    "Amazon reportedly in talks to bundle mobile phone service as Prime perk",
    "Free mobile service for Amazon Prime members under discussion",
    "Amazon talking to carriers about cheap (or free) mobile service for Prime subs report",
    "Amazon reportedly in talks to sell phone service as part of Prime",
    "Amazon in talks to add low-cost or free 5G wireless service to Prime",
    "US telecom stocks fall on report Amazon in talks for wireless services",
    "Amazon to Offer Free Mobile Service to US Prime Members: Bloomberg",
    "Amazon denies reports of a Prime wireless plan, but I hope it happens",
    "Has Amazon found the ultimate lock-in?  Cheap cellphone service for Prime",
    "Your Next Amazon Prime Perk: Cheap or Even Free Cell Phone Plans?",
    "Amazon Prime could include phone plans for free — here's what we know [Update]",
    "Amazon may provide free cellular service to Prime members",
    "Analyst: Wireless Providers Unlikely to Let the Amazon Fox into Their Hen House",
    "Amazon in Talks with Wireless Carriers to Offer Low-Cost Mobile Phone Service to Prime Members",
    "Amazon Reportedly In Talks With Carriers To Add Mobile Service To Prime",
    "Amazon may give Prime customers a cheaper monthly cellular plan",
    "Amazon might be getting into the phone service game, but is it a good idea?",
    "Telecom stocks fall on report Amazon considers launching mobile service for Prime members",
    "Amazon in Talks to Offer Cheap or Free Mobile Plans to Prime Members",
    "Amazon: No Wireless Plans ‘At This Time’; Telecom Stocks Close Down",
    "Report: Amazon Prime Member Might Get Free Mobile Phone Service",
    "Report: Amazon Wants to Give Cheap or Free Phone Plans to US Prime Members",
    "Amazon is reportedly in talks to provide cheap or free unlimited mobile phone service",
    "There's two ways to make money online: Bundling and Unbundling https://twitter.com/...",
    "@erininthemorning.bsky.social",
    "Musk's response to an anti-trans video sparks 24 hours of chaos at Twitter",
    "Twitter safety chief resigns after Musk criticizes decision to restrict film",
    "Twitter's head of brand safety and ad quality has left the company",
    "Second Twitter Safety Executive Resigns",
    "Elon Musk spent the last 24 hours spreading increasingly unhinged anti-trans content",
    "Elon Musk and Twitter face growing brand-safety concerns after execs depart",
    "Twitter loses two executives in charge of trust and safety",
    "Twitter reportedly loses second top safety executive in two days",
    "Twitter loses second head of Trust and Safety under Musk",
    "Right-wing Musk fans win Twitter CEO's loyalty. Staff loses.",
    "Twitter Loses Its Second Trust and Safety Head Under Elon Musk's Reign",
    "Twitter Sees Two Key Ad-Related Executives Depart",
    "he really seems determined to destroy the company https://twitter.com/...",
    "Tech is NOT and has NEVER been neutral NOR apolitical... https://twitter.com/...",
    "ads on here have gone full late night infomercial",
    "Vimeo will stop supporting its TV apps on June 27th",
    "Learn more about Vimeo ending support for TV apps",
    "The Best TV Remote Apps for Android and iPhone",
    "Vimeo is tuning out its streaming TV apps",
    "Vimeo is Ending Support for All TV Apps in Lieu of Video Casting Features",
    "Vimeo is killing off its TV apps in favor of casting",
    "Vimeo Instituting Changes To How You Can Watch Content On Your TV",
    "Vimeo to shut down all of its TV streaming apps later this month",
    "Vimeo is killing its Android TV, Apple TV, and other apps in favor of casting",
    "RIP: Microsoft is finally killing Cortana on Windows",
    "Microsoft will end support for Cortana on Windows later this year",
    "Microsoft Windows latest: Cortana app out, adverts in",
    "Microsoft is killing Cortana on Windows starting late 2023",
    "Windows 11 Adoption Slowed Down In May",
    "Microsoft will kill support for the Cortana Windows app in late 2023",
    "With Bing Chat Thriving, Microsoft to End Cortana Support on Windows",
    "RIP Cortana on Windows: You should never have left Master Chief",
    "Microsoft to kill Cortana app for Windows 10 and 11 later this year",
    "Dogfood left in bowl. https://www.bloomberg.com/...",
    "Meta Announces $500 Quest 3 Headset Just Ahead of Apple Launch",
    "Meta Will Continue to Support Quest 2 After Quest 3 Launch",
    "Meta Shows First Glimpse of Quest 3 Mixed Reality Gameplay and Improvements Over Quest Pro",
    "Watch The First Quest 3 Mixed Reality Gameplay Footage Here",
    "Meta Reveals Quest 3 VR Headset: Higher Resolutions and Next-Gen Snapdragon SoC",
    "Introducing Meta Quest 3 | Coming This Fall",
    "The Morning After: Meta announces its new mixed-reality headset, the Quest 3",
    "Meta Quest 3 announced: mixed reality headset launching this year for £500",
    "Meta announces its Quest 3 VR headset, which will cost $499.99",
    "Meta unveils Meta Quest 3 headset ahead of Apple's big reveal",
    "Meta unveils Quest 3 VR headset, available in the fall for $499.99",
    "Meta teases new Quest 3 VR headset as Apple gears up for a launch of its own",
    "Meta unveils Quest 3 mixed reality headset: But you probably can't but it yet",
    "Quest 3 won't replace Quest 2 for ‘quite a while,’ confirms Meta",
    "Mark Zuckerberg randomly unveiled the Meta Quest 3 just days before Apple unveils Reality Pro",
    "Zuckerberg unveils Meta Quest 3 VR headset days before Apple reveals its own",
    "The Meta Quest 3 is a $499 mixed reality headset with full-color passthrough",
    "Meta Announces Autumn 2023 Launch for Quest 3 VR and MR Headset",
    "Meta Announces Quest 3 VR and Mixed-Reality Headset, Starting at $500",
    "Meta unveils new virtual reality device ahead of Apple headset launch",
    "Meta's $499 Quest 3 headset arrives this fall",
    "Meta Unveils Quest 3 Ahead of Apple's VR Headset News",
    "Best thing about this is how ridiculous it makes their own Quest Pro look",
    "Say what you will about Meta, but at least they can count to three.",
    "The Metaverse is so back https://twitter.com/...",
    "@boztank @Qualcomm Congrats Boz. Lighter, thinner, faster and still affordable!",
    "Meta Quest 3 behind the scenes - via Zuck's Instagram [video]",
    "No reason behind this choice I'm sure https://twitter.com/...",
    "sorta reminds me of maelstrom gang faces in cyberpunk... [image]",
    "Meta spoiler ahead of Monday... https://www.meta.com/...",
    "Quest 3. The VR headsets are coming fast and furious now. https://www.cnet.com/...",
    "@securopean@infosec.exchange",
    "Microsoft stashes nearly half a billion in case LinkedIn data drama hits",
    "Microsoft Braces for Potential $425 Million GDPR Fine by Irish Regulators",
    "Microsoft sets aside $425M to help cover potential LinkedIn targeted advertising fine",
    "Microsoft Braces for $425 Million Fine over LinkedIn GDPR Privacy Violations",
    "Microsoft says it may pay a $425 million fine over alleged Linkedin privacy violations",
    "Personalized wealth management, built for tech people",
    "Clickbait Rewriting on Artifact: Behind the Scenes",
    "An app might rewrite this clickbait headline — here's why",
    "Artifact's AI Will Rewrite Clickbaity Headlines, Though Don't You Dare Rework Mine",
    "Ooh.  I love this.  I think I am a fan of algorithms doing the work for me.",
    "That's a good use of GPT-4",
    "Twitter's Head of Trust and Safety Resigns",
    "Twitter's trust and safety lead Ella Irwin resigns",
    "Center for Countering Digital Hate",
    "Twitter fails to act on 99% of Twitter Blue accounts tweeting hate",
    "Twitter's Top Content Moderation and Safety Executive Leaves",
    "Twitter loses another trust and safety head",
    "Twitter head of trust and safety Ella Irwin has resigned",
    "Twitter loses its second head of trust and safety since Musk take-over",
    "Twitter trust and safety chief Ella Irwin resigns",
    "Twitter top safety exec Ella Irwin resigns",
    "Twitter Head of Trust and Safety Resigns",
    "Twitter's head of safety and content moderation has left the company",
    "Twitter head of trust and safety Ella Irwin reportedly resigns",
    "Twitter Loses Another Head of Trust and Safety",
    "Twitter's head of trust and safety resigns: reports",
    "I'm shocked to realize Twitter still had a VP of Trust and Safety",
    "surely this has nothing to do with that daily wire publicity stunt earlier",
    "Confirmed, Ella Irwin tells me she resigned today https://twitter.com/...",
    "So, trust and safety are gone? https://www.reuters.com/...",
    "She's been replaced by a 💩 emoji https://www.reuters.com/...",
    "I assume these two developments are related. https://twitter.com/...",
    "Another one bites the dust https://twitter.com/...",
    "Well, she really had no work to do since new ownership took control. https://twitter.com/...",
    "Trust left the office long before this. https://twitter.com/...",
    "Twitter had a head of trust and safety?! 🤨 https://twitter.com/...",
    "job that seems about as desirable as being George Santos' treasurer https://twitter.com/...",
    "Advertisers love this shit. This is what they crave https://twitter.com/...",
    "Wow, Twitter's head of trust and safety is out for a second time. https://twitter.com/...",
    "wheee! https://fortune.com/...",
    "Twitter loses its top content moderation official at a key moment",
    "Elon Musk Personally Elevates Transphobic Video Originally Flagged as Hate Speech",
    "The exit of a top Twitter executive highlighted the platform's content moderation challenge",
    "Apple prepares for a platform shift",
    "It would be funny if Elon Musk's Twitter has “gone woke” in an attempt to avoid “going broke”",
    "@stevenmarkryan The Streisand Effect on this will set an all-time record!",
    "Wonder what stage of @mmasnick's moderation learning curve this is https://twitter.com/...",
    "Whoaaaaaa not good, hope @elonmusk rectifies this immediately https://twitter.com/...",
    "rare twitter W https://twitter.com/...",
    "Facts don't care about your feelings https://twitter.com/...",
    "increasingly rare Twitter W https://twitter.com/...",
    "no one is falling for this publicity stunt right https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/02 - An Amazon Prime Phone Service?",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Malaysia goes its own Huawei, won't ban Chinese vendor from 5G network",
    "The Best Laptops and Desktops of Computex 2023",
    "Dell's XPS 13 Plus with brilliant OLED display sees aggressive $750 discount",
    "International Business Times",
    "Insider trading lawsuit: Here's how much Elon Musk pumped DOGE",
    "Dogecoin ($DOGE) Investors File Class-Action Suit Against Musk for Alleged Insider Trader",
    "DOGE Investors Sue Elon Musk Over Alleged Insider Trading in Crypto Market",
    "DOGE Questioned as a Security in Musk's Class-Action Lawsuit",
    "Elon Musk hit with insider trading claims over his Dogecoin crypto-hype",
    "Elon Musk Sued for Insider Trading With Dogecoin Using “Publicity Stunts”",
    "Plaintiffs in Dogecoin Lawsuit Against Musk Make Wild New Allegations",
    "Elon Musk Faces Insider Trading Accusations in Dogecoin Lawsuit Over Twitter Logo Change",
    "Elon Musk Accused of Dogecoin Insider Trading Offences by Aggrieved Investors",
    "Elon Musk accused of manipulating Dogecoin price in $258 billion lawsuit",
    "Dogecoin investors strike Elon Musk with market manipulation lawsuit",
    "Elon Musk Accused Of Insider Trading, Amended Lawsuit Blames His Bullish DOGE Moves",
    "AI Responsible for 4.8% of US Job Cuts in May: Report",
    "Challenger, Gray & Christmas, Inc.",
    "May 2023 Layoffs Jump on Tech, Retail, Auto; YTD Hiring Lowest Since 2016",
    "Job Cuts From AI Are Just Beginning, the Latest Challenger Report Suggests",
    "Tech layoffs have soared to the highest level in more than two decades",
    "Layoffs Rise 20% in May Led by Technology and Retail",
    "GPT-4 Powered Minecraft Playing Bot Suggests AI Could Automate Some Workplace Tasks",
    "This AI used GPT-4 to become an expert Minecraft player",
    "How to Beat Minecraft Quickly: Use This GPT-4 Powered Bot",
    "Build more connections with new communities in Microsoft Teams and GroupMe features",
    "Microsoft Teams Free Version Gets New Features",
    "Microsoft Teams is getting new AI tools — and they're free",
    "Microsoft Teams Free Announces Its Biggest Upgrade Yet",
    "Microsoft updates Teams with communities and AI-powered Designer support",
    "Microsoft Teams App on Windows 11 Adds New Features for Consumers",
    "Microsoft Teams on Windows 11 is getting a major facelift, and I'm excited",
    "Microsoft rolls out AI-powered “Designer” for Teams along with bunch of other features",
    "Microsoft's AI-powered Designer tool comes to Teams",
    "Meta Calls Employees Back to Office Three Days a Week",
    "Meta will require staff to be in the office at least three days a week",
    "Meta Enforces Three-Day Office Attendance for Employees",
    "Meta orders employees back to office 3 days per week after slashing 21K jobs",
    "Mark Zuckerberg Mandates Meta Employees Return to the Office Three Days a Week",
    "Meta will require employees to return to the office three days a week starting in September",
    "Facebook Parent ‘Meta Platforms’ Mandates Three-Day Office Work Week from September",
    "Meta Platforms rethinks hybrid-work policy, to bring some employees back to office 3x a week",
    "Meta tells staff to return to office three days a week",
    "Meta: Many employees need to return to in-person work 3 days a week",
    "Meta wants staff back in the office three days a week",
    "Now Meta is forcing all its employees back to the office",
    "Meta Requires Office Workers To Return To Desks Three Days a Week",
    "About two years too late. https://www.theinformation.com/ ...",
    "Meta institutes a 3-day work week. https://www.theinformation.com/ ...",
    "This is not going to be more efficient. 🤦🏻‍♀ ️ https://www.theinformation.com/ ...",
    "Marques Brownlee on YouTube",
    "Reimagine the possibilities with the new motorola razr family",
    "The Motorola Razr+ might finally be the flip-style foldable I've been waiting for",
    "Motorola makes its 4th-gen foldable, the Moto Razr+, official",
    "RAZR+ Impressions: Is This What You Wanted?"
]