[
    "Reddit CEO Cites Profit Push in Response to Backlash",
    "Reddit Shows No Signs Of Backing Down From Controversial API Changes In Heated AMA",
    "Reddit CEO: We're Sticking With API Changes, Despite Subreddits Going Dark",
    "Reddit CEO does AMA, doesn't address or even mention upcoming subreddit protests",
    "Reddit's Hoped-For IPO and Pipe Dream of Cashing in on OpenAI's Hype",
    "Reddit CEO Says Keeping Explicit Content on the Site Is a ‘Constant Fight’",
    "Why everyone is freaking out about the Reddit API right now",
    "Following in Apollo's footsteps, Reddit is Fun will be shutting down on June 30",
    "Spez, the CEO of Reddit, doubles down on his accusations against @apolloreddit [image]",
    "the reddit AMA regarding the API changes is going about as well as you'd expect [image]",
    "The reddit AMA surround the API apocalypse has some gems in it [image]",
    "the reddit ama with the CEO is going as well as you'd expect lol https://www.reddit.com/...",
    "What an absolute dumpster fire for Reddit's CEO here: https://www.reddit.com/...",
    "The way spez is treating @ChristianSelig is absolutely disgusting. Shame on Reddit [image]",
    "the ceo of reddit is an actual dumb little piggy boy [image]",
    "Addressing the community about changes to our API",
    "Reddit CEO Steve Huffman defends API changes in AMA",
    "Everything about this “AMA”",
    "Get your scripts ready guys, the AMA has started.",
    "u/spez addresses the community regarding the API changes",
    "RIF gibt die App auf zum 30 Juni wie Apollo",
    "Reddit won't budge on the API changes that are shutting down apps like Apollo",
    "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "Archive Your Reddit Data While You Still Can",
    "Reddit Client Apollo to Shut Down on 30 June 2023",
    "Apollo will shut down as tempers flare over Reddit API changes",
    "Reddit CEO is standing firm on its upcoming and controversial API rate hikes",
    "Reddit's API changes kill Android's best third-party apps, including RIF and Sync",
    "Facing Reddit's Exorbitant API Pricing, Christian Selig Is Shutting Down Apollo",
    "Apollo to shut down; developer has receipts ↦",
    "Reddit client Apollo shutting down on June 30 due to API pricing",
    "Popular Apollo Reddit App is Shutting Down",
    "3rd-Party Reddit App Apollo Forced to Shut Down Due to API Charges",
    "Apollo service to shut down on June 30 following Reddit's change of API policy",
    "Reddit's big fee demand triggers June 30 shutdown of Apollo app",
    "iOS app Apollo shuts down on June 30, and it's all Reddit's fault",
    "Reddit's absurd API price forcing Apollo to shut down on June 30",
    "Several Reddit clients including Apollo, Reddit is Fun, Sync and ReddPlanet are shutting down",
    "Reddit's new API pricing will kill off Apollo on June 30",
    "Third-Party Reddit App to Shut Down",
    "It's not just Apollo: other Reddit apps are shutting down, too",
    "It's time to say goodbye to your favorite Reddit apps",
    "Apollo app to shut down as Reddit API dispute somehow gets uglier",
    "Reddit is Fun, Sync for Reddit to Shutdown Because of reddit API Changes",
    "Popular Reddit App Apollo Is Shutting Down on June 30",
    "Apollo, a Reddit app featured during WWDC, is being shuttered",
    "Reddit API change kills fan favorite third-party client Apollo",
    "Reddit App Apollo to Shut Down Amid $20 Million API Spat",
    "Popular Third-Party Reddit App Apollo Will Shut Down June 30",
    "First Tweetbot and now Apollo. 😢 https://twitter.com/...",
    "Finally I am free from Reddit https://twitter.com/...",
    "After being a daily user since 2008, I'm just about done with Reddit https://twitter.com/...",
    "The Reddit CEO is a fucking lying weasel.",
    "Popular Reddit App Apollo Shutting Down on June 30",
    "Apollo for Reddit is shutting down",
    "L'application iOS Apollo for Reddit va fermer le 30 juin",
    "Apollo for Reddit is shutting down.",
    "Apollo developer announces the shutdown of his app as of June 30, 2023",
    "Generative AI tool Stable Diffusion amplifies race, gender stereotypes",
    "Assessing the business risk of AI bias",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange and Illicitly Operating Another",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange And Illicitly Operating Another",
    "Russians charged with hacking Mt. Gox crypto exchange, running BTC-e",
    "Mt. Gox Hack Update: Russian Nationals Charged, Unveiling a Major Crypto Theft Conspiracy",
    "DoJ Charges Two Russians for Trying to Launder 647K BTC Stolen From Mt.Gox",
    "DOJ Identifies and Charges Mt. Gox Hackers For Stealing 647,000 Bitcoin",
    "Russians charged with hacking Mt. Gox exchange and operating BTC-e",
    "US DOJ Charges Two Russian Nationals With Mt. Gox Hack",
    "U.S. DOJ Charges Two Russians For Hacking Mt Gox",
    "DoJ charges 2 Russians for hacking Mt. Gox crypto exchange",
    "US Justice Department charges two men in Mt. Gox hack",
    "Mt. Gox Suspects Charged: Russian Nationals Indicted by DOJ",
    "DOJ charges two Russians in Mt. Gox crypto hack",
    "Two Russians Charged for Infiltrating Mt Gox and Operating Illicit Crypto Exchange, BTC-e",
    "DOJ charges Russian nationals with laundering bitcoin in 2011 Mt. Gox hack",
    "US DoJ charges two Russians for hacking crypto exchange Mt. Gox",
    "Russian nationals accused of Mt. Gox bitcoin heist, shifting stolen funds to BTC-e",
    "DOJ charges two Russian nationals with historic Mt. Gox hack",
    "DOJ unseals Mt. Gox charges targeting two Russian nationals",
    "US Hits Two Russians With Criminal Charges Over Mt. Gox Bitcoin Hack",
    "Breaking: US DOJ Charges Russian Nationals In Mt. Gox Hack & Running BTC-e Exchange",
    "DOJ unseals Mt. Gox charges against 2 Russian nationals",
    "Breaking: DOJ Takes Down Mt. Gox Hackers For Multi-Million Dollar Crypto Theft",
    "Feds charge two men for the $400 million Bitcoin hack that took down Mt. Gox",
    "DOJ charges two Russian hackers with scheme to launder 647,000 BTC",
    "US DOJ charges 2 Russians with laundering over 600k Bitcoin",
    "US DOJ officially names names in the granddaddy of all SFYL exchange hacks, Mt. Gox",
    "Bing Preview Release Notes: Voice Chat on Desktop",
    "You can now talk to Bing Chat in Windows 11 with your voice",
    "Bing AI Voice Chat Comes to Desktop",
    "As Cortana Retires, Microsoft Brings AI-Powered Bing Voice Mode to Desktop",
    "Bing Chat's desktop version now supports Voice Chat",
    "Bing Chat now adds voice chat for desktop users in this week's dev update",
    "Microsoft now lets you speak to its AI-powered Bing Chat",
    "I am SHOCKED to learn that crypto bros were narcissistic crooks. https://twitter.com/...",
    "Ooo, free money, what shalt we do? https://twitter.com/...",
    "Their Crypto Company Collapsed. They Went to Bali",
    "Their Crypto Company Collapsed.  They Went to Bali.",
    "Statement of CFTC Division of Enforcement Director Ian McGinley on the Ooki DAO Litigation Victory",
    "CFTC Wins Lawsuit Against Ooki DAO",
    "CFTC Scores Victory in Landmark Ooki DAO Litigation Case",
    "Ooki DAO to shut down after ‘precedent setting’ court battle with CFTC",
    "OokiDAO Loses Lawsuit Filed By CFTC, Ordered To Pay $643,000",
    "Ooki DAO to pay $643K fine after CFTC's court victory",
    "US CFTC Wins Precedent Setting Case Against Ooki DAO, Calling It a ‘Wake-Up Call’",
    "“When a DAO comes into contact with general partnership law, something bad happens.” …",
    "Starting to feel like I may not be able to trust Ooki DAO",
    "the DAO is legally a person https://twitter.com/...",
    "Not a good case outcome for DAOs... https://twitter.com/...",
    "CFTC Wins Lawsuit Against DeFi Ooki DAO for ‘operating an illegal trading platform’",
    "AT&T switching to Google's Jibe platform for RCS",
    "AT&T moves its default Android messaging to RCS",
    "AT&T Switches to Google's Jibe for RCS",
    "Crypto.com Winding Down U.S. Institutional Business",
    "Crypto.Com Shutters Its US Institutional Exchange",
    "Crypto.com suspends US institutional exchange service",
    "Singapore's Crypto.com to Halt US Institutional Division Citing ‘Limited Demand’",
    "Crypto.com Arena Keeping Controversial Name Despite Exchange Shut Down",
    "Crypto.com Suspends US Institutional Service As SEC Scrutiny Rises",
    "Crypto.com Shuts Down US Institutional Exchange Amid Regulatory Concerns",
    "Crypto.com to halt US institutional exchange service",
    "Crypto.com suspends institutional exchange services in the US",
    "Crypto.com to Close US Institutional Service Amid SEC's Crypto Crackdown",
    "Crypto.com to halt US institutional exchange offering; retail users unaffected",
    "Ha. Not surprising, high cost lower margin. https://twitter.com/...",
    "Gensler can destroy the U.S. crypto industry, but he can't kill crypto",
    "SEC Chair Gensler says crypto frenzy is rife with ‘hucksters, fraudsters, scam artists’",
    "The New Crypto Bill Gary Gensler Doesn't Want You to Know About",
    "SEC Chair Gensler Says Crypto Is Rife With ‘Hucksters, Fraudsters, Scam Artists’",
    "Ex-SEC attorney says to ‘get out of crypto now’ amid regulatory offensive",
    "Gary Gensler: Crypto market is like 1920s stock market, full of ‘fraudsters’",
    "Lawmaker Calls SEC Enforcement Actions Against Crypto Exchanges ‘Complete Contempt for Congress’",
    "SEC Chair Gary Gensler Accuses Crypto Firms Of Willingly Flouting Rules",
    "SEC Chair Gensler says crypto frenzy is rife with ‘hucksters, fraudsters, scam artists.’",
    "Gensler: Crypto firms know exactly how to register, they just don't want to",
    "Cardano (ADA), Polygon (MATIC), Solana (SOL) Update",
    "Robinhood to Delist ADA, SOL and MATIC After SEC Classification as ‘Securities’",
    "ADA, SOL and MATIC Tank 10% Each After Robinhood Delisting, Will More Exchanges Follow?",
    "Tokens delisted, exchange closed following SEC crypto lawsuits",
    "Crypto Tokens Plunged This Week After Gensler Stepped Up SEC's Industrywide Crackdown",
    "Robinhood Ceases Support For Cardano, Solana, And Polygon After SEC Calls Them Securities",
    "Robinhood to Delist Cardano, Solana, and Polygon Amidst SEC Regulatory Pressure",
    "Robinhood To Delist ADA, MATIC & SOL Following SEC's Crackdown",
    "Robinhood Delists Solana, Cardano, And Polygon",
    "Robinhood pulls the plug on MATIC, SOL, ADA amid SEC crackdown",
    "Robinhood to cut support for Cardano, Polygon, and Solana",
    "Robinhood Ends Support for All Tokens Named in SEC Lawsuit as Securities",
    "Robinhood Delists Cardano, Solana and Polygon Following SEC Suits",
    "Robinhood Moves to Cut Support for Cardano, Polygon and Solana",
    "Robinhood Delists Cardano, Polygon and Solana Following SEC Labeling Them As Securities",
    "Shiba Inu: Will Robinhood Delist SHIB?",
    "Robinhood to delist Cardano, Solana, Polygon; Here's when support will end",
    "Robinhood nixes ADA, MATIC, SOL",
    "Robinhood Markets removes three crypto tokens",
    "Robinhood Removes 3 Crypto Tokens Following Regulatory Crackdown",
    "Solana, Cardano ..... baby why don't we go down to Kokomo",
    "Crypto is getting pummeled https://twitter.com/...",
    "Ethereum Success Hinges On Vitalik Buterin's Proposed ‘3 Transitions’ - What Are They?",
    "Vitalik Buterin calls for three mandatory ‘transitions’ for Ethereum",
    "Decoding Vitalik Buterin's new article “The Three Transitions”",
    "Ethereum Co-Founder Names Three Key Transitions to Watch as Network Grows",
    "Vitalik Buterin Says Ethereum Will Fail Without Three Vital Changes",
    "‘Ethereum Fails’ Without These 3 Changes, Says Vitalik Buterin",
    "Buterin says Ethereum needs 3 critical transitions to ensure its survival",
    "Vitalik Buterin: Ethereum must adopt ‘three transitions’ to succeed",
    "Ethereum's Buterin Releases Roadmap Addressing Scaling, Privacy, Wallet Security",
    "Vitalik Outlines Three Transitions For Ethereum's Future",
    "The Three Transitions: https://vitalik.eth.limo/...",
    "Vitalik: The Three Transitions",
    "Personalized wealth management, built for tech people",
    "Kraken launches your gateway to the world of NFTs",
    "Future of Decentralized Finance (DeFi): Polygon",
    "Kraken Launches NFT Marketplace Out of Beta With Over 250 NFT Collections",
    "US-Based Crypto Exchange Kraken Officially Rolls Out New NFT Marketplace",
    "Kraken's NFT Bid Sets Sail, New Marketplace Out of Beta",
    "Kraken NFTs Quit Beta, Coinbase Receives “Stand with Crypto” Support",
    "Nifty News: Kraken NFT exits beta, Coinbase's ‘Stand with Crypto’ gains support and more",
    "Kraken Launches Full-Scale NFT Marketplace with Over 250 Offerings",
    "Kraken NFT Launches as the Gateway to the World of NFTs",
    "Kraken Unveils Gateway to World of NFTs Marketplace",
    "Blue owned the consumer podcast mic market - now the brand is being phased out",
    "Logitech retires the Blue microphone brand",
    "Blue Microphones brand to be sunset into Logitech G, but no products will be discontinued",
    "Blue Microphones branding is going away after 28 years",
    "Logitech is consolidating some of its sub-brands under the Logitech G umbrella",
    "Logitech Axing the Blue Microphone Brand",
    "Logitech kills the Blue mic brand to sell products under Logitech G name",
    "Logitech kills off Blue microphones, but Yeti stays alive",
    "Logitech is killing off its Blue microphone brand",
    "Logitech retiring the Blue Microphones brand",
    "Logitech is killing off the Blue mic brand, will sell Yeti and Astro under Logitech G",
    "FTX Judge Says Identity Of Customers Will Remain Undisclosed",
    "US Judge Asserts Control over FTX's Crypto Assets, Challenging Bahamas' Liquidators",
    "FTX's US Judge Vows to Keep Control of Crypto in Blow to Bahamas",
    "Free compensation benchmarking data from 3,000 startups",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/09 - Zuck's Not Worried About Apple's Headset (Corrected)",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "United States District Court for the Northern District of California",
    "Realtek Semiconductor v. Mediatek Inc., IPValue Management, and Future Link Systems",
    "Smart TV industry rocked by alleged patent conspiracy from chipmaker [Updated]",
    "OpenAI CEO Calls for Collaboration With China to Counter AI Risks",
    "OpenAI CEO Sam Altman Backs China To Lead AI Regulations",
    "Remember the Uyghurs? And how they are monitored? https://twitter.com/...",
    "‘E3 killed itself’, not competition from Summer Game Fest, says Geoff Keighley",
    "The biggest announcements from Summer Game Fest 2023",
    "Summer Game Fest 2023: Everything Announced",
    "Summer Games Fest 2023: Every Single New Title and Trailer Revealed",
    "Summer Game Fest 2023: Spider-Man 2 Release Date, Sonic Superstars And Other Highlights",
    "Summer Game Fest 2023: How to watch and what to expect",
    "All the Coolest Sci-Fi, Fantasy, and Horror Trailers From Summer Games Fest 2023",
    "Geoff Keighley says E3 was dying long before Summer Game Fest began",
    "E3 Killed E3, Says Summer Game Fest's Geoff Keighley",
    "How to watch Summer Game Fest 2023 and what to expect",
    "How the Summer Game Fest rewarded fans for their patience with long-awaited sequels | The DeanBeat",
    "Summer gaming events 2023: with E3 canceled, here's what's next",
    "Summer Game Fest 2023 LIVE: Every Xbox and PC game announcement, trailer, and reveal",
    "Path of Exile 2 World Premiere Trailer | Summer Game Fest 2023",
    "This Summer Game Fest showcase really brought it home: The idea of E3 died with E3",
    "Best Crypto to Buy Now 9 June - Immutable X, Render, Stacks",
    "Is it still safe to invest in crypto in the U.S.?",
    "Bitcoin Liquidity Worsens on Crypto Exchange Binance.US After SEC Suit",
    "Microsoft to Move Top AI Experts from China to New Lab in Canada",
    "Microsoft to move top AI experts from China to new lab in Canada",
    "United States District Court for the Western District of Washington",
    "Apple and Amazon failed to win a dismissal of an iPhone price-fixing lawsuit against them",
    "Floyd v. Amazon.com, Inc. and Apple Inc.",
    "Apple And Amazon Must Face Lawsuit Over IPhone And IPad Pricing",
    "U.S. judge rules Apple, Amazon must face consumer lawsuit over iPhone, iPad prices",
    "Lawsuit that claims Apple and Amazon elbowed out resellers will proceed",
    "Apple, Amazon must face consumer lawsuit over iPhone, iPad prices, US judge rules",
    "‘Late in the game’: Sunak and Starmer in policy scramble as AI surges ahead",
    "NVIDIA's AI Software Tricked Into Bypassing Guardrails, Giving Out SSNs",
    "Nvidia's AI Software Tricked Into Leaking Data 1",
    "A First Look At The Impact of Netflix's Password Sharing Crackdown",
    "Netflix's password sharing crackdown seems to be working",
    "Ugh, Netflix saw growth after the password crackdown. You know what that means.",
    "Netflix's Password-Sharing Crackdown a Success",
    "Netflix's password crackdown leads to massive subscription spike",
    "Netflix Subscriptions Jump as U.S. Password-Sharing Crackdown Begins",
    "In a shocking turn of events, Netflix subscriptions rise after password-sharing crackdown",
    "Netflix Saw as Much as 100,000 Daily Sign-Ups Post Password-Sharing Ban",
    "Netflix's password-sharing crackdown got me — here's what happened",
    "Netflix Adds More Than 200,000 New Subscribers After Password-Sharing Crackdown",
    "Netflix Password Sharing Crackdown Works, U.S. Subscriber Numbers Soar",
    "Netflix Subscriptions Rise as Password-Sharing Crackdown Takes Effect",
    "People can't seem to quit Netflix after all",
    "Netflix's password-sharing crackdown has really worked out — for Netflix",
    "Netflix's Password Sharing Crackdown Leads to Spike in Account Sign-Ups",
    "Sorry, but Netflix's password-sharing crackdown seems to be going really well so far",
    "Subscriptions Soar as Netflix Begins US Password-Sharing Crackdown",
    "Silicon Valley Business Journal",
    "Netflix's crackdown on password sharing may be paying off",
    "Apple vs. Meta is going to be the tech face-off to watch",
    "Netflix sees jump in subs as it begins to curb password sharing in US, says report",
    "Netflix's Password Sharing Crackdown Leads Subscriptions To Climb",
    "Netflix Reportedly Sees Spike In Sign-Ups Following Password Sharing Crackdown",
    "Netflix's crackdown on password sharing appears to be working",
    "Netflix Stock Rises As Account-Sharing Crackdown Boosts Paid Subscriber Numbers",
    "Netflix's password sharing crackdown is actually working as subscriptions spike",
    "Netflix Sign-Ups Jump Amid Password Sharing Crackdown, Report Says",
    "Netflix's subscriber numbers may have actually grown on the heels of its password sharing ban",
    "Netflix Sees Huge Growth In Subscribers After Password-Sharing Crackdown - Report",
    "Netflix Password-Sharing Rules Having Record-Setting Impact on American Subscriber Acquisition",
    "Netflix sign-ups jump as US password sharing crackdown kicks off",
    "Netflix's Looming Account-Sharing Crackdown Sparks Surge of New Sign-Ups",
    "Netflix subscriptions rise as password sharing crackdown becomes a hit",
    "Could Netflix's password-sharing crackdown actually be working?",
    "Netflix Added Subscribers After Password Crackdown, Research Firm Says",
    "Is Netflix's Anti-Password Sharing Too Unpopular?",
    "Gross subscriber addition ≠ net subscriber acquisition because: churn https://www.wsj.com/...",
    "Spotify tests YouTube like ‘Your Offline Mix’ feature; Is it different? Know it all..",
    "Spotify is officially testing an offline mix",
    "Bad internet? Spotify may bring an offline playlist",
    "Spotify is testing an offline mix for bad signal days",
    "Spotify testing ‘Your Offline Mix’ playlist for when you're offline",
    "Spotify is finally ready to save you when you forget to download a playlist",
    "Spotify Is Testing an ‘Offline Mix’ Option for Spotty Internet Connection",
    "Spotify Testing ‘Your Offline Mix’ for Patchy Connections",
    "Spotify is testing an ‘offline mix’ that downloads recently played songs",
    "Spotify's “Offline Mixes” Downloads Songs Smartly for Offline Listening",
    "Spotify is testing a feature that could fix a problem we've all encountered",
    "Spotify tests “offline mix” for when you lose connectivity",
    "Spotify is Tested an ‘Offline Mix’ Feature",
    "Spotify wants to steal one of YouTube Music's best features",
    "Spotify testing ‘Offline Mix,’ its version of one of YouTube Music's best features",
    "Got no internet?  Spotify is testing an offline mix playlist",
    "Spotify testing new Your Offline Mix playlist to make experience better",
    "Apple Music should steal this upcoming Spotify feature",
    "Youtube Music has this since years https://twitter.com/...",
    "National Vulnerability Database",
    "CVE-2023-2868  —  Description A remote command injection vulnerability exists …",
    "Barracuda urges customers to remove and replace vulnerable hardware exploited by hackers",
    "CVE-2023-2868: Total Compromise of Physical Barracuda ESG Appliances",
    "Barracuda Says Attacks On Compromised Email Security Customers Are ‘Ongoing’",
    "Barracuda urges customers to replace compromised ESG appliances immediately",
    "Barracuda tells customers to replace vulnerable email security appliances after hacker exploit",
    "Immediate replacements urged for compromised Barracuda ESG appliances",
    "Barracuda ESG users told to throw away their hardware",
    "ACT government falls victim to Barracuda's ESG vulnerability",
    "Barracuda tells its ESG owners to ‘immediately’ junk buggy kit",
    "Binance.US Set to Be Cut Off From Banking System After SEC Suit",
    "Binance.US To Suspend USD Deposits And Fiat Withdrawal Channels",
    "Binance.US Banking Partners Set to Cut Dollar Payment Rails",
    "Bitcoin Trades at Narrow Discount on Binance.US",
    "Binance US Halts USD Deposits, Withdrawals — Asks Users to Withdraw Dollars by June 13",
    "Binance.US Suspends USD Deposits And Withdrawals Amid SEC Pressure",
    "Breaking: Binance.US suspends USD deposits, warns of fiat withdrawal pause",
    "Binance US to Pause USD Fiat Withdrawals From June 13",
    "Binance.US suspends USD deposits as senators call for DoJ investigation",
    "Bitcoin trades at slight discount on Binance.US as banking partners cut ties",
    "Binance.US to Halt Fiat Withdrawals As Early As June 13",
    "Binance.US to Lose Banking Access, Halts Dollar Deposits",
    "Binance.US Halts USD Deposits, Blames SEC's ‘Witch-hunt’",
    "BinanceUS suspends USD deposits and withdrawals",
    "Binance.US To Suspend All USD Deposits And Withdrawals",
    "Binance Halts Trading in Dollars on Its U.S. Exchange",
    "Binance Withdrawals: Exchange Suspends USD Deposits as Banking Partners Mull Fiat Pause",
    "Bitcoin is showing great resilience as it enters a new era",
    "Binance.US suspends USD deposits following SEC pressures",
    "Binance US Shifts to ‘Crypto-Only’ Operations Amid Intensified SEC Scrutiny",
    "Binance US Stops All USD Transfers As SEC Intimidates Bank Partners",
    "Binance.US Faces Banking Cutoff After SEC Showdown",
    "Banks Abandoning Binance.US as SEC Legal Battle to Begin",
    "Binance.US Suspends USD Deposits Amidst SEC Lawsuit",
    "Binance.US to halt all fiat withdrawals ‘as early as June 13’",
    "Game Over: Binance US Loses Access to the USD Banking Network, Halts US Dollar Deposits",
    "Binance US' Banking Partners To Suspend USD Withdrawals By June 13",
    "Binance.US faces cut from banks amid SEC lawsuit",
    "BinanceUS suspends USD deposits, says bank partners will pause dollar payments next week",
    "Binance.US announces USD deposits suspension, pauses fiat withdrawal channels",
    "Binance.US suspends U.S. dollar deposits, to pause fiat withdrawal channels",
    "The crackdown continues. The walls are closing in. https://www.reuters.com/...",
    "Binance.US To Halt Dollar Deposits After SEC Crackdown",
    "Meta Reveals Twitter Competitor It Plans to Launch as Stand-Alone App",
    "Meta's first generative AI feature will be AI stickers in Messenger",
    "Generative AI is coming to ‘every single one’ of Meta products",
    "Meta previews consumer AI tools, from chatbots to photo editors to “stickers”",
    "Instagram is Developing Generative AI Chatbots",
    "After a Rocky Year, Zuckerberg Lays Out Meta's Road Map to Employees",
    "Meta's First AI Tools for Instagram and Facebook Revealed",
    "What Does Meta's Mark Zuckerberg Think About Apple's Vision Pro Headset?",
    "Meta is Planning New AI Features in Facebook Messenger and Instagram",
    "Meta previews generative AI tools planned for its platforms",
    "Mark Zuckerberg: AI will be built into all of Meta's products",
    "Meta exhibits new AI tools similar to ChatGPT during a company meeting",
    "Mark Zuckerberg plans to put AI features into Facebook, Instagram, and WhatsApp",
    "Zuckerberg shares AI products to reassure employees of strategy",
    "Struggling Meta showcases new AI tools at company meeting",
    "Meta huddle: Zuckerberg unveils AI tools and snubs Apple headset",
    "Mark Zuckerberg plans to integrate AI technology ‘into every single’ Meta platform",
    "#383 Mark Zuckerberg: Future of AI at Meta, Facebook, Instagram, and WhatsApp",
    "Mark Zuckerberg lays out Meta's grand ambitions for generative AI",
    "Meta has seen some ‘incredible breakthroughs’ in AI, CEO Mark Zuckerberg said",
    "Mark Zuckerberg says generative AI is coming to ‘every single one of our products’",
    "Mark Zuckerberg reveals plans to add AI into Facebook & Instagram",
    "Zuckerberg says Meta building generative AI into all its products, recommits to ‘open science’",
    "that's not going to cause any issues, not at all https://twitter.com/...",
    "Google introduces Secure AI Framework as an aid towards safeguarding AI technology",
    "Introducing Google's Secure AI Framework",
    "Google Launches Framework to Secure Generative AI",
    "Google's Secure AI Framework: A good start, but a lot of work ahead",
    "Google Introduces Secure AI Framework for Safe AI Deployment",
    "AI is risky business, but Google has a new framework to keep things in check",
    "Google: FUD Embedded in the Glacier Strategy",
    "Google launches Secure AI Framework to help secure AI technology",
    "Google Introduces SAIF, a Framework for Secure AI Development and Use",
    "AI: Google seeks to regain lost ground",
    "Google lays out its vision of securing AI",
    "Google releases plan to protect you from AI threats",
    "Google releases Secure AI Framework to help companies protect AI models from hacking",
    "Google lays out its vision for securing AI"
]