[
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker",
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 12%",
    "New Jersey Office of Attorney General",
    "SEC sues Coinbase, continues major crackdown on cryptocurrency exchanges",
    "The SEC Rejected Coinbase's Registration as a Broker-Dealer in the US",
    "The SEC is finally making good on its threats to rein in crypto",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "Jack Dorsey Faces Fierce Backlash After Calling Ether A Security",
    "Elon Musk's Support For Dogecoin Amplifies Amid SEC's Securities Label",
    "Coinbase Accused of Breaking Market Rules as Crypto Crackdown Widens",
    "SEC's Gensler claims ‘parallels’ between Binance and FTX, yet one wasn't sued",
    "SEC sues Coinbase in widening crackdown on crypto exchanges",
    "Coinbase is being sued by the SEC",
    "Coinbase Violated Securities Laws With Staking Program, Multiple U.S. State Regulators Allege",
    "Crypto Bull Cathie Wood's ARK Invest Buys $21 Million In Coinbase (COIN) Shares",
    "US senators slam SEC's Coinbase lawsuit, demand clearer crypto regulations",
    "Ark Invest Buys $21.6 Million Worth Coinbase Shares, Despite Legal Drama",
    "Cathie Wood's ARK Buys $21.6M Coinbase Shares as SEC Suit Sends COIN Prices Tumbling",
    "SEC Sues Coinbase for Unregistered Crypto Brokering; Spotify Redirects Podcast Division",
    "Coinbase sued by SEC in New York Federal court",
    "Crypto Crackdown: Coinbase and Binance Lawsuits Shake Markets",
    "US extends crackdown on crypto with lawsuit against Coinbase",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "CNBC Daily Open: New Highs for the S&P and Nasdaq",
    "Former Twitter CEO Claims Ethereum Is A Security, Will This Affect Prices?",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "mission driven company, where the mission is failure",
    "How are the “we take a long view of crypto” people doing today",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "Yes. https://twitter.com/...",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "They didn't sue FTX. https://twitter.com/...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC is going crazy https://twitter.com/...",
    "Mistakes were apparently made... https://twitter.com/...",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "BREAKING WE'RE ALL CRIMINALS",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "Gary upping the ante this week. https://twitter.com/...",
    "International Business Times",
    "Binance and Coinbase Show Knives Out for Crypto",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "Bitcoin and Ether Inch Upward Despite SEC's Crypto Crackdown",
    "Binance, Coinbase CEOs Collectively Lost $1.7 Billion Of Personal Wealth After SEC Crackdown",
    "Prices of Some Crypto Coins Drop After SEC Says They're Securities",
    "SEC lawsuits: 67 cryptocurrencies are now seen as securities by the SEC",
    "Binance Lawsuit: SEC Now Considers 61 Cryptocurrencies as Securities",
    "SEC charges Coinbase over illegally listing securities",
    "Seven bombshells from the SEC's Coinbase suit",
    "The 3 Takeaways From the Lawsuit Between the SEC and Coinbase",
    "This Is What the Government Strangling Crypto Looks Like",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "The Eclectic Light Company",
    "Apple Makes Developer Betas Free to Download and Install",
    "How to install the iOS 17 beta on your iPhone",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Apple will let you install its newest developer betas right now — for free",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Apple makes iPhone developer accounts (and betas) free for everyone",
    "Apple's iOS 17 Developer Beta is now free for everyone — but some users are furious",
    "4 Reasons Why You Shouldn't Install the iOS 16 Beta on Your iPhone",
    "Apple makes downloading iOS 17, iPadOS 17 and other developer betas free",
    "Now anyone can download the iOS 17 Developer Beta 1 for free",
    "It wasn't a mistake — Apple betas are now free",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "How to run a macOS beta on Apple silicon",
    "Apple Developer Program access no longer requires $99 subscription",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple's iOS 17 developer beta is available for free",
    "Apple's iOS 17 developer beta is now free to install",
    "Apple makes OS betas free for all users",
    "iPhone users can try out new iOS 17 features without any repercussions or cost",
    "You Can Install MacOS Sonoma Beta Right Now, But Don't",
    "How to download the watchOS 10 beta on your Apple Watch",
    "Rare bug allows non-developer iPhone users to download and install iOS 17 beta",
    "Apple made the iOS 17 developer beta available to everyone — but you probably shouldn't install it",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "How to get iOS 17 — Quick! You might get it for free",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "iOS 17 Developer Beta made available to all",
    "iOS 17 beta is here, but only for developers",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "@williamgunn@mastodon.social",
    "Apple quietly tests iMessage feature that might reduce green bubble bullying",
    "iOS 17 will make life worse for Android users - here's why",
    "Chatting with iPhone users from Android will be even worse in iOS 17",
    "iOS 17 beta brings changes to SMS texting, including ability to edit messages and more",
    "Unleashing the Gaming Revolution: CrossOver Mac's DirectX 12 Support Update!",
    "Bring your game to Mac, Part 1: Make a game plan - WWDC23 - Videos",
    "Apple's new Proton-like tool can run Windows games on a Mac",
    "CrossOver announces DirectX 12 support coming to macOS this summer",
    "New DirectX 12-to-Metal translation could bring a world of Windows games to macOS",
    "Mac Gaming to Gain DirectX 12 Support via CrossOver 23",
    "United States District Court for the District of Columbia",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "Press Release SEC Seeks Emergency Relief to Ensure Binance.US Customers' Assets are Protected",
    "Bitcoin price commands premium on Binance.US after SEC lawsuit",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "SEC seeks to freeze $2bn in Binance.US assets, Coinbase vows to take legal fight to Supreme Court",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "Asset Freeze Bombshell: SEC Takes Aggressive Stand Against Binance.US",
    "Binance.US Says Customer Funds Are Safe As SEC Requests Restraining Order To Freeze Assets",
    "Woo: “Binance customers don't care” about SEC enforcement action",
    "SEC Goes to War With Crypto: Bitcoin Pumps!",
    "The SEC is seeking court order to freeze Binance US's assets",
    "SEC files motion for restraining order to freeze Binance US assets",
    "SEC Seeks to Freeze Binance.US Assets, Files Temporary Restraining Order",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "SEC Seeks Court Approval to Freeze Binance US Crypto Assets, Citing Customer Safety Concerns",
    "Binance says US users' crypto is safe after SEC files to freeze assets",
    "SEC Wants to Freeze Binance Assets to Protect US Customers",
    "Binance.US says user funds ‘remain safe’ amid SEC attempt to freeze assets",
    "U.S. SEC Files Emergency Motion To Freeze Binance US' Assets",
    "SEC requests asset freeze on Binance.US amidst lawsuit alleging compliance failures",
    "[DB] SEC Seeks Temporary Restraining Order to Freeze Binance US Assets: Court Filing",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "Withdraw from Binance US if you have any funds on the platform. https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "Binance.US raked in $410 million of revenue since inception, accounts show",
    "What exactly does the SEC claim CZ did with BinanceUS?",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "SEC seeks express court order to freeze BinanceUS's assets",
    "The SEC sues Binance, unveils 13 charges against crypto exchange in sweeping lawsuit",
    "SEC Asks Court to Freeze Binance.US Assets",
    "Instagram's recommendation algorithms are promoting pedophile networks",
    "Instagram Connects Vast Pedophile Network $META https://www.wsj.com/...",
    "Why Apple's Acquisition of Mira Is a Game-Changer for AR Technology",
    "The Morning After: iOS 17 offers better protection for unsolicited images",
    "Apple boosts its Vision Pro headset with an AR startup buyout",
    "Apple's AR/VR shopping spree continues",
    "Apple acquires Mira, a technology company specializing in AR software and hardware",
    "Apple acquires augmented reality headset startup",
    "Apple confirms acquisition of AR startup Mira: What this means for its spatial computing dreams",
    "Apple confirms acquisition of AR startup Mira following Vision Pro launch: Report",
    "Apple acquires B2B AR startup Mira",
    "Report: Apple Acquires AR Headset Maker Mira",
    "Apple acquires Mira, a startup building lightweight AR hardware",
    "Apple reportedly acquired AR start-up Mira as it pushes new headset vision",
    "Mira made AR headsets for the US Military — and Apple owns the company now",
    "Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World",
    "Apple buys AR headset startup Mira - The Verge",
    "@RichLightShed ... Funny part there is Apple looked at buying Within first!",
    "@dangillmor@mastodon.social",
    "@metacurity@infosec.exchange",
    "Big Tech rolls back misinformation measures ahead of 2024",
    "The Download: ocean-based carbon removal, and Musk's untweeted trip to China",
    "Cyberdefenders respond to hack of file-transfer tool",
    "EU considers mandatory ban on using Huawei to build 5G - FT",
    "Everyone points to Huawei.  But ZTE is still all over the place",
    "HealthcareInfoSecurity.com",
    "@dannyjpalmer@infosec.exchange",
    "Clop cyber gang claims MOVEit attack and starts harassing victims",
    "Clop Ransomware Gang Asserts It Hacked MOVEit Instances",
    "Clop ransomware claims responsibility for MOVEit extortion attacks",
    "Meet Your New Creative Writing Partner — The Jetpack AI Assistant",
    "Wordpress' Jetpack AI will write your blog posts for you",
    "Introducing Jetpack AI Assistant in WordPress.com",
    "WordPress Now Has An AI Content Generator - Free Access Available",
    "Reddit to lay off about 5% of workforce: Report",
    "Reddit lays off over 90 employees, reduces fresh hiring to cut costs",
    "Reddit Laying Off 5% Of Workforce, Joining Tech Sector Contraction",
    "Reddit to lay off about 5% of its workforce as tech job cuts top 200,000",
    "Reddit to cut 5% of workforce, slow hiring in restructuring move: report",
    "Reddit is the latest tech company to announce layoffs, affecting 5 percent of its workers",
    "What's Behind the Redditor API Strike",
    "Will greater local autonomy take Sequoia to new heights?",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia Capital's U.S. Partners May Reap China Gains Even After Split",
    "Sequoia's three-way split brings abrupt end to global strategy",
    "Sequoia Capital to split China and India-Southeast Asia operations amid geopolitical challenges",
    "Sequoia splits China and India arms from US mothership",
    "Now in beta: Save and sign in with passkeys using 1Password in the browser",
    "Are we heading towards a future without passwords?",
    "1Password's latest beta rolls out Chrome passkeys",
    "Google unlocks passkeys support for Workspace",
    "How to use passkeys with 1Password and ditch your passwords for good",
    "1Password passkey support for the web launches in public beta on the Mac",
    "Google Workspace Now Supports Passkey Login",
    "1Password rolls out Chrome passkeys with latest beta, how to use it",
    "Tingo Group: Fake Farmers, Phones, and Financials—The Nigerian Empire That Isn't",
    "Fintech Tingo's shares slump as Hindenburg takes short position",
    "The Tingo Tangle: Hindenberg Research Alleges Fabricated Figures, An ‘Exceptionally Obvious Scam’",
    "👨🏿‍🚀TechCabal Daily - An “exceptionally obvious” Bingo play?",
    "Tingo Group Refutes Malicious and Misleading Allegations in Hindenburg Research Report",
    "US-Listed Nigerian ‘Agri-Fintech’ Firm Tingo Rocked By Allegations Of Brazen Fraud",
    "Hindenburg Research publishes investigation into fintech Tingo Group claiming financial fraud",
    "Shortseller Hindenburg Research calls Tingo Group an exceptionally obvious scam",
    "That @HindenburgRes report on tingo is devaststing",
    "Louis Vuitton Selling $41K NFTs That Can't Be Resold",
    "Louis Vuitton To Debut New NFT Collection For Top Customers",
    "Louis Vuitton embraces Web3, launches its iconic trunk as a digital collectible",
    "Louis Vuitton Set to Launch $42,000 Physical-Backed NFT Trunks",
    "Louis Vuitton Vends $41k NFTs to Elite Customers",
    "Louis Vuitton Launches Treasure Trunk Digital Collectible Priced at €39,000",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "GetHarley raises £42m for digital dermatological platform",
    "GetHarley Closes $52 Million Funding Round Led by Index Ventures",
    "Instagram is apparently testing an AI chatbot that lets you choose from 30 personalities",
    "Instagram Joining ChatGPT Rivalry? Developer Says Meta Company Testing 30-Personality AI Chatbot",
    "Social-Media-Platform-Instagram- Possibly-Working-on-an-AI-Chatbot",
    "Instagram AI chatbot is in the works - a new companion is coming",
    "Instagram may be looking into ways of thinking instead of its users",
    "Instagram May Be The Next Social Media App To Get An AI Chatbot",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Instagram works on AI Chatbots in DMs",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Salesforce CEO Benioff shakes up top ranks - source",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "STAT+: Google strikes deal with Mayo Clinic to comb patient records using generative AI",
    "Priceline Partnering with Google on New AI Tools",
    "Priceline joins A.I. chatbot race, signing on with Google to help ease travel booking",
    "Priceline partners with Google to deploy generative AI",
    "Priceline Charts Businesswide Generative AI Deployments with Google Cloud",
    "Google Brings AI to Priceline to Help Plan Your Vacations",
    "e-Conomy India 2023  —  Executive Summary A continued shift in consumer and merchant behaviour …",
    "India's internet economy to reach US$1 trillion by 2030: Google, Temasek and Bain & Company report",
    "India's digital economy to register 6x growth, reach $1 trillion by 2030",
    "'India's Internet economy to reach $1 trillion by 2030'",
    "India's Internet Economy To Grow Sixfold To $1 Trillion By 2030, Says Google-Temasek-Bain Report",
    "India's internet economy to reach $1T by 2030, contribute 12-13% to GDP: Report",
    "Smaller cities key to India's digital decade",
    "India's Internet economy to grow six-fold to $1 trillion by 2030",
    "e-Conomy India 2023: Strategies for growth in India's digital decade",
    "GSoft announces CA$125 million investment from CDPQ to accelerate growth strategy",
    "Caisse Invests $93 Million in GSoft to Fund Global Acquisitions",
    "Samsung's throwing a folding phone party in July",
    "Samsung's Galaxy Unpacked event confirmed for July",
    "Samsung picks Seoul to unveil new foldable phones for 1st time",
    "Samsung confirms details about its upcoming Galaxy Unpacked event: Here's what we know",
    "Samsung will unpack Galaxy Z Fold 5 and Z Flip 5 in Seoul: 3 reasons why this is significant",
    "Mobile Devices, Tablets & Phones News - Page 1",
    "Samsung's new foldables will be launching this July",
    "Samsung will focus on foldables in its upcoming July Unpacked event",
    "Samsung Galaxy Unpacked 2023: New foldables launching in Seoul next month [details]",
    "Samsung to Unfold the Galaxy Z Fold 5 and Flip 5 in July",
    "Samsung's next-generation foldables will be revealed at Galaxy Unpacked in July",
    "The Galaxy Z Flip 5, Fold 5 are officially coming earlier than expected",
    "BREAKING: Samsung confirms Galaxy Z Flip 5, Z Fold 5 will launch in July",
    "Samsung to Host Galaxy Unpacked Event in Seoul for First Time",
    "Its official: Samsung Galaxy Z Fold 5 launching on July 26 in Korea",
    "Official: Samsung confirms first Korea Unpacked, Galaxy Z Fold 5 launch on July 27",
    "Samsung's next Unpacked event is all about foldables - and it's happening sooner than usual",
    "Samsung Galaxy Z Fold 5 and Flip 5 launching late July at Unpacked in South Korea",
    "Samsung confirms Galaxy Z Flip 5, Fold 5 launch details",
    "Samsung confirms Galaxy Unpacked 2023 event in July: What to expect",
    "Samsung's next foldable-focused Galaxy Unpacked will take place in late July",
    "Samsung Confirms Galaxy Unpacked for Galaxy Fold 5 Happening in July",
    "The press release (archived): [image]",
    "Nuview Receives Investment from Leonardo DiCaprio",
    "Actor Leonardo DiCaprio Invests in NUVIEW's LiDAR Satellite Constellation",
    "GitLab Reports First Quarter Fiscal Year 2024 Financial Results",
    "A16z's Marc Andreessen speaks out against AI doomer cults",
    "Andreessen Horowitz Co-Founder Marc Andreessen on ‘Why AI Will Save the World’",
    "Veteran VC Marc Andreessen defends AI, including music uses",
    "Actually, AI will save the world, not destroy it, says venture capitalist Marc Andreessen",
    "A.I. doomers are a ‘cult’ — here's the real threat, according to Marc Andreessen",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "Every decade or so, @pmarca takes a view that defines the decade(s) ahead. https://twitter.com/...",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Important new post from @pmarca https://a16z.com/...",
    "Meanwhile, the crypto-native life insurer, bags $19m seed funding",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Bitcoin Life Insurance Startup Raises $19M in Seed Rounds Led by Sam Altman and Gradient Ventures",
    "I really hope this Apple Vision Pro feature makes it to iPhone",
    "I'll buy the Vision Pro, but I need Apple to answer these 11 questions first",
    "Will Apple Arcade be enough to push the Vision Pro?",
    "Apple Vision Pro Headset: News, Pricing, Release Date, and Specs",
    "Vision Pro could be Apple's biggest hit since iPhone, but that won't be known for years",
    "How Apple Vision Pro Works With the Mac",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "Marques Brownlee on YouTube",
    "Adam Savage's Tested on YouTube",
    "Apple Vision Pro Impressions!",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "3 things I learned by trying Apple's Vision Pro headset (and 3 I didn't)",
    "Hands-on with Apple Vision Pro: This is not a VR headset",
    "Hands on: Apple Vision Pro: I just wore the future",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Apple reveals Apple Vision Pro headset",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Even with so many demonstrated use cases, Apple Vision Pro might not yet have a purpose",
    "Calm down, the Apple Vision Pro headset isn't that dystopian",
    "We tried Apple Vision Pro: Intuitive as a touch screen but awkward to wear",
    "Apple Vision Pro Hands-On Impressions!",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Here's what it's like typing with Vision Pro and visionOS",
    "I tried Apple Vision Pro and it's far ahead of where I expected",
    "Apple's Vision Pro sets up a clash with Valve, Sony, Meta over future of VR/AR",
    "The Engadget Podcast  —  227 Episodes  —  We've survived day one of Apple's WWDC '23 …",
    "Vision Pro: BBC editor tries out Apple's $3,499 headset",
    "Everything you need to know about Apple's $3,499 Vision Pro AR/VR headset",
    "Apple Vision Pro doesn't solve my biggest problem with VR headsets",
    "My first encounter with Apple Vision Pro completely changed by opinion on VR",
    "Here's what wearing Apple's Vision Pro virtual reality goggles is really like",
    "Apple's Vision Pro Is A New Spatial Computing Device — Not A Headset",
    "Apple launches Vision Pro mixed reality headset into unproven niche market",
    "Engadget Podcast: Trying out Apple's Vision Pro headset",
    "Generative Fill Hands-On and Apple VisionPro Hands-Off",
    "First Hands-On Demos with Apple Vision Pro [VIDEOS]",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "I tried the Apple Vision Pro mixed-reality headset — here's what it's like",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple Vision Pro Hands-On: This Is the Headset I'd Use to Watch 3D ‘Avatar’",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro first look",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "wow this is a way better demo than what Apple showed during its keynote https://twitter.com/...",
    "Incredibly clear and lifelike. Best I've seen yet. https://twitter.com/...",
    "These are the people you are up against if you think the Apple Vision Pro will fail [image]",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "This is not the final form https://9to5mac.com/...",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "Microsoft to pay $20m for child privacy violations",
    "Microsoft to pay $20 million for XBOX children privacy violations",
    "Microsoft To Pay $20m For Violating Children's Privacy",
    "Microsoft has been fined $20 million for collecting children's data",
    "Recent Privacy Fines Remind Us Why We Need Web3",
    "Xbox hit with a $20 million fine for 'illegally retaining children's personal information'",
    "CNET Backpedals On AI-Generated Content; FTC Fines Microsoft $20M For Collecting Kids' Data",
    "Xbox fined $20M for child privacy violations by FTC",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "That fine is 49 minutes of Microsoft's revenue."
]