[
    "Changes to News Availability on Our Platforms in Canada",
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Meta to end access to news on Facebook, Instagram in Canada",
    "Facebook and Instagram to restrict news access in Canada",
    "Meta is yanking news from Facebook and Instagram in Canada",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "Facebook vows to restrict news access in Canada",
    "Canadian Senate passes bill requiring Google, Meta to pay for news",
    "Meta makes good on promise to remove news from Canadian Facebook",
    "Meta to End News on Facebook and Instagram in Canada",
    "Meta to end news sharing on Facebook and Instagram for all Canadians",
    "News Media Canada Welcomes Passage of Online News Act",
    "Meta to pull plug on news sharing in Canada",
    "Facebook says it will pull Canadian access to news as Bill C-18 heads for Royal Assent",
    "Meta Blocks News on Facebook, Instagram in Canada Over New Law",
    "Bill C-18: Liberal Government's Online News Act Becomes Law",
    "Canadians will no longer have access to news content on Facebook and Instagram",
    "Meta confirms it will block news on Facebook, Instagram as Senate passes Bill C-18",
    "Facebook confirms that all news sharing in Canada will end due to passage of Bill C-18",
    "Top TikTok exec and public face of company in US is stepping down",
    "TikTok's senior U.S. executive steps down, signaling major change",
    "TikTok's Top U.S. Executive to Leave the Company After Nearly Five Years",
    "Ex-Disney powerhouse Zenia Mucha hired by TikTok amid political pressure",
    "TikTok operating chief Pappas to step down after five years",
    "TikTok chief operating officer V Pappas steps down after five years",
    "TikTok looks to challenge Amazon and Shein with new e-commerce initiative",
    "TikTok Shakes Up Leadership Amid Questions About Its Future",
    "TikTok's #2 Exec Bails as Company Fights for Its Life",
    "Former Disney Executive Zenia Mucha Joins TikTok as Chief Brand and Communications Officer",
    "TikTok chief operating officer to step down",
    "Vanessa Pappas Steps Down as TikTok COO",
    "TikTok COO V Pappas departs as the app faces more congressional battles",
    "V Pappas is leaving TikTok.",
    "TikTok's COO to step down after nearly 5 years at the popular social media company",
    "V. Pappas, the COO of TikTok, has resigned",
    "TikTok's most visible U.S. exec steps down",
    "TikTok COO Pappas Steps Down",
    "TikTok COO V. Pappas Steps Down",
    "Here's the note I sent to all TikTok employees this morning [image]",
    "TikTok says COO Vanessa Pappas has quit “to refocus on their entrepreneurial passions”",
    "@mattontech@mastodon.sdf.org",
    "Microsoft says Xbox has 'lost the console wars",
    "PlayStation Boss Jim Ryan ‘Pretty Sure’ Call of Duty Will Remain on PlayStation in Bombshell Email",
    "Microsoft Says It Could Abandon Activision Deal if Judge Delays It",
    "FTC: Xbox-exclusive Starfield is “powerful evidence” against Activision deal",
    "The FTC's case against Microsoft could quickly turn into Xbox vs. PlayStation",
    "Microsoft Says Even Rival Sony Had No Concern Over Activision Deal",
    "Microsoft Expects New Xbox, PlayStation 6 in 2028 Says Court Filings",
    "Microsoft Has Claimed That It's Already Lost The “Console Wars”",
    "Activision Blizzard demanded special treatment to keep Call of Duty on Xbox",
    "Xbox's Indiana Jones Game Was Originally Set To Launch On PlayStation Too",
    "Microsoft Says Xbox Has Been Losing The Console Wars Since 2001",
    "Microsoft Filing Claims That Xbox Lost the Console Wars",
    "Microsoft Claims That Xbox Has “Lost The Console Wars”?",
    "PlayStation Boss Admitted Xbox/Activision Deal Isn't About CoD Exclusivity In Private Email",
    "Petition Demanding Elder Scrolls 6 Drop Xbox Exclusivity and Come to PlayStation is Blowing Up",
    "Microsoft Acknowledges Defeat in the Console Wars Amid Activision Blizzard Acquisition Controversy",
    "“We've Lost the Console Wars,” Says Trillion Dollar Underdog Xbox",
    "“Xbox Has Lost the Console Wars” Admits Microsoft, Next-Gen Consoles Expected in 2028",
    "‘Xbox has lost the console wars’ says Microsoft as court case begins",
    "Sony: Future PlayStation info won't be given to Activision Blizzard if Microsoft buys it",
    "Microsoft May Have Inadvertently Revealed When The PS6 Will Arrive",
    "“Xbox has lost the console wars,” says Microsoft",
    "Xbox is actually a small indie game company... https://twitter.com/...",
    "Aurora's 10,624 Blades in Place as Exascale System Nears Completion",
    "2 ExaFLOPS Aurora Supercomputer Is Ready: Intel Max Series CPUs and GPUs Inside",
    "Aurora Supercomputer Blade Installation Complete",
    "Argonne Aurora Supercomputer Intel Max Blade Installation is Complete",
    "Intel, HPE Load Aurora Supercomputer With Over 63,000 GPUs, 21,000 CPUs",
    "Intel and HPE complete assembly of record-breaking Aurora supercomputer",
    "Intel & HPE Declare Aurora Supercomputer Blade Installation Complete",
    "Intel Aurora Supercomputer Ready To Break Records With Nearly 64K GPUs Across 10K Blades",
    "Awesome to see this!  It took a village!  Congratulations!!",
    "@BobRobertsonXI@hachyderm.io",
    "@LokiTheCat@toot.community",
    "DuckDuckGo Windows browser now available in public beta",
    "DuckDuckGo's privacy-focused browser is available for Windows now",
    "DuckDuckGo's Windows browser is now available in open beta",
    "DuckDuckGo's Privacy-Focused Web Browser Now Available for Windows",
    "DuckDuckGo browser for Windows available for everyone as public beta",
    "DuckDuckGo launches privacy-first Windows browser in beta",
    "DuckDuckGo launches privacy-focused Windows web browser",
    "You Can Try DuckDuckGo's Windows Browser Now",
    "DuckDuckGo Launches Privacy-Centric Browser for Windows",
    "Hands-On with DuckDuckGo Browser for Windows",
    "Protect your privacy with public beta of DuckDuckGo web browser for Windows",
    "DuckDuckGo Releases Beta Privacy Browser for Windows",
    "DuckDuckGo's Privacy Browser Enters Open Beta On Windows - Here's How To Try It Out",
    "DuckDuckGo browser comes to Windows with a ton of privacy and security features",
    "DuckDuckGo's Privacy Focused Web Browser Is Finally Available for Windows",
    "DuckDuckGo's privacy-focused web browser now available for Windows (in beta)",
    "DuckDuckGo Browser Beta Now Available to All Windows Users",
    "DuckDuckGo's Privacy-Enhanced Browser Waddles Into Windows, How It Compares To Chrome",
    "The DuckDuckGo Windows web browser has launched in open beta for more privacy while surfing",
    "DuckDuckGo's Windows browser is now available as a public beta release",
    "DuckDuckGo's privacy-focused browser is now available for Windows",
    "DuckDuckGo privacy-focused browser ships to Windows in open beta",
    "Hands-On with DuckDuckGo Browser for Windows https://www.thurrott.com/...",
    "DuckDuckGo browser beta for Windows bakes in a lot of privacy tools",
    "DuckDuckGo Browser Beta for Windows Bakes in a Lot of Privacy Tools",
    "DuckDuckGo offers its privacy-centered browser in a Windows open beta",
    "Prime Trust halts withdrawals and deposits as acquisition fails",
    "Nevada regulator says Prime Trust can't meet all client withdrawals",
    "Prime Trust Halting Deposit/Withdrawal",
    "TrueUSD reassures users of no exposure to Prime Trust amid regulatory challenges",
    "BitGo Cancels Prime Trust Acquisition, Users Report Frozen Withdrawals",
    "Prime Trust Suspends Withdrawals After BitGo Terminates Acquisition Deal",
    "Stably pauses withdrawals, minting after Prime Trust halts deposits",
    "In another blow to crypto, Stably halts withdrawals",
    "(Stably) Prime Trust Halting Deposit/Withdrawal (USDS, BTCS, ETHS)",
    "Captions Raises $25M in Series B Funding",
    "AI video creation app Captions bags $25M from top VCs",
    "Captions Announces A $25 Million Series B for Our AI-Powered Creative Studio",
    "Antitrust Threat to Figma-Adobe Deal Thwarts Hopes for VC Rebound",
    "Video editing app Captions raises $25 million to build on its 100,000 daily active users",
    "Investing in Captions  —  As an investor, one of the most rewarding aspects of my job …",
    "Prince Harry's Podcast Pitch: Interview Putin, Trump About Their Childhoods",
    "Sorry, Joe Rogan: Scientists should never ‘debate’ anti-vaccine quacks.  Here's why",
    "Spotify's podcast plan went off the rails",
    "Spotify's podcast plan is going off the rails",
    "‘Investor-friendly’ terms rankle startups' early backers",
    "Warming public markets are boosting the secondary market for startup shares",
    "https://twitter.com/... [image]",
    "Stability AI launches SDXL 0.9: A Leap Forward in AI Image Generation",
    "The next version of Stable Diffusion won't produce spaghetti hands",
    "Stable Diffusion aims to fix its problem with generating fingers",
    "Stability AI releases Stable Diffusion XL 0.9, a “leap forward” in AI image generation",
    "Stability AI Launches Stable Diffusion XL 0.9",
    "Twitter CEO starts fighting Musk's battles, paying Musk's overdue bills",
    "Elon continues to drag Twitter through the mud - and could face fines as a result",
    "New Twitter CEO Steps In to Repair Relationship with Google",
    "India confirms Micron's ATMP plant in Gujarat",
    "Micron plans its first India facility, will invest up to $825 million in the initiative",
    "Micron Unveils UFS 4.0 Mobile Storage Using 232-Layer NAND For Huge Bandwidth Gains",
    "Micron to invest $825 mn in Gujarat semiconductor facility",
    "Micron to invest $825m for building chip assembly plant in India",
    "Micron announces $2.75bn chip testing project amid PM Modi's US visit",
    "Micron to invest $2.7B to set up chip packaging unit in India",
    "Micron announces new India chip facility with investment up to nearly $2.8B",
    "India will pay for 70% of Micron's $2.75 billion packaging plant",
    "Micron to set up $2.75 billion India chip assembly facility",
    "PM Modi invites Micron to boost chip making in India: Key things to know",
    "Micron and Applied Materials to Invest in India as Chip Makers Diversify",
    "Micron to invest up to $825 mn in chip assembly plant in Gujarat",
    "PM Modi US visit: Micron to invest $800 million-plus for chip facility in India",
    "Biden and Modi Announce Defense, Chips Deals at White House",
    "Micron to set up a $2.75 billion semiconductor assembly, test facility in India: Check details",
    "Chipmakers Applied Materials, Micron To Invest Over $1.2 Bn In India",
    "Amazon invests $100M in new Generative AI Innovation Center to accelerate solution development",
    "Amazon's AWS Invests $100 Million in Generative AI Innovation Center",
    "Amazon “Sabataged” User Attempts to Cancel Prime, FTC Alleges",
    "What generative AI means for businesses and how AWS can help",
    "Amazon Is Spending $100 Million to Teach Cloud Customers About AI",
    "AWS pledges $100M to launch generative AI innovation center",
    "Amazon looks to boost generative AI projects with new $100M cloud initiative",
    "Google Takes Aim at Microsoft's Azure Cloud Practices",
    "AWS invests $100 million in new Generative AI Innovation Center",
    "AWS Launches New $100M Generative AI Innovation Center",
    "AWS invests $100 million to help customers succeed with generative AI",
    "AWS Investing $100M in Generative AI Center",
    "Russia tells Amazon Web Services to set up local representation or face restrictions",
    "AWS Invests $100 Million In Its Generative AI Innovation Center",
    "They will Spinoff AWS. Trust me. $AMZN https://twitter.com/...",
    "Monopolistic company Google accuses Microsoft of monopolistic behavior",
    "YouTube now requires users to declare if they are fan accounts",
    "Robinhood buys credit card fintech X1 for $95M",
    "Robinhood Acquiring Credit Card Startup X1",
    "No Cash? No Problem: Robinhood Prepares To Offer Credit To Its Users",
    "Tuma raises the largest round for a Congolese fintech startup",
    "Robinhood Eyes Banking Market With $95M Credit Card Acquisition",
    "Robinhood Announces $95 Million Acquisition of Credit Card Startup X1",
    "Robinhood agrees to acquire credit card startup X1",
    "TikTok's ‘Trendy Beat’ is its latest foray into shopping",
    "@jamesthomson@mastodon.social",
    "@JustMeDevin@mastodon.social",
    "@stroughtonsmith@mastodon .social",
    "@_Davidsmith@mastodon.social",
    "@dcseifert@mastodon.social",
    "Apple Vision Pro ‘Visual Search’ Feature Can Identify Items, Copy Printed Text, Translate and More",
    "Apple releases VisionOS SDK, developers can apply for Vision Pro hardware kit",
    "Developer tools to create spatial experiences for Apple Vision Pro now available",
    "Apple Releases visionOS SDK to Get Developers Amped for Vision Pro",
    "Apple Opens VisionOS Access for Devs to Start Making ‘Spatial’ Apps for Vision Pro Headset",
    "6 things we've learned about the Apple Vision Pro from the visionOS beta",
    "Apples Vision Pro features a Travel Mode designed for the airplane use",
    "visionOS SDK  —  Apple today announced the availability of new software tools and technologies …",
    "Oh, wow.  OK.  Apple really is making a $3.5K VR ski-mask.  Dev tools are now out for it",
    "Apple releases official design kit with visionOS resources for Figma",
    "Apple's Vision Pro features a ‘Travel Mode’ designed for airplane use",
    "Apple releases visionOS software development kit (SDK) for developers",
    "Here are the Vision Pro apps that Apple won't allow",
    "visionOS beta reveals new glimpses of Apple Vision Pro capabilities",
    "See the first third-party Vision Pro apps in action",
    "Apple Vision Pro Unveiled Exciting Opportunities for Developers",
    "Apple Vision Pro SDK out now with in-person developer labs coming next month",
    "Apple Unveils Vision Pro SDK and Developer Labs",
    "Apple Vision Pro will identify items, text, and more before your very eyes",
    "Apple Releases The First visionOS Beta To Developers",
    "Apple's Developer Tools For Vision Pro Reveal How Apple Is Thinking About AR, VR, Mixed Reality",
    "Apple releases visionOS SDK for crafting ‘all-new experiences’",
    "Apple Vision Pro Developer Lab Opens to test MR/VR glasses",
    "Apple's first visionOS beta outlines 13 VR ‘Environments,’ app limitations",
    "Apple releases visionOS SDK tools for devs",
    "Vision Pro developer guidelines give more clues as to what to expect",
    "Apple Vision Pro SDK now available for developers",
    "visionOS gives us a closer look at what we'll see with Apple Vision Pro [Gallery]",
    "Here Are All the ‘Environments’ You Can Experience in visionOS",
    "First Look at Early VisionOS Apps",
    "Apple Releases First Ever visionOS Beta",
    "Apple Vision Pro Developer Tools Now Available With New visionOS SDK",
    "@matthewbischoff@mastodon.social",
    "🥽 Start your (neural) engines...  https://www.apple.com/...",
    "Crouton running on visionOS!  🥳 now the UI just needs a lot of attention",
    "visionOS bringup so far: painful",
    "visionOS: No navigation apps, no photography apps 👀",
    "so  —  who's making a vision pro fart app",
    "The visionOS runtime for Xcode is still called xrOS 😄",
    "Spatial Audio transforms music, says Alicia Keys and Springsteen recording engineer",
    "Sonos Era 300 Review: Great, Room-Filling Sound in a Compact Speaker",
    "A great article about ⁦@Dolby Atmos music⁩ via ⁦@nytimes⁩ https://www.nytimes.com/...",
    "Can a Hollywood Operator Help TikTok? That Didn't Go So Well the First Time",
    "Amazon's $1.65 Billion iRobot Deal on Course for EU Probe",
    "EU reportedly set to investigate Amazon's $1.7B iRobot acquisition",
    "Amazon convinced the CMA but the EU is still unsure about the $1.7 billion iRobot deal",
    "Free compensation benchmarking data from 3,000 startups",
    "New education apps and accessible content for Chromebooks",
    "Building a digital-first future for every student",
    "K-12 students can now get Figma for free",
    "K-12 Students in the U.S. Now Have Free Access to Figma",
    "Schools to get Figma for free on Chromebooks",
    "Best-in-class creative tools for your Chromebooks",
    "Figma is now free for all K-12 districts",
    "Figma's Design Tools Are Now Free on Chromebooks For All US School Students",
    "Google announces $20 million investment for cyber clinics",
    "Support for cybersecurity clinics across the U.S.",
    "Musk vs. Zuckerberg: The Billionaire Bout for the Social-Media Age",
    "Elon Musk vs. Mark Zuckerberg in MMA? Rival tech billionaires say they're serious in ‘cage’ fight",
    "Mark Zuckerberg and Elon Musk Want to Fight Each Other Apparently",
    "Elon Musk and Mark Zuckerberg agree to cage fight: ‘Send me location’",
    "Europe takes its fight against Big Tech to CEOs' turf: San Francisco",
    "Mark Zuckerberg Accepts Elon Musk's Offer To Fight In A Cage",
    "How the Musk v. Zuckerberg cage fight could save the world",
    "Personalized wealth management, built for tech people",
    "Data-driven customer experience on a unified platform",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/22 - So, Elon And Zuck Are Gonna Fight, I Guess",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Limble Raises $58M in Series B Funding",
    "Goldman Sachs leads $58M funding of computerized maintenance management provider Limble",
    "Limble CMMS raises $58 million",
    "MrMobile [Michael Fisher] on YouTube",
    "Motorola Razr+ - where to get the best deal, including 80% off",
    "Motorola RAZR+ Review: The Flip Phone You Don't Need To Open",
    "Review: Motorola's Razr Plus Made Me a Flip Phone Believer",
    "Motorola Razr+ Review: Flipping the Script on Cover Displays",
    "Motorola Razr Plus Review: Judge This Foldable Phone By Its Cover",
    "Motorola Razr+ Review: Razr is back, baby",
    "Motorola Razr+ Review: The flip phone king reborn",
    "Motorola Razr Plus review: the folding phone I've been waiting for",
    "Motorola Razr+ review: My new favorite foldable",
    "Intel Digs Deep Inside to Make Foundry Push Work",
    "Intel to Spin Off its Manufacturing Groups Into a Separate Business",
    "Intel's forcing its chip designers to pay market rates not mate's rates at its own fabs",
    "A good look at Intel's foundry & manufacturing event yesterday.",
    "[SemiAnalysis] Rebuilding Intel - Foundry vs IDM Decades of Inefficiencies Unraveled",
    "Sky Launches Sky Live: An Innovative And Super-Cool TV Accessory",
    "Sky Live preview: The motion-tracking webcam that could change the way you use your TV",
    "Introducing Sky Live, the new interactive camera from Sky",
    "Sky launches TV smart camera for joint viewing and motion-controlled games",
    "Sky Live explained: features, apps, price and hands-on review of the new Sky Glass camera",
    "Sky UK releases a motion-tracking webcam for TV watch parties",
    "Congress Spotlights ‘Serious’ Forced Labor Concerns With Chinese Shopping Sites",
    "Shein Eyes Overseas Expansion to Shift Supply Chain Beyond China",
    "Shein Expands Global Presence and Diversifies Supply Chain With Locally-Sourced Products",
    "Why Intel was the Dow's worst performer for a second day in a row",
    "Venezuela's Cryptocurrency Mining Ban Damages Industry Maduro Once Supported",
    "Budapest and Warsaw have over 1% share in Europe's 2.6 million tech talent pool — Sequoia Atlas",
    "Insights: What's Driving European Tech Talent",
    "From Bucharest to Vilnius: Sequoia Atlas Identifies Europe's Rising Stars in Engineering Talent",
    "Where to find Europe's best AI engineers",
    "Compensation: The Great Levelling",
    "@TechDesk@flipboard.social",
    "Incredible story about the power of mapping in Borneo https://restofworld.org/...",
    "Ripple Obtains In-Principle Regulatory Approval in Singapore",
    "Ripple Obtains In-Principle Approval for Major Payments Institution License in Singapore",
    "Ripple's Singapore Payment License: Will XRP Be Included in ODL Transactions?",
    "Ripple Breaks New Ground With Regulatory Approval in Singapore",
    "Ripple receives in-principle regulatory approval in Singapore",
    "We're talking about the central bank of Singapore, folks! This is huge! https://twitter.com/...",
    "The Official Microsoft Blog",
    "Microsoft Azure Quantum Blog",
    "Microsoft Says It Will Build a Quantum Supercomputer Within Ten Years",
    "Accelerating scientific discovery with Azure Quantum",
    "IonQ Forte Launched For Commercial Use, Making #AQ 29 Available for Customers Worldwide",
    "InAs-Al hybrid devices passing the topological gap protocol",
    "Microsoft milestone brings it a bit closer to quantum supercomputer",
    "Microsoft quantum supercomputer goals one step closer after R&D breakthroughs",
    "Microsoft quantum supercomputer could be a reality within 10 years",
    "IonQ moves ahead with Forte quantum computers and its facility in Seattle area",
    "Microsoft wants to build a quantum supercomputer in the next 10 years",
    "Microsoft sets out path to quantum supercomputing with Quantum Elements",
    "Microsoft says its weird new particle could improve quantum computers",
    "Microsoft achieves first milestone towards a quantum supercomputer",
    "Microsoft reaches a key milestone in its quest to build a quantum supercomputer",
    "Microsoft reveals its roadmap towards creating a true quantum supercomputer",
    "Microsoft announces advances in Azure Quantum to accelerate scientific discovery",
    "Microsoft offers update on its roadmap to a quantum supercomputer",
    "Microsoft looks to speed up materials science research with quantum-compatible system",
    "Microsoft Says Its Weird New Particle Could Improve Quantum Computers",
    "Australian Financial Review",
    "@batterpunts@mastodon.social",
    "@DigitalJacobin@mastodon …",
    "@thedextriarchy@mastodon …",
    "@jacklaridian@mastodon.social",
    "@gallaugher@mastodon.world",
    "Elon Musk and Mark Zuckerberg agree to hold cage fight",
    "Why Elon Musk and Mark Zuckerberg say they're ready for a ‘cage match’",
    "Mark Zuckerberg and Elon Musk say they're up for a cage match. Who would win?",
    "Musk Proposes ‘Cage Match’ With Zuckerberg",
    "‘Send Me Location:’ Mark Zuckerberg Says He's Down to Fight Elon Musk in a Cage Match",
    "Why Mark Zuckerberg Can't Quit Twitter",
    "Elon Musk and Mark Zuckerberg say they're ready for a cage fight",
    "Andrew Tate offers to train Elon Musk for cage fight against Mark Zuckerberg",
    "Mark Zuckerberg Accepts Elon Musk's Cage Match Challenge: ‘Send Me Location’",
    "Dana White Talking to Elon Musk and Mark Zuckerberg About UFC Fight",
    "Mark Zuckerberg responds to Elon Musk cage match suggestion: ‘Send Me Location’",
    "Would you pay to see Musk fight Zuckerberg in a cage match? It could be on!",
    "Meta CEO Mark Zuckerberg agrees to fight Elon Musk in a cage fight. Here's what he said..",
    "Dana White says Elon Musk and Mark Zuckerberg are ‘dead serious’ about fighting in the Octagon",
    "Mark Zuckerberg Seemingly Agrees to Fight Elon Musk in Cage Match",
    "Dana White insists Musk vs. Zuckerberg is real: ‘Biggest fight ever!’",
    "Dana White Says Musk And Zuckerberg Are Serious About A UFC Fight",
    "Mark Zuckerberg, Elon Musk ‘Agree’ To Cage Fight",
    "Billionaire cage fight: Elon Musk and Mark Zuckerberg arrange combat",
    "Elon Musk, Mark Zuckerberg agree to a ‘cage match.’ How did we get here?",
    "Mark Zuckerberg agrees to fight Elon Musk in a cage match",
    "Elon Musk vs. Mark Zuckerberg in a cage? Zuck really wants to do it.",
    "Dana White says Elon Musk and Mark Zuckerberg are ‘dead serious’ about fighting in UFC match",
    "Here's what we know about Meta's planned Twitter competitor that has Elon Musk upset",
    "Elon Musk Challenges Mark Zuckerberg to ‘Cage Match’ in Tweet",
    "Musk vs Zuck: Twitter and Facebook bosses agree to a... cage fight",
    "Elon Musk says he is up for a fight in a “cage match” with Facebook CEO Mark Zuckerberg",
    "Musk, Zuckerberg Agree to Cage Fight",
    "Elon Musk Challenges Mark Zuckerberg To A ‘Cage Fight’ & The Meta CEO Is Ready For It",
    "Elon Musk And Mark Zuckerberg Vow To Fight In Cage Match (Seriously)",
    "Mark Zuckerberg Responds to Elon Musk's Cage Match Challenge: ‘Send Me Location’",
    "Mark Zuckerberg Reacts To Elon Musk's Challenge For MMA Fight, Takes Line From UFC Legend",
    "Mark Zuckerberg vs. Elon Musk cage fight betting odds",
    "I am literally begging for this to come true, please we deserve this https://www.theverge.com/...",
    "UFC will never be the same",
    "Where can I gamble on this",
    "please god make this happen https://www.theverge.com/...",
    "@chris@mastodon.chriswiegman.com",
    "I have never ever rooted for a cage to win so much in all my life https://www.thejournal.ie/...",
    "@DigitalJacobin@mastodon.social",
    "@thedextriarchy@mastodon.social",
    "How about putting them in a cage and just leaving them there?  😅  —  https://www.theverge.com/...",
    "@kwmarkoff26656 @MarioNawfal I'm up for a cage match if he is lol",
    "Elon, it is real. So this is happening???",
    "@imPenny2x If this is for real, I will do it 🔥🔥",
    "choose your fighter [image]",
    "zuck has fully rehabilitated his image",
    "Winner gets to choose how long we stop AI progress for [image]",
    "This is Zuck's story on insta right now. Simulation confirmed ✅ 😅😅😅 [image]",
    "There you have it, folks https://twitter.com/...",
    "I can't believe zuck found the only scenario in which we're ever going to root for him",
    "our engineers really predicted Elon Musk vs. Mark Zuckerberg... https://twitter.com/... [image]",
    "The tech industry has reached its obvious logical conclusion [image]",
    "hey siri, what is the scope of specific performance under Delaware law https://twitter.com/...",
    "What happened to a normal boardroom meeting? Would you watch this? https://www.theverge.com/...",
    "Real question is if this is going to be streamed on Facebook or Twitter https://twitter.com/...",
    "we're in a simulation https://twitter.com/...",
    "@vizurantvis @alexeheath Yup, that's me 💯",
    "Zuck asking for Elon's coordinates If they throw hands Zuck is putting Elon in the dirt [image]",
    "Money power gives way to trial by combat Cyclical history confirmed https://twitter.com/...",
    "Everything is getting dumber at a pace previously believed impossible. https://twitter.com/...",
    "we need more of this energy https://twitter.com/...",
    "Only if I get to be on the undercard since this was my idea first! https://twitter.com/... [image]",
    "$8 for this website is a bargain 🤣 https://twitter.com/... [image]",
    "Mark Zuckerberg is ready to fight Elon Musk in a cage match",
    "Elon Musk & Mark Zuckerburg agree to fight in cage match",
    "Mark Zuckerberg is ready to fight Elon Musk in a cage match and Musk has accepted",
    "Apple fixes 0-day kernel and WebKit security flaws in iOS, macOS, watchOS, and more",
    "Apple fixes iPhone software flaws used in widespread hacks of Russians",
    "About the security content of iOS 15.7.7 and iPadOS 15.7.7",
    "Dissecting TriangleDB, a Triangulation spyware implant",
    "Apple releases patch for iMessage bug",
    "iOS 16.5.1 and macOS 13.4.1 Address Actively Exploited Vulnerabilities, Make Sure to Update",
    "Apple issues fix for ‘Triangulation’ spyware vulnerability",
    "Apple addresses two zero-days exploited in Operation Triangulation spyware campaign",
    "Zero-Day Alert: Apple Releases Patches for Actively Exploited Flaws in iOS, macOS, and Safari",
    "Apple Fixes Multiple 4-Year-Old Zero-Days",
    "Apple Addresses Exploited Security Flaws in iOS, macOS and Safari",
    "Apple issues fix for zero-day flaws used in spy attacks against Kaspersky. Patch now!",
    "Apple fixes zero-day security flaws in iOS, macOS, watchOS, and more",
    "Apple addressed actively exploited zero-day flaws in iOS, macOS, and Safari",
    "Apple issues emergency patch to address alleged spyware vulnerability",
    "Apple squashes kernel bug used by TriangleDB spyware",
    "Apple Patches iOS Flaws Used in Kaspersky ‘Operation Triangulation’",
    "iOS 16.5.1 is released with important security updates and a Camera Adapter fix",
    "New Report Exposes Operation Triangulation's Spyware Implant Targeting iOS Devices",
    "New updates for iPhone, Mac and Apple Watch squash bugs",
    "Download: Apple Releases macOS Ventura 13.4.1 and watchOS 9.5.2 With Important Security Updates",
    "Kaspersky Dissects Spyware Used in iOS Zero-Click Attacks",
    "@FirewallDragons@mastodon.social",
    "Important Apple updates, install soon.  —  https://www.macrumors.com/...",
    "@BleepingComputer@infosec.exchange",
    "Rocking horse shit and hen's teeth rarity value here I reckon... https://twitter.com/...",
    "@lorenzofb has there been evidence that this is related to the Kaspersky claims?",
    "“The developers refer to string decryption as ‘unmunging’” https://twitter.com/...",
    "More details about the iOS spyware targeting employees at @kaspersky. https://twitter.com/...",
    "...so there is (very likely) a macOS version too 👀 https://twitter.com/... [image]",
    "Apple fixes zero-days used to deploy Triangulation spyware via iMessage",
    "iOS 16.5.1, macOS 13.4.1, and a slew of updates fix “actively exploited” security bugs"
]