[
    "@lordbusinessman.bsky.social",
    "@themountaingoats.bsky.social",
    "@brandonleblanc.bsky.social",
    "Musk's X Corp. threatens to sue Meta over Twitter “copycat” Threads",
    "Google wants a robots.txt equivalent for AI training",
    "Twitter threatens to sue Meta over its new Threads app",
    "‘Competition is fine, cheating is not’: Elon Musk after Threads launch",
    "Twitter threatens to sue Facebook's owner Meta over its new Threads platform",
    "Meta delivered ‘a major blow’ to Twitter. Will it flip the flailing firm's fortunes?",
    "Twitter threatens to sue Meta over the new Threads app",
    "Twitter Hits Meta With Lawsuit Threat Over Stolen ‘Trade Secrets’",
    "Twitter Threatens to Sue Meta Over Alleged Trade Secret Theft With Threads",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "Twitter Accuses Meta of Poaching Employees to Build Threads",
    "Silicon Valley Business Journal",
    "Twitter threatens legal action against Meta over Threads",
    "Meta responds to Twitter's threat to sue after Threads launch",
    "Twitter threatens Meta with lawsuit over rival Threads app",
    "Musk vs. Zuckerberg Threads throwdown: Twitter threatening to sue over Twitter ‘killer’",
    "Twitter Reportedly Threatens to Sue Meta Over Threads",
    "Twitter warns it could sue Meta over ‘copycat’ Threads app",
    "Twitter threatens legal action over Threads, calling Meta's new app a ‘copycat’",
    "Threads hasn't been alive for a day, and Twitter is already threatening to sue",
    "Threads Becomes Most Rapidly Downloaded App, Raising Twitter's Ire",
    "Twitter is threatening to sue Meta over Threads: Semafor report",
    "Twitter spooked by Threads, threatens to sue Meta for hiring employees after Musk fired everyone",
    "Elon Musk's Twitter ‘threatens to sue Meta’ over Mark Zuckerberg's new Threads app, insiders claim",
    "Can Instagram's Threads Really Take on Twitter?",
    "The Zuckerberg-Musk rivalry continues with the launch of Meta's ‘Twitter killer’ app",
    "Twitter has reportedly threatened to sue Meta over Threads",
    "Twitter sends Mark Zuckerberg a cease-and-desist over Threads",
    "Twitter Threatens to Sue Meta's ‘Copycat’ Threads App",
    "Twitter claims it may file a lawsuit against Meta over the launch of the “copycat” Threads",
    "What we know about Threads, Meta's ‘Twitter killer’",
    "Meta's pull with Threads may be Twitter's unraveling",
    "Elon Musk threatens to sue Mark Zuckerberg over Threads",
    "Elon threatens to sue Mark Zuckerberg over the Threads app - here's the letter from Elon's lawyer",
    "Threads and Twitter drama escalates to a potential lawsuit from Twitter",
    "Twitter Threatens To Sue Meta Over Its Threads Competitor",
    "Twitter's Not Playing Games, Accuses Meta of Developing a “Copycat” App",
    "Everyone Is On Threads, Including Financial Advisors. Are You?",
    "Just In: Twitter Reportedly Planning to Sue Newly Launched Threads",
    "Twitter Threatening to Sue Meta Over New Threads App",
    "Twitter sends letter threatening to sue Meta over new rival Threads app",
    "What is Threads on Instagram? All about Mark Zuckerberg's Twitter alternative",
    "Threads stole Elon Musk's idea, a social media platform that sucks",
    "The Elon-Zuck cage match stakes just went up.  [embedded post]",
    "Is “everyone using our platform sucks” really a “trade secret,” though? [embedded post]",
    "Trade secrets such as “what if there was an app where you could post text” [embedded post]",
    "I'm not a patent lawyer but I don't think Twitter invented the internet forum.  [embedded post]",
    "Your honor, they owned me.  It's against the law for me to get owned [embedded post]",
    "When all else fails, sue.  [embedded post]",
    "@AbandonedAmerica@mastodon.social",
    "@TitterDaily Competition is fine, cheating is not",
    "Elon vs. Zuck - Round 1 🥊 [image]",
    "how it started, etc [image]",
    "@RMac18 did the ceo of twitter not get cc'd on the letter. sad.",
    "Maybe Clubhouse should sue over Spaces",
    "How it started: How it is going: [image]",
    "when you're mad that all the employees you fired got new jobs https://twitter.com/...",
    "🤡 https://www.semafor.com/...",
    "BWA HA HA!! Surprised he didn't use the Winklevoss twins law firm. https://www.semafor.com/...",
    "CAGE FIGHT https://twitter.com/...",
    "Life comes at you fast. https://twitter.com/...",
    "Threads is *definitely* an existential threat for Twitter. https://twitter.com/...",
    "lmao, pay ur twitter vendor bills first elon https://twitter.com/...",
    "Twitter has famously never copied any other company. https://twitter.com/...",
    "@Techmeme @maxwelltani Can you poach employees if they were all let go? 🤔",
    "Twitter is threatening to sue Meta over Threads |  Semafor",
    "Twitter threatens to sue Meta over Threads app - report",
    "Musk and Zuck may fight in court: Twitter threatens to sue Meta over Threads",
    "@rwaddilove@techhub.social",
    "Threads Supplemental Privacy Policy",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "Threads attracts 30M users in 24 hours despite design flaws, privacy concerns",
    "Threads Does Not Have a Delete Option (Yet), But You Can ‘Deactivate’ a Profile",
    "Threads profiles can't be deleted without removing your entire Instagram account",
    "Threads already has over 30 million users. But I'm not one of them",
    "Threads called a ‘trap,’ must delete Instagram to leave new Meta app",
    "4 Reasons You Shouldn't Sign Up For The New Threads App Just Yet",
    "Deleting your Threads profile will also kill your Instagram account",
    "Threads' Instagram ‘Trap’ Shows Why Facebook Should Have Been Broken Up Years Ago",
    "The 10 big ways that Threads is totally different from Twitter",
    "Twitter competitor Threads won't let you delete your account unless you also delete Instagram",
    "Meta: You can't delete your Threads profile without deleting Instagram",
    "How to deactivate your Threads account",
    "Instagram flooded Threads with celebrities and brands at launch",
    "Want to delete your Threads account? Say goodbye to your Instagram too",
    "To delete your Threads account, you have to forfeit Instagram",
    "5 things to know about Threads, Twitter's newest rival",
    "Threads vs. Twitter: 5 Ways Instagram's New App Comes Up Short (for Now)",
    "PSA: You can not delete Threads profile without deleting Instagram account",
    "Threads already has 30 million users",
    "Data Capture in the New Social Media Age",
    "Meta says Instagram users will lose their account if they delete Threads",
    "Threads feed of people you follow ‘on the list’; can't delete your profile; more",
    "@Techmeme This is similar to Google, Microsoft and others.  One account for multiple services.",
    "I'm muting this but here's a screenshot [image]",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "https://techcrunch.com/... *laughs maniacally*",
    "Guess I'm stuck with this app...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads profile can only be deleted by deleting Instagram account, Meta says",
    "Threads: Thirty million join Meta's Twitter rival, Zuckerberg says",
    "Instagram's Threads bursts out of the gate with more than 30 million sign-ups",
    "Threads app: Instagram owner's Twitter rival logs 5 million users in first hours",
    "More than 30 million people signed up for Meta's new Threads app",
    "Meta's Threads passed 20 million users within 12 hours, and it's not slowing down",
    "What is Threads and what impact will it have on Twitter?",
    "Ten million join Meta's new app Threads - Zuckerberg",
    "From Zero to 10 Million in 7 Hours: Threads App Takes the World by Storm",
    "Meta Launches Threads, Betting Instagram Mojo Can Take on Twitter With New App",
    "Threads now has 30 million users, but Mark Zuckerberg admits “we've got a lot of work ahead”",
    "Twitter Is So Heated Over Threads That They're Threatening Legal Action",
    "It's Not Just Threads—Mark Zuckerberg Has a Long History of Copycat Apps and Features",
    "With Threads signups surging past 30M, Zuckerberg notches a win",
    "Threads app: 5 important questions about new Twitter rival answered",
    "Meta launches Twitter rival Threads; gaining 30 million users in just one day",
    "Millions Join Meta Threads On Its First Day, Is Twitter Doomed?",
    "Meta's New Threads App is Censoring From Day One",
    "Twitter rival Threads already has 30 million users, Zuckerberg says",
    "Mark Zuckerberg gloats over Threads' 10 million signups",
    "Meta Up 1.86% Premarket as Threads Gathers 10M Users in 7 Hours",
    "Threads, Meta's answer to Twitter, surpasses 10 Million users in just seven hours",
    "10 million users joined Meta's Threads in just 7 hours. It took Twitter 780 days to do that",
    "Instagram's Twitter Copycat Threads Meets Pent-Up Demand",
    "Millions flock to Instagram Threads, Elon Musk laughs at it",
    "10 million join Threads in under 10 hours, boosted by Instagram integration",
    "Zuckerberg's Twitter rival Threads reaches 10M users in 7 hours",
    "Zuck's so openly insanely competitive [image]",
    "Threads at 30M users is legit insane Regardless of who you want to “win” That's nuts",
    "Welp, @FabrizioRomano is on Threads. It's for real [image]",
    "And here I was just a few hours ago putting rocket ship emojis on the 5 million post ...",
    "Arriving on Threads like...",
    "🟡 SCOOP: Twitter is threatening to sue Meta over Threads, @maxwelltani reports.  Read the letter:",
    "we haven't even launched the cool stuff yet!",
    "Threads: Ten million join Meta's Twitter rival, Zuckerberg says",
    "What we love and hate about Threads, Meta's new Twitter clone",
    "Introducing Threads: A New Way to Share With Text",
    "Threads app hits Top 5 on Apple's China App Store despite ban",
    "Threads debuts in top 5 spot on App Store in China before inevitable ejection",
    "Threads, Meta's Twitter competitor, is now live",
    "How to download and get started with Meta's Threads app",
    "Zuckerberg uses Threads to say Twitter has missed its chance",
    "To Delete a Threads Account, You'll Need to Nuke Your Instagram Account Too",
    "Adam Mosseri says Meta's Threads app won't have ActivityPub support at launch",
    "Threads already has over 95 million posts",
    "Meta's Threads swiftly signs up 30m users",
    "Twitter accuses Meta of stealing trade secrets for its new Threads app",
    "How To Download Threads By Instagram, Meta's New Twitter-Killer",
    "Is Your Phone Buzzing Constantly With Threads App Alerts?  Here's How To Fix It",
    "Buckle up, Reddit: Closed APIs cost more than you'd expect",
    "How to sign up for Threads account from Meta",
    "Is Meta's Threads App A ‘Twitter Killer’? Social Media Users Debate New Service",
    "Meta's New Threads App Reaches 30 Million Users in Less Than a Day",
    "Why Twitter Rival Threads Isn't Available in the E.U.",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "Meta has launched Twitter rival Threads, snagged 10M signups in hours",
    "5 Things to Know Before the Stock Market Opens Thursday",
    "Head of Instagram says placing ads within Threads is “not a priority right now”",
    "Instagram's Twitter competitor, Threads, is available now",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "“We wanted flying cars, instead we got 7 Twitter clones.” https://twitter.com/...",
    "Must confess to a deep love of fashion & architecture",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "Meta's new app was built entirely using this keyboard: [image]",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "This is getting ridiculous [image]",
    "This and how you have to give it access to your contacts means NFW. https://twitter.com/...",
    "Users in EU can view threads on Threads, but can't sign up. https://www.threads.net/...",
    "Threads is exciting because it's just your classic underdog story",
    "Gosh. Yuk. Hmmmm. Really, Threads? [image]",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "It turns out, building an Instagram account is now 100x more valuable",
    "Mark Zuckerberg's first tweet in 11 years and he's trolling Twitter 🙃 https://twitter.com/...",
    "this is how you return from an 11-year twitter hiatus. https://twitter.com/...",
    "Sad to inform the social media interns at brands are at it already [image]",
    "Seeing former Twitter employees use Threads is chefs kiss.",
    "threads feels like for designers, by designers so far https://www.threads.net/...",
    "the priority is the mobile apps, but we are working on www",
    "I'm excited to jump into @threadsapp",
    "Zuck you need to be actively shitposting on here to make that happen.  LFG!",
    "what if @zuck decides to make an electric car next lol",
    "Bosses joining Threads like:",
    "Excited about my buddy @zuck 's new venture.  Threads...happy to be here.",
    "Not my style personally, but I'm sure there will be plenty of entertaining content here...",
    "Not followers 10k FRIENDS 🥹",
    "Credit where it's due, they pioneered the format and have done great work",
    "It's so over, we're so back",
    "You can start with @rourkery and @briansw but theres more folks ❤️",
    "Congrats on the launch @zuck!  Needed this space.",
    "Elon Musk excited that the load on Twitter's servers is going down until he realizes why.",
    "Hope your shoulder is healing.  Can't wait for your next fight!",
    "There are so many great little design touches in threads.  Really great.",
    "Ugh I'm ALWAYS a very early adopter and 2303439 feels way late 🥺🥺",
    "We are definitely focusing on kindness and making this a friendly place.",
    "Zuckerberg-Musk fight is on: Meta launches ‘Twitter Killer’ Threads app",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Instagram boss reveals list of “missing” features coming to Threads",
    "How to use Threads, Instagram's new rival to Twitter",
    "Meta Launches Threads, And It's Important For Reasons That Most People Won't Care About",
    "Threads' early hours marked by internet nostalgia as users feel out Twitter rival",
    "Meta's New Twitter Competitor, Threads, Boasts Tens of Millions of Sign-Ups",
    "Spill Is a New Black-Owned Twitter Alternative. Here's What to Know About the App",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "Meta's New Twitter Alternative: 5 Things To Know About Threads Before You Sign Up",
    "Is Threads really a ‘Twitter killer’? Here's what we know so far",
    "What is Threads? All your questions about Meta's new Twitter rival, answered",
    "Meta's New Threads App Is Terrible. It Just Might Bury Twitter.",
    "Instagram Will Now Let You Add Up to Three Collaborators on Posts and Reels",
    "Instagram head says a Threads ‘Following’ feed is ‘on the list’ of upcoming features",
    "On threads with the burner. Come find me",
    "IG famous people posting on threads like “morning coffee ❤️” I can't do this??????????",
    "threads is like twitter for people whose criterion channel is netflix",
    "lol Zuck just can't help himself [image]",
    "threads quite quickly giving linkedin energy [video]",
    "first post i seen on threads. already wanna kms [image]",
    "threads feels corporate. all the brands came in with tons of followers",
    "If you needed a reason to join threads, this is it [image]",
    "@georgebsocial @TimSweeneyEpic yea, I agree. I don't like typing / sharing things on a mobile app",
    "lol threads currently using the “you have no control over what you see model” [image]",
    "A well executed animation like this pull to refresh in Threads just feels sooooo good. 😚 [video]",
    "With great power comes great responsibility.",
    "Lots of work on basic capabilities this morning.",
    "Excellent threads, @lewishamilton.",
    "please help make this the first viral threads tweet",
    "Hi guys!  I'm on time for once",
    "good morning to everyone except for da bomb",
    "Wait so Rabois, Marc and everyone else are going to have to re-block me 😂😂😂",
    "Zuck is salivating as he waits to drop the ads on all his new Threads users 🤣",
    "Like this if @zuck should make me CEO",
    "That @ logo animation when you pull down to refresh js pretty nifty.  👏👏👏",
    "Sorry I'm late, I was threading",
    "Okay this app is pretty cool but WHY IS THE TEXT SO SMALL",
    "How do you work this fuckin thing",
    "More engagement from 3k followers on here than 5m on Twitter.  Hmmmm",
    "Oh look.  The drama of Twitter is already here.  Hahahah.",
    "Someone check on the bird app 😈",
    "me opening any other app right now...",
    "Great job with this app @zuck !  Love how well it works and how simple it is.",
    "The most surprising thing about the Threads launch to me is still that you can pre-order an app.",
    "I know it's called threads but can we please leave the spool emoji on twitter 🧵",
    "I feel like I'm cheating on twitter 😅",
    "Not knowing what app you're on:",
    "Our boss: What's your social strategy for Threads?  Us:",
    "Can't get enough of your threads 🎶",
    "Need a ‘Following’ page ASAP",
    "Me trying to navigate my Threads feed of people I don't follow on Instagram.",
    "Don't Join Threads—Make Threads Join You",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "Meta on the Fediverse: Thread or Opportunity",
    "What the Heck Is the Fediverse?  —  Earlier this week, Meta launched Threads …",
    "What to know about Threads, Meta's Twitter rival app",
    "Meta Says Threads Will Be Part Of The Fediverse: Here's What That Means",
    "Standard protocol: In a post-Twitter world, Mastodon and Bluesky need to get on the same page",
    "honestly shocking to see how hard some people are shilling for meta after the launch of threads",
    "Hey @mosseri, quick question.  What button do I press so I only see the people I follow?",
    "Zuck doing this to Elon during Cancer season is top shelf petty.",
    "Mastodon CEO: What to know about Threads",
    "Just call them tweets … July 6, 2023 … Instagram Threads launched last night …",
    "What is Threads? What to know about Twitter's rival",
    "July 6: Meta's New Threads App Is Annoying To Use, But It's Still a Nightmare for Elon Musk",
    "Meta launches Twitter rival Threads but faces delays in Europe over privacy concerns",
    "Threads vs. Twitter: 9 biggest differences you need to know",
    "30M People Joined Threads Overnight. Will Advisors Get on Board?",
    "How to get verified on Instagram Threads",
    "Threads, Meta's Twitter rival, is tracking you in all sorts of ways",
    "Threads vs. Twitter: What's the Difference?",
    "Meta's Threads is a true threat to Musk-owned Twitter, analysts say",
    "Threads Had Big Launch Energy. Twitter Is Under Pressure",
    "in case there's anyone still here, here's what it's like over there https://www.ft.com/...",
    "Which one cooler?  🧵🪡 A. Threader B. Threadist C. Threadhead D. Threadmate",
    "is this a place where we capitalize words y/n",
    "The pitch meeting for Threads: “It's Twitter but swap nazis for brands.”",
    "If threads is all about discussion, let's jump right in... Pizza Vs Pasta?  😎",
    "I'm a mofuckin thread head bitch",
    "lol remember when we all hated meta / facebook and now we're back at it with the new shiny toy",
    "Users Join Threads in Droves",
    "Special Episode: Meta's Twitter Rival Arrives, with Adam Mosseri",
    "Threads Privacy Policy Is Already Drawing Criticism",
    "New Twitter CEO takes swipe at new Meta rival Threads",
    "Interoperability Will Be Key To Meta's Threads Success",
    "Threads, Meta's Twitter competitor, is not yet available in the EU due to regulatory concerns",
    "Instagram unveils Threads app, a threat to Musk's Twitter",
    "Privacy Woes Hold Up Global Instagram Threads Launch",
    "Threads and Bluesky. [video]",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Taylor Swift reportedly signed $100M deal with FTX but SBF pulled the plug",
    "Bad Blood? FTX Called It Off With Taylor Swift, Not the Other Way Around: Reports",
    "Small Banks Don't Like High Rates",
    "Crypto Exchange FTX Breaks Taylor Swift's Heart And $100 Million Partnership",
    "Taylor Swift Approved Sponsorship Deal With FTX, Despite Previous Reports: NYT",
    "Sam Bankman-Fried backed out of FTX sponsorship deal with Taylor Swift: Report",
    "Taylor Swift's $100M FTX Deal Dashed by Sam Bankman-Fried, Leaving Her ‘Frustrated’",
    "turns out taylor swift wasn't as savvy as we all thought huh [image]",
    "Nobody can say no to Sam money https://twitter.com/...",
    "A Too Good To Check classic. [image]",
    "Great story on Tom Brady & FTX https://www.nytimes.com/...",
    "Celebrity Crypto Shilling Is a Moral Disaster https://www.nytimes.com/...",
    "Yes...a tiger and a lion. Right. https://www.nytimes.com/... [image]",
    "TAYLOR SWIFT AGREED TO FTX PARTNERSHIP, DESPITE CONTRARY PUBLIC CLAIMS -CNBC CITING SOURCE",
    "Is there tape of this https://twitter.com/... [image]",
    "Cryptocurrencies went from the future of finance to the future of celebrity lawsuits",
    "NYT: “In reality, Ms. Swift's side signed the sponsorship agreement with FTX”",
    "How Tom Brady's Crypto Ambitions Collided With Reality",
    "Former FTX Lawyer Sued for ‘Wide-Ranging Con Game’",
    "GPT-4 API general availability and deprecation of older models in the Completions API",
    "OpenAI launches its GPT-4 API into general availability",
    "OpenAI makes GPT-4 generally available to all paid API customers",
    "GPT-4 cheat sheet: What is GPT-4, and what is it capable of?",
    "GPT-4 API now available to all",
    "OpenAI Makes GPT-4 Generally Available",
    "Binance Crisis Manager, US Employees Leaving Crypto Exchange",
    "“what justice department investigation?” https://fortune.com/...",
    "hahah NOW Patrick quits? https://twitter.com/...",
    "14) How did Binance fall apart ? Slowly and then all at once. https://twitter.com/...",
    "Rats, ship https://twitter.com/...",
    "Heading 4 the door https://twitter.com/...",
    "DigitalOcean Acquires Paperspace to Expand AI Offerings",
    "DigitalOcean acquires AI-focused GPU cloud operator Paperspace for $111M",
    "DigitalOcean Buys Paperspace To Boost AI Capabilities",
    "DigitalOcean Buys Paperspace for $111m to Add AI Offerings",
    "Paperspace Joins DigitalOcean",
    "DigitalOcean ramps up AI offerings via Paperspace deal for $111M",
    "DigitalOcean acquires Paperspace (YC W15) for $111M in cash",
    "DigitalOcean Acquires Cloud Computing Startup Paperspace For $111M",
    "Google's first truly custom chip for Pixel devices won't arrive until 2025",
    "Report: Google's first fully custom Pixel chip, Tensor G5, coming 2025 from TSMC",
    "Google might not go full-custom with its Tensor chips until 2025",
    "Google delays release of fully custom phone chip until 2025 - The Information",
    "Report: First Fully Custom Google Tensor Chip Not Until 2025",
    "Google reportedly delays release of fully custom phone chip until 2025",
    "US Spies Are Buying Americans' Private Data.  Congress Has a New Chance to Stop It",
    "Mergers: Commission opens in-depth investigation into the proposed acquisition of iRobot by Amazon",
    "Amazon's iRobot Roomba acquisition under formal EU investigation",
    "EU Launches “In-Depth” Investigation of Amazon's iRobot Acquisition",
    "Amazon's $1.65 Billion Bid to Buy iRobot Gets In-Depth EU Probe",
    "EU regulators open antitrust probe into Amazon's $1.7 billion iRobot deal",
    "Mastercard leverages its AI capabilities to fight  real-time payment scams",
    "Mastercard launches new AI real-time anti-fraud tool in UK",
    "MasterCard empowers UK banks to combat payment fraud with AI-powered solution",
    "Mastercard AI-powered tool to help banks fight fraud",
    "Free Figma template of onboarding & activation designs",
    "VC finds its footing as headwinds weaken",
    "So hard to believe it's just -50% [embedded post]",
    "Telexistence Raises USD 170M (JPY 23Bn) Series B",
    "Telexistence Raises $170M in Series B Funding",
    "Retail robotics startup Telexistence raises $170M",
    "SoftBank Backs Japanese Robotics Startup Telexistence in $170M Round",
    "SoftBank Backs Telexistence Robot Startup",
    "SoftBank, Foxconn buy into Japan shelf-stocking robot startup",
    "Why Meta is offering users a peek under the hood of its AI-powered algorithm",
    "@Techmeme @KatrinaManson 😂",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Talent redeployment: Ensure good talent grows with your company's needs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Thu. 07/06 - Uh, Did Threads Just Win?",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "TikTok Music streaming service goes live in Brazil and Indonesia",
    "TikTok Announces Its Streaming Music Platform, TikTok Music",
    "TikTok Launches Music-Streaming Service in Brazil and Indonesia",
    "Facilitating Wholesale Digital Asset Settlement",
    "NY Fed, banks wrap up regulated liabilities network proof-of-concept using wCBDC",
    "New York Federal Reserve, major U.S. banks successfully complete private test using DLT",
    "Big Banks, NY Fed's Innovation Group See Merit in Digital Ledgers for Global Payments",
    "NY Fed and financial firms report success with early digital assets payments",
    "NY Fed Says Months-Long Test on Digital Dollar Shows Speed Advantage 1",
    "The AlleyWatch Startup Daily Funding Report: 7/6/2023",
    "Clair Secures $175 Million Investment for on-Demand Pay Solution",
    "Private equity firm GTCR buys majority stake valuing Worldpay at $18.5B",
    "Worldpay by FIS adds eftpos capabilities",
    "FIS to sell Worldpay stake to GTCR",
    "TSMC says China's raw material export restrictions won't hurt — for now",
    "TSMC: Chinese Curbs on Rare Metal Exports Will Not Have Immediate Effect",
    "US opposes China's export controls, saying they justify supply chain moves",
    "China says it told the U.S. and Europe about the export controls in advance",
    "China plays a trump card in the chip war, but Apple chip production unaffected so far",
    "China export ban on Galium and Germanium changes the course of the tech war",
    "Asian chipmakers' nightmare is China's export curbs",
    "Ethereum NFT royalties hit 2-year low as Bored Ape floor price falls below 30 ETH",
    "It gets funnier by the day that they tried to brand this shit “web3” [embedded post]",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "NYC law governing AI-based hiring tools goes live",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "New York employers must now tell applicants when they encounter AI",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "@nitashatiku@mastodon.social",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "Celsius CEO Found Guilty — Should Creditors be Worried About Getting Funds Back?",
    "CFTC Investigators Conclude Celsius And Former CEO Violated Rules, Potential Case Looms",
    "Ed Zitron's Where's Your Ed At",
    "The End of the Honest Internet",
    "Twitter Payments LLC earns money transmitter license in the US",
    "Spotify is booting legacy subscribers still paying via Apple's App Store",
    "Spotify Blocks Subscribers From Apple in-App Payments",
    "Spotify kicks out subscribers paying through Apple's App Store",
    "Spotify is removing App Store payment option for legacy subscribers",
    "Spotify Premium Members Can No Longer Pay Via Apple's App Store",
    "Spotify to Boot Legacy Subscribers Who Still Pay Through Apple's App Store",
    "Spotify Flips The Finger At Apple By Killing App Store Payments",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Enjoy the Samsung Unpacked lineup from all angles and in all colors ahead of launch",
    "It's official: Samsung's Unpacked Event to unfold on 26th July",
    "A new Samsung Galaxy device is coming—reserve now and get $50 off",
    "Samsung's upcoming Unpacked lineup leaked in renders",
    "Samsung's folding phones will be Unpacked on 26 July",
    "Don't miss your chance to save $50 off a Z Fold 5, Flip 5, Tab S9, or Watch 6!",
    "Samsung Unpacked: July date set for Galaxy Z Fold and Z Flip 5 unveiling",
    "Galaxy Z Fold 5 and Z Flip 5: Samsung confirms unveiling date, official images leak",
    "Samsung to introduce its Galaxy Z Fold 5 and Z Flip 5 on July 26 to global markets",
    "Exactly When Samsung Will Launch Galaxy Z Flip5, Galaxy Z Fold5",
    "Our Plan for a Sustainably Open Social Network",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "Decentralized social network Bluesky announces $8M seed round and paid service",
    "Purchase and Manage Domains Directly Through Bluesky",
    "Bluesky shares seed round, Threads launches, Twitter becomes money transmitter",
    "Introducing Superalignment  —  We need scientific and technical breakthroughs to steer …",
    "AI firms should face prison over creation of fake humans, says Yuval Noah Harari",
    "OpenAI commits to ‘superalignment’ research",
    "OpenAI Launches New “Superalignment” Team to Protect against Rogue AI",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/...",
    "Guys, time to drop a new buzzword https://twitter.com/...",
    "openai: Superintelligence is coming in 10 years."
]