[
    "Lawyers: Email proves Microsoft's Activision bid is designed to eliminate PlayStation",
    "Microsoft considered acquiring Bungie and Sega to bolster Xbox Game Pass, internal emails show",
    "More Microsoft Xbox email and document leaks show cloud investment plans and more",
    "Microsoft's Proposed Strategy To “Spend Sony Out Of Business” Revealed In 2019 Internal Email",
    "Xbox Studios Head Said Microsoft Could ‘Spend Sony Out of Business’ in 2019 Email",
    "Xbox Aimed to “Spend Sony Out of Business,” Acquisitions/Cloud Prioritized over XSX Supply",
    "Microsoft Considered Acquiring Sega To Help Bolster Game Pass",
    "Xbox internal emails: Microsoft ‘positioned’ to ‘spend Sony out of business’",
    "Xbox Looked at Acquiring Sega, Supergiant, Bungie",
    "Internal Email Reveals Microsoft Seriously Considered Buying Bungie and SEGA",
    "Xbox Game Studios' VP Was Prepared to ‘Spend Sony Out of Business’ to Grow the Xbox Brand",
    "SEGA & Bungie Included In Huge List Of Companies Xbox Has Considered Acquiring",
    "Microsoft Was Looking at Acquiring Sega, Bungie to Expand PC and Xbox Game Pass Offerings",
    "Microsoft was ready to ‘go spend Sony out of business’ to strengthen Xbox",
    "Microsoft was ready to “go spend Sony out of business” to strengthen Xbox",
    "Sounds like we're going to need AI to police AI.  —  https://www.theverge.com/...",
    "“A.I. is overwhelming the internet's capacity for scale” https://www.theverge.com/...",
    "Now is the time of monsters. https://www.theverge.com/...",
    "AI is polluting the web with low quality content and spam. https://twitter.com/...",
    "AI is killing the old web, and the new web struggles to be born",
    "‘AI is Killing the Old Web’ 1",
    "Junk websites filled with AI-generated text are pulling in money from programmatic ads",
    "Ads for major brands are appearing on AI-generated spam sites",
    "Google profits from AI content spam generated by ChatGPT and LLMs",
    "US to spend $42 billion to make internet access universal by 2030",
    "Biden announces $42 billion to expand high-speed internet access",
    "White House announces $40 billion in broadband funding",
    "Biden announces $42 billion high-speed internet initiative",
    "US announces $42 billion program for affordable high-speed broadband",
    "Biden unveils $42 billion broadband internet plan",
    "White House Announces $42 Billion to Expand Broadband Across US",
    "U.S. to Invest $42 Billion in Universal Internet Access",
    "U.S. to spend $42 billion to expand broadband internet access under Biden plan",
    "US announces $42 billion plan to make high-speed internet universal by 2030",
    "US allocates $42B in broadband funding—find out how much your state will get",
    "Biden lines up $42.5B for US broadband boost",
    "White House Tips $42B for Broadband Buildout: How Much Does Your State Get?",
    "Biden Unveils $42B Investment In Universal Internet Access",
    "More than $42 billion in broadband funding allocations announced",
    "States to Learn Their Share of $42.5 Billion in Federal Broadband Money",
    "White House Announces Historic $42 Billion Investment in Nationwide Broadband Access",
    "White House unveils state BEAD allocations",
    "North Carolina lands $1.5 billion in federal broadband infrastructure funding",
    "Here's how much every state is getting from BEAD grant program",
    "The Biden administration's $42 billion broadband program is finally getting underway",
    "Say Hello to Meta Quest+, Our New VR Subscription Service",
    "Introducing Meta Quest+ | VR Title Subscription",
    "Meta's Quest+ subscription offers two VR titles per month",
    "Meta: Facebook owner launches virtual reality subscription service",
    "Meta launches VR subscription service that costs $7.99 a month",
    "Meta launches Quest+ subscription for its VR headsets as Apple Vision Pro debut nears",
    "Meta Launches Quest+ Subscription Service for VR Experiences",
    "Meta's first VR subscription, Quest+, delivers two new titles to your library for $8/month",
    "Meta Quest Now Has Its Own Games Subscription Service",
    "Meta announces its Quest+ subscription for VR gaming",
    "Meta Quest+ VR subscription launches at $7.99/mo",
    "Meta Quest+ VR Subscription Service Launches at $7.99/month",
    "Meta Launches VR Subscription Service",
    "Meta Quest+ wants to be Game Pass for VR, but it doesn't stand a chance yet",
    "Meta Quest Plus subscription: How it works, and is it worth paying?",
    "Meta Starts Subscription VR Gaming With Quest Plus",
    "Meta Quest+ Subscription Service Offers Cheaper Way to Get Into VR Games",
    "Meta Launches Quest+ VR Subscription Service",
    "Meta Launches Subscription Service on Games for Virtual Reality Headsets",
    "Meta debuts PlayStation Plus-like Quest+ subscription",
    "Meta Launches Monthly VR Game Subscription Service for Quest",
    "Meta announces Quest+, a VR subscription that will offer two titles every month",
    "Meta Quest Plus — Meta's VR gaming subscription is finally here",
    "Meta unveils Meta Quest+ subscription service",
    "Meta launches new VR subscription ‘Meta Quest+’ for $7.99",
    "Meta Quest+ subscription is the VR version of PS Plus and Xbox Live Gold",
    "Meta Quest+ VR Game Subscription Service Launches",
    "Meta launches Quest+ subscription for VR headsets",
    "Meta Launches ‘Meta Quest+’ VR Subscription For $7.99",
    "Meta Launches New VR Subscription Service for $7.99 a Month",
    "Meta launches Quest+ games subscription for VR",
    "Meta Quest+ Subscription Offers Two Games Monthly For $7.99",
    "Meta announces new VR subscription service Meta Quest+",
    "Decentralized Twitter rival Damus will be removed from the App Store over Bitcoin tipping",
    "Damus Zaps vs. the App Store",
    "Bitcoin Tipping Service Damus Gets Booted From Apple App Store",
    "Tips aren't unlocking content, @Apple https://twitter.com/...",
    "Apple must be stopped. https://twitter.com/...",
    "This is why I prefer web apps! We need decentralization!! https://twitter.com/...",
    "‘Last minute’ law change bid to ‘muzzle’ critics of Data Protection Commission - ICCL",
    "Irish Gov makes critizising Big Tech and Irish DPC a crime!",
    "Irish Council for Civil Liberties",
    "Last-minute Government amendment seeks to muzzle DPC critics",
    "ICCL accuses government of seeking to ‘muzzle’ DPC critics",
    "ICCL says “last minute” amendments to bill aim to “muzzle” critics of DPC",
    "Irish Government Accused of Trying to Muzzle Privacy Critics",
    "Irish government criticized over proposed law-change that would ‘muzzle’ Big Tech critics",
    "Irish Gov Makes Critizising Big Tech and Irish DPC a Crime",
    "UT Mourns Lithium-Ion Battery Inventor and Nobel Prize Recipient John Goodenough",
    "Lithium-ion battery creator John Goodenough dies at 100",
    "John Goodenough, Creator Of The Lithium Ion Battery, Dead At 100",
    "John Goodenough, Nobel laureate and battery pioneer, dies at 100",
    "After decades contributing to science, John Goodenough powers down",
    "John Goodenough, Nobel laureate and Li-ion battery inventor, dies at 100",
    "John B. Goodenough, who shared a Nobel Prize for his work on the lithium-ion battery, has died",
    "The Electric: Inside the White House Plan to Speed Battery Metals Mining",
    "John Goodenough, Pioneering Creator of the Lithium-Ion Battery, Dies at 100",
    "John B. Goodenough, 100, Dies; Nobel-Winning Creator of the Lithium-Ion Battery",
    "John Goodenough, Lithium-Ion Battery Inventor and Nobel Prize Recipient, Dies",
    "FTX Debtors Release Second Investigative Report",
    "FTX Recovers $7 Billion in Assets in Liquid Assets",
    "FTX debtors release second investigative report, details on commingling and misuse of deposits",
    "FTX's New Management Recovers $7 Billion in ‘Substantial Progress’",
    "FTX scandal exposed: Misuse of customer deposits revealed in second investigative report",
    "FTX Senior Attorney Helped Cover Up Misuse of Funds",
    "FTX has recovered $7B in assets so far, has almost $2B to go to cover misappropriations",
    "FTX Owes its Customers A lot of Money: Internal Audit",
    "FTX Exchange in $8.7B Debt to Clients Amid Bankruptcy: Misappropriation of Funds Revealed",
    "FTX Recovers $7 Billion As New Investigative Report Is Released",
    "FTX Lied to Banks for Years About Commingling Funds, New CEO Claims",
    "FTX Bankruptcy Team Says the Exchange Owed Customers $8.7B",
    "DeepMind claims its next chatbot will rival ChatGPT",
    "More details emerge about Google DeepMind efforts to surpass ChatGPT",
    "Deepmind founder shares details on Gemini, Google's next-gen response to GPT-4",
    "DeepMind's Gemini: Google's Bid to Eclipse OpenAI's ChatGPT",
    "Google DeepMind Claims Its New Algorithm Will Trump ChatGPTs",
    "Google DeepMind devises a strategy to outwit ChatGPT with Gemini",
    "How Google DeepMind Plans to Outsmart ChatGPT with Gemini",
    "DeepMind develops Gemini chatbot, rivals OpenAI's ChatGPT",
    "“Google DeepMind's CEO says its next algorithm will eclipse ChatGPT”",
    "Google DeepMind's CEO Says Its Next Algorithm Will Eclipse ChatGPT",
    "Free compensation benchmarking data from 3,000 startups",
    "MosaicML Agrees to Join Databricks to Power Generative AI for All",
    "Databricks picks up MosaicML, an OpenAI competitor, for $1.3B",
    "Databricks Signs Definitive Agreement to Acquire MosaicML, a Leading Generative AI Platform",
    "Databricks snaps up MosaicML to build private, custom machine models",
    "Databricks buys AI darling MosaicML for $1.3B",
    "Databricks to acquire MosaicML for blockbuster $1.3B as M&A freeze thaws",
    "Deal Monday Returns With Spate of AI and Enterprise Acquisitions",
    "Databricks To Acquire Generative AI Startup In $1.3B Deal",
    "Databricks acquires AI startup MosaicML",
    "Databricks to Acquire AI Startup MosaicML for $1.3 Billion",
    "Databricks Buys Generative AI Startup MosaicML For $1.3B",
    "Databricks Acquires MosaicML To Make Generative AI More Accessible",
    "Databricks' $1.3 billion MosiacML acquisition to boost generative AI offerings",
    "Databricks acquires generative AI startup MosaicML in $1.3B deal",
    "Databricks' $1.3 billion buy of AI startup MosaicML is a battle for the database's future",
    "Databricks adds on to the Lakehouse, acquires MosaicML for $1.3 billion",
    "Databricks Acquires MosiacML to Further Democratizing Generative AI",
    "Databricks to Acquire MosaicML",
    "Databricks acquires MosaicML in $1.3bn deal to democratise generative AI",
    "Databricks is acquiring MosaicML for a jaw-dropping $1.3 billion",
    "Databricks strikes $1.3 bln deal for generative AI startup MosaicML",
    "Generative AI: Databricks to Acquire MosaicML for $1.3B",
    "Databricks acquires MosaicML to make generative AI accessible for every organization",
    "Man, two billion dollar acquisitions today.",
    "Instagram style acquisitions now going down in AI. This is a big deal for startups. [image]",
    "AI Software M&A is hot! https://twitter.com/...",
    "Databricks Strikes $1.3B Deal for Generative AI Startup MosaicML",
    "Just swipe up to see the next video",
    "Personalized wealth management, built for tech people",
    "There's room for more: Now you can allow up to 5,000 attendees in Zoho Webinar",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/26 - The M&A Deluge In AI Begins",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Introducing ERNIE 3.5: Baidu's Knowledge-Enhanced Foundation Model Takes a Giant Leap Forward",
    "@Techmeme I'm really excited to have Ernie summarize the Tiananmen Square Massacre.",
    "Snowflake adds partnerships with Nvidia and Microsoft for AI double play",
    "Nvidia Partners With Snowflake to Bring More AI Power to Corporations",
    "Nvidia, Snowflake announce partnership for custom generative AI models",
    "Snowflake and Nvidia partner to let businesses use their own data to build custom AIs",
    "Snowflake, Nvidia partner to enable generative AI app development in the Snowflake Data Cloud",
    "Snowflake, Nvidia team up to enable custom enterprise generative AI apps",
    "Thomson Reuters to acquire legal tech provider Casetext for $650 mln",
    "Thomson Reuters Corporation Signs Definitive Agreement to Acquire Casetext",
    "Marques Brownlee on YouTube",
    "RIP to my Pixel Fold: Dead after four days",
    "Ron Amadeo's Pixel Fold Lasted Four Days",
    "Google Pixel Fold Initial Review: Shockingly good, but is it worth the money?",
    "Google Pixel Fold just beat Samsung for best foldable phone",
    "Google Pixel Fold: An Excellent Foldable Phone With One Big Problem",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Pixel Fold review roundup: Google's turning heads and hinges",
    "Google Pixel Fold review: The first foldable phone that gets it right",
    "Someone's Pixel Fold has died already and the bezels may be to blame",
    "Pixel Fold Breaks in Just 4 Days For High-Profile Reviewer",
    "Google Pixel Fold Review: Foldable Phones Are Improving",
    "Google Pixel Fold Review: A Promising Start, but Not Perfect",
    "Google Pixel Fold is a quality first swing at a foldable",
    "Google Pixel Fold unboxing and first impressions [VIDEO]",
    "Google Pixel Fold Review: Maybe Next Year!",
    "Google Pixel Fold Review: For Those Who Really Want to Multitask",
    "Is the Google Pixel Fold the best foldable? This feature could convince me it is",
    "Google Pixel Fold review: First impressions of Google's $1800 folding phone",
    "Google Pixel Fold review: Competent, not captivating",
    "Here Are the First Google Pixel Fold Reviews [Roundup]",
    "Tried this briefly at Google I/O and I kinda want a foldable phone now... https://twitter.com/...",
    "Ron from ars technica's pixel fold broke",
    "Ars Technica: RIP To My Pixel Fold After Four Days",
    "Unleashing Business Intelligence in the Era of Generative AI",
    "A Note From the Mode Founders",
    "ThoughtSpot acquires Mode: Empowering data teams to bring Generative AI to BI",
    "ThoughtSpot acquires rival business intelligence startup Mode for $200M",
    "Most adults think AI produces better artwork than they ever could",
    "59% of U.S. internet users are already on ChatGPT, BofA survey finds",
    "Public Opinion on AI Concerns #1677",
    "People Love OpenAI, Bing and Bard, Survey Finds. What It Says About Stocks.",
    "One in three Americans have tried generative AI tools, new survey shows",
    "The AI survey says.... https://twitter.com/... [image]",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Apollo Global leads a $2 billion private funding for chipmaker Wolfspeed",
    "Wolfspeed Announces $1.25 Billion Funded Secured Notes Led by Apollo Credit Funds",
    "Chipmaker to Raise Over $1 Billion in Debt From Apollo-Led Group",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "Supreme Court says Genius' song lyric copying claim against Google wasn't smart",
    "Supreme Court rejects Genius lawsuit claiming Google stole song lyrics",
    "SCOTUS Issues Denials in IP Cases",
    "Supreme Court Refuses to Hear Genius' ‘Stolen Lyrics’ Case Against Google and LyricFind",
    "US Supreme Court lets Google win stand against Genius suit over song lyrics",
    "Supreme Court Rejects Lawsuit Accusing Google of Stealing Millions of Song Lyrics",
    "★ FTC Sues Amazon, Claiming ‘Deceptive’ Prime Sign-Up and Cancellation Process",
    "⌥ Priming  —  Last week, the U.S. Federal Trade Commission filed suit against Amazon …",
    "Airline industry still not fully prepared for 5G in C-band spectrum",
    "Airline 5G mess still not over, expect flight delays from this weekend",
    "A 5G deadline could ground some US flights starting July 1st",
    "What technology could be grounding some U.S. planes by next month?",
    "Better 5G Service Near Airports Starts This Weekend",
    "Secretary Buttigieg warns of flight delays from July 1 due to 5G",
    "If your flight is delayed or canceled starting July 1st, blame it on 5G",
    "An upcoming 5G deadline could cause airline delays starting July 1st",
    "Korean firms fight talent exodus as chip tech war intensifies",
    "Amazon will use small businesses to help deliver packages in the US",
    "Amazon taps florists and coffee shops for help with deliveries",
    "Amazon will now pay your coffee shop to deliver packages",
    "Bodega Delivery: Amazon Turns to Thousands of Small Shops to Speed Up Deliveries",
    "Amazon is leaning on small businesses to help deliver packages around the U.S.",
    "A small business might deliver your next Amazon package",
    "Amazon wants to turn small shops into delivery partners",
    "Amazon to lean on local businesses for “last mile” delivery",
    "Amazon Recruiting Local Businesses for Last-Mile Delivery",
    "Amazon Launches Local Business Delivery Network",
    "Film and TV Profits Have Collapsed Over the Last Decade",
    "Hollywood is leaving podcasting to podcasters",
    "Meghan Markle's lack of talent explains Spotify failure, says CEO of top Hollywood agency",
    "Meghan Markle is ‘not a great talent’: UTA CEO after Spotify deal bust",
    "Taylor Swift turned down Meghan Markle's invite to appear on her podcast",
    "Japan kind-of nationalizes key chipmaking material-maker JSR",
    "Japan's JIC sees M&A options in chipmaking niches after $6.4 bln JSR buyout",
    "Japan bolsters its chip industry with buyout of equipment maker JSR",
    "Japan steps into chip supply chain with $6.4bn JSR deal",
    "Japan fund eyes JSR buyout as Tokyo ramps up chip intervention"
]