[
    "@matthewrodier.bsky.social",
    "An update on our approach to US election misinformation",
    "YouTube will stop removing false presidential election fraud claims",
    "YouTube now allows videos that falsely claim Trump won 2020 election",
    "YouTube will stop removing false claims of 2020 US election fraud",
    "After Ban, YouTube Will Allow Videos That Back 2020 Election Fraud Claims",
    "YouTube will stop removing false claims about 2020 election fraud",
    "YouTube faces backlash as it halts removal of false claims about 2020 US Presidential election",
    "YouTube will now allow 2020 election denialism content, in policy reversal",
    "YouTube Reverses Policy That Banned Claims Of Fraud In 2020 Election",
    "YouTube will no longer take down false claims about U.S. elections",
    "YouTube Revises Its U.S. Election Misinformation Policy Amid Election Season",
    "YouTube says it will stop removing false claims about past elections",
    "YouTube reverses course, will not take down controversial or disproven political content",
    "YouTube Will No Longer Remove US Election Fraud Content",
    "YouTube reverses policy, will allow election denial",
    "YouTube Will Stop Removing Videos Pushing Lies About the 2020 U.S. Presidential Election",
    "YouTube Nukes Policy Banning Election Denialism",
    "YouTube to stop removing content making false claims on past elections",
    "YouTube changes policy to allow false claims about past US presidential elections",
    "What's the worst that could happen?",
    "Why would you replace a good policy with a terrible one",
    "Apple's mixed reality headset is a hedge against disruption",
    "Gurman: Apple May Announce Drop of ‘Hey Siri’ Trigger Phrase at WWDC",
    "Beyond WWDC  —  A variety of developer organizations will host events throughout the week of WWDC.",
    "Apple Reality Pro VR Headset: New Leak Reveals Unprecedented Detail",
    "What I'm watching for at the WWDC keynote",
    "Siri tipped for handy upgrade at WWDC 2023 — no more ‘Hey Siri’",
    "Reality Pro's library of Apple Music VR concerts has been a decade in the making",
    "Latest Apple VR headset leak gives us clues about how it might get used",
    "Apple has built a special hands-on area inside Apple Park for AR/VR headset demos",
    "Apple's rumoured mixed reality headset may be the miracle the European XR industry needs",
    "Apple's New VR Headset Will Disappoint, but That's OK",
    "Apple macOS 14: What new features could be coming to your Mac?",
    "Why Apple's VR headset could succeed where every similar product has failed",
    "This Week in the Metaverse: Apple and Meta's looming headset war",
    "Apple's new headset will land in an AI-crazed world",
    "Apple's Mixed Reality Bet Comes Due | PRO Insight",
    "Try on Apple's upcoming mixed-reality headset with this new Snapchat filter",
    "Everything about Apple's Reality Pro AR/VR: Features, Price, and Availablity",
    "Apple WWDC: Everything to know about major live event, as headset and new iPhone features expected",
    "Apple Is Stepping Into the Metaverse. Will Anyone Care?",
    "Apple bulls are bracing for a Tim Cook ‘flex’ moment",
    "Apple mixed reality headset to bring a lot of much needed excitement to the space - Barclays",
    "Apple's AR/VR headset might be 2023's most sought after Christmas present",
    "Apple to warp reality for real dollars",
    "Apple WWDC 2023: How to Watch Live and What to Expect",
    "Road to WWDC: What to expect from Reality Pro and AR/VR",
    "1 big thing: Apple's new headset will land in an AI-crazed world",
    "New iOS 17 Apple Wallet rumor: This new feature will help you stay on top of things",
    "Apple's ‘Reality Pro’ will likely offer an in-depth catalog of live concerts",
    "WWDC 2023: Here's the new hardware Apple is expected to announce",
    "WWDC 2023 Preview  —  Hartley Charlton:  —  Apple is overtly teasing the start of “a new era” …",
    "Apple headset revenue estimate: ‘A huge leap of faith’ says Barron's",
    "Apple conference kicks off June 5. Here's everything you need to know about WWDC 2023.",
    "Should you be concerned about health and safety with Apple's mixed reality headset?",
    "Apple's Ultra-Premium Mixed Reality Headset: Everything We Think We Know",
    "Apple may ship its upcoming AR/VR headset with some very important warnings",
    "Apple Highlights ‘Beyond WWDC’ Events Taking Place This Month",
    "Join CNET's WWDC 2023 Watch Party: Live Reactions to Apple's New Reveals",
    "Apple to unveil refreshed Mac Studio at WWDC 2023 confirms Mark Gurman",
    "No one has done AR or VR well. Can Apple?",
    "Reality Pro could be the ultimate Mac display that Apple would never make",
    "Can Apple make its headset inevitable?",
    "Apple highlights ‘Beyond WWDC’ events happening next week around the world",
    "Apple Shares ‘Beyond WWDC’ Events for Developers, Uploads Themed Apple Music Playlists",
    "Apple rumored to redesign core apps in watchOS 10 for larger watch displays",
    "What to Expect from Apple's WWDC 2023",
    "Apple needs to prove why its mixed reality headset matters",
    "You should lower your expectations for Apple's magic headset",
    "Apple's $3,000 XR headset is a little pricey; could subscription pricing help?",
    "Don't judge Apple's VR headset too soon",
    "Apple's Mixed Reality Bet Comes Due",
    "What ad products might Apple announce at WWDC 2023?",
    "What to Expect at Apple's WWDC 2023",
    "Apple WWDC 2023 is where the new virtual reality headset rumors face a reality test",
    "Can Apple Save the Metaverse?  These Startups Hope So.",
    "Apple plans ‘controlled’ demos of new AR/VR headset",
    "What to Expect at WWDC 2023: AR/VR Headset, New Mac Studio, Mac Pro",
    "Apple reportedly builds hands-on area inside Apple Park for AR/VR headset demos",
    "Apple's Reality (Headset) Plans (Above Avalon Report)",
    "Gurman: iOS 17 Wallet App May Show Additional Credit Card Balances",
    "Everything Mark Gurman knows about Apple's headset",
    "What We Expect From Apple's WWDC 2023 Mac Lineup",
    "Apple casts big shadow over the XR industry | The DeanBeat",
    "watchOS 10 reportedly revamps core apps for the Apple Watch Ultra's larger display",
    "Apple's AR/VR Headset May Be Here By The End Of 2023",
    "WWDC predictions  —  Plus: Meta tries to crash Apple's party  —  Welcome back to Multicore …",
    "Apple may soon show off its biggest and riskiest new hardware product in years",
    "Apple expected to unveil mixed-reality headset",
    "The Why of Apple XR Headset",
    "New Mac Studio Now Expected To Be Announced At WWDC",
    "Apple WWDC 2023—What It Means for You",
    "A new Mac Studio might be unveiled by Apple during WWDC 2023",
    "The Download: AI films, and the threat of microplastics",
    "WWDC 2023: Watch CNET's Live Coverage of Apple's Developers Conference",
    "What to expect from Apple's WWDC 2023: VR headset, 16-inch MacBook Air, iOS 17 and more",
    "reading the warning pamphlet for Reality Pro be like: https://twitter.com/... [image]",
    "@counternotions It appears that way. Life comes at you fast.",
    "ADHD makes sense to some extent actually https://twitter.com/...",
    "Protip: You can't be a status symbol if you have a battery pack https://twitter.com/...",
    "i expect some things will happen at WWDC https://www.multicore.blog/...",
    "Japan privacy watchdog warns ChatGPT-maker OpenAI on user data",
    "It is official: ChatGPT has started taking human jobs",
    "ChatGPT and Generative AI Around the World: Maturity, Opportunities, and Hurdles in Key Regions",
    "How ChatGPT Can Help You Land Your Dream Job",
    "Gosh I wonder what they'll choose?? https://www.washingtonpost.com/ ... [image]",
    "Progress Software Corporation",
    "Cybersecurity and Infrastructure Security Agency",
    "@GossiTheDog@cyberplace.social",
    "MOVEit Transfer Critical Vulnerability (May 2023)",
    "Zero-Day Vulnerability in MOVEit Transfer Exploited for Data Theft",
    "Rapid7 Observed Exploitation of Critical MOVEit Transfer Vulnerability",
    "MOVEit Transfer Critical Vulnerability CVE-2023-34362 Rapid Response",
    "Critical Vulnerability in Progress MOVEit Transfer: Technical Analysis and Recommendations",
    "Progress Software Releases Security Advisory for MOVEit Transfer",
    "Zero-Day In MOVEit File Transfer Software Exploited To Steal Data From Organizations",
    "CVE-2023-34362  —  Assigner: MITRE Corporation Published: 2023-06-02Updated …",
    "Hackers launch another wave of mass-hacks targeting company file transfer tools",
    "Hackers Using MOVEit Flaw to Deploy Web Shells, Steal Data",
    "Hackers use flaw in popular file transfer tool to steal data, researchers say",
    "Update now! MOVEit Transfer vulnerability actively exploited",
    "MOVEit Transfer Zero Day Under Attack",
    "Malicious hackers target vulnerable file-transfer tool",
    "MOVEit Transfer Tool Leveraged By Hackers To Steal User Data: US Security Researchers",
    "MOVEit Transfer Zero-Day: What We Know So Far",
    "Zero-day vulnerability in MoveIt Transfer under attack",
    "CISA adds Progress MOVEit Transfer zero-day to its Known Exploited Vulnerabilities catalog",
    "Hackers Exploit Progress MOVEit File Transfer Vulnerability",
    "Millions of users vulnerable to zero-day in MOVEit file transfer app",
    "Threat Actors Exploiting MOVEit Transfer Zero-Day",
    "MOVEit Transfer has a major security issue - here's what you need to know",
    "MOVEit file transfer vulnerability exploited by hackers",
    "MOVEit Transfer Vulnerability",
    "Experts warn of MOVEit Transfer tool exploitation using zero-day bug",
    "MOVEit MFT 0-day Vulnerability is Used to Steal Corporate Data",
    "Deployed publicly accessible MOVEit Transfer?  Oh no. Mass exploitation underway",
    "MOVEit Transfer Under Attack: Zero-Day Vulnerability Actively Being Exploited",
    "Hackers exploit MOVEit file transfer vulnerability",
    "MOVEit Transfer software zero-day actively exploited in the wild",
    "MOVEit Transfer vulnerability is being exploited widely",
    "MOVEit Transfer zero-day attacks: The latest info",
    "Security flaw in MOVEit file transfer tool allowed hackers to steal user data",
    "MOVEit zero-day vulnerability under active exploit, data already stolen",
    "A majority of EU states don't want big tech to pay for the infrastructure they benefit from",
    "@erininthemorning.bsky.social",
    "Musk's response to an anti-trans video sparks 24 hours of chaos at Twitter",
    "Elon Musk's Twitter isn't flat or hierarchical—it's unilateral",
    "Twitter's head of brand safety and ad quality has left the company",
    "Twitter safety chief resigns after Musk criticizes decision to restrict film",
    "Elon Musk Personally Elevates Transphobic Video Originally Flagged as Hate Speech",
    "Second Twitter Safety Executive Resigns",
    "Elon Musk spent the last 24 hours spreading increasingly unhinged anti-trans content",
    "Elon Musk and Twitter face growing brand-safety concerns after execs depart",
    "Twitter loses two executives in charge of trust and safety",
    "Right-wing Musk fans win Twitter CEO's loyalty. Staff loses.",
    "Twitter loses second head of Trust and Safety under Musk",
    "Twitter reportedly loses second top safety executive in two days",
    "Twitter Loses Its Second Trust and Safety Head Under Elon Musk's Reign",
    "Twitter Sees Two Key Ad-Related Executives Depart",
    "Twitter Loses Two Top Executives Managing Site Content Safety",
    "Tech is NOT and has NEVER been neutral NOR apolitical... https://twitter.com/...",
    "ads on here have gone full late night infomercial",
    "he really seems determined to destroy the company https://twitter.com/...",
    "Microsoft is killing off Cortana in Windows 10 and Windows 11 later this year",
    "Microsoft will end support for Cortana on Windows later this year",
    "RIP: Microsoft is finally killing Cortana on Windows",
    "Microsoft says it's curtains for Cortana in Windows 11 (and 10) - but that's no surprise",
    "Microsoft to kill Cortana app in Windows this year",
    "RIP Cortana: Microsoft says its Windows AI app will die",
    "Microsoft just burned Cortana to the ground — there's a better AI assistant in town anyway",
    "Microsoft Windows latest: Cortana app out, adverts in",
    "Microsoft is killing Cortana on Windows starting late 2023",
    "RIP Cortana on Windows: You should never have left Master Chief",
    "Microsoft will kill support for the Cortana Windows app in late 2023",
    "Windows 11 Adoption Slowed Down In May",
    "With Bing Chat Thriving, Microsoft to End Cortana Support on Windows",
    "Microsoft to kill Cortana app for Windows 10 and 11 later this year",
    "This is like the fourth time they've killed off Cortana. https://twitter.com/...",
    "Fallen Pizza Startup Zume Shuts Down After Raising Millions",
    "SoftBank-backed robot pizza Zume shuts down",
    "Another unicorpse https://www.theinformation.com/ ...",
    "Best Infosec-Related Long Reads of the Week, 6/3/23",
    "Here's our @citizenlab report on BellTroX referenced in the piece https://citizenlab.ca/...",
    "Personalized wealth management, built for tech people",
    "They couldn't upgrade to Hobees? https://www.wsj.com/...",
    "Vimeo will stop supporting its TV apps on June 27th",
    "Learn more about Vimeo ending support for TV apps",
    "Vimeo is Ending Support for Its Apple TV App",
    "The Best TV Remote Apps for Android and iPhone",
    "Vimeo is tuning out its streaming TV apps",
    "Vimeo is Ending Support for All TV Apps in Lieu of Video Casting Features",
    "Vimeo is killing off its TV apps in favor of casting",
    "Vimeo Instituting Changes To How You Can Watch Content On Your TV",
    "Vimeo to shut down all of its TV streaming apps later this month",
    "Vimeo is killing its Android TV, Apple TV, and other apps in favor of casting",
    "Free compensation benchmarking data from 3,000 startups",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/02 - An Amazon Prime Phone Service?",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta found liable as court blocks firing of moderators",
    "Court blocks sacking of content moderators, holds Meta liable",
    "Kenyan Court Halts Mass Layoff of Facebook Moderators, Orders Support and Care",
    "Meta blocked from firing content moderators",
    "@securopean@infosec.exchange",
    "Microsoft stashes nearly half a billion in case LinkedIn data drama hits",
    "Microsoft expects to pay $425 million fine for LinkedIn privacy violations",
    "Microsoft Braces for Potential $425 Million GDPR Fine by Irish Regulators",
    "Microsoft sets aside $425M to help cover potential LinkedIn targeted advertising fine",
    "Microsoft Braces for $425 Million Fine over LinkedIn GDPR Privacy Violations",
    "Microsoft says it may pay a $425 million fine over alleged Linkedin privacy violations",
    "Clickbait Rewriting on Artifact: Behind the Scenes",
    "An app might rewrite this clickbait headline — here's why",
    "Artifact's AI Will Rewrite Clickbaity Headlines, Though Don't You Dare Rework Mine",
    "Ooh.  I love this.  I think I am a fan of algorithms doing the work for me.",
    "That's a good use of GPT-4",
    "Meta will require staff to be in the office at least three days a week",
    "Meta Calls Employees Back to Office Three Days a Week",
    "Meta Enforces Three-Day Office Attendance for Employees",
    "Meta orders employees back to office 3 days per week after slashing 21K jobs",
    "Mark Zuckerberg Mandates Meta Employees Return to the Office Three Days a Week",
    "Facebook Parent ‘Meta Platforms’ Mandates Three-Day Office Work Week from September",
    "Meta Platforms rethinks hybrid-work policy, to bring some employees back to office 3x a week",
    "Meta tells staff to return to office three days a week",
    "Meta: Many employees need to return to in-person work 3 days a week",
    "Meta wants staff back in the office three days a week",
    "Now Meta is forcing all its employees back to the office",
    "Meta will require employees to return to the office three days a week starting in September",
    "Meta Requires Office Workers To Return To Desks Three Days a Week",
    "Meta employees need to work from office staring September; check details",
    "About two years too late. https://www.theinformation.com/ ...",
    "Meta institutes a 3-day work week. https://www.theinformation.com/ ...",
    "This is not going to be more efficient. 🤦🏻‍♀ ️ https://www.theinformation.com/ ...",
    "Twitter loses its top content moderation official at a key moment",
    "Twitter's Head of Trust and Safety Resigns",
    "Center for Countering Digital Hate",
    "Twitter fails to act on 99% of Twitter Blue accounts tweeting hate",
    "Twitter's trust and safety lead Ella Irwin resigns",
    "Twitter's Top Content Moderation and Safety Executive Leaves",
    "Twitter loses another trust and safety head",
    "Twitter loses its second head of trust and safety since Musk take-over",
    "Twitter top safety exec Ella Irwin resigns",
    "Twitter trust and safety chief Ella Irwin resigns",
    "Twitter head of trust and safety Ella Irwin has resigned",
    "Twitter Head of Trust and Safety Resigns",
    "The exit of a top Twitter executive highlighted the platform's content moderation challenge",
    "Twitter's head of safety and content moderation has left the company",
    "Twitter head of trust and safety Ella Irwin reportedly resigns",
    "Twitter Loses Another Head of Trust and Safety",
    "Twitter's head of trust and safety resigns: reports",
    "Twitter's head of trust and safety resigns",
    "Twitter's Head of Trust and Safety Ella Irwin Resigns",
    "Ella Irwin, Twitter's Head Trust and Safety, Resigns",
    "I'm shocked to realize Twitter still had a VP of Trust and Safety",
    "surely this has nothing to do with that daily wire publicity stunt earlier",
    "Confirmed, Ella Irwin tells me she resigned today https://twitter.com/...",
    "So, trust and safety are gone? https://www.reuters.com/...",
    "She's been replaced by a 💩 emoji https://www.reuters.com/...",
    "I assume these two developments are related. https://twitter.com/...",
    "Another one bites the dust https://twitter.com/...",
    "Well, she really had no work to do since new ownership took control. https://twitter.com/...",
    "Trust left the office long before this. https://twitter.com/...",
    "Twitter had a head of trust and safety?! 🤨 https://twitter.com/...",
    "job that seems about as desirable as being George Santos' treasurer https://twitter.com/...",
    "Advertisers love this shit. This is what they crave https://twitter.com/...",
    "Wow, Twitter's head of trust and safety is out for a second time. https://twitter.com/...",
    "wheee! https://fortune.com/..."
]