[
    "UNITED STATES DISTRICT COURT FOR THE DISTRICT OF COLUMBIA",
    "SEC Sues Binance and CEO Zhao for Breaking US Securities Rules",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "The SEC is suing Binance, the world's largest crypto exchange",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "US SEC sues Binance, CEO Zhao for breaking securities rules: Bloomberg",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC sues crypto giant Binance and its CEO",
    "SEC sues Binance in US District Court for unregistered securities operations",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "SEC sues Binance and CZ for securities violations",
    "Binance Faces Legal Action by SEC for Violating US Securities Laws",
    "SEC Sues Binance and CEO Changpeng Zhao for Violating US Securities Law",
    "Binance CEO Changpeng Zhao Reacts To The SEC Lawsuit News",
    "Breaking: SEC Sues Binance And CEO For Alleged Securities Fraud",
    "SEC Sues Binance and CZ Over ‘Blatant Disregard’ of Its Rules",
    "SEC sues Binance and CZ for breaking US Securities Rules",
    "SEC Accuses Binance of Mishandling Funds and Lying To Regulators",
    "Binance and CZ sued by SEC for breaching securities law",
    "Live news: SEC alleges Binance and CEO violated US securities laws",
    "Breaking: US SEC Sues Crypto Giant Binance and CEO CZ | Coingape",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "And another one bites the dust (maybe?) https://markets.businessinsider.com/ ...",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "SEC charges Binance with the exact same accusations as FTX: https://www.nytimes.com/... [image]",
    "Binance Executive Controlled Bank Accounts Belonging to U.S. Wing in 2019-20: Reuters",
    "Report: Binance Exec Controlled US Affiliate's Accounts",
    "Binance controlled its US arm's bank accounts for two years: Reuters",
    "Breaking: Binance Exec Tightly Controlled Exchange's US Arm's Finances: Reuters | Coingape",
    "When it rains... https://www.reuters.com/...",
    "Who is Guangying Chen? 🤔 https://www.reuters.com/...",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Binance poaches OKX exec Rachel Conlan to lead global marketing",
    "Binance seeking to ‘demonstrate that we are a new organization’ as regulatory headwinds swirl",
    "Richard Teng takes key role to replace co-founder CZ as the new CEO of Binance",
    "Binance Appoints Teng as CEO of the Largest Crypto Exchange",
    "Binance Rumored Successor Richard Teng to Battle Regulatory Problems if CEO Zhao Steps Down",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Binance Regulatory Woes: Richard Teng Eyed As Possible Successor To CZ - Report",
    "Regulatory Storm Clears Path for Binance's Future: Meet CEO Zhao's Heir Apparent",
    "Binance Exec Touted As Possible ‘CZ’ Replacement",
    "Binance's Regulatory Hurdles Open Path for Potential CZ Successor",
    "Binance's CZ could leave his post amid regulatory hurdle",
    "Binance gains ISO certifications amid global regulatory hurdles",
    "Binance Looking for the Next Heir to CZ Amid Regulatory Woes | Coingape",
    "Dollar-Based Stablecoins to Strengthen Greenback, CZ Says, Thinks DeSantis ‘Is Great’",
    "Ask not for whom carries the can, the can is carried by thee. https://www.bloomberg.com/...",
    "Linda Yaccarino replaces Elon Musk as Twitter boss",
    "Twitter Ad Revenue Plummets 59% Amid Hate Speech Concerns",
    "Reddit going dark in protest at API pricing; Apple cut Twitter ad spend",
    "Twitter's Ad Crisis: Advertising Revenue Falls 59% in a Matter of Weeks",
    "Twitter is hiring ad executives to bolster its business",
    "Twitter's ad sales stink of Musk.Elon Musk to the BBC in April:",
    "that's the good shit  —  https://www.nytimes.com/...  [image]",
    "we are in the “find out” stage of fuck around",
    "He will either sell it or drive it into the ground. https://twitter.com/...",
    "real “everything must go” vibes around here these days https://twitter.com/...",
    "All the advertisers have tragically contracted the Woke Mind Virus https://twitter.com/...",
    "Why they are desperately dropping just about any remaining ad standards. https://twitter.com/...",
    "Twitter to recoup revenue by being everyone's Everything app. https://www.nytimes.com/...",
    "Seems like a good place to launch a presidential campaign from https://www.nytimes.com/...",
    "Wile. E. Coyote, Super Genius! https://www.nytimes.com/...",
    "International Business Times",
    "Atomic Wallet faces security breach, loses over $35 million in cryptocurrency",
    "Over $35 Million Lost in Atomic Wallet Attack as Exploit Investigation Continues",
    "Atomic Wallet hack losses reportedly top $35 million",
    "Atomic Wallet hack leads to at least $35M in stolen crypto assets",
    "On-chain Sleuth Estimates $35 Million Loss From Atomic Wallet Exploit",
    "Weekend hack sees Atomic Wallet users lose $35 million| what we know so far",
    "Atomic Wallet Gets Compromised with Attackers Draining More than $35M from Users",
    "Atomic Wallet hack losses top $35M, on-chain sleuth reports",
    "Atomic Wallet hack: Stolen crypto may grow to $50M, sleuth warns",
    "Atomic Wallet Reportedly Hacked: $35M in Crypto Assets Vanish",
    "Atomic Wallet Users Hacked for $35M Worth of Bitcoin, Ether, Tether and Other Tokens",
    "Atomic Wallet Hit by Massive Hack: $35 Million Worth of Cryptocurrency Stolen",
    "Over $35 Million Reportely Stolen From Atomic Wallet Users",
    "Atomic Wallet Users Left Devastated as Their Funds Vanished Completely",
    "Atomic Wallet security breach causes over $35 million in losses",
    "Atomic Wallet efforts to track and revert stolen funds",
    "Atomic Wallet Security Breach Results In $35 Million Crypto Heist",
    "Report: At least $35M worth of crypto stolen from Atomic wallet users",
    "Atomic Wallet Customers Lose Over $35m in Crypto Attacks",
    "Atomic Wallet Alerts Users Of Ongoing Exploit; Victims Claim Complete Loss Of Crypto Portfolios",
    "Atomic Wallet claims hack affected less than 1% of monthly active users",
    "Atomic Wallet hacks total over $35 million",
    "Atomic Wallet Hack Causes Over $35M in Losses",
    "Atomic Wallet Investigating Exploit As Wave of Crypto Users Report Stolen Funds",
    "Spotify is laying off 200 employees from its podcast division",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify laying off 200 employees in second round of job cuts this year",
    "Spotify cuts 200 roles from its podcast division",
    "Spotify Lays Off 2% of Staff, Merges Gimlet and Parcast",
    "Spotify to Lay Off 2% of Workforce, Primarily in Podcast Groups",
    "Spotify combines podcast studios and shrinks workforce",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify lays off 200 team members from podcast group, combines Parcast and Gimlet studios",
    "Spotify cuts 2 percent of its workforce, mainly in podcasts",
    "Spotify lays off 2% of its workforce as tech job losses continue",
    "Spotify lays off 200 as it reworks podcast division",
    "Spotify to Cut 200 Jobs as It Reorganizes Podcasting Division",
    "Spotify to Slash Podcast Workforce, Combine Parcast and Gimlet Studios in New Round of Cuts",
    "Stock Futures Are Little Changed After the S&P 500's Best Week Since March: Live Updates",
    "Maybe the Joe Rogan podcast wasn't that good for the company https://twitter.com/...",
    "Reddit blackout planned over app-killing API prices",
    "Sitewide Reddit protest to happen on June 12 with 48 hours of shutdowns",
    "Reddit communities are ‘going dark’ to protest changes that would hurt third-party apps",
    "Reddit is going to war with its own users",
    "Revenge of the mutual funds",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "Reddit in Mass Revolt Over Astronomical API Fees That Would Kill Third Party Apps",
    "Reddit Community Considers Blackout In Response to API Policy Changes",
    "A decentralized, ownerless Reddit is needed https://twitter.com/...",
    "Jack Dorsey Endorses RFK Jr. for President",
    "Jack Dorsey endorses pro-Bitcoin candidate Robert F. Kennedy Jr. for president in 2024",
    "Ex-Twitter leader Jack Dorsey endorses RFK Jr. for president",
    "Jack Dorsey tips pro-crypto candidate Robert Kennedy to win presidency",
    "Bitcoin Advocate Robert F. Kennedy Jr. Gains Jack Dorsey Support In Bid For Presidency",
    "Twitter co-founder Jack Dorsey endorses Robert F. Kennedy, Jr. in 2024 presidential race",
    "Instagram reinstates Robert F. Kennedy Jr.'s account",
    "Instagram reinstates Robert F. Kennedy Jr. amid presidential bid launch - WaPo",
    "RFK Jr. Says He Will Join Elon Musk For Twitter Interview After Being Banned From Instagram",
    "Zuck Loves Biden: Facebook Prevents RFK Jr. from Launching Instagram Campaign Account",
    "*years long headache forms*",
    "He can and will https://www.youtube.com/...",
    "Hosting @RobertKennedyJr's upcoming Space https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Allow users to skip passwords at sign-in (beta)",
    "You can log into Google Workspace more securely with this major update",
    "Google rolls out passkey support to Workspace and Google Cloud",
    "Google Workspace and Cloud get support for passkeys",
    "Passkey support for Google Workspace accounts rolling out",
    "Google Workspace will now let your business get rid of passwords for good",
    "Google extends passkeys to Google Workspace accounts",
    "“What is artificial intelligence? A poor choice of words in 1954.”",
    "Ted Chiang on AI: ‘The Machines We Have Now Are Not Conscious’",
    "Carbon Health is already using AI to write patient records",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "5 Ways ChatGPT Could Have A Big Impact On The Healthcare Industry",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’",
    "Russia Says ‘Fake’ Putin Address Declaring Martial Law Was a ‘Hack’",
    "Crypto Twitter's weekend filled with scams, hacks, and fake events",
    "Microsoft says Clop ransomware gang is behind MOVEit mass-hacks, as first victims come forward",
    "Microsoft blames Clop ransomware gang for ‘MOVEit Transfer’ attacks",
    "Mass Exploitation of Zero-Day Bug in MOVEit File Transfer Underway",
    "Critical Zero-Day Flaw Exploited in MOVEit Transfer",
    "Ransomware Group Used MOVEit Exploit to Steal Data From Dozens of Organizations",
    "Microsoft: Lace Tempest Hackers Behind Active Exploitation of MOVEit Transfer App",
    "MOVEit Transfer zero-day was exploited by Cl0p gang (CVE-2023-34362)",
    "Google AI Search: A Slow and Cluttered Experience",
    "Google is using machine learning models to speed up Gmail search",
    "Star developers: they're just like me!",
    "Republican bill seeks SEC, CFTC ‘clarity’ on crypto, memecoin frenzy drives Uniswap to record",
    "SHIB, PEPE: Bitcoin Devs Want to Crush $500 Million Meme Coin Market",
    "Oh crap! Another amazing profile of an amazing human in gaming @DrKowert. https://twitter.com/...",
    "Australia Plans Regulatory Framework for AI",
    "Catching Up On Readings: AI Regulation",
    "What Would AI Regulation Look Like?",
    "Excellent @FT piece by @MarietjeSchaake. https://twitter.com/...",
    "It's sad that this isn't blindingly obvious. https://twitter.com/...",
    "holymoly this is good! https://twitter.com/..."
]