[
    "Big Tech Investors Have Drunk the AI Kool-Aid",
    "Circle CEO says that AI bots are transacting USDC, creating wallets",
    "@Techmeme There you go. Web3 is officially dead.",
    "I knew Ryan Carson was a trendsetter. https://www.theblock.co/...",
    "Crypto to AI pivot fully complete https://twitter.com/...",
    "Slowly the world is healing https://twitter.com/...",
    "The industry wide pivot from Web3 to AI is officially complete https://twitter.com/...",
    "OpenAI unveils $1 Million grant program to revolutionize AI governance",
    "OpenAI offers $100,000 grants to develop AI governance frameworks",
    "OpenAI offers grants for democratic experiments in AI system rules",
    "OpenAI offers $100,000 grants for ideas on AI governance",
    "DAO and discord should handle it, no? 😉 https://twitter.com/...",
    "Sam Altman's big European tour",
    "OpenAI Considers Exit From Europe - Faces Planned Legislation from Regulators",
    "Sam Altman Wants The Government To Build Him A Moat",
    "No 10 acknowledges ‘existential’ risk of AI for first time",
    "Among AI dangers, deepfakes worry Microsoft president most",
    "Sam Altman sells superintelligent sunshine as protestors call for AGI pause",
    "A conversation with OpenAI CEO Sam Altman | Hosted by Elevate",
    "Why OpenAI's Sam Altman was just in Lagos",
    "Mike had a good post on Altman's recent performance before Congress: https://www.techdirt.com/...",
    "Wow, gpt4 even making physical travel way more efficient too 👏 https://twitter.com/...",
    "@paulo170595 @SimonFounder flew to paris, took the eurostar to london",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "OpenAI may leave the EU if regulations bite - CEO",
    "OpenAI has no plans to leave Europe -CEO",
    "OpenAI's Sam Altman reverses threat to cease European operations",
    "OpenAI Could Quit Europe Over New AI Rules, CEO Sam Altman Warns",
    "OpenAI says it's not going to leave Europe",
    "ChatGPT Could be Pulled from Europe, OpenAI CEO Warns",
    "OpenAI's Altman Clashes With EU Commissioner Over AI Regulation",
    "ChatGPT Could Leave Europe, OpenAI CEO Warns, Days After Urging U.S. Congress For AI Regulations",
    "No plans to leave Europe: OpenAI CEO Sam Altman",
    "Sam Altman reverses threat to ‘leave Europe’ over AI regulations",
    "OpenAI chief Sam Altman accused of ‘blackmail’ in EU dispute",
    "Exclusive: AI rules ‘cannot be bargained’, EU's Breton says after OpenAI CEO threat",
    "First Mover Americas: Digital Currency Group Is Closing Down TradeBlock",
    "DCG to Shut Down Institutional Trading Unit TradeBlock",
    "DCG shutters crypto institutional services subsidiary TradeBlock",
    "Digital Currency Group Pulls the Plug on its Institutional Trading Platform",
    "DCG Packs Up Institutional Trading Platform TradeBlock",
    "DCG announces plans to shut down Tradeblock",
    "DCG to cease operation of its institutional trading subsidiary",
    "Gemini picks Ireland as European headquarters, DCG shutters Tradeblock as bankruptcy woes linger",
    "Tradeblock, DCG Subsidiary, to Be Shuttered Due to Crypto Winter",
    "DCG Sunsets Trade Execution, Prime Brokerage Unit TradeBlock",
    "DCG To Shut Down Institutional Trading Platform TradeBlock on May 31st",
    "Crypto Firm DCG to Close Institutional Trading Platform TradeBlock",
    "Breaking: Digital Currency Group (DCG) Pulls The Plug On TradeBlock: The End Of An Era?",
    "Barry Silbert's DCG Shutting TradeBlock Subsidiary",
    "DCG shutters TradeBlock institutional trading platform",
    "3 new ways generative AI can help you search",
    "Google is starting to let users into its AI search experiment",
    "The best thing about Google's AI search is what's missing: Ads",
    "Google Introduces New Generative AI Capabilities in Search",
    "Google's ChatGPT rival just launched. Here's how to try it",
    "Google Search gets new features powered by generative AI: Here's what's new",
    "Want to try Google's new AI search engine? Join the Search Labs waitlist",
    "How to join Google AI search engine trial?",
    "Google Labs opens its doors in the US",
    "Hands-on with Google's new Search Generative Experience",
    "Google starts opening access to Search Generative Experience",
    "Google starts opening up access to its new generative AI capabilities in Search",
    "Google opens Search Generative Experience to US Search Labs users",
    "Google Now Testing Generative AI for Search",
    "Elon Musk's brain implant company Neuralink approved for in-human study",
    "Neuralink: Elon Musk's brain chip firm says US approval won for human study",
    "Neuralink Receives FDA Approval for In-Human Clinical Trials",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "The FDA will apparently let Elon Musk put a computer in a human's brain",
    "How it feels to have a life-changing brain implant removed",
    "Elon Musk's Neuralink says it has FDA approval for human trials: What to know",
    "Musk's Brain Implant Firm Says US Approves Human Clinical Tests",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Neuralink says it has the FDA's OK to start clinical trials",
    "FDA approves Neuralink's first-in-human clinical trial of brain-implant",
    "Musk's Neuralink Gets OK for Human Trials",
    "Brain implant company Neuralink confirms its first human trials are on the way",
    "Elon Musk can now put his brain chips in people",
    "Elon Musk's Neuralink receives approval from FDA for Human Trials",
    "Neuralink receives FDA's green light for its first human trials",
    "Musk's Neuralink claims it has FDA approval for human trials",
    "Elon Musk's brain implant company Neuralink says the FDA has approved human trials",
    "Musk's Neuralink says cleared for first human test of brain implants",
    "Elon Musk's Neuralink gets FDA nod to test brain implant in humans",
    "FDA gives Neuralink the green light",
    "The FDA gives Elon Musk's Neuralink permission to put brain implants in humans",
    "Musk's Neuralink says cleared for human test of brain implants",
    "Elon Musk's Brain Implant Firm Says U.S. Has Approved Human Tests",
    "Elon Musk's company Neuralink gets FDA nod to test brain implants in humans",
    "Elon Musk's Neuralink Finally Gets FDA Approval For Human Testing",
    "Elon Musk's Neuralink Receives FDA Approval For Brain Chip",
    "Congratulations Neuralink team! https://twitter.com/...",
    "Remarkable to think this is Elon Musk's *least* talked about company... https://twitter.com/...",
    "Me waking up after elon puts a neuralink in my brain https://twitter.com/... [image]",
    "For those who like to have their heads examined https://www.reuters.com/...",
    "what if your brain, but run like twitter https://www.theguardian.com/ ...",
    "Whistleblower Drops 100 Gigabytes Of Tesla Secrets To German News Site: Report",
    "Dutch watchdog looking into alleged Tesla data breach",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Tesla leak reveals thousands of safety complaints",
    "Tesla Files: Insider stole 100 Gb of data and gave it to the media",
    "Former Tesla Employee Accused Of Leaking Thousands Of Company Files",
    "Nvidia Stock Surge Is a Warning to Tesla—and Vice Versa",
    "U.S. Patent and Trademark Office",
    "@paul@social.paulkedrosky.com",
    "JPMorgan has trademarked a name for a ChatGPT-style tool",
    "AI to Pick Stocks? JPMorgan's Move Hints at Banks Following Big Tech's Lead.",
    "JPMorgan Chase Embraces ChatGPT-Inspired AI for Investment Advisory",
    "Trademark/Service Mark Application, Principal Register",
    "This will be interesting to watch play out. https://www.cnbc.com/...",
    "Investment advice from a chat bot? It's on its way. https://www.cnbc.com/...",
    "Of course they are. Best of luck in your marketing campaign. https://twitter.com/...",
    "Congrats on renaming the robo-advisor https://twitter.com/...",
    "People are 100% going to get bilked by this stuff: https://www.cnbc.com/...",
    "WhatsApp is working on introducing usernames to the app",
    "WhatsApp Usernames May Let You Keep Your Phone Number Private",
    "WhatsApp could soon support usernames",
    "WhatsApp will let you set username: Will this improve your privacy",
    "Quickly choose your WhatsApp username to avoid regret later",
    "WhatsApp approaching Update bring Username for everyone",
    "WhatsApp is working on a new feature that could change how you use it",
    "WhatsApp testing username feature to end up revealing user's phone number!",
    "Accessing WhatsApp's settings menu gets easier",
    "WhatsApp to soon introduce username feature. Here's how it will work",
    "WhatsApp to soon let you set up usernames",
    "Get ready to claim your WhatsApp username.",
    "WhatsApp's new update likely to bring usernames; to replace phone numbers",
    "WhatsApp working on allowing users to add usernames in their profiles, claims report",
    "WhatsApp to soon let you choose quirky usernames: Report",
    "WhatsApp could introduce usernames in the future",
    "WhatsApp Could Soon Let You Choose a Username So You Can Keep Your Phone Number Private",
    "WhatsApp could soon let you text users without having their number",
    "WhatsApp is finally adding username support so you can chat without sharing your number",
    "WhatsApp usernames in development, with simplicity and privacy benefits",
    "WhatsApp may soon introduce usernames",
    "WhatsApp may replace phone numbers with usernames",
    "@Tweet_BKelly Users have been asking for this feature for years.",
    "The fight for claiming username on WhatsApp is about to begin! 😬 https://twitter.com/...",
    "WhatsApp could soon support usernames https://www.androidpolice.com/ ... [image]",
    "YouTube Stories are Going Away on 6/26/2023",
    "YouTube is killing Stories",
    "YouTube Stories Heading for the Google Graveyard",
    "YouTube to Sunset ‘Stories’ Feature on June 26th",
    "YouTube to abandon Stories next month",
    "YouTube will shut down YouTube Stories next month: Check Stories' alternatives",
    "“Stories” time for YouTube ends June 26th; platform tells creators to use Posts and Shorts",
    "Time to bid farewell to YouTube Stories",
    "Google is killing a stolen YouTube feature",
    "The limited time YouTube Stories videos are going away for good on June 26",
    "YouTube Stories will be killed off next month",
    "YouTube's Retiring YouTube Stories Next Month",
    "YouTube Stories, Google's clone of Snapchat, is dying on June 26",
    "Add YouTube ‘Stories’ to the list of failed Snapchat copycats",
    "YouTube Stories are going away on June 26th",
    "YouTube is killing off Stories in favor of Shorts",
    "YouTube Dropping Stories As It Shifts Attention To Shorts And Community Posts",
    "Long Story Short: YouTube Stories Are Shutting Down",
    "YouTube Axes Stories Feature and Encourages Creators to Make Shorts",
    "I did not know YouTube had stories. They plan to shut it down. 🤣🤣🤣🤣 https://techcrunch.com/...",
    "Personalized wealth management, built for tech people",
    "Ericsson whistleblower scoops record $279m payout from SEC",
    "Peloton for everyone?  —  Hello hello — an actual IPO!  Cava, the fast-casual Mediterranean …",
    "We are still so early. https://twitter.com/...",
    "same with ketamine https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Thu. 05/25 - Even Presidential Candidates Suffer From Twitter Glitches",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta offers to limit use of ad data to address UK competition concerns",
    "Meta offers to limit use of other businesses' ad data to address CMA concerns",
    "Consultation on proposed commitments in respect of Meta's use of advertising data",
    "Stratasys and Desktop Metal",
    "3D printer maker Stratasys to merge with Desktop Metal in deal valued at $1.8 bln",
    "Why Desktop Metal and Stratasys Stocks Rose Today",
    "Stratasys to Combine with Desktop Metal in Approximately $1.8 Billion All-Stock Transaction",
    "Applied Intuition Acquires Embark Technology, for $71M",
    "ADAS and AV simulation and development",
    "Applied Intuition to Acquire Embark Technology to Enhance Products for AV Development",
    "Applied Intuition to acquire self-driving truck software company Embark for $71M",
    "Embark Technology goes private in $71M deal",
    "Applied Intuition to Acquire Embark Technology for $71 Million",
    "BenchSci Raises $70M in Series D Funding",
    "predictive analytics in R&D goes hard https://twitter.com/...",
    "Ad-Free Twitch Turbo Subscriptions Are Getting Price Hikes Worldwide",
    "Twitch Increases Turbo Price by $3 in the US",
    "Twitch is raising prices for its ad-free Turbo service",
    "@rodhilton@mastodon.social",
    "Twitter says startups can ‘experiment’ with its data for $5,000 a month",
    "Twitter has a new API for start-ups - but it doesn't come cheap",
    "Twitter launches new $5,000 per month API tier for startups",
    "Elon Musk accuses Satya Nadella of violating Twitter policy. Read full text of letter here",
    "Twitter API Pro is on the agenda with its price rather than its features",
    "Twitter introduces Twitter API Pro for startups: Check price, features",
    "Too little, too late. https://twitter.com/...",
    "Landmark $70m Series D funding injection boosts Nymbus",
    "US banking tech provider Nymbus bags $70m Series D funding",
    "OpenAI's ChatGPT app tops 500K downloads in just 6 days",
    "OpenAI's ChatGPT IOS app is now available in 32 countries including India",
    "The ChatGPT App Reaches Half a Million Downloads in Less Than a Week",
    "ChatGPT for iPhone now available in 46 countries and counting [U]",
    "OpenAI's Official ChatGPT App for iPhone Expands to 40+ Countries",
    "ChatGPT's official iOS app releases in the UK",
    "OpenAI's ChatGPT Application Now Available For iOS Users In India",
    "ChatGPT-iOS-App-Goes-Global,- Available-in-Multiple-Countries",
    "Official ChatGPT iPhone app launches in over 40 countries, and it's great news for the EU",
    "ChatGPT iOS app now available in India: How to install and use",
    "OpenAI's ChatGPT app is now available for iOS users in India",
    "OpenAI's ChatGPT iOS App Is Now Available For iPhone, iPad",
    "US Bitcoin Corp selected to manage restructured mining division of Celsius Network LLC",
    "Celsius Picks Fahrenheit As Its Saviour",
    "Fahrenheit To Acquire Celsius' Assets After Successful Bid",
    "Fahrenheit to take over Celsius  —  0°C×9/5+32 = how much money to thaw frozen crypto accounts?",
    "Fahrenheit Wins Bid for Bankrupt Celsius, Will Acquire up to $500M in Liquid Crypto",
    "Fahrenheit buying Celsius? You can't make this up",
    "This is just outstanding https://www.coindesk.com/... via @coindesk",
    "TikTok is testing an AI chatbot called Tako",
    "TikTok testing AI chatbot called ‘Tako’, research firm says",
    "TikTok has been working on its own AI chatbot named ‘Tako’",
    "Meet Tako: AI chatbot of TikTok",
    "TikTok's Testing a New ‘Tako’ AI Chatbot Experience In the App",
    "TikTok explores conversational AI with tests of Tako chatbot",
    "How Long Will the Public's Interest in AI Endure?",
    "TikTok Is Testing an AI Chatbot Named Tako",
    "TikTok's Tako is AI chatbot helps you find videos",
    "TikTok is testing its own AI chatbot called Tako and you have to love that name",
    "TikTok tests AI chatbot for search and discovery",
    "TikTok Is Testing Its Own AI Chatbot Called Tako",
    "Microsoft Calls for a New US Agency and Licensing for AI",
    "Microsoft chief calls for humans to rule AI, safeguard critical infrastructure",
    "Microsoft Calls for A.I. Rules to Minimize the Technology's Risks",
    "Microsoft appeals for a new US agency to regulate AI",
    "Microsoft's Smith Calls for More Regulation of Artificial Intelligence",
    "Governments Need to ‘Move Faster’ on AI Rules, Says Microsoft President",
    "AI trailblazers Microsoft and OpenAI push for regulation",
    "Microsoft's View on AI Governance: A Blueprint for the Future",
    "Microsoft's President Backs New Agency to Regulate ChatGPT, Other AI Systems",
    "Microsoft leaps into the AI regulation debate, calling for a new US agency and executive order",
    "Microsoft chief says deepfakes are biggest AI concern",
    "Microsoft: We Need a New Government Agency to Regulate AI",
    "Microsoft outlines its vision for keeping A.I. in check",
    "Sam Altman's Crypto Project Worldcoin Raises $115M, Led By Blockchain Capital",
    "Worldcoin - Proof of Personhood, World ID, and the Future of Crypto Onboarding",
    "OpenAI CEO raises $115M for crypto company that scans people's eyeballs",
    "OpenAI's Sam Altman raises $115 mln for Worldcoin crypto project",
    "Tools for Humanity Secures $115 Million in Funding Round Led by Blockchain Capital",
    "Blockchain Capital fuels Worldcoin with $115m",
    "Worldcoin developer nets $115 million fundraise led by Blockchain Capital",
    "Can Sam Altman's Worldcoin Be The Future of Crypto Onboarding? | Coingape",
    "Sam Altman's crypto project Worldcoin got more coin in latest $115M raise",
    "@sandofsky@mastodon.social",
    "Twitter engineering boss Foad Dabiri quits day after DeSantis launch glitches",
    "DeSantis' Twitter launch disaster shows Musk's platform isn't ready for prime time",
    "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’",
    "Elon Musk's Event With Ron DeSantis Exposes Twitter's Weaknesses",
    "Twitter is removing view count metrics from videos",
    "Glitches, echoes and ‘melting the servers’ crash DeSantis' campaign launch on Twitter",
    "Elon Musk and Ron DeSantis' fiasco shows they didn't realize Twitter needs TV",
    "Twitter's Flaws Snag Elon Musk's Media Ambitions",
    "What went wrong at Ron DeSantis's US presidential campaign launch?",
    "After flubbed Twitter rollout DeSantis' team talks strategy with donors",
    "Twitter technical issues crash Ron DeSantis's 2024 campaign announcement",
    "Ron DeSantis gambled on Elon Musk and went bust",
    "Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point",
    "Twitter repeatedly crashes as DeSantis tries to make presidential announcement",
    "DeSantis Campaign Debut on Twitter Faces Technical Glitches",
    "Florida Gov. Ron DeSantis' presidential announcement on Twitter plagued by technical problems",
    "Ron DeSantis' Twitter Spaces Conversation With Elon Musk Kicks Off With Major Glitches",
    "Twitter Spaces crashes repeatedly during DeSantis 2024 announcement",
    "Elon Musk's Twitter Event With Ron DeSantis Hits Technical Issues",
    "Florida Gov. Ron DeSantis announces he's running for president in 2024",
    "Start of Ron DeSantis presidential campaign melts down in Twitter problems",
    "Biden capitalizes on DeSantis Twitter Spaces failure",
    "Ron DeSantis Disastrous Presidential Announcement with Elon Musk, Servers Crash",
    "DeSantis Campaign Sputters to Launch as Twitter Spaces Livestream Crashes",
    "DeSantis' 2024 Announcement Delayed By Twitter Glitches",
    "DeSantis' Twitter Campaign Launch Was a Glitch-Filled Disaster",
    "Ron DeSantis ‘Disastrous’ 2024 Launch Marred by Twitter Glitches",
    "Twitter glitches disrupt Ron DeSantis' presidential run announcement",
    "Ron DeSantis Twitter Spaces Event Experiences ‘Rapid Unscheduled Disassembly’",
    "Biden trolls DeSantis over glitchy 2024 launch on Twitter Spaces",
    "Twitter crashes in Ron DeSantis U.S. presidential run announcement",
    "@lauren@mastodon.laurenweinstein.org",
    "Sounds like DeSantis and Musk should have hosted their show on Truth Social servers.",
    "This link works: [Donate to reelect Joe Biden and Kamala Harris]",
    "I wonder if this is a DDOS attack",
    "We had more people join when I played Among Us 👾 https://twitter.com/...",
    "I'm running for president to lead our Great American Comeback. [video]",
    "10 million views. https://twitter.com/...",
    "everyone: wow, he shit his pants elon: yes, but everybody saw it [image]",
    "If only there were some kind of audio/visual medium already installed in every American household.",
    "Ron DeSantis learning what happens when you launch things with Elon Musk [image]",
    "“Before you can be president, unmute yourself”",
    "Ron DeSantis sitting somewhere in a swivel chair 10 out of 10 raging",
    "Musk's talent for fucking over everyone he partners with is by far his most redeeming quality.",
    "Wait, I'm listening now. Is....is he...reading a speech into a Twitter Spaces? omg",
    "holy fucking shit, Ron DeSantis's campaign launch crashed and burned faster than a Tesla",
    "What a small, grumpy claque of incels and whiners.",
    "https://twitter.com/... [image]",
    "Launching my presidential campaign on ham radio",
    "Today in “The important thing is that the rocket cleared the launchpad!” [image]",
    "LOL. TFG https://twitter.com/...",
    "The Jungle Cat, keeping it real. https://twitter.com/...",
    "It'd be like if the escalator had just stopped halfway down...",
    "All Presidential candidates are most welcome on this platform",
    "This is the full video of DeSantis with Hitler and the devil posted on Trump's Instagram [video]",
    "he just destroyed ron and elon [video]",
    "https://twitter.com/... [video]",
    "Ron DeSantis' campaign launch: [image]",
    "Man what https://twitter.com/... [image]",
    "one of the worst websites I've ever seen [image]",
    "can't believe this is how he announced [image]",
    "Against all odds we could actually have a funny campaign season [image]",
    "Trump was a political mastermind for his Twitter use, but DeSantis is “way too online.”",
    "BuzzFeed exploding the watermelon hit 820,000 concurrent viewers in 2016 https://twitter.com/...",
    "Live look at Tucker Carlson, who decided to broadcast his new show on Twitter [image]",
    "I think she might be leaving something out https://twitter.com/...",
    "Sean Spicer vibes here https://twitter.com/...",
    "Well you do want these things to be memorable. 🤷‍♂️ https://twitter.com/...",
    "Fantastic job all around https://twitter.com/...",
    "No advance prep? Idiot. https://twitter.com/...",
    "Ok now Joe from Scranton has entered the room with an epic dunk. https://twitter.com/...",
    "Biden is trolling Musk and DeSantis in real time. https://twitter.com/...",
    "Sony's Project Q offers far more Qs than As",
    "PlayStation Project Q could release in November — what we know",
    "PlayStation Showcase recap: everything announced at today's show",
    "Rumor: PlayStation Handheld Project Q Release Date Revealed",
    "Sony's Project Q PlayStation handheld streams PS5 games, reliant on wi-fi",
    "Sony's Project Q vs. Nintendo Switch - how do they compare?",
    "PS5's Remote Play Portable Will Allegedly Launch in November",
    "PlayStation confirm Project Q (PS5 Streaming screen/controller), to lukewarm reception",
    "PC games unveiled at PlayStation showcase: Alan Wake II, Metal Gear Solid 3 remake, Marathon, more",
    "PlayStation's Handheld Project Q Reportedly Launching In November",
    "PlayStation Showcase 2023 - Accessories Sneak Peek",
    "Sony's ‘Project Q’ Handheld Streams PS5 Games, But Only When You're Home",
    "Sony's PlayStation handheld reportedly arriving in November",
    "Currently scheduled to release mid-late November 2023.",
    "Cannot wait to play Square Enix's Splatoon on my Sony Wii U [image]",
    "wii u did this 11 years ago and you all laughed https://twitter.com/...",
    "Microsoft & NSA expose Chinese-sponsored Volt Typhoon hacking group",
    "Microsoft says China-backed hacker targeted critical infrastructure in Guam, U.S.",
    "Microsoft uncovers Chinese cyberespionage on US Pacific territory",
    "Microsoft warns alleged Chinese hacking group is targeting critical infrastructure",
    "Chinese hackers behind Guam breach have been spying on US military for years",
    "China hits back over Five Eyes blame for US infrastructure cyber attack",
    "China rejects claim it is spying on Western critical infrastructure",
    "National Security Agency/Central Security Service",
    "Microsoft warns of Volt Typhoon, latest salvo in global cyberwar",
    "‘Stay vigilant,’ U.S. warns amid Chinese cyber espionage operation",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "Five Eyes and Microsoft accuse China of attacking US infrastructure again",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?"
]