[
    "@luis_in_brief@social.coop",
    "@GossiTheDog@cyberplace.social",
    "Meta Won't Offer Threads App in the EU on Regulatory Concerns",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "Introducing Threads: A New Way to Share With Text",
    "Threads: Instagram launches app to rival Twitter",
    "Twitter Competitor Threads Hits 5 Million Sign-Ups In 4 Hours, Meta CEO Mark Zuckerberg Says",
    "Meta launches its rival apThreads as it takes aim at Twitter",
    "Threads, Meta's Twitter competitor, is now live",
    "Analysts Are Optimistic About Zuckerberg's Twitter Rival, Launching July 6",
    "Zuckerberg's Twitter clone Threads is live.  Here's what you need to know.",
    "Threads: Five million join new Meta app in matter of hours",
    "CNBC Daily Open: Brace Yourself for Higher Rates",
    "Instagram launches Twitter-like social networking app called Threads",
    "Mark Zuckerberg's Twitter Killer Is Shockingly Viable. Oh No.",
    "Mark Zuckerberg's Sneak Attack: Twitter Rival Threads Launches Earlier Than Expected",
    "Instagram takes on Twitter with Threads, now live on Android and iOS",
    "Instagram's Twitter Rival App, Threads, Goes Live",
    "Mark Zuckerberg just released Threads, Meta's new rival to Twitter. Here's how to sign up",
    "After Threads launch, Mark Zuckerberg's first ‘playful’ tweet at Elon Musk in 11 Years",
    "What you need to know about Threads, Instagram's new Twitter killer app",
    "Instagram's Threads App: What Is It And When Does It Come Out?",
    "What you need to know about Threads, Instagram's new Twitter competitor",
    "Meta Launches Threads, Betting Instagram Mojo Can Take on Twitter With New App",
    "Instagram Launches Threads, a Text-Based ‘Conversation’ App, in Challenge to Elon Musk's Twitter",
    "Instagram Unveils Threads App, a Major Threat to Musk's Twitter",
    "Meta's Threads app is here to challenge Twitter",
    "Meta's Twitter Competitor Threads Is Now Available On Android And iOS",
    "Meta's Threads Is Here. What It Is and How to Use It",
    "How to sign up for Instagram Threads",
    "Meta's Twitter-killer ‘Threads’ is now available",
    "As Twitter Falters, Threads Surpasses 5 Million Sign Ups on Day One",
    "Threads Is Live, as Meta Launches Its Twitter Rival Early",
    "Meta Launches Instagram Threads, its Twitter Killer",
    "Instagram's Twitter competitor, Threads, is available now",
    "Meta Launches Threads, a Text-Based App, in Over 100 Countries",
    "How to Download Threads, Zuckerberg's New Twitter Competitor",
    "Instagram Threads is Coming to Replace Twitter (Updated)",
    "Today's tech news live: Meta's Twitter killer Threads has landed and more",
    "Welcome To ‘Threads,’ Facebook's Twitter Killer",
    "Facebook Owner Meta To Launch Twitter-like ‘Threads’ App",
    "Everything you need to know about Meta's Threads and how it will rival Twitter",
    "Zuckerberg Under Fire in China After Report of Quest Sale Talks",
    "Meta's Twitter competitor Threads won't support ActivityPub at launch",
    "Instagram's Twitter clone, Threads, is available to download again",
    "i hope every body finds the social media home they truly deserve",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Meta's new app was built entirely using this keyboard: [image]",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "threads first impressions It's good Really good Elons in trouble",
    "Threads has been available for 30 minutes and people are already roasting Zuckerberg [image]",
    "Zuck is already using his new app to pitch himself on podcasts [image]",
    "the fact that it will eventually work with decentralized social media apps is really intriguing.",
    "Threads will 100% only be a thing people use for maybe a month",
    "Did Meta just launch a new social media website without a website?",
    "It turns out, building an Instagram account is now 100x more valuable",
    "Folks, Instagram images preview on Threads [image]",
    "Sad to inform the social media interns at brands are at it already [image]",
    "threads feels like for designers, by designers so far https://www.threads.net/...",
    "this is how you return from an 11-year twitter hiatus. https://twitter.com/...",
    "Mark Zuckerberg's first tweet in 11 years and he's trolling Twitter 🙃 https://twitter.com/...",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "Seeing former Twitter employees use Threads is chefs kiss.",
    "Let's do this. Welcome to Threads. 🔥",
    "So is each post a ‘Stitch’?",
    "At this rate Twitter will be reduced to just a bunch of...threads",
    "Twitter = tweets Mastodon = toots Bluesky = skeets Threads = threats",
    "Waiting for my friends to join me [image]",
    "Meta launches Instagram Threads in a direct challenge to Twitter",
    "Australian Financial Review",
    "@amethyst@haunted.computer",
    "@jaredwhite@indieweb.social",
    "Meta's Twitter rival Threads: How to sign up, what it costs and what we know so far",
    "Everything you need to know about Mark Zuckerberg's ‘Twitter killer’",
    "Mark Zuckerberg vs Elon Musk: Meta's Twitter clone Threads sees 5 million signups in 4 hours",
    "Special Episode: Meta's Twitter Rival Arrives, with Adam Mosseri",
    "Twitter rivals pile up with Meta's launch of Threads",
    "Elon Musk vs Mark Zuckerberg: Instagram unveils Threads app, a potential rival to Twitter",
    "Meta Officially Launches Threads—Challenging Elon Musk And Twitter",
    "Here's Everything You Need to Know About Instagram's Twitter Alternative, Threads (For Now)",
    "How to Open Threads Profiles from Mastodon and Twitter Directly in the Threads App",
    "Threads off to a flying start as Zuckerberg posts first tweet in 11 years",
    "Instagram's Threads App Courts Creators; How One Reddit App Is Surviving",
    "Threads, new Twitter rival, sees 5 million sign-ups in four hours of launch",
    "Meta Launches Threads, Provides Insights into Coming Elements",
    "Threads: The New Instagram App Launches Early",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Is Meta's Twitter Alternative a Privacy Nightmare?",
    "Threads, Meta's Twitter alternative, to launch July 6",
    "A day ahead of launch, public gets a glance at Instagram's new Twitter competitor",
    "Zuckerberg Posts First Tweet in 11 Years in Threads Jibe at Musk",
    "Meta's Twitter Rival Could Be Doomed From Day One",
    "Meta's Twitter-like Threads app will not launch in Europe",
    "Meta's Twitter competitor isn't Instagram's first ‘Threads’ app",
    "@jkottke@saturation.social",
    "@chopaganda@shakedown.social",
    "How many days will it take for FB's Threads app to have more users than Mastodon?",
    "What to know about Threads",
    "Adam Mosseri says Meta's Threads app won't have ActivityPub support at launch",
    "Threads app: Instagram owner's Twitter rival logs 5 million users in first hours",
    "Instagram Will Now Let You Add Up to Three Collaborators on Posts and Reels",
    "Meta unveils Threads as ‘friendly’ alternative to Twitter",
    "Threads debuts to crush of users and a question: How do I import followers from Twitter?",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "This is how Elon Musk reacts on launch of Meta's Threads app.. Twitter floods with hilarious memes",
    "Meta's Threads Really Could Be A Twitter Killer",
    "Everything you need to know about Threads, Instagram's Twitter clone",
    "What Threads Could Mean for Meta...and Twitter",
    "Zuckerberg-Musk fight is on: Meta launches ‘Twitter Killer’ Threads app",
    "Threads now available to download: Meta's microblogging alternative to Twitter",
    "Meta officially launches Twitter rival Threads",
    "Threads, the Twitter competitor from Meta, is now available",
    "Meta Launches Threads App, a Challenger to Twitter",
    "Instagram Launches Threads App for iPhone and Android",
    "Meta's new Threads app kicks Twitter while it's down",
    "Meta Moves Up Threads Launch: Here's When The New Social Network Goes Live",
    "Threads: Instagram owner Meta officially launches rival to Twitter in UK",
    "Best Twitter Alternatives from Threads to BlueSky",
    "Threads, Instagram's Twitter competitor, is now available to download",
    "Instagram and Meta launch new app to rival Twitter",
    "What is Instagram Threads and how does it work?",
    "Digiday+ Research Briefing: Instagram hopes Threads will overtake Twitter as top messaging app",
    "Game on: Meta takes on Twitter with new Instagram Threads",
    "Threads — Instagram's answer to Twitter's downfall — is here",
    "Come follow along with GoNintendo on Threads!",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "Meta's Threads Can Have a Larger User Base Than Twitter, but There's a Catch",
    "Meta launches Threads, a standalone text-based social media platform to compete with Twitter",
    "Threads, Meta's Twitter-Killer, Is Now Available",
    "A Look at the Threads UI, and Features Coming to the Twitter Alternative App",
    "Meta's Instagram soft-launches Threads to take on Twitter",
    "Threads from Meta to launch earlier than expected",
    "Twitter tries to fix its latest mistake as Meta readies its Threads launch",
    "Meta won't launch Twitter-like Threads app in European Union due to regulatory concerns",
    "Meta releases Threads to everyone tomorrow, to get it today...",
    "Meta Stock Rises As Facebook Parent Prepares To Launch Twitter Rival",
    "Meta Threads briefly went live earlier than planned",
    "Dead on arrival  —  https://www.platformer.news/ ...  [image]",
    "@georgebsocial @TimSweeneyEpic yea, I agree. I don't like typing / sharing things on a mobile app",
    "A well executed animation like this pull to refresh in Threads just feels sooooo good. 😚 [video]",
    "lol threads currently using the “you have no control over what you see model” [image]",
    "If you delete your threads account your Instagram account also gets deleted 🤡🤡🤡🤡🤡🤡🤡🤡 [image]",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "I'm muting this but here's a screenshot [image]",
    "Zuckerberg's Twitter rival Threads reaches 10M users in 7 hours",
    "Mark Zuckerberg tweeted for first time in 11 years, it's a meme",
    "Threads just passed 2 million sign ups in the first two hours.",
    "Just passed 5 million sign ups in the first four hours...",
    "10 million sign ups in seven hours 🤯",
    "Threads has passed 2M sign ups in the first 2 hours",
    "Introducing Superalignment  —  We need scientific and technical breakthroughs to steer …",
    "OpenAI is forming a team to rein in superintelligent AI",
    "ChatGPT-maker OpenAI says it is doubling down on preventing AI from ‘going rogue’",
    "OpenAI building new team to stop superintelligent AI going rogue",
    "OpenAI doubles down on preventing AI from ‘going rogue’",
    "OpenAI Just Formed A Team To Keep Superintelligent AI Under Control",
    "OpenAI forms research team to tackle dangers of AI ‘superintelligence’",
    "OpenAI bets on new Superalignment team to stop AI going rogue",
    "OpenAI launches team to tackle “superintelligence” alignment",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/...",
    "Four years to save humanity from its own creation... the race is on... https://twitter.com/...",
    "so many grandiose sounding yet vacuous words in one blog post https://twitter.com/...",
    "OpenAI has gone off the deep end. https://openai.com/...",
    "I had to read the mind-numbing word “superalignment” and now so do you. https://twitter.com/...",
    "My alignment is bigger than yours. https://twitter.com/...",
    "“we aim to make sure god has good morals” https://twitter.com/...",
    "How droll. What we really need is a superduperalignment team. https://twitter.com/...",
    "Guys, time to drop a new buzzword https://twitter.com/...",
    "Introducing Superalignment",
    "OpenAI: Introducing Superalignment",
    "Introducing Superalignment - OpenAI blog post",
    "Introducing Superalignment by OpenAI",
    "@twwilliams@curmudgeon.cafe",
    "Limits on Biden officials working with social media firms a ‘weaponisation of the court’ - expert",
    "Biden Appeal Opens a New Front in Battle Over Internet Speech",
    "Ruling Puts Social Media at Crossroads of Disinformation and Free Speech",
    "Why the Biden administration is no longer allowed to talk to social media platforms",
    "Government appeals ruling that restricts feds from contacting social media firms",
    "Biden admin thinks it has divine right to nix conservatives' free speech rights",
    "State Department Cancels Meta Meeting After Court Ruling",
    "State Department Cancels Meetings With Meta After Ban on Government Censorship Collusion",
    "What could go wrong? [embedded post]",
    "Our Plan for a Sustainably Open Social Network",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "Purchase and Manage Domains Directly Through Bluesky",
    "This is a pretty reasonable and inoffensive first paid service.  [embedded post]",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Samsung is holding its next Unpacked on July 26 to unveil new foldables",
    "Galaxy Unpacked 2023 Set for July 26: Join The New Flip Side",
    "Samsung Galaxy Z Fold 5 rumored price drop — how low could it go?",
    "Samsung's next foldable are coming on July 26",
    "Samsung Electronics to hold Galaxy Unpacked event on July 26",
    "The latest Samsung Unpacked event will reveal its latest Galaxy foldable phones July 26",
    "Save $50 when you reserve a Samsung Galaxy Z Fold 5 or Galaxy Z Flip 5 for a limited time",
    "Samsung's Next Foldables Set to Arrive On July 26",
    "Galaxy Z Fold 5 and Flip 5 launch July 26, reservations open today with $50 credit",
    "BREAKING: Samsung announces July 26 Unpacked event with Galaxy Z Flip 5 teaser",
    "Samsung will unveil its new foldables on July 26th",
    "Samsung's summer foldable event officially streams on July 26th",
    "Samsung's Unpacked for new Galaxy Z foldables to be held on July 26 in Seoul",
    "Samsung Galaxy Unpacked event confirmed for July 26: Where to watch and what to expect",
    "Samsung Unpacked Confirmed for July 26: ‘Join the Flip Side’",
    "These Are The Foldable Phones We're Expecting At Samsung Unpacked On July 26",
    "Where to watch Samsung's July 26 Galaxy Unpacked event",
    "New Galaxy Z Flip 5, Z Fold 5 Images Show Continued Hardware Refinements",
    "The Galaxy Buds could be a no-show at Samsung Unpacked",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "America's first law regulating AI bias in hiring takes effect this week",
    "New York City Targets AI Use in Hiring: Anti-Bias Law Explained",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "NYC Cracks Down on AI Use in Hiring Decisions",
    "@maxleibman@mastodon.social",
    "Twitter silently removes login requirement for viewing tweets",
    "Twitter Makes Changes To Show Content To Google, Tweets Returning To Google Search",
    "Why Meta Platforms Was Rising Today",
    "Musk's Puppet? Twitter CEO backs Elon's tweet limit idea, despite backlash from advertisers, users",
    "Twitter users without accounts can see tweets again but not profiles or replies",
    "Twitter's backtracking on its latest misstep",
    "Talk about flippity-floppity!!  —  https://techcrunch.com/...",
    "L, and I cannot stress this enough, OL.  [embedded post]",
    "they figured out what another microservice does [embedded post]",
    "hahahahahahhahahahahahahahhahhahahahaha hahahahahahahahaa https://techcrunch.com/...",
    "Phew. Glad the Very Special Emergency was resolved quickly. https://twitter.com/... [image]",
    "@mranthropology.bsky.social",
    "@campuscodi@mastodon.social",
    "Mastodon Sees Another Surge in Active Users Following Twitter's Rate Limiting",
    "Update on Twitter's Rate Limits",
    "@Techmeme This makes zero technical sense.",
    "translated: we aren't paying our cloud hosting bills https://twitter.com/...",
    "Did Elon fire the PR team too? https://twitter.com/...",
    "Sure, Jan https://twitter.com/...",
    "It's also 💯 bullshit, the rate limit has zero effect on bots. https://twitter.com/...",
    "Did a rate limit write this https://twitter.com/...",
    "CFTC Concludes Former Celsius CEO Mashinsky Broke Rules Before Firm's Collapse: Report",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "Celsius and former CEO Mashinsky broke US rules, CFTC concludes: Bloomberg",
    "CFTC Concludes Bankrupt Crypto Lender Celsius Broke Rules, Lawsuit Coming?",
    "CFTC investigators conclude ex-Celsius CEO Mashinsky broke US rules: Report",
    "CFTC Finds Celsius And Alex Mashinsky Guilty Of Breaking US Rules",
    "Former Celsius CEO Accused Of Breaking U.S. Laws Before Collapse",
    "Report: CFTC Considering Lawsuit Against Celsius Network and Former CEO",
    "CFTC investigators conclude Celsius, ex-CEO broke rules - Bloomberg News",
    "CFTC Investigators Conclude Crypto Lender Celsius, Ex-CEO Broke Rules",
    "Free Figma template of onboarding & activation designs",
    "Spotify cutting off remaining customers paying through the App Store",
    "Spotify stops accepting payments that were set up through Apple's App Store",
    "Spotify kicks off legacy subscribers still paying through the App Store",
    "Grandfathered Spotify Premium subscribers can no longer pay via the App Store",
    "Spotify Cuts Off Existing App Store Subscribers As Ongoing Feud With Apple Continues",
    "Spotify Subscribers No Longer Allowed to Pay Through App Store",
    "Spotify Stops Accepting Payments Set Up Via Apple's App Store",
    "Microsoft Teams Exploit Tool Auto-Delivers Malware",
    "New Microsoft Teams “TeamsPhisher” Bug Allows Attackers to Deliver Malware to Users",
    "New tool exploits Microsoft Teams bug to send malware to users",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Automate your routine tasks using Zoho Cliq",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Wed. 07/05 - Twitter Chaos: The Real Fireworks",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Pentagon is testing whether AI can plan response to an all-out war",
    "@Techmeme @KatrinaManson 😂",
    "Declining Royalty Payments: Nansen Study Highlights NFT Creator's Concerns",
    "Blur founder defends platform amid NFT market slump",
    "Did Blur Really Crash the NFT Market?",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "Vimeo announces departure of CEO",
    "Video platform Vimeo's CEO Anjali Sud to step down",
    "Vimeo Announces Departure of Anjali Sud as CEO, Appointment of Adam Gross as Interim CEO",
    "ZIRP was nuts [embedded post]",
    "BREAKING: Vimeo is still around https://twitter.com/...",
    "@danilo.redeem-tomorrow.com",
    "Gfycat.com shuts down on September 1 and all Gifs will be taken down",
    "Gfycat is shutting down on September 1st.Time to save all your Gfycat GIFs. …",
    "Gfycat, the Snap-owned GIF hub, shuts down on September 1",
    "Prepare for a meme massacre: Snap snuffs out Gfycat in September",
    "Booming traffic to OpenAI's ChatGPT posts first ever monthly dip in June -Similarweb",
    "ChatGPT's Success Hits a Speed Bump With Decreasing Traffic",
    "OpenAI yanks Bing integration from ChatGPT after users “exploit” bug to bypass paywalls",
    "ChatGPT's Website Traffic Dipped for the First Time Since Its Launch,",
    "ChatGPT's web browser was too good, so its creators blocked it",
    "CADDi Raises $89 Million to Expand Procurement Platform and Cloud Service",
    "CADDi Raises $89M in Series C Funding",
    "CADDi Lands $89M In Sagging Supply Chain Management Sector",
    "CADDi reels in $89M to make custom industrial equipment parts easier to procure",
    "Actively exploited vulnerability threatens hundreds of solar power stations",
    "Critical FortiGate Vulnerability Affects 336,000 Vulnerable Firewalls",
    "Generative AI Games Raise Copyright Ownership Concerns",
    "Binance Australia's Offices Searched by Financial Regulator: Bloomberg",
    "Binance Australia Offices Searched By Regulators in Derivatives Probe",
    "Binance Australia Under Fire Again as Offices Searched",
    "Binance Office Searched by Australian Regulator",
    "Fairphone 4—the repairable, sustainable smartphone—is coming to the US",
    "Fairphone 4: A Phone For Those Who Care About Sustainability, Not Megapixels",
    "Sustainable Fairphone 4 set to arrive to the US, starting at $630",
    "Fairphone 4, the Smartphone with User-Replaceable Modular Hardware, Now Available in the US",
    "The Fairphone 4 comes to the US - but it's not running the Android you know",
    "This $600 Android phone has one big advantage over the iPhone",
    "Repairable, Sustainable Fairphone 4 Is Finally Making Its Way To The US",
    "Fairphone 4—the repairable, sustainable smartphone, is coming to the US",
    "The environmentally conscious Fairphone 4 is finally coming to the US",
    "Amazon's Citadel cost $250 million but absolutely bombed: report",
    "Next: Tim Cook / Apple TV+ https://twitter.com/... [image]",
    "Amazon CEO Asks His Hollywood Studio to Explain Its Big Spending",
    "Amazon CEO Asks His Hollywood Studio To Explain Its Big Spending",
    "Pro-Russian hackers target Port of Nagoya, disrupting loading of Toyota parts",
    "Pro-Russian hackers target Japan's top port handling Toyota trade",
    "LockBit louts unload ransomware at Japan's most prolific cargo port",
    "Major Japanese port suspends operation following ransomware attack",
    "Russian Ransomware Group Shuts Down Major Japanese Port",
    "Japan's Port of Nagoya paralysed in LockBit's latest ransomware rampage",
    "Nagoya Port Faces Disruption After Ransomware Attack",
    "Japan's biggest port, Nagoya, hit by suspected cyberattack",
    "Japan's largest port stops operations after ransomware attack",
    "Japans largest port stops operations after ransomware attack"
]