[
    "Montana Governor Signs Total Ban of TikTok in the State",
    "Montana becomes 1st state to ban TikTok; law likely to be challenged",
    "Montana becomes first US state to ban TikTok",
    "TikTok is now banned in Montana",
    "TikTok faces first US state ban in Montana",
    "Montana governor bans TikTok. But can the state enforce the law?",
    "Montana Becomes First State to Ban TikTok, Setting Up Legal Test",
    "Montana bans Telegram, WeChat, and Temu from government devices",
    "Montana becomes first state to ban TikTok, but court challenges are likely",
    "TikTok has been banned in Montana, but chances of the law surviving are slim",
    "Montana just banned TikTok",
    "Montana becomes first state to ban TikTok",
    "Montana's TikTok ban is unconstitutional and makes no sense",
    "Montana becomes first US state to fully ban TikTok",
    "Montana's governor signs bill banning TikTok",
    "Montana Governor Signs TikTok Ban Into Law",
    "Montana governor bans TikTok",
    "Montana becomes first state to ban TikTok after governor signs bill into law",
    "First US state officially bans TikTok, $10,000 fine per violation",
    "Montana legislature passes TikTok ban (Update: Ban is now law)",
    "Montana Is The First State To Fully Ban TikTok",
    "Is the US banning TikTok? Montana governor signs bill to ban app",
    "Montana bans TikTok for all residents",
    "Montana governor signs ban on second trimester abortion procedure",
    "is this in any way enforceable - or just pure GOP theatre? https://www.nytimes.com/...",
    "Way to waste everyone's time with dumb stunt politics, Montana. https://www.nytimes.com/...",
    "Tether Says It Will Buy Bitcoin for Stablecoin Reserves Using Realized Profits",
    "Best Crypto to Buy Now 17 May - Conflux, Render, Litecoin",
    "Tether Bets On Bitcoin: Allocates Up To 15% Of Profits For BTC Purchases",
    "Tether Pledges to Plow 15% of Profits into Bitcoin",
    "Billions of Dollars To Flow Into Bitcoin As Tether Announces Up to 15% of Profits Will Go to BTC",
    "USDT Issuer Tether to Enhance Reserves via Regular Bitcoin Purchase",
    "Tether To Invest 15% Of Its Net Monthly Profits in Bitcoin",
    "Tether's Latest Investment Strategy: Make Profits, Buy Bitcoin",
    "Tether to Use 15% of Profits to Grow Bitcoin Holdings",
    "Tether uses Bitcoin to strengthen its reserves",
    "Tether shifts investment focus to Bitcoin",
    "Tether USDT to strengthen reserves with Bitcoin purchase",
    "Tether to Purchase Bitcoin as Part of Reserves Strategy Shift",
    "New survey says Bitcoin is safer than the US dollar — Watch The Market Report",
    "Tether bets big on Bitcoin plans to invest up to 15% of profits in BTC",
    "Stablecoin Issuer Tether Reveals Plan to Allocate Profits Into Bitcoin",
    "Tether Bought $1.5 Billion Bitcoin, Will Buy More",
    "Breaking: Tether To Invest Monthly Net Profit Into Bitcoin",
    "Tether Reveals Strategy to Invest up to 15% of Profits in Bitcoin",
    "Tether buys bitcoin with a portion of its net profit to back USDT stablecoin",
    "Tether Will Buy Bitcoin: Allocating 15% of Net Realized Operating Profits Regularly in BTC",
    "Tether to Allocate up to 15% of its Profits Towards Purchasing Bitcoin",
    "This will end well https://twitter.com/...",
    "Logitech Repair  —  Broken Gear?  We've Got the Fix.  —  Click your device's model to find …",
    "Logitech Partners with iFixit to Advance Circularity Goals",
    "iFixit to Offer Genuine Parts, Repair Guides for Logitech Devices",
    "Logitech, iFixit to offer parts to stop folks binning their computer mouse",
    "Logitech partners with iFixit to enable more DIY repairs",
    "Logitech partners with iFixit for self repairs, pointing to high global e-waste levels",
    "Logitech taps iFixit to sell mouse parts for DIY repairs",
    "Logitech joins the growing list of companies with self-repair programs",
    "Logitech Partners with iFixit to Improve Repairability and Address E-Waste Challenge",
    "Logitech Teams Up With iFixit To Support User Repairs",
    "Logitech Teams Up With iFixit to Offer Mouse Self-Repair Kits",
    "Logitech and iFixit partner to reduce e-waste",
    "Logitech partners with iFixit to let you repair your own mouse",
    "Logitech and iFixit team up to let you officially replace your MX Master battery and more",
    "Logitech partners with iFixit to offer spare parts and repair guides",
    "Logitech Teams With iFixIt On Self-Repair Program For These 11 Mouse Models",
    "Logitech doesn't want you to buy new mice, it wants you to fix the one you have",
    "Logitech teams up with iFixit to help you repair broken peripherals",
    "How U.S. adults on Twitter use the site in the Elon Musk era",
    "Pew: 60% of U.S. Twitter users have ‘taken a break’ from the platform in the past year",
    "Twitter's top users are posting less since Musk takeover last year, Pew Survey shows",
    "New Study Shows that 25% of Twitter Users Don't Expect to Still be Using Twitter in 12 Months Time",
    "US adults are spending less time on Twitter since Elon Musk took over",
    "Majority of U.S. Twitter users took a break from the platform in past year: poll",
    "TPG, Francisco Partners In Talks to Buy Software Firm New Relic",
    "New Relic Surges On Report Private Equity Firms Readying Bid",
    "New Relic in talks to be sold",
    "Software company New Relic in talks to be sold - WSJ",
    "FTC says popular fertility app gave advertisers pregnancy data without permission",
    "Fertility app fined $200,000 for leaking customers health data",
    "FTC says fertility tracking app Premom shared sensitive health data with third parties",
    "FTC Fines Fertility App Vendor, Bars It From Data-Sharing",
    "San Francisco Business Journal",
    "Ripple Takes on the Crypto Custody Market with Metaco",
    "Ripple buys crypto custody firm Metaco for $250 million",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for $250M",
    "Ripple Buys Crypto Custody Firm Metaco for $250M",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for US$250M",
    "San Francisco's Ripple buys Swiss crypto custody startup for $250M",
    "Latest global payments news",
    "Crypto firm Ripple buys Swiss startup as SEC crackdown forces companies to consider overseas moves",
    "Ripple Acquires Crypto Custody Firm Metaco for $250M in Tokenization Push",
    "Crypto firm Ripple acquires custody provider Metaco for $250m",
    "Ripple Acquires Swiss Crypto Custody Platform Metaco for $250M as Part of Push toward Tokenization",
    "Ripple acquires Swiss blockchain custody firm Metaco for $250M",
    "Ripple Acquires Crypto Custody Provider Metaco for $250M",
    "Ripple Spends $250,000,000 on Institutional Digital Asset Custody Firm Metaco",
    "Ripple acquires Metaco for $250M to diversify services into crypto custody",
    "Ripple Acquires Metaco in $250M Crypto Custody Deal, XRP Price Surge Nearly 6%",
    "Ripple buys controlling interest in Metaco, a digital technology company",
    "Ripple Acquires Crypto Custody Firm Metaco In $250 Million Deal",
    "Ripple Buys Swiss Crypto Custodian Metaco for $250 Million",
    "Ripple Acquires Crypto Custody Provider Metaco For $250M As XRP Lawsuit Nears End-Game",
    "Ripple Acquires Swiss-based Digital Asset Custody Provider Metaco",
    "Ripple acquires Swiss blockchain custody firm Metaco for $250 Million",
    "Why US Crypto Firm Ripple's $250M Acquisition Of This Swiss Company Matters",
    "Ripple acquires Switzerland-based crypto custody startup Metaco for $250 million",
    "Ripple Buys Crypto Custody Firm Metaco for $250 Million",
    "Ripple acquires crypto custody startup Metaco for $250 million",
    "Ripple acquires crypto custodian Metaco for $250 million",
    "Ripple Labs acquires digital asset custody provider Metaco for US$250 mln",
    "Ripple acquires crypto custody firm Metaco in $250M deal",
    "Ripple shells out $250 million as it acquires crypto custody firm Metaco",
    "Breaking: Ripple Acquires Metaco for $250M | Coingape",
    "Surprising no one, Google will reportedly use generative AI for ads and customer service",
    "Inside GitHub: Working with the LLMs behind GitHub Copilot",
    "What's more important for training AI — data or compute?",
    "From “you are the product” to “you are the input into a LLM” https://twitter.com/...",
    "Report: Snowflake is in advanced talks to acquire AI search startup Neeva",
    "Amazon unveils a new lineup of Echo devices—here's your first look",
    "Amazon pops out a new Echo smart speaker",
    "Amazon's 2023 Echo Show is faster and offers improved audio",
    "Amazon Launches $40 Eero-Equipped Echo Pop Speaker, $50 Echo Buds",
    "Amazon undercuts the Echo Dot with the $40 Echo Pop",
    "Amazon adds 4 products to Echo lineup: Alexa gets new speakers, displays, and earbuds",
    "Amazon Echo News (2023): Echo Show 5, Echo Buds, Echo Pop",
    "Amazon's latest Echo Buds have an all-new design and much cheaper price",
    "Amazon overhauls Echo Buds line to create new budget-friendly model",
    "New Amazon Echo Devices Are Up for Preorder",
    "Alexa-Enabled Device Sales Pass 500M As Amazon Unveils New and Upgraded Echo Devices",
    "A fresh batch of Amazon Echo devices is here and one of them is brand new!",
    "Amazon announces new Echo with funky design and revamped earbuds",
    "Amazon Refreshes Echo Lineup With New Echo Pop, Redesigned Echo Show 5, and More",
    "Amazon's redesigned Echo Buds are only $50",
    "Amazon Echo Lineup Expands With Next-Gen Buds, Pop, And Show 5",
    "Amazon Unveils New Gadgets as AI Race Heats Up",
    "Amazon expands Echo lineup with new smart speaker, earbuds, and more",
    "Amazon Introduces Four All-New Echo Devices",
    "Amazon's new Echo Pop speaker looks cheap and cheerful at $40",
    "Amazon Announces New Alexa-Powered Echo Devices",
    "Amazon expands its Echo portfolio with a new speaker and a few hardware upgrades",
    "Amazon launches new Echo devices, including a $40 smart speaker and inexpensive wireless earbuds",
    "Don't like Echo Dot? Amazon has two new smart speakers for you",
    "Today Amazon Introduced 4 All-New Echo Devices with multiple redesigns",
    "Amazon unveils Echo Pop, new Echo Buds; reports >500M Alexa device sales as AI upends market",
    "Amazon unveils the $40 Echo Pop, a semi-spherical smart speaker",
    "Amazon releases four new Echo devices & discloses over half-billion sold",
    "Beats Studio Buds Plus review: A worthy upgrade",
    "Status Between 3ANC review: Great audio in a bulky package",
    "Beats Studio Buds Plus Review: Transparently Special",
    "Beats debuts the Studio Buds + with a transparent design and improved ANC",
    "First Impressions of the Beats Studio Buds +: Don't Believe the Hype",
    "The Beats Studio Buds+ deliver better ANC and a truly standout design",
    "Beats Studio Buds+ hands-on review",
    "Beats Studio Buds + review: A little bit better in every way",
    "Beats launches $169 Studio Buds + with a transparent option",
    "Apple's Beats launches Studio Buds Plus - and makes them transparent",
    "The Beats Studio Buds + Are Apple's Best Wireless Headphones Bargain",
    "Beats is back with new Studio Buds Plus that are made by Apple but work with Android",
    "Beats Studio Buds+ vs Apple AirPods Pro 2: Which should you buy?",
    "Beats Studio Buds+ debut, Project Titan theft",
    "Beats Studio Buds + Review",
    "Beats Studio Buds+ review: clearly better buds",
    "Beats Studio Buds+ review: Immersive soundscapes",
    "Beats Studio Buds+ are available to order now in Canada",
    "Beats Studio Buds+ vs Studio Buds: what's the difference?",
    "Beats Studio Buds + Deliver Improved Performance and a Transparent Design Option for $169.99",
    "Beats Studio Buds+ now available to order with better ANC, transparent option",
    "The Beats Studio Buds+ Are Here With Better ANC And Battery Life",
    "Beats' New Earbuds Are Inspired by Nothing's Transparent Design",
    "Hands-on: Beats Studio Buds+ are the transparent AirPods we wish Apple would make",
    "Apple Unveils Beats Studios Buds+",
    "Beats Studio Buds+ Review: A Snug-Fitting Sweet Spot For ANC Earbuds",
    "Review roundup: New Beats Studio Buds+ win with cool clear case and audio upgrades",
    "Beats Studio Buds Plus have landed and it's clear they're a hit",
    "Google Pixel Buds Pro vs Apple AirPods Pro 2: Which should you buy?",
    "Can't beat Verge photography. So good. Clear all the gadgets again. https://twitter.com/...",
    "Google might soon let you use your Pixel phone as a dashcam",
    "It looks like Google's working on a dashcam feature for Android phones",
    "Google could transform your Android phone into a dashcam with future update",
    "Your Pixel phone may replace your dash cam with this potential new feature",
    "Google wants to turn your Android phone into a dash cam",
    "Google is working on a new feature that turns Pixel phones into dashcams",
    "Got an Android or Google Pixel Phone? Get Ready to Say Goodbye to Your Sub-Par Dashcam!",
    "Google might let you use your Pixel phone as a dashcam",
    "Google Turning Your Pixel Phone Into a Dashcam",
    "Google wants to turn your Pixel phone into a car dashcam",
    "Google is working on making your Android phone into a dashcam",
    "Your Google Pixel phone could soon double as a very basic dash cam",
    "Google's turning your Pixel Phone into a dashcam",
    "Google is working on a dash cam mode for Pixels, and here's how it works",
    "Google is adding the ability to use your Pixel as a dashcam",
    "Google Pixel phones may soon work as dashcams, and it makes total sense",
    "Google Could Activate Dashcam Mode on Android and Pixel Soon",
    "Meta faces record privacy fine for data transfers to the US",
    "Meta to face record EU privacy fine over Facebook data transfer to US",
    "Meta likely to face record EU fine: report",
    "Netflix Pitches Advertisers as Ad Tier Trails Smaller Rivals",
    "Netflix touts nearly 5M monthly active users for ad-supported tier",
    "Netflix Says It Has 5 Million Users for Its Cheaper Plan With Ads",
    "Netflix ad tier now has nearly 5 mln monthly active users",
    "Netflix Says It Has 5 Million Ad-Supported Viewers, but Doesn't Reveal Subscriber Figures",
    "In Virtual Upfront, Netflix Says It Has Nearly 5 Million Monthly Ad-Tier Users",
    "Netflix 2023 Upfront Takeaways: Streamer Hits Scripted Drama Hard When TV Cannot",
    "Netflix Now Has Almost 5 Million Subscribers To Its Cheaper Ad-Supported Plan",
    "SEC warns that Filecoin ‘meets definition of a security’ — Grayscale",
    "SEC Believes Filecoin Is a Security, Grayscale Warns Investors",
    "Grayscale: SEC staff believe Filecoin ‘meets the definition of a security’",
    "SEC staff suggest Filecoin (FIL) is a security: Grayscale",
    "SEC clarifies Filecoin's FIL token as security, Greyscale pushes back",
    "SEC deems Filecoin a security, asks Grayscale to withdraw trust registration",
    "US SEC Says Filecoin Is a Security in Comment Letter to Grayscale",
    "Introducing New Features to Make the Most of Your Instagram Experience",
    "Instagram users can finally comment on posts with GIFs",
    "Instagram to finally let users comment on posts using GIFs",
    "Instagram Now Lets Everyone Use GIFs In Comments",
    "Meta Announces Coming Reels Editing Tools and India Showcase Event",
    "Instagram will now allow you to respond to posts with a GIF and further edit your Reels",
    "Instagram will soon support GIF comments on posts and Reels",
    "GIFs are finally coming to Instagram comments",
    "Commenting gets animated with GIFs on Instagram",
    "Instagram comments can now be overrun by GIFs",
    "Instagram rolls out new features - gif comments, edit tools",
    "You can now comment with GIFs on Instagram, here's how",
    "Instagram will Now Let Users Post GIFs in Comments",
    "Instagram enables GIF comments on posts, Reels; previews Gifts, Reels editing, more",
    "Instagram enables the ability to comment using GIFs",
    "instagram announcing gifs in the comments section feels very 2016",
    "huge news for aunts everywhere https://twitter.com/...",
    "*checks date* Welcome to 2023 https://twitter.com/...",
    "Stability AI Releases StableStudio, the Open-Source Future of DreamStudio",
    "Stability-AI / StableStudio Public",
    "Stability AI's StableStudio Wants to Be the One-Stop-Shop for ‘Open Source’ AI",
    "Latest moves show Stability AI is fully committed to open source — well, mostly",
    "Stability AI releases StableStudio to become an open-source platform for AI",
    "Failed Crypto Broker Voyager Digital Cleared to Start Repaying Customers' Frozen Funds",
    "Voyager liquidation could start Friday, customers could see cash and crypto starting June 1",
    "Voyager bankruptcy plan approved, customers may recover 35.7% of claims initially",
    "Voyager Digital Customers Left High And Dry With Only 35% Crypto Deposit Recovery",
    "Hope for investors as Voyager Digital gets green light to repay frozen funds",
    "Projecting what the future may hold following Cisco's earnings results",
    "Cisco Reports Third Quarter Earnings",
    "Cisco CEO Sees Growth From Security, Software, Generative AI",
    "Cisco beats quarterly revenue estimates",
    "Cisco earnings beat, but the stock is falling on concerns about declining orders",
    "Cisco Systems Reports Earnings Today. It's All About Orders.",
    "How This Customer Frill Could Boost Cisco Earnings For July Quarter",
    "Cisco's Q3 posts strong networking gear sales, ups outlook",
    "The first AI navigator for your entire network",
    "European telcos draw up proposal to charge Apple, other Big Tech firms for EU 5G rollout",
    "Network Fee Proposals Will Ultimately Hurt European Businesses and Consumers",
    "The Dangers of Google's .zip TLD",
    "Cybersecurity experts flag potential risks affecting new top-level domains",
    "Don't panic.  Google offering scary .zip and .mov domains is not the end of the world",
    "Phishing attacks already using the .zip TLD",
    "Security researcher: New zip and mov top-level domains from Google pose phishing risks",
    "Hackers are using a devious new trick to infect your devices",
    ".zip TLD  —  Christina Yeh (tweet, via Hacker News):  —  Google Registry has launched …",
    "Want a new Google zip domain? It could be a serious security risk",
    "New TLDs: Not Bad, Actually",
    "Is the new .zip top-level domain a cyber security risk?",
    "Some recently registered .ZIP domains 🤭 [image]",
    "coming out with a .zip TLD seems like a real chaos move",
    "There's no way this will go badly https://twitter.com/...",
    "whose idea was this? https://twitter.com/...",
    "lol dont go to https://42.zip/ https://twitter.com/...",
    "@campuscodi@mastodon.social",
    "Lancefly: Group Uses Custom Backdoor to Target Orgs in Government, Aviation, Other Sectors",
    "Sophisticated Merdoor backdoor long used in Lancefly APT attacks",
    "New APT targets South and Southeast Asia with custom-written backdoor",
    "Stealthy MerDoor malware uncovered after five years of attacks",
    "Lancefly APT uses powerful Merdoor backdoor in attacks on Asian orgs",
    "Researchers Uncover Powerful Backdoor and Custom Implant in Year-Long Cyber Campaign",
    "Lancefly APT Custom Backdoor Targets Government and Aviation Sectors",
    "Threat Actor Uses Merdoor Backdoor to Hit Asian Orgs",
    "Lancefly APT Targeting Asian Government Organizations for Years",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "ProTips: 4 reasons why integrating your CRM and sales engagement tool is crucial for sales success",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "TikTok: Inspire creativity and bring joy.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Wed. 05/17 - Open Source Vs. Centralized AI, Part II",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Socket Adds ChatGPT to Its Vulnerability Detection Arsenal",
    "IBM and Google commit $150M to quantum computing research",
    "A quantum computing partnership with the University of Chicago and the University of Tokyo",
    "Minnesota bill regulating Uber and Lyft advances",
    "Uber will now let teens ride in cars alone",
    "Uber Taps New User Base With Ride, Delivery Option For Teens",
    "Here's everything Uber just announced at its annual Go/Get product event",
    "Uber Wants to Be Your Kids' Chauffeur",
    "Uber puts family (even teens) at the center of its new products and features",
    "Uber will start rolling out teen accounts with safety features next week",
    "You can now hail an Uber by calling a number",
    "Uber to allow Canadian teens to set up ride-share accounts this summer",
    "Uber is adding new features to make group rides and activities cheaper and easier to split",
    "Uber for teens will accept unaccompanied minors",
    "Parents can now stalk their kids with new Uber features",
    "Uber rolls out updates, including a way for teens to book rides",
    "New paid family, medical leave law for rideshare drivers could increase fares",
    "India introduces a $2B program to boost local IT hardware production",
    "iPad production in India likely to start soon, as Apple gets tax deal",
    "India devises bumper scheme for laptop, tablet makers with four-fold jump in incentives",
    "India expands production incentive plan for IT products to $2 bln",
    "India launches $2 billion incentive plan to court laptop, tablet makers like Apple",
    "India introduces $2B incentive package to boost IT hardware",
    "India Launches $2 Billion Drive To Woo Laptop Makers Like Apple",
    "China has too much invested in AI to smother its development",
    "International insurtech bolttech valued at $1.6 billion in Series B up-round",
    "bolttech Raises US$196M in Series B; Valued at US$1.6 Billion",
    "Insurtech Unicorn Bolttech Raises $196 Million, Nudging Up Valuation",
    "Insurtech Unicorn Bolttech Raises $196 Million",
    "SG insurtech unicorn bolttech raises $196m Series B round at $1.6b valuation",
    "Ministers looking at body-worn facial recognition technology for police",
    "One of the many reasons I quit my job in facial recognition. https://twitter.com/...",
    "Japanese security integration company Secom invests $192M into Eagle Eye and Brivo",
    "Bethesda's Brivo just raised $92.5M in a dual investment round",
    "Brivo and Eagle Eye Networks announce $192 million investment",
    "Poll: 61% of Americans say AI threatens humanity's future",
    "Most Americans Consider AI a Threat to Humanity, New Poll Finds",
    "Most Americans Fear AI Is A Threat To Humanity And This Poll Proves It",
    "6 in 10 view AI as threat to humanity's future: poll",
    "70% of Trump Voters Think AI Threatens Humanity, Poll Finds",
    "Shein's Valuation Drops 34% in $2 Billion Funding Round",
    "Report: Shein Raises $2 Billion but Slashes Valuation by 1/3",
    "Fashion giant Shein raises $2 billion but lowers valuation by a third",
    "Volkswagen China Responds to Talks with Huawei Over the Use of Its Software",
    "German Volkswagen met Huawei for car software",
    "Google's new “inactive account” policy won't delete years of YouTube videos",
    "YouTube's recommendations send violent and graphic gun videos to 9-year-olds, study finds",
    "YouTube's recommendations are leading kids to gun videos, report says",
    "YouTube found to push content about guns to children watching games videos",
    "Okay, Google, How Are Your Fancy Math Recommendation Procedures Working? Just Great, You Say",
    "Study shows YouTube is recommending gun videos to young gamers",
    "YouTube Accused Of Pushing Violent Content To Children",
    "Disturbing Results: YouTube's Algorithm Recommends Harmful Content to Young Viewers",
    "Study finds YouTube algorithm can push violent, graphic videos to young children",
    "Kishida to meet South Korea, Taiwan, U.S. chip company execs",
    "Canada, South Korea sign critical minerals deal in bid to reduce China dependence",
    "Ex-Apple Engineer Indicted in Crackdown on Flow of Restricted Tech to China, Russia",
    "PSA: time to recycle your old Wemo smart plugs (if you haven't already)",
    "‘FriendlyName’ Buffer Overflow Vulnerability in Wemo Smart Plug V2",
    "Belkin smart plug plagued by security flaw, with no fix in sight",
    "Serious Unpatched Vulnerability Uncovered in Popular Belkin Wemo Smart Plugs",
    "Critical security flaw is exposing older Wemo Smart Plugs to hackers",
    "Unpatched Wemo Smart Plug Bug Opens Countless Networks to Cyberattacks",
    "PSA: Older Wemo Smart Plugs Have Vulnerability That Leaves Them Open to Attack",
    "Researchers find exploit in Belkin's Wemo Mini Smart Plug V2",
    "International Business Times",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "How Apple's App Store saved consumers from $2b fraud in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "Apple Blocked 1.7 Million Applications From App Store in 2022",
    "Apple blocked over $2B of fraudulent App Store transactions in 2022",
    "Apple Boots a Half-Million Developers From Official App Store",
    "Record $2 billion in fraudulent App Store transactions blocked in 2022, Apple says",
    "Apple: App Store Blocked $2+ Billion in Fraud in 2022",
    "Apple's App Store is a fortress; over $2 bn in fraudulent transactions in 2022 [details]",
    "App Store's anti-fraud measures halt more than $2 billion in 2022",
    "App Store stopped over $2 billion in fraudulent transactions in 2022, Apple claims",
    "Apple's App Store stopped over $2 billion in fraudulent transactions last year",
    "Apple Touts Fraud and Abuse Prevention in the App Store",
    "Apple's App Store prevented more than $2 billion worth of fraudulent transactions in 2022",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple says it blocked over $2 billion in App Store fraud in 2022",
    "Apple says its App Store prevented over $2B in fraudulent transactions last year",
    "Apple rejected nearly 1.7 million App Store submissions in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "@DavidNielsen@mastodon.social",
    "Apple accessibility improvements welcomed by disabled people, with more opportunities ahead",
    "iPhones will be able to speak in your voice with 15 minutes of training",
    "iOS 17 Will Let You Create a Voice Sounding Like You in Just 15 Minutes",
    "Apple Previews New Accessibility Features for iPhone, iPad",
    "Apple Previews Major New Accessibility Features for iOS",
    "Apple's 2023 Accessibility Feature Preview",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "Your iPhone will soon be able to speak with your voice",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple Adds Live Speech and AI-Based Voice Generation in iOS 17",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Apple previews new Assistive Access, Live Speech, and other accessibility coming in iOS 17",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple to Expand Accessibility Options in 2023",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "@viticci@mastodon.macstories.net",
    "@blakereid@mastodon.lawprofs.org",
    "@johnvoorhees@mastodon.macstories.net",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2"
]