[
    "International Business Times",
    "@sandofsky@mastodon.social",
    "Twitter technical issues crash Ron DeSantis's 2024 campaign announcement",
    "Elon Musk's ‘historic’ Twitter event with Ron DeSantis struggles with technical glitches",
    "Elon Musk fails to launch Ron DeSantis in disastrous Twitter Space",
    "Glitches, echoes and ‘melting the servers’ crash",
    "Elon Musk's Event With Ron DeSantis Exposes Twitter's Weaknesses",
    "The Morning After: Sony reveals its PS5 streaming handheld",
    "Twitter repeatedly crashes as DeSantis tries to make presidential announcement",
    "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’",
    "Florida Gov. Ron DeSantis' presidential announcement on Twitter plagued by technical problems",
    "Elon Musk's Twitter splutters on Ron DeSantis's big moment",
    "DeSantis Campaign Debut on Twitter Faces Technical Glitches",
    "Ron DeSantis' Twitter Spaces Conversation With Elon Musk Kicks Off With Major Glitches",
    "Awkward Silence: Ron DeSantis's Bold Twitter Gambit That Flopped",
    "The Hill's Morning Report — Shaky start: DeSantis's 2024 launch marred by glitches",
    "Outages, garbled audio: DeSantis's 2024 launch marred by Twitter tech meltdown",
    "Ron DeSantis's presidential campaign launch was an infomercial for Twitter",
    "Elon Musk breaks DeSantis campaign — and Twitter's future",
    "Elon Musk tried a big presidential broadcast event and Twitter broke",
    "Twitter Spaces crashes repeatedly during DeSantis 2024 announcement",
    "Florida Gov. Ron DeSantis announces he's running for president in 2024",
    "DeSantis tech fiasco top story on earth, all Prez candidates welcome on Twitter: Musk",
    "Ron DeSantis Tells Elon Musk Bitcoin Will Die if Joe Biden is Reelected",
    "Twitter ‘melts’ as it becomes first social app to launch a presidential bid",
    "DeSantis Enters GOP Race on Glitchy Twitter",
    "Ron DeSantis's Twitter launch of his presidential campaign botched by constant glitches, crashes",
    "Ron DeSantis debuts presidential bid in a glitch-ridden Twitter ‘disaster’",
    "Ron DeSantis's campaign launch on Twitter beset by technical glitches",
    "DeSantis Campaign Announcement Plagued by Twitter Glitches",
    "Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point",
    "Twitter Buckles Under Pressure During DeSantis' Spaces Campaign Event",
    "Ron DeSantis gambled on Elon Musk and went bust",
    "Trump And Biden Both Dragged Ron DeSantis' Trainwreck Of A Twitter Campaign Launch",
    "Elon Musk's Twitter Event With Ron DeSantis Hits Technical Issues",
    "Ron DeSantis' Campaign Announcement on Twitter Crashed Immediately",
    "Biden capitalizes on DeSantis Twitter Spaces failure",
    "Ron DeSantis Disastrous Presidential Announcement with Elon Musk, Servers Crash",
    "DeSantis Campaign Sputters to Launch as Twitter Spaces Livestream Crashes",
    "DeSantis' 2024 Announcement Delayed By Twitter Glitches",
    "DeSantis' Twitter Campaign Launch Was a Glitch-Filled Disaster",
    "Ron DeSantis ‘Disastrous’ 2024 Launch Marred by Twitter Glitches",
    "Twitter glitches disrupt Ron DeSantis' presidential run announcement",
    "DeSantis-Musk alliance was a year in the making",
    "Ron DeSantis Twitter Spaces Event Experiences ‘Rapid Unscheduled Disassembly’",
    "Biden trolls DeSantis over glitchy 2024 launch on Twitter Spaces",
    "Twitter crashes in Ron DeSantis U.S. presidential run announcement",
    "Start of Ron DeSantis presidential campaign melts down in Twitter problems",
    "Elon Musk ushers in DeSantis's 2024 campaign, signaling a new era for Twitter",
    "@lauren@mastodon.laurenweinstein.org",
    "Sounds like DeSantis and Musk should have hosted their show on Truth Social servers.",
    "This link works: [Donate to reelect Joe Biden and Kamala Harris]",
    "I wonder if this is a DDOS attack",
    "We had more people join when I played Among Us 👾 https://twitter.com/...",
    "I'm running for president to lead our Great American Comeback. [video]",
    "It'd be like if the escalator had just stopped halfway down...",
    "BuzzFeed exploding the watermelon hit 820,000 concurrent viewers in 2016 https://twitter.com/...",
    "All Presidential candidates are most welcome on this platform",
    "https://twitter.com/... [video]",
    "Ron DeSantis' campaign launch: [image]",
    "Well you do want these things to be memorable. 🤷‍♂️ https://twitter.com/...",
    "one of the worst websites I've ever seen [image]",
    "Ok now Joe from Scranton has entered the room with an epic dunk. https://twitter.com/...",
    "No advance prep? Idiot. https://twitter.com/...",
    "Sean Spicer vibes here https://twitter.com/...",
    "Trump was a political mastermind for his Twitter use, but DeSantis is “way too online.”",
    "This is the full video of DeSantis with Hitler and the devil posted on Trump's Instagram [video]",
    "Man what https://twitter.com/... [image]",
    "I think she might be leaving something out https://twitter.com/...",
    "Fantastic job all around https://twitter.com/...",
    "Biden is trolling Musk and DeSantis in real time. https://twitter.com/...",
    "he just destroyed ron and elon [video]",
    "Against all odds we could actually have a funny campaign season [image]",
    "can't believe this is how he announced [image]",
    "Joint Cybersecurity Advisory",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?",
    "China Hacks US Critical Networks in Guam, Raising Cyberwar Fears",
    "National Security Agency/Central Security Service",
    "Microsoft links attacks on American critical infrastructure systems to China",
    "Chinese hackers hit critical U.S. infrastructure, intelligence agencies warn",
    "Chinese state hackers infect critical infrastructure throughout the US and Guam",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "U.S. and International Partners Release Advisory Warning of PRC State-Sponsored Cyber Activity",
    "Chinese hackers breach US critical infrastructure in stealthy attacks",
    "China's Stealthy Hackers Infiltrate U.S. and Guam Critical Infrastructure Undetected",
    "Beware, Volt Typhoon: Chinese hackers pose clear, present danger to US, says Microsoft",
    "US, Microsoft Warn Chinese Hackers Attacking ‘Critical’ Infrastructure",
    "Chinese state-backed hacking group compromised US critical infrastructure orgs",
    "Microsoft says Chinese state-sponsored hackers penetrate critical U.S. infrastructure",
    "Chinese State Hacker ‘Volt Typhoon’ Targets Guam and US",
    "Five Eyes and Microsoft accuse China of attacking US infrastructure again",
    "Microsoft warns alleged Chinese hacking group is targeting critical infrastructure",
    "Microsoft Raises Alarm on Chinese State-Backed Hackers",
    "Chinese hackers targeting critical U.S. infrastructure, Microsoft warns",
    "China-backed hackers spying on US critical infrastructure, says Five Eyes",
    "Microsoft says state-sponsored China actor targeting critical infrastructure in the US",
    "Chinese-linked hackers target critical infrastructure in US and Guam",
    "‘Volt Typhoon’ China-Backed APT Infiltrates US Critical Infrastructure Orgs",
    "Microsoft says critical U.S. infrastructure targeted by Chinese hackers",
    "FirstFT: Chinese group hacked US infrastructure, Microsoft warns",
    "U.S. says Chinese hackers breached gear in Guam, key to Pacific defense",
    "Microsoft Says Chinese Hackers Compromised Critical US Infrastructure",
    "Microsoft Catches Chinese .Gov Hackers Targeting US Critical Infrastructure",
    "A Chinese cyber espionage operation is hitting U.S. infrastructure, West warns",
    "Chinese hackers targeting critical US infrastructure, says Microsoft",
    "Microsoft says China installed malware in US systems in Guam",
    "Microsoft says state-sponsored Chinese hackers have been targeting U.S. critical infrastructure",
    "OpenAI may leave the EU if regulations bite - CEO",
    "OpenAI Could Quit Europe Over New AI Rules, CEO Sam Altman Warns",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "Can Europe Afford to Lose OpenAI? The Implications of Regulatory Struggles",
    "OpenAI's Sam Altman threatened leave the EU if he doesn't like their ChatGPT regulation",
    "OpenAI may quit Europe If AI regulation proves ‘challenging’: CEO Sam Altman",
    "AI could grow so powerful it replaces experienced professionals within 10 years, Sam Altman warns",
    "Sam Altman Says OpenAI Will Leave the EU if There's Any Real AI Regulation",
    "OpenAI Could Exit Europe Amid Regulatory Pressure: Reuters",
    "No 10 acknowledges ‘existential’ risk of AI for first time",
    "The official ChatGPT app is now available in 11 more countries",
    "Sam Altman sells superintelligent sunshine as protestors call for AGI pause",
    "A conversation with OpenAI CEO Sam Altman | Hosted by Elevate",
    "ChatGPT app expands to 11 more countries",
    "Why OpenAI's Sam Altman was just in Lagos",
    "Wow, gpt4 even making physical travel way more efficient too 👏 https://twitter.com/...",
    "@paulo170595 @SimonFounder flew to paris, took the eurostar to london",
    "NVIDIA Announces Financial Results For First Quarter Fiscal 2024",
    "Nvidia forecasts second-quarter revenue above estimates",
    "Nvidia Forecast Shows How AI Frenzy Is Transforming Chip Sector",
    "Nvidia revenue falls but AI-focused forecast sees stocks surge",
    "Nvidia Poised for Record Sales as AI Demand Kicks In",
    "The A.I. chip boom is pushing Nvidia toward $1 trillion, but it won't help Intel and AMD",
    "Nvidia races towards $1tn club as AI frenzy drives chip stocks higher",
    "NVIDIA revenues fell 13% in Q1 compared to the year before",
    "Nvidia's beats estimates with quarterly revenue of $7.19B, down 13% from year ago",
    "nvidia just added an intel-sized $150bn to its market cap after hours",
    "The number of big egos who tried to get cute and short NVDA They didn't listen... [image]",
    "Nvidia's $NVDA Q1 visualized [image]",
    "Nvidia just added $151B to its market cap in under 30 minutes. Insanity.",
    "I didn't name my dog Nvidia for nothing",
    "+26% after hours. That's nearly $200b in one day https://twitter.com/...",
    "PlayStation Showcase 2023 - Accessories Sneak Peek",
    "Sony's PS5 streaming Project Q handheld will launch this year",
    "‘Project Q’ is a dedicated PS5 streaming device due later this year",
    "Sony says its first PlayStation earbuds boast lossless, low-latency audio for PC and PS5",
    "Sony Project Q handheld console will fundamentally change how PS5 users game",
    "What is PlayStation Project Q and how does it work?",
    "9 Things We Just Learned About Sony's Big Playstation Plans",
    "Project Q: Sony announces new gaming handheld",
    "Sony's Project Q is an 8 inch handheld that streams games from your PS5",
    "New PlayStation portable is for PS5 remote play and codenamed Project Q",
    "Sony Announces a PlayStation 5 Handheld, Sort Of",
    "Sony Q Handheld Announced: An 8-Inch PS5 Streaming Mobile Gaming Device",
    "PlayStation “Project Q” Remote Play Device is Real, Offers 1080p Screen, DualSense Features",
    "PlayStation confirms it's working on a handheld, but not the one you hoped for",
    "Sony announces new PS5 earbuds and “Project Q” remote play device for late 2023",
    "Sony Reveals Project Q Streaming Device, PlayStation Earbuds",
    "PlayStation to release a new streaming handheld Project Q",
    "PlayStation Officially Unveils The Handheld Project Q",
    "Sony's making a new handheld to stream PS5 games",
    "A New PlayStation Handheld Has Been Officially Revealed That's Built For Remote Play",
    "Sony Announces PlayStation Game Streaming Device, Codenamed Project Q",
    "Sony's handheld Project Q announced - plays streamed PS5 games",
    "wii u did this 11 years ago and you all laughed https://twitter.com/...",
    "WWDC 2023: Apple may add a smart display-like iPhone lock screen with iOS 17",
    "iOS 17 Said to Feature Wallet, Find My, SharePlay, and AirPlay Upgrades",
    "Is the iPad gearing up to become your new home hub?",
    "iOS 17 to feature smart display mode when your iPhone is locked",
    "Apple plans to turn your iPhone into a smart display with iOS 17",
    "Journaling app with mood tracker reportedly coming in June iOS update",
    "The Pixel Tablet could have an unlikely competitor — your iPhone",
    "Apple could transform the iPhone lock screen to a smart display in iOS 17",
    "Apple's iOS 17 to Turn Locked iPhones into Smart Displays",
    "Leaks suggest iOS 17 could make your iPhone way more useful in the home",
    "iOS 17 might turn your iPhone into a smart display",
    "iOS 17 Will Turn an iPhone Into a Smart Home Display When Docked",
    "iOS 17 May Turn Your iPhone's Lock Screen Into A Smart Display",
    "iOS 17 Could Make Your Locked iPhone Screen a Smart Home-Esque Display",
    "iOS 17 to turn iPhone Lock Screen into ‘smart-home display’",
    "Apple's iOS 17 reportedly turns locked landscape iPhone models into another device",
    "iOS 17 could turn your locked iPhone into an always-on information hub",
    "Apple might add a smart display-like iPhone lock screen in iOS 17",
    "iOS 17 Will Turn Your iPhone Lock Screen Into a Smart Home Display",
    "iOS 17 To Bring Smart Home Interface To Lock Screen",
    "iOS 17 will turn locked iPhones into smart home-style displays, report says",
    "Apple reportedly working with hotels to expand AirPlay availability with iOS 17",
    "Walking naturally after spinal cord injury using a brain-spine interface",
    "AI is the key to astonishing breakthrough that allowed paralysed man to walk again",
    "A paralyzed man can walk again using a groundbreaking mind-reading brain implant",
    "Swiss researchers develop tech to help person with paralysis walk again",
    "Brain implants help paralysed man to walk again",
    "Paralyzed man walks for first time in over a decade with electronic brain implants",
    "Motorcycle crash victim can walk and do chores thanks to brain, spine implants",
    "AI-based ‘digital bridge’ enables paraplegic patient to walk",
    "Snowflake acquires Neeva to accelerate search in the Data Cloud through generative AI",
    "Snowflake acquires Neeva to bring intelligent search to its cloud data management solution",
    "Snowflake Reports Financial Results for the First Quarter of Fiscal 2024",
    "Neeva joins Snowflake to bring the power of search and generative AI to Snowflake Customers",
    "Cloud data warehousing firm Snowflake acquires search startup Neeva",
    "Snowflake Acquires Neeva, Brings Generative AI Search Capabilities To Its Data Cloud",
    "Snowflake's stock falls on guidance miss, as it confirms plans to acquire Neeva",
    "Snowflake acquires Neeva, days after the search startup pivots to enterprise",
    "AI Search Engine Neeva Acquired By Snowflake",
    "Snowflake slashes forecast, stock slumps after earnings",
    "Snowflake Shares Drop 12% as Revenue Growth Slows",
    "Snowflake Stock Plunges On Weak Outlook Amid Slower Cloud Computing Growth",
    "Snowflake acquires Neeva to add generative AI-based search to Data Cloud",
    "Facebook owner Meta slashes business teams in final round of layoffs",
    "Meta has started its latest round of layoffs, focusing on business groups",
    "Meta conducts yet another round of layoffs",
    "Meta Doubles Down on “Year of Efficiency” with Third Round of Layoffs in Seven Months",
    "Meta Begins ‘Final’ Layoff Round, With Thousands Affected",
    "Meta Layoffs Impacts Top Indian Execs",
    "Meta Completes Another Round of Layoffs in its ‘Year of Efficiency’",
    "Meta Announces Layoffs on Business Teams",
    "Meta has begun a new set of cuts as part of its 10,000-person layoff",
    "Meta's Latest Cuts Include Trio of Top Sports Executives",
    "Microsoft appeals UK veto of Activision Blizzard takeover",
    "Microsoft has lodged its appeal against the Competition and Markets Authority",
    "Xbox Formally Appeals UK CMA Decision to Block Activision Blizzard Deal",
    "Microsoft appeals against UK watchdog's veto of Activision Blizzard takeover",
    "Microsoft files appeal against UK block of Activision deal",
    "Microsoft Appeals UK Decision in Activision Blizzard Acquisition",
    "Microsoft officially files appeal of the UK CMA ruling against the Activision Blizzard deal",
    "Microsoft to lodge appeal against UK regulator's block of Activision deal - Sky News",
    "The EU explains why it approved Microsoft's Activision Blizzard deal.",
    "Starling CEO Anne Boden to step down this summer, amid record profits",
    "Starling founder Anne Boden steps down",
    "Starling Bank's Anne Boden to step down as CEO",
    "Breaking: Anne Boden to step down as Starling Bank CEO, as bank reports record profits of £195m",
    "Boss of Goldman-backed digital bank Starling to step down next month",
    "Anne Boden to step down as chief of Starling as bank reports record profits",
    "Starling Bank chief Anne Boden to step down amid record profit",
    "Anne Boden to step down as Starling chief executive",
    "She going to YC too? https://twitter.com/...",
    "Working together with YouTube",
    "Google Deepmind shows off how AI improves YouTube Shorts",
    "Supreme Court of the United States",
    "Google never agreed it wouldn't copy Genius' song lyrics, US official says",
    "U.S. Solicitor General urges Supreme Court not to hear Apple-Caltech patent case",
    "ML Genius Holdings LLC v. Google LLC",
    "Google expands Play Games for PC beta to Europe and New Zealand",
    "Google Play Games out in Europe and New Zealand | News-in-brief",
    "Google expands the availability of Play Games for PC to Europe",
    "Google Play Games now available on Galaxy laptops in Europe",
    "Google Play Games for PC launched in Europe",
    "Google Play Games for PC is now rolling out to Europe and New Zealand",
    "Google Play Games for PC levels up with availability spreading to Europe",
    "Google Play Games on PC is now available in Europe and New Zealand",
    "Play Games for PC Beta opens up to Europe and New Zealand",
    "Personalized wealth management, built for tech people",
    "Minnesota Passes Right to Repair",
    "Minnesota passes a right to repair bill that actually matters",
    "Right-to-repair rules are now the law in Minnesota",
    "Minnesota passes broadest Right to Repair measure to date",
    "Right to repair is now the law of the land in Minnesota! https://www.ifixit.com/...",
    "Another win for the new Minnesota Vikings https://prospect.org/... https://twitter.com/...",
    "eFishery becomes Indonesia's latest unicorn with 42XFund-led $108m Series D funding",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/24 - Microsoft Build Wrapup",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Singapore Grab co-founder Tan Hooi Ling to quit operational roles",
    "Grab co-founder Tan Hooi Ling to step down from operational roles",
    "Tan Hooi Ling to relinquish operations roles at Grab",
    "GRIMES REVIEWS A.I. GRIMES SONGS https://www.nytimes.com/... [image]",
    "Even With Venture Slowing, Debt Numbers Not Seeing Dramatic Increase",
    "OpenAI raises $175m in funding to invest in AI start-ups",
    "OpenAI raises $175 million for startup investment fund",
    "OpenAI: profits cap will no longer fit as capital surges in",
    "Indian startup valuations are slashed by global investors",
    "Because every AI driven YC company needs follow on. https://twitter.com/...",
    "Amazon to shutter its Chinese Appstore - the one used by hardly anyone, anywhere",
    "Amazon China Will No Longer Provide App Store Services Starting July 17",
    "Amazon to Stop Providing App Store Services in China",
    "Amazon suspends Appstore services",
    "Amazon to Shut Down App Store Service in China, Succumbing to Local Competition",
    "Amazon to stop providing app store services in China",
    "Amazon's Appstore to Shut Down in China",
    "Terra Founder Do Kwon's Bail Revoked in Montenegro: Report",
    "Montenegro court overturns Terraform founder Do Kwon's bail",
    "Terraform Labs Executives Denied Bail in Montenegro",
    "Do Kwon will remain detained in Montenegro",
    "Montenegro High Court Says No Bail for Terra's Do Kwon in Fake Passport Case: Bloomberg",
    "Terraform CEO Do Kwon's bail revoked in Montenegro",
    "Fallen crypto titan Do Kwon to stay in Montenegro jail after bail revoked: Report",
    "Terra's Do Kwon Back In Jail After Montenegro High Court Revokes Bail Status",
    "San Francisco Business Journal",
    "Amazon's Generative AI: A Work in Progress",
    "The Funded: 7 Bay Area companies picked for AWS Generative AI Accelerator",
    "@GossiTheDog@cyberplace.social",
    "Microsoft's Surface Pro X cameras aren't working, but luckily there's a temporary fix",
    "All Microsoft Surface Pro X cameras just stopped working",
    "New Microsoft Surface Pro X bug causes camera to stop working",
    "The Camera on All Microsoft Surface Pro X Computers Stopped Working",
    "Microsoft Update Wipes Out Cameras On Surface Pro X",
    "Ongoing Chinese Influence Operations Could Strengthen the Case for a TikTok Ban",
    "AMD Introduces AMD Radeon RX 7600 Graphics Card for Superb, Next-Gen 1080p Gaming",
    "NVIDIA GeForce RTX 4060 Ti drops €20 below MSRP in Germany, just four hours after launch",
    "The RTX 4060 Ti shows the hard limits of Nvidia's Frame Generation technology",
    "Forget AMD RX 7600 and Nvidia RTX 4060 Ti; The Intel Arc A750 Is the Best Budget GPU So Far!",
    "AMD announces $269 Radeon RX 7600 RDNA3 graphics card",
    "AMD undercuts Nvidia's 4060 launch with a $269 GPU",
    "AMD's new $269 Radeon RX 7600 GPU targets the 1080p ‘sweet spot’",
    "RX 7600 Full Specs Leaked: Up to 2,625 MHz at 165W, Listed For Over $300",
    "AMD Radeon RX 7600 review: Another water-treading midrange GPU for $269",
    "AMD Radeon RX 7600 Review: A Good 1080p Gaming Value, With Caveats",
    "AMD Radeon RX 7600 Vs RTX 4060 Ti: Which Should You Buy?",
    "AMD Radeon RX 7600: a major gift for gamers on a budget",
    "AMD's RX 7600 graphics card promises smooth 1080p gaming for lower $269 price",
    "AMD's $270 RX 7600 will go head-to-head with Nvidia's RTX 4060",
    "AMD Radeon RX 7600 to undercut NVIDIA GeForce RTX 4060 with European and US pricing",
    "Embracer's shares plummet after $2bn partnership deal evaporates",
    "Embracer's $2bn+ deal collapsed due to “external factors”",
    "Embracer stock drops 44% as unannounced partnership falls apart",
    "Embracer shares have nosedived after the collapse of a $2 billion deal",
    "$2 billion partnership deal falls through for Embracer Group",
    "Embracer shares plummets after huge partnership falls through",
    "Oh sheeeeeeesh I'd hoped Embracer would actually ship games... https://twitter.com/...",
    "ghosted for 2 bil lmao https://twitter.com/...",
    "Cancel your WinRAR trial: Windows will soon support RAR, gz, 7z, and other archives",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Netflix's password sharing “crackdown” is a fishing expedition",
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix's password crackdown has started in the U.S.",
    "The Netflix crackdown on password sharing in the US has arrived",
    "The free ride is over. https://about.netflix.com/..."
]