[
    "FTC sues Amazon for tricking customers into signing up for Prime",
    "FTC: Amazon Tricked Millions Into Signing Up For Prime Subscriptions",
    "FTC: Amazon trapped millions into hard-to-cancel Prime memberships",
    "F.T.C. Sues Amazon for Inducing Users to Subscribe to Prime",
    "FTC Sues Amazon for Hindering Consumer Attempts to Cancel Prime",
    "Amazon Allegedly Tricked Users Into Prime Subscriptions and Sabotaged Their Attempts to Cancel",
    "FTC Sues Amazon Over Tricking Users Into Signing Up for Prime",
    "FTC Sues Amazon For ‘Manipulative’ Prime Signup Process",
    "FTC accuses Amazon of deceiving customers in Prime subscription sign-up, cancellation",
    "FTC sues Amazon for allegedly tricking customers into Prime subscriptions",
    "FTC sues Amazon for using ‘deceptive’ tactics to sign up customers for Prime",
    "Amazon ‘tricked’ customers into paying for Prime, new FTC suit alleges",
    "FTC Sues Amazon Over ‘Manipulative’ Tactics to Enroll Users in Premium Service",
    "Amazon duped ‘millions of consumers’ into enrolling in Prime — FTC",
    "Amazon sued by FTC over ‘deceptive’ practices used to sign up customers for Prime",
    "FTC alleges Amazon ‘tricked and trapped’ customers with Prime subscriptions",
    "FTC claims Amazon tricked millions into Prime subscriptions",
    "FTC sues Amazon for “tricking and trapping” Prime customers",
    "The FTC Sues Amazon Over ‘Deceptive’ Prime Offerings & Cancellation Process",
    "FTC sues Amazon, alleges consumers were tricked in signing up for Prime",
    "AMAZON SHARES FALL MORE THAN 1% ON FTC LAWSUIT",
    "FTC sues Amazon over ‘deceptive’ Prime sign-up and cancellation process",
    "Europe, US urged to investigate the type of AI that powers systems like ChatGPT",
    "Consumer group calls on EU to urgently investigate ‘the risks of generative AI’",
    "EU consumer group calls for ‘urgent investigations’ of generative AI risks",
    "EU watchdogs demand Action: investigating the risks of AI chatbot algorithms",
    "EU consumer protection groups urge governments to investigate AI",
    "Congress must join the AI revolution.",
    "A nuanced and well-researched piece on AI x-risk: https://www.technologyreview.com/ ...",
    "The White House on YouTube",
    "Biden meets with tech company critics on AI",
    "The EU AI Act is near.  US AI regulation is coming.  Here's what you need to know |  The AI Beat",
    "Chuck Schumer calls on Congress to pick up the pace on AI regulation",
    "Silicon Valley Business Journal",
    "What President Biden said about artificial intelligence during his Bay Area visit",
    "Schumer launches ‘all hands on deck’ push to regulate AI in keynote address",
    "US must manage AI risks to society and national security, Biden says",
    "Schumer says lawmakers ‘starting from scratch’ on AI regulation",
    "Biden meets with AI experts on managing risks",
    "In San Francisco, Biden says AI has 'enormous promise but comes with risks",
    "Biden staff are meeting regularly to develop AI strategy, White House says",
    "Biden says there is need to address security, economic risks posed by AI",
    "President Biden's Vision for AI: Seizing Opportunities and Managing Risks",
    "President Biden wraps up Bay Area visit",
    "President Biden Participates in a Meeting on Artificial Intelligence with Civil Society Leaders",
    "Biden to discuss dangers of AI in San Francisco meeting with experts",
    "Biden to meet with A.I. experts in San Francisco",
    "Biden meets with AI experts in effort to manage its risks",
    "President Biden Gathers Experts in San Francisco to Discuss Responsible AI",
    "Biden meeting with technology leaders, academics on AI regulation",
    "How the White House is moving into the action phase of its effort to regulate AI",
    "Biden Says He's ‘Very Proud’ of Son Hunter After Plea Deal",
    "This is so important. I hope we get a strong readout of the discussion. https://twitter.com/...",
    "Honored to meet with President Biden. https://thehill.com/...",
    "Important person for Biden to meet on AI issues. https://twitter.com/...",
    "Life in the trenches labeling AI data. https://www.theverge.com/...",
    "@alastairmrushworth@fosstodon.org",
    "this story should sit at the foundation of every conversation about ai https://twitter.com/...",
    "Pay no attention to the underpaid human human workers behind the curtain. https://twitter.com/...",
    "A big round of applause to the king @joshdzieza for this one https://nymag.com/...",
    "Really good piece on where the HF part of RLHF comes from https://nymag.com/...",
    "What to watch before Secret Invasion",
    "Marvel criticized for using AI to make ‘Secret Invasion’ opening credits",
    "Marvel's ‘Secret Invasion’ Show Uses Generative AI—And Fans and Creators Are Livid",
    "Artists Are Mad About Marvel's ‘Secret Invasion’ AI-Generated Opening Credits",
    "Marvel's Secret Invasion is here, and it brought AI-generated grotesquery with it.",
    "'Secret Invasion's AI credits aren't clever — they're downright scary",
    "‘Secret Invasion’ Opening Credits Generated By AI, Prompting Backlash From Audiences",
    "Why Marvel's Secret Invasion Has An AI-Made opening",
    "Marvel Secret Invasion's AI Credits Are A Soulless Insult To Artists",
    "Secret Invasion: “Gross” AI opening credits divide MCU fans",
    "Secret Invasion just killed two MCU characters — but one could be fake",
    "FFS  —  Tone deaf and disrespectful.  —  https://www.polygon.com/...",
    "Pay artists to do this you cheap fucks. Shame on you Marvel. https://twitter.com/...",
    "Yes, Secret Invasion's opening credits scene is AI-made — here's why (via: Polygon)",
    "Amazon Prime Day is back July 11-12! Here are 5 shopping tips to help you prepare.",
    "Amazon Prime Day 2023 Will Run July 11-12",
    "Amazon Prime Day starts July 11, but here are the early deals you can snag right now",
    "Amazon Prime Day is official: July 11-12 for major sales on tech and more",
    "Amazon Prime Day Comes Back on July 11-12",
    "Prime Day 2023 is going to be different than its predecessors",
    "Amazon Prime Day is set to return on July 11",
    "Amazon Prime Day Canada 2023 Deals Coming July 11-12",
    "Prime Day Returns In July, But Some Sales Have Already Begun",
    "Amazon Announces Prime Day 2023 Sale Will Take Place July 11 - 12",
    "Amazon says Prime Day will run July 11 and 12, introduces invite-only deals",
    "The Morning After: Amazon Prime Day kicks off July 11th",
    "Best Prime Day AirPods deals 2023",
    "Amazon Prime Day 2023 is happening on July 11th and 12th",
    "Amazon Announces 2023 Prime Day Dates",
    "Best Prime Day 2023 iPhone deals",
    "Will iPhones be cheaper on Prime Day 2023? Our prediction",
    "Amazon Prime Day 2023 will take place on July 11th and 12th",
    "Amazon Prime Day is officially coming July 11-12, but the deals actually start right now",
    "Prime Day 2023 start date is July 11 — here are the first confirmed deals",
    "First look: Amazon's official Prime Day 2023 deals list & best early sales",
    "Amazon Prime Day 2023 kicks off July 11th this year",
    "Amazon Prime Day dates are here!",
    "Amazon Prime Day 2023 Dates Officially Announced",
    "Amazon Prime Day 2023 - When Is It And What Xbox Deals Can We Expect?",
    "Amazon Prime Day 2023 Announced: 48-Hour Sale Kicks Off July 11",
    "Amazon locks in official dates for Prime Day 2023",
    "The best Amazon Prime Day deals",
    "Amazon officially announces Prime Day 2023 for July 11 and 12",
    "Amazon will hold its Prime Day shopping event on July 11-12",
    "Amazon Prime Day 2023 starts July 11 — here's what to expect",
    "Amazon Prime Day is July 11 & 12 — with new invitation deals",
    "When is Amazon Prime Day in 2023?  —  Amazon has announced the dates for Prime Day 2023 …",
    "Amazon Announces Prime Day 2023 Dates With Fire TV & Cord Cutting Deals",
    "SoftBank's Son Goes Back on Offense to Cement His Tech Legacy",
    "Masayoshi Son is back and it's beautiful",
    "SoftBank Group and CEO Masayoshi Son are back and on the offensive",
    "SoftBank's Masayoshi Son Shifts to ‘Offense’ in A.I. Race",
    "SoftBank to shift from ‘defense mode’ to ‘offense mode,’ says CEO Masayoshi Son",
    "SoftBank's Masayoshi Son Had His Cry. Now He's in Love Again—With ChatGPT.",
    "Masayoshi Son launches ‘offensive’ on tech startups, boosts AI focus",
    "We're weeping we're laughing we're a little worried about this Al character https://www.ft.com/...",
    "Oh my. How much of Nvda msft do they buy https://twitter.com/...",
    "Looking forward to the accompanying SoftBank slides https://twitter.com/... [image]",
    "SoftBank after their last $32B loss: https://twitter.com/... [image]",
    "Now just need Cathie Comeback magazine cover and All Clear Echo is a wrap. https://twitter.com/...",
    "Elon Musk Declares ‘Cisgender’ a Slur on Free Speech Twitter",
    "Elon Musk says terms like ‘cisgender’ and ‘cis’ are now considered ‘slurs’ on Twitter",
    "Elon Musk bans the word “cis” on twitter",
    "Elon Musk Says ‘Cisgender’ Now Considered A Slur On Twitter",
    "How it started, how it's going https://twitter.com/... [image]",
    "As a cis person, I hereby give all trans people the cis-word pass https://twitter.com/...",
    "@mysteriouskat Call yourself anything you want",
    "MODS MODS MODS BAN HIM [image]",
    "I'm sure Dave will take huge issue with this clear violation of free speech any time now.",
    "Introducing Dropbox Dash, AI-powered universal search, and Dropbox AI",
    "Dropbox Launches Two AI-Powered Productivity Features",
    "Dropbox introduces generative AI-powered products to ease knowledge work",
    "Dropbox unveils two AI-based products, launches $50M AI venture fund",
    "Dropbox launches $50M AI-focused venture fund, intros AI features",
    "Server Subscriptions Just Got Super Powered: Introducing Media Channels, Tier Templates and more!",
    "Discord adds ‘Media Channels’ and tests ‘Server Shop’ feature",
    "Discord just ramped up monetization again with new subscription tiers",
    "Discord expanding monetisation options with Media Channels",
    "Discord plans to let creators sell downloadable products",
    "Best way to watch Oppenheimer: IMAX & PLF explained",
    "Christopher Nolan, With ‘Oppenheimer,’ Aims To Capture “The Most Dramatic Moment In History”",
    "Christopher Nolan on Why ‘Oppenheimer’ Can Be Seen as a “Horror Movie”",
    "Christopher Nolan: Early Oppenheimer Viewers Leave the Movie ‘Devastated’",
    "How Christopher Nolan Learned to Stop Worrying and Love AI",
    "Christopher Nolan Says AI Dangers Have Been ‘Apparent For Years’",
    "Instagram enables download of public Reels in the US",
    "You can download Instagram Reels now",
    "Instagram finally lets users download Reels",
    "Instagram Now Allows Users To Download Public Reels",
    "Download Reels From Instagram App Natively, Here's How",
    "Instagram allows downloading Reels now but you may not be able to use it",
    "Instagram now lets some users download Reels, here is how",
    "Instagram now lets users download Reels, but Indian users can not download it yet!",
    "Instagram now lets you download Reels from public accounts",
    "Instagram Reels download is finally possible on mobile",
    "Instagram reels can now be downloaded on your device, says IG head",
    "Now you can officially download Reels from the Instagram app",
    "Reddit Moderators Are Protesting By Changing Their Communities to NSFW",
    "Reddit Goes Nuclear, Removes Moderators of Subreddits That Continued To Protest",
    "Thousands of Reddit Communities Stay Dark as App Policy Protest Continues",
    "Reddit API backlash continues, with moderators demonetizing subreddits",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "What the Reddit Revolt Means for Social Media in an AI Era",
    "Reddit's API controversy sees subreddits go NSFW",
    "Reddit Is Removing Mods Over NSFW Protests",
    "Reddit removed moderators behind the latest protests before restoring a few of them",
    "VOTE: Help decide on the future of r/MildlyInteresting",
    "Reddit is bringing in scabs to replace mods",
    "Reddit starts removing moderators behind the latest protests",
    "Removed from /r/searchandrescue, which was public, in retaliation for other subs being private.",
    "Uhhhh, What the fuck is happening at /mildlyinteresting???",
    "Reddit communities adopt alternative forms of protest as the company threats action on moderators",
    "TikTok Expands Online Retail Offerings to Compete With Shein and Amazon",
    "TikTok Begins Selling Its Own Products in the U.K.",
    "American Companies Are Hostage to the Whims of TikTok",
    "Cannes Briefing: TikTok, Netflix, others expand presence at Cannes",
    "Netflix's new show ranking system doesn't change much",
    "Black Mirror season 6 is a hit on Netflix, but it's not the breakout TV show of the week",
    "Action-thriller series Bloodhounds gains explosive popularity on Netflix",
    "The 10 most-watched movies of all time on Netflix",
    "Netflix Updates Top 10 Charts to Include Estimated Viewers in Addition to Hours Viewed",
    "Empowering our Creative Leaders to Drive Growth",
    "EA restructure divides business into EA Entertainment and EA Sports",
    "Electronic Arts Restructures, Names New Head of Entertainment",
    "EA Games breaks into two companies",
    "EA is splitting into two companies - EA Entertainment and EA Sports",
    "EA Dividing Itself - Will Operate as EA Entertainment and EA SPORTS",
    "EA Sports and EA Games Are Splitting Up",
    "EA announces major restructure, splits EA Entertainment and EA Sports",
    "Electronic Arts restructures studios into EA Entertainment and EA Sports",
    "EA Restructuring Will Spin Off EA Sports Into A Separate Division",
    "Electronic Arts is restructuring its studios into two organisations",
    "EA Games to Become EA Entertainment in Major Corporate Reshuffle",
    "Electronic Arts Restructures Its Studios Into Two Organisations",
    "EA Is Splitting Into Two Separate Organisations",
    "EA Games Changes Name After Massive Restructuring",
    "Electronic Arts is realigning studios into EA Sports and EA Entertainment",
    "EA Games And EA Sports Are Splitting In Two To “Empower” Creative Teams",
    "Electronic Arts is Splitting into EA Entertainment and EA Sports",
    "EA Games becomes EA Entertainment, splits from EA Sports in restructuring",
    "EA Games splits with EA Sports and becomes EA Entertainment",
    "EA Implements Reorganization, Divides into EA Entertainment and EA Sports",
    "EA realigns into EA Sports and EA Entertainment divisions",
    "EA splits into EA Entertainment and EA Sports",
    "Electronic Arts Is Changing Its Game Studio Structure Into EA Entertainment And EA Sports",
    "Electronic Arts Shake-Up: New CFO and Studio Reorganization",
    "EA splits Sports and Games in major organization shakeup",
    "EA undergoes C-suite and division restructure",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup - IGN",
    "Introducing Content Classification Labels",
    "Twitch cleaning up operations with content classification labels",
    "Twitch replaces its mature content mode with more granular ‘labels’",
    "Twitch introduces new labels to classify mature content",
    "Twitch introduces new content classification labels",
    "Twitch adds new labels for streams with mature content",
    "Twitch introduces content classification labels",
    "Twitch adds new labels for “mature content” like swearing, gambling and sexual themes",
    "Content Classification Labels",
    "YouTube to launch its first official shopping channel in South Korea -Yonhap",
    "YouTube to launch first official shopping channel",
    "YouTube to debut live shopping channel in South Korea",
    "YouTube To Launch Its First Official Shopping Channel In South Korea 1",
    "Ant Group confirms it is working on own AI large language model",
    "Ant Group Confirms Reports about Its Own AI Large-Language Model",
    "Ant Group to develop AI model for ChatGPT-like services",
    "Ant Developing Large Language Model Technology",
    "The federal government has a new cyber player",
    "Drip drip... https://twitter.com/...",
    "International Business Times",
    "A message from the CEO  —  Anthony Tan, Group CEO and Co-Founder",
    "Singapore's Grab Plans Biggest Round of Job Cuts Since Pandemic",
    "Grab cuts around 1,000 jobs in biggest round of layoffs since the pandemic",
    "Tech Layoffs: Grab Cuts 1,000 Jobs; Olx Group Sacks 800 Employees, Closes Some Operations",
    "Grab cuts 1,000 jobs, its biggest round of layoffs since the pandemic",
    "Singaporean superapp Grab delivers massive job cuts with after hours email",
    "Singapore ride-hailing firm Grab slashes 1000 jobs in biggest layoff since pandemic",
    "Singapore's Grab cuts 1,000 jobs in first layoffs since 2020",
    "Singapore tech giant Grab to lay off over 1,000 employees",
    "Grab Holdings cuts 1,000 jobs in strategic reorganization",
    "Grab Prepares for Layoffs Amid Slowing Growth",
    "Bernie Sanders Opens Investigation Into Amazon's ‘Uniquely Dangerous’ Warehouses",
    "Bernie Sanders Opens Investigation Into ‘Dangerous and Illegal’ Amazon Warehouse Conditions",
    "Bernie Sanders launches Senate investigation into Amazon labor practices",
    "Are Amazon warehouses safe? US Senator Bernie Sanders launches a probe",
    "US Senate is the latest to look into Amazon's warehouse safety practices",
    "Bernie Sanders announces investigation into Amazon's safety record",
    "Bernie Sanders Launches Senate Probe Into Amazon Workplace Safety",
    "Bernie Sanders launches investigation into working conditions at Amazon",
    "Amazon faces Senate probe over warehouse safety",
    "Data-driven customer experience on a unified platform",
    "Intel soaks up Europe's chip anxieties and subsidies by the billions",
    "Chipmakers' plans for factories in Europe, US and Asia",
    "Amazon vs. Walmart: Reporter and author Jason Del Rey on the ‘defining business clash’ of our era",
    "Patreon adds e-commerce tools, free fan membership",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "DeepMind Co-Founder Wants the ‘New Turing Test’ to Be Based on How Good an AI Is at Getting Rich",
    "Deepmind founder proposes a new kind of Turing test: making money online",
    "Embracer Group Paid $396M For ‘Lord Of The Rings’ Rights",
    "Embracer Group Paid $395 million for ‘Lord of the Rings’ Rights",
    "Google Cloud Launches Anti Money Laundering AI for Financial Institutions",
    "Google Cloud launches AI-powered anti-money laundering tool",
    "Coinbase, Klarna investor IVP backs London-based Volt in €54M round: Know more",
    "Volt raises $60m Series B round led by Silicon Valley investor IVP",
    "Real-time payments infrastructure provider Volt recharges with another $60 million",
    "Payments provider Volt scores £47m Series B round",
    "Crib raises seed round from founders of Paytm, CRED, Mamaearth, and others",
    "Alibaba's Jack Ma and Joe Tsai show up at offices in Hangzhou amid restructuring",
    "Alibaba co-founder Joseph Tsai back as chair",
    "Alibaba's crypto-friendly transition: Joseph Tsai takes the helm as chairman",
    "Alibaba CEO Daniel Zhang Steps Down, Eddie Wu and Joseph Tsai Step up",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Crypto Proponent Joseph Tsai Becomes the New Chairman of Alibaba",
    "Alibaba Names Crypto-Friendly Joseph Tsai as New Chairman",
    "Crypto enthusiast Tsai to steer Alibaba",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "San Francisco Business Journal",
    "Bill Gates-Backed KoBold Metals Raises $1 Billion for AI Mining of Rare Earth Metals",
    "A mining tech unicorn: KoBold's $195M round",
    "Bill Gates-backed Berkeley metal mining startup KoBold doubles funding",
    "Mining Startup KoBold Metals Hits Unicorn Status After $195M Raise",
    "The top of AI hysteria can't be far away if this is happening https://twitter.com/...",
    "Twitter Employees Sue The Company Over Bonuses - Say They Weren't Paid Despite Promises",
    "Twitter workers sue over unpaid bonuses they were promised",
    "iPhone battery replacement legislation raises a huge number of questions",
    "Easily Replaceable Smartphone Batteries Could Make A Comeback",
    "EU could force Apple to make iPhone batteries replaceable — what you need to know",
    "Apple braces for change as EU demands easy battery replacement for smartphones",
    "Future iPhones might have an easily replaceable battery due to new EU law",
    "It's a bad idea for the EU to force Apple into making iPhone batteries easily replaceable",
    "New European Union law requires smartphones, laptops to have easily replaceable batteries",
    "EU wants “readily removable” batteries in devices soon—but what does that mean?",
    "Pick a voice, any voice: Voicemod unleashes “AI Humans” collection of real-time AI voice changers",
    "The AI voice-generating platform that shocked the world is getting an update to fight abuse",
    "ElevenLabs Raises $19M in Series A Funding",
    "Now hear this: Voice cloning AI startup ElevenLabs nabs $19M from a16z and other heavy hitters",
    "Synthetic voice AI firm ElevenLabs raises $19M along with a new detection tool",
    "ElevenLabs' Powerful New AI Tool Lets You Make a Full Audiobook in Minutes",
    "Real estate investment and property management platform Picket lands $20M",
    "Generative AI Speech Startup ElevenLabs Raises $19M and Releases Deepfake Voice Detector",
    "Credo Ventures joins €17.3M round for ElevenLabs, voice technology research company",
    "Andreessen Horowitz co-leads £15m ElevenLabs Series A",
    "Trevor Noah Signs With Spotify for Weekly Podcast Series (EXCLUSIVE)",
    "Spotify Desktop app gets a new look and upgraded library features",
    "Spotify overhauls design of its desktop app",
    "Spotify Desktop App Updated With Redesigned ‘Your Library’ and ‘Now Playing’ Views",
    "You can now use Spotify's new design on your Galaxy Book",
    "Spotify's desktop app gets new sections to show what's playing and what's in your library",
    "Prince Harry and Meghan Markle cut ties with Spotify.  So why are they facing backlash?",
    "Spotify's got a new desktop app, but it won't make me switch from Apple Music",
    "Spotify updates Mac app with Your Library, Now Playing changes",
    "Spotify on desktop is about to look very different - here are the two big changes",
    "Spotify Launches Redesigned Desktop Experience",
    "Spotify's Bitter Break With Royals Also Ends Exclusive Podcast Deals Era",
    "Spotify launches new desktop experience for Mac and PC with three-column UI",
    "Spotify desktop app gets a brand-new look",
    "Spotify for Desktop Gets UI Makeover",
    "Trevor Noah to launch original Spotify podcast",
    "Trevor Noah to host new podcast on Spotify",
    "Trevor Noah To Make Weekly Spotify Podcast",
    "Spotify launching weekly podcast with Trevor Noah",
    "The government is helping Big Telecom squeeze out city-run broadband",
    "DOJ establishes cybercrime enforcement unit as U.S. warnings mount over Chinese hacking",
    "DOJ Launches Cyber Unit to Prosecute Nation-State Threat Actors",
    "Justice Department expands cybersecurity efforts with new NatSec Cyber",
    "DOJ launches cyber unit with national security focus as China, Russia threats mount",
    "Justice Department adds new cyber-threat focused litigating section",
    "DOJ launches new cyber unit targeting nat'l security threats",
    "Microsoft CEO Satya Nadella to Meet with FTC to Discuss Activision Blizzard Acquisition",
    "Starfield, Redfall Exclusivity ‘Powerful Evidence’ Against Xbox's Activision Buyout, Claims FTC",
    "Xbox Activision deal allegedly aimed to put PlayStation out of business",
    "FTC Preliminary Injunction Trial Calls For Industry Heads, Mostly From MS, To Testify",
    "Microsoft is rallying its executives to defend Activision Blizzard acquisition in the US",
    "Major FTC Hearing Begins This Week With Microsoft & Activision CEOs In Attendance",
    "Microsoft, Activision CEOs to Defend $69 Billion Deal in Fight With FTC",
    "Microsoft, Activision CEOs on witness list for hearing on FTC bid to block merger",
    "Microsoft CEO Satya Nadella and many Xbox executives are set to defend its FTC case"
]