[
    "Bethesda Softworks on YouTube",
    "Xbox's Bright Future, and How We'll Get There",
    "Bethesda's Todd Howard Confirms Starfield Performance and Frame-Rate on Xbox Series X and S",
    "Starfield Direct - Gameplay Deep Dive",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Xbox Series S Carbon Black 1TB SSD - World Premier Announce Trailer",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "Giant Bomb at Nite: Night 3",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Xbox Finally Flexes Some Muscle After Years Of Atrophy",
    "The biggest announcements from the Xbox Games Showcase 2023 and Starfield Direct",
    "Phil Spencer Says Mid-gen Xbox Upgrade Doesn't “Feel an Imperative”",
    "Don't Expect an Xbox Series X Pro Console",
    "Will There Be A New Xbox In 2023?  Don't Get Your Hopes Up  —  Microsoft is in no rush …",
    "Microsoft's revamped Xbox Home UI is finally launching soon",
    "Game Pass and Xbox are profitable, Phil Spencer reiterates",
    "Microsoft's Phil Spencer Says No Urgency for Major Xbox Console Upgrade",
    "Starfield has the fewest bugs of any Bethesda game, Xbox has claimed",
    "Watch 45 minutes of new Starfield gameplay",
    "Bethesda and NASA created a new punk genre just for Starfield",
    "A special collector's Starfield smartwatch is coming",
    "Want a More Powerful Xbox? Don't Hold Your Breath",
    "Starfield Only Runs at 30 FPS on Consoles",
    "Phil Spencer Says Don't Expect A New Xbox Anytime Soon",
    "Starfield locked at 30fps and promises to be Bethesda's least buggy game yet",
    "4 Xbox first party games will be released annually & gamers are thrilled",
    "Xbox boss “confident” Activision Blizzard deal will be approved",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition",
    "Everything you need to know about Starfield - the most anticipated game of the year",
    "Starfield will run at 30fps on Xbox Series X|S",
    "Microsoft Gaming CEO Phil Spencer doesn't see imperative for Xbox Series X|S hardware revision",
    "Microsoft announces black Xbox Series S with 1TB of storage for $349",
    "Microsoft's GeForce Now Game Pass offering is aimed straight at UK regulators",
    "Microsoft's Game Pass Titles Coming to Nvidia's GeForce Now Service",
    "Microsoft's first-party titles are pulling in over 150M monthly active users",
    "Playing Xbox games on a Mac will soon be way easier",
    "Microsoft is bringing some Game Pass titles to GeForce Now",
    "Microsoft's PC Game Pass titles will start streaming on GeForce Now",
    "Microsoft shared 27 games at Xbox Games Showcase 2023, watch the trailers now",
    "Game Pass is Coming to GeForce Now",
    "Microsoft's PC Game Pass is coming to Nvidia GeForce Now: Check details",
    "Microsoft is bringing PC Game Pass integration to GeForce Now cloud gaming",
    "Xbox to launch PC Game Pass on Nvidia GeForce Now soon",
    "Game Pass Is Coming to GeForce NOW, Albeit with Select Games",
    "PC Game Pass Games Are Coming to Nvidia GeForce Now",
    "Microsoft's PC Game Pass is coming to NVIDIA's GeForce Now service",
    "Microsoft is bringing Xbox Game Pass to Nvidia GeForce Now",
    "Microsoft launches new Xbox and brings PC Game Pass titles to NVIDIA GeForce NOW",
    "‘Select’ Xbox Game Pass games are soon to hit GeForce Now",
    "NVIDIA GeForce Now streaming service will soon add “select” PC Game Pass titles",
    "PC Game Pass Ultimate titles coming to NVIDIA GeForce Now devices",
    "Xbox's Bright Future, and How We'll Get There - Xbox Wire",
    "International Business Times",
    "@rodhilton@mastodon.social",
    "@ericleamen@mastodon.social",
    "@codinghorror@infosec.exchange",
    "Reddit sees more than 6,000 communities ‘go dark’ in protest over API changes",
    "Reddit communities go dark in protest at changes",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Reddit Blackout Begins as Forums Protest Charges for Developers",
    "Reddit goes down fully as thousands of subreddits protest API changes [Update]",
    "The Why of Reddit Protests",
    "Apple Subreddit Goes Dark in Protest of Reddit's API Pricing Changes",
    "Thousands of subreddits go dark in mega-protest over Reddit's app-killing API prices",
    "Reddit blackout: Thousands of subreddits go dark as user protest begins",
    "Explainer: Reddit protest: Why are thousands of subreddits going dark?",
    "Thousands of Reddit communities go dark to protest company's new API changes",
    "Reddit Suffers Outage as Thousands of Subreddits Go Private for API Protest",
    "Reddit says protesting communities crashed the site",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Reddit faces mass protest over its API changes",
    "Reddit's massive ‘blackout’ protest, explained",
    "Bitcoin, Cardano, and CryptoCurrency forums on Reddit limit access, protest API changes",
    "Apollo To Shut Down June 30th, Leading Many of the Largest Subreddits to Stage a Blackout",
    "Reddit's Site-Wide Protests Resulted In A Major Outage",
    "Reddit goes down fully as thousands of subreddits protest API changes",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "Reddit down amid major protest",
    "7,178 subreddits and counting have gone dark today in protest of a 3rd-party app pricing calamity",
    "Almost every subreddit has gone dark in protest of Reddit's proposed API changes",
    "48-hour Reddit user blackout kicks off, affecting 8K subreddits",
    "Here's Why Thousands of Subreddits Are Now Private",
    "Reddit Goes Down As Communities Protest Wildly Unpopular Changes [UPDATE]",
    "Over 2.5B Reddit users flee to protest API changes",
    "Reddit Blackout darkens popular Windows and Microsoft subreddits",
    "Reddit crypto communities go dark — Here's why",
    "Reddit blackout: What, why and how it is impacting users",
    "How to join a private subreddit: Guide",
    "Reddit went down amid blackout protest over company's new policy",
    "Reddit API charges spark community outrage, dayslong blackout",
    "Reddit faces backlash as thousands of subreddits go dark in protest against API access charges",
    "r/iPhone is the first victim of this latest strike against Reddit",
    "Is Reddit Down? Why Your Favorite Subreddits Went Private",
    "Redditors are turning subreddits dark in protest over CEO's API stance",
    "Reddit Communities Go Private in Protest Over Policy Adjustments",
    "Is Reddit Down? How To Check Server Status",
    "It Sounds Like The Widespread Reddit Blackout Has Crashed The Overall Site, Too",
    "Reddit not working today? It's a protest, and here's what you need to know",
    "What's going on in Reddit; over 6K subreddits go dark to protest new API pricing [details]",
    "@viticci@mastodon.macstories.net",
    "@mainframed767@infosec.exchange",
    "According to https://reddark.untone.uk/, 92.6% (7234/7806) of subreddits have gone private.",
    "The Reddit strike has begun, and there's a great site to track it. https://reddark.untone.uk/",
    "Reddit is having server issues right now on top of the subreddit blackout. What a dumpster fire.",
    "the ongoing Reddit drama is once again a reminder that adtech is a horrible business model",
    "Reddit is Crashing Because of the Growing Subreddit Blackout",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft From Closing Activision Deal",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC seeks injunction to block $68.7B Microsoft acquisition of Activision Blizzard",
    "Report: FTC will file to block Microsoft's $69B Activision Blizzard acquisition",
    "US FTC seeks to block Microsoft's acquisition of Activision -source",
    "FTC Reportedly Plans to File an Injunction Against Microsoft's Acquisition of Activision Blizzard",
    "FTC to ask court to block Microsoft's $69 billion Activision deal",
    "FTC aiming to block Microsoft's Activision Blizzard acquisition with injunction",
    "Report: FTC to file injunction to block Microsoft-Activision merger",
    "Microsoft Needs Activision to Expand on Mobile: Spencer",
    "FTC expected to file injunction to block Microsoft's purchase of Activision Blizzard",
    "FTC to Seek Restraining Order to Block Microsoft's Purchase of Activision: Report",
    "FTC to Seek Injunction Blocking Microsoft Purchase of Activision-Blizzard",
    "The FTC Is Trying To Stop The Microsoft, Activision Blizzard Deal Again",
    "FTC reportedly filing injunction to temporarily block Microsoft's Activision Blizzard deal",
    "The FTC doubles down on its opposition to Microsoft acquiring Activision with a new injunction",
    "FTC reportedly set to file an injunction against Microsoft's purchase of Activision Blizzard",
    "When will Microsoft's buyout of Activision Blizzard be completed?",
    "FTC to file injunction blocking Microsoft, Activision Blizzard transaction",
    "The FTC May File an Injunction to Block Microsoft's Activision Blizzard Purchase",
    "FTC Reportedly Plans To File An Injunction To Block Microsoft Activision Merger",
    "The FTC will reportedly file for an injunction against Microsoft's Activision deal.",
    "FTC Moves to Block Microsoft's Activision Blizzard Deal",
    "FTC To Seek Injunction Halting Microsoft-Activision Deal, And The Xbox Company Is Happy About It",
    "FTC expected to block Microsoft's $69B purchase of Activision Blizzard: report",
    "Activision Blizzard piles in to support Microsoft's CMA appeal",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "Former exec accused of trying to clone entire Samsung chip fab on Chinese soil",
    "Ex-Samsung Elec executive accused of stealing secrets for China chip factory",
    "Ex-Samsung exec indicted for stealing trade secrets to build copycat plant in China",
    "Former Samsung exec accused of stealing data to build copycat chip plant in China",
    "Ex-Samsung exec arrested for trying to steal a ‘complete copy’ of a factory.",
    "Former Samsung exec allegedly stole blueprints to build a factory a mile away",
    "Former Samsung Exec Indicted for Stealing Secrets for Chinese Chip Plant",
    "Former Samsung Exec Allegedly Stole Plans for an Entire Chip Plant",
    "Ex-Samsung executive alleged to have stolen tech to recreate chip plant in China",
    "Samsung Chip Division Back in Action: Approves First Investment in Half a Year",
    "Former Samsung exec charged with stealing trade secrets to build replica chip plant in China",
    "BREAKING: Ex-Samsung employee charged for leaking chip technology to China",
    "Ex-Samsung Executive Accused of Stealing Secrets for China Chip Factory",
    "Ex-Samsung exec charged with stealing trade secrets to create copycat chip factory in China",
    "Another Biden capitulation to China https://www.wsj.com/...",
    "WSJ News Exclusive |  U.S. to Allow South Korean, Taiwan Chip Makers to Keep Operations in China",
    "Marques Brownlee on YouTube",
    "Apple 15-inch M2 MacBook Air review",
    "Apple MacBook Air 15-Inch Review: Finally, Big for Less",
    "15-inch MacBook Air review: Sometimes bigger is better",
    "The 15-inch MacBook Air offers superb battery life and portability at an aggressive price",
    "15\" MacBook Air M2 Review: The Obvious Thing!",
    "Apple MacBook Air 15-Inch Review",
    "15-inch MacBook Air review: Apple's best laptop, but bigger",
    "Apple MacBook Air 15-inch (2023) review",
    "Review: Apple's 15-inch MacBook Air says what it is and is what it says",
    "Apple MacBook Air 15-inch review: Bigger screen is an absolute dream",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "15-inch M2 MacBook Air reviews: Big screen, bigger value",
    "15-inch M2 MacBook Air (2023) Unboxing & Comparison",
    "15in MacBook Air review: Apple's best consumer laptop, just bigger",
    "15-Inch MacBook Air Reviews: The Sweet Spot for Performance, Size, and Value",
    "MacBook Air M2 15-inch review: the best laptop you can buy under €2,000",
    "15-inch MacBook Air review roundup: Big screen, big value",
    "Apple 15-inch M2 MacBook Air Review Roundup [Video]",
    "15-inch MacBook Air review roundup: Killer for consumers",
    "15-inch MacBook Air review roundup: Here are the key takeaways",
    "MacBook Air 15-inch M2 review round-up - here's what reviewers think",
    "NEW VIDEO - 15\" M2 MacBook Air Review: The Obvious Thing! https://www.youtube.com/... [image]",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "M2 Ultra Mac Studio review: Top of the line",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "Mac Studio review roundup: The Pro's choice",
    "Apple's M2 Ultra Seemingly Can't Beat AMD and Intel Rivals",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio (M2 Max) review: Re-filling the need for speed",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "New 2023 Mac Studio Review Roundup [Video]",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "EU reportedly set to greenlight Broadcom's $61B VMware acquisition",
    "Google to get hit with EU antitrust charges",
    "Google reportedly faces fresh EU antitrust charges over ad tech policies",
    "Brace for it... https://twitter.com/...",
    "Google To Get Hit With EU Antitrust Charges for Ad Tech Abuses",
    "AI is polluting the Internet, so one writer bought a physical encyclopedia set instead",
    "Are you an information prepper? … That's why he bought the only remaining …",
    "PM London Tech Week speech: 12 June 2023",
    "Sam Altman Is ‘Optimistic’ He Can Get the AI Laws He Wants",
    "PM urges tech leaders to grasp generational opportunities and challenges of AI",
    "Rishi Sunak touts UK AI safety research at London Tech Week",
    "UK government will get early access to OpenAI and Google's AI models for safety purposes",
    "UK to get ‘early or priority access’ to AI models from Google and OpenAI",
    "Rishi Sunak's plans for AI - revealed | i Exclusive",
    "Google, OpenAI will share AI models with the UK government",
    "AI could be used to provide ‘personalised learning’ to schoolchildren, Rishi Sunak says",
    "Sunak Says DeepMind to Offer UK Priority Research Access",
    "Sunak wants UK to be ‘geographical home of global AI safety’",
    "‘OpenAI, DeepMind have agreed to open up models to the UK government’",
    "Free Figma template of onboarding & activation designs",
    "San Francisco Business Journal",
    "Expanding to the UK  —  Over the last year it has become clear that blockchains …",
    "A16z Chooses London as Destination for First Office Outside U.S.",
    "Andreessen Horowitz (\"a16z\") Announces its First International Expansion to the United Kingdom",
    "Andreessen Horowitz Picks Crypto-Friendly London as International Base",
    "Gensyn AI Secures $43M for Decentralized Machine Learning Led by a16z",
    "Andreessen Horowitz announces plans for a London-based crypto accelerator",
    "Andreessen to Open London Office for Crypto Startups Amid Scrutiny in U.S.",
    "VC Firm Andreessen Horowitz Lured By UK's Crypto Regulatory Environment To Open London Office",
    "a16z opening London crypto office citing ‘predictable’ environment",
    "Blockchain-based, AI compute protocol Gensyn raises $43 million in a16z-led round",
    "A16z picks crypto-friendly London for first non-US base",
    "Blockchain-based marketplace for compute power Gensyn raises $43 million",
    "Andreessen Horowitz announces first international expansion—a U.K. crypto outpost",
    "Andreessen Horowitz to open London crypto office in first push overseas",
    "Andreessen Horowitz to open crypto branch in London",
    "London lures a16z's first international office with ‘predictable’ crypto regs",
    "Gensyn Completes $43 Million Series A Funding",
    "The Crypto Exodus Begins: Will Andreessen Horowitz Lead the Way for Crypto Away From the U.S?",
    "Gensyn AI Receives $43M in a Series A Round Led by a16z",
    "Andreessen Horowitz To Open Crypto Office In London",
    "Venture Firm Andreessen Horowitz To Open 1st UK Office Amid Crypto Scrutiny In US",
    "Andreessen Horowitz (A16z) Opens First Office Outside The US In London",
    "Venture Capital Titan a16z Sets Sights on London for First International Outpost",
    "Sunak praises a16z's UK expansion, Winklevoss twins warn ‘war on crypto’ hurts Democrats",
    "Andreessen Horowitz sees UK as future home of crypto",
    "A16z crypto opens first overseas office in UK",
    "Breaking: UK PM Rishi Sunak Welcomes a16z Crypto First Expansion Amid US Woes",
    "Andreessen Horowitz to open its first international office in London",
    "US venture capital firm Andreessen Horowitz to open London office",
    "Andreessen Horowitz's doubles down on blockchain establishing first international office in London",
    "Sunak Keeps Up Push To Make UK a Leader in AI Regulation",
    "Absolutely mad https://twitter.com/...",
    "it's called u16k now actually https://twitter.com/...",
    "This is a win for the UK. Congrats to @a16z and the UK Crypto community. https://twitter.com/...",
    "Are US politicians paying attention? https://twitter.com/...",
    "UK is having its “How can I help” Miami moment for crypto.... https://twitter.com/...",
    "BRITISH DYNAMISM https://twitter.com/... [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Embrace the future of note-taking with Noteboard",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/12 - Why Your Favorite Subreddit Might Go Dark.",
    "Jun 8-12VIRTUAL: Summer Game Fest",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Percepto raises $67M for industrial inspection drone technology platform",
    "Israeli drone maker Percepto raises $67 million after US regulatory nod",
    "Percepto Raises $67M in Series C Funding",
    "Percepto raises $67 million to meet demand for automated drones",
    "Robinhood Markets, Inc. Reports May 2023 Operating Data",
    "Robinhood saw crypto trading volumes plummet 43% in May",
    "Robinhood's Crypto Trading Takes a Major Hit: May Volume Falls 68% to $2.1B",
    "Robinhood reports mixed operating data for May 2023, user engagement down",
    "Robinhood Reports 68 Percent Decline in Crypto Trading Compared to 2022",
    "Salesforce Announces AI Cloud - Bringing Trusted Generative AI to the Enterprise",
    "Salesforce pledges to invest $500M in generative AI startups",
    "Salesforce unveils AI Cloud offering, doubles fund for AI startups to $500 mln",
    "Salesforce Ventures Doubles Down On AI Investments",
    "Salesforce bets big on AI, with new products and increased investment",
    "Salesforce launches AI Cloud to bring models to the enterprise",
    "Salesforce Ups Generative AI Fund to $500M, Launches AI Cloud",
    "Salesforce to invest $500 million in generative AI startups; unveils new AI Cloud offering",
    "Salesforce adds generative AI support across its application portfolio",
    "Salesforce announces AI Cloud to empower enterprises with trusted generative AI",
    "Salesforce Expands AI Tool Set and Doubles Venture Fund for AI Startups",
    "A Massive Vaccine Database Leak Exposes IDs of Millions of Indians",
    "India Investigates COVID Vaccine Data Breach",
    "Govt probes CoWin data breach claims",
    "Telegram bot leaks CoWIN data",
    "CoWin not directly breached: Rajeev Chandrasekhar on reports of Covid vaccination app",
    "CoWIN data leak: Personal data including Aadhaar, PAN number leaked on Telegram, says report",
    "Aadhaar, PAN card data of COVID vaccine takers' leaked on Telegram via CoWIN portal: Report",
    "Simple but important chart https://twitter.com/...",
    "@mattburgess@infosec.exchange",
    "Nasdaq buys financial software maker Adenza in $10.5B deal",
    "Hello, What? Nasdaq Pays $10B For Adenza",
    "Nasdaq to buy financial software firm Adenza for $10.5 bln",
    "Nasdaq to Acquire Financial-Software Firm Adenza for $10.5 Billion",
    "Nasdaq to buy Adenza for $10.5bn in US exchange operator's biggest deal",
    "Nasdaq Buys Software Firm Adenza From Thoma Bravo for $10.5 Billion",
    "Nasdaq to buy financial software company Adenza in $10.5 billion cash-and-stock deal",
    "Nasdaq to Buy Financial-Software Firm Adenza for $10.5 Billion",
    "Nasdaq to acquire financial services software company Adenza from Thoma Bravo for $10.5B",
    "Nasdaq buys fintech software Firm Adenza for $10.5 billion to accelerate growth",
    "Nasdaq Pays $10.5 Billion for Risk Management Firm Adenza",
    "Nasdaq acquires Adenza for $10 billion",
    "Nasdaq Buys Software Firm Adenza for $10.5 Billion to Boost Growth",
    "Wow, 17x ARR Growing 18% at $590m ARR ... but ... Adjusted EBITDA of 58% https://twitter.com/...",
    "Dutch government to screen Chinese tech students on security risks",
    "HSBC Innovation Banking launches at London Tech Week",
    "HSBC Innovation Emerges From Ashes of SVB UK",
    "HSBC Unveils HSBC Innovation Banking with Expertise Help from Its Silicon Valley Bank UK (SVB UK)",
    "Coadec follows Silicon Valley Bank UK and goes for a new look",
    "HSBC builds innovation division from the bones of collapsed SVB UK",
    "Silicon Valley Bank: SVB UK is now HSBC Innovation Banking",
    "HSBC relaunches SVB as HSBC Innovation Banking",
    "HSBC Innovation Banking officially launches from the ashes of Silicon Valley Bank UK",
    "Stanford Cyber Policy Center",
    "Reddit revolt puts CEO Steve Huffman in a tough position",
    "Report: Hong Kong Residents Locked out of Big Tech AI Boom",
    "Charles Mok  — Visiting Scholar, Global Digital Policy Incubator",
    "OpenAI, Microsoft, Google limiting AI chatbot access in Hong Kong: report",
    "Google and OpenAI limit A.I. chatbots in Hong Kong amid China tensions, report says",
    "HK Court Plans Hearing on Interim Ban of Protest Song in July",
    "Who needs the Metaverse? Meet the people still living on Second Life",
    "MusicGen Demo  —  MusicGen This is the demo for MusicGen, a simple and controllable model …",
    "Audiocraft  —  Audiocraft is a library for audio processing and generation with deep learning.",
    "Meta's Open-Source ‘MusicGen’ AI Is Like ChatGPT for Tunes",
    "Meta open sources an AI-powered music generator",
    "Meta now has an AI model that can create music from text prompts",
    "Meta's open-source MusicGen AI uses text to create song genre mashups",
    "Meta's new MusicGen AI was trained on 20k hours of (licensed) music",
    "Simple and Controllable Music Generation",
    "MusicGen can be conditioned on a chromagram. https://twitter.com/...",
    "@_akhaliq That is by far some of the cleanest AI generated music I have ever seen (and heard😅)",
    "Take On Me - AI Cover #MusicGen [video]",
    "making foley percussion loops with musicgen [video]",
    "This new MusicGen model from Meta is seriously impressive! https://twitter.com/... [image]",
    "oh this is fun! https://twitter.com/...",
    "Meta's MusicGen is insanely good - this is the StableDiffusion moment for music: [video]",
    "Having lot's of fun with this, especially the melody conditioning feature. https://twitter.com/...",
    "Meta just released MusicGen"
]