[
    "@Cdespinosa@mastodon.social",
    "@jeremyburge@mastodon.world",
    "@Gartenberg@mastodon.social",
    "@ashfurrow@masto.ashfurrow.com",
    "@GossiTheDog@cyberplace.social",
    "@film_girl@mastodon.social",
    "Apple reveals Vision Pro, a AR/VR headset unlike any other",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple Reveals ‘Vision Pro’ Headset",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "The Apple Vision Pro headset will cost $3,499, out early 2024",
    "Vision Pro: Apple Finally Unwraps Ambitious, Long-Rumored VR Headset at WWDC",
    "Apple Announces Vision Pro AR/VR Headset",
    "Apple uncovers its clever VR glasses in the biggest new launch since the iPhone",
    "Apple Reveals Vision Pro Augmented Reality Headset",
    "Apple announces mixed reality headset Vision Pro",
    "Apple unveils long-awaited Vision Pro mixed-reality headset at WWDC",
    "Apple Vision Pro will launch with over 100 Apple Arcade games",
    "Apple Vision Pro mixed-reality headset launches at WWDC after years of rumors",
    "Apple launches Vision Pro, a VR headset it hopes will be most important product since iPhone",
    "Apple launches its virtual- and augmented-reality headset: Apple Vision Pro",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "EyeSight on Apple Vision Pro makes wearing a headset slightly more human",
    "Disney+ will be available on the Apple Vision Pro at launch",
    "Apple Unveils the Mixed Reality Headset ‘Vision Pro’",
    "Apple just revealed its first major product in over 8 years — meet the ‘Vision Pro’",
    "Tim Cook unveils Apple Vision Pro mixed reality headset",
    "Apple Debuts Vision Pro Headset in Search of Post-iPhone Future",
    "Apple Reveals ‘Vision Pro’ Mixed Reality Headset at WWDC 2023",
    "The Vision Pro is Apple's long-awaited AR/VR headset",
    "Apple Announces Vision Pro, Its Mixed Reality Headset",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "Apple Is Coming Out With A New VR Headset",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "Apple Vision Pro AR headset revealed at WWDC 2023",
    "New Apple Vision Pro XR headset puts the Quest Pro to shame",
    "Apple's Mixed Reality Headset, Vision Pro, Is Here",
    "Apple launches Vision Pro, its first-ever augmented reality headset",
    "Apple Vision Pro is here and we're never leaving the house — here's a list of everything it can do",
    "Apple Officially Reveals Vision Pro, Its New Mixed Reality Headset",
    "Meet Apple Vision Pro: the human virtual reality headset!",
    "Apple unveils Vision Pro ‘mixed reality’ headset in hotly anticipated launch",
    "Apple Unveils Vision Pro Virtual Reality Headset, Its First Major Device Launch In Nearly A Decade",
    "Apple just announced its first major product since 2014: The Vision Pro",
    "Apple announces VR and AR headset the Vision Pro - everything we know",
    "Apple AR/VR headset: Vision Pro features, price, specs, release date and more",
    "Apple previews Vision Pro headset",
    "Apple Vision Pro VR/AR HMD revealed at WWDC 2023",
    "Apple Vision Pro is an AR/VR Headset and a 3D Camera",
    "Apple Vision Pro augmented reality headset promises a “spatial computing” experience",
    "Apple reveals Apple Vision Pro",
    "Apple Finally Reveals Long-Awaited AR Headset, Vision Pro",
    "Apple announces Apple Vision Pro, it's long-awaited VR headset",
    "Live: Expectations of Apple's headset set to meet reality",
    "Apple announces Apple Vision Pro headset",
    "Apple Unveils Hotly-Anticipated Headset: The Vision Pro",
    "M2 chip coupled for R1 for sensing.",
    "Goodbye to Jony's White World  —  Say hello to Tim's Dark Dungeon",
    "So to watch a movie with the family everyone is going to need to own one?",
    "Apple bringing back Glassholes 10 years later.",
    "@glassbottommeg@peoplemaking.games",
    "VisionPro must not have the processing power required to render dinosaur feathers I guess",
    "“Facial Video” is the new euphemism for home made porn.",
    "Here's the battery pack [image]",
    "This will be the new Patagonia Vest for Silicon Valley VCS",
    "should i buy a used car or an apple vision pro",
    "Oh there's someone using a keyboard. So that's interesting. Yeah I want one.",
    "the Vision Pro seems like a lonely device",
    "time to get a new mortgage 🥴 [image]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "$3499 ... damn the rumors should have said $4k if they wanted to sandbag it",
    "Apple Vision Pro: $3500, early next year, US only first.",
    "Wow! Disney Plus on Apple Vision Pro looks truly magical. [video]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "Hopefully the product is better than the movie :shudder: https://twitter.com/...",
    "Apple Vision Pro starts at $3500 available early next year. [image]",
    "going to wear a vision pro into molotov's",
    "“Buy the rumor, sell the news!” https://twitter.com/...",
    "Market is... not into the Apple Vision Pro! https://t.co/...",
    "Lordy, this vision pro presentation is making Meta look like dogshit.",
    "There will be a new App store for visionOS #WWDC23 [image]",
    "This line is haunted: “video conferencing apps can leverage your digital persona”",
    "Microsoft Excel, Word, and Teams in Apple Vision Pro [image]",
    "The entire TV set market right now. [image]",
    "I am looking at two 32\" monitors and it's a field of vision problem.",
    "can't wait to confidently blurt our “no updates from me” while looking like this [image]",
    "I'm watching every single idea and patent we filed at Magic Leap",
    "“It completely frees your hands from needing clumsy controllers” [image]",
    "Apple Vision Pro has to be one of the most impressive pieces of technology I have ever seen.",
    "New spatial sound system Vision Pro matches the sound of your room using audio raytracing [image]",
    "Standing in line for Apple Glasses.",
    "Yep, don't think all the reports were to sandbag on the cost here... This tech is nuts. #wwdc23",
    "Their new Jony Ive sounds a lot like their old Jony Ive.",
    "we studied thousands of heads!",
    "We're all about to look like we're scuba diving through real life. 🤿 [image]",
    "If I'm wearing goggles like that there better be a mountain nearby https://twitter.com/...",
    "“We studied thousands of heads”",
    "Man, Meta's Reality Labs team must not be feeling too great today",
    "Not a word on battery life.",
    "I feel kind of sorry for Meta.",
    "Mark Zuckerberg is having a bad day.",
    "Dictating Typing Typing on glass Typing on air Dictating",
    "What do others see when I'm FaceTiming with a headset?",
    "Steve wouldn't have named it Vision Pro though...",
    "Being able to see people's eyes while people are nearby is cool, but a little creepy ngl",
    "GIVE ME THE FACE BUBBLE [image]",
    "i am absolutely gonna be wearing these to da club [image]",
    "Looking forward to getting laid off by this person someday [image]",
    "Funny joke @gruber 😜 [image]",
    "this is the most dystopian device apple has ever announced",
    "we are not serious people [image]",
    "This is the video camera from Minority Report! #WWDC23",
    "Vision Pro is basically the standard VR experience with Apple polish—not revolutionary",
    "This is the most mind blowing product I've ever seen. Apple just changed everything, again.",
    "💯🥽 #WWDC23 https://twitter.com/... [image]",
    "Wall St: Vision Pro to disrupt external monitor sales.",
    "How long until somebody uses this on a plane?",
    "Home Theater for NYC apartments.",
    "3D movies in headset. Avatar. I literally wrote about this",
    "3D cameras — Well, I guess we know what to expect in the iPhone 15 Pro now...",
    "got my new apple headset [image]",
    "Room dims as things are played: Magic Leap 2 has this feature too, I thought it was cool",
    "Vision Pro is also a 3D camera. They call it a Spatial photo or video. #WWDC23 [image]",
    "Notice that really long wire.",
    "I can't wait to see the first one of these in Starbucks.",
    "At this point, I can't imagine my life without Apple Vision Pro. I'm serious. [image]",
    "i need to know where this mystery cord is going",
    "Did any leak get the name Vision Pro right?",
    "Everyone saying before they weren't going to get Apple's headset just changed their mind.",
    "The killer app for AR. Infinite monitors. [image]",
    "apple invents an augmented reality headset and they're like “so you can run safari in it”",
    "How many things has Zuck thrown and broken so far https://twitter.com/...",
    "Apple is so much better at this than Facebook.",
    "brb im immersed please leave a message [image]",
    "No AR/VR demo ever captures how mediocre the actual user experience is.",
    "More or less exactly as rumoured. [image]",
    "brb, going skiing inside my mac [image]",
    "whatever you do, don't look into their ey.....! [image]",
    "Fitting Apple has one of its design leaders discuss Apple Vision Pro.",
    "No controllers. Everything is controlled with hand movements. [image]",
    "Bloomberg Terminal on Vision Pro when",
    "So “Spatial Computing” is how Apple is articulating what Meta essentially means with “Metaverse”",
    "Apple using lots of work/productive use cases as the lead is smart.",
    "I'm buying this Day 1. https://twitter.com/...",
    "snorkeling never looked so good with Apple Vision Pro [image]",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "VisionOS is Apple's latest operating system",
    "Apple Vision Pro headset runs visionOS with a 3D-spatial user interface",
    "xrOS: Apple's new OS - What is it? What to expect?",
    "Apple Vision Pro: This is Apple's New Headset",
    "Apple Vision Pro raises the bar for VR and AR headsets",
    "Apple launches new 15-inch MacBook Air and M2 Ultra-powered Mac Studio",
    "Apple WWDC event 2023: All the new products for launch, from VR headset to iOS 17",
    "WWDC 2023: Follow along with every Apple announcement live!",
    "Everything Announced at Apple's WWDC 2023",
    "The iOS 17 Public Beta will be headed to an iPhone near you really soon",
    "Apple announces Mac Pro with M2 Ultra chip at WWDC 2023 keynote",
    "An example of great interaction between brands 😂 @McDonalds @AXE [image]",
    "Sorry but I've heard Jonny Ive say “aluminum” and you are no Jonny Ive.",
    "BRB, selling all my Apple stock",
    "the best part about apple vision pro is that it makes you look like a dick",
    "my insurance is called Vision Pro lmao",
    "damn...it's a sega genesis controller for the face [image]",
    "Apple Vision Pro is the first Apple product you look through not at. [image]",
    "A new AR platform with a revolutionary product.... $AAPL",
    "watchOS “Time in Daylight” also perfect to protect Dracula. #wwdc23",
    "Apple: Please tell us how you're feeling at all times. Don't worry, this data is all yours!",
    "FaceTime is coming to Apple TV. Your iPhone is the camera. #WWDC23 [video]",
    "iPhone can now help you locate the Apple TV remote [image]",
    "Huge software improvements to AirPods was not on my bingo card. But great!",
    "Did Apple just implement inpainting in its video conferencing tech?",
    "Uh oh, now @mmhmmapp getting some pressure from Apple too.",
    "The photo was taken around the same area! https://twitter.com/...",
    "OK I wasn't going to be that mean. https://twitter.com/...",
    "lots more apps sherlocked. Feel bad for journal app developers. also Palm beaming Sherlocked",
    "macOS Jersey Shore https://twitter.com/...",
    "Desktop widgets! Truly what's old is new again.",
    "Apple updates iPadOS. #WWDC23 [image]",
    "Also if this is all happening on-device there's a model loaded in memory here.",
    "Apple is dropping “hey” from the hands free Siri command #WWDC23 [image]",
    "YOOOOO #WWDC23 macOS Sonoma [image]",
    "- Here's a cool new Standby feature, with an accessory we'd love to sell you! [image]",
    "AirDrop now works by bringing two devices together #WWDC23 [image]",
    "apple using better AI to make autocorrect not terrible would actually be a good thing if it works",
    "⌨️ It's about ducking time. Big autocorrect and typing predictions coming.",
    "iMessage apps didn't really get traction so now they are tucked away.",
    "Man there a lot of consumer updates for a developer conference here",
    "Mac pro with m2 ultra. Been waiting for this for keeping 10 tabs open in chrome.",
    "damn this new mac pro is a whole pixar studio in one cheesegrater box",
    "Apple is updating Mac Pro with Apple Silicon #WWDC23 [image]",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "Thanks to AI, iOS 17 will learn your swears",
    "iOS 17: These five new features make us eager to upgrade",
    "iOS 17's Live Voicemail lets you read a voicemail in real time",
    "Apple Unveils iOS 17 for the iPhone at WWDC 2023",
    "With iOS 17, Apple introduces new journaling app, refreshes communication apps",
    "Apple Announces New ‘NameDrop’ Contact Sharing Feature Coming in iOS 17",
    "iOS 17 Messages adds emoji tapbacks, stickers, audio message transcription, more",
    "Apple is changing the ‘Hey Siri’ trigger phrase to just ‘Siri’ in iOS 17",
    "iOS 17 will transcribe your audio messages, customize contact posters",
    "iOS 17 will bring two new cool features to your iPhone's Phone app",
    "Apple adds Wallet app to Apple Business Register",
    "NameDrop allows for easy transfer of contact info. Very 1996 PalmPilot. [image]",
    "OK, NameDrop is dope. This is what we had with Bump back in the day. https://twitter.com/...",
    "This NameDrop thing is so 🔥 !!! #WWDC23",
    "PalmPilot users: “Does NameDrop use Infrared????”",
    "How do you NameDrop a fake number? Asking for all women",
    "iOS 17 is one of the smallest updates ever it seems. #WWDC23 [image]",
    "oh my god you can FINALLY share airtags in ios 17 [image]",
    "Namedrop - Apple reinvents the Palm IR contact blaster with NFC.... [image]",
    "Apple's iOS 17 adds better autocorrect, journaling, clock-like StandBy, and more",
    "Apple is putting AirPlay in hotels",
    "StandBy is a new iPhone feature that could be great for Apple Home users",
    "iOS 17 makes iPhone more personal and intuitive",
    "Apple makes contact sharing easier in iOS 17 with NameDrop",
    "AirDrop in iOS 17 will let you share contact info by bringing two iPhones close together",
    "Apple Revamps iPhone Software With Journaling App, StandBy Mode",
    "Apple introduces a dedicated ‘Journal’ app to log your daily experiences",
    "iOS 17 Includes Updated Phone, FaceTime, and Messages Apps",
    "Apple announces new landscape ‘StandBy’ mode for iOS 17 lock screen on iPhone",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "WWDC 2023: Apple introduces contact sharing feature NameDrop; what is it and how it works",
    "Vote now: What's your favorite iOS 17 feature?",
    "Apple unveils iOS 17 at WWDC 2023, here are the new features",
    "Apple reveals iOS 17 with improvements to Messages, AirDrop and more",
    "Apple is adding a brand new app to your iPhone with iOS 17",
    "iOS 17 Lets You Turn Your Photos and Videos Into Custom Stickers",
    "Forget ‘Hey Siri’ - Apple Is Changing The Trigger To Just ‘Siri’ In iOS 17",
    "The History of iOS, from Version 1.0 to 17.0",
    "iOS 17 Updates Your iPhone With Live Voicemail, Improvements To Messages And FaceTime",
    "iOS 17 Adds StandBy, Live Voicemail, Check In",
    "iOS 17 announced at WWDC 2023: Here's what's coming to iPhone 15",
    "iOS 17 adds Live Voicemail, Standby Mode & Offline Maps",
    "feel like this new Apple Journal app is basically Facebook-ish for an audience of one [image]",
    "iOS 17 Standby mode #WWDC23 What is this dock!?! I need it [image]",
    "New iPhone standby mode is an excuse to sell a $100 horizontal stand charger thingy isn't it?",
    "Apple's new Journal app is coming to iPhone: Everything you need to know",
    "Apple's new ‘Journal’ app will help you kickstart a daily diary habit",
    "iOS 17 introduces advanced communication features, Journal app, Standby mode, and much more",
    "Apple announces iOS 17 with StandBy feature, new Journal app, Message improvements, and more",
    "Love the App icon of Journal 😻 [image]",
    "US District Court for the District of Columbia",
    "International Business Times",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC Sues Binance and CEO Zhao for Breaking US Securities Rules",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "Crypto Exchange Platform Binance, CEO Zhao Accused Of Commingling Funds",
    "Crypto shares tumble after U.S. SEC charges Binance with securities law violations",
    "Binance Pushes Back on SEC Lawsuit, Denies Commingling User Assets",
    "Binance and CEO Changpeng Zhao Face SEC Lawsuit, Triggering Red Tide in Crypto Market",
    "SEC says crypto firm Binance mishandled funds, violated securities laws",
    "Coinbase Shares Drop 10% Following SEC's Suit Against Binance",
    "SEC Sues Binance, CEO Changpeng Zhao for Violating Securities Laws",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "SEC sues Binance and accuses crypto exchange of mishandling funds",
    "Binance faces SEC charges for allegedly mishandling funds and dodging rules",
    "Home/  Technology / SEC Says Binance Misused Customer Funds, Ran Illegal Crypto Exchange in U.S.",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "SEC sues Binance, world's largest crypto exchange",
    "Solana, Polygon, Cardano, and BNB named as securities in SEC's suit against Binance",
    "Binance Accuses the SEC of Taking a Unilateral Decision to Define Crypto Market",
    "Binance Sees $69 Million in Outflows in an Hour Following SEC Charges",
    "US SEC Files Fresh Charges Against Binance and CEO Changpeng Zhao",
    "U.S. SEC Unleashes Fury on Binance and Its CEO",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "Binance Executive Controlled Bank Accounts Belonging to U.S. Wing in 2019-20: Reuters",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Apple announces Mac Pro with M2 Ultra, starting at $6,999",
    "Apple announces new Mac Pro powered by M2 Ultra: PCI expansion, $6999 starting price",
    "Apple Introduces New Mac Pro With M2 Ultra Chip, Available to Order Starting Today",
    "Apple Unveils 15-Inch MacBook Air, Mac Pro With M2 Ultra Chip",
    "All the Mac news from WWDC 2023: Mac Pro, Mac Studio, and M2 Ultra",
    "Apple announces rack-mountable Mac Pro with Apple silicon",
    "Mac Studio with the M2 Ultra is the most powerful personal computer ever",
    "Apple launches the M2 Ultra chip powering the new Mac Pro and Mac Studio",
    "Apple refreshes the Mac Pro with its new M2 Ultra chip",
    "Mac Pro: Apple finally updates its most powerful computer",
    "The new Mac Pro brings PCI expansion to Apple Silicon for the first time",
    "Apple Upgrades Mac Pro to M2 Ultra Silicon",
    "Apple Silicon Mac Pro debut finally ends transition away from Intel processors",
    "This is the new Apple Silicon Mac Pro",
    "Apple surprise-launches new Mac Pro with Apple Silicon",
    "Apple's upgraded Mac Studio includes the M2 Max or M2 Ultra chip",
    "Apple Unveils M2 Ultra Chip as Most Powerful Apple Silicon Chip Yet",
    "Apple M2 Ultra chip announced at WWDC 2023 as upgrade to Mac Studio and Mac Pro",
    "15-inch Apple MacBook Air, Max Studio and Mac Pro with M2 Ultra chip revealed at WWDC 2023",
    "Apple completes its transition to in-house chips with M2 Ultra Mac Pro",
    "The new Apple silicon Mac Pro completes the transition away from Intel",
    "New M2 Ultra Mac Pro & Mac Studio Launched",
    "Mac Pro finally gets updated to Apple silicon, is 3X faster",
    "Apple Announces New Mac Pro with M2 Ultra",
    "Apple unveils new Mac Studio and M2 Ultra Mac Pro",
    "Mac Studio Specs Upgraded With Apple's New M2 Ultra Chip",
    "Apple finally reveals new Mac Pro at WWDC 2023",
    "Mac Studio with M2 Ultra chip is real and proves there's life in the Studio yet",
    "Apple Unveils New Mac Pro with M2 Ultra",
    "Apple's new Mac Pro delivers on a years-old promise",
    "Apple Announces Brand-New Mac Pro with Apple Silicon and PCI Expansion",
    "Apple unveils new M2 Ultra Mac Pro",
    "Ultra-powerful Mac Pro finally gets Apple silicon treatment",
    "@MKBHD This is an insane update for MacStudio",
    "Apple introduces the 15‑inch MacBook Air",
    "Apple Announces New MacBook Air With 15.3-inch Display and M2 Chip",
    "Apple launches the new 15-inch MacBook Air",
    "15-Inch MacBook Air M2 Preorder: Where to Buy Apple's Latest Laptop",
    "Everything Apple Announced at WWDC 2023",
    "The 15-inch MacBook Air is the world's thinnest 15-inch laptop",
    "Apple finally announces the 15-inch MacBook Air for $1,299",
    "Apple Debuts 15-inch MacBook Air at WWDC",
    "The MacBook Air gets bigger with new 15-inch model",
    "Apple unveils 15-inch MacBook Air, available to order today for $1299",
    "Apple's $1,299 15-inch MacBook Air is its largest to date",
    "Apple's new 15-inch MacBook Air with M2 processor is 12x faster than Intel's version",
    "WWDC 2023: Apple introduces new 15.3-inch MacBook Air with M2 chipset. All details",
    "15-inch MacBook arrives at WWDC 2023 — is the cheapest big-screen MacBook for you?",
    "15-inch MacBook Air made official at WWDC 2023",
    "Apple Debuts Larger MacBook Air, Mac Studio With Faster Chip",
    "Apple Launches Impressive 15.3-inch MacBook Air with Powerful M2 Chipset at WWDC 2023",
    "15-inch Apple MacBook Air Revealed, Has Liquid Retina Display and 18-Hour Battery Life",
    "Apple Confirms New Powerful 15\" MacBook Air With M2 Chip",
    "Apple Unveils 15-Inch MacBook Air, Slashes Price On 13-Inch Model",
    "The MacBook Air 15-inch is official, and it's powered by M2",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "Apple Mac Studio Update at WWDC: M2 Ultra Option Debuts",
    "Mac Pro with Apple Silicon Finally Here to Complete Transition Away From Intel",
    "Apple's new M2 Ultra chip offers even more ridiculous performance than before",
    "As rumored, the Mac Studio gets an M2 refresh, including fused-together M2 Ultra",
    "Apple announces the M2 Ultra with up to 192GB of memory",
    "Apple announces M2 Ultra chip with double the CPU and GPU cores",
    "Apple Announces New Mac Studio With M2 Max and M2 Ultra Chips",
    "Mac Studio gets updated with powerful M2 Max and M2 Ultra processors",
    "Apple's 24-Core M2 Ultra Combines Two M2 Max Dies, Powers New Mac Pro, Mac Studio",
    "Apple's Mac Studio gets an M2 Ultra and Max upgrade",
    "(PR) Apple introduces M2 Ultra SoC with 24 CPU and 76 GPU cores, 192GB of memory",
    "Apple reveals Mac Studio 2023 with huge M2 Ultra chip power",
    "Apple Announces M2 Ultra-Powered Mac Pro, 15-Inch MacBook Air",
    "M2 Ultra-powered Apple Mac Studio launches at WWDC 2023",
    "Apple upgrades Mac Studio with M2 Ultra chipset",
    "Mac Studio Gets M2 Max and M2 Ultra Support",
    "Apple M2 Ultra: What You Need to Know",
    "M2Ultra: 2 M2 Max chips glued together or something but it's bonkers #WWDC23 [image]",
    "Very excited for a Mac Studio update https://twitter.com/...",
    "How far have Twitter's advertising revenues fallen?",
    "Twitter CEO Linda Yaccarino to Start Monday",
    "Elon Musk Had Fun With Dogecoin",
    "Yaccarino takes wheel at Twitter early as advertising woes become public",
    "4 urgent tasks for new Twitter CEO Linda Yaccarino",
    "Former NBCU exec Linda Yaccarino prepares to take over Twitter CEO role from Elon Musk",
    "Linda Yaccarino replaces Elon Musk as Twitter boss",
    "Hate speech is driving advertisers away from Twitter",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify cuts 200 more jobs in podcast division amid industry struggles",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify lays off 200 people from podcasting team",
    "Spotify laying off 200 employees in second round of job cuts this year",
    "Spotify Lays Off 2% of Staff, Merges Gimlet and Parcast",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify combines podcast studios and shrinks workforce",
    "Layoffs hit Spotify's podcasting unit in ‘realingment’",
    "CISA orders govt agencies to patch MOVEit bug used for data theft",
    "Group behind Clop ransomware exploiting MOVEit zero-day, says Microsoft",
    "Clop ransomware group behind MOVEit file transfer hacks: Microsoft",
    "British Airways, BBC and Boots all hit in Zellis cyberattack exploiting MOVEit vulnerability",
    "watchOS 10 is bringing back widgets in a big way",
    "watchOS 10 brings focus back to widgets for Apple Watches",
    "watchOS 10: These are the Apple Watch models compatible with the update",
    "WatchOS 10 For Apple Watch: New Features Coming This Year",
    "watchOS 10 brings widgets and new corner icons to Apple's wearable",
    "All the New Features Apple Is Bringing to WatchOS 10 This Fall",
    "Apple commits to mental health with tracking on Watch and iPhone",
    "watchOS 10 will bring widgets, World Clock, new fitness features, and more",
    "The Apple Watch embraces widgets again in watchOS 10",
    "watchOS 10 arrives for Apple Watch, with widgets, new faces, and more workouts",
    "Apple Announces watchOS 10 With Widgets, Redesigned Apps, and More",
    "watchOS 10 for Apple Watch officially unveiled",
    "watchOS 10 makes WWDC 2023 debut: Here's what's next for Apple Watch",
    "Introducing watchOS 10, a milestone update for Apple Watch",
    "watchOS 10: Widgets, Home Screen redesign, changes in core apps, etc.",
    "Exciting new WatchOS 10 software is here to power up your Apple Watch",
    "Apple Watch now has a touch grass measurement, nice.",
    "Love the new cycling features for the apple watch. Time to get one",
    "All right, the @apple Watch upgrades are quite solid. Well done team. #WWDC23",
    "Snoopy and Woodstock on Apple Watch! #WWDC23 https://twitter.com/... [video]",
    "Stack Overflow Moderator Letter",
    "Stack Overflow Moderators Are Striking to Stop Garbage AI Content From Flooding the Site",
    "Crypto catastrophe strikes some Atomic Wallet users, over $35M thought stolen",
    "Atomic Wallet faces security breach, loses over $35 million in cryptocurrency",
    "Atomic Wallet hack leads to at least $35M in stolen crypto assets",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "Sitewide Reddit protest to happen on June 12 with 48 hours of shutdowns",
    "Reddit communities are ‘going dark’ to protest changes that would hurt third-party apps",
    "Reddit blackout planned over app-killing API prices",
    "Reddit communities plan protest on June 12 over API changes",
    "Free compensation benchmarking data from 3,000 startups",
    "Allow users to skip passwords at sign-in (beta)",
    "Safari will soon make it easier to share phishing-resistant passkeys",
    "Create and manage your Google Passkeys, here's how",
    "Google Workspace Accounts Add Passkey Support in Beta",
    "Apple TV gets FaceTime, a new control center, findable remote and more",
    "You can now FaceTime from your Apple TV",
    "FaceTime is coming to Apple TV",
    "FaceTime comes to Apple TV with tvOS 17",
    "Apple Announces tvOS 17, Including FaceTime and New Control Center",
    "FaceTime Launching on Apple TV With iPhone and iPad Camera Integration",
    "FaceTime comes to Apple TV",
    "Siri can finally find your lost Apple TV remote",
    "FaceTime comes to Apple TV with the tvOS 17 update",
    "FaceTime is coming to Apple TV with tvOS 17",
    "The Best New iOS 17 Features Coming to Your iPhone Later This Year",
    "The tvOS 17 update for Apple TV brings more FaceTime to your living room",
    "tvOS 17: FaceTime, Find My Remote and more features",
    "Apple TV getting FaceTime, Memories screensaver, and remote finder",
    "Google TV needs to copy that smart home integration in tvOS yesterday",
    "tvOS gets stage time?! Pigs are flying.",
    "woo the tvOS style screen savers on the Mac",
    "So, there's an updated Control Center. There's just one problem. It's on tvOS, not iOS... [image]",
    "tvOS now supports Find My on Apple TV remote!",
    "FaceTime on Apple TV... using your iPhone cameras [image]",
    "Apple unveils Adaptive Audio and says it'll improve AirPods' automatic switching",
    "AirPods redefine the personal audio experience",
    "AirPods noise cancellation is about to become a lot smarter",
    "Apple's adding adaptive audio to AirPods Pro",
    "Adaptive Audio and Personalized Volume on AirPods will adjust sound levels and ANC automatically",
    "AirPods Pro getting a big update in iOS 17 with Adaptive Audio",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "AirPods Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "Soon, Apple AirPods Pro will be able to react to your environment",
    "The person who made that AirPods transition had the time of their life",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Apple reveals macOS Sonoma with screensavers and widgets",
    "macOS Sonoma brings widgets to the desktop and promises gaming improvements",
    "macOS Sonoma brings widgets to the desktop",
    "MacOS Sonoma Unveiled: Your Mac Is Getting More Customizable",
    "Apple Announces macOS Sonoma with Game Mode, Upgraded Widgets and More",
    "MacOS 14 Sonoma Launches at WWDC 2023",
    "macOS Sonoma adds Game Mode, a new design for desktop widgets, and more",
    "WWDC 2023: Apple brings MacOS Sonoma",
    "Apple Announces ‘Game Mode’ in macOS Sonoma for Better Mac Gaming Performance",
    "Apple debuts macOS 14 Sonoma",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Apple announces macOS Sonoma with iMessage enhancements and aerial screensavers",
    "Apple announces macOS Sonoma with aerial screensavers, Game Mode, and more",
    "Apple announces macOS Sonoma at WWDC 2023",
    "macOS Sonoma announced: Everything you need to know",
    "macOS 14 Sonoma revealed at WWDC 2023 — widgets finally arrive",
    "macOS Sonoma brings better gaming, new AR features and souped-up Safari",
    "Apple's macOS Sonoma has a game-changing feature — literally",
    "Apple announces macOS Sonoma, adding new Game Mode, Safari updates, desktop widgets, and more",
    "Apple reveals macOS Sonoma at WWDC 2023",
    "it looks like the Windows 11 version of Bliss too, with all those ripples https://twitter.com/...",
    "Apple Webapps: “Please please please don't make us add third-party app stores” [image]",
    "Netflix is gonna hate family passwords in iCloud PWAs for Safari is sick",
    "Next year's improvement to macOS Sonoma will be called macOS Napa. [image]",
    "Safari web apps on dock. Back to the future again. My head is spinning.",
    "MacOS Sonoma wallpaper Has some windows XP vibes [image]",
    "Windows Vista lives on with MacOS Sonoma widgets. Yey! #WWDC2023 #WWDC23 [image]",
    "macOS S̶o̶n̶o̶m̶a̶ Windows XP looks alright [image]",
    "Which iPads support iPadOS 17? Here's the list ...",
    "iPadOS 17 brings interactive widgets, enhanced lock screen, Health app, and more",
    "iPadOS 17 adds upgraded widgets, customizable Home Screen, and new native apps",
    "iPadOS 17 gets a customizable lock screen, interactive widgets and Apple Health",
    "iPadOS 17 Unveiled at Apple's WWDC 2023",
    "Apple Announces iPadOS 17 With Custom Lock Screens and Interactive Widgets",
    "Apple reveals iPadOS 17 with customizable Lock Screen, Health app, more",
    "iPadOS 17 announced with interactive widgets, Lock Screen customization, more",
    "WWDC 2023: Apple to introduce Health app on iPad as part of iPadOS 17",
    "Apple announces iPadOS 17 for a more personal iPad",
    "iOS 17 unveiled at WWDC 2023 — all the new features coming to your iPhone soon",
    "Apple unveils iPadOS 17 with interactive widgets, lock screen customization, more",
    "iPadOS 17 announced at WWDC 2023: here's what's coming to your iPad",
    "iPadOS 17: Features, apps, Stage Manager improvements, availability and more",
    "iPadOS 17 brings Lock Screen customization and interactive widgets to iPad",
    "Apple reveals iPadOS 17 that takes its tablet to the next level",
    "iPadOS 17 announced with Lock Screen widgets, Health app, new tools in Freeform, and more",
    "iOS 17 Brings Tons of Quality of Life Improvements to Your iPhone",
    "iPadOS 17 Brings Customizable Lock Screen And Multiple Timers",
    "iOS 17 announced: new features, new apps, new designs!",
    "Apple all we want is a calculator app on iPad...",
    "I have to leave for a doctors appointment and you're talking about iPadOS 17? COME ON. #WWDC23",
    "both iOS and iPadOS seem like nice updates, but as rumored they are fairly light in a lot of ways",
    "Lol iPadOS is downstairs, in the cellar.",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "Province warns of ‘global cybersecurity issue’ that resulted in stolen personal info",
    "Russian hackers raid British Airways and BBC in cyber attack",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "Boots and British Airways among firms affected by global cyber attack",
    "BA's UK staff and Boots hit by cyber security breach with contact and bank details exposed",
    "British Airways, BBC and Boots Hit by Suspected Russian Cyber Attack",
    "British Airways, Boots and BBC among companies hit by cyber security attack",
    "‘Fake Putin’ announces Russia under attack as Ukraine goes on offensive",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’",
    "Carbon Health launches medical charting tool powered by GPT-4",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "VC dealmaking in UK continues to plunge",
    "Jack Dorsey Endorses RFK Jr. for President",
    "He can and will https://www.youtube.com/...",
    "Hosting @RobertKennedyJr's upcoming Space https://twitter.com/..."
]