[
    "Daniel Zhang to focus on Alibaba Cloud Intelligence Group",
    "Daniel Zhang May Focus on Cloud and Step Down as CEO of Alibaba",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Chinese e-commerce giant Alibaba names new CEO, chairman in major management reshuffle",
    "Alibaba co-founder Joe Tsai to take over as chairman from Daniel Zhang",
    "Alibaba Group Announces Chairman and CEO Succession Plan",
    "Alibaba's Zhang to step down as CEO, chairman amid business shakeup",
    "Crypto curious Joseph Tsai to take over as chair at Alibaba",
    "Alibaba Group Replaces CEO and Chair Daniel Zhang",
    "Alibaba CEO Daniel Zhang steps down as Eddie Wu takes charge",
    "Alibaba CEO to step down to focus on cloud business in surprise leadership reshuffle",
    "Alibaba Stock Drops as CEO Daniel Zhang Steps Back",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Alibaba Group In Succession Shake-up: Joe Tsai To Become Chairman; Eddie Wu Appointed CEO",
    "Meet the new CEO of Alibaba",
    "Alibaba CEO and chairman steps down to focus on cloud business",
    "Alibaba's Daniel Zhang to step down as group chairman and CEO",
    "Alibaba Says Its Chairman, Daniel Zhang, Will Leave Post in September",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Alibaba Group says Eddie Wu to succeed Daniel Zhang as CEO",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba's New Chairman ‘Likes’ Crypto",
    "Live news: Turkey lifts minimum wage by a third to soften inflation blow",
    "Daniel Zhang steps down amid Alibaba's major organizational shift",
    "Joe Tsai to Become Alibaba Group Chairman, Eddie Wu Appointed CEO",
    "Chinese e-commerce giant Alibaba announces new CEO and chairman in major management reshuffle",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Alibaba CEO Daniel Zhang to pass the torch and focus on cloud",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Eddie Wu to succeed Daniel Zhang as Alibaba Group CEO in major executive reshuffle",
    "‘When we meet again, may we all be carefree’: Read the outgoing Alibaba CEO's memo to staff",
    "Alibaba replaces longtime chief and chair in management shake-up",
    "@jonas@social.jonaskoeritz.de",
    "@chrismessina@mastodon.xyz",
    "Facebook is launching an ActivityPub service to compete with Mastodon. …",
    "@Techmeme  —  Two options for fedi  —  1. It's will be Organic  —  2. It will be Meta",
    "International Business Times",
    "New Privacy Features: Silence Unknown Callers and Privacy Checkup",
    "WhatsApp can now silence calls from unknown numbers",
    "Big relief from spam calls on WhatsApp! App will now silence calls from unknown numbers",
    "WhatsApp's new privacy feature lets you silence unknown callers",
    "WhatsApp gets a long-awaited protection feature",
    "WhatsApp lets you silence unknown callers on the app",
    "WhatsApp now allows users to silence unknown callers",
    "WhatsApp can now automatically silence unknown callers",
    "WhatsApp's newest feature will finally let me ignore people with ease",
    "Latest WhatsApp Update Will Help You Avoid Spam Callers with New Privacy Features",
    "WhatsApp just got a huge free upgrade, and it's a game changer",
    "You can now automaticly mute WhatsApp calls from unknown numbers",
    "WhatsApp is borrowing one of the iPhone's best privacy features",
    "WhatsApp gains the ability to silence unknown callers automatically",
    "Whatsapp rolls out Call Silencing to combat spam calls in India",
    "WhatsApp update adds option to automatically silence unknown callers",
    "WhatsApp can now automatically silence incoming calls from unknown contacts",
    "Silence unknown callers on WhatsApp with the last update",
    "WhatsApp addresses biggest pain point; enable this new privacy feature now [details]",
    "WhatsApp is now allowing users to automatically silence pesky spam calls",
    "WhatsApp announced silence unknown callers feature and privacy checkup",
    "WhatsApp announces much-needed feature ‘Silence Unknown Callers’; check how it works",
    "WhatsApp's new feature lets you silence incoming calls from unknown callers",
    "WhatsApp will now let you silence incoming calls from unknown callers: How it works",
    "ChatGPT creator OpenAI asked EU for weaker AI regulations",
    "Meet the new Big Tech boss...same as the old Big Tech boss 🇪🇺🤖🤷⤵️ https://twitter.com/...",
    "Powerful reminder that we simply cannot trust Big Tech. A must read. https://twitter.com/...",
    "No way, who could have expected this? Great reporting Billy! https://twitter.com/...",
    "Sam Altman is not your friend. https://time.com/...",
    "OpenAI Lobbied the EU To Water Down AI Regulation",
    "Advertisers are returning to Twitter after Linda Yaccarino calmed fears over content moderation. …",
    "Twitter looks to reassure anxious advertisers at Cannes",
    "Cannes Briefing: Twitter's absence at Cannes makes space for competitors",
    "Elon Musk wants to launch a Twitter video app for smart TVs to revive falling ad sales",
    "Musk claims to have improved the Twitter experience for most users",
    "Spotify's long-anticipated HiFi tier might require a more expensive subscription",
    "Spotify reportedly readying new ‘Supremium’ tier with HiFi audio and more",
    "Thank god https://twitter.com/...",
    "Binance Sets Up Bitcoin Lightning Nodes to Ease Deposits and Withdrawals",
    "Binance is working on integrating Bitcoin Lightning Network for deposits and withdrawal",
    "Binance Confirms Bitcoin Lightning Network Integration",
    "Binance Set to Integrate Bitcoin Lightning Network for Deposits and Withdrawals",
    "Binance Adopts Bitcoin Lightning Network for Fast Deposits and Withdrawals",
    "Binance confirms Bitcoin Lightning Network integration in the works",
    "Just-In: Binance CEO CZ Confirms Progress On Bitcoin Lightning Network",
    "Binance Working on Bitcoin Lightning Network Integration for Deposits and Withdrawals",
    "Slowly, but we keep building... https://twitter.com/...",
    "UK crypto law inches closer to approval, Do Kwon sentenced, FTX legal costs exceed $120m",
    "Legal Advisors at Sullivan and Cromwell Bill FTX Exchange $38 Million In 3 Months",
    "FTX Paid $120 Million in Advisor Fees Over 3 Months: Report",
    "FTX Incurred More than $121M in Legal and Advisory Fees between February 1 and April 30",
    "FTX incurs over $120m in advisor fees as bankruptcy costs mount",
    "$10 million per week leaving FTX None going to victims https://twitter.com/...",
    "This is absolutely insane. The level of injustice is mind boggling. https://twitter.com/...",
    "Make panel interviews worth the hassle",
    "“they blow up FTX” https://twitter.com/...",
    "Orange, MasMovil face EU antitrust warning over merger, source says",
    "Adobe's $20 bln deal to acquire Figma under threat from EU regulators - FT",
    "Orange Faces EU Warning Shot Over $19 Billion Masmovil Deal",
    "Adobe's $20B deal to acquire Figma under threat from EU investigation",
    "But why? It's a mystery! https://www.nytimes.com/...",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election.  [ A legal campaign...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "SoftBank's Son says he is ‘heavy user’ of ChatGPT",
    "Masayoshi Son to speak at SoftBank meeting amid investment doubts",
    "Google seeks suppliers to move Pixel production to India",
    "Google reportedly planning to manufacture Pixel phones in India",
    "Foxconn hedges its bets: US and China will make up, but diversify just in case",
    "INDIA-US Together To Counter Terrorism & China | US Representative Ahead Of PM Modi's Visit",
    "US games and esports market worth $54bn in 2022",
    "Gaming Just Isn't About You: Consoles Are Thrashed By Casual Games",
    "Cord-Cutting to Reduce Pay TV to Just 38 Percent of U.S. Households By 2027, PwC Forecasts",
    "Marques Brownlee on YouTube",
    "The Morning After: The verdict on Google's Pixel Tablet",
    "Review: Google Pixel Tablet",
    "Google Pixel Tablet review: It's all about the dock",
    "Best Prices Today: Google Pixel Tablet",
    "Pixel Tablet review: Google's Android slate and smart display rolled into one",
    "Pixel Tablet Review: Is Google Back?!",
    "Google's Pixel Tablet is what Android tablets should have been all along",
    "Google Pixel Tablet Review: A Solid Android Tablet, but an Even Better Smart Home Hub",
    "Google Pixel Tablet review: That first-gen feeling",
    "The official Google Pixel Tablet case's clever design hooked me from day one",
    "Google Pixel Tablet Review: Android Tablets Are Back",
    "Best Google Pixel Tablet cases",
    "Google Pixel Tablet review: half tablet, half home hub",
    "Google's Pixel Tablet is a good start, now Android needs to catch up",
    "Google Pixel Tablet Review: Not Made To Battle Galaxy Tab Or iPad, And That's A Good Thing",
    "26 helpful Pixel Tablet tips and features",
    "Google Pixel Tablet Review: Unboxing, First Impressions",
    "Google Pixel Tablet review: the worst Pixel I've ever used",
    "Vimeo's new AI script generator will write corporate marketing filler in seconds",
    "Vimeo announces AI-powered script generation and text-based video editing tools",
    "Vimeo unveils generative AI tools for faster video editing",
    "Vimeo's new AI-powered editing tools are designed for beginners",
    "Vimeo unveils AI tools to make video creation a breeze",
    "Vimeo introduces a suite of AI tools to simplify video creation",
    "Vimeo intros a trio of AI-powered editing features",
    "Vimeo Wants ChatGPT to Write Execs' Video Scripts Then Fix It When They Inevitably Screw Up",
    "Alibaba's Taobao & Tmall Attracts Record Number of Merchants During 6.18 Shopping Festival",
    "China's 618 shopping festival records slower growth amid gradual consumption recovery",
    "JD.com's 2023 618 Grand Promotion: Surpassing Expectations and Setting New Records",
    "Slower Growth During China's 618 Shopping Festival Signals Lagging Consumer Confidence",
    "Taobao, JD.Com, and Pinduoduo Hail Success of ‘618’ E-Commerce Festival",
    "Consumption soft even amid deep discounts during major China shopping festival, analysts say",
    "JD.com sales during China shopping festival beat expectations",
    "Bargain hunting drives up retailers' sales as 618 shopping gala ends",
    "Chinese online shoppers are enticed by deep discounts, payment plans as zest for spending lags",
    "China's online shopping bonanza loses sheen as consumption sags",
    "China's 6.18 shopping fest sets record on Alibaba platforms",
    "AI and Fame: How Celebrities are Embracing Their Digital Duplicates",
    "Courts Put Privacy Over Transparency in FTX, Other Crypto Bankruptcies",
    "NFT Phishing Takes Dark Twist: School Children Stealing Millions for Roblox Skins",
    "School Kids Reportedly Phishing Millions in NFTs for Roblox Skins",
    "Cyber heists in digital playground, school-age hackers steal millions in NFTs",
    "Damn kids. https://twitter.com/...",
    "guess the real play isn't buying NFTs, it's buying Roblox skins https://www.theblock.co/...",
    "School kids are stealing millions of dollars to buy Robloxx skins",
    "@tchambers@indieweb.social",
    "@nexusofprivacy@mastodon …",
    "Update from Lemmy after the Reddit blackout",
    "Unofficial Subreddit Migration List (Lemmy, Kbin)",
    "Looking for a Reddit alternative? Lemmy tell you, they currently kinda suck",
    "Second Life in the Threadiverse",
    "Neowin mentioned Lemmy, Kbin, and Mastodon in their Reddit coverage today",
    "@mastodonmigration@mastodon.online",
    "222,397 Lemmy/kbin accounts  —  +23,441 in the last hour  —  71,331 monthly active users",
    "@nexusofprivacy@mastodon.social",
    "Eight days later: Kbin, Lemmy, the landed gentry, and the rise of “threadiverse”",
    "Opaque Algorithm Changes by Facebook Leave Publishers in the Dark #1675",
    "Website Owners Say Traffic Is Plunging After Facebook Algorithm Change",
    "Facebook rocks publishers' worlds again. https://gizmodo.com/...",
    "Snapchat Users' Embrace of AI Could Improve Ads, Snap CEO Says",
    "Snapchat My AI Vs. ChatGPT: Which AI Chatbot Is Best?",
    "Berlin to sign agreement with Intel after chip plant talks",
    "Intel, Germany strike record €30B deal for chip mega-factory",
    "Intel doubles Germany investment to €30bn and plans two new semiconductor fabs",
    "Brussels Playbook: It's raining cash — Paris defense meeting — Ukraine accession",
    "Intel to build $33-billion chip plant in Germany after government pledges to cover 1/3rd of cost",
    "Intel to double its investment in German semiconductor factories",
    "Intel spends $48 billion in Germany in landmark expansion",
    "Intel will invest over $50 billion in Germany and Israel to build chip plants",
    "Intel, German Government Agree on Increased Scope for Wafer Fabrication Site in Magdeburg",
    "Intel to build two chip fabs in Germany as part of expanded €30B+ investment",
    "‘Silicon Junction:’ Intel picks Germany for $33B chip project",
    "Germany to subsidize Intel €10B for ‘Silicon Junction’ fab",
    "Berlin, Intel strike controversial chip plant subsidy deal",
    "Intel confirms deal for $33 billion German factories",
    "Intel Reaches Agreement to Build New Fabs in Germany and Israel",
    "Intel and Germany to sign agreement on Dresden factory today",
    "Berlin, Intel strike deal on $33 billion chip plant after months of subsidy talks",
    "Germany, Intel Agree Chip Plant Subsidies Worth €10 Billion",
    "Intel To Spend $33 Billion in Germany in Landmark Expansion",
    "@williamgunn@mastodon.social",
    "The Download: explaining the recent AI panic, and digital inequality in the US",
    "'Apple Didn't Invent Apples': Swiss Farmers Cry Foul Over Tech Giant's Fruit Trademark Quest",
    "Swiss fruit growers worried as Apple seeks trademark rights to actual apples",
    "Apple wants to trademark images of apples",
    "Apple wants to control every image of an apple, says Swiss fruit firm",
    "Apple is trying to own the exclusive rights to every image of actual apples",
    "Apple could force a 111-year-old fruit company to change its apple logo",
    "Apple wants to “own the rights to an actual apple” according to Swiss fruit firm",
    "Apple wants to own the rights to images of real apples around the world",
    "Apple, the iPhone company, now wants to own rights to images of real apples",
    "Apple is forcing a 111-year old fruit company to change its logo in a weird trademark battle",
    "Apple is trying to trademark depictions of actual apples",
    "Bananas IP case sees Apple seeking rights over actual apples",
    "Is Apple bullying small firms? Swiss Fruit Union could be forced to change the logo",
    "Apple moves to trademark actual apples in Switzerland",
    "Apple, the company, looks to secure rights to the image of apples, the fruit, in Switzerland",
    "Apple, the company, wants to trademark images of apple, the fruit",
    "Apple wants to force a fruit company to change its logo",
    "Apple wants rights to the image of apples in Switzerland",
    "Apple Is Taking On Apples in a Truly Weird Trademark Battle",
    "Apple (those bâtards) vs. Swiss Apple Association"
]