[
    "Electronic Frontier Foundation",
    "@williamgunn@mastodon.social",
    "@ChanceHMiller@mastodon.social",
    "@Aaron@social.aaroncrocco.com",
    "@dcseifert@mastodon.social",
    "Reddit CEO assures employees that API pricing protests haven't hurt revenue",
    "Reddit Blackout Crashes The Site As Reddit Users Realize They're In The Power Position",
    "Reddit CEO unphased by historic Blackout, assures staff it “will pass”",
    "Reddit CEO: Protests are a ‘lot of noise’ that ‘will pass’",
    "Reddit CEO says blackout protest “will pass”, pissed-off moderators pledge indefinite shutdowns",
    "Top Reddit Communities Make Blackout Indefinite Following Leaked Memo",
    "Reddit CEO Comments on Subreddit Blackout, Tells Employees It ‘Will Pass’",
    "New Revelations About Shopify's Deliverr Sale Spotlights CEO",
    "Reddit blackout: Read internal memo shared by CEO Steve Huffman addressing the issue",
    "Reddit CEO Steve Huffman Is Confident the Current Sitewide Protest Is No Big Deal",
    "Reddit Blackout: CEO downplays protest. Subreddits vow to keep fighting.",
    "Reddit CEO Tells Employees in a Memo the Blackout ‘Will Pass’",
    "Reddit's CEO doesn't seem worried his social network is on pause",
    "Reddit CEO Says Blackout Hasn't Really Cost Them Money Yet And ‘Will Pass’",
    "Subreddits respond to CEO's comments by extending blackouts indefinitely",
    "Reddit CEO says like all other blowups this too will pass to employees in an internal memo",
    "Reddit CEO warns employees not to wear Reddit swag in public as users revolt",
    "Reddit's largest Apple community will stay dark, as CEO promises to ride out shutdowns",
    "Internal memo from Reddit CEO leaks, shows company will not back down",
    "Reddit CEO digs in on API tomfoolery, warns employees of wearing logo in public",
    "Reddit's CEO reportedly told staff that the community's API protest will blow over",
    "my usage of reddit shall too pass https://www.theverge.com/...",
    "There is nothing more heinous than reddit wanting to be a sustainable business.",
    "I think he forgets just how hive-mindey and virtue-flaggy Redditors are https://twitter.com/...",
    "this seems like a great way to absolutely ensure it will never pass https://twitter.com/...",
    "Reddit CEO tells employees that subreddit blackout ‘will pass’",
    "Reddit CEO tells employees that subreddit blackout “will pass”",
    "The Reddit blackout has improved the overall state of Reddit and should remain permanent",
    "Reddit CEO is not negotiating with the hostage takers lmao what will the nerds do now?",
    "Reddit CEO Tells Employees That Subreddit Blackout ‘Will Pass’",
    "Reddit CEO assures employees that API protests haven't hurt revenue",
    "Reddit CEO: Apollo-Related Subreddit Blackouts ‘Will Pass,’ No Significant Revenue Impact So Far",
    "Hundreds of subreddits plan to go dark indefinitely after Reddit CEO's internal memo",
    "Parts of Reddit are staying dark.  Our search results may suffer for it.",
    "Reddit Blackout: Top subreddits pledge revolt will “continue indefinitely”",
    "Reddit's CEO isn't worried about the 8,000+ subreddits going offline, ‘this one will pass’",
    "Reddit protests see some of the most useful Android subreddits ‘go dark’ [U]",
    "Reddit's top boards are shutting down for 48 hours to protest API prices",
    "Here are some of the major subreddits that will stay down indefinitely",
    "Popular subreddits plan to extend API protests indefinitely",
    "How-Reddit-Lost-Its-Crypto-Communities- A-Revealing-Report",
    "“Will pass” .... Maybe not https://t.co/mTERSe2VTx",
    "Rolling strikes in force, as a summer of discontent hits Reddit. https://twitter.com/...",
    "The Reddit blackout will continue",
    "Indefinite Blackout: Next Steps, Polling Your Community, and Where We Go From Here",
    "Reddit subs with millions of followers plan to extend the blackout indefinitely",
    "@christianselig@mastodon …",
    "Thousands of Reddit communities go dark in protest of API changes",
    "An online gambling site is taking bets on the future of Reddit",
    "@christianselig@mastodon.social",
    "Apollo's Christian Selig explains his fight with Reddit — and why users revolted",
    "Apollo's Christian Selig explains his fight with Reddit - and why users revolted",
    "Google's Online Advertising Practices Violate Antitrust Laws, E.U. Says",
    "EU antitrust regulators charge Google on anti-competitive adtech practices",
    "EU charges Google with anti-competitive practices in ad tech business",
    "Europe seeks break-up of Google ad business, adding to antitrust woes",
    "EU proposes breaking up Google over anti-competition concerns",
    "Google's Ad Tech Dominance Sparks Breakup Threat From EU",
    "EU Says It May Seek Breakup of Google's Ad-Tech Business",
    "Google gets EU antitrust charges on ad tech business",
    "Google Faces Breakup of Ads Business Over EU Antitrust Concerns",
    "The EU may hit Google where it hurts the most",
    "EU Regulators Order Google To Break up Digital Ad Business Over Competition Concerns",
    "Brussels hits Google with fresh charges over ad technology",
    "Google must break up digital ad business over competition concerns, European regulators say",
    "EU antitrust authorities are ready to strike Google's advertising business",
    "The EU is determined to crush Silicon Valley. https://twitter.com/...",
    "Google response to ⁦@EU_Competition⁩ antitrust charges today. [image]",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling - The Verge",
    "Publications press releases",
    "Europe moves ahead on AI regulation, challenging tech giants' power",
    "MEPs ready to negotiate first-ever rules for safe and transparent AI",
    "European parliament votes through world's first draft AI bill",
    "EU outlines rules aiming to make it clear when content has been generated by an AI",
    "AI Regulation Is Almost Here in Europe",
    "EU Parliament approves strengthened protections for consumers on AI",
    "EU lawmakers approve plan on bloc's future AI rules",
    "AI discrimination is a bigger risk than human extinction - EU commissioner",
    "Markets Await a Fed Pause — but Not an End to Rate Increases",
    "No shit https://twitter.com/...",
    "Function calling and other API updates",
    "OpenAI: Function calling and other API updates.  Huge set of announcements from OpenAI today. …",
    "ChatGPT Owner OpenAI Announces API Updates and Price Reduction",
    "OpenAI rolls out new GPT features while also reducing pricing",
    "OpenAI brings new features to the API of GPT-4 and GPT-3",
    "OpenAI Updates API, GPT-3.5 Turbo, And GPT-4 For Enhanced Generative AI Applications",
    "OpenAI Upgrades GPT-4 and GPT-3.5 Turbo Models, Reduces API Prices",
    "OpenAI rolls out big chatbot API upgrades for developers",
    "lots of good updates including function calling and 16k context 3.5-turbo: https://openai.com/...",
    "16k 3.5 turbo is my hot new friend https://twitter.com/...",
    "New OpenAI update: lowered pricing and a new 16k context version of GPT-3.5",
    "OpenAI intros new generative text features while reducing pricing",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "The Download: heat pumps for everyone, and fake Twitter accounts in China",
    "Court wants Binance.US, SEC to avoid full asset freeze",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "U.S. Judge Denies Binance.US Asset Freeze For Now",
    "Binance.US agrees with SEC to avoid full asset freeze",
    "The Big Quit: Crypto Firms Leaving The US",
    "SEC vs Binance: Judge Denies Restraining Order, Calls For Negotiation",
    "Crypto Scores 4 Major Victories Vs SEC, Is the US Industry Winning?",
    "Binance.US Strives to Prevent Asset Freeze Through Negotiations with SEC",
    "Binance gets more time to protest US exchange asset freeze",
    "How American courts have become central to crypto law",
    "Breaking: US Federal Judge Rejects SEC's Request to Freeze Binance.US Funds",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "Binance.US and SEC told to reach compromise on restraining order",
    "SEC founder shares interesting insights about Binance-SEC debacle",
    "Binance.US, SEC agree to work out deal to avoid full asset freeze: Bloomberg",
    "Binance.US Says SEC's Attempt To Freeze Assets Will Effectively Put it Out of Business: Court Docs",
    "Why is Crypto Market's Volume Down?",
    "International Business Times",
    "Microsoft-Activision: US judge temporarily blocks $69bn deal",
    "Microsoft Purchase of Activision Temporarily Blocked by Judge",
    "Microsoft-Activision Blizzard deal temporarily blocked by US judge",
    "Judge Grants Restraining Order Temporarily Preventing Microsoft From Buying Activision",
    "Xbox officially can't buy Activision Blizzard... for now",
    "Judge Grants FTC's Temporary Restraining Order Against Xbox & Activision Blizzard",
    "US Judge Temporarily Blocks Microsoft Activision-Blizzard Deal Following FTC Motion",
    "US Court Blocks Microsoft Activision Merger with Restraining Order",
    "Microsoft acquisition of Activision Blizzard temporarily blocked by FTC restraining order",
    "Judge temporarily blocks Microsoft's $69 billion purchase of Activision",
    "FTC wins a temporary restraining order blocking the Microsoft—Activision deal",
    "Court Temporarily Blocks Microsoft's $69B Buyout Of Activision Blizzard After FTC Intervention",
    "Microsoft's Activision acquisition temporarily blocked by US judge",
    "FTC has been granted its restraining order to keep Microsoft from buying Activision Blizzard",
    "Microsoft-Activision Blizzard merger temporarily blocked by US judge",
    "FTC Files Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "FTC looks to hit the pause button on Microsoft's Activision Blizzard deal",
    "Microsoft's $69B Activision Blizzard deal temporarily blocked in U.S.",
    "Microsoft has been temporarily restrained from buying Activision Blizzard, judge rules",
    "AMD's New Chip Fails to Impress Investors. It's Still an AI Winner, Analyst Says.",
    "AMD reveals new AI chip challenging Nvidia's dominance",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "Cloud Division Of Amazon is Investing in AMD's New AI Chips",
    "Silicon Valley Business Journal",
    "Advanced Micro Devices has outlined its new AI chips as it beefs up fight with Nvidia",
    "Advanced Micro Devices, Inc.",
    "AMD Gives Peek at Upcoming Line of AI Processors in Challenge to Rival Nvidia",
    "A closer look at AMD Zen 4c-powered Bergamo Epyc",
    "AMD EPYC Bergamo CPUs With 128 Zen 4C Cores",
    "AMD Unleashes EPYC Bergamo And Genoa-X Data Center CPUs, AI-Ready Instinct MI300X GPUs",
    "AMD Cloud-Native EPYC Bergamo, HPC Optimized Genoa-X CPUs And MI300 AI Accelerators Take Flight",
    "AMD Details EPYC Bergamo CPUs With 128 Zen 4C Cores, Available Now",
    "AMD EPYC Bergamo Launched 128 Cores Per Socket and 1024 Threads Per 1U",
    "AMD Uses AI Day To Launch Genoa-X & Bergamo",
    "AMD Intros EPYC 97x4 “Bergamo” CPUs: 128 Zen 4c CPU Cores For Servers, Shipping Now",
    "AMD adds 128-core Bergamo and 3D V-Cache Genoa CPUs to Zen 4 Epyc lineup",
    "AMD unleashes 128-core Epyc ‘Bergamo’, trounces Intel's most expensive CPU",
    "AMD takes on Nvidia with MI300X AI GPU - could it land AWS as a client?",
    "AMD says Meta is using its cloud chip as it rolls out AI strategy update",
    "The Third Time Charm Of AMD's Instinct GPU",
    "AMD launches new Instict MI300X AI chip to take on Nvidia's GPUs",
    "AMD Instinct MI300X accelerator for AI revealed, combines CPU, GPU, and 192 GB of HBM3 memory",
    "AMD Eyes AI, Cloud Expansion With Instinct MI300X, EPYC 97X4 Chips",
    "AMD unveils MI300x AI chip as ‘generative AI accelerator’",
    "AMD Expands MI300 With GPU-Only Model, Eight-GPU Platform with 1.5TB of HBM3",
    "AMD makes its case for generative AI workloads vs. Nvidia",
    "AMD Instinct MI300 is THE Chance to Chip into NVIDIA AI Share",
    "AMD Talks Up Open-Source Software For AI, Introduces Instinct MI300X",
    "AMD's Instinct MI300X GPU targets generative AI workloads",
    "What are the odds Nvidia will be pushing out a 144GB H100 in Q4? 🤔 https://twitter.com/...",
    "AMD Expands AI Product Lineup with GPU-Only Instinct Mi300X with 192GB Memory",
    "AMD Expands AI/HPC Product Lineup With Flagship GPU-only Instinct Mi300X with 192GB Memory",
    "Open letter by Embracer Group CEO on restructuring program",
    "Embracer Group announces comprehensive restructuring program with immediate implementation",
    "Embracer was not the one group to rule them all after $2 billion deal falls through",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Embracer Group Is Closing Studios And Cancelling Projects In A Major Restructure",
    "Swedish gaming giant Embracer Group to cut studios",
    "Embracer announces restructuring program, studio closures expected",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "Elon Musk fires back at Apple over bitcoin app removal",
    "Apple will remove Damus app unless it drops Bitcoin tipping feature",
    "Jack Dorsey-Backed Damus App to Suspend Tipping Feature as App Store Threatens Removal",
    "Apple wants Bitcoin tipping feature Damus removed from store",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Apple to delist Nostr-based Damus app over Bitcoin tip feature",
    "Apple threatens to ban popular social media App over Bitcoin tipping",
    "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted",
    "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "Due To Bitcoin Payments, Apple Bans Nostr Client Damus From App Store",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/...",
    "OpenAI Updates API for Enhanced Generative AI Applications",
    "OpenAI reportedly warned Microsoft about integrating GPT-4 into Bing",
    "Microsoft was reportedly warned about putting GPT-4 in Bing Chat too early by OpenAI",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing",
    "Looks to me more and more like Zucks bet on Metaverse. https://twitter.com/...",
    "Microsoft's Satya Nadella Is Betting Everything on AI",
    "MERGER OF VODAFONE UK & THREE UK TO CREATE ONE OF EUROPE'S LEADING 5G NETWORKS",
    "Vodafone and Three agree to £15bn UK merger",
    "Vodafone and Three plan to merge in the UK in a $19B deal (if regulators approve)",
    "Vodafone, Hutchison unveil UK mobile merger",
    "Vodafone and Three agree to merger in the UK",
    "Voda - Three - well that's just great...",
    "Vodafone and Three announce UK mega-merger",
    "Vodafone and Three plan merger to create UK's biggest mobile carrier",
    "Vodafone and Three announce UK merger",
    "Vodafone and Three agree merger",
    "Vodafone to merge with Three to create UK giant",
    "Vodafone, CK Hutchison agree UK mobile business merger",
    "Vodafone and Three agree merger to form UK's largest mobile operator",
    "Vodafone and Three agree UK merger to create biggest mobile player worth £15bn",
    "Vodafone and Three confirm UK merger agreement",
    "Welcome Rubicon to Databricks: The Future of AI Storage and Serving Systems",
    "Databricks hits $1B revenue milestone as it doubles down on AI with Rubicon acquisition",
    "Hands-free photos, SpO2 and more for the Pixel family",
    "One of the best Pixel features is now on the Pixel Watch",
    "Google Pixel Watch users just got a great free software upgrade",
    "Google Pixel Watch's new fall detection feature could save lives",
    "Fitbit's mid-year surprise: A hearty upgrade despite a quiet 2023",
    "All the New Features Coming to Your Pixel Phone With the June 2023 Feature Drop",
    "The June 2023 Update has Finally Arrived for Pixel Devices",
    "Your Google Pixel phone's June update is here: The biggest new features",
    "Your Pixel 7 Pro can now get *really* close in videos",
    "Pixel Drop June 2023: Enhanced Safety Features, Hands-Free Photos, and Fitness Updates",
    "Google's June 2023 Pixel Feature Drop is a big one",
    "Pixel phones will call your worried friends, and more from the June feature drop",
    "Google Pixel devices receive massive June feature drop and security patches",
    "June's Pixel feature drop adds hands-free photos and oxygen saturation tracking",
    "Google Pixel Watch just got huge health and fitness upgrades to challenge Apple Watch",
    "Fewer people trust traditional media, more turn to TikTok for news, report says",
    "Worldwide, online news is looking a lot more like TikTok and a lot less like “shared articles”",
    "Sharp decline in appetite for news in recent years, Reuters Institute says",
    "Influencers overtaking journalists as news source: report",
    "Social media eclipses publishers as entry point for news: But Facebook fading",
    "Publishers enjoy a trust bump as more Australians take up digital subscriptions",
    "Leftwing audiences value ABC and SBS much more than rightwing viewers do, survey finds",
    "TikTok and Instagram influencers top list of trusted news sources for today's youth: report",
    "TikTok a growing source for news - but from influencers, not journalists",
    "More young people are using TikTok to access news, research finds",
    "Lightspeed Venture Partners",
    "Four-week-old AI start-up raises record €105mn in European push",
    "Month-Old AI Startup Mistral Raises $113 Million",
    "Mistral AI secures €105M in Europe's largest-ever seed round",
    "Mistral AI of France Rakes in $113M Seed Funding at $260M Valuation",
    "AI start-up Mistral bags €105m after just one month",
    "Meet Europe's Next Great Generative AI Startup: Mistral AI",
    "French company Mistral AI raises 105 mln euros shortly after being set up",
    "AI startup by ex-Meta and Google researchers raises $113M in seed funding",
    "Generating mania: Month-old Paris-based startup Mistral AI raises $113M in seed funding",
    "AI Startup Mistral Raises Over €105 Million in Seed Round",
    "France's Mistral AI Raises $113 Million in Big EU Startup Debut",
    "The rates are too low https://www.ft.com/...",
    "$113m for a seed. For comparison my startup's seed round was $250,000 https://twitter.com/...",
    "Dot com bubble all over again. https://twitter.com/...",
    "Free Figma template of onboarding & activation designs",
    "SEC asks for more time to respond to Coinbase call for crypto clarity",
    "SEC Says It May Make a Recommendation on Coinbase Petition Within 4 Months",
    "SEC Anticipates Responding to Coinbase Petition in 120 Days",
    "SEC refuses to make any decision on Coinbase's rulemaking petition",
    "SEC snubs Coinbase's seven-day rulemaking request but could act by October",
    "SEC Responds to Coinbase Request for Crypto Clarity, Wants More Time",
    "SEC Indicates Potential Decision on Coinbase Petition Expected in Upcoming 4 Months",
    "SEC responds to Coinbase's second request for action: ‘Still no’",
    "Meta releases ‘human-like’ AI image creation model",
    "Meta Reveals a New “Human-Like” Artificial Intelligence Model",
    "Meta Shares New Generative AI Paper, Which Looks at its Advancing Predictive Models",
    "I-JEPA: The first AI model based on Yann LeCun's vision for more human-like AI",
    "Meta Platforms shares AI model I-JEPA with researchers",
    "Self-Supervised Learning from Images with a Joint-Embedding Predictive Architecture",
    "Method  —  I-JEPA is a method for self-supervised learning.  At a high level …",
    "@MetaAI @ylecun Fantastic 👏👏👏🙏",
    "Meta are goated for this Take notes closedAI @openAI https://twitter.com/...",
    "Well if LLM's dont give us AGI, Yann's other projects will xD https://twitter.com/...",
    "Meta Releases ‘Human-Like’ AI Image Creation Model",
    "This reads like a plot device from a lame 80s hacker flick https://arstechnica.com/...",
    "Hackers can steal cryptographic keys by video-recording power LEDs 60 feet away",
    "Hackers Can Steal Cryptographic Keys By Video-Recording Power LEDs 60 Feet Away",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "ZertES-compliant qualified electronic signatures (QES) for the European Union and Switzerland",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/13 - New Beatles Song Thanks To AI",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Sequoia Is Hunting for Early Deals and More AI as It Splits From China",
    "Will Peak XV be able to scale the heights reached by Sequoia?",
    "More flexible workweeks at Samsung, large firms",
    "Samsung Electronics picked as most preferred employer after a decade",
    "Intel approached to take on key investor role in Arm IPO",
    "Intel is reporteldy considering taking a big stake in Arm as part of Arm's IPO",
    "Intel in talks to be anchor investor in Arm IPO - source",
    "@paul@social.paulkedrosky.com",
    "Is AI The Cause Of Job Cuts This Year?",
    "Machines are helping doctors become more like humans. https://www.nytimes.com/...",
    "EU funds multiple Huawei projects despite European ban",
    "EU demonstrates double standards over Huawei",
    "Medivis Raises $20M Series A to Advance Surgery with Augmented Reality",
    "Mayo Clinic, Disney CEO back AR medtech's $20M investment round",
    "Medivis Raises $20M in Series A Funding",
    "Kodem Launches with $25M in Funding From Greylock and TPY Capital to Fix Application Security",
    "Application security startup Kodem emerges from stealth with $25M",
    "Cloudera's CEO is stepping down",
    "Developer sentiment around AI/ML",
    "AI and coding: How Seattle tech companies are using generative AI for programming",
    "GitHub Survey Finds 92% of Programmers Are Using AI Tools",
    "EU launch of Google's AI tool delayed by Irish regulator",
    "Irish DPC delays Google Bard AI chatbot launch in the EU",
    "Google Delays Bard AI Launch in the EU Over Privacy Concerns",
    "Google delays EU launch of its AI chatbot after privacy regulator raises concerns",
    "Google Bard's EU launch gets delayed due to privacy issues",
    "Google's Bard chatbot has been blocked in the European Union over privacy concerns",
    "Irish data watchdog blocks Google from launching Bard in the EU: Report",
    "Logitech CEO Bracken Darrell resigns",
    "Logitech Announces CEO Departure",
    "Logitech says CEO Bracken Darrell stepping down, to leave company",
    "Logitech CEO is stepping down",
    "Logitech's CEO is leaving for another job",
    "AWS customers struggle for hours after a major outage",
    "Amazon's Cloud Computing Service Experiences Regional Outage",
    "Amazon Web Services (AWS) outage temporarily disrupts services, Ethereum network remains resilient",
    "Outage of Amazon's cloud service causes some websites to go dark",
    "AWS went down for millions of customers, taking a host of top sites with it",
    "Big Amazon cloud services recovering after outage hits thousands of users",
    "AWS outage causes some websites to go dark",
    "AWS experiment with Lambda in cloudless configuration fails to impress",
    "Amazon Web Services back after major outage: Check details",
    "AWS went down in the US, but Ethereum kept humming",
    "Amazon server outage makes some websites go dark",
    "Amazon Alexa, other services stop working; AWS outage causes chaos for users",
    "Amazon Web Services briefly hit by wide-ranging outage, impacting major websites",
    "Amazon Web Services Meltdown Temporarily Breaks the Internet",
    "Amazon's cloud computing service recovers from outage",
    "Amazon Says It's Resolving Outage That Knocked Websites Offline",
    "AWS went down, taking parts of the Internet with it — what we know",
    "AWS Outage Appeared to Affect Delta, McDonald's and Others",
    "AWS Outage Downs Other Websites, Apps",
    "AWS US-East-1 Lamda outage causes issues globally",
    "AWS is down. Here's how you can track outage progress",
    "AI Video Creation Pioneer Synthesia Raises $90 Million Series C Led by Accel",
    "AI video creation startup Synthesia reels in $90M from investors",
    "Nvidia-Backed AI Startup Synthesia Achieves Unicorn Status With $90 Million Fundraising Success",
    "Synthesia Joins Unicorn Club Amid Flurry of AI Investments",
    "Synthesia Raises $90M in Series C Funding",
    "The Morning After: OpenAI and Microsoft aren't happy",
    "Microsoft's complicated relationship with OpenAI",
    "Microsoft was warned that adding GPT-4 into Bing would get weird",
    "The Awkward Partnership Leading the AI Boom: The Microsoft and OpenAI Saga",
    "Report Details Internal Conflicts Over Microsoft's AI Push",
    "Microsoft CFO Says OpenAI and Other AI Products Will Add $10 Billion in Revenue",
    "Microsoft and OpenAI have an open partnership - and it's complicated"
]