[
    "Behind the Musk-Zuckerberg ‘Cage Match’ Is a Yearslong Billionaire Feud",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Will Elon Musk Fight Mark Zuckerberg in a Cage? You Can Bet on It",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "The Flex Report (June 2023)",
    "Flex Report: Tech Industry Deep Dive",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "Was he featured in Forbes https://twitter.com/...",
    "International Business Times",
    "Instagram's Twitter Competitor Launching in Mid-July: Report",
    "Elon Musk Vs. Mark Zuckerberg In MMA Fight - How Will This Shake The Crypto, Metaverse Arena?",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "Meta Will Launch Twitter Competitor In Mid-July: Report",
    "Elon Musk, Mark Zuckerberg ‘Dead Serious’ About UFC Fight: 'Let's Go Full MMA'",
    "Elon Musk vs. Mark Zuckerberg Cage Match Prompts Hypothetical Odds",
    "No Joke: Musk and Zuckerberg Really Want to Fight, Says UFC Boss",
    "Dana White reveals Elon Musk & Mark Zuckerberg “dead serious” about fight",
    "Here's the real reason behind Elon Musk, Mark Zuckerberg cage fight",
    "Gov. Abbott weighs in on potential Mark Zuckerberg-Elon Musk cage match: ‘Biggest fight’",
    "Sam Altman says he'd go watch Elon Musk cage fight Mark Zuckerberg",
    "Here's everything about the Elon Musk vs Mark Zuckerberg cage fight",
    "sanely? so who's running it https://twitter.com/...",
    "@petergyang It's a totally new text based app",
    "@SlugtalesNews @alexeheath Jack's Blue Sky is my choice. Can't wait.",
    "I have a feeling this might be the Twitter-killer. https://twitter.com/...",
    "@alexeheath So Instagram is not only TikTok but also Twitter?",
    "Some more reporting on the Fediverse aspect of this app: [image]",
    "Another unicorpse. Who's keeping a list? https://www.theinformation.com/ ...",
    "Barely scratching the surface... https://twitter.com/...",
    "Katie wins the year with unicorpse https://twitter.com/...",
    "New tech fraud just dropped! 🍿 https://twitter.com/...",
    "Another Frank! https://twitter.com/...",
    "Why do so many startups funded by SoftBank end up imploding like a submersible? ↓ [image]",
    "19 out of 20 “users” were not 🤯 https://twitter.com/...",
    "Such negativity—why not say 5% are real? https://twitter.com/...",
    "Social app IRL, which raised $200 million, shuts down after CEO misconduct probe",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering",
    "@tchambers@indieweb.social",
    "@petergleick@fediscience.org",
    "Russia blocks access to Google News after Wagner Group forces threaten to topple military",
    "Putin, citing ‘deadly threat’ to Russia, vows to quash armed rebellion",
    "Russia Censors Internet After Mercenaries Pledge To Topple Military Leadership",
    "Russia Blocks Access To Google News",
    "Russian ISPs cut off access to Google News as Putin responds to “armed rebellion.”",
    "Putin addresses nation as Wagner mercenary chief accused of mutiny",
    "Anti-terror measures in Moscow as Wagner chief accused of mutiny - BBC News",
    "Live BBC reporting of the events in Russia",
    "UA POV: Russia tightens security as Wagner chief accused of mutiny - Top article on BBC News",
    "Google News Blocked in Russia as Feud With Mercenary Leader Intensifies",
    "Amazon to take its India investment to $26 billion by 2030",
    "Amazon CEO Andy Jassy says ready to invest $15 billion more in India",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "Modi in US: Amazon CEO Andy Jassy commits to $15 billion investment in India",
    "Amazon CEO Andy Jassy meets PM Modi, ups India investment commitment to $26 billion",
    "Amazon to invest $15b more in India",
    "Amazon Plans To Invest Another $15 Billion in India By 2030",
    "Amazon, Google to expand investment in India after meeting PM Modi in US",
    "Amazon, Google to Expand India Investments After Modi Visits US",
    "Google to invest $10 billion in digitisation: CEO Sundar Pichai after meeting PM Modi",
    "What Amazon, Google, And Microsoft Announced After PM's ‘Hi-Tech Handshake’",
    "Google will open global fintech centre in Gujarat: Sundar Pichai after meet with PM",
    "‘Way Ahead of Its Time’: Google's Sundar Pichai on PM Modi's Vision for Digital India",
    "Major investments. Google, Amazon commit $25 billion investments in India after meeting Modi",
    "Google CEO Sundar Pichai unveils plans for fintech hub in GIFT City, Gujarat",
    "Google investing $10 billion in India's digitisation fund: Sundar Pichai tells PM Modi",
    "Google, Amazon Announce Major Investments In India After Meeting PM Modi In US",
    "'PM Modi's vision for Digital India was way ahead of its time,' says Google CEO Sundar Pichai",
    "Google, Amazon announce major investments in India after meeting with PM Modi in US",
    "Modi in US: Google to setup global fintech operation centre in Gujarat, says Sundar Pichai",
    "Biden and Indian Prime Minister Meet With Tech Executives",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio - WSJ",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "@summeremacs@fashionsocial.host",
    "This is a good read: https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "Free Figma template of onboarding & activation designs",
    "Social media's fragmented future",
    "Aloud - dubbing for everyone",
    "YouTube's New Aloud AI Tool Will Dub Your Videos Into Other Languages",
    "YouTube is getting a powerful AI dubbing tool — here's how it works",
    "YouTube is testing an AI-powered dub tool to translate creators' videos",
    "YouTube integrates AI-powered dubbing tool",
    "YouTube's new tool can automatically dub videos in other languages",
    "YouTube video translation is getting an AI-powered dubbing tool upgrade",
    "YouTube is testing an AI voice-dubbing feature for creators, and it's incredibly fast",
    "You may soon listen to YouTube videos in any language thanks to AI",
    "YouTube could soon automatically dub videos using AI",
    "YouTube to boost AI-generated foreign language dubs",
    "YouTube Integrates AI-Powered Dubbing Service",
    "How to dub YouTube videos with AI-powered Aloud tool",
    "YouTube will soon be introducing its new AI-powered dubbing tool",
    "ICYMI: Twitch Says Competition Will Make Us Stronger; VidCon Recap Day One",
    "YouTube adding AI dub technology to translate videos for creators",
    "YouTube AI Dubbing: Overcoming Language Barriers",
    "YouTube Is Adding AI-Powered Dubbing",
    "EU, Meta agree to July stress test on EU online content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Effective scheduling is key to workforce optimization",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "@zackwhittaker@mastodon.social",
    "UK man who pleaded guilty to celebrity Twitter hack gets five years in prison",
    "Twitter Hacker Sentenced to 5 Years in Prison for $120,000 Crypto Scam",
    "Matthew Russell Lee's Newsletter",
    "British Hacker Gets 5 Years for Stealing Crypto and Swatting Social Media Influencers in NDCA",
    "Twitter Hacker Gets Five Years in Prison for Breaching Accounts of Top US Leaders",
    "Google Search ‘Perspectives’ filter provides more personalized results",
    "Google Search is getting Perspective filter for more personal results",
    "Google Search rolling out ‘Perspectives’ filter for more personal and human results",
    "@TriflingTree@mastodon.social",
    "@WeavingWithAI@sigmoid.social",
    "Midjourney v5.2 Update Features Impressive ‘Zoom Out’ Tool",
    "Midjourney 5.2 brings zoom out and integrated prompt analysis",
    "MidJourney 5.2 zoom out feature needs a tad bit of work [image]",
    "Midjourney 5.2 Zoom out feature is insane. [image]",
    "Zoom Out with Midjourney v5.2 [image]",
    "“Stunning”—Midjourney update wows AI artists with camera-like feature",
    "Don't Hold Your Breath For A New Elder Scrolls, May Skip Current Gen Consoles Entirely",
    "Phil Spencer Confirms Starfield Was Potentially Going to Skip Xbox Prior to ZeniMax Acquisition",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Microsoft says Starfield was going to be a PS5 exclusive before it bought Bethesda",
    "Phil Spencer Gives Clue on When The Elder Scrolls 6 Will Release",
    "The Elder Scrolls 6 Doesn't Have Confirmed Platforms Yet, Is 5-Plus Years Away",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Elder Scrolls VI Xbox Exclusivity Undecided, Bethesda Bought to Stop Sony Getting Starfield",
    "Microsoft acquired Bethesda after hearing Starfield would be exclusive to PlayStation",
    "Bethesda's upcoming Indiana Jones game will only be available on Xbox and PC",
    "Sony Planned to Make Starfield a PlayStation Exclusive Before Microsoft Acquired Bethesda",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Starfield could have been a PS5 exclusive, says Xbox exec",
    "Starfield's Potential PS5 Exclusivity Prompted Microsoft to Acquire Bethesda",
    "Starfield was almost a PS5 exclusive before Microsoft bought Bethesda",
    "Xbox Was Worried It Would Lose Starfield Prior To Bethesda Acquisition",
    "Bethesda's Indiana Jones game confirmed to be Xbox and PC exclusive",
    "Bethesda's Indiana Jones game now Xbox exclusive after multiplatform deal change",
    "I should kept Twitter until Microsoft offered to buy my Twitter account. https://twitter.com/...",
    "Eddie Wu prepares to run Alibaba empire built with mentor Jack Ma",
    "ChatGPT Or Google Bard? Privacy Or Performance? Outstanding Questions Answered",
    "How Europe's hottest AI startup Mistral AI plans to beat OpenAI",
    "FTX Sues to Reclaim $700M Bankman-Fried Allegedly Spent on Celebrity Connections",
    "SBF denied access to FTX's former law firm documents",
    "FTX Strikes Back: Sues Ex-Clinton Aide's Investment Firm For $700 Million",
    "FTX Seeks to Claw Back $700 Million From K5 Global and Related Entities",
    "FTX files suit against SBF's old pals to attempt $700M clawback",
    "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "FTX Attempts Clawback of $700M Allegedly Spent After A Networking Party",
    "Alameda seeks to claw back $700 million SBF paid ‘super networkers’",
    "FTX Seeks to Recover $700 Million from Sam Bankman Fried's Affiliated Funds",
    "FTX Sues K5 Global Investment Firm for $700 Million",
    "Alameda Seeks Return of $700M Paid to ‘Super Networkers’ for Celebrity, Political Access",
    "FTX seeks to claw $700M from Bankman-Fried friends and affiliated funds",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple to launch credit card in India, will also introduce Apple Pay: Report",
    "Apple set to launch Apple Pay and a credit card in India - see their benefits",
    "Apple Sets Sights on Indian Credit Card Market in Partnership with HDFC Bank",
    "Apple Card to arrive in India",
    "Apple set to launch its credit card in India: Report",
    "Apple to launch credit card in India, in talks with NPCI for Apple Pay",
    "Apple Is Planning To Launch Its Credit Card In India: Report",
    "Apple Pay May Finally Come to India",
    "Apple explores launching Apple Card in India",
    "Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "Apple Pay and US-exclusive Apple Card could expand to India",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple Card may arrive in India soon in partnership with HDFC Bank",
    "Apple Card could expand to India, four years after US rollout",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card may launch next in India",
    "Apple Card will launch in India next, report claims",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Apple Card and Apple Pay could soon launch in India",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Will Apple Card arrive in India before it reaches Europe?",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple in talks to launch Apple Pay in India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Reportedly in Discussions with Banks to Launch Apple Card in India",
    "@HopelessDemigod@mstdn.social",
    "Twitter agrees to comply with tough EU disinformation laws",
    "Technology is stress testing our society. Time to turn the tables.",
    "EU welcomes Meta plans for tough content rules",
    "Meta agrees to July ‘stress test’ on new EU content rules",
    "EU to Push Ahead With Data Act Despite Criticism",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "EU plants flag in Silicon Valley ahead of big tech crackdown",
    "Is Twitter ready for Europe's new Big Tech rules? EU official says it has work to do",
    "EU warns Twitter to beef up content moderation as new rules loom",
    "Twitter agrees to comply with tough EU disinformation laws |  Twitter",
    "@dangillmor@mastodon.social",
    "Meta won't negotiate with publishers, will end Facebook news in Canada",
    "Canada's “Online News Act” wants social media companies to pay for shared news content",
    "Canada's Online News Act Targets Facebook and Google",
    "Meta to ban news sharing on Facebook in Canada after journalism bill passes",
    "Meta to pull news from Facebook and Instagram in Canada",
    "Canada will require Google and Meta to pay media outlets for news under bill set to become law",
    "Meta to stop showing news on feed to Canadian users because of new law, won't pay news outlets",
    "As Canada Passes Corrupt Link Tax, Meta Says No More News Links In Canada",
    "Meta Re-Affirms Plan to Ban News Content in Canada in Response to Proposed online News Act",
    "Facebook to end news access in Canada over incoming law on paying publishers",
    "Meta says it will block news from Facebook, Instagram in Canada",
    "Meta says it will end news availability on Facebook and Instagram in Canada",
    "Canada passes Online News Act - Meta says it will block news on Facebook and Instagram",
    "Meta Tells Canada: No News for You!",
    "Meta Will Remove News Content From Facebook and Instagram in Canada",
    "Facebook and Instagram to block news in Canada",
    "Want to Share News Articles on Facebook in Canada? Tough Luck",
    "Silicon Valley Business Journal",
    "Why Meta Platforms is shutting down Facebook, Instagram news access in Canada",
    "Meta to block news access for Facebook and Instagram users in Canada",
    "Canada Bill C-18 Delivers a Victory: How Long Will the Triumph Pay Off in Cash Money?",
    "Meta to Block Facebook and Instagram News Sharing in Canada",
    "Changes to News Availability on Our Platforms in Canada",
    "Facebook and Instagram to restrict news access in Canada",
    "Meta to Remove News From Facebook and Instagram in Canada",
    "Facebook shutters news rather than pay up under new Canadian law",
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Meta will remove news from Facebook and Instagram in Canada",
    "Meta stops serving news to the Canadian users as Bill C-18 gets closer becoming reality",
    "Meta to halt news on Facebook and Instagram in Canada",
    "Meta to end news sharing in Canada",
    "Meta to follow through on Facebook, Instagram block in Canada after content bill advances",
    "Canada residents will not be able to access news on Facebook, Instagram; Here's why",
    "After Royal Assent of Bill C-18, Meta Reaffirms It Will End News Sharing in Canada",
    "The Online News Act is now law! #C18 #CdnPoli https://twitter.com/... [image]",
    "Meta has already basically cut off all traffic to news sites anyway https://twitter.com/...",
    "Oh no!! Just kidding. #NoOneCares https://twitter.com/...",
    "Facebook cutting off news in Canada to avoid paying publishers for content"
]