[
    "Binance Says Gensler Once Offered to Be an ‘Informal Advisor’",
    "Binance wants Gary Gensler to recuse himself from SEC lawsuit",
    "SEC's Gensler offered to serve as an adviser to Binance in 2019: Lawyers claim",
    "SEC Chair Gensler Offered to Serve as Binance Advisor in 2019, Lawyers Claim",
    "Binance Attorneys Say SEC Boss Offered to Be Advisor to Crypto Company in 2019",
    "Gary Gensler and Binance's Connection Dates Way Back; Here's How",
    "Binance wants SEC chair Gary Gensler recused for ‘advising’ the crypto exchange",
    "SEC's Gensler offered to advise Binance in 2019, lawyers claim",
    "Binance Puts SEC Chair Gensler In Hot Water, Will It Affect The Lawsuit?",
    "SEC Chair Gary Gensler offered to advise Binance in 2019: CNBC",
    "Binance Lawyers Claim Gensler Offered to be Company Advisor",
    "Binance Lawyers Claim SEC Chair Gensler Offered to Advise Crypto Company in 2019",
    "Binance's Counsel: SEC Chair Gensler Offered To Serve As An Informal Advisor In 2019",
    "Gary Gensler had close ties to Binance's CZ, offered to serve as exchange advisor: lawyers",
    "US SEC Chair Gary Gensler Allegedly Offered To Work For Binance, Will This Affect Binance Lawsuit?",
    "Wow Binance lawyers allege SEC Chair Gensler offered to serve as advisor to crypto company in 2019",
    "GARY GENSLER AFTER BINANCE DID NOT HIRE HIM LOL [image]",
    "Binance should share Gary Gensler's resume, would love to see his listed hobbies.",
    "The plot thickens 👀 [image]",
    "U.S. Senators Tell DOJ to Investigate Binance for Potentially Lying to Lawmakers: Bloomberg",
    "Elizabeth Warren Says Binance Appears to Have Lied to Lawmakers",
    "Binance Redirected $12B to Firms Controlled by CEO Changpeng Zhao, SEC Says",
    "Binance Moved Billions Through US Bank Accounts Controlled by CZ, Says SEC",
    "Binance Money Trail Reveals $70 Billion Flowing Through Silvergate, Signature",
    "Binance Moved Billions Through Two U.S. Banks, Regulators Say",
    "Senators Ask Department of Justice to Investigate Binance for “Lying”",
    "SEC says Binance funnelled $12bn in funds, Coinbase CEO won't delist tokens",
    "Here is everything the SEC has on Binance.US -Is the ex-CEO a sell-out?",
    "Binance moved $70b through banks, filings show",
    "Binance.US To Remove Over 100 Trading Pairs by Thursday Days After SEC Charges",
    "Statement from Paxos spox: https://twitter.com/... [image]",
    "Changpeng Zhao Ran BAM Trading, Says Former Binance.US CEO",
    "Former Binance.US CEO Brian Brooks Says CZ Was in Charge of the Exchange, Not Him",
    "SEC filings reveal testimony of former Binance.US CEOs",
    "Binance.US addresses SEC motion amid assets freeze concerns",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "OMG OMG OMG OMG OMG [image]",
    "Her name was Catherine Coley",
    "Catherine Coley has entered the chat https://twitter.com/...",
    "🤔 I wonder if Catherine Coley was an informant? https://www.cnbc.com/...",
    "A closer look at Apple's Vision Pro keyboard and other controls",
    "Apple's Vision Pro is the Retina display moment for headsets",
    "I Used Apple's Vision Pro and It's Absolutely Mind-Blowingly Impressive",
    "Apple's Vision Pro & Meta's Vision Oh No",
    "Apple Shows How You Enter Text On Vision Pro",
    "Apple Vision Pro looks great but motion controllers would make it so much better",
    "What it's like to try Apple's new Vision Pro headset",
    "I tried the Apple Vision Pro. I was lost for words",
    "My First Immersion in Apple Vision Pro: Heavy, Man!",
    "We tried the Apple Vision Pro: it's a revolutionary device",
    "I tried Apple's $3,500 Vision Pro glasses and it's not the experience I was expecting",
    "'It's the future of computing': we try Apple's US$3,499 Vision Pro headset",
    "Apple Vision Pro: Our First Thoughts After Trying the Innovative New Headset",
    "‘I saw the future. It left me in tears’",
    "What does the Apple Vision Pro do? Here's everything you need to know after WWDC reveal.",
    "Apple Vision Pro: A Game Changer?",
    "MacRumors video: Trying the Apple Vision Pro headset",
    "The internet won't stop ragging on Vision Pro's price tag",
    "‘Final Cut Pro in AR’ Vision Pro support coming at launch, filmmaker confirms",
    "Video: Trying the Apple Vision Pro Headset",
    "I wasn't expecting Apple's Vision headset to blow my mind. It did.",
    "My first encounter with Apple Vision Pro completely changed by opinion on VR",
    "I tried Apple Vision Pro and it's far ahead of where I expected",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Hands-on: The Apple Vision Pro is best AR and VR experience I've ever tried (and I've tried many)",
    "Apple's Vision Pro experience is so thrilling, I didn't want to leave",
    "Something tells me that Apple Vision Pro is still a VR headset 🤔 [video]",
    "I forgot. - iPad: best-selling tablet in the world",
    "Whoever makes something in between these two extremes wins tbh [image]",
    "Cynics should read this post on the Apple Vision Pro: https://daringfireball.net/...",
    "International Business Times",
    "Introducing WhatsApp Channels",
    "Introducing WhatsApp Channels. A Private Way to Follow What Matters",
    "WhatsApp Channels feature might be attempt to become the new Twitter",
    "WhatsApp for iOS 23.11.76: what's new?",
    "WhatsApp's new feature makes it more like social media than ever before",
    "WhatsApp introduces Channels, a private way to send and receive broadcasts",
    "Meta Soon to Bring Broadcasting Tool ‘Channels’ for WhatsApp",
    "WhatsApp Introduces Channels That Allow You to Follow Important Updates",
    "WhatsApp launches new feature ‘Channels’ for broadcast messages",
    "WhatsApp's new Channels feature lets accounts send one-way updates to followers",
    "WhatsApp launches Channels feature for broadcast messages",
    "Meta introduces broadcast tool Channels on WhatsApp",
    "WhatsApp's latest feature makes it more like Telegram",
    "WhatsApp's new Channels feature brings Twitter's feed to the messaging app",
    "WhatsApp wants you to build a business around its new Channels feature",
    "WhatsApp Channels feature starts rolling out: What it is, 30-day expiry, admin controls and more",
    "WhatsApp adding Twitter-like ability to follow with new ‘channels’ feature",
    "WhatsApp rolls out Channels in Singapore",
    "WhatsApp officially presents channels: here's how they work",
    "Meta announces Channels for WhatsApp: Here's everything you need to know about it",
    "WhatsApp steals another big feature from Telegram",
    "WhatsApp Adds Channels Where You Can Follow Teams, People, Groups",
    "WhatsApp introduces Channels, calls it a private way to follow what matters",
    "WhatsApp announced channels, a new one-way broadcast private tool",
    "WhatsApp introduces Channels: what is it, how it works",
    "WhatsApp announces ‘Channels’, one-way tool to share updates with followers",
    "WhatsApp introduces Channels, a private way to receive updates from people and organizations",
    "WhatsApp debuts one-to-many broadcasting ‘Channels’",
    "Today we're announcing WhatsApp Channels — a private way to follow people and organizations …",
    "Branded Content Guidelines",
    "Twitch scraps ad changes after streamers leave platform",
    "Twitch u-turns after outcry at new branded content guidelines",
    "Twitch rolls back controversial ad guidelines after outcry from creators",
    "Streamer outrage forces Twitch to drop planned changes to branded ad rules",
    "Twitch Nixes Branded-Content Rule Changes After Backlash",
    "Twitch backtracks on branded content changes after streamer backlash",
    "Twitch ‘immediately removing’ controversial branded content guidelines within 24 hours",
    "Twitch has removed their new ad guidelines after streamers threatened to leave platform",
    "Twitch Abandons Bad Ad Changes After Streamer Freak Out",
    "You can read our updated Branded Content Policy here: https://help.twitch.tv/...",
    "This company confuses me https://twitter.com/...",
    "Faster sorting algorithms discovered using deep reinforcement learning",
    "AlphaDev discovers faster sorting algorithms",
    "Deepmind's AI Is Learning About the Art of Coding",
    "Deepmind's AlphaDev discovers sorting algorithms that can revolutionize computing foundations",
    "DeepMind repurposes game-playing AIs to optimize code and infrastructure",
    "AI system devises first optimizations to sorting code in over a decade",
    "DeepMind made its AI name in games. Now it's playing with the foundations of computing",
    "Google DeepMind Unveils AI System to Discover Faster Algorithms",
    "DeepMind AI's new way to sort objects could speed up global computing",
    "Really good article in @WIRED about #AlphaDev! https://www.wired.com/...",
    "I'm shocked Nature published this. https://www.nature.com/...",
    "Great progress with #Alphadev from Google Deepmind! https://twitter.com/...",
    "Bard is getting better at logic and reasoning",
    "Google's Bard AI is getting better at programming",
    "Google Bard is much better at solving coding and mathematical questions now",
    "Google Bard gets a brainy boost",
    "Google's AI chatbot ‘Bard’ is improving at math and programming",
    "Google Bard AI improved for coding tasks and now can export tables to Google Sheets",
    "Google Bard is now more logical as it uses a new technique",
    "Google brings superior logic and reasoning skills to its chatbot Bard",
    "Google's AI Chatbot, Bard, Advances its Logical and Mathematical Capabilities",
    "Google takes Bard to summer school with new math and coding smarts",
    "Google Bard Improved with Implicit Code Execution, Sheets Export",
    "Bard update improves reasoning skills, enables Google Sheets export function",
    "I just used Google Bard's new AI Sheets feature and it's a serious time saver",
    "Google Enhances Bard's Reasoning Skills",
    "The Google Bard chatbot is getting better at math and also can import tables to Sheets",
    "the 8-month tweet-to-google-release R&D pipeline [image]",
    "Google to crack down on office attendance, asks remote workers to reconsider",
    "Google cracks down on hybrid working - and will track staff attendance",
    "Google warns hybrid workers about attendance, asks remote staff to consider coming back",
    "Google tightens back-to-office policy by making attendance part of performance reviews",
    "To fill offices, Google issues ultimatum while Salesforce tries charity",
    "Google really doesn't want its employees to work from home anymore",
    "Unfortunately this is going to set a bad precedent.  Watch other companies follow this pattern :-(",
    "Financial Conduct Authority",
    "BEUC acts against social media platforms for facilitating misleading crypto asset promotion",
    "UK plans to force ‘high risk’ warnings on crypto adverts",
    "Crypto ads will need to carry risk warnings under new UK rules",
    "Crypto ads face stricter rules, referral bonus ban by UK FCA",
    "New UK Crypto Investors Face ‘Cooling-Off Period’ Under FCA Rules",
    "UK to curb crypto advertising with ‘cooling off’ periods, risk warnings",
    "FCA introduces tough new rules for marketing cryptoassets",
    "UK FCA Unveils Stricter Rules For Crypto Marketing",
    "UK clamps down on cryptocurrency sector",
    "FCA cracks down on crypto advertising",
    "FCA's new crypto advertising rules met with mixed industry response",
    "UK Financial Conduct Authority Introduces New Marketing Rules for Crypto",
    "GC23/1 Cryptoasset financial promotions: Guidance for firms",
    "New UK regulations mandate crypto ads to carry risk warnings",
    "FCA to require ‘risk warnings’ on crypto as UK tightens regulation",
    "UK Financial Watchdog Tightens Rules for Cryptoasset Marketing",
    "UK Regulator's New Crypto Rules Include ‘Cooling-off Period’ for Investors",
    "FCA to roll out stricter rules for crypto ads including referral bonus ban",
    "UK to enforce crypto ‘cooling-off period’ in major crackdown",
    "UK to host first global summit on Artificial Intelligence",
    "UK's AI safety summit gets thumbs up from tech giants",
    "UK will host global AI summit to address potential risks",
    "Sunak Seeks Biden's Backing on AI After UK Left Out of Key Talks",
    "UK not too small to be centre of AI regulation, says Rishi Sunak",
    "UK to host first global summit to stop Terminator AI",
    "UK to host global AI summit",
    "UK to host world's first AI summit: PM Sunak",
    "Stay ahead in AI race, tech boss urges West",
    "Britain to host first global AI regulation summit in autumn",
    "Britain to host first global summit on artificial intelligence safety",
    "UK to host global AI safety summit",
    "Coinbase has no plan to delist tokens named in SEC lawsuit, CEO says",
    "US SEC Coinbase, Binance crackdown puts crypto exchanges on notice",
    "Attack of the 50 Foot Blockchain",
    "The SEC sues Coinbase. It's on.",
    "Coinbase affirms support for tokens amid SEC lawsuit, no delistings planned",
    "DeFi Unfazed by SEC's Classification of Tokens as Securities",
    "matt levine on point as always - re: @solana https://www.bloomberg.com/... [image]",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "10 years after Snowden's first leak, what have we learned?",
    "Techtris - Edward Snowen ten-year anniversary edition",
    "What's really changed 10 years after the Snowden revelations?",
    "GameStop CEO terminated as retailer posts further losses",
    "GameStop fires CEO, names Ryan Cohen executive chairman",
    "GameStop (GME) stock: Is a massive sell-off looming on the horizon?",
    "GameStop Shares Fall as It Terminates CEO and Ryan Cohen Becomes Executive Chairman",
    "GameStop Just Fired Its CEO and Named Ryan Cohen Executive Chairman",
    "GameStop slumps after it fires former Amazon executive brought in to modernize the gaming retailer",
    "GameStop Turns to Ryan Cohen. But the Meme-Stock's Recovery Looks Unlikely.",
    "GameStop Announces Election of Ryan Cohen as Executive Chairman",
    "GameStop Fires CEO As Meme Stock Plummets",
    "GameStop Discloses First Quarter 2023 Results",
    "Gamestop CEO “Matt Furlong” Fired & Replaced",
    "GameStop Fires CEO After Only Two Years",
    "Video game retailer GameStop ousts CEO Matt Furlong, elevates Ryan Cohen amid falling sales",
    "GameStop fires CEO Matt Furlong months after axing crypto push",
    "CEO at GameStop is out; stock tumbles 20%",
    "GameStop Removes CEO and Elects Ryan Cohen Executive Chairman",
    "GameStop Fires CEO Who Oversaw Retailer's NFT Push",
    "Video game retailer GameStop fires CEO without cause; Ryan Cohen is Executive Chairman",
    "GameStop fires CEO, names Ryan Cohen exec chair",
    "Furlong leaves GameStop as CEO",
    "Reddit relents, makes first concession in its plans to impair third-party apps",
    "Reddit now says it will allow free API access for developers of accessibility apps",
    "Reddit users, subreddits going dark next week over third-party app access",
    "Reddit says some accessibility apps won't have to pay for its API",
    "Reddit Blackout Planned In Protest Of API Fee Change, What You Need To Know",
    "SK hynix Begins Mass Production of Industry's Highest 238-Layer 4D NAND",
    "SK hynix begins mass production of industry's highest-layer-count NAND chips",
    "SK hynix Commences Mass Production of 238-Layer 4D NAND Flash Memory",
    "SK hynix Commences Mass Production of 238-Layer 3D NAND, Up To 50% Faster Data Transfers",
    "Adobe brings Firefly to the enterprise",
    "Adobe to Sell Generative AI Subscription With Copyright Assurance",
    "Adobe Brings Its Generative AI Tool Firefly To Businesses",
    "Adobe pushes Firefly AI into big business, with financial cover",
    "Adobe brings Firefly, ‘commercially safe’ image-generating AI, to the enterprise",
    "Adobe chief warns competition watchdogs against stifling innovation",
    "Adobe opens up its Firefly generative AI model to businesses",
    "Major Adobe Express update brings Firefly Generative AI integration",
    "It's Even Cheaper To Try Adobe's Firefly AI Now",
    "no takebacks  —  i do not make the rules",
    "Free Figma template of onboarding & activation designs",
    "GoTo nominates Patrick Walujo as new CEO amid profit push",
    "Patrick Walujo to become new CEO of GoTo Group, Andre Soeslityo steps down",
    "GoTo's CEO is stepping down on June 30. Here's his farewell letter to staff",
    "OpenAI Sued for Libel After ChatGPT Allegedly Accuses Man of Embezzlement",
    "ChatGPT for iOS adds Siri & Shortcuts support, and proper iPad app - as it faces lawsuit",
    "Man sues OpenAI over ChatGPT falsely telling a journalist he's embezzling non-profit money",
    "First (?) Libel-by-AI (ChatGPT) Lawsuit Filed",
    "Radio Host Sues OpenAI for Libel After ChatGPT Accuses Him of Crime",
    "ChatGPT ‘hallucination’ falsely said radio host embezzled money, suit says",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Marketing strategies & tips for startups",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/07 - Maybe Apple DOES Want To Get Serious About Mac Gaming",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "OpenAI rival Cohere raises a fresh $270 million to bring generative AI to the enterprise",
    "Airbus, ASML, Ericsson, others in 8.1 bln euro EU microelectronics projects",
    "Pigment Raises $88M in Series C Funding",
    "Business planning innovator Pigment secures $88m",
    "Pigment announces $88 million Series C",
    "Pigment continues growth with $88 million funding round",
    "Business planning platform startup Pigment raises $88M for product development",
    "Apple's AirDrop in focus as China moves to restrict ‘short-range’ file-sharing",
    "Wow, FUCK YOU NO. https://www.washingtonpost.com/ ...",
    "There is now some public evidence that China viewed TikTok data",
    "Exclusive: TikTok Grilled By Bipartisan Senators On ‘Incorrect Claims’ Made To Congress",
    "Senators press TikTok on whether app allowed US data to be stored, accessed by China",
    "The SEC Wants Board Cyber Expertise: How Many CISOs Are Board-Ready?",
    "Report: TikTok Plans to Quadruple Its eCommerce Network",
    "TikTok seeks up to $20 bln in e-commerce business this year - Bloomberg News",
    "TikTok Shop bets on SEA to reach $20b revenue target in 2023: report",
    "TikTok Shop is struggling to catch on in the West, but it's a hit with some indie authors",
    "Payrails on Track to Expand After Raising $14.4 Million",
    "Payrails Raises $14.4M in Seed Funding",
    "Payrails scales FinOps with $14.4m funding led by EQT Ventures",
    "Digibee raises $60M to help companies integrate their software apps",
    "Digibee raises $60M led by Goldman Sachs, bringing total funding to $90M",
    "Digibee Raises $60M in Series B Funding",
    "First on CNN: Pornhub asks users and Big Tech for help as states adopt age verification laws",
    "“pirating API tokens” - apt scene https://twitter.com/... [image]",
    "Meta to introduce new accounts centre after talks -German cartel office",
    "Meta to finally allow users to turn off cross-site tracking",
    "Germany welcomes Meta plan for ‘more transparent’ data use",
    "Meta to give users more control over data following German antitrust order",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Generative AI Is ‘Emerging Opportunity’ For Gaming Investors In 2023",
    "Google Cloud lays out generative AI partnerships, Mayo Clinic deal, customer wins",
    "Google Cloud Collaborates with Mayo Clinic to Transform Healthcare with Generative AI",
    "Google Cloud and Mayo Clinic to explore uses of generative AI in healthcare",
    "Google Cloud, Mayo Clinic Strike Generative AI Partnership",
    "Google Cloud teams with Mayo Clinic on generative AI effort",
    "Mayo Clinic, Google Cloud partner on generative AI to power enterprise search",
    "Mayo Clinic to Deploy Google Cloud's Generative AI Capabilities",
    "Google Cloud, Mayo Clinic make generative AI play",
    "Google Cloud and Mayo Clinic to boost healthcare efficiency with genAI",
    "Google and Mayo Clinic Partner to Infuse AI Into Health Care",
    "Google Cloud Wins Mayo Clinic Partnership",
    "Google, Mayo Clinic Launch Generative Artificial Intelligence Collab",
    "Amazon Prime Video is reportedly planning an ad-supported tier",
    "Report: Amazon Prime Video Could Get an Ad-Supported Tier",
    "Ad-Supported Amazon Prime Video Tier May Not Be Any Cheaper",
    "Amazon plans to add an ad-supported tier to Prime Video",
    "Amazon exploring ad-supported version of Prime Video report",
    "Bell Media's Crave streaming service to offer ad-supported tier this summer",
    "Amazon Prime Video could be getting ads, but at what cost?",
    "Report: Amazon considering adding Ads to Prime Video",
    "Amazon considering Prime Video ads",
    "Amazon reportedly plans ad-supported tier for Prime Video",
    "Amazon reportedly considering ad-supported tier for Prime Video",
    "The Real CNN Drama is Cable News' Growing Irrelevance",
    "Asia Markets Set to Slide Further as Wall Street Pauses Market Rally",
    "Amazon Reportedly Plots Ad-Supported Tier For Prime Video",
    "Amazon is considering an ad-supported tier for Prime Video",
    "Amazon Prime Video is reportedly working on an ad supported tier",
    "Amazon is reportedly working on cheaper Prime Video with ads — what we know so far",
    "Amazon leads declines in discretionary sector, streaming companies outperform",
    "Report: Amazon may bring ad-supported tier to Prime Video",
    "Amazon to introduce ad tier for Prime Video streaming service",
    "Amazon is reportedly planning an ad-supported tier for Prime Video",
    "Report: Amazon Considering Ad-Supported Tier for Prime Video",
    "Amazon is mulling an ad-supported Prime Video tier",
    "Are Ad-Supported Tiers of Max, Paramount+ Coming to Prime Video Channels?",
    "Amazon to Launch Prime Video Plan With Ads, Report Says",
    "Amazon is reportedly planning to launch an ad-supported tier on Prime Video",
    "Prime Video Planning Ad Tier, Report Says",
    "Prime Video Is Reportedly Adding an Ad-Supported Tier",
    "Amazon to Launch Ad-Supported Tier for Prime Video: Report",
    "Every streaming network be like “what if we invented... television” https://twitter.com/...",
    "Everything is an ad network. https://www.wsj.com/...",
    "Apple previews new features coming to Apple services this fall",
    "Apple Podcasts has a slightly refreshed interface in iOS 17",
    "Apple Announces Businesses Can Accept iPhone IDs Later This Year",
    "Apple reveals more Apple Music features for autumn update",
    "Apple Music is getting 6 new features in a free update - here's what's coming",
    "These Apple Music features in iOS 17 make me less envious of Spotify users",
    "iOS 17 will connect your content subscriptions from apps to Apple Podcasts for exclusive benefits",
    "iOS 17: How to download and use offline maps with Apple Maps",
    "Apple adding new Apple Music Collaborative Playlists with iOS 17",
    "More features are coming to Apple devices alongside iOS 17",
    "WWDC: 25+ new Apple Services features coming this fall",
    "Apple to expand how digital IDs can be used this fall",
    "iOS 17 will add support for recurring payments to Apple Cash",
    "Some projects I've worked on are coming soon 🥹 https://www.apple.com/..."
]