[
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 13%",
    "US SEC charges crypto platform Coinbase, one day after suing Binance",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "Coinbase sued by SEC in New York Federal court",
    "Coinbase Violated State Securities Laws With Staking Program, Alabama Regulator Alleges",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker-Dealer",
    "SEC Chair Gensler lambasts crypto industry after agency charges Binance, Coinbase",
    "Coinbase is being sued by the SEC",
    "SEC to Coinbase: You're Making Billions But Failing to Protect Investors",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "SEC Charges Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "SEC Sues Coinbase on Unregistered Securities Exchange Allegations",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "SEC charges Coinbase with running an illegal exchange in fresh blow for crypto",
    "SEC Sues Coinbase for Violating Securities Law, Exposing Customers to ‘Significant Risk’",
    "Coinbase sued in the US for breaking securities laws",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "Coinbase stock plunges 20% on SEC lawsuit",
    "Crypto Twitter abuzz with Coinbase banter after SEC lawsuit",
    "SEC cracking down on crypto: Coinbase, Binance face charges",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "Elon Musk Shills Dogecoin as SEC Designates Top Cryptos as Securities",
    "Coinbase Stock Price: Can Crypto Exchange Survive COIN Shares Slump, SEC Charges?",
    "Crypto Crackdown: SEC Charges Coinbase After Going After Binance",
    "Coinbase May Face Cease & Desist Orders From 10 States Following SEC's Lawsuit",
    "SEC lawsuit triggers selloff in Coinbase stock, COIN down 15%",
    "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market",
    "SEC Goes After Coinbase, Biggest US Crypto Exchange",
    "Ripple's XRP Not Named a Security in the SEC's Case Against Coinbase",
    "SEC sues Coinbase for operating without registration since 2019",
    "Coinbase Sued by SEC for Breaking US Securities Rules",
    "Breaking: Coinbase Sued by SEC Just a Day After Binance Lawsuit - Which Firm is Next?",
    "BREAKING: Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "mission driven company, where the mission is failure",
    "How are the “we take a long view of crypto” people doing today",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "Yes. https://twitter.com/...",
    "Gary upping the ante this week. https://twitter.com/...",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "BREAKING WE'RE ALL CRIMINALS",
    "Mistakes were apparently made... https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "SEC is going crazy https://twitter.com/...",
    "Feds Sue Coinbase One Day After Filing Suit Against Binance",
    "SEC sues Coinbase alleging that it's operating an unregistered exchange",
    "SEC brings charges against cryptocurrency trading platform Coinbase",
    "SEC sues Coinbase over alleged violations of securities laws",
    "SEC accuses Coinbase cryptocurrency exchange of breaking US regulations",
    "Coinbase Staking Program Targeted by Alabama Securities Regulator",
    "SEC claims Coinbase's staking service is an investment contract in lawsuit",
    "Coinbase Stock Down 18% in Pre-Market Trading in Wake of SEC Lawsuit",
    "SEC Sues Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "SEC sues Coinbase over exchange and staking programs",
    "Crypto stocks fall after US SEC sues Coinbase over failure to register",
    "Coinbase Issued Show Cause Notice by Ten US States",
    "SEC Sues Coinbase, Alleging It Acted As An Unregistered Broker",
    "Gensler “very confident” SEC can win against Coinbase, Binance",
    "Bitcoin rises slightly after SEC sues Coinbase alleging it acted as an unregistered broker",
    "SEC Files Charges Against Coinbase for Operating Unregistered Securities, Seeks Major Penalties",
    "Coinbase COIN Stock Drops 10% Following SEC's Lawsuit Against Binance",
    "Marques Brownlee on YouTube",
    "Apple Vision Pro Impressions!",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "Apple made the best face computer.  But it's still a face computer.",
    "Why I Can't Bet Against Apple's Mixed-Reality Prowess",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Apple Vision Pro looks insanely impressive - but my Vision Air 2 guess still feels right",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple's Vision Pro is a genuine leapfrog in mixed-reality capabilities",
    "Did Apple just make a move into the Metaverse?",
    "This is all the futuristic tech inside the Apple Vision Pro headset",
    "What's Clear and Blurry About Apple's Vision Pro Headset",
    "Apple Vision Pro first look",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro Demo Roundup: Here's What Everyone Is Saying",
    "In defense of the Apple Vision Pro battery pack (with one major concession)",
    "TechScape: Is Apple's $3,500 Vision Pro more than just another tech toy for the rich?",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "This is not the final form https://9to5mac.com/...",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "I gotta admit, this part made me a bit sad. [image]",
    "If Apple Vision Pro is the answer, what's the question?",
    "Introducing Apple Vision Pro",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "Apple's $3,499 Vision Pro Headset Will Test Marketing Might",
    "Tim Cook talks Vision Pro price, isolation, ChatGPT, and more in ABC News interview [Video]",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple's entry into VR is a ‘watershed moment,’ say top industry execs",
    "Wear glasses? Apple's already expensive Vision Pro headset will cost you even more",
    "I tried Apple's new headset. Here's what it's like to use",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Tim Cook says $3,500 Apple Vision Pro is ‘a great value’",
    "My ten takeaways from WWDC 2023",
    "Apple's AR Vision Pro headset isn't the HoloLens competitor I thought it was going to be",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple's Vision Pro an impressive headset with few likely buyers, analysts say",
    "Apple Vision Pro vs. Meta Quest 3: The next generation of VR",
    "‘Zombie Wearing Headset’: Anand Mahindra's tweet after Cook's Apple Vision Pro video goes viral",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "Apple's Vision Pro Is Pricey, but It Has a Chance",
    "Apple's Vision Pro Joins Crowded Field Trying to Make Headsets the Next Big Thing",
    "Thank you, Apple! Ignore the haters. Innovation is brave, inspiring, necessary, and cool.",
    "Apple CEO Tim Cook says Vision Pro is 'tomorrow's engineering, today': Exclusive",
    "The Apple Vision Pro is the strangest camera ever made",
    "5 cool gadgets you can buy instead of Apple Vision Pros expected 3 lakh price",
    "Apple's Vision Pro rips off the HoloLens, seven years later",
    "Apple Vision Pro is not just an AR/VR Headset",
    "Stop comparing Apple's Vision Pro to regular VR headsets",
    "Apple CEO says he uses ChatGPT, weeks after Apple banned it",
    "Check out the winners in the 2023 Apple Design Awards",
    "The Apple Vision Pro is the company's first VR headset",
    "Apple Unveils Vision Pro: A $3,499 Headset That Blends AR and VR like Microsoft's HoloLens",
    "Apple Thinking About the Next Decade & Beyond with Vision Pro Announcement",
    "Apple's new Vision Pro headset will support Microsoft Word, Excel, and Teams",
    "EyeSight Is One Of Apple Vision Pro's Wildest Features",
    "Apple's Mixed-Reality Headset, Vision Pro, Is Here",
    "Apple Welcomes the World to Its Augmented Future",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "Nobody Is Taking Apple's $3,500 VR Headset Seriously",
    "Disney To Create Content For Apple Vision Pro, Disney+ Available From Day One",
    "WWDC: Apple unveils Vision Pro headset, cites early 2024 release date, offers AR preview of device",
    "From the seminal 2003 paper on spatial computing [image]",
    "It's far better than I expected, and I had high expectations.",
    "Welcome to the future #RealityPro [image]",
    "She had to sell everything [image]",
    "apple: your ipad is too close also apple: HAHAHAH [image]",
    "should i buy a used car or an apple vision pro",
    "The apple vision pro saved our relationship [image]",
    "POV: the year is 2035 and HR is about to fire you https://twitter.com/... [image]",
    "lets all kill ourselves https://twitter.com/...",
    "interviewer “are you reading from a script?” me: “no why” [image]",
    "Apple Vision Plus - $3600. A book by Mozart and a cup of tea - $25. Not a hard choice.",
    "Apple going no controllers is so beyond stupid. There's no way this is a good idea",
    "Tim Cook dropping a $3.5k face computer right after starting a bank [video]",
    "The reaction to the price of the Apple Vision Pro though! 😂😭 [video]",
    "this says all you need to know about apple vs meta [image]",
    "In Canada, the sales tax on the Vision Pro is the price of a Quest 3",
    "deleting the email like [image]",
    "This is just a great way to parent, that won't affect your children negatively at all [image]",
    "Ok I used it. It's good. Real good. More soon. [image]",
    "Mom? Mom? Mom! Mom are you spatially computing again? [image]",
    "Apple just made folding phones seem like a bargain.",
    "For just $3500! https://twitter.com/...",
    "And not inside a case like in 2007! https://twitter.com/...",
    "Ah - here's why the stock dropped. Menswear guy isn't a fan https://twitter.com/...",
    "Battery fanny pack included. [image]",
    "Here it in in the flesh #AppleVisionPro [image]",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "Some video is the display showing a person you are in a full VR experience. [video]",
    "First in person look at Apple Vision Pro #WWDC23 [video]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "new reaction image just dropped [image]",
    "i just know i'm gonna hate buy this thing so hard [image]",
    "Here it is. Apple Vision Pro. [video]",
    "AHHHHHHHH HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH (Breathes) AHHHHHHH [image]",
    "Notice the bevel on the new Apple VisionPro AR goggles is borrowed from the Apple Watch. [image]",
    "paying $3499 to rewatch my wife and children leave me #WWDC23 [image]",
    "Meanwhile at Meta [Mark Zuckerberg's Eiffel Tower photo]",
    "@WinObs It connects to this setup: [image]",
    "Here's the battery pack [image]",
    "This will be the new Patagonia Vest for Silicon Valley VCS",
    "Oh there's someone using a keyboard. So that's interesting. Yeah I want one.",
    "the Vision Pro seems like a lonely device",
    "time to get a new mortgage 🥴 [image]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "No Tim Cook, the Apple Vision Pro headset does not cost ‘$34.99’",
    "WWDC 2023: Apple launches Vision Pro and raft of products powered by new chipsets",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "‘Tears in my eyes’: Seattle startups sound off on Apple's Vision Pro headset",
    "The Unveiling of Apple's Vision Pro: A Revolutionary Leap Forward in Augmented Reality",
    "Want to develop apps for Apple Vision Pro? Here's Apple's top tips",
    "I wanted the “Wow” factor for the Apple Vision Pro reveal, but all I got was a “Why?”",
    "Word, Excel and Teams are coming to the Apple Vision Pro AR headset",
    "The Future Of Spatial Computing: Apple Unveils The Vision Pro AR Headset",
    "You can make the Apple Vision Pro even more expensive with a luxury leather headband",
    "Unity Software stock price surges on news of Apple's Vision Pro headset. Here's what's happening",
    "Apple Vision Pro + cooperation with Disney is 🔥🔥🔥 #WWDC23",
    "The Disney vision for Apple AR/VR is far more compelling than Apple's demo was [video]",
    "Yeah, Apple just killed Meta and Oculus with this Disney partnership.",
    "Unity + Apple Disney + Apple Meta is done.",
    "Apple's Vision Pro Will Have Prescription Inserts For Glasses Wearers",
    "Me, accepting GDPR popups next year: [image]",
    "Zuck at the Oculus team rn [Image: “Code. I wanna see some fucking code!\"]",
    "mfw watching #WWDC23 [image]",
    "me using the new apple headset [video]",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "US venture capital giant Sequoia to split off China business",
    "VC Firm Sequoia Capital to Divide Into 3 Independent Companies",
    "Sequoia Splits Into Three Entities, Makes China Standalone Firm",
    "Sequoia Capital's Chinese Arm to Split From U.S. Firm",
    "Sequoia India, SE Asia Team Rebrands To Peak XV With $2.5 Bn Dry Powder",
    "Sequoia Capital to carve off China and India units as it faces ‘increasingly complex’ pressures",
    "Sequoia Capital to split into three parts, separating its China and India businesses",
    "Sequoia splitting into three independent entities for India & SEA, China, US & Europe",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Sequoia rebrands to Peak XV Partners in India and SEA",
    "Sequoia Spins Off India Unit; Rebrands To Peak XV Partners",
    "Sequoia to separate China, India and Southeast Asia by March 2024",
    "Sequoia splits China and India arms from US mothership",
    "Here is the global business update we shared with our LPs. [image]",
    "really solid piece from @alexrkonrad https://www.forbes.com/...",
    "👀😳 https://twitter.com/...",
    "End of an era. https://twitter.com/...",
    "Massive moment for venture in India https://www.forbes.com/...",
    "Binance Withdrawal On Track to be Largest Since March Crypto Banking Crisis",
    "Binance experience massive outflows in the wake of SEC lawsuit",
    "Crypto exchange Binance hit by outflows of almost $1 billion in last 24 hours",
    "U.S. SEC sues Coinbase, one day after Binance lawsuit",
    "Investors pull $790 million from crypto exchange Binance after SEC charges",
    "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen",
    "Binance adds Bitcoin NFTs to its marketplace one day after SEC lawsuit",
    "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "In light of SEC suing Coinbase and Binance, some memorable crypto press releases",
    "Is BNB Price Aiming to Trade Below $250? What's Next for BNB Following Binance's Lawsuit?",
    "The SEC, Gaming Tokens, and Web3: What Now?",
    "Binance lawsuit adds another 10 cryptos to SEC securities list",
    "SEC vs. Binance: $115 billion battle over crypto regulation",
    "Shiba Inu Investors Go All-In: 338 Billion Token Accumulation Signals Bullish Cue",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "CFTC Chair Behnam Will Testify at a House Hearing on Bitcoin Futures",
    "SEC's ‘Scathing’ Charges Against Binance Deal a Big Blow to US Crypto",
    "Altcoins Dip Following Second SEC Lawsuit Against Crypto Exchange",
    "SEC Sues Coinbase Over Staking Services, Failing to Register",
    "House Debate Over New Crypto Bill Comes As Binance Suit Shows Regulatory Cracks In U.S.",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "Coinbase stock tumbles after SEC complaint against Binance",
    "SEC Sues Binance Over Violations of US Securities Rules, Exchange Hits Back",
    "SEC Wants Blood: Coinbase Sued 1 Day After Binance",
    "NFT Mogul Transfers NFTs Worth Millions To Show Support For Binance",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "Strong together. https://twitter.com/...",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft to pay $20 million to settle Xbox Live privacy allegations",
    "Microsoft to pay $20M FTC fine over Xbox child account data collection practices",
    "Microsoft Fined $20 Million by FTC Over Storage of Xbox Data",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Microsoft to Pay $20M to Settle FTC Charges It Violated Children's Privacy",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Kids' Xbox Data",
    "Microsoft fined $20m for “collecting children's information”",
    "Microsoft Hit With $20 Million Fine",
    "Microsoft Charged $20 Million by FTC Over ‘Illegally Collected’ Children's Information on Xbox",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Children's Data",
    "Microsoft to pay $20 million for violating children's privacy laws",
    "Microsoft to pay $20 million FTC settlement over improperly storing Xbox account data for kids",
    "The FTC wants Microsoft to pay $20 million for mishandling children's personal information",
    "Microsoft will pay the FTC $20 million to settle charges over collecting children's data",
    "Microsoft To Settle FTC Kids' Privacy Case With $20M",
    "The FTC has fined Microsoft $20 million for illegally collecting children's personal info on Xbox",
    "US fines Microsoft $20m over child data violations",
    "Microsoft hit with $20 million fine after collecting children's data on Xbox consoles",
    "Microsoft settles with FTC for $20 million over Xbox child data violations",
    "Microsoft Must Pay US Government $20 Million Over Xbox Privacy Violations",
    "FTC Fines Microsoft For COPPA Violations Affecting Younger Xbox Users",
    "Why AI wasn't mentioned at all during Apple's big WWDC presentation",
    "For better or worse, Apple is avoiding the AI hype train",
    "Apple users can now type what they ducking want",
    "Apple Ghosts the Generative AI Revolution",
    "Apple WWDC AI word count: 0",
    "“Transformer-based” in the keyboard. First LLM mention. Everyone take a drink. #WWDC",
    "Not sure why anyone thought there would be an AI focus today... https://twitter.com/...",
    "iOS 17 Tidbits: Enhanced Siri Suggestions, Multiple Timers, Recipe Visual Look Up, and More",
    "Apple announces powerful new privacy and security features",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "Craig Federighi on new Apple privacy features; how Apple will protect us from AI",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "Apple introduces revolutionary iOS 17 Check In safety feature",
    "Download the new iPadOS 17 wallpapers right here",
    "Apple WWDC: New Macs, Vision Pro Headset, macOS Sonoma, and iOS / iPadOS 17",
    "Apple iOS 17: Top 17 features coming to iPhones this fall",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple accidentally releases public iOS 17 beta early",
    "iOS 17 beta is here, but only for developers",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "How to install the iPadOS 17 Developer Beta",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "Here Are the iPhone and iPad Models That Will Get the iOS 17 and iPadOS 17",
    "Apple macOS Sonoma: Features, compatibility, more",
    "iOS 17, iPadOS 17, macOS Sonoma, watchOS 10: List of all eligible devices under one roof",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "Apple Podcasts for Creators",
    "iOS 17 makes iPhone more personal and intuitive",
    "iOS 17: What's new for Apple Podcasts",
    "‘Ducking hell’ to disappear from Apple autocorrect",
    "Apple redesigns its Shortcuts app in iOS 17 to be easier to use",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "Yes, interactive widgets are coming to iPhone, too, in iOS 17",
    "Apple Podcasts to get refreshed ‘Now Playing’ interface, new search filters and more with iOS 17",
    "iOS 17 will finally cover up AirDrop flashers",
    "Sharing your phone number will get much easier with iOS 17",
    "WWDC: What's new and coming in iOS 17 for iPhone?",
    "iOS 17: Release date, download, beta, supported devices, and more",
    "How to install the iOS 17 Developer Beta",
    "Smartphone Accessories: Momax 15W MagSafe 3-in-1 Charging Station $50 (58% off), more",
    "iOS 17 Features Revealed, See If Your iPhone Will Get this upgrade",
    "New Apple iOS17 feature would prevent unsolicited nudes",
    "Very excited and proud for Podcasts in iOS 17 https://podcasters.apple.com/ ...",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "Unlock a new pipeline channel: your existing customers",
    "Next Challenger, Please: Reshaping The Tech Landscape Using AI",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Important new post from @pmarca https://a16z.com/...",
    "Reddit's plan to kill third-party apps sparks widespread protests",
    "The Battle for Reddit: Users and Developers Unite in Protest against Unfair API Fees",
    "Here's why so many Reddit communities are planning to go offline for 48 hours (or more)",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "TSMC can help ‘stabilize’ U.S.-China relations: Chairman",
    "TSMC feeling ‘good’ about possible Germany plant, in talks on subsidies",
    "TSMC Says Capex to Be Near Low End of Target at $32 Billion",
    "“Going to the US is not all downside” https://www.ft.com/...",
    "Made it. $TSM AGM. I'm at the back, final row. 🙃 [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Payroll platform Immedis snapped up by US workforce management firm",
    "Payroll provider UKG to acquire Immedis from CluneTech",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Digital asset-denominated life insurer Meanwhile snags $19 million funding round",
    "Mobileye Stock Falls. Intel Found a Way to Cash in on AI.",
    "Mint Explainer: What's Byju's beef with its lenders?",
    "High-Flying Indian Startup Byju's Skips Payment on Dollar Loan",
    "A Long, Strange Trip for the ‘Uber for Nurses’",
    "AI generated content should be labelled, EU Commissioner Jourova says",
    "Gigabyte rolls out update to fix dangerous backdoor in its motherboards",
    "You can now update your Gigabyte motherboard BIOS to fix that security backdoor",
    "watchOS 10 beta 1 hands-on: Software that finally takes advantage of bigger screens",
    "Want quick access to Bing Chat on your phone? Add this handy widget",
    "watchOS 10: All you need to know about the next major Apple Watch update",
    "Apple Watch will now track your mental health. #WWDC23 #watchOS10 [image]",
    "This mental health focus in Apple's WWDC keynote is very cool. 💙",
    "AirPods redefine the personal audio experience",
    "AirPods are getting an upgrade with Adaptive Audio and more",
    "WWDC: Apple promises great AirPods updates",
    "Apple Adaptive Audio for AirPods — what it is and how it works",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "@MKBHD “Adaptive Audio” rebrand: “Selective Listening”",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "These are the macOS Sonoma features that aren't available to Intel Macs",
    "Apple debuts macOS 14 Sonoma",
    "WWDC: What's new in macOS Sonoma?",
    "Safari 17 in macOS Sonoma beefs up user privacy",
    "Presenter Overlay is going to kill many indie apps #WWDC23 [image]",
    "Literally no one plays AAA games on Mac and this changes nothing. And will change nothing.",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "What we know about the MOVEit vulnerability and compromises",
    "BBC and British Airways affected by data breach at payroll company Zellis",
    "British Airways, BBC and Boots were impacted the by Zellis data breach",
    "Clop Hits British Airways, BBC and Boots as Organizations Brace for More Attacks",
    "MOVEit victims emerge: British Airways, BBC and Nova Scotia",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "Extent of N.S. software breach still unknown, Microsoft blames ransomware gang",
    "Boots, BA and BBC have data stolen in cyber attack",
    "Major Data Breach Exposes BA, BBC and Boots to File Transfer Hack: What You Need to Know",
    "British Airways staff's details stolen in cyber breach hitting firms around the world"
]