[
    "@tchambers@indieweb.social",
    "@film_girl@mastodon.social",
    "@rodhilton@mastodon.social",
    "@noracodes@tenforward.social",
    "@trochee@dair-community.social",
    "This is Instagram's new Twitter competitor",
    "Instagram Readies Twitter Competitor for Summer Release",
    "Look Out Bluesky, Instagram's Twitter Clone Could Launch in June,",
    "Meta's top secret Twitter-killer app is coming soon",
    "Images of Instagram's Twitter Competitor Leaked, Lets Users Reach New Audiences",
    "Instagram prepares Twitter competitor for summer release - Bloomberg News",
    "Instagram Is Preparing A Twitter-Like App To Be Launched This Summer, Report Says",
    "Instagram is readying a Twitter-like service",
    "Instagram's text-based app might make Twitter users jump ship",
    "Meta's Twitter Competitor App is Set to be Launched Some Time Next Month",
    "Instagram's New Twitter Competitor Revealed",
    "Meta has been working on a new Twitter competitor, and here's what it looks like",
    "Instagram's Twitter-Like App Could Be Released Next Month",
    "Meta's Twitter rival Instagram app “P92” reportedly coming in June",
    "Meta to release text-based version of Instagram, similar to Twitter",
    "If this is Instagram's Twitter competitor, I'm ready to jump ship",
    "Meta's Instagram is working on a text-based app to rival Twitter",
    "Everything we know about Instagram's Twitter clone, due this summer",
    "Meta planning to use Instagram to supplant Twitter - here's the proof",
    "Instagram will soon release a text-based app to take on Twitter",
    "Instagram to Launch Twitter Competitor with New Text-Based App",
    "Instagram readies Twitter competitor for summer release: Report",
    "Instagram's Twitter Clone Leaks: Here are the Features",
    "Leaked Image Shows What Instagram's New Twitter Competitor Looks Like",
    "Meta's rumored Twitter competitor could launch as early as next month",
    "Report: Meta Aims to Launch Text-Based App this Summer",
    "Instagram readies Twitter competitor",
    "Satisfied With Its TikTok Clone, Meta Is Working on a Twitter Clone",
    "Instagram's New Twitter Competitor Leaks",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "curious to see how well this does... https://twitter.com/...",
    "Let's see how this goes. https://www.theverge.com/...",
    "... are you seriously telling me Facebook is pushing “pivot to text?” https://twitter.com/...",
    "Instagram joins Fediverse? https://twitter.com/...",
    "This is Instagram's new Twitter rival app https://www.theverge.com/...",
    "@mattmday Right??? I think I've joined like 9 new apps in the last 6 months",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]",
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "China approves Xbox acquisition of Activision Blizzard as pressure builds on CMA",
    "Microsoft says China approves its plan to buy video game-maker Activision Blizzard",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "37 Countries Have Now Approved Microsoft's Deal To Buy Activision Blizzard",
    "China approves Microsoft-Activision merger",
    "Microsoft Reportedly Gets China Regulator Approval on ABK Deal",
    "China approves Microsoft's Activision Blizzard acquisition",
    "Microsoft Gains China's Antitrust Regulator Approval For Activision Purchase",
    "In The Latest Xbox ActiBlizz Twist, China Reportedly Approves Microsoft's Acquisition",
    "Bank of England plans to reject Revolut's bid for banking licence",
    "SoftBank Butts Heads with Revolut Over Plan to Secure Banking License",
    "Revolut's Application For A UK Banking License May Be Rejected",
    "Revolut Introduces Multi-Currency Business Accounts in Australia",
    "Revolut's application for a UK banking license may be rejected: Telegraph",
    "Revolut UK Banking License Application Faces Rejection by Bank of England",
    "Revolut Could See License Application Denied, But Crypto Offerings Unaffected",
    "Revolut May Not Get Banking License From Bank Of England",
    "Bank of England reportedly plans to reject Revolut's banking licence bid",
    "Revolut faces reported rejection for a UK banking license; offers to withdraw application",
    "Revolut plans expansion into Australia",
    "Not terribly surprising. https://twitter.com/...",
    "@chrismessina@mastodon.xyz",
    "2022 App Store Transparency Report",
    "Apple shares App Store Transparency report, detailing removals & data requests",
    "Chinese Communist Party submitted by far the most App Store takedown demands to Apple",
    "Apple reveals exactly how many apps were in the App Store at the end of 2022",
    "Apple Releases 2022 App Store Transparency Report",
    "The App Store had 1,783,232 apps as of 2022",
    "Apple Publishes First-Ever App Store Transparency Report",
    "Apple's App Store Blocks $2bn in Fraudulent Transactions",
    "That's about 25 app updates per device per week",
    "How to optimize your LinkedIn profile and grow it to get noticed by recruiters",
    "This website has a fake commenter problem  —  https://www.ft.com/...",
    "Australia's Stock Exchange ASX Axes Blockchain Initiative—for Good",
    "Australian stock exchange officially abandons blockchain plans: Report",
    "Australian Stock Exchange Scraps Blockchain Project",
    "Australian Stock Exchange Drops Plans for Blockchain Implementation",
    "Blockchain Plans Scrapped By Australian Stock Exchange - Here's Why",
    "Australia's Top Stock Exchange Says No to Blockchain",
    "The open secret about “web3” is that the technology is actually shit. https://twitter.com/...",
    "Is The Metaverse Dead? No - Here're NFT Games Ranking High In Upcoming NFT Bull Run",
    "it was the pokemon IP that made it a hit, not the AR https://twitter.com/...",
    "International Business Times",
    "Bitcoin is the Dominant Digital Commodity, Says Michael Saylor at Bitcoin 2023 Conference",
    "Miami Bitcoin Conference To See Fewer Attendees This Year: Here's Why",
    "Bitcoin 2023 Attendees in Miami Blame Bear Market Vibes for Lower Attendance",
    "Bankrupt Crypto Lender Celsius Network Makes Massive $780M Withdrawal from Staked Ethereum",
    "Bankrupt Crypto Firm Celsius May Receive Second Chance from Wall Street",
    "Wall Street Giants Battling to Restart Celsius With $50M Injections",
    "Celsius Plans To Conclude Bankruptcy Auction Within A Week",
    "Report: Auction for Bankrupt Crypto Firm Celsius Network Lasts Weeks",
    "Personalized wealth management, built for tech people",
    "Google will remain default search on Samsung devices: WSJ",
    "Samsung not planning to replace Google with Bing in phones: report",
    "Samsung decides to keep Google as its default device search engine after all",
    "Samsung puts its move to Bing search on pause for now",
    "Samsung reportedly decides to keep Google as the default search engine on Galaxy devices",
    "Google keeps default search engine status on Samsung phones, but for how long?",
    "Samsung Decides to Retain Google as Its Default Search Engine, Sidestepping Bing",
    "Are You Loyal to a Smartphone Brand, Like Google or Samsung?",
    "Samsung reportedly won't drop Google as its default search engine — for now",
    "Sorry Bing, Samsung's sticking with Google as its default mobile search engine",
    "Report: Samsung Galaxy phones no longer considering switch from Google to Bing",
    "Samsung sticking with Google Search (for now)",
    "Samsung Reportedly Sticking With Google As Search Engine Of Choice For Its Phones",
    "Samsung backs down from its threat to switch its Android phones to Bing",
    "Sorry Bing, Samsung is sticking with Google",
    "Samsung's Bid to Swap Google with Bing on Smartphones Put on Hold",
    "Samsung Decides Not to Replace Google With Bing as Default Search on Phones: Report",
    "Samsung Stands by Google, Will Not Choose Bing for Its Galaxy Smartphones",
    "Samsung pauses on plan to replace Google Search with Bing on Galaxy devices",
    "Report says Samsung has decided not to replace Google with Microsoft's Bing in its phones",
    "Samsung abandons plans to switch default search engine to Microsoft's Bing",
    "Report: Samsung Has Dropped its Plan to Replace Google with Bing on Galaxy Phones",
    "Google Can Stop Panicking, Samsung Phones Aren't Switching to Bing",
    "Samsung realized ditching Google for Bing isn't such a great idea after all",
    "Samsung's plan to replace Google with Bing might be dead",
    "Good news for Google! Samsung may not replace its Search with Bing",
    "Google Parent Alphabet Stock Rises. It Got Some Big News From Samsung.",
    "Right. As should be obvious to anyone, Bing is damaged goods as a brand.",
    "Kia and Hyundai agree to $200M settlement for making cars viral theft targets",
    "Hyundai Motor America and Kia America Resolve Consumer Litigation in Response to Vehicle Thefts",
    "Hyundai, Kia agree to $200 million settlement over US car thefts",
    "Kia and Hyundai agree to $200M settlement over car thefts",
    "Hyundai and Kia will pay $200 million in settlement over ‘Kia Challenge’ car thefts",
    "Hyundai to pay $200 million thanks to a security flaw discovered by TikTok",
    "Hyundai and Kia will pay $200 million over car thefts prompted by ‘Kia Boyz’ TikTok videos",
    "Hyundai and Kia agree to $200 million settlement over TikTok car theft challenge",
    "Kia and Hyundai settled a class-action lawsuit accusing their cars of being too easy to steal",
    "Hyundai, Kia agree to pay $200 million to settle lawsuit after rise in thefts",
    "Hyundai and Kia Owners to Receive $200M+ in ‘Kia Boys’ Class Action Suit",
    "Restaurant Technology News",
    "Restaurant365 Raises $135 Million to Enhance Its Suite of Restaurant Management Solutions",
    "Restaurant365 Announces $135M Funding Round Co-Led by KKR and L Catterton",
    "Restaurant365 Raises $135M in Funding",
    "I've now confirmed the valuation is above $1B for R365. Updating story... https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/19 - ChatGPT Comes To The App Store",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "San Francisco Business Journal",
    "Andreessen Horowitz's Jordan Steps Back",
    "The Funded: A16z's Jeff Jordan, who led investments in companies such as Airbnb, is moving on",
    "Jeff Jordan steps back from Andreessen Horowitz",
    "GOAT investor, operator, human being ⁦@jeff_jordan⁩ https://www.forbes.com/...",
    "The only person at a16z who has ever made sensible investments https://twitter.com/...",
    "“you start doing the math, and you're like, holy shit” https://twitter.com/...",
    "Instacart's ad business reportedly soared 30% last year",
    "Nearly 30% of Instacart's revenue is from advertising",
    "Sabi Raises $38 Million for B2B Marketplace Serving African Retailers",
    "Nigerian E-Commerce Startup Sabi Raises USD 38 M Series B Round",
    "Scaling with success: Wasoko's rise in Africa's B2B e-commerce",
    "Big tech still advertising on Twitter despite rise in hate speech",
    "Twitter's biggest ad buyer no longer considers it ‘high risk,’ says report",
    "Linda Yaccarino brings ads peace, GroupM says Twitter is no longer high risk",
    "Montana's TikTok ban ‘wields a sledgehammer’ to First Amendment rights, creators say",
    "Turkey troubles and a Microsoft tussle: The latest on Twitter",
    "Top Advertising Firm Removes ‘High Risk’ Label From Twitter",
    "Twitter advertising now safe, says biggest spender; TikTok ban challenged in court",
    "Top ad group says Twitter no longer ‘high risk’ after new chief appointed- FT",
    "@Techmeme It's gotten even worse, what are they talking about?",
    "Just as Musk is descending into full-blown antisemitism. https://twitter.com/...",
    "BGMI's return may spur investments, gaming prize money",
    "BattleGrounds Mobile India is back: So what happened?",
    "Authorities grant Battleground Mobile India a three-month trial period",
    "BGMI unban: How Krafton got a 3-month lease on life and should you be excited",
    "BGMI game returns to India under strict conditions; close watch on user harm, addiction [details]",
    "As BGMI returns, government outlines 3-month probation, conditions for Krafton",
    "Krafton's BGMI To Make A Comeback In India, But T&C Apply",
    "Krafton's BGMI game set for comeback after government lifts ban temporarily",
    "India lifts ban on Krafton's battle-royale game after a year",
    "How many Instagram followers you need to start making money",
    "How Much Should an Influencer Marketing Campaign Cost?  A Marketer's Guide",
    "TikTok influencers sue Montana to overturn state's ban",
    "For Influencer Marketing, AI May Not Be Just a New Tool, but a Sea Change",
    "The medium is the menu https://www.grubstreet.com/...",
    "what are we even doing https://www.grubstreet.com/... [image]",
    "Electronic Frontier Foundation",
    "Supreme Court hands tech companies a win, and not just about Section 230",
    "What are the key takeaways of the decisions? How important are they?",
    "Supreme Court Dismisses Claims of Google and Twitter Aiding Terrorism",
    "In cases involving Google and Twitter, the Supreme Court chooses to defend Section 230",
    "Supreme Court rules against reexamining Section 230",
    "Section 230 Just Survived a Brush with Death",
    "Twitter, Google win big at Supreme Court",
    "Supreme Court Sidesteps Ruling on Scope of Internet Liability Shield",
    "The Internet Dodges Censorship by the Supreme Court",
    "Technology & Marketing Law Blog",
    "The Internet Survives SCOTUS Review (This Time)-Twitter v. Taamneh and Gonzalez v. Google",
    "SCOTUS spares Section 230, rules Google, Twitter not liable for aiding ISIS",
    "Tech keeps liability shield in Supreme Court win",
    "Google & Other Tech Giants Not Liable For Terrorist Content",
    "Supreme Court rules in favor of Twitter and Google, avoiding the issue of Section 230 for now",
    "Supreme Court unanimously sides with Twitter in ISIS attack case",
    "Supreme Court sides with Twitter, Google over tech platform liability",
    "Supreme Court: Lazy Content-Moderation Doesn't Mean Platforms Aided Terrorists",
    "The Supreme Court decides not to break the internet",
    "Supreme Court ruling continues to protect Google, Facebook and Twitter from what users post",
    "Supreme Court sides with tech giants over legal shield for content",
    "Twitter and Google survived a Supreme Court challenge—and so did Section 230",
    "Supreme Court Hands Tech Industry Win by Leaving Section 230 Internet Shield in Place",
    "SCOTUS Says It Won't Mess With Section 230, for Now",
    "Q&A: Section 230 is at the Supreme Court. Here's Why that Matters for Free Expression",
    "Supreme Court Sides With Google and Twitter in Challenges to Internet Liability Shield",
    "NVIDIA GeForce RTX 4060 to cost €329 in Europe",
    "NVIDIA Confirms Founders Edition Only for RTX 4060 Ti 8 GB",
    "NVIDIA Brings the Ada Lovelace Architecture to the Masses With GeForce RTX 4060 Family",
    "Nvidia Brings Ada Lovelace Architecture To Mainstream Gaming",
    "NVIDIA GeForce RTX 4060 Ti & RTX 4060 Custom Models Roundup: From ITX To Triple-Fans!",
    "NVIDIA Takes A Deep Dive On VRAM For Its GeForce RTX 40 Series GPUs",
    "NVIDIA confirms it won't make a Founders Edition of the RTX 4060 GPU",
    "Nvidia's RTX 4060 and 4060TI are actually priced like mid-tier cards",
    "Nvidia is giving away RTX 4060, 4060 Ti, 4080, and 4090 cards this summer",
    "Nvidia Announces a $299 RTX 4060 With the 4060 Ti Arriving May 24 For $399",
    "Nvidia introduces us to the RTX 4060 family",
    "ASUS Unveils NVIDIA GeForce RTX 4060 and 4060 Ti Graphics Cards",
    "Nvidia GeForce RTX 4060 GPUs Announced, Starts at $299",
    "Nvidia debuts GeForce RTX 4060 family, GeForce Now teams with Xbox",
    "NVIDIA Announces Latest Ada Lovelace Additions: GeForce RTX 4060 Ti & RTX 4060",
    "Nvidia stock rises after company announces new graphics cards in GeForce RTX 4060 family",
    "Nvidia RTX 4060 Ti vs. RTX 4060: here's how they stack up",
    "GeForce RTX 4060 & RTX 4060 Ti Announced: Available From May 24th, Starting At $299",
    "DLSS3 Technology on a Budget: NVIDIA's RTX 4060 Series",
    "Nvidia's huge RTX 4060 Ti and RTX 4060 GPU giveaway will make this a sweet summer",
    "AMD Radeon RX 7600 Specs Confirmed as It Preps to Battle the RTX 4060 Series",
    "Nvidia Reveals RTX 4060 Family, The ‘Ultimate’ GPUs For 1080p Gaming",
    "Nvidia to Give Away Hundreds of RTX 4060, 4060 Ti Cards This Summer",
    "NVIDIA announces GeForce RTX 4060 Ti at $399, RTX 4060 to launch in July at $299",
    "Nvidia announces GeForce RTX 4060 series starting at $299",
    "NVIDIA GeForce RTX 4060 Ti and RTX 4060 Launched",
    "Nvidia's RTX 4060 series is official & it's good news for budget gamers",
    "AMD Radeon RX 7600 specifications leak with same VRAM as NVIDIA GeForce RTX 4060 Ti series",
    "NVIDIA unveils RTX 4060 and 4060 Ti starting at $299",
    "GeForce RTX 4060 Announced",
    "Nvidia Officially Announces GeForce RTX 4060 Ti Desktop GPUs",
    "DLSS 3 + AV1 + Super low power consumption = 👍👍👍 https://twitter.com/...",
    "Twitter's new 2-hour video feature is already making it a hub for pirated movies",
    "Twitter now supports 2 hour video uploads, and you can guess what happened next",
    "About longer videos for Twitter Blue subscribers",
    "One Degree Friday May 19 2023  —  Twitter now allows paid users to upload two-hour videos",
    "Twitter users upload movies illegally after company rolls out feature to allow two-hour videos",
    "Twitter Blue Enables Two-Hour Video Uploads — And the Piracy Ensues",
    "Twitter Blue Subscribers Can Now Upload 2-Hour Videos in the App",
    "Twitter Blue Debuts 2-Hour Long Video Uploads",
    "Twitter Blue users get another perk: two-hour video uploads",
    "Twitter Videos Go Feature-Length With Support For Two-Hour Uploads",
    "Piracy-loving Twitter Blue users exploit new 2-hour video limit",
    "Twitter Blue Verified Subscribers Can Now Upload 2-Hour Videos",
    "Twitter will now let you upload 2-hour videos, but why would you?",
    "Twitter Blue subscribers can now upload videos as long as two hours",
    "Twitter Blue benefits now include two-hour video uploads, says Elon Musk",
    "Twitter now lets Blue subscribers upload two-hour videos",
    "Twitter Blue subscribers can add up to two hour long videos, says Elon Musk",
    "Elon Musk announces new feature for Twitter, check out what is it?",
    "Twitter Blue Subscribers Can Now Post Full-Length Videos up to Two Hours Long",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "this entire platform was made with brevity in mind https://twitter.com/...",
    "Feels like the current owner of this app doesn't know what made it good. https://twitter.com/...",
    "Just what the blue checks need https://twitter.com/...",
    "More movies coming to Twitter https://twitter.com/...",
    "“We wanted flying cars, instead we got two-hour-long tweets” https://twitter.com/...",
    "Meta Custom Silicon: What's Old Is New",
    "Reimagining Our Infrastructure for the AI Age",
    "Microsoft offers electrical engineers a lifeline as it pursues custom cloud silicon",
    "Meta Platforms Crafts Homegrown AI Inference Chip, AI Training Next",
    "Meta is building a new custom chip to run AI models",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Data Center Design",
    "Meta is developing its own AI chip - here's hoping it goes better than the Metaverse",
    "Meta AI plans: Optimised data centres, supercomputers and custom chips",
    "MTIA v1: Meta's first-generation AI inference accelerator",
    "Meta is working on a new chip for AI: What meta plans to do with it",
    "Meta is working on its own chip, data center design for AI workloads",
    "It's a wrap: News this week (May 13-19)",
    "Meta Announced New Chips Specifically Designed for AI Models",
    "Meta built a code-generating AI model similar to Copilot",
    "Meta is working on a new chip for AI",
    "Meta announces AI training and inference chip project",
    "Meta reveals new details about in-house AI chips",
    "Meta unveils its first custom AI chip",
    "Meta pulls the curtain back on its A.I. chips for the first time",
    "Meta Discloses Its Second Custom Processor, And This Should Interest Investors",
    "Meta Completes Research SuperCluster, Announces Next-Gen Datacenter",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Coder Tools",
    "Meta Platforms unveils next-generation AI infrastructure and data center designs",
    "Meta is offering its AI tech as an open source software, a move that rivals perceives as dangerous",
    "@aphysicist @ArturTanona Nope",
    "@ylecun @ArturTanona Did you get an invite to testify in front of congress yet?",
    "The next stages of Privacy Sandbox: General availability and supporting scaled testing",
    "Google Chrome 3rd Party Cookies Crumbling — Finally!",
    "Google to Disable Third-Party Cookies for ‘Privacy’",
    "Privacy Sandbox Initiative: Google to Phase Out Third-Party Cookies Starting 2024",
    "Google Chrome is turning off third-party cookies for some users - but it probably won't be you",
    "Google will start phasing out third-party cookies from Q1 2024",
    "Google's Privacy Sandbox updates are met with both skepticism and a little more optimism",
    "Google's turning off third-party cookies for 1 percent of Chrome users early next year",
    "Google to Phase Out Cookies for 1% of Chrome Users in Early 2024",
    "Google will deprecate cookies for 1% of users in Q1 2024",
    "Google will disable third-party cookies for some Chrome users in early 2024",
    "Google's Privacy Sandbox is ready. Chrome to drop third-party cookies in 2024",
    "Google Chrome will soon add 6 relevance and measurement APIs",
    "Preparing to ship the Privacy Sandbox relevance and measurement APIs"
]