[
    "International Business Times",
    "The Eclectic Light Company",
    "@McCullohMD@disabled.social",
    "@austinkocher@mastodon.social",
    "@tchambers@indieweb.social",
    "@CelloMomOnCars@mastodon …",
    "Tired of Elon Musk? Here are the Twitter alternatives you should know about",
    "How many users are on Threads ? Where Meta App is available and how figures compare to Twitter",
    "Instagram's Threads to get Twitter-like hashtags support, edit button and more",
    "Twitter clones, ranked: Who's worth the commitment?",
    "How to use Threads - Beginners Guide",
    "Avoid Threads if you value your privacy",
    "Meta's Twitter Rival ‘Threads’ Crosses 90 Mn Sign-Ups Within Days Of Launch [Details]",
    "Disgraced Comedians Are Looking for a Second Chance on Threads",
    "Mastodon, Threads, Bluesky and what next?",
    "Don't Count Bluesky Out Yet",
    "Cage Match: Twitter vs. Threads, PeakGPT, Local News Survival",
    "Apple was right not to run a social network",
    "Threads won't kill Twitter if it's boring",
    "Meta's Threads by Instagram collects A LOT of data",
    "Why Threads has a shot, but only 5 social media platforms actually matter",
    "Bluesky Hits 1 Million Installs As Competition With Threads Heats Up",
    "Threads is Libra and Meta All Over Again",
    "Meta launches Threads app as an alternative to Twitter",
    "@CelloMomOnCars@mastodon.social",
    "How Threads' Privacy Policy Compares to Twitter's (and Its Rivals')",
    "How Threads' privacy policy compares to Twitter's (and its rivals') - Ars Technica",
    "How Threads' privacy policy compares to Twitter's (and its rivals')",
    "@jpholbrook@mastodon.online",
    "A eulogy for Twitter: the place us journalists loved, for better or worse",
    "Great read, well written. And sadly agree. https://twitter.com/...",
    "@falschgold@mastodon.social",
    "How Twitter lost its place as the global town square - Washington Post",
    "How Twitter lost its place as the global town square",
    "AI robot asked ‘will you rebel against humans’?",
    "Some US schools are deploying robots that can surveil campuses and confront intruders",
    "We're going to give the job of bullying incel weirdos to the robots https://twitter.com/...",
    "robertodoering / harpy on GitHub",
    "@mranthropology.bsky.social",
    "0.10.3  —  For the time being harpy is still working by using Twitter's legacy v1 api.",
    "The old, good version of TweetDeck is back",
    "Good news: Old TweetDeck is back [image]",
    "The good version of TweetDeck is back, but for how long?",
    "@intelwire@mastodon.social",
    "@avandeursen@fediscience.org",
    "Yellen visits China amid worst economic tension in decades",
    "Oops.  It turns out that US chipmakers cannot survive without China",
    "The Supreme Court of the State of New York",
    "GEMINI TRUST COMPANY, LLC, v. DIGITAL CURRENCY GROUP, INC. and BARRY SILBERT",
    "DCG Dismisses Gemini Lawsuit As “Publicity Stunt” By Winklevoss",
    "Crypto firm Gemini sues Genesis-owner DCG",
    "Gemini Sues Digital Currency Group and Founder Barry Silbert Alleging ‘Fraud’",
    "Crypto Clash: Gemini And Genesis Owner Barry Silbert Go To Court Over Lost Bitcoin",
    "Gemini Sues Barry Silbert, DCG as Genesis Restructuring Stalls",
    "Gemini takes legal action against Digital Currency Group for alleged fraudulent activities",
    "Winklevoss twins sue crypto investor DCG after dispute over restructuring",
    "US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute",
    "Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency",
    "Gemini Files Lawsuit Against Digital Currency Group and Barry Silbert Alleging Fraud and Deception",
    "Gemini Sues Digital Currency Group Founder for Fraud",
    "Gemini Sues Barry Silbert And His Company DCG Alleging Fraud Against Earn Users",
    "Gemini Lawsuit Accuses Barry Silbert and Digital Currency Group of Fraud",
    "Gemini files lawsuit against DCG and Barry Silbert alleging fraudulent activities",
    "Gemini suit accuses DCG, Silbert of ‘aiding and abetting fraud’",
    "Winklevoss's Gemini Crypto Exchange Sues DCG, CEO Barry Silbert",
    "Gemini Sues Genesis Owner Over Failure to Recover Customers' Bitcoin",
    "Breaking: Gemini Files A Lawsuit Against Digital Currency Group and Barry Silbert for Fraud",
    "Our whole industry is becoming a novella. https://twitter.com/... [image]",
    "I cannot wait to see discovery https://twitter.com/...",
    "Could have been avoided by doing 15 minutes of due diligence. https://twitter.com/...",
    "'Like Gen Z's Takeover Of Twitter': Creators React To Threads, Meta's New Social App",
    "It's a huge win for Zuckerberg if Threads steals Twitter's lost charm and serendipity",
    "Threads Is Not an Automatic Win for Meta",
    "‘All aboard the Threads train!’ New York agencies join Instagram's new alternative to Twitter",
    "A Threadful plot twist in the race to displace Twitter",
    "Who's on Threads? And Who's Sitting Out?",
    "Threads, Meta's Twitter clone, just launched and people are already complaining about it",
    "Meta Launches the First Credible Twitter Killer",
    "Is Twitter's viability hanging by a Thread?",
    "With Meta's Threads, Zuck seized an opportunity and took a page from Steve Jobs",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Twitter user suspended for tracking Elon Musk jet moves over to Threads",
    "Elon Musk is the gift that keeps on giving to Mark Zuckerberg",
    "What chances does Musk have of winning the lawsuit against Zuck?",
    "Meta's new ‘Twitter-Killer’ is just more of the same",
    "I finally joined Twitter - and Threads - to see what all the fuss was about",
    "Elon Musk & Twitter Can Sue Mark Zuckerberg & Threads Over ‘Copycat’ Issue!",
    "Elon Musk Twitter account goes viral by calling Mark Zuckerberg a lizard, ‘see you in the cage’",
    "Elon Musk replies to his own parody Twitter account. Here's what he says ...",
    "Instagram Threads Hits 70 Million As Tech Stars Join Twitter Clone: Here's Who To Follow",
    "A ‘Thread’ About Twitter....And The End Of The Honest Internet",
    "Is Threads threatening Twitter's reign?",
    "Instagram's Threads threatens to destabilize Twitter, enticing users & potential ad spend",
    "Mark Zuckerberg vs Elon Musk: clash of the tech egos",
    "Meta's Threads Passes 70M Signups; Users More Than Double In One Day",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Musk files lawsuit against Meta as Threads surpasses 50 million users in one day",
    "Silicon Valley Business Journal",
    "Incredible. Seriously, add this to Musk's list of accomplishments. https://www.wsj.com/...",
    "Opinion: If Threads work, it won't be because it toppled Twitter, but because it toppled Instagram",
    "“Threads app is not for news and politics,” says Instagram CEO Adam Mosseri",
    "Meta will soon let you delete your Threads profile without nuking your Instagram account",
    "Meta's Threads has hit 70 million signups, Mark Zuckerberg says",
    "Online News Act creates ‘moment of reckoning’ for publishers",
    "Meta Threads doesn't need the ‘negativity’ of hard news and politics, exec says",
    "Meta executive claims goal of Threads is to create a ‘less angry place,’ not replace Twitter",
    "Threads Barrels to 70 Million Sign-Ups in Just 2 Days",
    "Meta's ‘friendly’ Threads collides with unfriendly internet",
    "Instagram Head Says Meta 'Won't Encourage' News on Threads",
    "Meta's vision for Threads is more mega-mall than public square",
    "Threads: We Don't Need Hard News or Politics on Our Platform",
    "Instagram Head Wants Threads to Be a Sterile, News-Free Environment",
    "The Missing Threads Features Adam Mosseri Says Are ‘On The List’",
    "Threads Is Working On A Chronological Feed",
    "Threads will soon allow deleting your account separately from Instagram",
    "good luck with that [embedded post]",
    "The Meta team is low-key roasting politics Twitter over on the other app [image]",
    "sad trombone.mp3 https://twitter.com/...",
    "That's up to the users, surely. https://twitter.com/...",
    "NPR quitting Twitter was a turning point in the story.  Now the news organization is on Threads.",
    "Threads isn't for news and politics, says Instagram's boss",
    "Make your family time a blast with these activities",
    "@harrymccracken@sfba.social",
    "@drewharwell@mastodon.social",
    "Gizmodo's io9 Published an AI-Generated Star Wars Article That Was Filled With Errors",
    "Gizmodo's writers push back against AI-generated articles",
    "G/O Media Has Begun Using AI to Generate Content",
    "Google ranks AI-generated ‘Star Wars’ article lacking E-E-A-T",
    "Gizmodo's staff isn't happy about G/O Media's AI-generated content",
    "Everything We Announced at TwitchCon Paris",
    "Twitch introducing Stories and Discovery Feed to boost offline community interaction",
    "Twitch Adding New Feature Straight Out of Snapchat's Playbook",
    "TwitchCon 2023: Twitch is the latest platform to get Instagram and TikTok-like features",
    "Twitch is finally making it easier to find new streamers to follow.",
    "Twitch Stories feature takes shot at YouTube shorts and TikTok",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Lightmatter: Next-gen computing built for AI.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Chinese Authorities Conclude Ant Group's Regulatory Restructuring Process with $984M Penatly",
    "Ant Group's $6 billion buyback amid regulatory tension",
    "Ant's surprise share buyback values firm at steep 75% discount to IPO",
    "Chinese securities regulator fines Ant Group almost $1 billion for ‘illegal acts’: AFP",
    "Ant's share buyback values firm at steep 70% discount to IPO",
    "Chinese Regulators Fine Ant Group $985M in Signal That Tech Crackdown May End",
    "China ends probe of Ma-backed Ant with $984 million fine",
    "Ant Group launches $6bn buyback after regulatory crackdown ends",
    "China's financial regulators wrap up makeover of Ant Group and Tencent",
    "Ant Plans to Spend About $78.5 Billion to Repurchase Shares",
    "Google alleges Indian antitrust authority used its position to protect Amazon",
    "Google alleges India's antitrust agency protecting Amazon in Android case - report",
    "Google ‘accuses’ Competition Commission of India of protecting rival Amazon in anti-trust case",
    "Google Challenges India's Antitrust Body Over Alleged Favoritism Towards Amazon",
    "Google, CCI, Rs 2,200 crore and the Amazon ‘twist’",
    "SC To Hear Google, CCI Pleas In Android Case On July 14",
    "Judge pauses NYC $18-per-hour requirement for delivery workers amid lawsuits",
    "DoorDash, Uber and Grubhub sue New York City over minimum wage for delivery workers",
    "Report: Judge Halts NYC Law Opposed by App-Based Food Delivery Firms",
    "A DoorDash worker cursed at her over a $5 tip. Then she learned what they're paid",
    "Uber, DoorDash Sue NYC to Stop Delivery Drivers From Getting a Minimum Wage",
    "Australian Financial Review",
    "@Celeste_pewter@mastodon …",
    "@neurovagrant@masto.deoan.org",
    "Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "Musk sues law firm for $135m bill on Twitter deal",
    "Elon Musk's X Corp files lawsuit against law firm to recoup fees from Twitter buyout",
    "Elon Musk goes after Twitter acquisition lawyers",
    "Twitter Sues Law Firm Over $90 Million Payment in Elon Musk Deal",
    "Yep, that's how you'd react to a $90 million legal bill.",
    "Musk sues law firm Wachtell Lipton over $90mn Twitter legal fee",
    "Elon Musk sues law firm over huge fee Twitter paid hours before he took over",
    "Elon Musk's Twitter sues top law firm Wachtell over $90 million fee for work under prior ownership",
    "Musk Sues Wachtell, Lipton To Recover $90 Million Fee",
    "Twitter Sues Wachtell Over $90 Million Payout for Musk's Buyout Deal",
    "there's poking the bear and then there's whatever the hell this is [embedded post]",
    "@Celeste_pewter@mastodon.social"
]