[
    "Microsoft wins FTC fight to buy Activision Blizzard",
    "Judge rejects FTC's attempt to block Microsoft's $69 billion Activision deal",
    "Microsoft Cleared to Buy Activision in US as UK Pauses Fight",
    "Microsoft wins FTC trial, can proceed with Activision Blizzard merger",
    "Sony Drops in Wake of Ruling Favoring Microsoft-Activision Deal",
    "Microsoft Can Close Its $75 Billion Buy of Activision Blizzard, Judge Rules",
    "Microsoft, Activision defeat FTC's bid to block $69B deal",
    "The FTC's case against Microsoft's Activision acquisition is not going well",
    "What happens to Microsoft and Activision Blizzard post-FTC?",
    "US judge rules Microsoft deal to buy Activision can go forward",
    "Microsoft has won its US court case to acquire Activision Blizzard",
    "U.S. federal Judge Corley finally rules on Microsoft's Xbox-ABK deal: Microsoft WINS",
    "Asia Markets Poised to Rise Ahead of India and U.S. Inflation Data",
    "Judge Rules for Microsoft: Mergers Are Good",
    "Microsoft Wins against FTC: Activision Merger Can Move Forward after Court Ruling",
    "Microsoft wins case against FTC to acquire Activision Blizzard",
    "Federal Judge Rejects FTC Effort To Halt Microsoft-Activision Merger",
    "US Judge rejects FTC's injunction request against Microsoft's Activision Blizzard deal",
    "Judge paves way for Microsoft, Activision deal to close this month",
    "Judge Rejects FTC Move to Halt $69B Microsoft-Activision Deal",
    "Microsoft Has Won Against The FTC In Court Over Its Activision Blizzard Buyout",
    "Judge Blocks FTC From Preventing Microsoft's Activision Bid",
    "Gamers celebrate Microsoft beating FTC in court to buy Activision: 'It's finally over'",
    "Microsoft Prevails Over FTC: US Judge Denies Bid to Block Activision Deal",
    "Game-Changing Decision: Microsoft Clears Path for Activision Blizzard Deal",
    "Judge shoots down FTC attempt to stall Microsoft-Activision merger",
    "Judge sides with Microsoft in FTC injunction, unlocking final Activision battles",
    "Activision Stock Jumps As U.S. Judge Clears Hurdle To Microsoft Buyout",
    "Microsoft-Activision deal can proceed, US court rules",
    "Microsoft-Activision Deal Allowed to Proceed, Rules Judge",
    "Microsoft has won its Activision Blizzard acquisiton case with the FTC",
    "US judge greenlights $69 billion Microsoft-Activision deal, FTC may appeal verdict",
    "US approves Microsoft's Activision Blizzard deal, UK agrees to renegotiate",
    "Microsoft gets US approval to buy Activision Blizzard",
    "Microsoft Gets the Green Light to Purchase Activision Blizzard in Victory Over FTC",
    "S judge rules Microsoft deal to buy Activision can go forward",
    "Microsoft wins latest legal battle against FTC over Activision Blizzard acquisition",
    "Judge won't block Microsoft's $69B takeover of video games giant Activision",
    "Microsoft Wins its US Court Case Over its Activision Blizzard Acquisition",
    "Microsoft Wins US Court Approval to Acquire Activision Blizzard",
    "Microsoft wins FTC case, removing Xbox's biggest Activision Blizzard acquisition hurdle",
    "Judge rules for Microsoft in FTC fight over Activision",
    "Microsoft Wins Court Case Against FTC To Buy Activision Blizzard",
    "Judge Denies FTC's Bid to Block Microsoft-Activision Deal",
    "Microsoft can go forward with Activision Blizzard purchase after court rules against injunction",
    "Microsoft Beats US Regulator FTC in Activision Blizzard Buyout Battle",
    "Microsoft Beats FTC's Request for Preliminary Injunction to Block Activision Blizzard Deal",
    "FirstFT: US judge rejects FTC's attempt to halt Microsoft's Activision deal",
    "FTC v Microsoft: Judge Corley denies preliminary injunction in big win for Xbox",
    "Judge Rejects F.T.C. Delay of $70 Billion Microsoft-Activision Deal",
    "Microsoft can close its Activision merger, federal judge rules",
    "Microsoft Wins Court Battle Against FTC Over Activision Blizzard Acquisition",
    "Microsoft wins US court nod to buy Activision in FTC loss",
    "Our statement on today's decision: https://twitter.com/... [image]",
    "Lina Khan's winless streak continues. https://twitter.com/...",
    "Can Microsoft save COD. That is the question for me. Also selfishly, lol. https://twitter.com/...",
    "Judge on Microsoft x Activision (and Sony). [image]",
    "CNBC: Microsoft and the CMA have agreed on a small divestiture to address the regulator's concerns",
    "Does this mean Diablo is now owned by Microsoft?",
    "FTC has been denied their preliminary injunction.  Judge Corley rules in favor of Microsoft",
    "A major milestone: Update on the Microsoft deal",
    "Microsoft's $69 billion Activision deal gets US judge go-ahead, UK softens opposition",
    "Microsoft's Activision acquisition moves ahead as judge rejects FTC injunction request",
    "Microsoft to modify Activision Blizzard acquisition to address CMA concerns",
    "UK regulator and Microsoft pause litigation in bid to reach agreement on Activision deal",
    "Activision Deal Likely to Pass in UK as the CMA Stays Legal Battle for Further Negotiations",
    "Phil Spencer's internal memo talks about Activision acquisition and the win against FTC",
    "Microsoft wins U.S. court nod to buy Activision in loss for FTC",
    "Activision Blizzard Stock Jumps After FTC Ruling",
    "Microsoft to modify Activision Blizzard deal to address CMA UK's concerns",
    "Microsoft-Activision US$69 billion deal back on track after US court win",
    "Microsoft pauses appeal against UK's CMA to negociate",
    "Microsoft wins FTC court battle over $69 billion Activision Blizzard buyout",
    "Microsoft Holds Off Appeal As CMA Wishes To Negotiate Activision Blizzard Deal",
    "Microsoft has one major hurdle left in its Activision Blizzard deal",
    "Microsoft and CMA pause appeal battle to negotiate on Activision Blizzard deal",
    "UK CMA Agrees to Renegotiate with Microsoft",
    "Microsoft Victorious As Federal Judge Rules Against The FTC In Activision Purchase",
    "Activision Blizzard Stock Surges 11% After Judge Rules on Microsoft Deal",
    "The Hurdles That Remain for $69 Billion Microsoft-Activision Deal",
    "UK Antitrust Agency Pauses Microsoft-Activision Appeal on FTC Court Loss in US",
    "Microsoft wins against FTC, clearing vital hurdle for Activision Blizzard acquisition",
    "Microsoft wins bid against FTC injunction to buy Activision Blizzard",
    "Microsoft And UK CMA Agree To Pause Legal Battle Over Activision Blizzard Deal",
    "Microsoft victorious over FTC lawsuit to block Activision Blizzard buy",
    "Our statement on the mutual request with the CMA for a pause of our appeal in the UK: [image]",
    "“Cloud gaming? Never heard of it. Anyway let's talk” https://twitter.com/...",
    "Microsoft and UK regulators agree to pause their Activision battle to negotiate",
    "Court ruling in Activision, Microsoft may come Wednesday or Thursday - report",
    "FTC would face tough appeal of Microsoft-Activision order -experts",
    "@Techmeme Tax payers love it when you use public funds to pursue a losing strategy.",
    "FTC Leaning Toward Appealing Microsoft-Activision Loss",
    "House Committee on the Judiciary",
    "Oversight of the Federal Trade Commission",
    "Microsoft's Activision Win Shouldn't Stop Antitrust Reform",
    "Microsoft-Activision Ruling Highlights Lina Khan's Struggles to Fight Tech",
    "@mranthropology.bsky.social",
    "Intel Exiting the PC Business as it Stops Investment in the Intel NUC",
    "Intel will stop making its own NUC mini PCs",
    "Intel sunsets Next Unit of Compute (NUC) product line",
    "Intel Exits NUC Business, Will Rely on External Partners",
    "Intel wird keine NUCs mehr anbieten",
    "Intel confirms nuking its NUC computer business",
    "Apple's Mac mini has outlasted Intel's NUC",
    "Intel Will No Longer Make NUC Mini Computers",
    "Intel announces BIG change to mini PCs — say goodbye to its NUC computers",
    "Intel Kills the NUC, Will Stop Selling PCs",
    "Intel pulls plug on mini-PC NUCs",
    "Intel Halts Direct Investment In Popular NUC Business, Exiting Direct Consumer PC Sales",
    "No more NUC: Intel's weirdly named mini PCs seem to be going away",
    "Intel Exits NUC Mini PC Business, Vows To Support Ecosystem",
    "Intel Set to Exit NUC PC Business - Pushes Partners to Develop More SFF PCs",
    "Intel To Stop Producing NUC Mini PCs",
    "Intel to Stop Making its Excellent NUC PCs, Opting to Use Partners Instead",
    "Intel NUC Sees The End of Road, OEM Partners To Continue Offering Mini PC Line",
    "No more NUCs: Intel seemingly confirms that its nifty mini PCs are canceled",
    "“Intel confirms nuking its NUC computer business” Too soon. OK, good one.",
    "[ServeTheHome] Intel Exiting the PC Business as it Stops Investment in the Intel NUC",
    "Intel stops its NUC business",
    "Google-backed Anthropic startup upgrades its Claude AI",
    "Very good profile of the Anthropic team from @kevinroose https://www.nytimes.com/...",
    "cognitive dissonance overload. https://twitter.com/...",
    "Claude 2  —  We are pleased to announce Claude 2, our new model.",
    "Anthropic releases Claude 2, its second-gen AI chatbot",
    "Claude 2.0, Anthropic's Latest ChatGPT Rival, Is Here — And This Time, You Can Try It",
    "Anthropic — the $4.1 billion OpenAI rival — debuts new A.I. chatbot and opens it to public",
    "Anthropic launches Claude 2, can write longer responses and better at coding",
    "Claude 2 Is Out—How Does Anthropic's AI Chatbot Compare to ChatGPT and Google Bard?",
    "Claude 2 is ChatGPT's newest challenger - here's how to try it",
    "Anthropic's Claude 2 Is a Faster, Kinder, More Constricted Version of Its ‘Harmless’ AI",
    "Anthropic launches Claude 2 amid continuing AI hullabaloo",
    "New ChatGPT rival, Claude 2, launches for open beta testing",
    "Anthropic Launches Claude 2 With 100k Context Windows, File Upload Capability",
    "What is Claude 2? How to access this ChatGPT competitor.",
    "Anthropic, OpenAI beef up coding capabilities for their LLMs",
    "Anthropic releases upgrade Claude 2 AI chatbot with improved safety and coding ability",
    "Anthropic's Claude 2 Is The Latest ChatGPT Competitor",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "ChatGPT alternative: OpenAI competitor Anthropic's “Claude 2” chatbot is live",
    "Sapphire Ventures Commits $1B-Plus To AI-Powered Tech Startups",
    "Anthropic unveils Claude 2, an AI model that produces longer, safer responses",
    "Anthropic's ‘friendly’ AI chatbot, Claude, is now available for more people to try",
    "Introducing AnthropicAI's Claude 2",
    "Anthropic Releases a New Version of Its ChatGPT Rival, Claude",
    "@agreenberg@infosec.exchange",
    "Mentor to ‘Silk Road’ Drug Trafficker Gets 20 Years in Prison",
    "Silk Road Bitcoin Black Market Advisor Receives Maximum Sentence of 20 Years",
    "Silk Road's top lieutenant gets 20 years behind bars",
    "Silk Road adviser ‘Variety Jones’ sentenced to 20 years in prison",
    "Top Silk Road Advisor ‘Variety Jones’ Sentenced to 20 Years in Prison",
    "Silk Road's Second-in-Command Gets 20 Years in Prison",
    "I signed up for Threads against my better judgment",
    "Threads vs Twitter: Differences Between Social Media Platforms",
    "Threads and the Social/Communications Map",
    "Cybersecurity professional accused of stealing $9M in crypto",
    "BREAKING: Amazon Senior Security Engineer Indicted in $9M Crypto Heist",
    "Former Amazon Security Engineer Arrested and Charged with Hacking Crypto Exchange",
    "New York Computer Security Engineer Indicted in $9 Million DeFi Fraud",
    "Just In: US DoJ Charges Engineer in First Attack on a Smart Contract",
    "U.S. charges Solana attacker with money laundering in first enforcement action of its kind",
    "‘Can I cross border with crypto?’: Hacker turned to Google after $9M DeFi raid",
    "I guess the code isn't the law after all. https://www.justice.gov/...",
    "Think it's probably closer to Zoom, in that it filled a gap in an emergency.",
    "Such an analogy works until it doesn't.",
    "Could Google have pulled off Threads?",
    "Easy comparison, bad analysis.",
    "@susanrinkunas.bsky.social",
    "@evilrobert.newrosehotel.co",
    "@chrishudsonjr@mastodon.social",
    "After Meta hands over DMs, mom pleads guilty to giving daughter abortion pills",
    "Teen and mom plead guilty to abortion charges based on Facebook data",
    "Nebraska mom pleads guilty to giving daughter pills for an abortion and helping bury the fetus",
    "Mother Pleads Guilty To Giving Daughter Abortion Pills, Burning and Burying Dead Baby",
    "It was disgusting and I get annoyed that so many media outlets leave out the details.",
    "Nebraska Mom Pleads Guilty to Giving Abortion Pills to Her Teen Daughter",
    "A brief history of Elon Musk sabotaging Matt Levine's time off",
    "Global PC market is continuing to collapse for everybody but Apple",
    "Mac shipments grow 10%, as all major PC brands see downturns",
    "Global PC market decline eases as shipments drop 12% in Q2 2023",
    "Apple's Mac market share jumped even though PC sales fell for the sixth consecutive quarter",
    "IDC: PC Sales Fell 13.4 Percent in Q2",
    "Global PC Shipments Continue to Dwindle in Q2 2023, IDC Reports",
    "Mac shipments return to growth but Windows keeps plunging",
    "Mac sales remain strong even as PC market continues to slump",
    "PC market stuck in 18-month rut due to weak demand and shifting budget priorities",
    "Apple's Mac Sales Surge in Q2 2023, PC Shipments Decline: IDC",
    "Global PC market decline slows, says Canalys",
    "Apple Defies the Odds: Mac Sales Rise Amidst PC Industry Decline",
    "Should leaders place bets on new PCs or generative AI?",
    "IDC, Canalys both confirm Mac sales up, PC sales not up",
    "Global PC shipments decline eases in Q2, Apple outperforms on MacBook Air demand - Canalys",
    "Google Slapped With Lawsuit Over Data Used To Train Its AI",
    "Case 3:23-cv-03440  —  Plaintiffs J.L., C.B., K.S., P.M., N.G., R.F., J.D., and G.R. …",
    "Together on AI.  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "Google has been sued over how it trains its AI products by scraping the web.According to CNN:",
    "Google Hit With Lawsuit Alleging It Stole Data From Millions of Users To Train Its AI Tools",
    "Real-Time Avatar Calls for When You're Not Camera-Ready and More",
    "Meta Avatars Can Now Answer Your ‘Video’ Calls",
    "Meta brings cartoon avatars to video calls on Instagram and Messenger",
    "Meta Avatar Calls Set to Launch, Can Be Used in Real-Time When You're Not Camera-Ready",
    "Meta Adds Avatar-Enabled Video Calls, More Avatar Engagement Options",
    "Meta is going to let you make video calls as your avatar",
    "Meta now lets you make video calls using a cartoon avatar",
    "Real-time avatars for calls coming to Meta products",
    "All that money wasted on the Metaverse, at least they got some use out of it? [embedded post]",
    "End of an Era at Google DeepMind Hints at New Future for AI",
    "AI Researcher Who Helped Write Landmark Paper Is Leaving Google",
    "SUSE will fork Red Hat Enterprise Linux",
    "At SUSE We Make Choice Happen",
    "SUSE Announces Free RHEL Fork to Preserve Choice in Enterprise Linux",
    "In a Blow to IBM, SUSE is Forking Red Hat Enterprise Linux",
    "SUSE Announces RHEL-Compatible Distribution, Pledges $10M Investment",
    "SUSE Will Fork Red Hat Enterprise Linux",
    "Introducing Phone (2) ft. Casey Neistat",
    "Nothing's flashy Phone 2 lands in the US for $599",
    "The Nothing Phone (2) is here and it's faster than ever",
    "Nothing Phone 2: Improved Specs and Enhanced Customization — at a Higher Price",
    "Nothing Phone (2) features SD 8+ Gen 1, 6.7-inch OLED display, 50MP dual camera",
    "Nothing Phone 2 Released - a fairly-priced mobile phone with decent specs",
    "Nothing's Phone 2 will light up the US on July 17th for $599",
    "Nothing Phone 2: Price, availability, specifications, and more",
    "Nothing Phone (2) vs Nothing Phone (1): which is best to buy now?",
    "Nothing Phone (2) Hands-On: First Impressions With A Few Key Details",
    "Nothing Phone (2): Everything you need to know",
    "Sleek and Stylish Nothing Phone 2 Has Upgraded 50MP Cameras",
    "The Nothing Phone 2 and Its Flashy Lights Debut at $599",
    "I've used the Nothing Phone 2.  Here's why you'll love it",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "Nothing Phone (2) Hands-On: A True Android Flagship?",
    "The Nothing Phone (2) arrives and seeks harmony with its refined aesthetics and 2.0 OS",
    "Nothing Phone (2) doubles down on the brand's minimalist, low-key aesthetic",
    "Nothing phone (2) hands-on: A welcome second coming",
    "Nothing Phone (2) goes official for $599 in the US - ask us anything",
    "Nothing Phone 2 arrives in the US starting at $599",
    "Hands-On With the New Transparent Nothing Phone",
    "Nothing's Phone (2) is up for preorder, starting at $599",
    "The Nothing Phone 2 has me excited about midrange phones again",
    "Nothing Phone (2) launch event live stream: how to watch",
    "Watch the Nothing Phone (2) keynote: Introducing Phone (2) ft. Casey Neistat @ 16:00 BST",
    "TikTok parent ByteDance to allow US staff to cash out shares amid IPO delays",
    "ByteDance Plans Share Buyback for TikTok Employees Later This Year",
    "Salesforce plans 9% price hike for some of its most popular cloud products",
    "Salesforce Stock Rises After Company Announces Price Hike",
    "Salesforce raises prices for the first time in 7 years. What it means for the stock",
    "Salesforce's stock gets a lift as company announces rare price increases",
    "Microsoft's Win in the Activision Case Could Spur a Merger Revival",
    "Salesforce To Raise Prices An Average Of 9% Next Month",
    "Salesforce raises list prices across clouds by about 9%",
    "New List Pricing for Salesforce Products",
    "Salesforce To Hike Prices In August By Average Of 9 Percent",
    "Salesforce Stock Rises On Price Hikes For Marketing, Cloud Software",
    "Salesforce to raise prices of some cloud products",
    "Salesforce to raise prices of some cloud products from August",
    "Free compensation benchmarking data from 3,000 startups",
    "Collective raises $50M funding to launch AI-powered finance platform for freelancers",
    "Collective Raises $50M to Become First AI-Powered Finance Platform Designed for Solopreneurs",
    "How the ‘Kanoodle Queen’ Found Success on TikTok Shop",
    "Collective Raises $50M in Funding",
    "KPMG to invest billions in AI, cloud services",
    "KPMG to expand ties with Microsoft, will spend $2 billion in AI, cloud services",
    "KPMG to invest $2B in AI and cloud as it expands partnership with Microsoft",
    "KPMG and Microsoft enter landmark agreement to put AI at the forefront of professional services",
    "Microsoft announces five-year AI and cloud agreement with accounting firm KPMG",
    "Microsoft strikes $2 billion AI partnership with KPMG",
    "KPMG to invest $2 billion in AI, cloud services",
    "AI Safety and the Age of Dislightenment",
    "Senators grapple with response to AI after first classified briefing",
    "Meta Proposes New Industry Principles on AI Development",
    "Nick Clegg Is Driving Meta's Case for Open-Sourced AI",
    "Personalized wealth management, built for tech people",
    "Internal applications: App-solutely customized for your organization",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Tue. 07/11 - A Meaningful Anti-Tracking Law",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Reddit triumphs as WallStreetBets founder's lawsuit crumbles",
    "28% GST on online gaming ‘unconstitutional’, will lead to job losses, say industry experts",
    "Online gaming hit by 28% tax; Swiggy is prioritising growth over profitability",
    "India's online gaming industry hit with 28% tax",
    "Online gaming tax raised to 28% on net revenue, industry expresses shock",
    "Discord introduces new opt-in parental controls for teens",
    "Discord bans AI-generated child sex abuse material and teen dating",
    "Discord Unveils New Parental Controls to Keep Tabs on Your Kids",
    "Discord adds Family Center, giving parents overview of teen activity",
    "How to Use Discord's ‘Family Center’ Safety Settings for Your Kids",
    "Broadcom's $61 Billion VMware Deal Set for EU Approval",
    "Broadcom-VMware Deal To Win EU Clearance After Pact: Reports",
    "Microsoft Wins FTC Brawl Over $69B Activision Blizzard Deal as Merger Nears Close",
    "FTC Court Ruling Clears Path for Microsoft to Buy Activision",
    "Teen hacked Uber, Revolut and Grand Theft Auto maker, London court hears",
    "Microsoft, Activision deal could close within days",
    "Lapsus$ member hacked Uber, Revolut and Grand Theft Auto maker",
    "British prosecutors say teen Lapsus$ member was behind hacks on Uber, Rockstar",
    "Clop Crime Group Adds 62 Ernst & Young Clients to Leak Sites",
    "Savvy nabs $30M to secure enterprises' software-as-a-service applications",
    "SaaS Application Security Firm Savvy Exits Stealth Mode With $30 Million in Funding",
    "OpenAI's DALL-E will train on Shutterstock's library for six more years",
    "Shutterstock's generative AI way forward: 6-year training data deal with OpenAI",
    "Shutterstock expands deal with OpenAI to build generative AI tools",
    "Shutterstock Assists OpenAI in Training for AI Models",
    "Shutterstock to Provide OpenAI with Training Data in New Partnership Deal",
    "Stocks Making the Biggest Moves Midday: Shutterstock, Newell Brands, Zillow and More",
    "Here Are the Best NVIDIA GeForce and AMD Radeon GPU Deals for Amazon Prime Day",
    "Interesting that Microsoft isn't mentioned in this article at all [embedded post]",
    "LOL somebody checking for their own definition of disinformation. https://twitter.com/...",
    "Video Game History Foundation",
    "@PlayHistory@oldbytes.space",
    "87% Missing: the Disappearance of Classic Video Games",
    "Vanishing act: 87% of classic video games are no longer available commercially",
    "Survey of the Video Game Reissue Market in the United States",
    "Video Game History Foundation estimates 87 percent of “classic” games now unavailable",
    "ESA expects publishers to fix preservation problem",
    "The Disappearance of Classic Video Games",
    "87% of “classic” games unavailable, says study",
    "Almost all classic US video games ‘critically endangered’",
    "87% of older video games are currently impossible to buy anywhere reveals report",
    "87% Missing: the Disappearance of Classic Video Games |  Video Game History Foundation",
    "87% of classic games are out of print. That's a problem for gaming history.",
    "Amazon claims it isn't a “Very Large Online Platform” to evade EU rules",
    "Obscure internet boutique Amazon sues EU for calling it a Very Large Online Platform",
    "Amazon says it's ‘unfairly singled out’ by new EU digital rules",
    "Amazon Files Legal Challenge to EU Digital Services Act",
    "Amazon launches first Big Tech challenge to EU online content rules",
    "@rileytestut@mastodon.social",
    "Apple launches an online store on China's WeChat app",
    "Apple launches online store on China's giant WeChat messaging app",
    "Apple working on how to revolutionize iPhone and iPad cases",
    "Apple Store launches as mini-app on WeChat platform in China",
    "Apple Expands Retail Reach in China with Official Store Opening on WeChat",
    "Apple Launches Online Store on China's WeChat Platform",
    "Looking forward to Apple paying WeChat 30% of all iPhone purchases 🤪 https://9to5mac.com/...",
    "Apple opens store on China's WeChat platform",
    "Apple Opens Store on China's WeChat Platform",
    "Google's head of AR software quits, citing “unstable commitment and vision”",
    "Google's AR Software Leader Departs Amid Concerns Over Company's Commitment and Vision",
    "A Google exec resigns with a damning note about its XR ambitions",
    "Google's AR efforts face more turmoil as lead exec quits over ‘unstable commitment’",
    "Mark Lucovsky Leaves Google, Calls Company “Unstable”",
    "?? did we know G had an AR arm? was that a thing? https://twitter.com/...",
    "Wow, big loss for G. https://twitter.com/...",
    "What is happening at Google? https://twitter.com/...",
    "HCA Healthcare reports breach of 11 million patients' personal data",
    "HCA confirms breach after hacker steals data of 11 million patients",
    "Privacy update  —  For Immediate Release … HCA Healthcare Reports Data Security Incident",
    "Personal Information of 11 Million Patients Stolen in Data Breach at HCA Healthcare",
    "HCA Healthcare breach compromises 11M patients' personal data",
    "1,000+ Facilities Impacted by HCA Data Breach",
    "HCA Healthcare data breach impacts several Tampa Bay area facilities. Here's what you should know",
    "11 Million Patients Impacted in Healthcare Data Breach",
    "Medical City parent company reveals patient data breach affecting 11 million",
    "Florida patients among 11 million affected by HCA Healthcare data breach",
    "HCA Healthcare Data Leak Appears to Be Theft",
    "@themckenziest.bsky.social",
    "@taylorlorenz@mastodon.social",
    "Taliban Endorses Twitter Over Threads",
    "Zuckerberg Trains With UFC Champion, Muscling Up For Musk: ‘No Fugazi With Mark The Shark’",
    "Mark Zuckerberg looking ripped in photo with UFC champion",
    "Mark Zuckerberg Training With Two UFC Champions",
    "Zuckerberg trains with UFC champions, Adesanya, Alexander",
    "Shredded Mark Zuckerberg Trains With Legendary UFC Fighters Ahead Of Potential Musk Throwdown",
    "Threads hit 100M users faster than any other platform. But will it replace Twitter?",
    "User Traffic Drops on Twitter as Threads Surpasses 100M Users",
    "Threads Update Will Include Chronological Feed of Followers",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "Meta's Twitter rival Threads hits 100 million users in record five days",
    "Twitter traffic really is tanking, Cloudflare reveals, but is anyone that surprised?",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "Twitter traffic tanking. [Image: Cloudflare DNS rankings over time]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "Excruciating flop sweat vibes. https://twitter.com/...",
    "@brettdash_ @charliewrich Censorship pays them well",
    "The Taliban endorsing Twitter is a sign we're on a sinking ship https://twitter.com/...",
    "Jim Cramer has said: “Whatever Twitter can do, Zuck can do better”. [video]",
    "@lindayacc I spent over 25 hours a day on Twitter all weekend to support you and all of us here",
    "Now we know why Twitter recently allowed male enhancement product ads on its platform [image]",
    "A @Techmeme headline for the history books [image]",
    "META'S TWITTER RIVAL THREADS OVERTAKES CHATGPT AS FASTEST-GROWING PLATFORM $META",
    "The censorship on Meta's new app is insane. They even want to control whom you follow. [image]",
    "Elon: Protects free speech Zuck: Protects brand speech https://twitter.com/... [image]",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "@SOClALRATE This platform will protect anons for this reason particularly",
    "Zuck is actually doing it lmaooooo [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "The Taliban Endorses Twitter Over Threads",
    "Taliban says Meta is Intolerant, so it is sticking with Twitter instead of using Threads.",
    "Elon Musk goes low against Zuckerberg as Twitter-Threads spat intensifies"
]