[
    "Twitter Ad Revenue Plummets 59% Amid Hate Speech Concerns",
    "Elon Musk: Twitter snaps up top NBCUniversal executive",
    "Reddit going dark in protest at API pricing; Apple cut Twitter ad spend",
    "Twitter is hiring ad executives to bolster its business",
    "Twitter's ad sales stink of Musk.Elon Musk to the BBC in April:",
    "that's the good shit  —  https://www.nytimes.com/...  [image]",
    "we are in the “find out” stage of fuck around",
    "real “everything must go” vibes around here these days https://twitter.com/...",
    "All the advertisers have tragically contracted the Woke Mind Virus https://twitter.com/...",
    "Why they are desperately dropping just about any remaining ad standards. https://twitter.com/...",
    "Twitter to recoup revenue by being everyone's Everything app. https://www.nytimes.com/...",
    "Seems like a good place to launch a presidential campaign from https://www.nytimes.com/...",
    "Wile. E. Coyote, Super Genius! https://www.nytimes.com/...",
    "International Business Times",
    "Atomic Wallet faces security breach, loses over $35 million in cryptocurrency",
    "Atomic Wallet hack losses reportedly top $35 million",
    "Over $35 Million Lost in Atomic Wallet Attack as Exploit Investigation Continues",
    "On-chain Sleuth Estimates $35 Million Loss From Atomic Wallet Exploit",
    "Atomic Wallet hack leads to at least $35M in stolen crypto assets",
    "Weekend hack sees Atomic Wallet users lose $35 million| what we know so far",
    "Atomic Wallet Gets Compromised with Attackers Draining More than $35M from Users",
    "Atomic Wallet hack losses top $35M, on-chain sleuth reports",
    "Atomic Wallet hack: Stolen crypto may grow to $50M, sleuth warns",
    "Over $35 Million Reportely Stolen From Atomic Wallet Users",
    "Atomic Wallet Reportedly Hacked: $35M in Crypto Assets Vanish",
    "Atomic Wallet Users Hacked for $35M Worth of Bitcoin, Ether, Tether and Other Tokens",
    "Atomic Wallet Hit by Massive Hack: $35 Million Worth of Cryptocurrency Stolen",
    "Atomic Wallet Users Left Devastated as Their Funds Vanished Completely",
    "Atomic Wallet Security Breach Results In $35 Million Crypto Heist",
    "Atomic Wallet security breach causes over $35 million in losses",
    "Atomic Wallet efforts to track and revert stolen funds",
    "Atomic Wallet Alerts Users Of Ongoing Exploit; Victims Claim Complete Loss Of Crypto Portfolios",
    "Report: At least $35M worth of crypto stolen from Atomic wallet users",
    "Atomic Wallet Customers Lose Over $35m in Crypto Attacks",
    "Atomic Wallet claims hack affected less than 1% of monthly active users",
    "Atomic Wallet hacks total over $35 million",
    "Atomic Wallet Hack Causes Over $35M in Losses",
    "Atomic Wallet Investigating Exploit As Wave of Crypto Users Report Stolen Funds",
    "Reddit is going to war with its own users",
    "Revenge of the mutual funds",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "Reddit in Mass Revolt Over Astronomical API Fees That Would Kill Third Party Apps",
    "Reddit Community Considers Blackout In Response to API Policy Changes",
    "Major Reddit Communities Will Go Dark To Protest Threat To Third-Party Apps",
    "How Reddit Became the Enemy - w/ Apollo Developer Christian Selig",
    "A decentralized, ownerless Reddit is needed https://twitter.com/...",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Binance poaches OKX exec Rachel Conlan to lead global marketing",
    "Binance seeking to ‘demonstrate that we are a new organization’ as regulatory headwinds swirl",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Binance Appoints Teng as CEO of the Largest Crypto Exchange",
    "Binance Rumored Successor Richard Teng to Battle Regulatory Problems if CEO Zhao Steps Down",
    "Binance's Regulatory Hurdles Open Path for Potential CZ Successor",
    "Binance's CZ could leave his post amid regulatory hurdle",
    "Binance Regulatory Woes: Richard Teng Eyed As Possible Successor To CZ - Report",
    "Regulatory Storm Clears Path for Binance's Future: Meet CEO Zhao's Heir Apparent",
    "Binance Exec Touted As Possible ‘CZ’ Replacement",
    "Binance gains ISO certifications amid global regulatory hurdles",
    "Binance Looking for the Next Heir to CZ Amid Regulatory Woes | Coingape",
    "Dollar-Based Stablecoins to Strengthen Greenback, CZ Says, Thinks DeSantis ‘Is Great’",
    "Ask not for whom carries the can, the can is carried by thee. https://www.bloomberg.com/...",
    "Binance Executive Controlled Bank Accounts Belonging to U.S. Wing in 2019-20: Reuters",
    "Report: Binance Exec Controlled US Affiliate's Accounts",
    "Binance controlled its US arm's bank accounts for two years: Reuters",
    "Breaking: Binance Exec Tightly Controlled Exchange's US Arm's Finances: Reuters | Coingape",
    "When it rains... https://www.reuters.com/...",
    "Who is Guangying Chen? 🤔 https://www.reuters.com/...",
    "Elon Musk to host presidential candidate Robert F. Kennedy Jr. on Twitter",
    "Ex-Twitter leader Jack Dorsey endorses RFK Jr. for president",
    "Bitcoin Advocate Robert F. Kennedy Jr. Gains Jack Dorsey Support In Bid For Presidency",
    "Instagram reinstates Robert F. Kennedy Jr.'s account",
    "Instagram reinstates Robert F. Kennedy Jr. amid presidential bid launch - WaPo",
    "RFK Jr. Says He Will Join Elon Musk For Twitter Interview After Being Banned From Instagram",
    "Zuck Loves Biden: Facebook Prevents RFK Jr. from Launching Instagram Campaign Account",
    "*years long headache forms*",
    "He can and will https://www.youtube.com/...",
    "Hosting @RobertKennedyJr's upcoming Space https://twitter.com/...",
    "Spotify is laying off 200 employees from its podcast division",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify Lays Off 2% of Staff, Merges Gimlet and Parcast",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify to Lay Off 2% of Workforce, Primarily in Podcast Groups",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify to Cut 200 Jobs as It Reorganizes Podcasting Division",
    "Spotify lays off 2% of its workforce as tech job losses continue",
    "Spotify lays off 200 as it reworks podcast division",
    "Spotify to Slash Podcast Workforce, Combine Parcast and Gimlet Studios in New Round of Cuts",
    "Stock Futures Are Little Changed After the S&P 500's Best Week Since March: Live Updates",
    "Maybe the Joe Rogan podcast wasn't that good for the company https://twitter.com/...",
    "Allow users to skip passwords at sign-in (beta)",
    "You can log into Google Workspace more securely with this major update",
    "Google rolls out passkey support to Workspace and Google Cloud",
    "Google Workspace and Cloud get support for passkeys",
    "Passkey support for Google Workspace accounts rolling out",
    "Google Workspace will now let your business get rid of passwords for good",
    "Companies from Google to Mastercard are close to killing off passwords forever",
    "Google Workspace exploit could let hackers steal your files without leaving any trace",
    "Google extends passkeys to Google Workspace accounts",
    "Personalized wealth management, built for tech people",
    "holymoly this is good! https://twitter.com/...",
    "“What is artificial intelligence? A poor choice of words in 1954.”",
    "Ted Chiang on AI: ‘The Machines We Have Now Are Not Conscious’",
    "Microsoft says Clop ransomware gang is behind MOVEit mass-hacks, as first victims come forward",
    "Microsoft: Lace Tempest Hackers Behind Active Exploitation of MOVEit Transfer App",
    "Ransomware Group Used MOVEit Exploit to Steal Data From Dozens of Organizations",
    "MOVEit Transfer zero-day was exploited by Cl0p gang (CVE-2023-34362)",
    "Free compensation benchmarking data from 3,000 startups",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Carbon Health is already using AI to write patient records",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "5 Ways ChatGPT Could Have A Big Impact On The Healthcare Industry",
    "Google AI Search: A Slow and Cluttered Experience",
    "Google is using machine learning models to speed up Gmail search",
    "Star developers: they're just like me!",
    "Republican bill seeks SEC, CFTC ‘clarity’ on crypto, memecoin frenzy drives Uniswap to record",
    "SHIB, PEPE: Bitcoin Devs Want to Crush $500 Million Meme Coin Market",
    "Oh crap! Another amazing profile of an amazing human in gaming @DrKowert. https://twitter.com/...",
    "Australia Plans Regulatory Framework for AI",
    "Catching Up On Readings: AI Regulation",
    "What Would AI Regulation Look Like?",
    "Excellent @FT piece by @MarietjeSchaake. https://twitter.com/...",
    "It's sad that this isn't blindingly obvious. https://twitter.com/...",
    "On Setting the Record Straight",
    "Stability AI CEO says he's ‘sad’ about report he exaggerated his resume",
    "Stability AI Founder Overstated Startup Strength, Report Says",
    "Stability AI faces another Getty Images legal action in UK",
    "Good time to remember there are two sides to every story This is Emad's https://twitter.com/...",
    "Congrats on the hit-piece @EMostaque ! Reminds me of this quote from @nntaleb [image]",
    "This is the most beautiful pivot to AI I have ever seen https://twitter.com/..."
]