[
    "Apple Watch Ultra refresh coming this year, larger 30-inch plus iMac in early development",
    "Apple's Vision Pro and Beyond: A Comprehensive Look at the Tech Giant's Product Roadmap",
    "Mark Gurman: To finish Vision Pro, Apple is roping in 1000s of employees",
    "Apple Vision Pro still has a way to go",
    "Secondary overhead strap for $3,499 Apple Vision Pro headset could be sold separately",
    "Apple's Upcoming Products: From iPhone 15 to New Macs",
    "Apple Vision Pro May Have A Surprising Omission, New Leak Says",
    "Apple's fall roadmap reportedly revealed, including a 30-inch iMac and a M3 MacBook",
    "Second-gen Apple Watch Ultra to launch this fall",
    "Gurman: Apple working on a new iMac with a display larger than 30 inches",
    "Apple's Vision Pro headset may not come with a top strap in the box",
    "Apple “insider” reveals list of upcoming devices including the second-gen Watch Ultra",
    "Rumor | M3 MacBook Pros of all sizes appear on new 2024 Apple product roadmap",
    "Apple Has Finally Unveiled the Vision Pro.  Here's What It's Launching Next",
    "How the rise of AI chatbots and new TV stations could hugely affect next election",
    "@amandamarcotte.bsky.social",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "We've reached peak tech bro, with billionaires suggesting cage fights and bench-press contests",
    "Khai Wu, Mark Zuckerberg's MMA Trainer, Talks Potential Cage Fight With Elon Musk",
    "UFC star offers to train Elon Musk ahead of the fight against Mark Zuckerberg",
    "Mark Zuckerberg vs Lex Fridman in Jiu Jitsu",
    "Musk Says Cage Match With Zuckerberg ‘Might Actually Happen’",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "@ianbetteridge@writing.exchange",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "Amazon fuels the future of AI with $100M support for generative startups",
    "American TikTok user data stored in China, video app admits",
    "The FTC-Sony Case Against The Microsoft Activision Deal Is Very Bad",
    "Activision acquisition not expected to grow Xbox's console business",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Xbox Says That The Console War Is Just A Social Construct",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "FTC vs. Xbox: Sony ‘uses revenue’ from Microsoft's games to block games from coming to Xbox",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Has Xbox lost the console wars?",
    "Personalized wealth management, built for tech people",
    "Some LastPass users are locked out of their accounts after trying to reset their authenticator app",
    "@Techmeme This company is a dumpster fire 🔥",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "@lauren@mastodon.laurenweinstein.org",
    "LastPass users locked out due to MFA resets",
    "LastPass users furious after being locked out due to MFA resets",
    "@tananarivedue.bsky.social",
    "Reddit plans accessibility changes to iOS app as community fury continues",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Apollo Global leads debt investment in chipmaker Wolfspeed, media report",
    "Free compensation benchmarking data from 3,000 startups",
    "Effective scheduling is key to workforce optimization",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "The iPad was meant to revolutionize accessibility",
    "New Technologies and Jobs in Europe",
    "Who could have known?! https://twitter.com/...",
    "Draft EU plans to allow spying on journalists are dangerous, warn critics |  Surveillance",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "This is a good read: https://blog.bloonface.com/...",
    "@summeremacs@fashionsocial.host",
    "It didn't fail, it was impossible, the wrong idea. more later... https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "IBM nears US$5 billion deal for Apptio",
    "IBM reportedly close to acquiring software company Apptio for $5B",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio: Report",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "The Flex Report (June 2023)",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "Flex Report: Tech Industry Deep Dive",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "Google Reportedly Testing Online Games for YouTube",
    "Google Is Reportedly Testing Playable Games Within YouTube",
    "Google's next gaming play might be mini ‘Playables’ in YouTube",
    "YouTube is planning to expand into online gaming with ‘Playables’: Report",
    "YouTube Playables: Online Games Are Coming to YouTube",
    "Online games will appear on YouTube: Google is testing it right now",
    "Son Of Stadia: Google May Resurrect Parts Of Tech For Instant YouTube Games",
    "YouTube could host mobile and desktop video games",
    "Google is reportedly testing a product to play games via YouTube",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering"
]