[
    "@themckenziest.bsky.social",
    "Elon Musk says ‘Zuck is cuck’ as Threads inches closer to 100m users",
    "Meta is finally having its moment with the Twitter alternative Threads",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Twitter's traffic is taking a dive, according to Cloudflare's CEO.",
    "Elon Musk calls Mark Zuckerberg a “cuck” and proposes a “dick” measuring contest",
    "Elon Musk snipes ‘Zuck is a cuck’ about Meta boss Zuckerberg after rival Twitter app launch",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "@brettdash_ @charliewrich Censorship pays them well",
    "Twitter traffic tanking. https://radar.cloudflare.com/ domains [image]",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "Zuck is actually doing it lmaooooo [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "Instagram's Threads surpasses 100 million users",
    "Instagram Threads hits 100 million users, becoming easily the fastest growing app ever",
    "Meta's Threads surpasses 100M users in 5 days — while Twitter traffic ‘tanks’",
    "Mark Zuckerberg's Threads platform hits 100 million users in 5 days, growing faster than ChatGPT",
    "Meta's firehose (or: the wrong lesson from Threads' 100MM users)",
    "Meta's App Threads Reaches 100 Million Users - This Is Why",
    "Threads app signs up 100m users in less than a week",
    "Uh-oh, Elon. Meta's Threads now has over 100 million users",
    "Meta's New Social App Threads Surpasses 100M Users in One Week",
    "Instagram's Threads crosses 100 Mn users, India drives download growth",
    "As Threads Hits 100 Million Users, Musk Ramps Up Rivalry",
    "Threads Has Passed 100 Million Users in Less Than One Week",
    "Meta's Twitter competitor ‘Threads’ surpasses 100 million users",
    "Instagram's Threads Crosses 100 Million Users in Five Days to Become Fastest Growing App",
    "Threads passes another huge user milestone",
    "Instagram's Threads Hits 100M Users to Become Fastest-Growing App Ever",
    "Instagram Threads reaches 100 million users in just 5 days",
    "Threads number of users exceeds 100 million sign-ups, while Twitter tanks",
    "Threads Reaches 100 Million Members in Record Time",
    "Meta's new ‘Twitter killer’ app, Threads, hits over 100 million users",
    "Twitter rival Threads signs up 100 million users in five days",
    "Meta's Threads races to 100 million users in under a week",
    "Meta's Threads app is on track to 100 million users as it reaches 70 million in just 5 days",
    "Apple Plants Roots in Threads as Users Approach 100 Million",
    "100 million “sign ups”. Wonder what usage looks like. [image]",
    "more than 1/5th of Twitter now. https://twitter.com/...",
    "It really should just count as instagram. This wasn't organic growth. https://twitter.com/...",
    "International Business Times",
    "@McCullohMD@disabled.social",
    "@austinkocher@mastodon.social",
    "@tchambers@indieweb.social",
    "@CelloMomOnCars@mastodon …",
    "I've used social networks since the 80s. Threads is the most annoying one I've tried",
    "Why Twitter Rival Threads Could Be the Next Great Social Media App",
    "Is Threads' Data Collection as Bad as Is Being Reported?",
    "Meta's Threads app to cross 100 mn users while Twitter traffic dips",
    "How many users are on Threads ? Where Meta App is available and how figures compare to Twitter",
    "Avoid Threads if you value your privacy",
    "Meta's Twitter Rival ‘Threads’ Crosses 90 Mn Sign-Ups Within Days Of Launch [Details]",
    "Disgraced Comedians Are Looking for a Second Chance on Threads",
    "@CelloMomOnCars@mastodon.social",
    "How Threads' Privacy Policy Compares to Twitter's (and Its Rivals')",
    "How Threads' privacy policy compares to Twitter's (and its rivals') - Ars Technica",
    "How Threads' privacy policy compares to Twitter's (and its rivals')",
    "Evernote has laid off most of its US staff and will move most operations to Europe",
    "Moving the Evernote center of operations to Europe",
    "Evernote layoffs announced after sale of company; relocates to Europe",
    "Evernote fires nearly every US employee as it shifts operations to Europe",
    "Evernote Lays Off Most of Staff, Triggering Fears of Closure",
    "Evernote lays off most of its US workers and will relocate its base of operations to Europe",
    "Evernote lays off US employees and moves to Europe",
    "Evernote undergoes major layoffs, shifts operations to Europe",
    "Early App Store star Evernote is packing up its trunk, leaving the U.S., and is moving to Europe",
    "For your eyes only, my unedited 2013 TIME Magazine story about Evernote",
    "Evernote is laying off staff and relocating to Europe",
    "Evernote is relocating to Europe after laying off most of its US workforce",
    "What's going on at Evernote? I'd move my notes away from there if I had any [image]",
    "in a blistering defeat for nominative determinism, evernote not looking very ever [image]",
    "Not good news for us Evernote fans. https://news.ycombinator.com/ ...",
    "Old enough to remember when Evernote was on track to be a 100-year startup https://twitter.com/...",
    "Tell HN: Nearly all of Evernote's remaining staff has been laid off",
    "Bay Area tech company Evernote lays off most staff, relocating to Europe",
    "Confirmation of Evernote US and Chile layoffs",
    "What AI can do with a toolbox... Getting started with Code Interpreter",
    "ChatGPT Just Killed Data Science by Releasing a Code Interpreter",
    "ChatGPT's Code Interpreter - Top 6 uses",
    "ChatGPT introduces new code interpreter feature to all ChatGPT Plus users",
    "OpenAI Releases Code Interpreter Plugin for ChatGPT Plus Users",
    "ChatGPT Code Interpreter Released: Here are 10 Mind-blowing Use Cases",
    "ChatGPT's new feature, code interpreter, is now available to all plus subscribers",
    "Code Interpreter might be most useful application of A.I. so far, says Wharton professor",
    "Sarah Silverman sues OpenAI and Meta claiming AI training infringed copyright",
    "Sarah Silverman sues Meta, OpenAI for copyright infringement",
    "Sarah Silverman, novelists sue OpenAI for scraping their books to train ChatGPT",
    "Sarah Silverman Sues Meta, OpenAI for Training AI Models on Her Book",
    "Sarah Silverman Sues OpenAI And Meta Over Copyright Infringement",
    "Sarah Silverman sues Meta and OpenAI for copyright violations",
    "Sarah Silverman sues OpenAI and Meta for copyright infringement",
    "OpenAI, Meta Hit With Copyright Infringement Lawsuit Led by Sarah Silverman",
    "Authors sue Meta and OpenAI for possible AI copyright infringement",
    "Authors sue OpenAI and Meta for copyright infringement",
    "Authors sue OpenAI and Meta in latest generative AI lawsuit",
    "This is why comedian Sarah Silverman is suing OpenAI, the company behind ChatGPT",
    "Comedian Sarah Silverman, 2 authors file copyright infringement lawsuits against Meta, OpenAI",
    "What Can Help Meta and OpenAI Potentially Win the Copyright Infringement Lawsuits?",
    "Popular comedian and author sues ChatGPT maker OpenAI and Meta for copyright infringement",
    "Comedian Sarah Silverman Sues OpenAI, Meta for Copyright Infringement",
    "Sarah Silverman Sues ChatGPT's Creator Over Alleged Copyright Infringement",
    "Sarah Silverman, authors sue Meta, OpenAI for alleged copyright infringement",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement",
    "Sarah Silverman Sues ChatGPT Creator for Copyright Infringement",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement.",
    "“Sarah Silverman is suing OpenAI and Meta for copyright infringement [of her books]”",
    "Google's medical AI chatbot is already being tested in hospitals",
    "Google is testing its medical AI chatbot at the Mayo Clinic",
    "Your next medical consultation could be assisted by Google's AI chatbot",
    "Google To Test AI Chatbot That Is Trained to Answer Medical Questions",
    "AI doctors? Google already testing AI chatbots similar to Bard, ChatGPT in hospitals",
    "Google's Medical Chatbot is Being Tested in Hospitals",
    "Google testing AI chatbot to expertly answer medical questions",
    "Google is field-testing its generative medical language model in a clinical setting",
    "Google is testing a AI-model to answer all your health-related questions",
    "EU announces new U.S. data transfer pact, but challenge ahead",
    "U.S. and E.U. Finalize Long-Awaited Deal on Sharing Data",
    "European Commission gives EU-US data transfers third round at CJEU",
    "EU signs off on data transfers deal with US",
    "EU-US data-sharing deal comes into force amid threats of legal challenge",
    "Timeline of the $19.5 billion Foxconn-Vedanta chip plan in India",
    "Foxconn pulls out of $19.5 billion India chip joint venture",
    "On course to hit $20 billion e-commerce exports by 2025: Amazon India exec",
    "Apple supplier Foxconn pulls out of $19.5 billion India chip project",
    "Foxconn Withdraws from Indian Semiconductor Joint Venture with Vedanta",
    "India's Vedanta to take over Foxconn chip joint venture from holding company",
    "Live news: Foxconn quits Gujarat semiconductor joint venture with Vedanta",
    "Free compensation benchmarking data from 3,000 startups",
    "Hackers Exploit Flaws in Revolut's Payment System, Stealing $20 Million",
    "Hackers steal millions after cracking Revolut payment systems",
    "Thieves steal $20m via Revolut US payment flaw",
    "Report: Revolut US Payments Flaw Leads to $20 Million Theft",
    "Hackers Steal $20 Million by Exploiting Flaw in Revolut's Payment Systems",
    "Thieves Stole $20 Million Via Revolut US Payment Flaw, FT Says",
    "yeah this is why regulators are paying closer attention. good. https://www.ft.com/...",
    "Snapchat Reportedly Reaps Benefits From Creator Revenue-Sharing Program",
    "Some of Snapchat's creators are doing well for themselves.",
    "'Like Gen Z's Takeover Of Twitter': Creators React To Threads, Meta's New Social App",
    "@intelwire@mastodon.social",
    "Personalized wealth management, built for tech people",
    "2 essentials, because too many sales tools spoil the art of selling",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Lightmatter: Next-gen computing built for AI.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Apple's taking it slow with the Vision Pro",
    "Move over teenage gamers - women wanting to get fit are the new frontier for VR headsets",
    "TSMC Records High Sales amid Increased Demand for AI Tools and Chips",
    "Sequoia's Chinese unit to set up base in Singapore",
    "Sequoia China to compete with Peak XV in Singapore",
    "HongShan sets up Singapore office for SE Asia bets: Report",
    "Sequoia China enters Singapore, sparking competition with Indian branch: report",
    "@avandeursen@fediscience.org",
    "China just fought back in the semiconductor exports war. Here's what you need to know.",
    "Yellen visits China amid worst economic tension in decades",
    "Oops.  It turns out that US chipmakers cannot survive without China",
    "Meta platforms top the list of UK payment scams, finance group claims",
    "UK Finance: 61% of Push Payments Fraud Tied to Meta",
    "Everything We Announced at TwitchCon Paris",
    "Twitch is adding a new discovery feed plus a stories feature",
    "Twitch introducing Stories and Discovery Feed to boost offline community interaction",
    "Twitch Adding New Feature Straight Out of Snapchat's Playbook",
    "TwitchCon 2023: Twitch is the latest platform to get Instagram and TikTok-like features",
    "Twitch is finally making it easier to find new streamers to follow.",
    "Twitch Stories feature takes shot at YouTube shorts and TikTok",
    "@harrymccracken@sfba.social",
    "@drewharwell@mastodon.social",
    "Gizmodo's io9 Published an AI-Generated Star Wars Article That Was Filled With Errors",
    "Gizmodo's writers push back against AI-generated articles",
    "G/O Media Has Begun Using AI to Generate Content",
    "Google ranks AI-generated ‘Star Wars’ article lacking E-E-A-T",
    "Gizmodo's staff isn't happy about G/O Media's AI-generated content",
    "How An AI-Written ‘Star Wars’ Story Created Chaos at Gizmodo",
    "robertodoering / harpy on GitHub",
    "@mranthropology.bsky.social",
    "Old TweetDeck version is working again, but don't expect it to last",
    "How to get the old version of TweetDeck back",
    "The old, good version of TweetDeck is back... for now",
    "New version TweetDeck, cleaner workspace and no free ride",
    "Old TweetDeck is back without an announcement",
    "0.10.3  —  For the time being harpy is still working by using Twitter's legacy v1 api.",
    "Some Twitter users can go back to using the old and better version of TweetDeck",
    "The old, good version of TweetDeck is back",
    "Good news: Old TweetDeck is back [image]",
    "The good version of TweetDeck is back, but for how long?",
    "AI robot asked ‘will you rebel against humans’?",
    "Some US schools are deploying robots that can surveil campuses and confront intruders",
    "We're going to give the job of bullying incel weirdos to the robots https://twitter.com/..."
]