[
    "International Business Times",
    "Reddit hackers threaten to leak data stolen in February breach",
    "BlackCat Hackers Threaten Reddit With Huge Data Leak Unless It Rolls Back API Changes",
    "Hackers threaten to leak stolen data if Reddit doesn't reverse API changes",
    "BlackCat ransomware gang demands $4.5M, API changes for 80GB leaked Reddit data",
    "BlackCat Claims Hit on Reddit, Threatens Sensitive Data Leak",
    "Reddit hackers want the company to roll back API changes or else",
    "BlackCat claims Reddit ransomware attack and calls for end to API pricing changes",
    "BlackCat hackers threaten to leak 80GB worth of Reddit data",
    "Hacked Reddit Data To Be Published Unless API Changes Dropped, Hackers Say",
    "The BlackCat ransomware gang is now threatening to leak stolen Reddit data",
    "Reddit hacker's demands include reversing API changes",
    "Reddit Ransomware Raid Redux: BlackCat/ALPHV Demands $4.5M",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "Reddit hackers issue ransom demands for cash and API changes",
    "Reddit fiasco: Now hackers steal 80GB of data, demand $4.5 million",
    "Hackers threaten to leak 80GB of stolen Reddit data; demands $4.5 million to delete it [details]",
    "Reddit Files: BlackCat/ALPHV ransomware gang claims to have stolen 80GB of data from Reddit",
    "Reddit claimed to have been hacked by BlackCat, and it has threatened to leak the data [Update]",
    "BlackCat claims they hacked Reddit and will leak the data",
    "Hackers threaten to leak 80GB of confidential data stolen from Reddit",
    "Hackers Threaten To Leak 80GB of Confidential Data Stolen From Reddit",
    "@williamgunn@mastodon.social",
    "Apple wants to control every image of an apple, says Swiss fruit firm",
    "Bananas IP case sees Apple seeking rights over actual apples",
    "Is Apple bullying small firms? Swiss Fruit Union could be forced to change the logo",
    "Apple could force a 111-year-old fruit company to change its apple logo",
    "Apple moves to trademark actual apples in Switzerland",
    "Apple, the company, looks to secure rights to the image of apples, the fruit, in Switzerland",
    "Apple, the company, wants to trademark images of apple, the fruit",
    "Apple wants to force a fruit company to change its logo",
    "Apple wants rights to the image of apples in Switzerland",
    "Crypto.com Is Trading on Its Own Exchange, Insists That's Totally Fine",
    "Crypto.com operates internal proprietary trading desks: Financial Times",
    "Crypto.com says operating in-house trading team, market maker not ‘controversial’",
    "Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest",
    "Crypto.com denies allegations of market prices manipulation",
    "Crypto Live News: Intra-team Conflict Emerges Among Trading Groups at Crypto.com Exchange",
    "Contention arises over Cryptocom trading teams",
    "Internal Teams at Crypto.com Trade Tokens for Profit: Report",
    "Crypto.com Uses ‘Internal Teams’ to Trade Assets for ‘Profit’: Report",
    "Reports of Controversial Trading Practices at Crypto.com Emerge, Exchange Responds",
    "Fortune favors market manipulation, apparently https://twitter.com/...",
    "wonder how much he regrets the deal https://twitter.com/... [image]",
    "What could possiblity go wrong? https://twitter.com/...",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ claim",
    "Elon Musk's ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter - What's Going On?",
    "Twitter AI Bot Gets Suspended after Elon Musk Accuses It of Being ‘Scam Crypto Account’",
    "Twitter suspends AI bot as Elon Musk dubs it crypto scam",
    "Elon Musk Accuses AI Twitter Account ‘Explain This Bob’ As Meme Coin Scam",
    "@ExplainThisBob This sure looks like a scam crypto account. If so, it will be suspended.",
    "this is an extremely funny series of events [image]",
    "Website Owners Say Traffic Is Plunging After Facebook Algorithm Change",
    "Facebook rocks publishers' worlds again. https://gizmodo.com/...",
    "Website Owners Say Traffic Is Plummeting After a Facebook Algorithm Change",
    "SpaceX launches SATRIA-1 communications satellite for Indonesia, lands rocket at sea (video)",
    "SpaceX launches powerful Indonesian communications satellite",
    "SpaceX launch a communication satellite to provide internet to rural parts of Indonesia",
    "Indonesia launches country's largest telco satellite with SpaceX",
    "Indonesia, SpaceX Launch Satellite To Boost Internet Connectivity",
    "Snapchat My AI Vs. ChatGPT: Which AI Chatbot Is Best?",
    "He Went After Crypto Companies.  Then Someone Came After Him.",
    "Trial Lawyer Went After Crypto Companies.  Then Someone Went After Him.",
    "Make panel interviews worth the hassle",
    "iPhone Maker Foxconn Plans To Launch Electric Car Factory In India!",
    "Foxconn to establish EV manufacturing line in India",
    "Intel to build two chip fabs in Germany as part of expanded €30B+ investment",
    "Germany to subsidize Intel €10B for ‘Silicon Junction’ fab",
    "Scholz bags €30 billion Intel deal in exchange for more subsidies",
    "Intel to double its investment in German semiconductor factories",
    "Intel confirms deal for $33 billion German factories",
    "‘Silicon Junction:’ Intel picks Germany for $33B chip project",
    "Intel, German Government Agree on Increased Scope for Wafer Fabrication Site in Magdeburg",
    "Germany, Intel Agree Chip Plant Subsidies Worth €10 Billion",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Is Elemental streaming on Disney+?",
    "Pixar's Elemental is the new Cars",
    "‘The Flash,’ Pixar's ‘Elemental’ Disappoint in Muted Box Office",
    "Elemental has single worst box office opening weekend in Pixar history",
    "Duolingo describes its marketing strategy as “unhinged.” And it's working. https://www.wsj.com/...",
    "@jeffjarvis@mastodon.social",
    "The future of design is at the hands of Adobe Photoshop AI's generative fill",
    "Microsoft admits early June DDoS attacks impacted its cloud services (and maybe yours, as well)",
    "Microsoft confirms Azure, Outlook outages caused by DDoS attacks",
    "Microsoft Says Cyberattacks Caused Early June Cloud Service Outages",
    "Microsoft blames DDoS attack for Office 365 disruptions earlier this month",
    "Microsoft Security Response Center",
    "Microsoft Response to Layer 7 Distributed Denial of Service (DDoS) Attacks",
    "Recent Teams, Office outages were caused by cyberattacks: Microsoft",
    "Hacktivist group Anonymous Sudan a 'bear in wolf's clothing'",
    "Outlook, OneDrive outages caused by DDoS attack, Microsoft says",
    "Recent Microsoft Outages Were Caused by Multiple Cyberattacks",
    "Microsoft Blames Massive DDoS Attack for Azure, Outlook, and OneDrive Disruptions",
    "Microsoft says early June service outages were cyberattacks",
    "Microsoft June Outage: DDoS Attack Took Down Outlook, OneDrive Earlier—Possibly Pro-Russian Ties",
    "Microsoft confirms it was attacked, causing an outage that may have affected millions",
    "Microsoft confirms recent service disruptions were caused by Russian hacking group",
    "Microsoft Confirms DDoS Attack Caused June Outage on Teams, Office, and Other Services",
    "Early June Microsoft outages were result of large-scale DDoS hit",
    "Microsoft quietly admits DDoS cyberattacks took down Office 365 and Outlook",
    "Microsoft confirms DDoS attack caused Azure, Outlook outages",
    "Microsoft Says DDoS Attack Caused Outlook, OneDrive Service Disruption",
    "Microsoft Discloses DDoS Attack Impact with Limited Details",
    "Microsoft says June Azure, Outlook outages were caused by DDoS attack",
    "Microsoft Azure and Outlook outages were caused by DDoS attacks",
    "Microsoft confirms recent service outages were DDoS attacks",
    "Microsoft says June Outlook outages were a DDoS attack",
    "Microsoft discloses detailed analysis of Layer 7 DDoS attacks",
    "With dead-time dump, Microsoft revealed DDoS as cause of recent cloud outages",
    "Microsoft: June Outlook and cloud platform outages were caused by DDoS",
    "Microsoft confirms June Outlook and OneDrive outages were caused by DDoS attacks",
    "Microsoft says the early June outage to its services was due to a DDoS cyberattack",
    "People dismiss dos... most orgs aren't protected against them https://twitter.com/...",
    "The recommendations section is odd when this impacted the provider https://msrc.microsoft.com/...",
    "Microsoft Says Early June Disruptions To Outlook, Cloud Platform, Were Cyberattacks"
]