[
    "U.S. District Court, District of Columbia",
    "Amazon's Ring used to spy on customers, FTC says in privacy settlement",
    "Ring's Response to Our Recent Settlement With the FTC",
    "Amazon will pay more than $30M to settle FTC complaints over Alexa and Ring privacy issues",
    "FTC: Security failings at Amazon's Ring let hackers, employees access customer videos",
    "Federal Trade Commission v. Ring LLC",
    "FTC Orders Ring to Pay $5.8 Million in Refunds For Surveilling Customers, Failing to Stop Hackers",
    "Amazon's Ring and FTC Settle Charges of Privacy Violations",
    "Amazon's Ring agrees to pay $5.8 million to settle FTC spying suit",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Ring Settles FTC Allegations of Poor Cybersecurity, Privacy",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "FTC's Ring Settlement Shows Why Companies Don't Respect User Privacy",
    "Amazon gets slap on the wrist over privacy violations with Ring cameras",
    "U.S. District Court, Western District of Washington",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "FTC fines Amazon $25M for violating children's privacy with Alexa",
    "Amazon settles with FTC for $25M after ‘flouting’ kids' privacy and deletion requests",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon to pay $30m over Alexa and Ring privacy violations",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Amazon Settles Complaints Over Ring Surveillance, Use of Children's Voice Recordings",
    "Federal regulators fine Amazon $25 million over child privacy issues",
    "FTC charges Amazon with privacy violations over Alexa and Ring cameras",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "Amazon to pay $30 million in Ring doorbell camera and Alexa settlements",
    "Amazon.com to pay $25 million to settle Alexa privacy lawsuit with FTC",
    "Supply Chain Risk from Gigabyte App Center Backdoor",
    "Gigabyte Motherboards Come With A Firmware Backdoor",
    "Gigabyte firmware component can be abused as a backdoor",
    "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
    "Gigabyte Sold Millions of Motherboards with Firmware Backdoor",
    "Gigabyte brought new top-tier motherboards and more to Computex 2023",
    "Gigabyte shipped hundreds of models of motherboards with a hidden firmware backdoor",
    "Organizations Warned of Backdoor Feature in Hundreds of Gigabyte Motherboards",
    "Millions of PCs could be targeted by hackers in firmware blunder",
    "Tons of Gigabyte motherboards come with a hidden firmware backdoor",
    "Definitely be aware if your mobo is on the list. https://www.wired.com/...",
    "Scream in supply chain security... https://twitter.com/...",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Report shows the amazing strength of the global App Store ecosystem last year",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "Apple App Store Commerce Climbed 29% Last Year to $1.1 Trillion",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "Reddit's API pricing results in shocking $20 million-a-year bill for Apollo",
    "📣 Had a call with Reddit to discuss pricing. …",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Proposed changes to Reddit API could mean the end of third-party apps like Apollo",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Reddit app developer says the site's new API rules will cost him $20 million a year",
    "Popular Reddit app Apollo may go out of business over Reddit's new, unaffordable API pricing",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Reddit might destroy third-party Reddit apps (Update: Reddit stands firm)",
    "Reddit Joins Twitter In Squeezing Devs With Unreasonable Fees",
    "Reddit wants to make a ‘million dollars’ from API following Twitter",
    "The best Reddit client app is in danger due to price demands",
    "Apollo for Reddit might shut down due to Reddit's new API pricing",
    "Reddit has it in for third-party clients ↦",
    "API Extortion Era https://twitter.com/...",
    "bro is there even gonna be any of the Old Internet left by the end of 2023 https://twitter.com/...",
    "Bobby Kotick “broke his silence”—but his claims don't add up",
    "Activision Blizzard seriously considered buying Time Warner",
    "Activision Blizzard CEO claims widespread toxic workplace allegations are ‘mischaracterizations’",
    "Activision Boss Hyped About AI, Suggests It Could Be Used In A New Guitar Hero [Update]",
    "Activision CEO responds to harassment allegations, comments on labor unions",
    "Bobby Kotick blames Activision toxicity on ‘outside forces’ - but he's pro-union",
    "Kotick blames scandals on “a very aggressive labor movement”",
    "Bobby Kotick Denies All Allegations Of Activision's “Systemic Issue With Harassment”",
    "Activision never had “systemic issue with harassment”, says CEO Bobby Kotick",
    "Activision Blizzard wanted to acquire Time Warner, says Bobby Kotick",
    "https://twitter.com/... [image]",
    "Two new Macs with M2 Max & M2 Ultra being tested ahead of WWDC",
    "New Desktop Macs With M2 Ultra and M2 Max Chips Could See WWDC Debut",
    "Apple preps first Mac with M2 Ultra chip and M2 Max desktop ahead of WWDC",
    "Apple might announce ‘several’ Macs at WWDC",
    "M2 Mac Studio guide: Is there a future for Apple's mini powerhouse?",
    "Crypto Bridging Protocol Multichain ‘Unable to Contact’ CEO Zhaojun",
    "Multichain Shuts Cross-Chain Bridge Protocol After CEO Goes Missing: What Next?",
    "Multichain team cannot locate CEO, halts service for affected chains",
    "Multichain (MULTI) team locked out as CEO goes missing",
    "Multichain unable to contact CEO, has no access to project servers",
    "Breaking: Multichain Suspends Cross-Chain Services, Fails To Contact CEO",
    "interesting, ceo is gone $multi https://www.theblock.co/... [image]",
    "I don't know a single chain mentioned in this tweet https://twitter.com/...",
    "Multichain team says it can't contact CEO amid protocol problems https://www.theblock.co/...",
    "RARBG: Over 267,000 Movie & TV Show Magnet Links Appear Online",
    "Rarbg: Popular movie and TV torrent site shuts down",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Twitter Community Notes for images is currently in the testing stage",
    "Twitter Extends Community Notes to Images After Pentagon Explosion Tweet",
    "Twitter will now put Community Notes ‘fact checks’ on images",
    "Twitter launches Community Notes to tackle the spread of misleading media",
    "Twitter Adds Crowdsourced Fact Checks To Images",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter launches Community Notes for images",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter is testing Community Notes for images",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Twitter Expands Crowdsourced Fact-Checking Following Phony Viral Photo",
    "Lightmatter's photonic AI hardware is ready to shine with $154M in new funding",
    "Lightmatter triples valuation to solve generative AI's energy crunch",
    "Lightmatter reels in $154M for its optical interconnect and chips",
    "Lightmatter Raises $154M in Series C Funding",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "Italy to launch €150M fund for AI startups",
    "Google's Communications Chief to Depart",
    "Silicon Valley Business Journal",
    "Google head of communications and advisor to CEO Sundar Pichai to exit",
    "Says a lot about where Google is right now. https://twitter.com/...",
    "How Activists Proved to be Salesforce's ‘Superpower’",
    "Magic announces $52M Strategic Funding Round led by PayPal Ventures",
    "PayPal Ventures Leads $52M Round for Crypto Firm Magic",
    "Payments Giant PayPal Invests in New Crypto Wallet Software in Push for Web3 Adoption",
    "Magic raises $52m despite crypto bear market",
    "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "Magic Raises $52M in Strategic Funding",
    "Web3 Infrastructure Company Magic Raises $52M in a Round Led By PayPal Ventures",
    "Crypto wallet Magic raises $52M to expand ‘wallet-as-a-service’ solution",
    "Web3 Firm Magic Summons $52 Million With PayPal Ventures' Help",
    "PayPal Ventures invests in web3 onboarding startup Magic",
    "Salesforce CEO Benioff Predicts AI Spending Boom",
    "Salesforce Delivers On Margin Improvement But Sales Outlook Only Edges By Views",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Salesforce Q1 better than expected, margins improve",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Proptech Firm Measurabl Closes $93 Million Series D Raise",
    "Measurabl Raises $93M in Series D Funding",
    "Measurabl raises $93M Series D for real estate ESG",
    "Measurabl Snags $93M For Carbon Footprint Management",
    "Facebook Accuses FTC of Power Grab Over Proposed Changes to $5 Billion Privacy Settlement",
    "Meta Platforms asks federal court to halt further FTC restrictions: WSJ",
    "Meta Platforms Asks Federal Court to Block FTC in Privacy Fight",
    "CrowdStrike Earnings Top Estimates, But Recurring Revenue Metric Disappoints",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "CrowdStrike Reports First Quarter Fiscal Year 2024 Financial Results",
    "Stories like this get my ears ringing https://twitter.com/...",
    "Europe turns to existing laws to regulate cutting-edge AI",
    "ChatGPT Risks Divide Biden Administration Over AI Rules in EU",
    "Personalized wealth management, built for tech people",
    "BabyLM Challenge  —  Summary: This shared task challenges community members to train …",
    "Four LLM trends since ChatGPT and their implications for AI builders",
    "What are LLMs, and how are they used in generative AI?",
    "Bluesky vs. Nostr — Which Should Developers Care About More?",
    "Twitter Alternative Bluesky Hits 100k Members Before Exiting Beta",
    "Cool article about @fiatjaf, @arcbtc and the beginnings of nostr https://www.forbes.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "What is Generative AI and how does AI improve customer experience?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Canadian Regulator Investigates Legality of Binance Serving Clients from Canada",
    "Bybit Follows Binance's Footsteps, Exits Canadian Market Amid Regulatory Concerns",
    "Binance Faces Probe By Canadian Securities Regulator",
    "Bybit follows Binance in departure from Canadian market",
    "Ah. So that's why it has barred Canadians. https://twitter.com/...",
    "Amazon Echo Pop Review: An Alexa Speaker That Looks Nice And Talks Back",
    "Amazon Echo Pop review: A portable smart speaker for small spaces",
    "Amazon Echo Pop Review: a perfectly priced Alexa",
    "Amazon Echo Pop review: The latest Echo flops rather than pops",
    "Nvidia, the world's newest, AI-amped tech giant",
    "Talis Capital Holds First Close of $175M Fund III",
    "PSG makes investment in Hostaway to expand its vacation-rental software amid travel rebound",
    "Hostaway's $175M Raise Is A Rarity In The Travel Industry",
    "Hostaway raises $175M for vacation rental tech expansion",
    "Finnish founded Hostaway secures $175 million to take its vacation rental platform global",
    "Garmin unveils new Fenix 7 Pro and Epix Pro Gen 2 series watches",
    "Garmin's new epix Pro and fenix 7 Pro want to pull me away from my Apple Watch Ultra",
    "Garmin Epix 2 Pro & Fenix 7 Pro are official: here's what's new & different",
    "Epix 2 Pro: Garmin announces new smartwatches in three sizes with flashlight and improved sensors",
    "British digital bank Monzo hits monthly profitability for the first time after spike in lending",
    "UK Neobank Monzo Records First Monthly Profits",
    "Monzo Narrows Losses as Customer Numbers and Staff Costs Grow",
    "Neobanks should take heart from Monzo's performance in 2022",
    "Monzo hits monthly profitability",
    "💸 Revenues more than doubled to £356m (+130% YoY)  —  📈 Net operating income is up 88% YoY …",
    "Dublin fintech NomuPay raises $53.6m for payments platform",
    "NomuPay Raises $53.6M in Funding",
    "Ireland-based fintech platform NomuPay secures €50.1M for cross-border payments; Know more",
    "Dublin-Headquartered NomuPay Raises $53.6 Million to Expand X-Border Payment Platform",
    "Removing the multiples, Ireland's NomuPay nomz nomz on $53.6 million",
    "Unified payments platform NomuPay raises $53.6M in Series A round",
    "Dublin-based fintech NomuPay raises €50m from backers",
    "‘All access pass’ payments platform NomuPay raises $53.6 million",
    "Foxconn's Young Liu says AI demand to boost server business",
    "Foxconn Expects Growing AI Demand to Boost Its Server Business This Year",
    "Taiwan's Foxconn predicts huge growth in AI server business",
    "Apple's iPhone Maker Expects to More Than Double AI Server Sales",
    "Foxconn sees AI driving strong server demand, but full year to be flat",
    "U.S. Manufacturers Seek China Alternatives as Tensions Rise",
    "EV investors say China will need to catch up in advanced chips",
    "Armchair Warriors Are Getting Taiwan All Wrong",
    "Taiwan invasion in 2025 gaining credibility; no time for Apple and others to prepare",
    "The interactive is also beautifully produced. https://twitter.com/...",
    "Cowen Shutters Its Crypto Division 14 Months After Launch",
    "Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges",
    "Purdue Pharma's Bankruptcy Works Now",
    "Wall Street Firms To Take On Binance, Coinbase, Other Crypto-Native Exchanges",
    "Crypto is surely dead this time... https://www.ft.com/...",
    "The Download: meet the longevity obsessives, and how China's regulating AI",
    "A new verb. https://www.reuters.com/...",
    "International Business Times",
    "Fidelity marks down value of Twitter stake again",
    "Twitter value keeps falling under Musk, now worth a third of what he paid",
    "The Founders and Coaches Addressing Burnout",
    "Twitter only worth 33% of what Musk-led investors paid, Fidelity says",
    "Twitter has lost 66% of its value since Elon Musk bought it",
    "Twitter Is Now Worth a Third of What Musk Paid for It, Fidelity Says",
    "Fidelity Values Twitter At Roughly $15 Billion—A Third Of The Sticker Price Paid By Musk",
    "Twitter may be worth only a third of its pre-Musk value, Fidelity says",
    "Twitter now worth just a third of what Musk paid for it",
    "Elon Musk's most controversial moments",
    "Twitter's value down two-thirds since Musk takeover, says investor",
    "Twitter may be worth one-third what Musk paid for it last fall as Fidelity marks down investment",
    "Twitter is only worth a third of what Elon Musk paid for it, major asset manager says",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Report: Twitter Now Worth a Third of $44B Purchase Price",
    "Twitter is Approving Far More Government Censorship Requests Under Elon Musk",
    "Fidelity Slashes Value of Its Twitter Stake Once Again",
    "Twitter's worth down to just $15 bn under Musk: Report",
    "Twitter is now worth one-third what Elon Musk paid",
    "Twitter's Value Dives Again. Elon Musk's Purchase Is Looking Even Worse.",
    "Fidelity: Twitter is Now Only Worth a Third of What Elon Musk Paid for It",
    "Twitter now worth just 33% of Elon Musk's purchase price",
    "how many D is this chess? https://www.bloomberg.com/...",
    "Yikes. This means Fidelity values Twitter around ~$15 billion [image]",
    "Still too high. The only thing that will save this is if it becomes at meme stock",
    "The idea that billionaires can run things better than anyone else is dumb https://twitter.com/...",
    "Only took seven months, too. https://www.bloomberg.com/... [image]",
    "Destroying that much value in such a short period isn't easy to do. https://twitter.com/...",
    "Elon took on $13bn of debt to buy Twitter https://twitter.com/...",
    "Block Party Resource Center",
    "Block Party's Twitter product is on indefinite hiatus as of May 31",
    "Anti-harassment service Block Party leaves Twitter amid API changes",
    "Twitter moderation is about to get much worse - and its all Elon Musk's fault",
    "Block Party exits Twitter in light of the media company's API change",
    "Popular anti-troll tool Block Party shuts down",
    "You Do It: Twitter Outsources AI Image Detection to Its Users",
    "Product FAQ  —  Twitter Product Hiatus Why is Block Party's Twitter product on indefinite hiatus?",
    "just fell to my knees. this app has been so vital to my safety on here https://twitter.com/...",
    "Data about Apple's AR headset screens has been leaked",
    "Apple's Reality Pro headset specs just leaked",
    "Apple Reality Pro VR Headset: New Report Claims Massive Leak",
    "Curved Apple headset design is manufacturing's worst nightmare",
    "Apple mixed reality headset specs leak right before WWDC 2023 — here's what you get",
    "Display analyst Ross Young tweets out possible specs for Apple's AR headset",
    "Apple Reality Pro VR Headset Could Be 50X Brighter Than The Quest 2 And Support HDR",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Rumored 4K screens could let Apple VR/AR headset offer real world-like clarity",
    "Apple's mixed reality headset will reportedly have some insane brightness levels",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Apple Reality Pro leak reveals a seriously high-res display—4K for each eye",
    "Here are the specs for Apple's ‘Reality One’ XR headset displays",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "Apple's mixed reality headset: Everything we know so far",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate"
]