[
    "Apple Vision Pro to Feature ‘Travel Mode’ for Better In-Flight Experience",
    "Vision Pro will turn any surface into a display with touch control",
    "Apple Vision Pro will let you toss timers all over your kitchen while cooking",
    "Apple Vision Pro Travel Mode could make economy feel like first class — but is it worth it?",
    "Apple wants the Vision Pro to be the world's most expensive in-flight accessory",
    "Apple Vision Pro lets you turn any surface into a touchscreen for apps",
    "Apple releases VisionOS SDK, developers can apply for Vision Pro hardware kit",
    "Apple wants you to wear a Vision Pro while flying",
    "Apple Vision Pro has a Travel Mode that could change how you fly — here's how",
    "Apple Vision Pro's Guest Mode will let you share the $3,500 headset with friends",
    "Apple Vision Pro may have a Travel Mode for plane rides",
    "Apple Releases visionOS SDK to Get Developers Amped for Vision Pro",
    "Apple Vision Pro has speed limit, requires Travel Mode for in-flight use",
    "A First Look at Vision Pro's Travel Mode",
    "Apple Releases visionOS SDK, Creating Spatial Experiences, Apple's Developer Advantage",
    "Apple Vision Pro headset packs interesting ‘Travel Mode’ feature - here's a look",
    "Apple Vision Pro will have an in-flight Travel Mode - here's what we know",
    "Apples Vision Pro features a Travel Mode designed for the airplane use",
    "visionOS SDK  —  Apple today announced the availability of new software tools and technologies …",
    "Apple's Vision Pro features a ‘Travel Mode’ designed for airplane use",
    "The Apple Vision Pro could come with a ‘travel mode’ for plane rides",
    "Travel Mode for Apple's Vision Pro headset discovered in visionOS code",
    "Apple Unveils Vision Pro SDK and Developer Labs",
    "visionOS beta reveals new glimpses of Apple Vision Pro capabilities",
    "Travel Mode in visionOS optimizes your Vision Pro experience on airplane flights",
    "Apple Vision Pro to offer ‘Travel Mode’ for airplane flights",
    "Apple's Vision Pro headset will have a special ‘Travel Mode’ for in-flight use",
    "Apple's Vision Pro will have a special mode for using it on an airplane",
    "Here's a Walkthrough of visionOS, Apple Vision Pro Software [VIDEO]",
    "Apple Vision Pro to include ‘Guest Mode’ for sharing headset with others",
    "The SharePlay design videos for Vision are interesting",
    "@HopelessDemigod@mstdn.social",
    "Twitter agrees to comply with tough EU disinformation laws",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "EU plants flag in Silicon Valley ahead of big tech crackdown",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "Is Twitter ready for Europe's new Big Tech rules? E.U. official says it has work to do",
    "EU warns Twitter to beef up content moderation as new rules loom",
    "Twitter faces ‘stress test’ of Europe's tough new Big Tech rules",
    "Europe takes its fight against Big Tech to CEOs' turf: San Francisco",
    "EU Warns Twitter Must Focus on Disinformation Ahead of Elections",
    "Twitter agrees to comply with tough EU disinformation laws |  Twitter",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "Apple Pay and US-exclusive Apple Card could expand to India",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple reportedly back in talks to launch Apple Pay in India",
    "Apple Card could expand to India, four years after US rollout",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Apple Card will launch in India next, report claims",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple Card and Apple Pay could soon launch in India",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple in talks to launch Apple Pay in India",
    "Why Credit Card Adoption Is Rising In India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "US Taxpayers Backstopped Big Tech, VC Billions During SVB Collapse",
    "Circle was SVB's biggest client: report",
    "Sequoia Had $1 Billion in SVB Deposits When Bank Was Seized",
    "Circle Was Top Depositor Aided by SVB Government Rescue: Bloomberg",
    "FDIC Documents Reveal Circle And Sequoia As SVB's Top Depositors",
    "These SVB Depositors Got Burned—Now They're Fighting Back",
    "Circle and Sequoia were among top depositors at Silicon Valley Bank: Report",
    "Circle was a principal beneficiary of SVB government rescue",
    "LOL omg https://twitter.com/...",
    "Big VC, Tech Got Backstop for Billions in Uninsured SVB Deposits",
    "@dangillmor@mastodon.social",
    "Changes to News Availability on Our Platforms in Canada",
    "Meta won't negotiate with publishers, will end Facebook news in Canada",
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Facebook to end news access in Canada over incoming law on paying publishers",
    "Canada's Online News Act Targets Facebook and Google",
    "Meta says it will block news from Facebook, Instagram in Canada",
    "Facebook and Instagram to restrict news access in Canada",
    "Meta to ban news sharing on Facebook in Canada after journalism bill passes",
    "Meta to pull news from Facebook and Instagram in Canada",
    "Meta Tells Canada: No News for You!",
    "Meta Will Remove News Content From Facebook and Instagram in Canada",
    "Want to Share News Articles on Facebook in Canada? Tough Luck",
    "Silicon Valley Business Journal",
    "Why Meta Platforms is shutting down Facebook, Instagram news access in Canada",
    "Meta says it will end news availability on Facebook and Instagram in Canada",
    "Canadian Senate passes bill requiring Google, Meta to pay for news",
    "Meta is yanking news from Facebook and Instagram in Canada",
    "Canada Passes Law Forcing Facebook, Google to Pay Media for Links",
    "Canada passes Online News Act - Meta says it will block news on Facebook and Instagram",
    "Meta stops serving news to the Canadian users as Bill C-18 gets closer becoming reality",
    "Meta will remove news from Facebook and Instagram in Canada",
    "Canada Bill C-18 Delivers a Victory: How Long Will the Triumph Pay Off in Cash Money?",
    "Meta to Remove News From Facebook and Instagram in Canada",
    "Facebook and Instagram to block news in Canada",
    "Meta to Block Facebook and Instagram News Sharing in Canada",
    "Meta to halt news on Facebook and Instagram in Canada",
    "Facebook shutters news rather than pay up under new Canadian law",
    "Meta to end news sharing on Facebook and Instagram for all Canadians",
    "Meta to follow through on Facebook, Instagram block in Canada after content bill advances",
    "Meta to end news sharing in Canada",
    "Canada residents will not be able to access news on Facebook, Instagram; Here's why",
    "Facebook says it will pull Canadian access to news as Bill C-18 heads for Royal Assent",
    "Facebook vows to restrict news access in Canada",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "Meta makes good on promise to remove news from Canadian Facebook",
    "Meta to End News on Facebook and Instagram in Canada",
    "Meta to pull plug on news sharing in Canada",
    "Bill C-18: Liberal Government's Online News Act Becomes Law",
    "News Media Canada Welcomes Passage of Online News Act",
    "Meta to Block News on Facebook, Instagram in Canada Over New Law",
    "After Royal Assent of Bill C-18, Meta Reaffirms It Will End News Sharing in Canada",
    "Oh no!! Just kidding. #NoOneCares https://twitter.com/...",
    "The Online News Act is now law! #C18 #CdnPoli https://twitter.com/... [image]",
    "Meta has already basically cut off all traffic to news sites anyway https://twitter.com/...",
    "Meta confirms it will block news on Facebook, Instagram as Senate passes Bill C-18",
    "Facebook confirms that all news sharing in Canada will end due to passage of Bill C-18",
    "Facebook cutting off news in Canada to avoid paying publishers for content",
    "JPMorgan Chase Launches Euro-Denominated Transactions With JPM Coin",
    "JPMorgan Expands Its Blockchain-Based Token to Euro Payments: Bloomberg",
    "JPMorgan unveils euro blockchain payment solution",
    "JPMorgan's JPM Coin Expands for Euro Transactions",
    "JP Morgan expands blockchain payment system to include euros",
    "JPMorgan launches euro blockchain payments for corporate clients",
    "JPMorgan's blockchain project expands to include euro-denominated payments",
    "JPMorgan expands its JPM Coin system to include euro payments: Bloomberg",
    "JPMorgan Launches Euro Blockchain Payments via JPM Coin",
    "JPMorgan bank deploys JPM Coin for euro-denominated payments",
    "JPMorgan begins euro payments on its blockchain platform: Bloomberg",
    "@TheGeeZus@mastodon.social",
    "@LokiTheCat@toot.community",
    "@ignbot@partyparrot.social",
    "Microsoft Claims Bobby Kotick Demanded Bigger Revenue Share to Put Call of Duty on Xbox",
    "Private email shows PlayStation chief unworried about Xbox-exclusive Call of Duty",
    "Microsoft opened the FTC hearing with a Sony bombshell",
    "Sony Says It Couldn't Reveal PS6 Info To Activision After Microsoft Deal, Which Is A Trap",
    "Xbox says Activision forced it into lesser Call of Duty revenue deal",
    "The FTC's case against Microsoft could quickly turn into Xbox vs. PlayStation",
    "Microsoft, FTC square off in Activision trial",
    "Microsoft Says Even Rival Sony Had No Concern Over Activision Deal",
    "Sony says it wouldn't share PS6 details with Microsoft-owned Activision",
    "Bethesda Exec Explains Why Starfield Being Xbox Exclusive Is a Good Thing",
    "Is PlayStation Really Worried About Losing Call of Duty To Microsoft? Private Emails Say No",
    "Jim Ryan Wasn't Overly Concerned About Call Of Duty Xbox Exclusivity",
    "Can a Hollywood Operator Help TikTok? That Didn't Go So Well the First Time",
    "Sony to withhold PlayStation 6 info from Activision if Microsoft buyout completes",
    "Sony's PlayStation Chief Privately Denies Microsoft's Activision Deal is About Xbox Exclusivity",
    "Xbox's Phil Spencer has final say on game exclusivity",
    "The view from day one: Microsoft challenges FTC in court over acquisition of Activision Blizzard",
    "PlayStation boss' private email said he wasn't worried about Xbox-Activision deal",
    "Microsoft says it could abandon the Activision deal if it is delayed by federal judges",
    "Hearing Over Microsoft's Takeover of Activision Blizzard Begins, With Bigwigs Set to Testify",
    "PlayStation Boss Admitted Xbox/Activision Deal Isn't About CoD Exclusivity In Private Email",
    "To Clear Activision Deal, Microsoft Says: We've Lost The Console Wars",
    "Sony Can't Share Details About Next Console With Activision if Acquisition Passes - SIE President",
    "Sony: No PlayStation 6 Information for Activision if Microsoft Deal Goes Through",
    "Microsoft paints Sony as ‘complainer-in-chief’ against $75bn Activision deal",
    "Sony's PlayStation Chief Privately Said Microsoft's Activision Deal Wasn't About Xbox Exclusives",
    "PlayStation chief privately dismissed concerns of Xbox-exclusive Call of Duty",
    "@mattontech@mastodon.sdf.org",
    "PlayStation Boss Jim Ryan ‘Pretty Sure’ Call of Duty Will Remain on PlayStation in Bombshell Email",
    "Microsoft Says It Could Abandon Activision Deal if Judge Delays It",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Microsoft says Xbox has 'lost the console wars",
    "FTC: Xbox-exclusive Starfield is “powerful evidence” against Activision deal",
    "Microsoft slates next Xbox console generation for 2028",
    "Everything that went down in day one at court for Microsoft, Sony, and the FTC",
    "Microsoft Admits it ‘Lost the Console Wars’ As it Tries to Salvage Activision Deal",
    "Xbox Has ‘Lost the Console Wars,’ Microsoft Says",
    "Bombshell Email Reveals Sony Didn't Believe Microsoft Would Take ‘Call Of Duty’ Exclusive",
    "The Outer Worlds 2 might end up on PlayStation",
    "Microsoft had to pay Activision extra to get Call Of Duty on Xbox",
    "Microsoft and the FTC's fight over Activision reveals secret deals, bombshell emails, and more",
    "Microsoft Expects Next Console Generation to Start in 2028",
    "Microsoft Reckons The Next Console Generation Will Kick Off In 2028",
    "Microsoft Reveals When It Thinks PlayStation 6, Next Xbox Will Be Out",
    "Microsoft Says Xbox Has Been Losing The Console Wars Since 2001",
    "Microsoft May Have Inadvertently Revealed When The PS6 Will Arrive",
    "Xbox's Indiana Jones Game Was Originally Set To Launch On PlayStation Too",
    "Microsoft Filing Claims That Xbox Lost the Console Wars",
    "Xbox admits defeat in ‘console wars’",
    "“Xbox Has Lost the Console Wars” Admits Microsoft, Next-Gen Consoles Expected in 2028",
    "Sony: Future PlayStation info won't be given to Activision Blizzard if Microsoft buys it",
    "Microsoft Says Xbox Has “Lost The Console Wars” As Part Of FTC Arguments",
    "Microsoft Claims That Xbox Has “Lost The Console Wars”?",
    "Xbox opens FTC defence by claiming it's ‘lost the console wars’",
    "Microsoft Is Literally Now Saying That Xbox Has ‘Lost The Console Wars’",
    "Xbox is actually a small indie game company... https://twitter.com/...",
    "FTX seeks to claw $700M from Bankman-Fried friends and affiliated funds",
    "FTX Seeks to Claw Back $700 Million From K5 Global and Related Entities",
    "FTX files suit against SBF's old pals to attempt $700M clawback",
    "FTX files lawsuit to demand compensation from firms linked to its collapse",
    "Alameda seeks to claw back $700 million SBF paid ‘super networkers’",
    "FTX Seeks to Recover $700 Million from Sam Bankman Fried's Affiliated Funds",
    "Alameda Seeks Return of $700M Paid to ‘Super Networkers’ for Celebrity, Political Access",
    "FTX Sues K5 Global Investment Firm for $700 Million",
    "FTX Attempts Clawback of $700M Allegedly Spent After A Networking Party",
    "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "@brendannyhan@mastodon.social",
    "@GottaLaff@mastodon.social",
    "Trump spoke at a fundraiser for Jan. 6 defendants",
    "Weird this didn't make it into the Twitter Files. https://www.washingtonpost.com/ ...",
    "Personalized wealth management, built for tech people",
    "VC giant Andreessen Horowitz expands into wealth management",
    "@MishaalRahman@androiddev …",
    "Latest Galaxy S23 update makes important change to emergency SOS feature",
    "Android's emergency call shortcut is flooding dispatchers with false calls",
    "Android's ‘Emergency SOS’ blamed for influx of false calls, Google will make changes",
    "Mistaken 911 calls through Android phones could soon be a thing of the past",
    "June “Super Update” will prevent Galaxy S23, S22 users from disabling Emergency SOS",
    "Emergency SOS is always active on Galaxy S23 after June update",
    "Now the UK is warning Android users over accidental emergency calls",
    "Samsung's June 2023 update permanently enables Emergency SOS",
    "Google moves for changes to Android Emergency SOS in response to accidental calls",
    "Android's Emergency SOS feature causes a spike in accidental 999 calls",
    "Android's Emergency SOS increases accidental calls to police",
    "Your Android phone might accidentally call the police, and that's a big problem",
    "@MishaalRahman@androiddev.social",
    "Byju's Crisis: Peak XV Partners' GV Ravishankar, Prosus' Russel Dreisenstock officially step down",
    "Peak XV Partners, Prosus confirm resignation of Byju's board members",
    "[Update] BYJU'S In Talks With Investors To Reconsider Decision To Quit Board",
    "Byju's CFO was tasked with changing auditor, sources say",
    "More trouble for Byju's as key board members resign: sources",
    "Live news: Electric truck start-up Nikola suspects ‘foul play’ behind fire at headquarters",
    "Byju's auditor Deloitte quits over long-delayed financial statements",
    "Deloitte Quits as Byju's Auditor Piling Pressure on Tech Startup",
    "Three key members resign from Byju's board",
    "Free compensation benchmarking data from 3,000 startups",
    "Effective scheduling is key to workforce optimization",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/23 - Meta To Turn Off The (Canadian) News Spigot?",
    "Jun 19-23Cannes LionsCannes",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Accelerant raises $150M for its insurance underwriting platform",
    "SEC will ‘forego’ $30M BlockFi penalty until investors are repaid",
    "SEC waives BlockFi's $30M fine until creditors are paid",
    "SEC To BlockFi In $50 Million Settlement Saga - Pay Debtors First",
    "SEC postpones $30 million BlockFi penalty to boost creditor repayments",
    "SEC Temporarily Suspends $30M BlockFi Penalty Pending Investor Repayment",
    "SEC delays BlockFi's $30 million penalty, focusing on investor reimbursement",
    "US SEC Agrees to Forego BlockFi's $30M Fine Until Investors are Repaid",
    "SEC to Forego BlockFi's Outstanding $30 Million Penalty—For Now",
    "SEC allows BlockFi customers to be repaid before collection of $30.2M fine",
    "Reddit users bombard site with John Oliver pictures in latest protest over new policy",
    "Wait, Reddit had less than $700M of revenue?? How?? https://twitter.com/...",
    "Reddit sales growth slowdown preceded fight over new API fees",
    "Joe Biden affirms that semiconductors will once more be produced in the US",
    "Joe Biden reiterates semiconductors will be made in the US again",
    "TSMC Arizona plant safety questioned after multiple accidents, fake active shooter drill",
    "Starbucks Union Plans to Strike Over Pride Décor and Labor Practices",
    "Film Forum Union Ratifies First Contract",
    "US campaign against facial recognition in venues ramps up",
    "100 artists and venues sign pledge against facial recognition",
    "Over 100 artists boycott venues that employ face-scanning tech",
    "YouTube fan accounts will soon need a disclosure in the channel name or handle",
    "YouTube's updated guidelines require channels to disclose if they are fan accounts",
    "YouTube now requires users to declare if they are fan accounts",
    "YouTube Says ‘No More Confusion’: Fan Accounts Need Clear Labels",
    "YouTube is going after fan channels that impersonate others",
    "YouTube updates its policy for Fan Channels: Here's how it will impact creators",
    "AWS launches $100M program to fund generative AI initiatives",
    "AWS Announces Generative AI Innovation Center",
    "Amazon Pledges $100 Million for Generative AI Startups",
    "Amazon Web Services to Invest $100M in Generative AI Innovation Center",
    "Amazon fuels the future of AI with $100M support for generative startups",
    "Google accuses Microsoft of anti-competitive cloud practices in FTC letter",
    "AWS invests $100 million in generative AI",
    "Amazon invests $100M in new Generative AI Innovation Center to accelerate solution development",
    "Amazon Invests $100M in AWS Generative AI Innovation Center",
    "AWS unveils $100mn program to boost generative AI initiatives",
    "Amazon is playing the long game on A.I.",
    "Generative AI: Amazon's US$100M Challenge",
    "Amazon “Sabotaged” User Attempts to Cancel Prime, FTC Alleges",
    "What generative AI means for businesses and how AWS can help",
    "AWS Investing $100M in Generative AI Center",
    "AWS pledges $100M to launch generative AI innovation center",
    "Amazon's AWS Invests $100 Million in Generative AI Innovation Center",
    "Amazon looks to boost generative AI projects with new $100M cloud initiative",
    "AWS Launches New $100M Generative AI Innovation Center",
    "AWS Invests $100 Million In Its Generative AI Innovation Center",
    "AWS is putting $100 million into a center to help companies use generative AI.",
    "AWS invests $100 million in new Generative AI Innovation Center",
    "AWS invests $100 million to help customers succeed with generative AI",
    "Amazon Is Spending $100 Million to Teach Cloud Customers About AI",
    "Google Takes Aim at Microsoft's Azure Cloud Practices",
    "Russia tells Amazon Web Services to set up local representation or face restrictions",
    "They will Spinoff AWS. Trust me. $AMZN https://twitter.com/...",
    "Argonne National Laboratory",
    "2 ExaFLOPS Aurora Supercomputer Is Ready: Intel Max Series CPUs and GPUs Inside",
    "Aurora Supercomputer Blade Installation Complete",
    "Aurora supercomputer will be online in 2023, say creators Intel and HPE",
    "Argonne Aurora Supercomputer Intel Max Blade Installation is Complete",
    "Exascale-class Aurora supercomputer is finally ready for duty",
    "Aurora's 10,624 Blades in Place as Exascale System Nears Completion",
    "Intel, HPE Load Aurora Supercomputer With Over 63,000 GPUs, 21,000 CPUs",
    "Argonne installs final components of Aurora supercomputer",
    "Intel and HPE complete assembly of record-breaking Aurora supercomputer",
    "Intel Aurora Supercomputer Ready To Break Records With Nearly 64K GPUs Across 10K Blades",
    "Intel & HPE Declare Aurora Supercomputer Blade Installation Complete",
    "Awesome to see this!  It took a village!  Congratulations!!",
    "Prime Trust Has ‘Shortfall of Customer Funds,’ Nevada Regulator Says",
    "Prime Trust Unable to Meet Customer Withdrawals, Says State Regulator",
    "Prime Trust halts withdrawals and deposits as acquisition fails",
    "Prime Trust Halting Deposit/Withdrawal",
    "Nevada Regulators Order Prime Trust To Shut Down Operations - Here's Why",
    "Crypto Custodian BitGo Cancels Acquisition of Prime Trust",
    "BitGo terminates plans to buy Prime Trust",
    "Nevada regulator says Prime Trust can't meet all client withdrawals",
    "Prime Trust Suspends Withdrawals After BitGo Terminates Acquisition Deal",
    "Stably pauses withdrawals, minting after Prime Trust halts deposits",
    "Prime Trust halts withdrawals as acquisition falls through",
    "In another blow to crypto, Stably halts withdrawals",
    "(Stably) Prime Trust Halting Deposit/Withdrawal (USDS, BTCS, ETHS)",
    "@BobRobertsonXI@hachyderm.io",
    "DuckDuckGo Windows browser now available in public beta",
    "DuckDuckGo's privacy-focused browser is available for Windows now",
    "DuckDuckGo browser comes to Windows in beta: Features, how to download and more",
    "Worried about your online privacy? DuckDuckGo's browser has arrived on Windows 11",
    "DuckDuckGo is bringing its browser to Windows",
    "DuckDuckGo Browser For Windows Enters Public Beta",
    "DuckDuckGo's Windows browser is here to protect your privacy",
    "DuckDuckGo's Windows browser is now available in open beta",
    "DuckDuckGo's Privacy-Focused Web Browser Now Available for Windows",
    "DuckDuckGo launches privacy-first Windows browser in beta",
    "DuckDuckGo browser for Windows available for everyone as public beta",
    "DuckDuckGo's Privacy-Enhanced Browser Waddles Into Windows, How It Compares To Chrome",
    "DuckDuckGo's Privacy Focused Web Browser Is Finally Available for Windows",
    "Protect your privacy with public beta of DuckDuckGo web browser for Windows",
    "DuckDuckGo's Privacy Browser Enters Open Beta On Windows - Here's How To Try It Out",
    "You Can Try DuckDuckGo's Windows Browser Now",
    "DuckDuckGo browser comes to Windows with a ton of privacy and security features",
    "DuckDuckGo Releases Beta Privacy Browser for Windows",
    "DuckDuckGo launches privacy-focused Windows web browser",
    "DuckDuckGo Launches Privacy-Centric Browser for Windows",
    "DuckDuckGo Browser Beta Now Available to All Windows Users",
    "Hands-On with DuckDuckGo Browser for Windows",
    "DuckDuckGo privacy-focused browser ships to Windows in open beta",
    "The DuckDuckGo Windows web browser has launched in open beta for more privacy while surfing",
    "DuckDuckGo's Windows browser is now available as a public beta release",
    "DuckDuckGo's privacy-focused browser is now available for Windows",
    "Hands-On with DuckDuckGo Browser for Windows https://www.thurrott.com/...",
    "Good news for #privacy. #WindowsInsiders https://www.theverge.com/...",
    "DuckDuckGo browser beta for Windows bakes in a lot of privacy tools",
    "DuckDuckGo Browser Beta for Windows Bakes in a Lot of Privacy Tools",
    "DuckDuckGo offers its privacy-centered browser in a Windows open beta"
]