[
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "China approves Xbox acquisition of Activision Blizzard as pressure builds on CMA",
    "Microsoft Gains China's Approval to Acquire Activision Blizzard amid Ongoing Antitrust Scrutiny",
    "China's antitrust committee joins Microsoft's growing list of Activision approvals",
    "Microsoft says China approves its plan to buy video game-maker Activision Blizzard",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard",
    "37 Countries Have Now Approved Microsoft's Deal To Buy Activision Blizzard",
    "China approves Microsoft-Activision merger",
    "Microsoft Reportedly Gets China Regulator Approval on ABK Deal",
    "China approves Microsoft's Activision Blizzard acquisition",
    "Microsoft Gains China's Antitrust Regulator Approval For Activision Purchase",
    "In The Latest Xbox ActiBlizz Twist, China Reportedly Approves Microsoft's Acquisition",
    "Telegraph report: Bank of England plans to reject Revolut's banking licence application",
    "SoftBank Butts Heads with Revolut Over Plan to Secure Banking License",
    "Revolut's Application For A UK Banking License May Be Rejected",
    "Revolut Introduces Multi-Currency Business Accounts in Australia",
    "Revolut's application for a UK banking license may be rejected: Telegraph",
    "Revolut UK Banking License Application Faces Rejection by Bank of England",
    "Revolut Could See License Application Denied, But Crypto Offerings Unaffected",
    "Revolut faces reported rejection for a UK banking license; offers to withdraw application",
    "Revolut May Not Get Banking License From Bank Of England",
    "Bank of England plans to reject Revolut's bid for banking licence",
    "Bank of England reportedly plans to reject Revolut's banking licence bid",
    "Not terribly surprising. https://twitter.com/...",
    "@tchambers@indieweb.social",
    "@film_girl@mastodon.social",
    "@rodhilton@mastodon.social",
    "@noracodes@tenforward.social",
    "@trochee@dair-community.social",
    "This is Instagram's new Twitter competitor",
    "Instagram Readies Twitter Competitor for Summer Release",
    "Look Out Bluesky, Instagram's Twitter Clone Could Launch in June,",
    "Everything we know about Instagram's Twitter clone, due this summer",
    "Instagram to reportedly launch text-based app to rival Twitter",
    "Images of Instagram's Twitter Competitor Leaked, Lets Users Reach New Audiences",
    "Meta's top secret Twitter-killer app is coming soon",
    "Instagram's upcoming text-based app to challenge Twitter with 500-character limit: Report",
    "Instagram Is Preparing A Twitter-Like App To Be Launched This Summer, Report Says",
    "Meta planning to use Instagram to supplant Twitter - here's the proof",
    "Instagram is readying a Twitter-like service",
    "Meta to release text-based version of Instagram, similar to Twitter",
    "Report: Meta Aims to Launch Text-Based App this Summer",
    "Meta's Instagram is working on a text-based app to rival Twitter",
    "Meta's Twitter Competitor App is Set to be Launched Some Time Next Month",
    "Instagram's Twitter-Like App Could Be Released Next Month",
    "Meta's Twitter rival Instagram app “P92” reportedly coming in June",
    "Instagram's New Twitter Competitor Revealed",
    "Meta has been working on a new Twitter competitor, and here's what it looks like",
    "If this is Instagram's Twitter competitor, I'm ready to jump ship",
    "Instagram's text-based app might make Twitter users jump ship",
    "Instagram prepares Twitter competitor for summer release - Bloomberg News",
    "Instagram to Launch Twitter Competitor with New Text-Based App",
    "Instagram readies Twitter competitor for summer release: Report",
    "Instagram's Twitter Clone Leaks: Here are the Features",
    "Leaked Image Shows What Instagram's New Twitter Competitor Looks Like",
    "Meta's rumored Twitter competitor could launch as early as next month",
    "Instagram's New Twitter Competitor Leaks",
    "Satisfied With Its TikTok Clone, Meta Is Working on a Twitter Clone",
    "... are you seriously telling me Facebook is pushing “pivot to text?” https://twitter.com/...",
    "This is Instagram's new Twitter rival app https://www.theverge.com/...",
    "@mattmday Right??? I think I've joined like 9 new apps in the last 6 months",
    "Let's see how this goes. https://www.theverge.com/...",
    "curious to see how well this does... https://twitter.com/...",
    "Instagram joins Fediverse? https://twitter.com/...",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]",
    "it was the pokemon IP that made it a hit, not the AR https://twitter.com/...",
    "International Business Times",
    "US presidential candidate accepts campaign donations in bitcoin",
    "Bitcoin is the Dominant Digital Commodity, Says Michael Saylor at Bitcoin 2023 Conference",
    "Miami Bitcoin Conference To See Fewer Attendees This Year: Here's Why",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "FCC Gives SpaceX Starlink A Major Win Against Dish Network",
    "AT&T files with the FCC seeking to put the kibosh on T-Mobile's satellite-to-cellular plan",
    "AT&T has some concerns about Starlink and T-Mobile's satellite-to-cellular plans",
    "AT&T Asks FCC to Block T-Mobile From Expanding Network With SpaceX Satellites",
    "A New Kind of Space Race: Companies Vie Over Market For Satellite-Enabled Phone Calls",
    "AT&T blasts T-Mobile's SpaceX plans as ‘woefully insufficient’",
    "SpaceX wins case against Dish Network in FCC spectrum spat",
    "Starlink Wins Major FCC Fight That Could Have Ended Its U.S. Service",
    "How to optimize your LinkedIn profile and grow it to get noticed by recruiters",
    "This website has a fake commenter problem  —  https://www.ft.com/...",
    "@chrismessina@mastodon.xyz",
    "2022 App Store Transparency Report",
    "Apple shares App Store Transparency report, detailing removals & data requests",
    "Chinese Communist Party submitted by far the most App Store takedown demands to Apple",
    "Apple reveals exactly how many apps were in the App Store at the end of 2022",
    "The App Store had 1,783,232 apps as of 2022",
    "Apple Releases 2022 App Store Transparency Report",
    "Apple Publishes First-Ever App Store Transparency Report",
    "That's about 25 app updates per device per week",
    "Australia's Stock Exchange ASX Axes Blockchain Initiative—for Good",
    "Australian Stock Exchange Scraps Blockchain Project",
    "Australian stock exchange officially abandons blockchain plans: Report",
    "Australian Stock Exchange Drops Plans for Blockchain Implementation",
    "Blockchain Plans Scrapped By Australian Stock Exchange - Here's Why",
    "Australia's Top Stock Exchange Says No to Blockchain",
    "The open secret about “web3” is that the technology is actually shit. https://twitter.com/...",
    "The first AI navigator for your entire network",
    "Bankrupt Crypto Lender Celsius Network Makes Massive $780M Withdrawal from Staked Ethereum",
    "Bankrupt Crypto Firm Celsius May Receive Second Chance from Wall Street",
    "Wall Street Giants Battling to Restart Celsius With $50M Injections",
    "Celsius Plans To Conclude Bankruptcy Auction Within A Week",
    "Restaurant Technology News",
    "Restaurant365 Raises $135 Million to Enhance Its Suite of Restaurant Management Solutions",
    "Restaurant365 Announces $135M Funding Round Co-Led by KKR and L Catterton",
    "Restaurant365 Raises $135M in Funding",
    "I've now confirmed the valuation is above $1B for R365. Updating story... https://twitter.com/...",
    "CodeCompose: Meta Unveils AI-Driven Coding Tool Similar to GitHub Copilot",
    "Reimagining Our Infrastructure for the AI Age",
    "Microsoft offers electrical engineers a lifeline as it pursues custom cloud silicon",
    "Meta is building a new custom chip to run AI models",
    "Meta is developing its own AI chip - here's hoping it goes better than the Metaverse",
    "Meta is working on a new chip for AI: What meta plans to do with it",
    "It's a wrap: News this week (May 13-19)",
    "Meta Announced New Chips Specifically Designed for AI Models",
    "MTIA v1: Meta's first-generation AI inference accelerator",
    "Meta Platforms Crafts Homegrown AI Inference Chip, AI Training Next",
    "Meta is working on a new chip for AI",
    "Meta reveals new details about in-house AI chips",
    "@aphysicist @ArturTanona Nope",
    "@ylecun @ArturTanona Did you get an invite to testify in front of congress yet?",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/19 - ChatGPT Comes To The App Store",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco"
]