[
    "@themckenziest.bsky.social",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Taliban Endorses Twitter Over Threads",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "Twitter traffic plunges after Musk takeover, Threads debut",
    "Twitter CEO claims platform had best day last week",
    "Meta's new Threads app ‘murderous’ for phone batteries, users say",
    "Meta's Threads Is Currently A Dystopian Utopia Because Of Its Algorithmic Feed",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "As Twitter Traffic Takes a Hit, Zuck-Musk Fight Gets Heated",
    "Elon Musk says ‘Zuck is cuck’ as Threads inches closer to 100m users",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Elon Musk's private jet tracker returns with a vengeance on Threads",
    "Twitter's traffic is taking a dive, according to Cloudflare's CEO.",
    "Taliban's Haqqani wades into ‘Twitter vs Threads’ war. ‘...intolerant policy like Meta’",
    "‘Twitter traffic tanking’ while new threat Threads tops 100 million users",
    "Threads users say Meta's new app is draining their battery - what to do if your phone is affected?",
    "What are the differences between Threads and Twitter?",
    "Elon Musk's pain is Mark Zuckerberg's gain, as Threads soars while Twitter tanks",
    "Reluctant Twitter users, influencers and others are flocking to Meta's new Threads app",
    "Instagram Threads won't have to worry about Twitter's years of advertising pain",
    "Meta's latest Threads app is a ‘battery-saver’ for smartphones",
    "Twitter traffic really is tanking, Cloudflare reveals, but is anyone that surprised?",
    "Meta's new ‘Twitter killer’ app, Threads, hits over 100 million users",
    "Twitter CEO Linda Yaccarino Takes Shots At Rival Threads As Meta Platform Crosses 100M Signups",
    "Twitter vs Threads: Musk gets personal, punches below the belt in battle with Zuckerberg",
    "Elon Musk calls Mark Zuckerberg a “cuck” and proposes a “dick” measuring contest",
    "Musk Melts Down as Threads Nears 100M Users: ‘Zuck is a Cuck’",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "Twitter traffic tanking. [Image: Cloudflare DNS rankings over time]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "@brettdash_ @charliewrich Censorship pays them well",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "Jim Cramer has said: “Whatever Twitter can do, Zuck can do better”. [video]",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "Elon: Protects free speech Zuck: Protects brand speech https://twitter.com/... [image]",
    "@lindayacc I spent over 25 hours a day on Twitter all weekend to support you and all of us here",
    "Excruciating flop sweat vibes. https://twitter.com/...",
    "META'S TWITTER RIVAL THREADS OVERTAKES CHATGPT AS FASTEST-GROWING PLATFORM $META",
    "The censorship on Meta's new app is insane. They even want to control whom you follow. [image]",
    "Now we know why Twitter recently allowed male enhancement product ads on its platform [image]",
    "A @Techmeme headline for the history books [image]",
    "The Taliban endorsing Twitter is a sign we're on a sinking ship https://twitter.com/...",
    "@SOClALRATE This platform will protect anons for this reason particularly",
    "Zuck is actually doing it lmaooooo [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "Taliban says Meta is Intolerant, so it is sticking with Twitter instead of using Threads.",
    "Instagram's Threads surpasses 100 million users",
    "Twitter's future is in doubt as Threads tops 100 million users",
    "Instagram Threads hits 100 million users, becoming easily the fastest growing app ever",
    "Twitter-killer Threads goes past ChatGPT, becomes the fastest app to have 100 million users",
    "Threads Hits 100 Million Users Faster Than ChatGPT. Now It Needs Them to Stay.",
    "Threads hits 100 million users in just 5 days, toppling record set by ChatGPT",
    "Threads already has 100 million users, and a surprising number of them are on Android",
    "Threads hits 100 million users in five-day record surge",
    "Meta's Threads races to 100 million users in under a week",
    "‘Twitter killer’ Threads app hits 100m sign-ups in less than five days",
    "For Threads, Usage Is What Matters, Not Downloads",
    "Threads app signs up 100m users in less than a week",
    "Threads to Add $8 Billion to Meta Annual Revenue by 2025, Analyst Says",
    "Meta's Twitter rival Threads hits 100 million users in record five days",
    "Threads Tops ChatGPT's Record With 100 Million Users in 5 Days",
    "Meta's Threads tops 100 million users in just 5 days, Zuckerberg says",
    "Threads now has 100 million users",
    "Threads reaches 100 million users in a week",
    "Instagram's Threads broke the 100-million-user barrier in a matter of days",
    "Meta's new Threads app raises potential privacy concerns over data sharing",
    "Threads by Instagram surpass 100 million sign-ups in 5 days",
    "Meta's ‘Threads’ reaches 100 million users, and now you can follow us there too",
    "ChatGPT's record growth was just dethroned by a new viral app",
    "Threads hits 100 million users in less than five days",
    "Threads makes waves, surpasses 100 million user milestone in just five days",
    "Meta's Threads app passes 100M signups five days after launch",
    "Meta's Threads reaches 100M users, despite delayed EU launch",
    "Threads Hits 100 Million Users Days After Launch",
    "Meta's Threads surpasses 100M users in 5 days — while Twitter traffic ‘tanks’",
    "Meta's New Social App Threads Surpasses 100M Users in One Week",
    "Instagram's Threads Crosses 100 Million Users in Five Days to Become Fastest Growing App",
    "Threads passes another huge user milestone",
    "Instagram's Threads Hits 100M Users to Become Fastest-Growing App Ever",
    "Instagram Threads reaches 100 million users in just 5 days",
    "Instagram's Threads crosses 100 Mn users, India drives download growth",
    "Threads reaches 100 million members in record time",
    "Mark Zuckerberg's Threads platform hits 100 million users in 5 days, growing faster than ChatGPT",
    "Threads reaches 100 million users",
    "Twitter rival Threads signs up 100 million users in five days",
    "Meta's Threads app is on track to 100 million users as it reaches 70 million in just 5 days",
    "Threads Hits 100 Million Sign-Ups in Just 5 Days",
    "Just A Week Later, Threads Already Has 100 Million Users",
    "100 million “sign ups”. Wonder what usage looks like. [image]",
    "more than 1/5th of Twitter now. https://twitter.com/...",
    "It really should just count as instagram. This wasn't organic growth. https://twitter.com/...",
    "Congratulations!  Loving the functionality and overall tone of @threadsapp Bravo Team!",
    "Massachusetts might become the first state to ban the sale of phone location data",
    "Massachusetts weighs outright ban on selling user location data",
    "Ban on sales of cellular location data could break important privacy precedent in US",
    "This could be the first state to ban selling cell phone location data",
    "Massachusetts might ban sales of cellphone location data.",
    "This is an excellent step... https://twitter.com/...",
    "First U.S. ban on sale of cellphone location data might be coming",
    "First US Ban on Sale of Cellphone Location Data Might Be Coming",
    "International Association …",
    "European Commission gives EU-US data transfers third round at CJEU",
    "EU and US reach a deal to let data flow across the Atlantic",
    "Big Tech can transfer Europeans' data to US in win for Facebook and Google",
    "EU Approves Data-Transfer Deal With U.S., Averting Potential Halt in Flows",
    "Social networks can keep storing EU user data in the US under new agreement",
    "Questions & Answers: EU-US Data Privacy Framework",
    "New EU deal legalizes transatlantic data transfers once again",
    "New Law Protects EU Citizens From Trans-Atlantic Data Collection in the US",
    "EU-US data-sharing deal comes into force amid threats of legal challenge",
    "U.S. and E.U. Finalize Long-Awaited Deal on Sharing Data",
    "Europe Signs Off on New Privacy Pact That Allows People's Data to Keep Flowing to US",
    "EU blesses transatlantic data sharing deal",
    "EU tries again with new framework for data flows to US",
    "EU approves US approach to safeguard transatlantic data flows",
    "European Commission Adopts EU-US Data Privacy Framework",
    "When Will Threads be Available to EU Users? Meta Faces New Assessment Process",
    "EU and US Strike New Data Transfer Agreement: What You Need to Know",
    "The Privacy Advisor European Commission adopts EU-U.S. adequacy decision",
    "EU adopts more robust data privacy agreement with US",
    "EU and US agree new transatlantic data transfer deal",
    "TPG to Buy Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "TPG to buy Forcepoint unit from Francisco Partners",
    "TPG to Acquire Forcepoint's Government Cybersecurity Business Unit",
    "TPG to Buy Forcepoint's Government Security Unit for $2.45B",
    "TPG to buy Forcepoint's public sector cybersecurity business for $2.45B",
    "Forcepoint To Sell Government Unit To TPG, Creating ‘Leader’ In Zero Trust Security",
    "TPG to buy Forcepoint's government cyber unit in a deal valued at $2.45 billion",
    "TPG Buys Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "Founders Fund Hires Flexport Founder as Partner",
    "Flexport's Ryan Petersen joins venture firm Founders Fund as a partner",
    "Flexport's Ryan Petersen Joins Thiel-Backed Founders Fund as Partner",
    "Ah the joys of going from successful CEO to investing professional at a VC fund",
    "Huge add for Founders Fund 🚀 @typesfast is a national treasure https://twitter.com/...",
    "New VC in the Presidio. welcome @typesfast! https://twitter.com/...",
    "The best I have a new role post ever. https://twitter.com/...",
    "I mean, fuck... what a get! https://twitter.com/...",
    "Excited to have @typesfast join the FF team: https://www.forbes.com/...",
    "The legend grows. @typesfast = next level. https://twitter.com/...",
    "No, ‘Socialism’ Isn't Making Americans Lazy",
    "Debate over ‘fake work’ and ‘lazy management’ in tech industry",
    "International Business Times",
    "Apple supplier Foxconn pulls out of $19.5 billion India chip project",
    "Foxconn, Vedanta pull the plug on semiconductor JV",
    "Foxconn drops out of another big factory deal, this time in India",
    "Foxconn withdraws from $19.5 billion semiconductor joint venture project with Vedanta",
    "Foxconn Pulls Out Of $19.5 Bn Semiconductor Manufacturing JV With Vedanta",
    "Foxconn Abandons India Chip Venture With Vedanta",
    "iPhone manufacturer drops $19.5 billion chip production deal with firm in India",
    "Apple Supplier Foxconn Abandons $19.5 Billion India Venture",
    "Foxconn withdraws from $19.5bn chip JV with India's Vedanta",
    "Foxconn's withdrawal from JV for chip manufacture has no impact on India's chip dream; here's why",
    "Timeline of the $19.5 billion Foxconn-Vedanta chip plan in India",
    "India Billionaire's Chip Foray Faces Setback as Foxconn Exits",
    "Foxconn Withdraws from Indian Semiconductor Joint Venture with Vedanta",
    "Foxconn pulls out of $19.5 billion India chip joint venture",
    "Foxconn withdraws from $19.5b chip-making deal in India",
    "India's Vedanta to take over Foxconn chip joint venture from holding company",
    "Foxconn dumps $19.5 bln Vedanta chip plan in blow to India",
    "Foxconn Dumps $19.5 Billion Chip Plan in Blow To India",
    "What AI can do with a toolbox... Getting started with Code Interpreter",
    "ChatGPT's Code Interpreter - Top 6 uses",
    "A Developer Used ChatGPT's Code Interpreter to Create a Game in 5 Minutes",
    "Analyzing Humanitarian Data Unstructured Excel Tables with ChatGPT Code Interpreter",
    "OpenAI's Code Interpreter Brings New Power to ChatGPT Plus",
    "ChatGPT introduces new code interpreter feature to all ChatGPT Plus users",
    "OpenAI-Releases-Code-Interpreter- Plugin-for-ChatGPT-Plus-Users",
    "ChatGPT Code Interpreter Released: Here are 10 Mind-blowing Use Cases",
    "Free compensation benchmarking data from 3,000 startups",
    "Snap is going to let you put your Linktree in your public Snapchat profile.",
    "Linktree is now available on Snapchat for users with a Public Profile",
    "Snapchat Adds Linktree-in-Bio Feature",
    "AI Detectors Discriminate Against Non-Native English Speakers",
    "GPT detectors can be biased against non-native English writers",
    "Sega workers form largest multi-department video game union in the US",
    "SEGA of America Workers Vote to Unionize",
    "Sega of America workers successfully vote to unionize",
    "Sega Of America Has Unionized",
    "Sonic the Hedgehog's US Workers Vote to Join Union",
    "Sega of America workers overwhelmingly vote to unionize",
    "Sega of America workers vote to create biggest game industry union yet",
    "Sega of America workers successfully vote to form a union",
    "Sega of America staffers vote yes to unionizing",
    "Personalized wealth management, built for tech people",
    "2 essentials, because too many sales tools spoil the art of selling",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Lightmatter: Next-gen computing built for AI.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Mon. 07/10 - Evernote Deadpool?",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "@carlypage@mastodon.social",
    "The Pimax Crystal VR Headset Is Available Now",
    "Could fitness propel VR into the mainstream spotlight?",
    "Apple's taking it slow with the Vision Pro",
    "Move over teenage gamers - women wanting to get fit are the new frontier for VR headsets",
    "A flaw in Revolut US payments resulted in the theft of $20 Million",
    "Revolut lost $20 million to criminals exploting payment loophole",
    "Hackers Exploit Flaws in Revolut's Payment System, Stealing $20 Million",
    "Revolut Lost $20 Million to Payments Glitch in 2022",
    "Hackers steal millions after cracking Revolut payment systems",
    "Thieves steal $20m via Revolut US payment flaw",
    "Flaw in Revolut payment systems exploited to steal $20 million",
    "Hackers Steal $20 Million by Exploiting Flaw in Revolut's Payment Systems",
    "Report: Revolut US Payments Flaw Leads to $20 Million Theft",
    "Thieves Stole $20 Million Via Revolut US Payment Flaw, FT Says",
    "yeah this is why regulators are paying closer attention. good. https://www.ft.com/...",
    "TSMC Records High Sales amid Increased Demand for AI Tools and Chips",
    "Evernote, the memory app people forgot about, lays off entire US staff",
    "Evernote has laid off most of its US staff and will move most operations to Europe",
    "Evernote layoffs announced after sale of company; relocates to Europe",
    "Moving the Evernote center of operations to Europe",
    "Evernote lays off US-based employees as it shifts base to Europe",
    "Evernote lays off most of its US workers and will relocate its base of operations to Europe",
    "Evernote fires nearly every US employee as it shifts operations to Europe",
    "Evernote lays off US employees and moves to Europe",
    "Evernote Lays Off Most of Staff, Triggering Fears of Closure",
    "Evernote Acquisition and Layoffs",
    "Evernote is laying off staff and relocating to Europe",
    "Early App Store star Evernote is packing up its trunk, leaving the U.S., and is moving to Europe",
    "For your eyes only, my unedited 2013 TIME Magazine story about Evernote",
    "Evernote undergoes major layoffs, shifts operations to Europe",
    "Evernote is relocating to Europe after laying off most of its US workforce",
    "in a blistering defeat for nominative determinism, evernote not looking very ever [image]",
    "What's going on at Evernote? I'd move my notes away from there if I had any [image]",
    "Old enough to remember when Evernote was on track to be a 100-year startup https://twitter.com/...",
    "Not good news for us Evernote fans. https://news.ycombinator.com/ ...",
    "Tell HN: Nearly all of Evernote's remaining staff has been laid off",
    "Bay Area tech company Evernote lays off most staff, relocating to Europe"
]