[
    "Spotify Rumored to Launch HiFi Audio as Part of New Top-Tier ‘Supremium’ Subscription Plan",
    "Spotify may finally join Apple Music's lossless audio party two years late",
    "Spotify's HiFi Plan May Finally Launch Later This Year",
    "Spotify's long-anticipated HiFi tier might require a more expensive subscription",
    "Spotify Plans to Introduce More Expensive Subscription Option with High-Fidelity Audio",
    "Spotify's Getting a More Expensive Hi-Fi Audio Plan, Report Says",
    "Spotify's new premium subscription tier might include Hi-Fi and audiobooks",
    "Spotify reportely to launch “Supremium” plan with higher monthly rate",
    "Spotify HiFi might actually be coming soon - for a hefty price",
    "Spotify to introduce new ‘Supremium’ tier plan that will include Hi-Fi audio",
    "Spotify HiFi is still coming — but Spotify ‘Supremium’ sounds like a bummer",
    "Spotify's Long-Awaited HiFi Plan May Finally Arrive Later This Year, But It Wont Be Cheap",
    "Spotify to launch new premium sub tier that adds HiFi lossless music quality and audio books",
    "Spotify is rumored to launch its more expensive HiFi audio streaming plan later this year",
    "Spotify may charge extra for HiFi ‘lossless’ audio streaming",
    "Spotify may finally be ready to launch its HiFi lossless service",
    "Spotify could finally launch Hifi audio this year, but there's a catch",
    "Spotify plans to charge extra for high-fidelity audio, which Apple Music includes for free",
    "Spotify reportedly readying new ‘Supremium’ tier with HiFi audio and more",
    "Spotify Might Finally Get HiFi Audio This Year—If You're Willing to Pay a ‘Supremium’",
    "Spotify is finally getting this Apple Music feature, but it's going to charge extra",
    "Spotify may finally be ready to debut a premium HiFi audio tier",
    "Spotify HiFi may finally be coming with more expensive subscription plan",
    "Spotify Close to Launching HiFi Premium Subscription: Report",
    "Spotify Said to Launch “Supremium” Tier with HiFi Audio",
    "Want To Pay More For Spotify? A New, More Expensive Premium Subscription Might Be On The Way",
    "Spotify Reportedly Preps ‘Supremium’ HiFi Tier, Plans to Add Audiobook Credits to Premium",
    "Thank god https://twitter.com/...",
    "@marleenstikker@waag.social",
    "Report: OpenAI Lobbied for Amendments to EU's AI Act",
    "OpenAI lobbied the EU to avoid harsher AI regulations",
    "OpenAI's CEO Goes on a Diplomatic Charm Offensive",
    "An OpenAI White Paper from 2022 reveals that it isn't as gung-ho about AI regulation as it claims",
    "OpenAI Lobbying Efforts Could Weaken Europe's AI Act",
    "OpenAI quietly lobbied for weaker AI regulations while publicly calling to be regulated",
    "ChatGPT creator OpenAI asked EU for weaker AI regulations",
    "How to build a monopoly [embedded post]",
    "Sam Altman talks a good game apparently",
    "Meet the new Big Tech boss...same as the old Big Tech boss 🇪🇺🤖🤷⤵️ https://twitter.com/...",
    "Powerful reminder that we simply cannot trust Big Tech. A must read. https://twitter.com/...",
    "Sam Altman is not your friend. https://time.com/...",
    "No way, who could have expected this? Great reporting Billy! https://twitter.com/...",
    "OpenAI Lobbied E.U. to Water Down AI Regulation",
    "OpenAI Lobbied the EU To Water Down AI Regulation",
    "Apple expands Self Service Repair and updates System Configuration process",
    "Apple expands Self Service Repair with iPhone 14, M2 Macs, system config changes, more",
    "Apple's self-service repairs no longer require a call to Apple when you're done",
    "Apple's expanded self-repair program covers the iPhone 14 and newer MacBooks",
    "Apple's Self Service Repair program updates make it easier for DIY fixers",
    "Apple Expands Self-Repair to iPhone 14 and M2-Powered 13-Inch MacBook Air",
    "Apple Broadens Self Service Repair Program with Exciting New Inclusions",
    "Apple expands Self Service Repair program with iPhone 14 and M2 MacBooks",
    "Apple Self Service Repair for iPhones streamlined, but still requires 79lb kit",
    "Apple's self-repair service now includes these new iPhones and MacBooks",
    "Apple adds the iPhone 14 and new Macs to its Self Service Repair Program",
    "Apple adds iPhone 14 and M2 Macs to Self Service Repair program",
    "Apple Extends Self-Service Repair to iPhone 14, M2 MacBooks",
    "You can now repair your iPhone 14 and M2 MacBook at home",
    "Broken iPhone or MacBook? Apple expands Self Service Repair so you can fix them at home",
    "Apple expands Self Service Repair program to iPhone 14 lineup and additional Mac models",
    "Apple Self Service Repair Now Includes iPhone 14 Lineup, More Macs",
    "Apple expands Self Service Repair to M2 Macs and iPhone 14",
    "Apple just fixed the most annoying part of its Self Service Repair program",
    "iPhone 14 and M2 MacBooks Join Apple's Self Service Repair Program",
    "Apple expands Self Service Repair to include new iPhone and MacBook models",
    "Apple Broadens DIY Repair Program and Enhances System Configuration Tool",
    "Apple Simplifies Self Service Repair with New System Configuration Process",
    "iPhone 14 and M2 MacBooks join Apple's self-repair program",
    "Apple's Self Service Repair Program is Available iPhone 14 and 14-inch, 16-inch MacBook Pro Models",
    "Apple adds iPhone 14 lineup and more Macs to its Self Service Repair program",
    "iPhone 14 and M2 Macs get added to Apple's Self Service Repair program",
    "Fixing your iPhone 14 and 2022 MacBook models just got easier",
    "iPhone 14 now supports Apple Self Service Repair along with M2 MacBook Air and Pro",
    "Apple Expands Self Service Repair Program to iPhone 14, Additional Macs",
    "Apple Expanding Self-Service Repair Program To iPhone 14 Lineup and More Macs",
    "Apple Expanding Self-Service Repair Program to iPhone 14 Lineup and More Macs",
    "@Imoptimal@mastodon.social",
    "@stringz@masto.nobigtech.es",
    "@jonas@social.jonaskoeritz.de",
    "@tillianisafox@vulpine.club",
    "@chrismessina@mastodon.xyz",
    "Defederating from Universeodon  —  We've decided to defederate from Universeodon.",
    "Facebook is launching an ActivityPub service to compete with Mastodon. …",
    "@EugeneTeplitsky@mastodon.social",
    "@Techmeme  —  Two options for fedi  —  1. It's will be Organic  —  2. It will be Meta",
    "Digital Asset Platform EDX Markets Begins Trading and Completes New Funding Round",
    "Crypto Exchange Backed by Fidelity, Schwab and Citadel Launches With Additional Investors",
    "Charles Schwab, Citadel-Backed Startup Is Building Crypto ‘Plumbing’ for Big Banks",
    "An institutional crypto exchange backed by Fidelity, Schwab, and Citadel launches today",
    "Deutsche Bank Files for Crypto License",
    "Wall Street giants back EDX Markets, a new cryptocurrency exchange",
    "Wall Street-backed crypto exchange EDX Markets launches—here's what you need to know",
    "Deutsche Bank, Citadel Securities signal the crypto land grab is accelerating",
    "EDX Markets Launches with Support for BTC, ETH, LTC and BCH Spot Trading",
    "Fidelity, Charles Schwab, Citadel and More Back Newly Launched Crypto Exchange",
    "EDX Crypto Exchange Goes Live Backed By Citadel And Fidelity",
    "Breaking: EDX Markets Backed By Fidelity, Citadel, Schwab Starts Crypto Exchange Services",
    "Citadel Securities, Fidelity, Backed Crypto Exchange Makes Slow Start",
    "Fidelity, Schwab, and Citadel launch new institutional crypto exchange",
    "Charles Schwab, Citadel-backed crypto exchange goes live today: WSJ",
    "Crypto Exchange Backed by Citadel Securities, Fidelity Goes Live",
    "Crypto Exchange Backed by Fidelity and Citadel Securities Starts Operations in US",
    "Finance giants expanding their crypto horizons with exchange launch",
    "Citadel & Fidelity Backed Crypto Exchange EDX Markets Goes Live",
    "Schwab-backed crypto exchange EDX Markets goes live",
    "Citadel, Fidelity, Schwab-backed crypto exchange launches amid U.S. crackdown",
    "“they blow up FTX” https://twitter.com/...",
    "Crypto Exchange Backed by Citadel Securities, Fidelity, Schwab Starts Operations",
    "Daniel Zhang to focus on Alibaba Cloud Intelligence Group",
    "Chinese Tech Giant Alibaba Names Next CEO",
    "Daniel Zhang May Focus on Cloud and Step Down as CEO of Alibaba",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Alibaba co-founder Joe Tsai to take over as chairman from Daniel Zhang",
    "Alibaba's crypto-friendly transition: Joseph Tsai takes the helm as chairman",
    "Alibaba Group Announces Chairman and CEO Succession Plan",
    "Alibaba Says Its Chairman, Daniel Zhang, Will Leave Post in September",
    "Alibaba CEO to step down to focus on cloud business in surprise leadership reshuffle",
    "Alibaba CEO Daniel Zhang Steps Down, Eddie Wu and Joseph Tsai Step up",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Crypto Proponent Joseph Tsai Becomes the New Chairman of Alibaba",
    "Nets owner Joe Tsai named Alibaba's new chairman amid executive shakeup",
    "Alibaba Names Crypto-Friendly Joseph Tsai as New Chairman",
    "Alibaba CEO to step down; to be replaced by Jack Ma's close confidant, Eddie Yongming Wu",
    "Alibaba Announces Co-Founder Eddie Wu Set to Replace Daniel Zhang as CEO",
    "Crypto enthusiast Tsai to steer Alibaba",
    "Alibaba prepares for leadership shakeup as CEO moves to focus on cloud",
    "Chinese e-commerce giant Alibaba names new CEO, chairman in major management reshuffle",
    "Alibaba Group In Succession Shake-up: Joe Tsai To Become Chairman; Eddie Wu Appointed CEO",
    "Alibaba's Zhang to step down as CEO, chairman amid business shakeup",
    "Alibaba Group says Eddie Wu to succeed Daniel Zhang as CEO",
    "Alibaba's New Chairman ‘Likes’ Crypto",
    "Alibaba Group Replaces CEO and Chair Daniel Zhang",
    "Alibaba CEO Daniel Zhang steps down as Eddie Wu takes charge",
    "Alibaba CEO and chairman steps down to focus on cloud business",
    "Alibaba replaces longtime chief and chair in management shake-up",
    "Joe Tsai to Become Alibaba Group Chairman, Eddie Wu Appointed CEO",
    "Chinese e-commerce giant Alibaba announces new CEO and chairman in major management reshuffle",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba's Daniel Zhang to step down as group chairman and CEO",
    "Meet the new CEO of Alibaba",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Daniel Zhang steps down amid Alibaba's major organizational shift",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Alibaba Stock Drops as CEO Daniel Zhang Steps Back",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Alibaba CEO Daniel Zhang to pass the torch and focus on cloud",
    "Live news: Pentagon overcounts value of military aid to Ukraine by $6.2bn",
    "Eddie Wu to succeed Daniel Zhang as Alibaba Group CEO in major executive reshuffle",
    "Nets owner Joe Tsai named Alibaba's new chairman",
    "‘When we meet again, may we all be carefree’: Read the outgoing Alibaba CEO's memo to staff",
    "Crypto curious Joseph Tsai to take over as chair at Alibaba",
    "Phasing Out Passwords: Apple To Automatically Assign Each User a Passkey",
    "Apple can now automatically log you in on your devices without a password",
    "Apple adds passkeys to Apple ID, iCloud logins",
    "Apple websites start implementing passkeys in place of passwords",
    "iOS 17 and macOS Sonoma Add Passkey Support to Your Apple ID",
    "Passwords out, passkeys in: are you ready to make the switch?",
    "The apple.com website adds passkey support, but there's a catch",
    "@s_carruthtx When you click sign in with iPhone, you get this popup which says iOS 16 [image]",
    "‘Sign in with iPhone’ passkey support comes to Apple․com",
    "DOJ establishes cybercrime enforcement unit as U.S. warnings mount over Chinese hacking",
    "New Privacy Features: Silence Unknown Callers and Privacy Checkup",
    "WhatsApp Releases ‘Silence Unknown Callers’ Feature to Take Down Spammers",
    "WhatsApp can now silence calls from unknown numbers",
    "WhatsApp Adds New Measures to Protect Users from Spam Calls",
    "WhatsApp Can Now Screen Out Calls From Unknown Numbers",
    "WhatsApp Adds Privacy Checkup and Silence Unknown Callers Features",
    "You can now automaticly mute WhatsApp calls from unknown numbers",
    "Latest WhatsApp Update Will Help You Avoid Spam Callers with New Privacy Features",
    "WhatsApp's newest feature will finally let me ignore people with ease",
    "WhatsApp Adds More Ways to Screen Your Calls and Protect Your Privacy",
    "WhatsApp brings new feature to silence incoming calls",
    "WhatsApp lets you cast unknown callers back into the fiery chasm from whence they came",
    "WhatsApp Boosts Your Privacy: How to Silence Unknown Callers",
    "WhatsApp Rolls Out Silence Unknown Callers, Privacy Checkup Features",
    "WhatsApp is finally bringing you relief from spam callers",
    "Big relief from spam calls on WhatsApp! App will now silence calls from unknown numbers",
    "This new Whatsapp feature allows you auto-silence calls from unknown numbers",
    "WhatsApp Rolls out a New Privacy Features: Here's how you can Silence Unknown Callers",
    "WhatsApp gets a long-awaited protection feature",
    "WhatsApp just got a huge free upgrade, and it's a game changer",
    "Whatsapp rolls out Call Silencing to combat spam calls in India",
    "Silence unknown callers on WhatsApp with the last update",
    "WhatsApp is borrowing one of the iPhone's best privacy features",
    "WhatsApp gains the ability to silence unknown callers automatically",
    "WhatsApp update adds option to automatically silence unknown callers",
    "WhatsApp lets you silence unknown callers on the app",
    "WhatsApp can now automatically silence unknown callers",
    "WhatsApp announced silence unknown callers feature and privacy checkup",
    "WhatsApp will now let you silence incoming calls from unknown callers: How it works",
    "WhatsApp announces much-needed feature ‘Silence Unknown Callers’; check how it works",
    "WhatsApp's new feature lets you silence incoming calls from unknown callers",
    "WhatsApp now allows users to silence unknown callers",
    "WhatsApp is now allowing users to automatically silence pesky spam calls",
    "New WhatsApp update will help keep spam calls out of sight",
    "WhatsApp introduces feature to automatically silence call from unknown numbers",
    "Twitter Looks to Provide More Assurance for Ad Partners Amid Conflicting Data Claims",
    "Twitter looks to reassure anxious advertisers at Cannes",
    "Inside Meta's AI sales pitch at Cannes—including chatbots, media buying and ad generation",
    "Mark Zuckerberg goes in for the kill as Elon Musk's Twitter bleeds ad dollars",
    "Advertisers are returning to Twitter after Linda Yaccarino calmed fears over content moderation. …",
    "Cannes Briefing: Twitter's absence at Cannes makes space for competitors",
    "Twitter TV: Will Musk's Plans for Video App End Twitter's Ad Woes?",
    "Elon Musk wants to launch a Twitter video app for smart TVs to revive falling ad sales",
    "Apple's machine learning head departs to run AI thinktank",
    "Apple vet to return to Allen Institute for AI as CEO",
    "Allen Institute for Artificial Intelligence (AI2) Announces New CEO",
    "Apple's ‘next-gen machine learning’ leader departs for AI non-profit",
    "Apple Machine Learning Head Departs to Become CEO of the AI2 Research Institute",
    "4 new ways to use Chrome on iOS",
    "Chrome Browser for iOS Getting Improved Translation, Google Lens and Maps Features",
    "Google Adding Four New Features to Chrome for iOS",
    "Google is Bringing Four New Features to Chrome for iPhone and iPad",
    "Chrome on iOS to get built-in Lens support, along with new Maps and Calendar integrations",
    "Google Chrome on iOS gets several new features",
    "New Maps, Calendar, and search integrations are coming to Chrome on iOS",
    "Google Chrome update for iOS users brings new handy features",
    "Chrome for iOS adding mini Google Maps and integrating Calendar, Translate",
    "Google Chrome for iPhone is getting some huge new features",
    "San Francisco Business Journal",
    "VC firm SignalFire earmarks $50 million to incubate AI-powered startups",
    "Render Raises $50M in Series B Funding",
    "Render's $50 Million Series B",
    "Render ushers in a modern age of application development in the cloud",
    "Best Cryptocurrency To Buy Now - June 2023 Top 5",
    "Render Raises $50M Series B",
    "Rose Rocket raises $38M for its transportation management system",
    "Rose Rocket Raises $38M USD in Series B Funding",
    "Rose Rocket closes $38M Series B to expand into enterprise fleet solutions",
    "Binance to implement Lightning Network nodes for enhanced Bitcoin transactions",
    "Binance to Integrate Lightning Network for Faster Bitcoin Transactions",
    "Binance Announces Plans To Integrate Bitcoin Lightning Network",
    "Binance Setting Up Lightning Nodes: Is Bitcoin Becoming a Payment Network?",
    "Binance to Incorporate BTC Lightning Network for Seamless Withdrawals and Deposits",
    "Binance Confirms Bitcoin Lightning Network Integration",
    "Binance CEO CZ confirms lightning network's scalability and transactions advances",
    "Binance Adopts Bitcoin Lightning Network for Fast Deposits and Withdrawals",
    "Binance confirms Bitcoin Lightning Network integration in the works",
    "Binance Sets Up Bitcoin Lightning Nodes to Ease Deposits and Withdrawals",
    "Binance is working on integrating Bitcoin Lightning Network for deposits and withdrawal",
    "Keep Building: Binance Starts Running Bitcoin Lightning Network Nodes",
    "Binance Set to Integrate Bitcoin Lightning Network for Deposits and Withdrawals",
    "Binance Working on Bitcoin Lightning Network Integration for Deposits and Withdrawals",
    "Slowly, but we keep building... https://twitter.com/...",
    "Binance is finally integrating Lightning Network",
    "Free compensation benchmarking data from 3,000 startups",
    "Report: VC Firms up Investments in Military Tech Startups",
    "Intel, Germany strike record €30B deal for chip mega-factory",
    "Silicon Valley VCs rush into defence technology start-ups",
    "This is exactly the conclusion of PALO ALTO https://www.ft.com/... [image]",
    "Return to tradition in Silicon Valley https://giftarticle.ft.com/...",
    "Thousands of realistic but fake AI child sex images found online, report says",
    "Roblox to Officially Allow 17+ Restricted Content on Its Gaming Platform",
    "Roblox now allows creators to build content for people 17 and older",
    "Introducing Experiences for People 17 and Older",
    "Roblox will allow exclusive experiences for people 17 and over",
    "Roblox is adding content for its growing adult user base",
    "Personalized wealth management, built for tech people",
    "Customize Cliq to suit your organization",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/20 - Spotify To Go \"Supremium\"",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Microsoft, Activision CEOs on witness list for hearing on FTC bid to block merger",
    "Microsoft, Activision CEOs to Defend $69 Billion Deal in Fight With FTC",
    "Twitch's new Partner Plus tier strains an already tense relationship with creators",
    "Amouranth Follows xQc's Lead And Leaves Twitch",
    "xQc signs deal to stream on Kick worth up to $100 million",
    "Kick Just Stole xQc And Amouranth, Twitch's Top Male And Female Streamers, Within 48 Hours",
    "Is Twitch's New Partner Plus Program Worth the Hype?",
    "Razer Blade 16 & Razer Blade 18 (2023): Price, specifications, and everything you need to know",
    "The Razer Blade 14 (2023) Laptop Review: Ryzen 9 7940HS Tested With GeForce RTX 4070 Graphics",
    "Razer Blade 14 (2023) Review",
    "Razer Blade 14 (2023) Review: Ryzen ‘Phoenix’ and RTX 4070 in a Compact Chassis",
    "Razer Blade 14 (2023) review: gaming laptops have come a long way",
    "Razer Blade 14 Review: Zen 4 Ryzen-Powered Mobile Powerhouse",
    "Gannett lawsuit claims Google's ad monopoly is hurting the news business",
    "Google's web ad choke-hold prompts lawsuit from largest publisher in US",
    "Google sued by USA Today publisher amid falling ad revenue fears",
    "The US's largest news publisher sues Google over alleged digital ad monopoly",
    "Where's my money?! Now USA Today publisher sues Google over online advertising",
    "Gannett Files Federal Lawsuit Against Google",
    "Gannett sues Google, alleges it monopolizes online ads",
    "The largest newspaper publisher in the US sues Google, alleging online ad monopoly",
    "America's Largest Newspaper Publisher Sues Google Over Alleged Advertising Monopoly",
    "News publishing giant Gannett sues Google for monopolizing ad tech",
    "Gannett Blames Google for Newspapers Shuttering in Digital Advertising Monopoly Lawsuit",
    "Gannett sues Google, accusing company of violating antitrust laws in digital ad practices",
    "Gannett Sues Google, Accusing It of Dominating the Ad Market",
    "Gannett sues Google over ‘deceptive scheme’ to gain online ad monopoly",
    "US largest publisher Gannett sues Google, alleges it monopolises online ads: Report",
    "Cybersecurity market grew 12.5% in first quarter, outpacing overall tech market",
    "Microsoft cybersecurity revenue grows 32.3% year-over-year",
    "Microsoft gains 32% annual growth in cybersecurity revenue",
    "SoftBank's Son says he is ‘heavy user’ of ChatGPT",
    "Masayoshi Son to speak at SoftBank meeting amid investment doubts",
    "Top tech execs get ready to meet Modi as China's economy falters",
    "Google reportedly planning to manufacture Pixel phones in India",
    "Google seeks suppliers to move Pixel production to India",
    "Foxconn hedges its bets: US and China will make up, but diversify just in case",
    "INDIA-US Together To Counter Terrorism & China | US Representative Ahead Of PM Modi's Visit",
    "Gaming Just Isn't About You: Consoles Are Thrashed By Casual Games",
    "US games and esports market worth $54bn in 2022",
    "Marques Brownlee on YouTube",
    "@dcseifert@mastodon.social",
    "Review: Google Pixel Tablet",
    "Google Pixel Tablet First Impressions",
    "Google Pixel Tablet review: It's all about the dock",
    "Pixel Tablet Review: Google Decides To Do One Thing Very Well",
    "Change this Pixel Tablet setting to make it even more useful - while saving you money",
    "Google Pixel Tablet vs Samsung Galaxy Tab S8: What's the difference?",
    "26 helpful Pixel Tablet tips and features",
    "The best Google Pixel Tablet deals of June 2023",
    "Google's Pixel Tablet is officially available",
    "Google's new Pixel Tablet is perfect for smart home devotees",
    "Google Pixel Tablet: News, Price, Release Date, Specs, and More",
    "Google's Pixel Tablet is fine, but the speaker dock changes everything",
    "Pixel Tablet Review: Is Google Back?!",
    "Google Pixel Tablet: A great tablet, a so-so smart home device",
    "Google Pixel Tablet Review: Not Made To Battle Galaxy Tab Or iPad, And That's A Good Thing",
    "Pixel Tablet review: Google's Android slate and smart display rolled into one",
    "Google Pixel Tablet review: half tablet, half home hub",
    "Google Pixel Tablet Review: A Solid Android Tablet, but an Even Better Smart Home Hub",
    "Google's Pixel Tablet is a good start, now Android needs to catch up",
    "Google Pixel Tablet review: That first-gen feeling",
    "Google Pixel Tablet review: the worst Pixel I've ever used",
    "The official Google Pixel Tablet case's clever design hooked me from day one",
    "Google Pixel Tablet Review: Android Tablets Are Back",
    "Google Pixel Tablet Review: Unboxing, First Impressions",
    "Best Prices Today: Google Pixel Tablet",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "First Look: Google Pixel Tablet Surprises with Additional Perks",
    "Google's Pixel Tablet reviews are in: half tablet, half smart display",
    "NEW VIDEO - Pixel Tablet Review: Is Google Back?! https://www.youtube.com/... [image]",
    "Google Pixel Tablet review: the dock makes all the difference",
    "But why? It's a mystery! https://www.nytimes.com/...",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election.  [ A legal campaign...",
    "Vimeo intros a trio of AI-powered editing features",
    "Vimeo's New AI-Powered Editor Promises to Simplify Video Creation",
    "Vimeo Adds Generative AI Video Tools",
    "Vimeo's AI Generates Video Scripts in Seconds, Removes Your ‘Ums’",
    "Vimeo Launches New AI Features to Simplify Video Editing and Scripting",
    "Vimeo Introduces AI-Powered Tools for Effortless Video Production",
    "Vimeo introduces a suite of AI tools to simplify video creation",
    "Vimeo's new AI script generator will write corporate marketing filler in seconds",
    "Vimeo announces AI-powered script generation and text-based video editing tools",
    "Vimeo unveils generative AI tools for faster video editing",
    "Vimeo unveils AI tools to make video creation a breeze",
    "Vimeo Wants ChatGPT to Write Execs' Video Scripts Then Fix It When They Inevitably Screw Up",
    "Adobe's $20 bln deal to acquire Figma under threat from EU regulators - FT",
    "Adobe's $20 Billion Figma Acquisition Likely to Face EU Investigation",
    "EU regulators to probe Adobe's $20b Figma acquisition",
    "Orange Faces EU Warning Shot Over $19 Billion Masmovil Deal",
    "Adobe's $20B deal to acquire Figma under threat from EU investigation",
    "FTX Spent More Than $120 Million in Two Months on Legal Fees",
    "Legal Advisors at Sullivan and Cromwell Bill FTX Exchange $38 Million In 3 Months",
    "Bankrupt FTX Spends $120 Million In Two Months, Where Did The Money Go?",
    "FTX Incurred More than $121M in Legal and Advisory Fees between February 1 and April 30",
    "UK crypto law inches closer to approval, Do Kwon sentenced, FTX legal costs exceed $120m",
    "FTX Paid $120 Million in Advisor Fees Over 3 Months: Report",
    "FTX incurs over $120m in advisor fees as bankruptcy costs mount",
    "$10 million per week leaving FTX None going to victims https://twitter.com/...",
    "This is absolutely insane. The level of injustice is mind boggling. https://twitter.com/...",
    "China's 618 shopping festival records slower growth amid gradual consumption recovery",
    "Alibaba's Taobao & Tmall Attracts Record Number of Merchants During 6.18 Shopping Festival",
    "JD.com's 2023 618 Grand Promotion: Surpassing Expectations and Setting New Records",
    "Consumption soft even amid deep discounts during major China shopping festival, analysts say",
    "Slower Growth During China's 618 Shopping Festival Signals Lagging Consumer Confidence",
    "Bargain hunting drives up retailers' sales as 618 shopping gala ends",
    "Taobao, JD.Com, and Pinduoduo Hail Success of ‘618’ E-Commerce Festival",
    "JD.com sales during China shopping festival beat expectations",
    "Chinese online shoppers are enticed by deep discounts, payment plans as zest for spending lags",
    "China's online shopping bonanza loses sheen as consumption sags",
    "China's 6.18 shopping fest sets record on Alibaba platforms",
    "AI and Fame: How Celebrities are Embracing Their Digital Duplicates",
    "Courts Put Privacy Over Transparency in FTX, Other Crypto Bankruptcies"
]