[
    "Elon Musk's brain implant company Neuralink approved for in-human study",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "Musk's Neuralink says cleared for first human test of brain implants",
    "Elon Musk's company Neuralink gets FDA nod to test brain implants in humans",
    "Neuralink: Elon Musk's brain chip firm says US approval won for human study",
    "Elon Musk's brain implant company Neuralink says the FDA has approved human trials",
    "Elon Musk can now put his brain implants in humans",
    "Elon Musk's Neuralink says it has FDA approval for human trials: What to know",
    "Elon Musk's Neuralink Receives FDA Approval For Brain Chip",
    "Elon Musk's Neuralink gets FDA nod to test brain implant in humans",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Musk's Brain Implant Firm Says US Approves Human Clinical Tests",
    "Paralyzed Man Walks Again: Digital Bridge Connects Brain And Spinal Cord",
    "Elon Musk's Neuralink Finally Gets FDA Approval For Human Testing",
    "Neuralink says it has the FDA's OK to start clinical trials",
    "The FDA will apparently let Elon Musk put a computer in a human's brain",
    "Congratulations Neuralink team! https://twitter.com/...",
    "Remarkable to think this is Elon Musk's *least* talked about company... https://twitter.com/...",
    "Me waking up after elon puts a neuralink in my brain https://twitter.com/... [image]",
    "For those who like to have their heads examined https://www.reuters.com/...",
    "3 new ways generative AI can help you search",
    "Want to try Google's new AI search engine? Join the Search Labs waitlist",
    "Google Expands the Test Pool for its New Generative AI Elements in Search",
    "Google starts opening access to Search Generative Experience",
    "Google invites users to test its new AI-powered Search features",
    "Google opens Search Generative Experience to US Search Labs users",
    "Google Search Adds Generative AI Preview",
    "Hands-on with Google's new Search Generative Experience",
    "Google Now Testing Generative AI for Search",
    "Google opens access to Search Labs to further test its generative AI",
    "Google begins opening access to generative AI in search",
    "Google starts opening up access to its new generative AI capabilities in Search",
    "Google is starting to let users into its AI search experiment",
    "DCG to Shut Down Institutional Trading Unit TradeBlock",
    "DCG shutters crypto institutional services subsidiary TradeBlock",
    "DCG Sunsets Trade Execution, Prime Brokerage Unit TradeBlock",
    "DCG To Shut Down Institutional Trading Platform TradeBlock on May 31st",
    "DCG's Subsidiary TradeBlock Is Shutting Its Doors: Bloomberg News",
    "Barry Silbert's DCG Shutting TradeBlock Subsidiary",
    "Breaking: Digital Currency Group (DCG) Pulls The Plug On TradeBlock: The End Of An Era?",
    "Crypto Firm DCG to Close Institutional Trading Platform TradeBlock",
    "Digital Currency Group Shuts Down TradeBlock Unit, Trade Execution Service",
    "YouTube Stories are Going Away on 6/26/2023",
    "YouTube is killing Stories",
    "Google is killing a stolen YouTube feature",
    "“Stories” time for YouTube ends June 26th; platform tells creators to use Posts and Shorts",
    "YouTube will shut down YouTube Stories next month: Check Stories' alternatives",
    "YouTube Dropping Stories As It Shifts Attention To Shorts And Community Posts",
    "Long Story Short: YouTube Stories Are Shutting Down",
    "The limited time YouTube Stories videos are going away for good on June 26",
    "YouTube is killing off Stories in favor of Shorts",
    "Add YouTube ‘Stories’ to the list of failed Snapchat copycats",
    "YouTube Stories, Google's clone of Snapchat, is dying on June 26",
    "YouTube Axes Stories Feature and Encourages Creators to Make Shorts",
    "YouTube Stories, which are not Shorts, are going away",
    "YouTube is getting rid of YouTube Stories",
    "YouTube's Retiring YouTube Stories Next Month",
    "I did not know YouTube had stories. They plan to shut it down. 🤣🤣🤣🤣 https://techcrunch.com/...",
    "Venture Firm Paradigm Broadens Focus Amid Crypto Winter",
    "The industry wide pivot from Web3 to AI is officially complete https://twitter.com/...",
    "@Techmeme There you go. Web3 is officially dead.",
    "I knew Ryan Carson was a trendsetter. https://www.theblock.co/...",
    "Crypto to AI pivot fully complete https://twitter.com/...",
    "Slowly the world is healing https://twitter.com/...",
    "OpenAI offers US$100,000 grants for ideas on AI governance",
    "OpenAI offers grants for democratic experiments in AI system rules",
    "DAO and discord should handle it, no? 😉 https://twitter.com/...",
    "U.S. Patent and Trademark Office",
    "@paul@social.paulkedrosky.com",
    "JPMorgan Chase Embraces ChatGPT-Inspired AI for Investment Advisory",
    "Trademark/Service Mark Application, Principal Register",
    "Congrats on renaming the robo-advisor https://twitter.com/...",
    "This will be interesting to watch play out. https://www.cnbc.com/...",
    "Investment advice from a chat bot? It's on its way. https://www.cnbc.com/...",
    "Of course they are. Best of luck in your marketing campaign. https://twitter.com/...",
    "People are 100% going to get bilked by this stuff: https://www.cnbc.com/...",
    "@stefan@stefanbohacek.online",
    "Musk's Twitter wants academics to delete data in “book burning” scheme",
    "What the what?? https://twitter.com/...",
    "Call me crazy, but I don't think this is how business works... https://twitter.com/...",
    "IANAL but there's no way this is enforceable by a court https://twitter.com/...",
    "public square no more! https://twitter.com/...",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "OpenAI may leave the EU if regulations bite - CEO",
    "OpenAI Could Quit Europe Over New AI Rules, CEO Sam Altman Warns",
    "OpenAI has no plans to leave Europe -CEO",
    "ChatGPT Could Leave Europe, OpenAI CEO Warns, Days After Urging U.S. Congress For AI Regulations",
    "OpenAI chief Sam Altman accused of ‘blackmail’ in EU dispute",
    "OpenAI's Altman Clashes With EU Commissioner Over AI Regulation",
    "Sam Altman says OpenAI would ‘cease operating’ in Europe if it can't comply with new rules",
    "OpenAI Considers Exit From Europe - Faces Planned Legislation from Regulators",
    "Sam Altman Wants The Government To Build Him A Moat",
    "No 10 acknowledges ‘existential’ risk of AI for first time",
    "Sam Altman sells superintelligent sunshine as protestors call for AGI pause",
    "Among AI dangers, deepfakes worry Microsoft president most",
    "Sam Altman's big European tour",
    "A conversation with OpenAI CEO Sam Altman | Hosted by Elevate",
    "Why OpenAI's Sam Altman was just in Lagos",
    "Mike had a good post on Altman's recent performance before Congress: https://www.techdirt.com/...",
    "Wow, gpt4 even making physical travel way more efficient too 👏 https://twitter.com/...",
    "@paulo170595 @SimonFounder flew to paris, took the eurostar to london",
    "WhatsApp is working on introducing usernames to the app",
    "WhatsApp Usernames May Let You Keep Your Phone Number Private",
    "WhatsApp could soon support usernames",
    "Accessing WhatsApp's settings menu gets easier",
    "WhatsApp is working on a new feature that could change how you use it",
    "Get ready to claim your WhatsApp username.",
    "WhatsApp's new update likely to bring usernames; to replace phone numbers",
    "WhatsApp working on allowing users to add usernames in their profiles, claims report",
    "WhatsApp to soon let you choose quirky usernames: Report",
    "WhatsApp to soon introduce username feature. Here's how it will work",
    "WhatsApp Plans To Introduce Usernames",
    "WhatsApp is working on easier access to app settings",
    "You can now test Google's Magic Compose AI feature",
    "WhatsApp could introduce usernames in the future",
    "WhatsApp Could Soon Let You Choose a Username So You Can Keep Your Phone Number Private",
    "WhatsApp could soon let you text users without having their number",
    "WhatsApp is finally adding username support so you can chat without sharing your number",
    "WhatsApp usernames in development, with simplicity and privacy benefits",
    "WhatsApp may soon introduce usernames",
    "WhatsApp may replace phone numbers with usernames",
    "@Tweet_BKelly Users have been asking for this feature for years.",
    "The fight for claiming username on WhatsApp is about to begin! 😬 https://twitter.com/...",
    "WhatsApp could soon support usernames https://www.androidpolice.com/ ... [image]",
    "Microsoft chief calls for humans to rule AI, safeguard critical infrastructure",
    "Microsoft Calls for A.I. Rules to Minimize the Technology's Risks",
    "Microsoft Calls for a New US Agency and Licensing for AI",
    "Microsoft urges lawmakers to adopt new guidelines for responsible AI",
    "Microsoft's President Backs New Agency to Regulate ChatGPT, Other AI Systems",
    "Microsoft leaps into the AI regulation debate, calling for a new US agency and executive order",
    "Microsoft chief says deepfakes are biggest AI concern",
    "Microsoft: We Need a New Government Agency to Regulate AI",
    "Microsoft's View on AI Governance: A Blueprint for the Future",
    "Governments Need to ‘Move Faster’ on AI Rules, Says Microsoft President",
    "Microsoft releases its blueprint on how it believes AI should be governed",
    "Microsoft calls for ‘safety brakes,’ licensing, and a new federal agency to avoid AI pitfalls",
    "Microsoft president backs regulatory agency for AI",
    "Microsoft outlines its vision for keeping A.I. in check",
    "TikTok is testing an AI chatbot called Tako",
    "TikTok tests AI chatbot ‘Tako’ in the Philippines",
    "TikTok testing AI chatbot called ‘Tako’, research firm says",
    "TikTok's new AI Chatbot in Testing Could Revolutionize User Experience",
    "TikTok has been working on its own AI chatbot named ‘Tako’",
    "TikTok Is Testing an AI Chatbot Named Tako",
    "TikTok's Testing a New ‘Tako’ AI Chatbot Experience In the App",
    "TikTok's Tako is AI chatbot helps you find videos",
    "How Long Will the Public's Interest in AI Endure?",
    "TikTok is testing its own AI chatbot called Tako and you have to love that name",
    "TikTok Is Testing Its Own AI Chatbot Called Tako",
    "TikTok tests AI chatbot for search and discovery",
    "An AI Chatbot Is Coming to TikTok for Some Reason",
    "TikTok is testing an AI chatbot for content discovery",
    "TikTok AI chatbot “Tako” help users discover more interesting videos",
    "TikTok is also making an AI chatbot, for some reason",
    "TikTok Tests AI Chatbot Called Tako",
    "TikTok is toying with an in-app AI chatbot",
    "TikTok's AI Chatbot Spotted in the Wild",
    "We are still so early. https://twitter.com/...",
    "same with ketamine https://twitter.com/...",
    "@rodhilton@mastodon.social",
    "Elon Musk accuses Satya Nadella of violating Twitter policy. Read full text of letter here",
    "Twitter launches new $5,000 per month API tier for startups",
    "Twitter says startups can ‘experiment’ with its data for $5,000 a month",
    "Twitter introduces Twitter API Pro for startups: Check price, features",
    "Too little, too late. https://twitter.com/...",
    "Stratasys and Desktop Metal",
    "3D printer maker Stratasys to merge with Desktop Metal in deal valued at $1.8 bln",
    "Why Desktop Metal and Stratasys Stocks Rose Today",
    "Stratasys to Combine with Desktop Metal in Approximately $1.8 Billion All-Stock Transaction",
    "The first AI navigator for your entire network",
    "Fahrenheit to take over Celsius  —  0°C×9/5+32 = how much money to thaw frozen crypto accounts?",
    "Fahrenheit Wins Bid to Acquire Assets of Insolvent Crypto Lender Celsius",
    "Arrington Capital-backed group to acquire Celsius assets",
    "Fahrenheit Wins Bid for Bankrupt Celsius, Will Acquire up to $500M in Liquid Crypto",
    "PNCNX Bankruptcy Claim Product To Be Available For Celsius Users in a Week",
    "Arrington Capital-led group to acquire bankrupt Celsius Network assets",
    "Arrington Led Consortium Featuring Coinbase Acquires Celsius' Assets",
    "Fahrenheit Chosen As Winning Bid in Celsius Bankruptcy",
    "Fahrenheit buying Celsius? You can't make this up",
    "This is just outstanding https://www.coindesk.com/... via @coindesk",
    "OpenAI's ChatGPT app hits 500K downloads in just 6 days since launch",
    "OpenAI's ChatGPT iOS app now available in Canada, India, Brazil and 30 more countries",
    "OpenAI's Official ChatGPT App for iPhone Expands to 40+ Countries",
    "OpenAI's ChatGPT iOS App Is Now Available For iPhone, iPad",
    "ChatGPT iOS App Launches in the UK and 10 More Countries",
    "OpenAI makes its ChatGPT app for iOS available in 11 more countries",
    "Sam Altman's Crypto Project Worldcoin Raises $115M, Led By Blockchain Capital",
    "Worldcoin - Proof of Personhood, World ID, and the Future of Crypto Onboarding",
    "OpenAI CEO raises $115M for crypto company that scans people's eyeballs",
    "OpenAI's Sam Altman raises $115 mln for Worldcoin crypto project",
    "Tools for Humanity Secures $115 Million in Funding Round Led by Blockchain Capital",
    "Worldcoin developer nets $115 million fundraise led by Blockchain Capital",
    "Sam Altman's crypto project Worldcoin got more coin in latest $115M raise",
    "Worldcoin Creator Tools for Humanity Raises $115M in Series C Round Led by Blockchain Capital",
    "OpenAI CEO Sam Altman Raises $115M for Worldcoin Crypto Project",
    "Sam Altman's Crypto Startup Tools For Humanity Locks Up $115M",
    "Sam Altman's Worldcoin Project Receives $115 Million Investment",
    "Worldcoin developer Tools for Humanity raises $115M led by Blockchain Capital",
    "Worldcoin Developer Raises $115M For A Series C Funding Round",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Thu. 05/25 - Even Presidential Candidates Suffer From Twitter Glitches",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Applied Intuition Acquires Embark Technology, for $71M",
    "ADAS and AV simulation and development",
    "Applied Intuition to Acquire Embark Technology to Enhance Products for AV Development",
    "Embark Technology goes private in $71M deal",
    "Applied Intuition to Acquire Embark Technology for $71 Million",
    "Applied Intuition to acquire self-driving truck software company Embark for $71M",
    "BenchSci Raises $70M in Series D Funding",
    "predictive analytics in R&D goes hard https://twitter.com/...",
    "Twitch Increases Turbo Price by $3 in the US",
    "Ad-Free Twitch Turbo Subscriptions Are Getting Price Hikes Worldwide",
    "Twitch is raising prices for its ad-free Turbo service",
    "Alibaba Denies Recent Layoff Rumors",
    "Alibaba refutes job cut rumours, likely to hire 15,000 people this year",
    "US banking tech provider Nymbus bags $70m Series D funding",
    "Binance Launching NFT Loan Feature",
    "Binance Announces New Non-Fungible Token (NFT) Borrowing Program, Binance NFT Loan",
    "Binance enters the NFT lending market with loan service",
    "Binance NFT Debuts Ethereum Loans Backed by NFT Collateral",
    "Motorola Edge+ 2023 review: Boring design aside, this is a flagship worth considering",
    "These guys can't go a month without trying to knife each other [image]",
    "Confirmation & Research Note 1: Pegasus infections in Armenian Civil Society",
    "United Nations official and others in Armenia hacked by NSO Group spyware",
    "Researchers say they found spyware used in war for the first time",
    "‘Despicable’ iPhone Hacks In Armenia Find NSO Spyware ‘In Active Warzone’",
    "Apple alerted Pegasus spyware victims during first known use in a military conflict",
    "Armenia asks UN Court to order Azerbaijan to open the Lachin corridor",
    "Pegasus Spyware Is Detected in a War Zone for the First Time",
    "Pegasus spyware was deployed in Armenia amid Nagorno-Karabakh war",
    "Armenia/Azerbaijan: Pegasus spyware targeted Armenian public figures amid conflict",
    "Radio Free Europe/Radio Liberty",
    "Probe Reveals Dozens Targeted By Pegasus Spyware In Armenia, Including Two RFE/RL Journalists",
    "Azerbaijan Suspected in Hacking of Armenian Officials With Israeli NSO Spyware",
    "Researchers find Israeli-made spyware deployed across Armenia",
    "Starling Bank CEO to Step Down on June 30th after 10 Years in Charge",
    "Boss of Goldman-backed digital bank Starling to step down next month",
    "Anne Boden to step down as chief of Starling as bank reports record profits",
    "Starling Bank chief Anne Boden to step down amid record profit",
    "Anne Boden to step down as Starling chief executive",
    "Starling founder Anne Boden steps down",
    "Breaking: Anne Boden to step down as Starling Bank CEO, as bank reports record profits of £195m",
    "She going to YC too? https://twitter.com/...",
    "Working together with YouTube",
    "EU defends split with UK on Microsoft, Activision Blizzard bid",
    "The EU explains why it approved Microsoft's Activision Blizzard deal.",
    "Microsoft to lodge appeal against UK regulator's block of Activision deal - Sky News",
    "@sandofsky@mastodon.social",
    "Glitches, echoes and ‘melting the servers’ crash DeSantis' campaign launch on Twitter",
    "Twitter engineering boss quits after DeSantis launch glitches",
    "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’",
    "Elon Musk's Event With Ron DeSantis Exposes Twitter's Weaknesses",
    "Twitter is removing view count metrics from videos",
    "Elon Musk and Ron DeSantis' fiasco shows they didn't realize Twitter needs TV",
    "Twitter technical issues crash Ron DeSantis's 2024 campaign announcement",
    "Twitter's Flaws Snag Elon Musk's Media Ambitions",
    "What went wrong at Ron DeSantis's US presidential campaign launch?",
    "After flubbed Twitter rollout DeSantis' team talks strategy with donors",
    "U.S. Presidential Candidate Ramaswamy Takes Potshot at DeSantis Bitcoin Remark",
    "Governor DeSantis Reveals Plan To Safeguard Bitcoin And Other Crypto",
    "Twitter repeatedly crashes as DeSantis tries to make presidential announcement",
    "DeSantis Campaign Debut on Twitter Faces Technical Glitches",
    "Florida Gov. Ron DeSantis' presidential announcement on Twitter plagued by technical problems",
    "Ron DeSantis gambled on Elon Musk and went bust",
    "Ron DeSantis' Twitter Spaces Conversation With Elon Musk Kicks Off With Major Glitches",
    "Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point",
    "Twitter Spaces crashes repeatedly during DeSantis 2024 announcement",
    "Florida Gov. Ron DeSantis announces he's running for president in 2024",
    "Start of Ron DeSantis presidential campaign melts down in Twitter problems",
    "Elon Musk's Twitter Event With Ron DeSantis Hits Technical Issues",
    "Biden capitalizes on DeSantis Twitter Spaces failure",
    "Ron DeSantis Disastrous Presidential Announcement with Elon Musk, Servers Crash",
    "DeSantis Campaign Sputters to Launch as Twitter Spaces Livestream Crashes",
    "DeSantis' 2024 Announcement Delayed By Twitter Glitches",
    "DeSantis' Twitter Campaign Launch Was a Glitch-Filled Disaster",
    "Ron DeSantis ‘Disastrous’ 2024 Launch Marred by Twitter Glitches",
    "Twitter glitches disrupt Ron DeSantis' presidential run announcement",
    "Ron DeSantis Twitter Spaces Event Experiences ‘Rapid Unscheduled Disassembly’",
    "Biden trolls DeSantis over glitchy 2024 launch on Twitter Spaces",
    "Twitter crashes in Ron DeSantis U.S. presidential run announcement",
    "Elon Musk ushers in DeSantis's 2024 campaign, signaling a new era for Twitter",
    "@lauren@mastodon.laurenweinstein.org",
    "Sounds like DeSantis and Musk should have hosted their show on Truth Social servers.",
    "This link works: [Donate to reelect Joe Biden and Kamala Harris]",
    "I wonder if this is a DDOS attack",
    "We had more people join when I played Among Us 👾 https://twitter.com/...",
    "I'm running for president to lead our Great American Comeback. [video]",
    "It'd be like if the escalator had just stopped halfway down...",
    "What a small, grumpy claque of incels and whiners.",
    "Musk's talent for fucking over everyone he partners with is by far his most redeeming quality.",
    "everyone: wow, he shit his pants elon: yes, but everybody saw it [image]",
    "Today in “The important thing is that the rocket cleared the launchpad!” [image]",
    "10 million views. https://twitter.com/...",
    "Wait, I'm listening now. Is....is he...reading a speech into a Twitter Spaces? omg",
    "Ron DeSantis sitting somewhere in a swivel chair 10 out of 10 raging",
    "Ron DeSantis learning what happens when you launch things with Elon Musk [image]",
    "“Before you can be president, unmute yourself”",
    "https://twitter.com/... [image]",
    "If only there were some kind of audio/visual medium already installed in every American household.",
    "LOL. TFG https://twitter.com/...",
    "holy fucking shit, Ron DeSantis's campaign launch crashed and burned faster than a Tesla",
    "Launching my presidential campaign on ham radio",
    "The Jungle Cat, keeping it real. https://twitter.com/...",
    "BuzzFeed exploding the watermelon hit 820,000 concurrent viewers in 2016 https://twitter.com/...",
    "This is the full video of DeSantis with Hitler and the devil posted on Trump's Instagram [video]",
    "he just destroyed ron and elon [video]",
    "https://twitter.com/... [video]",
    "Ron DeSantis' campaign launch: [image]",
    "Man what https://twitter.com/... [image]",
    "one of the worst websites I've ever seen [image]",
    "can't believe this is how he announced [image]",
    "Against all odds we could actually have a funny campaign season [image]",
    "Trump was a political mastermind for his Twitter use, but DeSantis is “way too online.”",
    "Live look at Tucker Carlson, who decided to broadcast his new show on Twitter [image]",
    "All Presidential candidates are most welcome on this platform",
    "I think she might be leaving something out https://twitter.com/...",
    "Sean Spicer vibes here https://twitter.com/...",
    "Well you do want these things to be memorable. 🤷‍♂️ https://twitter.com/...",
    "Fantastic job all around https://twitter.com/...",
    "No advance prep? Idiot. https://twitter.com/...",
    "Ok now Joe from Scranton has entered the room with an epic dunk. https://twitter.com/...",
    "Biden is trolling Musk and DeSantis in real time. https://twitter.com/...",
    "PlayStation Showcase 2023 - Accessories Sneak Peek",
    "PlayStation Showcase recap: everything announced at today's show",
    "PlayStation's Handheld Project Q Reportedly Launching In November",
    "PlayStation confirm Project Q (PS5 Streaming screen/controller), to lukewarm reception",
    "Sony's Project Q PlayStation handheld streams PS5 games, reliant on wi-fi",
    "Project Q is the Wii U that Sony wants you to have in 2023",
    "PC games unveiled at PlayStation showcase: Alan Wake II, Metal Gear Solid 3 remake, Marathon, more",
    "Sony's ‘Project Q’ Handheld Streams PS5 Games, But Only When You're Home",
    "Sony's new Project Q handheld looks great, but I still miss my PSP",
    "PS5's Remote Play Portable Will Allegedly Launch in November",
    "PlayStation Handheld Project Q Will Launch In November - Report",
    "Sony unveiled a new Q handheld; Streams PS5 games",
    "Sony's PlayStation handheld reportedly arriving in November",
    "Sony's PS5 streaming Project Q handheld will launch this year",
    "PlayStation to release a new streaming handheld Project Q",
    "PlayStation Officially Unveils The Handheld Project Q",
    "Sony's making a new handheld to stream PS5 games",
    "Currently scheduled to release mid-late November 2023.",
    "Cannot wait to play Square Enix's Splatoon on my Sony Wii U [image]",
    "wii u did this 11 years ago and you all laughed https://twitter.com/...",
    "Microsoft says China-backed hacker targeted critical infrastructure in Guam, U.S.",
    "Microsoft warns alleged Chinese hacking group is targeting critical infrastructure",
    "Chinese state hackers infect critical infrastructure throughout the US and Guam",
    "Chinese hackers breach US critical infrastructure in stealthy attacks",
    "Chinese hackers behind Guam breach have been spying on US military for years",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "National Security Agency/Central Security Service",
    "China rejects claim it is spying on Western critical infrastructure",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?",
    "China hits back over Five Eyes blame for US infrastructure cyber attack",
    "Chinese hackers hit critical U.S. infrastructure, intelligence agencies warn",
    "Microsoft warns of Volt Typhoon, latest salvo in global cyberwar",
    "‘Stay vigilant,’ U.S. warns amid Chinese cyber espionage operation",
    "Chinese hacking campaign targeting US infrastructure: Microsoft report",
    "Five Eyes and Microsoft accuse China of attacking US infrastructure again"
]