[
    "Meta Quest 3 Coming This Fall + Lower Prices for Quest 2",
    "Introducing Meta Quest 3 | Coming This Fall",
    "Meta tries stealing Apple's headset thunder with Meta Quest 3 tease",
    "Mark Zuckerberg randomly unveiled the Meta Quest 3 just days before Apple unveils Reality Pro",
    "Meta's Zuckerberg unveils Quest 3 mixed reality headset",
    "Meta announces its Quest 3 VR headset, which will cost $499.99",
    "Meta Announces $500 Quest 3 Headset Just Ahead of Apple Launch",
    "Zuckerberg unveils Meta Quest 3 VR headset days before Apple reveals its own",
    "Meta officially announces the Quest 3 VR headset",
    "Mark Zuckerberg Introduces Meta Quest 3 VR Headset",
    "Meta Announces Quest 3 Ahead of Apple's Rumored AR/VR Headset",
    "Meta's Connect 2023 event is set for September 27th",
    "Meta Quest 3: Everything you need to know",
    "Quest 3 is Launching with Its Own New Controllers, But Will Also Support Touch Pro",
    "Meta Quest 3 Ships This Fall, Starting At $500",
    "Mark Zuckerberg unveils $500 Meta Quest 3 launching this fall",
    "Meta Quest 3 announced just ahead of Apple headset launch",
    "Meta's brand new Quest 3 headset will cost $499 and launch this fall",
    "The Meta Quest 3 is thinner, faster, and pricier at $500",
    "Meta's $499 Quest 3 headset arrives this fall",
    "Meta Unveils Quest 3 Ahead of Apple's VR Headset News",
    "The Meta Quest 3 is a $499 mixed reality headset with full-color passthrough",
    "Meta Quest 3 announced, coming later this year for $499",
    "Meta Quest 3 unveiled in official teaser",
    "Meta Quest 3 gets a surprise reveal to beat Apple to the VR punch, due this fall for $499.99",
    "Quest 3 reveal just snatched the Apple VR headset's spotlight — 3 new features you'll love",
    "Meta Quest 3 revealed — just in time to steal Apple's VR thunder",
    "Meta announces its $499 Quest 3 mixed reality headset",
    "Meta Quest 3 out this autumn as Metal Quest 2 gets price cut and speed boost",
    "Meta Quest 3 announced for $499 with 40% lighter design and mixed reality features",
    "Meta Quest 3 Unveiled Days Before the Apple AR Headset; Out This Fall for $499",
    "Meta Quest 3 vs Meta Quest 2: Will the upgrade be worth it?",
    "Meta Quest 3 VR Headset: Price, Specs, Release Date",
    "Meta Announces Quest 3 VR and Mixed-Reality Headset, Starting at $500",
    "Zuckerberg panics, Osborne Effects Meta with rushed ‘Quest 3’ headset reveal",
    "Meta Quest 3 Serves Up Wireless Mixed Reality At A $499 Price Point",
    "Meta Officially Announces the Quest 3",
    "Meta Quest 3 is official, $499, and arriving this autumn",
    "The Quest 3 has finally been unveiled and it's glorious",
    "Quest 2 and Quest Pro Price Drops Coming, Plus Software Upgrades",
    "The Meta Quest 3 Has Been Officially Revealed With A Sleek New Look And Colour Passthrough",
    "Meta unveils new virtual reality device ahead of Apple headset launch",
    "Meta Announces Autumn 2023 Launch for Quest 3 VR and MR Headset",
    "Meta steals some Apple thunder with unveiling of next-generation headset",
    "Meta Officially Launched their new Wireless Quest 3 VR/MR Headset this morning starting at $499",
    "Meta Quest 3 coming this fall with lot of improvements for $499",
    "Meta unveils the Oculus Quest 3 VR headset, its ‘most powerful headset yet’",
    "Meta Quest 3 Launches This Fall, Price Starts At $500",
    "Meta Quest 3 is official, but Apple is waiting in the wings",
    "Meta announces Quest 3 VR headset",
    "Best thing about this is how ridiculous it makes their own Quest Pro look",
    "Meta Quest 3 behind the scenes - via Zuck's Instagram [video]",
    "haha! they're so scared https://twitter.com/...",
    "No reason behind this choice I'm sure https://twitter.com/...",
    "sorta reminds me of maelstrom gang faces in cyberpunk... [image]",
    "Meta spoiler ahead of Monday... https://www.meta.com/...",
    "Quest 3. The VR headsets are coming fast and furious now. https://www.cnet.com/...",
    "Introducing Meta Quest 3.  The first mainstream headset with high-res color mixed reality. …",
    "Meta Quest 2 is going back to its original $299 price",
    "Quest 2 and Quest Pro Getting a Big Performance Boost with Upcoming Software Update",
    "Meta finally unveiled the Meta Quest 3 VR set and price point",
    "Quest 2 has a new lower price and is getting a 26% performance upgrade",
    "Meta Quest 3 announced alongside Quest 2 price cuts",
    "Meta Quest 2 Price Drop, Performance Upgrade Incoming This Month",
    "Meta lowering the price of Quest 2 to $299.99 USD",
    "And Quest 2 is now back to $299.99!",
    "Report: Apple is Testing New Desktop Macs With M2 Max and M2 Ultra Chips",
    "M2 Max and M2 Ultra Macs pop up in Apple's testing logs as WWDC23 nears",
    "Apple reportedly testing new Macs and new M2 Ultra chip ahead of WWDC 2023",
    "Refreshed Mac Studio with all-new M2 Ultra could launch next week",
    "Whatever you do, don't buy a Mac today",
    "Forget the VR headset - Apple WWDC 2023 could be a dream come true for Mac fans",
    "Apple likely testing the next Mac Studio with M2 Max and unreleased M2 Ultra",
    "Apple to Launch a Full Size Mac with a Speedy M2 Ultra Chip",
    "Is this confirmation of the Mac Pro coming at WWDC?",
    "Apple might launch some very powerful Macs at WWDC",
    "Apple could announce its most powerful chip yet at WWDC 2023",
    "New high-end Macs with M2 Max and Ultra chips could debut at WWDC23",
    "Apple preps new high-end M2 Max and M2 Ultra Macs ahead of WWDC",
    "Last-minute rumor suggests Apple testing high-end M2 Max & M2 Ultra Macs ahead of WWDC",
    "Apple rumored to announce new Mac Studio at WWDC, Mac Pro's future uncertain",
    "Ahead of WWDC23, Apple is Testing new High-End Macs with M2 Ultra Processors and more",
    "Apple is reportedly testing high-end Macs powered by its new M2 chips",
    "Apple is testing M2 Max and M2 Ultra Macs just before WWDC",
    "Apple preps first Mac with M2 Ultra chip and M2 Max desktop ahead of WWDC",
    "Apple Tests High-End Mac Desktops Ahead of WWDC: Report",
    "Two new Macs with M2 Max & M2 Ultra being tested ahead of WWDC",
    "Apple is Testing New M2 Max and M2 Ultra Macs Ahead of WWDC [Report]",
    "Apple might announce ‘several’ Macs at WWDC",
    "Why Android Owners Switch to iPhone",
    "Google has bigger problems than iMessage making Android users switch to iPhone",
    "Why users are switching from Android to iOS? Here is the answer",
    "Here's why Android users jump ship to the iPhone",
    "Survey Results on Why Android Users Switch to iPhone",
    "U.S. District Court, Western District of Washington",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Thirty Thousand Amazon Workers Could Access Alexa Data, FTC Says",
    "Amazon must pay over $30 million over claims it invaded privacy with Ring and Alexa",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "FTC Smacks Amazon for Alexa and Ring Privacy, Security Failures",
    "The Download: clean energy investments, and Amazon's data privacy fine",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "Amazon Fined $25 Million for Deceiving Parents, Violating Child Privacy Law",
    "Amazon fined $25 million by FTC for child privacy violations involving Alexa",
    "FTC charges Amazon with privacy violations over Alexa and Ring cameras",
    "Amazon Fined $25M in Child Privacy Case",
    "Amazon to pay $25M fine for keeping kids' data through Alexa",
    "Amazon to Pay $31m After FTC's Security and Privacy Allegations",
    "Amazon Settles Complaints Over Ring Surveillance, Use of Children's Voice Recordings",
    "Amazon settles with FTC for $25M after ‘flouting’ kids' privacy and deletion requests",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "FTC fines Amazon $25M for violating children's privacy with Alexa",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon to pay $25m over child privacy violations",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "U.S. District Court, District of Columbia",
    "Amazon to pay over $30 million for Ring and Alexa privacy violations",
    "Ring camera privacy breaches see Amazon fined - but only $6M",
    "Amazon's Ring doorbell was used to spy on customers, FTC says in privacy case",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Federal Trade Commission v. Ring LLC",
    "Ring's Response to Our Recent Settlement With the FTC",
    "FTC charges Ring over ‘disregard’ for customer data security",
    "Amazon to pay $30.8M for Alexa and Ring privacy violations",
    "Amazon fined $30 million for Alexa, Ring privacy violations",
    "Amazon fined $31 million over privacy breaches, including snooping on kids",
    "Amazon settles Alexa and Ring privacy violations for $30 million",
    "Amazon Settles Ring Customer Spying Complaint",
    "Amazon settles for $30M in response to Ring and Alexa data privacy violations",
    "Amazon to pay over $30 million to settle FTC privacy violation lawsuits",
    "Amazon to Pay $5.8 Million for Spying on Customers Through Their Ring Cameras",
    "Amazon's Ring used to spy on customers, FTC says",
    "Amazon will pay more than $30M for Alexa and Ring privacy violation allegations",
    "Amazon to pay $30.8m to settle FTC privacy claims",
    "Amazon to pay $30M in FTC settlements over Alexa, Ring privacy violations",
    "How to be sure your home security isn't spying on you",
    "Amazon will pay more than $30M to settle FTC complaints over Alexa and Ring privacy issues",
    "Instagram Ranking Explained",
    "Instagram attempts to explain ‘shadowbanning’, but creators still aren't happy",
    "Instagram CEO Adam Mosseri explains how the app recommends the content you see",
    "Here's how Instagram recommends the content you see",
    "Instagram Shares New Explainer on How its Feed, Reels and Stories Algorithms Work",
    "Instagram Further Explains How It Recommends the Content You See",
    "Instagram explains its recommendations and ‘shadowbanning’",
    "Official: Current Instagram algorithm explained",
    "Instagram rankings get explained, CEO addresses ‘shadowbanning’",
    "Instagram testing new personalisation control for users, transparency tools for creators",
    "Instagram has revealed how its ranking algorithm works",
    "How The Instagram Algorithm Works For Stories, Feed, Reels, And Explore",
    "Did Microsoft's “hands off” approach set the stage for Redfall's demise?",
    "New report reveals more from inside Redfall's troubled development",
    "Report: Some Arkane staff hoped Microsoft acquisition would kill Redfall﻿",
    "Report: Arkane Hoped Microsoft Would Cancel Or Reboot ‘Redfall’",
    "Redfall's Development Was Reportedly So Troubled That Devs Hoped Microsoft Would Cancel It",
    "Redfall devs wanted Xbox to cancel game over rough state: report",
    "Redfall's Rocky Development Caused Arkane To Lose 70% Of Prey's Dev Team - Report",
    "Many Redfall Devs Wanted Microsoft to Cancel the Game",
    "Redfall Developers Reportedly Hoped Microsoft Would Cancel The Game",
    "Redfall Staff Hoped Microsoft Would Cancel or Reboot the Game, MTX Scrapped in 2021 - Rumor",
    "Redfall suffered unclear direction during development, new report suggests",
    "Redfall devs reportedly hoped it would be cancelled or rebooted by Microsoft",
    "Redfall devs reportedly didn't actually want to make the game",
    "Arkane Staff Reportedly Hoped Microsoft Would Cancel Redfall",
    "Redfall Development Was Reportedly Plagued by Understaffing and Confusing Direction",
    "Report: Redfall Playtesters ‘Shocked’ At How Little The Game Changed During Development",
    "Report: Xbox Exclusive Redfall Suffered From Few Resources, Poor Direction",
    "What went wrong with Redfall.",
    "International Business Times",
    "Improving mathematical reasoning with process supervision",
    "OpenAI takes on AI ‘hallucinations’ with new training techniques",
    "OpenAI Research Details Breakthrough in Preventing Fake Info from LLM Generative AI",
    "OpenAI is trying to stop ‘AI hallucinations’ where ChatGPT just makes stuff up",
    "OpenAI: New Process-Supervised Reward Modeling Improves AI Reasoning",
    "Here's how OpenAI plans to cleanse ChatGPT of false information",
    "OpenAI Announces New Approach To Fight AI ‘Hallucinations’ After Legal Fabrications",
    "OpenAI develops LLM that uses a chain of thought like humans",
    "Process supervision makes intuitive sense too! https://twitter.com/...",
    "Access to models → Alignment progress https://twitter.com/...",
    "It's about the journey and not about the destination they say... https://openai.com/...",
    "Real child murder victims recreated by AI in sick true-crime TikTok trend",
    "Elon Doesn't Tweet for 2 Days, Regains Status as World's Richest Man",
    "Elon Musk's whirlwind China trip included talks with vice premier",
    "Elon Musk asked to boost investment in Shanghai by China's top party official",
    "Elon Musk wrapped up his first visit to China in years. Here's what the Tesla CEO was up to",
    "Now I know who's getting my next invite code 🙃",
    "38 astronauts to orbit so far! https://twitter.com/...",
    "Elon Musk fully complying with local laws and regulations! https://www.bloomberg.com/...",
    "So this raises the question - should Elon Musk stay in China .... https://twitter.com/...",
    "Multichain Can't Find Its CEO as Company Loses Access to Its Servers",
    "Multichain halts some services as CEO is AWOL",
    "Multichain team cannot locate CEO, halts service for affected chains",
    "Crypto Bridging Protocol Multichain ‘Unable to Contact’ CEO Zhaojun",
    "Crypto token MULTI crashes as Multichain confirms CEO missing",
    "Multichain (MULTI) team locked out as CEO goes missing",
    "Multichain unable to contact CEO, has no access to project servers",
    "Breaking: Multichain Suspends Cross-Chain Services, Fails To Contact CEO",
    "What happened to being permissionless and decentralized? https://twitter.com/...",
    "PKI at its finest. One man has the private 🔑 everyone else... not so much https://twitter.com/...",
    "interesting, ceo is gone $multi https://www.theblock.co/... [image]",
    "I don't know a single chain mentioned in this tweet https://twitter.com/...",
    "Multichain team says it can't contact CEO amid protocol problems https://www.theblock.co/...",
    "It would be funny if Elon Musk's Twitter has “gone woke” in an attempt to avoid “going broke”",
    "Whoaaaaaa not good, hope @elonmusk rectifies this immediately https://twitter.com/...",
    "rare twitter W https://twitter.com/...",
    "Facts don't care about your feelings https://twitter.com/...",
    "increasingly rare Twitter W https://twitter.com/...",
    "no one is falling for this publicity stunt right https://twitter.com/...",
    "Amazon employees stage walkout over return-to-office mandate, climate goals, and layoffs",
    "Amazon Workers Walk Out to Protest Climate, Office Return Policy",
    "Silicon Valley Business Journal",
    "Amazon employees stage walkout over frustrations with leadership",
    "Amazon workers walk out to protest return to office mandates",
    "Amazon corporate workers stage walkout at Seattle headquarters",
    "Gotta love a good white collar walkout. https://twitter.com/...",
    "Messages in the crowd at the Amazon walkout in Seattle. [image]",
    "BeReal Tries to Keep the Buzz Up With New Instagram-esque Chat Feature",
    "BeReal is testing a direct messaging feature called RealChat",
    "BeReal unveils RealChat: a new instant messaging feature",
    "BeReal is adding DMs to try and keep you in the app longer",
    "BeReal Launches RealChat, Its New Messaging Feature",
    "Tether USD₮ Reaches All-Time High, Surpasses Previous Market Cap High of $83.2B",
    "Tether reaches record as jittery crypto investors flock to stability",
    "Tether's USDT Market Cap Surpasses All-Time High Of $83.2 Billion Amid Surging Crypto Adoption",
    "Tether (USDT) Hit New Market Cap ATH as Adoption Grows",
    "Tether Achieves New Milestone with Record-Breaking Market Cap",
    "Tether's USDT sets new all-time high in spite of regulatory concerns",
    "Good job! https://twitter.com/...",
    "Developers of third-party Reddit apps fear shutdown because of API pricing changes",
    "📣 Had a call with Reddit to discuss pricing. …",
    "Reddit's API pricing results in shocking $20 million-a-year bill for Apollo",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Death By API: Reddit Joins Twitter In Pricing Out Apps",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Like Twitter, Reddit Appears to Hate 3rd-Party Apps and Wants to Price Them Out of Existence",
    "Reddit looks set to kill third-party clients with multimillion dollar fees",
    "Reddit will charge 3rd-party companies millions for API access",
    "Reddit's new API pricing could kill its most popular app with a $20 million bill",
    "Reddit follows Twitter in killing off good apps with monstrous fees",
    "Reddit's doing a Twitter and killing off your favourite apps",
    "Your favorite Reddit app might soon stop working",
    "Reddit could kill my favorite app — and that's a problem for everyone",
    "Reddit Joins Twitter In Squeezing Devs With Unreasonable Fees",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "The best Reddit client app is in danger due to price demands",
    "Reddit price increases threaten popular Apollo app",
    "Reddit wants to kill third-party Reddit apps and Apollo could be one of them",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Proposed changes to Reddit API could mean the end of third-party apps like Apollo",
    "The attack on third-party social client apps continues https://twitter.com/...",
    "bro is there even gonna be any of the Old Internet left by the end of 2023 https://twitter.com/...",
    "API Extortion Era https://twitter.com/...",
    "‘A Total Nightmare’: Transfer Delays With New Apple-Goldman Savings Accounts Prompt Complaints",
    "Some Apple Savings account customers see delayed withdrawals from Goldman Sachs",
    "Tim Bankman Cook? Is that you? https://twitter.com/...",
    "Introducing the Leap Motion Controller 2 from Ultraleap",
    "Ultraleap launches Leap Motion Controller 2",
    "Ultraleap launches second generation of iconic hand tracking camera - Leap Motion Controller 2",
    "Ultraleap launches 2nd gen of its hand tracking camera with the Leap Motion Controller 2",
    "Leap Motion's gesture control quest continues with the Leap Motion Controller 2",
    "Free compensation benchmarking data from 3,000 startups",
    "Spinoza ground lenses so ASML could vaporise... https://twitter.com/...",
    "India Semiconductor Mission",
    "Amid Geopolitical Gale, Taiwan's Chipmakers Chart New Course",
    "I don't see why this is a compelling use case for AI https://www.bloomberg.com/... [image]",
    "Personalized wealth management, built for tech people",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Stripe: Help us build universal payments.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "06/01 - Meta Front-Runs The Quest 3",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Match Group debuts Archer, a new face-first gay dating app for men",
    "Match Group's ‘Archer’ App Wants to Offer Gay Men So Many Targets They Can't Miss",
    "NEW SOCIAL-FIRST DATING APP “ARCHER” LAUNCHES FOR GAY, BISEXUAL, AND QUEER MEN",
    "Archer is the new ‘social-first’ dating app for queer men",
    "Pixxel Raises $36M in Series B Funding",
    "Spacetech startup Pixxel raises $36 million in funding from Google, others",
    "Google joins spacetech startup Pixxel's $36 Mn Series B round",
    "Google leads funding round for Indian space startup Pixxel",
    "Google backs Indian spacetech startup Pixxel in $36m Series B round",
    "Spacetech Startup Pixxel Bags $36 Mn Funding From Google, Others",
    "Pixxel Finds $36M For Hyperspectral Satellites",
    "C3.ai shares slide as revenue forecast fails to live up to AI hype",
    "C3.ai Stock Dives. It Must Find Its Place In the AI Ecosystem, Like Nvidia.",
    "Oppo MR headset announced just days before Reality Pro - but only for developers",
    "Apple's XR Headset Is Coming - What We Know So Far",
    "Oppo introduced a new MR glass partnered with Qualcomm in China",
    "Oppo MR Glass developer headset announced with Snapdragon XR2+ chipset",
    "GetYourGuide raises $194 million to fuel curated travel experiences and global expansion",
    "Xonai looks to reduce cloud bills by optimizing data infrastructure",
    "Bringing AI to the Data Center",
    "Capillary Technologies Pockets $45 Mn In Series D Funding",
    "Capillary raises $45 Mn from Avataar Ventures and others",
    "Capillary Technologies raises $45 million to fuel acquisitions and expansion",
    "SaaS startup Capillary Technologies secures $45M from Avataar Ventures, others",
    "After Deferring IPO Plan, Capillary Bags $45 Mn Funding From Avataar Ventures And Its LPs",
    "Amazon Implementing AI Solution to Spot Damaged Items Before Shipping",
    "Amazon is using AI in its warehouses to spot damaged items.",
    "Damn the Amazon AI just identified me as damaged goods :(",
    "Cortex Raises $35M in Series B Funding",
    "A new standard for Internal Developer Portals - Putting our new Series B financing to work",
    "Cortex Applications raises $35M to bring visibility into microservices quality",
    "Measurabl gathers $93m to boost real estate ESG platform growth",
    "Measurabl, an ESG platform for real estate, raises $93M",
    "Proptech Firm Measurabl Closes $93 Million Series D Raise",
    "Measurabl raises $93M Series D for real estate ESG",
    "Measurabl Raises $93M in Series D Funding",
    "Photonic computing company Lightmatter raises $154m",
    "Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "Okta and CrowdStrike shares plunge on broader macroeconomic concerns",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "Salesforce posts slowest quarterly revenue growth since 2010",
    "CRM giant Salesforce's focus on margins sees sales growth slip",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Salesforce delivers to expectations but contract delays and rising capital costs weigh on stock",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Google's Communications Chief to Depart",
    "Says a lot about where Google is right now. https://twitter.com/...",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Apple says the App Store is a $1.1 trillion business",
    "Apple's App Store generates $1.1 tn in revenue for devs in 2022: Study",
    "Apple's App Store tipped the scales at $1.1 trillion in sales in 2022",
    "Apple touts App Store facilitated $1.1 trillion in developer sales in 2022",
    "Citing facts, Apple denies the ‘Apple tax’ hype",
    "Apple App Store Commerce Climbed 29% Last Year to $1.1 Trillion",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means"
]