[
    "SEC Chair Gensler Offered to Serve as Binance Advisor in 2019, Lawyers Claim",
    "Binance Says Gensler Once Offered to Be an ‘Informal Advisor’",
    "SEC's Gensler offered to serve as an adviser to Binance in 2019: Lawyers claim",
    "‘Talk to your lawyer’: Coinbase CEO recounts ‘icy’ meeting with SEC Chair Gensler",
    "Gary Gensler and Binance's Connection Dates Way Back; Here's How",
    "Binance wants SEC chair Gary Gensler recused for ‘advising’ the crypto exchange",
    "SEC's Gensler offered to advise Binance in 2019, lawyers claim",
    "Binance Puts SEC Chair Gensler In Hot Water, Will It Affect The Lawsuit?",
    "Binance's Counsel: SEC Chair Gensler Offered To Serve As An Informal Advisor In 2019",
    "Binance Lawyers Claim Gensler Offered to be Company Advisor",
    "Binance Lawyers Claim SEC Chair Gensler Offered to Advise Crypto Company in 2019",
    "Gary Gensler had close ties to Binance's CZ, offered to serve as exchange advisor: lawyers",
    "US SEC Chair Gary Gensler Allegedly Offered To Work For Binance, Will This Affect Binance Lawsuit?",
    "Wow Binance lawyers allege SEC Chair Gensler offered to serve as advisor to crypto company in 2019",
    "The plot thickens 👀 [image]",
    "GARY GENSLER AFTER BINANCE DID NOT HIRE HIM LOL [image]",
    "Binance should share Gary Gensler's resume, would love to see his listed hobbies.",
    "Binance Redirected $12B to Firms Controlled by CEO Changpeng Zhao, SEC Says",
    "Elizabeth Warren Says Binance Appears to Have Lied to Lawmakers",
    "Binance Money Trail Reveals $70 Billion Flowing Through Silvergate, Signature",
    "Binance Moved Billions Through Two U.S. Banks, Regulators Say",
    "SEC says Binance funnelled $12bn in funds, Coinbase CEO won't delist tokens",
    "Here is everything the SEC has on Binance.US -Is the ex-CEO a sell-out?",
    "Binance Under Spotlight: $70 Billion Transactions Traced Back to Silvergate, Signature",
    "Former Binance.US CEO Brian Brooks Says CZ Was in Charge of the Exchange, Not Him",
    "Binance CEO's trading firm received $11 billion via client deposit company: US SEC",
    "Statement from Paxos spox: https://twitter.com/... [image]",
    "Changpeng Zhao Ran BAM Trading, Says Former Binance.US CEO",
    "Her name was Catherine Coley",
    "Catherine Coley has entered the chat https://twitter.com/...",
    "🤔 I wonder if Catherine Coley was an informant? https://www.cnbc.com/...",
    "United States District Court for the District of Columbia",
    "SEC granted emergency restraining order to freeze, repatriate Binance.US assets",
    "Binance US Delists 101 Trading Pairs Following SEC Freezing Order",
    "Binance.US Pulls Several Trading Pairs in Wake of SEC Lawsuit",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "SEC files motion for restraining order to freeze Binance US assets",
    "[DB] SEC Seeks Temporary Restraining Order to Freeze Binance US Assets: Court Filing",
    "OMG OMG OMG OMG OMG [image]",
    "All users outside of the USA unaffected then 👍🏻 https://twitter.com/...",
    "Withdraw from Binance US if you have any funds on the platform. https://twitter.com/...",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "A closer look at Apple's Vision Pro keyboard and other controls",
    "Apple's Vision Pro is the Retina display moment for headsets",
    "I Used Apple's Vision Pro and It's Absolutely Mind-Blowingly Impressive",
    "Apple's Vision Pro & Meta's Vision Oh No",
    "Apple Shows How You Enter Text On Vision Pro",
    "What it's like to try Apple's new Vision Pro headset",
    "My First Immersion in Apple Vision Pro: Heavy, Man!",
    "I tried the Apple Vision Pro. I was lost for words",
    "Apple Vision Pro looks great but motion controllers would make it so much better",
    "MacRumors video: Trying the Apple Vision Pro headset",
    "We tried the Apple Vision Pro: it's a revolutionary device",
    "I tried Apple's $3,500 Vision Pro glasses and it's not the experience I was expecting",
    "'It's the future of computing': we try Apple's US$3,499 Vision Pro headset",
    "Apple Vision Pro: Our First Thoughts After Trying the Innovative New Headset",
    "‘I saw the future. It left me in tears’",
    "What does the Apple Vision Pro do? Here's everything you need to know after WWDC reveal.",
    "Apple Vision Pro: A Game Changer?",
    "Video: Trying the Apple Vision Pro Headset",
    "I wasn't expecting Apple's Vision headset to blow my mind. It did.",
    "My first encounter with Apple Vision Pro completely changed by opinion on VR",
    "I tried Apple Vision Pro and it's far ahead of where I expected",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Hands-on: The Apple Vision Pro is best AR and VR experience I've ever tried (and I've tried many)",
    "Apple's Vision Pro experience is so thrilling, I didn't want to leave",
    "Something tells me that Apple Vision Pro is still a VR headset 🤔 [video]",
    "I forgot. - iPad: best-selling tablet in the world",
    "Whoever makes something in between these two extremes wins tbh [image]",
    "Cynics should read this post on the Apple Vision Pro: https://daringfireball.net/...",
    "Branded Content Guidelines",
    "Twitch scraps ad changes after streamers leave platform",
    "Twitch u-turns after outcry at new branded content guidelines",
    "Twitch rolls back controversial ad guidelines after outcry from creators",
    "Streamer outrage forces Twitch to drop planned changes to branded ad rules",
    "Twitch Nixes Branded-Content Rule Changes After Backlash",
    "Twitch backtracks on branded content changes after streamer backlash",
    "Twitch ‘immediately removing’ controversial branded content guidelines within 24 hours",
    "Twitch has removed their new ad guidelines after streamers threatened to leave platform",
    "Twitch Abandons Bad Ad Changes After Streamer Freak Out",
    "You can read our updated Branded Content Policy here: https://help.twitch.tv/...",
    "This company confuses me https://twitter.com/...",
    "Bard is getting better at logic and reasoning",
    "Google's AI chatbot ‘Bard’ is improving at math and programming",
    "Learn-to-Code-Better-with-ChatGPT-Six- Tips-to-Get-Started  —  Here are six tips to get started …",
    "Google Bard AI improved for coding tasks and now can export tables to Google Sheets",
    "Google brings superior logic and reasoning skills to its chatbot Bard",
    "Google's AI Chatbot, Bard, Advances its Logical and Mathematical Capabilities",
    "Google takes Bard to summer school with new math and coding smarts",
    "Google Bard Improved with Implicit Code Execution, Sheets Export",
    "Bard update improves reasoning skills, enables Google Sheets export function",
    "Google's Bard AI is getting better at programming",
    "the 8-month tweet-to-google-release R&D pipeline [image]",
    "Faster sorting algorithms discovered using deep reinforcement learning",
    "AlphaDev discovers faster sorting algorithms",
    "Deepmind's AI Is Learning About the Art of Coding",
    "Deepmind's AlphaDev discovers sorting algorithms that can revolutionize computing foundations",
    "AI system devises first optimizations to sorting code in over a decade",
    "DeepMind made its AI name in games. Now it's playing with the foundations of computing",
    "Google DeepMind Unveils AI System to Discover Faster Algorithms",
    "DeepMind AI's new way to sort objects could speed up global computing",
    "DeepMind repurposes game-playing AIs to optimize code and infrastructure",
    "Really good article in @WIRED about #AlphaDev! https://www.wired.com/...",
    "I'm shocked Nature published this. https://www.nature.com/...",
    "Great progress with #Alphadev from Google Deepmind! https://twitter.com/...",
    "Introducing WhatsApp Channels",
    "Introducing WhatsApp Channels. A Private Way to Follow What Matters",
    "WhatsApp Channels feature might be attempt to become the new Twitter",
    "WhatsApp's new feature makes it more like social media than ever before",
    "WhatsApp introduces Channels, a private way to send and receive broadcasts",
    "WhatsApp Announces One-Way Broadcast ‘Channels’ for Following People and Organizations",
    "WhatsApp adds Telegram-like Channels for one-way broadcasting",
    "Meta introduces broadcast tool Channels on WhatsApp",
    "WhatsApp's new Channels feature lets accounts send one-way updates to followers",
    "Meta to debut new Channels broadcasting tool for WhatsApp",
    "WhatsApp announces ‘Channels’, one-way tool to share updates with followers",
    "WhatsApp Adds Channels Where You Can Follow Teams, People, Groups",
    "WhatsApp's latest feature makes it more like Telegram",
    "WhatsApp launches Channels feature for broadcast messages",
    "WhatsApp's new Channels feature brings Twitter's feed to the messaging app",
    "WhatsApp steals another big feature from Telegram",
    "WhatsApp officially presents channels: here's how they work",
    "WhatsApp wants you to build a business around its new Channels feature",
    "WhatsApp Channels feature starts rolling out: What it is, 30-day expiry, admin controls and more",
    "WhatsApp introduces Channels, calls it a private way to follow what matters",
    "WhatsApp adding Twitter-like ability to follow with new ‘channels’ feature",
    "WhatsApp rolls out Channels in Singapore",
    "Meta announces Channels for WhatsApp: Here's everything you need to know about it",
    "WhatsApp announced channels, a new one-way broadcast private tool",
    "WhatsApp introduces Channels: what is it, how it works",
    "WhatsApp introduces Channels, a private way to receive updates from people and organizations",
    "WhatsApp debuts one-to-many broadcasting ‘Channels’",
    "Today we're announcing WhatsApp Channels — a private way to follow people and organizations …",
    "Financial Conduct Authority",
    "BEUC acts against social media platforms for facilitating misleading crypto asset promotion",
    "Crypto ads will need to carry risk warnings under new UK rules",
    "Crypto ads face stricter rules including a referral bonus ban by FCA",
    "UK to curb crypto advertising with ‘cooling off’ periods, risk warnings",
    "FCA cracks down on crypto advertising",
    "UK FCA Unveils Stricter Rules For Crypto Marketing",
    "FCA introduces tough new rules for marketing cryptoassets",
    "FCA's new crypto advertising rules met with mixed industry response",
    "FCA to require ‘risk warnings’ on crypto as UK tightens regulation",
    "UK Financial Conduct Authority Introduces New Marketing Rules for Crypto",
    "UK Financial Watchdog Tightens Rules for Cryptoasset Marketing",
    "GC23/1 Cryptoasset financial promotions: Guidance for firms",
    "New UK regulations mandate crypto ads to carry risk warnings",
    "UK Regulator's New Crypto Rules Include ‘Cooling-off Period’ for Investors",
    "FCA to roll out stricter rules for crypto ads including referral bonus ban",
    "UK to enforce crypto ‘cooling-off period’ in major crackdown",
    "Google to crack down on office attendance, asks remote workers to reconsider",
    "Google tightens back-to-office policy by making attendance part of performance reviews",
    "Google really doesn't want its employees to work from home anymore",
    "To fill offices, Google issues ultimatum while Salesforce tries charity",
    "Unfortunately this is going to set a bad precedent.  Watch other companies follow this pattern :-(",
    "The Download: carbon-capturing super trees, and DeepMind's sorting breakthrough",
    "Rebranded Sequoia India said to be opening US office in H2 this year",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Amazon Prime Video is reportedly planning an ad-supported tier",
    "Ad-Supported Amazon Prime Video Tier May Not Be Any Cheaper",
    "Amazon plans to add an ad-supported tier to Prime Video",
    "Report: Amazon considering adding Ads to Prime Video",
    "Amazon reportedly plans ad-supported tier for Prime Video",
    "Amazon considering Prime Video ads",
    "Amazon Reportedly Plans to Introduce Ad Tier for Prime Video Streaming Service",
    "Amazon Prime Video Planning To Join Ad-Supported Wave",
    "Amazon reportedly considering ad-supported tier for Prime Video",
    "The Real CNN Drama is Cable News' Growing Irrelevance",
    "Asia Markets Set to Slide Further as Wall Street Pauses Market Rally",
    "Amazon Reportedly Plots Ad-Supported Tier For Prime Video",
    "Amazon is considering an ad-supported tier for Prime Video",
    "Amazon Prime Video is reportedly working on an ad supported tier",
    "Amazon is reportedly working on cheaper Prime Video with ads — what we know so far",
    "Amazon leads declines in discretionary sector, streaming companies outperform",
    "Report: Amazon may bring ad-supported tier to Prime Video",
    "Amazon is reportedly planning an ad-supported tier for Prime Video",
    "Report: Amazon Considering Ad-Supported Tier for Prime Video",
    "Every streaming network be like “what if we invented... television” https://twitter.com/...",
    "Everything is an ad network. https://www.wsj.com/...",
    "UK to host first global summit on Artificial Intelligence",
    "UK's AI safety summit gets thumbs up from tech giants",
    "UK not too small to be centre of AI regulation, says Rishi Sunak",
    "UK to host global AI summit",
    "Sunak Seeks Biden's Backing on AI After UK Left Out of Key Talks",
    "UK to host first global summit to stop Terminator AI",
    "UK to host world's first AI summit: PM Sunak",
    "Britain to host first global summit on artificial intelligence safety",
    "UK to host global AI ‘safety measure’ summit in autumn",
    "Britain to host first global AI regulation summit in autumn",
    "GameStop CEO terminated as retailer posts further losses",
    "GameStop ousts CEO after recording $50.5 million quarterly net loss",
    "GameStop (GME) stock: Is a massive sell-off looming on the horizon?",
    "GameStop fires CEO, names Ryan Cohen executive chairman",
    "GameStop Turns to Ryan Cohen. But the Meme-Stock's Recovery Looks Unlikely.",
    "GameStop Shares Fall as It Terminates CEO and Ryan Cohen Becomes Executive Chairman",
    "GameStop Just Fired Its CEO and Named Ryan Cohen Executive Chairman",
    "GameStop Fires CEO After Only Two Years",
    "Gamestop CEO “Matt Furlong” Fired & Replaced",
    "GameStop Announces Election of Ryan Cohen as Executive Chairman",
    "GameStop Fires CEO As Meme Stock Plummets",
    "GameStop Discloses First Quarter 2023 Results",
    "Video game retailer GameStop ousts CEO Matt Furlong, elevates Ryan Cohen amid falling sales",
    "GameStop fires CEO Matt Furlong months after axing crypto push",
    "CEO at GameStop is out; stock tumbles 20%",
    "GameStop Removes CEO and Elects Ryan Cohen Executive Chairman",
    "GameStop Fires CEO Who Oversaw Retailer's NFT Push",
    "GameStop Fires Its CEO After Two Years",
    "GameStop fires CEO, names Ryan Cohen exec chair",
    "Reddit relents, makes first concession in its plans to impair third-party apps",
    "Reddit now says it will allow free API access for developers of accessibility apps",
    "Reddit users, subreddits going dark next week over third-party app access",
    "Reddit says some accessibility apps won't have to pay for its API",
    "Reddit to cut five percent of staff and faces user backlash over API fees",
    "Reddit insists on being “fairly paid” amid API price protest plans, layoffs",
    "SK hynix Begins Mass Production of Industry's Highest 238-Layer 4D NAND",
    "SK hynix begins mass production of industry's highest-layer-count NAND chips",
    "SK hynix Commences Mass Production of 238-Layer 4D NAND Flash Memory",
    "SK hynix Commences Mass Production of 238-Layer 3D NAND, Up To 50% Faster Data Transfers",
    "Coinbase has no plan to delist tokens named in SEC lawsuit, CEO says",
    "US SEC Coinbase, Binance crackdown puts crypto exchanges on notice",
    "DeFi Unfazed by SEC's Classification of Tokens as Securities",
    "Coinbase affirms support for tokens amid SEC lawsuit, no delistings planned",
    "Attack of the 50 Foot Blockchain",
    "The SEC sues Coinbase. It's on.",
    "matt levine on point as always - re: @solana https://www.bloomberg.com/... [image]",
    "10 years after Snowden's first leak, what have we learned?",
    "Techtris - Edward Snowen ten-year anniversary edition",
    "What's really changed 10 years after the Snowden revelations?",
    "Apple previews new features coming to Apple services this fall",
    "Apple Podcasts has a slightly refreshed interface in iOS 17",
    "These Apple Music features in iOS 17 make me less envious of Spotify users",
    "Apple reveals more Apple Music features for autumn update",
    "Apple Music is getting 6 new features in a free update - here's what's coming",
    "iOS 17 will connect your content subscriptions from apps to Apple Podcasts for exclusive benefits",
    "Apple to expand how digital IDs can be used this fall",
    "Apple Announces Businesses Can Accept iPhone IDs Later This Year",
    "iOS 17 will add support for recurring payments to Apple Cash",
    "Some projects I've worked on are coming soon 🥹 https://www.apple.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Report: TikTok Plans to Quadruple Its eCommerce Network",
    "TikTok Shop bets on SEA to reach $20b revenue target in 2023: report",
    "TikTok seeks up to $20 billion in ecommerce business this year: report",
    "TikTok-Owner ByteDance Allowed China to Monitor Hong Protestors, Suit Charges",
    "TikTok Shop is struggling to catch on in the West, but it's a hit with some indie authors",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Generative AI Is ‘Emerging Opportunity’ For Gaming Investors In 2023",
    "Genpact, Google Cloud partner to help enterprises adopt AI",
    "Google Cloud Enterprise Search is getting even better with AI models",
    "Google Cloud Collaborates with Mayo Clinic to Transform Healthcare with Generative AI",
    "Google Cloud and Mayo Clinic to explore uses of generative AI in healthcare",
    "Google Cloud teams with Mayo Clinic on generative AI effort",
    "Mayo Clinic, Google Cloud partner on generative AI to power enterprise search",
    "Mayo Clinic to Deploy Google Cloud's Generative AI Capabilities",
    "Google Cloud, Mayo Clinic make generative AI play",
    "Google Cloud and Mayo Clinic to boost healthcare efficiency with genAI",
    "Google and Mayo Clinic Partner to Infuse AI Into Health Care",
    "Google, Mayo Clinic Launch Generative Artificial Intelligence Collab",
    "GoTo nominates Patrick Walujo as new CEO amid profit push",
    "GoTo's CEO is stepping down on June 30. Here's his farewell letter to staff",
    "Patrick Walujo to become new CEO of GoTo Group, Andre Soeslityo steps down",
    "Personalized wealth management, built for tech people",
    "Marketing strategies & tips for startups",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/07 - Maybe Apple DOES Want To Get Serious About Mac Gaming",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Pigment announces $88 million Series C",
    "Business planning platform startup Pigment raises $88M for product development",
    "Apple's AirDrop in focus as China moves to restrict ‘short-range’ file-sharing",
    "Adobe brings Firefly to the enterprise",
    "Adobe Brings Its Generative AI Tool Firefly To Businesses",
    "Adobe pushes Firefly AI into big business, with financial cover",
    "Adobe brings Firefly, ‘commercially safe’ image-generating AI, to the enterprise",
    "Adobe chief warns competition watchdogs against stifling innovation",
    "Adobe opens up its Firefly generative AI model to businesses",
    "Major Adobe Express update brings Firefly Generative AI integration",
    "It's Even Cheaper To Try Adobe's Firefly AI Now",
    "Wow, FUCK YOU NO. https://www.washingtonpost.com/ ...",
    "OpenAI Sued for Libel After ChatGPT Allegedly Accuses Man of Embezzlement",
    "ChatGPT for iOS adds Siri & Shortcuts support, and proper iPad app - as it faces lawsuit",
    "First (?) Libel-by-AI (ChatGPT) Lawsuit Filed",
    "Man sues OpenAI over ChatGPT falsely telling a journalist he's embezzling non-profit money",
    "Radio Host Sues OpenAI for Libel After ChatGPT Accuses Him of Crime",
    "ChatGPT ‘hallucination’ falsely said radio host embezzled money, suit says",
    "TikTok reveals it has 8.5 million monthly active users in Australia",
    "Exclusive: TikTok Grilled By Bipartisan Senators On ‘Incorrect Claims’ Made To Congress",
    "Senators press TikTok on whether app allowed US data to be stored, accessed by China",
    "Payrails on Track to Expand After Raising $14.4 Million",
    "Payrails Raises $14.4M in Seed Funding",
    "Payrails scales FinOps with $14.4m funding led by EQT Ventures",
    "Digibee raises $60M to help companies integrate their software apps",
    "Digibee raises $60M led by Goldman Sachs, bringing total funding to $90M",
    "Digibee Raises $60M in Series B Funding",
    "First on CNN: Pornhub asks users and Big Tech for help as states adopt age verification laws",
    "Meta to introduce new accounts centre after talks -German cartel office",
    "Meta to finally allow users to turn off cross-site tracking",
    "Germany welcomes Meta plan for ‘more transparent’ data use",
    "Meta to give users more control over data following German antitrust order",
    "Contextual AI Raises $20M in Funding",
    "Bringing Context to Enterprise AI: Why We Invested in Contextual AI",
    "Announcing our $20m seed round to build the next generation of language models",
    "Contextual AI emerges from stealth with $20M to pursue ‘artificial specialized intelligence’",
    "Contextual AI launches with $20M to build more reliable large language models for enterprises",
    "Minecraft for Chromebook FAQ",
    "Minecraft officially arrives on Chromebook: Check if your laptop is available",
    "Minecraft hits general availability on Chromebooks",
    "You can now play stable Minecraft on your Galaxy Chromebook",
    "Microsoft Minecraft comes to Chromebooks",
    "Chromebooks can now run Minecraft natively, and this is great news",
    "How to install and play Minecraft on your Chromebook",
    "Lionel Messi to join MLS side Inter Miami after PSG departure",
    "Lionel Messi to join Inter Miami after leaving PSG",
    "How the Lionel Messi Deal Stymies Saudi Arabia's Ambitions",
    "The ‘Vice City’ Guide to Lionel Messi in Miami",
    "Lionel Messi will take soccer in United States to even greater level: ‘Bigger’ than Pele",
    "Lionel Messi's Potential MLS Deal Includes Revenue from Apple TV+",
    "Messi Moving to Miami Crowns Beckham's Longshot Bet on US Soccer",
    "Lionel Messi says he will join Major League Soccer's Inter Miami",
    "Messi in Miami is huge for Apple and MLS Season Pass",
    "Lionel Messi May Receive Cut of Apple TV's MLS Season Pass Revenue",
    "Apple & MLS close deal to bring Lionel Messi to Inter Miami",
    "Lionel Messi Agrees To Join Inter Miami: Reports",
    "Lionel Messi Docuseries Gets Green Light At Apple TV+",
    "Messi has decided. His destination: Inter Miami Leo Messi se va al Inter Miami",
    "Barcelona Paris Saint-Germain Argentina Apple TV+",
    "Lionel Messi is to Apple TV as Hulk Hogan was to Time Warner https://twitter.com/...",
    "Apple's ‘Services’ narrative is moving in some wild directions... ⚽️📺🍎 https://twitter.com/...",
    "@mgsiegler Vision Pro custom-camera broadcasts make the economics feel...more interesting.",
    "Is Messi the US soccer moment we've been waiting for https://twitter.com/...",
    "Someone from Apple watched Air https://twitter.com/...",
    "Haven't bought a pass before but likely will to watch him play https://twitter.com/...",
    "MLS broadcaster Apple TV tweeted about Messi to Miami before deleting the tweet. [image]",
    "they're so funny for this [image]",
    "so this is what swayed his decision https://twitter.com/...",
    "MLS, Apple, and Adidas preparing the Messi deal https://twitter.com/... [image]",
    "Apple's new Proton-like tool can run Windows games on a Mac",
    "Apple hid something AMAZING for Mac gaming at WWDC",
    "Apple Makes Developer Betas Free for All",
    "Apple's new toolkit makes it easier for developers to bring Windows games to Mac",
    "Apple Has A Proton-Like Tool To Test Windows Games On MacOS",
    "Play More Windows Games on Mac with Apple's New Toolkit [VIDEO]",
    "Cyberpunk 2077, Diablo IV, and more can run on a Mac thanks to this new toolkit",
    "Apple's Game Porting Toolkit could be a revolution for Mac gaming — here's the proof",
    "Unleashing the Gaming Revolution: CrossOver Mac's DirectX 12 Support Update!",
    "CyberPunk 2077 is now (unofficially) on Mac thanks to the new macOS Sonoma port tool",
    "Apple unveils new Game Porting Toolkit that runs Windows games on Mac",
    "CrossOver announces DirectX 12 support coming to macOS this summer",
    "New DirectX 12-to-Metal translation could bring a world of Windows games to macOS",
    "Mac Gaming to Gain DirectX 12 Support via CrossOver 23"
]