[
    "@Cdespinosa@mastodon.social",
    "@jeremyburge@mastodon.world",
    "@Gartenberg@mastodon.social",
    "@ashfurrow@masto.ashfurrow.com",
    "@GossiTheDog@cyberplace.social",
    "@film_girl@mastodon.social",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "The Apple Vision Pro headset will cost $3,499, out early 2024",
    "Apple Vision Pro $3,499 mixed-reality headset launches at WWDC after years of rumors",
    "Apple's new VR headset will feature over 100 Apple Arcade games at launch",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "Apple Vision Pro will launch with over 100 Apple Arcade games",
    "Apple Debuts $3,499 Headset in Test of Its Marketing Might",
    "Here's a First In-Person Look at the Apple Vision Pro",
    "Apple sure kicked Meta's butt today, right?",
    "Things you could buy instead of a $3,500 Apple Vision Pro, including 7 Quest 3s",
    "Apple launches into virtual reality with impressive new headset",
    "Apple Vision Pro: Everything you need to know",
    "Meet Apple's AR/VR Vision Pro headset: Price, features, release date, and everything else to know",
    "Apple Announces Vision Pro, its “Spatial Computing” Headset",
    "Apple Unveils Vision Pro, Its First XR Headset",
    "Silicon Valley Business Journal",
    "Apple unveiled its long-awaited augmented reality headset",
    "Apple unveils Vision Pro AR headset",
    "Apple Vision Pro: Apple's big bet on a brand-new platform starts at $3,499",
    "Apple unveils Vision Pro, its $3,499 augmented-reality headset",
    "Apple Unveils $3,500 ‘Spatial Computing’ Headset",
    "Apple announces $3,500 Vision Pro XR headset",
    "Vision Pro: Apple Finally Unwraps Ambitious, Long-Rumored VR Headset at WWDC",
    "Apple Vision Pro AR/VR Headset Ships Early 2024 For $3500",
    "Apple uncovers its clever VR glasses in the biggest new launch since the iPhone",
    "Apple Reveals $3,499 Vision Pro Augmented Reality Headset",
    "Apple announces mixed reality headset Vision Pro",
    "Apple unveils long-awaited Vision Pro mixed-reality headset at WWDC",
    "Apple launches Vision Pro, a VR headset it hopes will be most important product since iPhone",
    "Apple launches its virtual- and augmented-reality headset: Apple Vision Pro",
    "EyeSight on Apple Vision Pro makes wearing a headset slightly more human",
    "Apple Unveils the Mixed Reality Headset ‘Vision Pro’",
    "Apple just revealed its first major product in over 8 years — meet the $3,499 ‘Vision Pro’",
    "Apple unveils Vision Pro ‘mixed reality’ headset",
    "Tim Cook unveils Apple Vision Pro mixed reality headset",
    "Apple Reveals ‘Vision Pro’ Mixed Reality Headset at WWDC 2023",
    "Apple Announces Vision Pro, Its Mixed Reality Headset",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "Apple intros Vision Pro, an AR headset and new computing platform",
    "Big reveals from Apple's Worldwide Developers Conference",
    "Apple's Vision Pro headset will cost $3,499 — and everybody had the same reaction",
    "Apple reveals $3,500 Vision Pro AR headset that puts Meta's top-tier goggles to shame",
    "Apple Officially Reveals Vision Pro, Its New $3,499 Mixed Reality Headset",
    "Apple Vision Pro Will Have Custom Disney+ Content, Including Marvel's What If...?",
    "Apple WWDC 2023: Can Vision Pro headset jump start AR, VR, metaverse for business?",
    "Apple Reveals Vision Pro AR Headset, & No, You Probably Cannot Afford It",
    "Apple unveils sleek, $3,500 ‘Vision Pro’ goggles. Will they be what VR has been looking for?",
    "Live: Expectations of Apple's headset set to meet reality",
    "Apple Vision Pro Reactions For The $3,500 Headset Are All Over The Place",
    "Apple ushers in a new era of VR with the launch of its mixed reality headset Vision Pro for $3,499",
    "Apple unveils $3499 augmented reality Vision Pro headset",
    "Apple Vision Pro: No controllers, $3499, coming in 2024",
    "Apple Is Coming Out With A New VR Headset",
    "The internet reacts to Apple's Vision Pro AR headset",
    "Apple Vision Pro AR headset revealed at WWDC 2023, priced at $3,499 for early 2024 launch",
    "New Apple Vision Pro XR headset puts the Quest Pro to shame",
    "Apple's Mixed-Reality Headset, Vision Pro, Is Here",
    "Apple launches Vision Pro, its first-ever augmented reality headset",
    "Apple Vision Pro is here and we're never leaving the house — here's a list of everything it can do",
    "Apple Officially Reveals Vision Pro, Its New Mixed Reality Headset",
    "Apple Announces Vision Pro AR/VR Headset: How Will it Impact the Metaverse?",
    "Disney+ Will Be Offered on Day 1 With Apple Vision Pro",
    "Apple Vision Pro Features a Brand New Chipset and Dedicated Operating System",
    "Apple Vision Pro Headset Is Real, And It Expertly Blends AR With VR",
    "Meet Apple Vision Pro: the human virtual reality headset!",
    "Apple Unveils Vision Pro Virtual Reality Headset, Its First Major Device Launch In Nearly A Decade",
    "Apple just announced its first major product since 2014: The Vision Pro for $3,499",
    "Apple announces Vision Pro AR and VR headset - here's everything we know",
    "Apple's pricey Vision Pro headset ushers in era of ‘spatial computing’",
    "Apple Vision Pro VR/AR HMD revealed at WWDC 2023",
    "Apple reveals Apple Vision Pro",
    "Apple Finally Reveals Long-Awaited AR Headset, Vision Pro, Priced At $3,500",
    "Apple announces Apple Vision Pro, its long-awaited VR headset",
    "Apple announces Vision Pro headset",
    "M2 chip coupled for R1 for sensing.",
    "Goodbye to Jony's White World  —  Say hello to Tim's Dark Dungeon",
    "So to watch a movie with the family everyone is going to need to own one?",
    "Apple bringing back Glassholes 10 years later.",
    "@glassbottommeg@peoplemaking.games",
    "VisionPro must not have the processing power required to render dinosaur feathers I guess",
    "“Facial Video” is the new euphemism for home made porn.",
    "Apple just made folding phones seem like a bargain.",
    "And not inside a case like in 2007! https://twitter.com/...",
    "Ah - here's why the stock dropped. Menswear guy isn't a fan https://twitter.com/...",
    "Battery fanny pack included. [image]",
    "Here it in in the flesh #AppleVisionPro [image]",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "Some video is the display showing a person you are in a full VR experience. [video]",
    "First in person look at Apple Vision Pro #WWDC23 [video]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "new reaction image just dropped [image]",
    "i just know i'm gonna hate buy this thing so hard [image]",
    "Here it is. Apple Vision Pro. [video]",
    "AHHHHHHHH HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH (Breathes) AHHHHHHH [image]",
    "Notice the bevel on the new Apple VisionPro AR goggles is borrowed from the Apple Watch. [image]",
    "paying $3499 to rewatch my wife and children leave me #WWDC23 [image]",
    "@WinObs It connects to this setup: [image]",
    "Here's the battery pack [image]",
    "This will be the new Patagonia Vest for Silicon Valley VCS",
    "should i buy a used car or an apple vision pro",
    "Oh there's someone using a keyboard. So that's interesting. Yeah I want one.",
    "the Vision Pro seems like a lonely device",
    "time to get a new mortgage 🥴 [image]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "Wow! Disney Plus on Apple Vision Pro looks truly magical. [video]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "Hopefully the product is better than the movie :shudder: https://twitter.com/...",
    "going to wear a vision pro into molotov's",
    "Market is... not into the Apple Vision Pro! https://t.co/...",
    "Lordy, this vision pro presentation is making Meta look like dogshit.",
    "This line is haunted: “video conferencing apps can leverage your digital persona”",
    "Microsoft Excel, Word, and Teams in Apple Vision Pro [image]",
    "The entire TV set market right now. [image]",
    "I am looking at two 32\" monitors and it's a field of vision problem.",
    "can't wait to confidently blurt our “no updates from me” while looking like this [image]",
    "I'm watching every single idea and patent we filed at Magic Leap",
    "Standing in line for Apple Glasses.",
    "Yep, don't think all the reports were to sandbag on the cost here... This tech is nuts. #wwdc23",
    "Their new Jony Ive sounds a lot like their old Jony Ive.",
    "We're all about to look like we're scuba diving through real life. 🤿 [image]",
    "If I'm wearing goggles like that there better be a mountain nearby https://twitter.com/...",
    "“We studied thousands of heads”",
    "Man, Meta's Reality Labs team must not be feeling too great today",
    "Not a word on battery life.",
    "I feel kind of sorry for Meta.",
    "Mark Zuckerberg is having a bad day.",
    "Dictating Typing Typing on glass Typing on air Dictating",
    "What do others see when I'm FaceTiming with a headset?",
    "Steve wouldn't have named it Vision Pro though...",
    "Being able to see people's eyes while people are nearby is cool, but a little creepy ngl",
    "GIVE ME THE FACE BUBBLE [image]",
    "i am absolutely gonna be wearing these to da club [image]",
    "Looking forward to getting laid off by this person someday [image]",
    "Funny joke @gruber 😜 [image]",
    "this is the most dystopian device apple has ever announced",
    "we are not serious people [image]",
    "This is the video camera from Minority Report! #WWDC23",
    "Vision Pro is basically the standard VR experience with Apple polish—not revolutionary",
    "This is the most mind blowing product I've ever seen. Apple just changed everything, again.",
    "💯🥽 #WWDC23 https://twitter.com/... [image]",
    "Wall St: Vision Pro to disrupt external monitor sales.",
    "How long until somebody uses this on a plane?",
    "Home Theater for NYC apartments.",
    "3D movies in headset. Avatar. I literally wrote about this",
    "3D cameras — Well, I guess we know what to expect in the iPhone 15 Pro now...",
    "Room dims as things are played: Magic Leap 2 has this feature too, I thought it was cool",
    "Vision Pro is also a 3D camera. They call it a Spatial photo or video. #WWDC23 [image]",
    "Notice that really long wire.",
    "I can't wait to see the first one of these in Starbucks.",
    "At this point, I can't imagine my life without Apple Vision Pro. I'm serious. [image]",
    "i need to know where this mystery cord is going",
    "Did any leak get the name Vision Pro right?",
    "Everyone saying before they weren't going to get Apple's headset just changed their mind.",
    "The killer app for AR. Infinite monitors. [image]",
    "apple invents an augmented reality headset and they're like “so you can run safari in it”",
    "How many things has Zuck thrown and broken so far https://twitter.com/...",
    "Introducing Apple Vision Pro",
    "The best AI features Apple announced at WWDC 2023",
    "Apple Shows Off $3,499 Vision Pro XR Headset at WWDC",
    "Apple unveils its first AR/VR headset, the Vision Pro",
    "Apple unveils $3,499 Apple Vision Pro mixed-reality headset — here's what it is and how it works",
    "Apple Vision Pro is Company's First Spatial Computer, Packs 23 Million Pixels Across Two Displays",
    "Zuck at the Oculus team rn [image]",
    "mfw watching #WWDC23 [image]",
    "me using the new apple headset [video]",
    "Me, accepting GDPR popups next year: [image]",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "Apple worked with Zeiss to create custom inserts for glasses wearers. #WWDC23 [image]",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Apple Vision Pro headset runs visionOS with a 3D-spatial user interface",
    "Apple's AR/VR Headset Has Its Own OS Called VisionOS",
    "Apple Vision Pro headset will get its own App Store featuring apps for visionOS",
    "Microsoft Word, Excel, and Teams are all coming to Apple's new Vision Pro headset",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "VisionOS is Apple's latest operating system",
    "Disney Plus Is Coming to Apple Vision Pro on Day One",
    "Apple Vision Pro VR headset is revealed — and it will blow your mind",
    "visionOS will power the Apple Vision Pro headset — here are the first official details",
    "WWDC 2023: Apple Vision Pro headset with visionOS announced; know all about Apple's big bet",
    "Apple announces Vision Pro mixed reality headset, available early next year starting at $3499",
    "Apple unveils Apple Vision Pro, a revolutionary spatial computer",
    "Apple Vision Pro brings TV, 3D movies to a massive, 100-foot-wide screen",
    "Disney+ To Launch On Apple Vision Pro Devices",
    "This Changes Everything: Disney+ WILL Be Available on Apple Vision Pro",
    "imagine seeing this in VR [image]",
    "Someone needs to build a spatial code editor for visionOS",
    "“Exploring visionOS”. Going to take on my most challenging writing project yet. 🤗 [image]",
    "The new OS is called visionOS. Not xrOS, lol. [image]",
    "Phew. “visionOS” MUCH better than “xrOS”. #wwdc23",
    "visionOS is such a good name, better than realityOS and xrOS",
    "Meet your digital persona: Apple's Vision Pro users to get real-time animated avatars",
    "Apple Vision Pro first look: A glimpse at the spatial computing future",
    "Apple enters mixed reality with $3,500 Vision Pro headset",
    "Disney+ will be on Apple Vision Pro from day one",
    "Apple's Vision Pro is a Reality",
    "Apple Tips Vision Pro Augmented Reality Headset, With Sky-High $3,499 Price Tag",
    "Apple's Vision Pro headset seems too good to be real — because it basically is",
    "Apple's Vision Pro isn't the VR headset you were expecting, but it is the future — for rich people",
    "A closer look at Apple's $3,499 Vision Pro headset",
    "Apple unveils VR headset Vision Pro",
    "Apple Unveils $3,500 Vision Pro AR Headset",
    "As a Meta Quest 2 user, here's why I think Apple's Vision Pro could be a big breakthrough",
    "Apple made it clear: The Vision Pro isn't the next big video game platform",
    "How Apple's Vision Pro Works With Prescription Glasses",
    "Apple unveils much-anticipated Vision Pro headset at WWDC",
    "Apple Unveils Vision Pro, Its First Augmented Reality Headset",
    "Apple Reveals Vision Pro Mixed Reality Headset",
    "Disney Plus Will Be Available On Apple's Vision Pro At Launch",
    "Apple reveals Apple Vision Pro: Apple's first mixed-reality headset",
    "Apple's Vision Pro Headset Is Official, and It Makes Some Big Promises",
    "It does look better in photos than it did in the keynote or on the site. https://twitter.com/...",
    "Apple's Vision Pro Headset Uses ‘Optic ID’ Iris Scanning Authentication",
    "Apple announces new Optic ID biometrics for user authentication on Apple Vision Pro headset",
    "Apple's Optic ID will let you log in to the Vision Pro headset with your eyes",
    "For just $3500! https://twitter.com/...",
    "Apple WWDC 10 biggest announcements: Vision Pro, MacBook Air, iOS 17, and more",
    "Every hardware product Apple announced at WWDC today: Vision Pro headset, Mac Pro, more",
    "WWDC 2023 Recap: Vision Pro Headset, iOS 17 and Everything Else Apple Announced",
    "Apple's New Headset and Other Takeaways From WWDC 2023",
    "Apple debuts larger MacBook Air",
    "Apple launches new 15-inch MacBook Air and M2 Ultra-powered Mac Studio",
    "Everything Apple Announced at WWDC 2023",
    "Apple WWDC event 2023: All the new products for launch, from VR headset to iOS 17",
    "Apple unveils 15-inch MacBook Air, available to order today for $1299",
    "Here are the most important new changes coming to your iPhone this fall",
    "Microsoft Word, Excel, and Teams apps will be available for the Apple Vision Pro AR headset",
    "Apple WWDC '23 Live Blog: recap of all the unveilings during Apple's keynote",
    "Apple WWDC 2023: The Biggest Announcements From the Keynote",
    "Apple unveils $3,500 Vision Pro headset",
    "Hideo Kojima impressed with Apple's gaming tech, will bring future games to Mac",
    "WWDC 2023: Follow along with every Apple announcement live!",
    "Apple Vision Pro, iOS 17 and MacBook Air 15\": Apple's WWDC 2023 Roundup",
    "WWDC 2023: Apple Publishes Keynote Video",
    "Apple's Vision Pro Headset: Everything You Need to Know",
    "Apple Partnering With Disney for Upcoming Vision Pro Headset",
    "An example of great interaction between brands 😂 @McDonalds @AXE [image]",
    "One thing is for sure after today, Apple's product marketing team is better than Meta's",
    "Sorry but I've heard Jonny Ive say “aluminum” and you are no Jonny Ive.",
    "US District Court for the District of Columbia",
    "International Business Times",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Sues Binance and CEO Zhao for Breaking US Securities Rules",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "Binance Executives Claimed to Operate as ‘Unlicensed Securities Exchange’: SEC Lawsuit",
    "SEC Quietly Removes Director William Hinman's Bio From Website",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "SEC sues Binance and founder Changpeng Zhao over securities law violations",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "SEC sues Binance and CEO Changpeng Zhao",
    "Crypto shares tumble after U.S. SEC charges Binance with securities law violations",
    "Crypto Exchange Platform Binance, CEO Zhao Accused Of Commingling Funds",
    "SEC sues Binance and accuses crypto exchange of mishandling funds",
    "Binance and CEO Changpeng Zhao Face SEC Lawsuit, Triggering Red Tide in Crypto Market",
    "SEC says crypto firm Binance mishandled funds, violated securities laws",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "Some other securities, according to the SEC!",
    "Coinbase Shares Drop 10% Following SEC's Suit Against Binance",
    "Top crypto tweets of the day - June 5th",
    "SEC Sues Binance, CEO Changpeng Zhao for Violating Securities Laws",
    "Binance sees net outflows of $69 million in one hour",
    "Bitcoin Price Prediction: BTC Plunges Amid Legal Action by US SEC Against Binance and Its Founder",
    "Binance faces SEC charges for allegedly mishandling funds and dodging rules",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "SEC filing calls BNB a security [image]",
    "both coley and brooks testified to SEC [image]",
    "Strong together. https://twitter.com/...",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Apple says it has fixed iPhone autocorrect with iOS 17",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "iOS 17 can suggest recipes for similar dishes from a photo on your iPhone",
    "iOS 17: These five new features make us eager to upgrade",
    "iOS 17's Live Voicemail lets you read a voicemail in real time",
    "iOS 17 will transcribe your audio messages, customize contact posters",
    "Apple Announces New ‘NameDrop’ Contact Sharing Feature Coming in iOS 17",
    "With iOS 17, Apple introduces new journaling app, refreshes communication apps",
    "iOS 17 Messages adds emoji tapbacks, stickers, audio message transcription, more",
    "Apple Unveils iOS 17 for the iPhone at WWDC 2023",
    "Apple's Vision Pro headset brings new emersion to familiar iOS apps",
    "10 exciting new iOS 17 features that Apple didn't tell us about at WWDC",
    "AirTag can be shared with up to five other people with iOS 17",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "StandBy is a new iPhone feature that could be great for Apple Home users",
    "Apple Shortening ‘Hey Siri’ to ‘Siri’ Across iPhone, Mac, and Other Devices",
    "Apple announces powerful new privacy and security features",
    "iOS 17 StandBy mode brings smart display-like features to iPhone",
    "Apple just announced a ton of software features at WWDC. Here's everything new",
    "iOS 17 Adds Journal App, StandBy Smart Display Mode, Better Autocorrect",
    "iOS 17 isn't an exciting update but does have one stand-out feature",
    "Apple is putting AirPlay in hotels",
    "Which iPads support iPadOS 17? Here's the list ...",
    "FaceTime voicemail is coming to iOS 17, plus live voicemail transcription",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "AirDrop in iOS 17 will let you share contact info by bringing two iPhones close together",
    "iOS 17 Includes Updated Phone, FaceTime, and Messages Apps",
    "Apple Revamps iPhone Software With Journaling App, StandBy Mode",
    "Apple introduces a dedicated ‘Journal’ app to log your daily experiences",
    "Apple announces NameDrop, a feature for seamless contact information sharing",
    "WWDC 2023: Apple introduces contact sharing feature NameDrop; what is it and how it works",
    "What's New In IOS 17 And When Is It Coming To Your IPhones [Top 10 Features]",
    "11 best iOS 17 features: StandBy mode, Journal app and more",
    "These iOS 17 features require an iPhone 12 or newer",
    "Apple Introduces New Security Features Including ‘Live Voicemail’",
    "Apple announces iOS 17 with new StandBy mode, improved Phone app, offline maps and more",
    "Apple Announces iOS 17 for iPhone",
    "iOS 17 StandBy like feature will look good in Huawei phones",
    "iOS 17 Adds New Features for Phone, FaceTime, Messages, and AirDrop",
    "These are the devices that will support iOS 17",
    "iOS 17 makes iPhone more personal and intuitive",
    "Apple will let you create stickers from your own photos and videos",
    "Apple Announces New Intelligent AirPlay Features With Hotel Room Support",
    "Apple's new Journal app is coming to iPhone: Everything you need to know",
    "iOS 17 introduces advanced communication features, Journal app, Standby mode, and much more",
    "Apple's new ‘Journal’ app will help you kickstart a daily diary habit",
    "Apple introduces Journaling app for iOS",
    "Apple is really good at killing apps [image]",
    "How far have Twitter's advertising revenues fallen?",
    "Twitter CEO Linda Yaccarino to Start Monday",
    "Twitter's U.S. ad revenue drops 59%",
    "Linda Yaccarino replaces Elon Musk as Twitter boss",
    "Hate speech is driving advertisers away from Twitter",
    "Elon Musk Had Fun With Dogecoin",
    "Yaccarino takes wheel at Twitter early as advertising woes become public",
    "4 urgent tasks for new Twitter CEO Linda Yaccarino",
    "Twitter's Ad Revenue Continues to Decline Under Elon Musk",
    "Former NBCU exec Linda Yaccarino prepares to take over Twitter CEO role from Elon Musk",
    "Twitter's Hardship Continues, Ad Sales Slump 59%",
    "Apple Introduces New Mac Pro With M2 Ultra Chip, Available to Order Starting Today",
    "Maxed-out Apple Silicon Mac Pro costs 1/4 what a maxed Intel one did",
    "Apple Announces M2-Based 15-inch MacBook Air, Mac Studio, and Mac Pro",
    "Apple Store Back Up With Preorders for 15-Inch MacBook Air, Mac Pro and Mac Studio",
    "Apple Unveils 15-Inch MacBook Air, Mac Pro With M2 Ultra Chip",
    "Mac Pro with M2 Ultra first look: boy, that's a big chip",
    "All the Mac news from WWDC 2023: Mac Pro, Mac Studio, and M2 Ultra",
    "Apple Upgrades Mac Pro to M2 Ultra Silicon",
    "Apple Silicon Mac Pro debut finally ends transition away from Intel processors",
    "Apple surprise-launches new Mac Pro with Apple Silicon",
    "Apple refreshes the Mac Pro with its new M2 Ultra chip",
    "This is the new Apple Silicon Mac Pro",
    "Apple announces rack-mountable Mac Pro with Apple silicon",
    "Mac Pro: Apple finally updates its most powerful computer",
    "Mac Studio with the M2 Ultra is the most powerful personal computer ever",
    "The new Mac Pro brings PCI expansion to Apple Silicon for the first time",
    "Apple's upgraded Mac Studio includes the M2 Max or M2 Ultra chip",
    "Apple launches the M2 Ultra chip powering the new Mac Pro and Mac Studio",
    "Apple Unveils M2 Ultra Chip as Most Powerful Apple Silicon Chip Yet",
    "Apple Debuts New Mac Studio and Mac Pro",
    "Apple unveils new Mac Pro and Mac Studio, completing Mac's Apple Silicon transition",
    "Apple Refreshes Mac Pro and Mac Studio Line With New M2 Ultra Chip",
    "Apple's Mac transition to Apple silicon complete after three years",
    "Apple finally reveals new Mac Pro at WWDC 2023",
    "Apple introduces the 15‑inch MacBook Air",
    "Apple Announces New MacBook Air With 15.3-inch Display and M2 Chip",
    "Apple Confirms An Uninspiring Update To The MacBook Air",
    "Apple Unveils 15-Inch MacBook Air at WWDC 2023",
    "Hands on with the new 15-inch MacBook Air [Gallery]",
    "Apple introduces new 15-inch MacBook Air",
    "MacBook Air 2023: Everything you need to know",
    "15-Inch MacBook Air M2 Preorder: Where to Buy Apple's Latest Laptop",
    "Apple Debuts 15-inch MacBook Air at WWDC",
    "The MacBook Air gets bigger with new 15-inch model",
    "Apple's $1,299 15-inch MacBook Air is its largest to date",
    "You can now preorder the 2023 MacBook Air 15-inch — here's how to get it",
    "Apple's new 15-inch MacBook Air with M2 processor is 12x faster than Intel's version",
    "WWDC 2023: Apple introduces new 15.3-inch MacBook Air with M2 chipset. All details",
    "Apple intros the 15‑inch M2 MacBook Air",
    "Apple Introduces New 15-inch M2 MacBook Air",
    "Apple Updates Price of 13-inch M2 MacBook Air - $100 Cheaper, Now Starts at Just $1,099",
    "How to pre-order Apple's new 15-inch MacBook Air",
    "15-inch MacBook Air Canadian Pricing Revealed",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "Apple's M2 Ultra chip chases the Hollywood elite",
    "Apple unveils new Mac Studio and finally brings Apple Silicon to Mac Pro",
    "Apple Unveils The M2 Ultra, A Monster Chip With 24 CPU Cores And Up To 76 GPU Cores",
    "Apple WWDC 2023: Apple launches new Mac Studio PC with M2 Max and M2 Ultra chips",
    "Apple Mac Studio Update at WWDC: M2 Ultra Option Debuts",
    "(PR) Apple introduces M2 Ultra SoC with 24 CPU and 76 GPU cores, 192GB of memory",
    "Apple's new M2 Ultra chip offers even more ridiculous performance than before",
    "Apple announces the M2 Ultra with up to 192GB of memory",
    "As rumored, the Mac Studio gets an M2 refresh, including fused-together M2 Ultra",
    "Apple announces M2 Ultra chip with double the CPU and GPU cores",
    "Apple Announces New Mac Studio With M2 Max and M2 Ultra Chips",
    "Mac Studio gets updated with powerful M2 Max and M2 Ultra processors",
    "Apple's 24-Core M2 Ultra Combines Two M2 Max Dies, Powers New Mac Pro, Mac Studio",
    "Apple's Mac Studio gets an M2 Ultra and Max upgrade",
    "Apple debuts M2 Ultra with up to 192GB of memory",
    "How to pre-order Apple's new Mac Studio with M2 Max and M2 Ultra chips",
    "Apple M2 Ultra: everything you need to know about Apple's most powerful chip",
    "Apple reveals Mac Studio 2023 with huge M2 Ultra chip power",
    "2023 Mac Studio, Mac Pro Canadian Pricing Revealed",
    "Introducing watchOS 10, a milestone update for Apple Watch",
    "watchOS 10 is bringing back widgets in a big way",
    "Apple rethinks the Apple Watch with watchOS 10 update",
    "Apple revamps WatchOS with widgets, new fitness and health features, and more",
    "watchOS 10 brings focus back to widgets for Apple Watches",
    "watchOS 10: These are the Apple Watch models compatible with the update",
    "WatchOS 10 For Apple Watch: New Features Coming This Year",
    "watchOS 10 brings widgets and new corner icons to Apple's wearable",
    "All the New Features Apple Is Bringing to WatchOS 10 This Fall",
    "Apple commits to mental health with tracking on Watch and iPhone",
    "iPadOS 17 brings interactive widgets, enhanced lock screen, Health app, and more",
    "The Apple Watch embraces widgets again in watchOS 10",
    "watchOS 10 arrives for Apple Watch, with widgets, new faces, and more workouts",
    "Apple Announces watchOS 10 With Widgets, Redesigned Apps, and More",
    "watchOS 10 for Apple Watch officially unveiled",
    "Everything new in watchOS 10 — the biggest Apple Watch update in years",
    "watchOS 10 announced - Redesigned apps, Smart Stack, vision health, mental health tools and more",
    "WWDC 2023: Apple announces watchOS 10 with a new Smart Stack, new design, more watch faces",
    "watchOS 10 makes WWDC 2023 debut: Here's what's next for Apple Watch",
    "Apple Watch0S 10 brings a widget-focused rebrand to your smart watch",
    "Widget fans and cyclists and will love watchOS 10",
    "Transforming the wrist experience: the innovations of watchOS 10",
    "Apple Watch will now track your mental health. #WWDC23 #watchOS10 [image]",
    "Apple Watch now has a touch grass measurement, nice.",
    "Love the new cycling features for the apple watch. Time to get one",
    "All right, the @apple Watch upgrades are quite solid. Well done team. #WWDC23",
    "Snoopy and Woodstock on Apple Watch! #WWDC23 https://twitter.com/... [video]",
    "CISA orders govt agencies to patch MOVEit bug used for data theft",
    "BA, Boots and BBC staff details targeted in Russia-linked cyber-attack",
    "Group behind Clop ransomware exploiting MOVEit zero-day, says Microsoft",
    "Clop ransomware group behind MOVEit file transfer hacks: Microsoft",
    "British Airways, BBC and Boots all hit in Zellis cyberattack exploiting MOVEit vulnerability",
    "Unlock a new pipeline channel: your existing customers",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify cuts 200 more jobs in podcast division amid industry struggles",
    "Spotify combines podcast studios and shrinks workforce",
    "How to Upload Your Podcast to Spotify for Podcasters",
    "macOS Sonoma drops support for another wide swath of Intel Macs",
    "Apple debuts macOS 14 Sonoma",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "'Death Stranding: Director's Cut' walking onto Mac",
    "These Macs will get macOS 14 Sonoma in the fall",
    "Apple Releases First Beta of macOS 14 Sonoma to Developers",
    "Apple releases first macOS Sonoma beta to developers",
    "Which Macs support macOS 14? Mostly only Apple Silicon models. Here's the list ...",
    "How to install macOS Sonoma beta on your Mac",
    "macOS Sonoma Drops Support for These Macs",
    "MacOS Sonoma Offers You Key Upgrades, Customizable Widgets",
    "macOS Sonoma brings widgets to the desktop",
    "Apple Announces macOS Sonoma with Game Mode, Upgraded Widgets and More",
    "MacOS 14 Sonoma Launches at WWDC 2023",
    "macOS Sonoma adds Game Mode, a new design for desktop widgets, and more",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Apple announces macOS Sonoma with aerial screensavers, Game Mode, and more",
    "Apple announces macOS Sonoma with iMessage enhancements and aerial screensavers",
    "WWDC 2023: Apple brings MacOS Sonoma",
    "macOS Sonoma works on fewer Macs than ever - here's what you need to run it",
    "macOS 14 Sonoma officially announced at WWDC 2023",
    "Apple announces macOS Sonoma at WWDC",
    "Download and Install macOS 14 Sonoma Beta Right Now [Tutorial]",
    "MacOS Sonoma Brings Widgets And Screensavers To Mac",
    "it looks like the Windows 11 version of Bliss too, with all those ripples https://twitter.com/...",
    "Stack Overflow Moderator Letter",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/05 - WWDC And The Apple Headset",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "AirPods redefine the personal audio experience",
    "Apple unveils Adaptive Audio and says it'll improve AirPods' automatic switching",
    "Apple Releases Beta Firmware Update for AirPods",
    "Adaptive Audio listening mode is coming to AirPods Pro 2",
    "AirPods noise cancellation is about to become a lot smarter",
    "AirPods Pro getting a big update in iOS 17 with Adaptive Audio",
    "Apple is adding adaptive audio to AirPods Pro",
    "Adaptive Audio and Personalized Volume on AirPods will adjust sound levels and ANC automatically",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "Father's Day Gift Idea: The Best Deals on Premium True Wireless Noise Cancelling Earbuds",
    "Your Apple AirPods just got a lot more adaptive and aware",
    "Apple AirPods Pro to get Adaptive Audio, Personalized Volume, Conversation Awareness and more",
    "Here are All the New Features Coming to AirPods",
    "FaceTime Launching on Apple TV With iPhone and iPad Camera Support",
    "tvOS 17 Lets You Use Your iPhone to Find a Lost Siri Remote",
    "FaceTime is coming to Apple TV with tvOS 17",
    "tvOS 17 brings FaceTime and video conferencing to the biggest screen in the home",
    "Apple TV gets FaceTime, a new control center, findable remote and more",
    "You can now FaceTime from your Apple TV",
    "FaceTime is coming to Apple TV",
    "FaceTime comes to Apple TV with tvOS 17",
    "Apple Announces tvOS 17, Including FaceTime and New Control Center",
    "FaceTime comes to Apple TV",
    "Siri can finally find your lost Apple TV remote",
    "FaceTime comes to Apple TV with the tvOS 17 update",
    "The Best New iOS 17 Features Coming to Your iPhone Later This Year",
    "How to Download tvOS 17 Beta on Apple TV 4K or HD",
    "The tvOS 17 update for Apple TV brings more FaceTime to your living room",
    "Apple unveils tvOS 17 with support for FaceTime, all-new Control Center, and more",
    "tvOS 17: FaceTime, Find My Remote and more features",
    "Best New tvOS 17 Features to Try on Apple TV",
    "iPadOS 17 brings new levels of personalization and versatility to iPad",
    "Apple Releases First Betas of iOS 17 and iPadOS 17",
    "iOS 17 and iPadOS 17 beta 1 now available",
    "Apple Unveils iOS/iPadOS 17, watchOS 10, macOS Sonoma",
    "How to install iPadOS 17 beta on your iPad",
    "Apple Unveils iPadOS 17 at WWDC 2023",
    "Apple reveals iPadOS 17 with customizable Lock Screen, Health app, more",
    "iPadOS 17 announced with interactive widgets, Lock Screen customization, more",
    "iPadOS 17 Unveiled at Apple's WWDC 2023",
    "iPadOS 17 adds upgraded widgets, customizable Home Screen, and new native apps",
    "Apple Announces iPadOS 17 With Custom Lock Screens and Interactive Widgets",
    "iPadOS 17 gets a customizable lock screen, interactive widgets and Apple Health",
    "WWDC 2023: Apple to introduce Health app on iPad as part of iPadOS 17",
    "iPadOS 17 announced at WWDC, coming with interactive widgets and more",
    "Apple announces iPadOS 17 with interactive widgets, iPhone-like lock screen",
    "Check Out The New Health Features in iOS 17, watchOS 10",
    "iOS 17 and iPadOS 17 developer betas now available to install",
    "iPadOS 17 announced - Interactive widgets, redesigned Lock Screen, Health app and more",
    "How to Download iOS 17 and iPadOS 17 Developer Beta on Your iPhone or iPad [Tutorial]",
    "iPadOS 17: Productivity Boost (PDFs!) and Many iPhone Features",
    "Apple iOS 17 Introduces StandBy, a Full-Screen Experience for When Your iPhone is Charging",
    "India's Open Network for Digital Commerce Begins Facilitating B2B Transactions",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "British Airways, Boots, BBC payroll data stolen in MOVEit supply-chain attack",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "Province warns of ‘global cybersecurity issue’ that resulted in stolen personal info",
    "Russian hackers raid British Airways and BBC in cyber attack",
    "BA's UK staff and Boots hit by cyber security breach with contact and bank details exposed",
    "British Airways, Boots and BBC among companies hit by cyber security attack",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’",
    "‘Fake Putin’ announces Russia under attack as Ukraine goes on offensive",
    "Google extends the convenience of passkey authentication to a whole lot more users",
    "Safari will soon make it easier to share phishing-resistant passkeys",
    "Google rolls out passkey support for Workspace and Cloud accounts",
    "Create and manage your Google Passkeys, here's how",
    "Google Workspace Is Going Passwordless",
    "Google Workspace Accounts Add Passkey Support in Beta",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "Carbon Health launches medical charting tool powered by GPT-4",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "‘Less Than 1%’ of Users Hit by $35M Hack, Says Atomic Wallet",
    "‘Your security posture sucks’: Atomic Wallet slammed after hacker swipes $35m",
    "Crypto catastrophe strikes some Atomic Wallet users, over $35M thought stolen",
    "Atomic Wallet Hit by $35M Theft in Recent Crypto Breach"
]