[
    "ChatGPT should include inline tips",
    "How I finally learned to love ChatGPT",
    "A lawyer used ChatGPT to prepare a court filing. It went horribly awry.",
    "International Business Times",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Fidelity Slashes Value of Its Twitter Stake Once Again",
    "Twitter's Value Dives Again. Elon Musk's Purchase Is Looking Even Worse.",
    "Twitter has lost 66% of its value since Elon Musk bought it",
    "Fidelity Values Twitter At Roughly $15 Billion—A Third Of The Sticker Price Paid By Musk",
    "Twitter only worth 33% of what Musk-led investors paid, Fidelity says",
    "Twitter is Approving Far More Government Censorship Requests Under Elon Musk",
    "Twitter is now worth one-third what Elon Musk paid",
    "Report: Twitter Now Worth a Third of $44B Purchase Price",
    "Fidelity marks down value of Twitter stake again",
    "Why AI Scientists Are Freaking Us Out",
    "Twitter's worth down to just $15 bn under Musk: Report",
    "Fidelity: Twitter is Now Only Worth a Third of What Elon Musk Paid for It",
    "Twitter now worth just 33% of Elon Musk's purchase price",
    "how many D is this chess? https://www.bloomberg.com/...",
    "Yikes. This means Fidelity values Twitter around ~$15 billion [image]",
    "The idea that billionaires can run things better than anyone else is dumb https://twitter.com/...",
    "Only took seven months, too. https://www.bloomberg.com/... [image]",
    "Destroying that much value in such a short period isn't easy to do. https://twitter.com/...",
    "Elon took on $13bn of debt to buy Twitter https://twitter.com/...",
    "Pixel Watch 2 key specifications leaked, a more powerful chipset expected",
    "Google Pixel Watch could get a massive battery life upgrade",
    "Google Pixel Watch 2 could fix its predecessors' biggest flaw",
    "Google's next Pixel Watch could sport better battery life",
    "Google's Pixel Watch 2 May Have Insane Battery Life",
    "Google Pixel Watch 2: Rumoured battery life leap set to impress",
    "Google to say goodbye to Exynos chips with Pixel Watch 2",
    "Pixel Watch 2 to have a better battery life and chip",
    "The Pixel Watch 2 might have much better battery life",
    "The Pixel Watch 2 might kiss Samsung chips goodbye to improve battery",
    "Pixel Watch 2 Rumored to Feature the Snapdragon W5 Chipset",
    "This Pixel Watch 2 leak just made it the 2023 smartwatch I can't wait for",
    "Google Pixel Watch 2 to ditch Samsung-made Exynos processor",
    "Pixel Watch 2 could feature improved processor, more health sensors",
    "The Pixel Watch 2 will reportedly get a major bump in performance and battery life",
    "Google's Pixel Watch 2 will reportedly have significantly improved battery life",
    "New Pixel Watch 2 Processor Boosts Battery in a Big Way, Leaked Specs Suggest",
    "Pixel Watch 2 could ditch Exynos for Snapdragon and gain more battery life",
    "This Google Pixel Watch 2 upgrade could solve the first model's biggest problem",
    "Pixel Watch 2 tipped to gain increased battery life thanks to a new chip",
    "Google's Pixel Watch 2 could vastly improve its predecessor's battery life, power, and sensors",
    "Google Pixel Watch 2: News and Expected Price, Release Date, Specs; and More Rumors",
    "Google Rumored to Switch to Snapdragon Chip in Pixel Watch 2",
    "Thought the first one would get W5 but it makes sense here https://twitter.com/...",
    "BabyLM Challenge  —  Summary: This shared task challenges community members to train …",
    "Four LLM trends since ChatGPT and their implications for AI builders",
    "MoonPay executives pocketed $150 million raised from Series A",
    "This was among the biggest secondary share sales *ever* for such a young company.",
    "Stories like this get my ears ringing https://twitter.com/...",
    "The Download: meet the longevity obsessives, and how China's regulating AI",
    "A new verb. https://www.reuters.com/...",
    "Block Party Resource Center",
    "Block Party's Twitter product is on indefinite hiatus as of May 31",
    "Anti-harassment service Block Party leaves Twitter amid API changes",
    "Popular anti-troll tool Block Party shuts down",
    "Product FAQ  —  Twitter Product Hiatus Why is Block Party's Twitter product on indefinite hiatus?",
    "just fell to my knees. this app has been so vital to my safety on here https://twitter.com/...",
    "Data about Apple's AR headset screens has been leaked",
    "Apple's VR/AR headset is coming. Here's everything we know so far",
    "Is Apple's weird headset the future?",
    "The Apple VR headset display could be 50 times brighter than your Oculus Quest 2's",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Rumored 4K screens could allow Apple VR/AR headset to offer real world-like clarity",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple's mixed reality headset will reportedly have some insane brightness levels",
    "Apple's First AR/VR Headset Could Offer Impressive Display Specs",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "Apple's Reality Pro headset could feature 4K resolution per eye and 5000 nits of brightness",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Here are the specs for Apple's ‘Reality One’ XR headset displays",
    "Apple Reality Pro leak reveals a seriously high-res display—4K for each eye",
    "Apple AR/VR Headset Display Specs Revealed Ahead of WWDC",
    "Apple hints and leaks all but confirm xrOS — here's what we know",
    "Apple Headset to Feature 4K Micro-OLED Displays With 5000 Nits of Brightness [Report]",
    "Apple mixed-reality headset display specs leak",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate",
    "Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges",
    "Twitter launches Community Notes for images",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Twitter Expands Crowdsourced Fact-Checking Following Phony Viral Photo",
    "Twitter is testing Community Notes for images",
    "NomuPay Raises $53.6M in Funding",
    "Removing the multiples, Ireland's NomuPay nomz nomz on $53.6 million",
    "‘All access pass’ payments platform NomuPay raises $53.6 million",
    "Ireland-based fintech platform NomuPay secures €50.1M for cross-border payments; Know more",
    "Unified payments platform NomuPay raises $53.6M in Series A round",
    "ASM Sees Impact From China Chip Curbs Offset by AI-Driven Demand",
    "The interactive is also beautifully produced. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Monzo moves into profit as credit loss provisions dent FY2023 accounts",
    "British digital bank Monzo hits monthly profitability for the first time after spike in lending",
    "Twitter Alternative Bluesky Hits 100k Members Before Exiting Beta",
    "Cool article about @fiatjaf, @arcbtc and the beginnings of nostr https://www.forbes.com/...",
    "Personalized wealth management, built for tech people",
    "Beyond data collection: Exploring the uses for online forms - Part I (Payments)",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/30 - Nvidia Joins The $1T Club",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Foxconn's Young Liu says AI demand to boost server business",
    "Apple's iPhone Maker Expects to More Than Double AI Server Sales",
    "Foxconn sees AI driving strong server demand, but full year to be flat",
    "Taiwan's Foxconn predicts huge growth in AI server business",
    "Foxconn chairman: we won't be absent in the AI server market",
    "Chinese organisations launched 79 LLMs since 2020",
    "HP Sales Decline Worse Than Expected as PC Slump Continues",
    "HP revenues plummet as printers, PC sales all fall",
    "HP Revenues Fall 22 Percent on Lower PC Sales",
    "HP: AI can change the role of PCs",
    "HP slips as Q2 earnings top expectations, keeps full-year cash flow forecast",
    "As traditional revenue streams dry up, both HPE and HP target AI-driven growth",
    "HP Misses Revenue Target Amid Continued Soft PC Sales",
    "HPE rides edge computing, HPC growth in fiscal Q2",
    "2023 Second Quarter Results",
    "Transak Secures $20M in Series A to Strengthen Development of Web3 Onboarding Solutions",
    "Transak Bags $20 Mn To Scale Web3 Payments & Onboarding Infra Solutions",
    "Series-A Announcement: Transak Secures $20M to Solve Web3 Onboarding End-To-End",
    "Web3 Platform Transak Raises $20 Million Series A",
    "Web3 Startup Transak Secures $20M in a Series A Round Led By CE Innovation Capital",
    "Binance Deliberates on Enabling Traders to Keep Collateral at Banks: Report",
    "Binance Revolutionizes Security: Traders Can Now Secure Collateral at Banks",
    "Binance Mulls Letting Some Clients Keep Trading Collateral at Banks: Report",
    "Binance Has A Master Plan To Manage Crypto Risk By Letting Traders Hold Collateral In Banks",
    "Binance considers allowing investors to hold collateral in banks",
    "Binance considers allowing traders to secure collateral at banks: Report",
    "Binance Considers Plan for Traders to Hold Collateral in a Bank",
    "Binance Considers Allowing Traders to Store Collateral in Banks",
    "Binance May Allow Institutional Clients To Keep Collateral At A Bank",
    "Binance in Talks To Let Traders Keep Collateral at a Bank: Bloomberg",
    "Binance mulls plan to let traders hold collateral in a bank: Bloomberg",
    "Tesla escapes recalls for allowing ‘in-motion’ gaming in its vehicles",
    "NHTSA ends probe into Tesla's driver-accessible gaming feature",
    "US agency closes investigation into Tesla game feature",
    "Tesla is off the hook for allowing gaming while driving",
    "Tesla cleared by NHTSA for in-car gaming feature",
    "Supreme Court rejects lawsuit that sought to hold Reddit responsible for hosting child pornography",
    "SCOTUS Declines to Hear Reddit Child Sex Abuse Case, Handing Big Tech a Win",
    "Supreme Court declines request seeking to hold Reddit liable for alleged child porn",
    "U.S. Supreme Court declines to hear bid to sue Reddit over child porn",
    "No more talking to Amitabh Bachchan on Alexa as Amazon kills celebrity voice feature",
    "Amazon's Alexa Will No Longer Sound Like Shaquille O'Neal",
    "Sorry, but Alexa can no longer talk like Samuel L. Jackson",
    "Amazon is retiring its celebrity voice feature on Alexa",
    "Farewell, celebrity voices on Alexa",
    "Amazon's Alexa Is Losing Its Celebrity Voices Like Melissa McCarthy & Samuel L. Jackson",
    "Say Goodbye to Amazon Alexa's Celebrity Voices",
    "Amazon ends Alexa celebrity voices: How to get a refund on voices you bought",
    "These Celebrity Voices Are Disappearing From Amazon's Alexa",
    "Amazon Scraps Alexa Celebrity Voices, And Samuel L. Jackson Is The First To Go",
    "Buy a Celebrity Voice for Your Alexa Device? Get Your Refund!",
    "Amazon has discontinued its celebrity voices program for Alexa",
    "Amazon Pulls Plug on Alexa Voices From Melissa McCarthy, Samuel L. Jackson, Shaquille O'Neal",
    "Amazon is ending support for Alexa's celebrity voices soon",
    "Amazon yanks Alexa's paid celebrity voices, no word on refunds",
    "Amazon ditches Alexa's celebrity voices and will issue refunds upon request",
    "Amazon is ending celebrity voices for Alexa that delivered weather, jokes and more",
    "First deep fake ad on Twitter (mis)using a Guardian link https://twitter.com/...",
    "The Gaming Startups Bucking the Funding Drought",
    "Australian Financial Review",
    "Nvidia Touches $1 Trillion Mark After Beating Rivals to AI",
    "Cathie Wood Says Software Stocks Will Ride AI Wave Next — These Three Could Rival Nvidia",
    "Nvidia set to become first chipmaker valued at over $1 trillion",
    "Nvidia has AI to thank for entering the $1 trillion club",
    "Nvidia Breaks the $1 Trillion Market Cap Threshold",
    "What makes Nvidia's chips so special during this AI boom?",
    "NVIDIA Becomes the First Chipmaker to Join the Trillion-Dollar Club",
    "Just 5 stocks including Nvidia account for 96% of the S&P 500's gains this year",
    "Nvidia became a $1 trillion company thanks to the AI boom",
    "Nvidia hits $1 trillion valuation riding AI wave",
    "Nvidia hits $1 trillion market cap as the chipmaker unveils more AI products",
    "Nvidia joins $1 trillion valuation club: Here's how it rose to the top",
    "Nvidia Soars to $1 Trillion Valuation Driven by AI Revolution",
    "NVIDIA Approaches $1 Trillion Valuation as Investors Embrace AI Boom",
    "AI demand briefly catapults Nvidia into $1 trillion club",
    "Nvidia touches $1 trillion market cap as chipmaker rides AI wave",
    "Nvidia joins $1 trillion club after beating rivals to AI",
    "Chat-powered AI boom is helping rewrite the winners and losers of the chip market",
    "Nvidia briefly worth $1 trillion thanks to AI boom",
    "Nvidia Soars to $1 Trillion Market Cap on the Back of AI Hype",
    "Nvidia becomes the first chipmaker to hit $1 Trillion market cap, thanks to the AI boom",
    "Nvidia's $1 trillion valuation sees crypto AI tokens surge",
    "Nvidia Enters a Highly Exclusive Club",
    "Nvidia's market capitalization tops $1T for the first time",
    "Chipmaker Nvidia joins exclusive $1 trillion companies club",
    "Nvidia becomes a $1 trillion company on the back of AI explosion",
    "Nvidia passes $1 trillion market cap as investors fall in love with AI",
    "NVIDIA: Revolutionizing the Tech Landscape with Generative AI",
    "NVIDIA is now worth $1 trillion - and it's all about AI, not gaming GPUs",
    "NVIDIA's Value Now Exceeds $1 Trillion",
    "NVIDIA Surpasses $1 Trillion Market Cap",
    "Nvidia smashes $1trn valuation spurred by its savvy AI deals",
    "Red-hot stock: $1 trillion club now includes chip maker Nvidia",
    "Nvidia stock soars: How the AI boom lifted the chipmaker's market cap",
    "Nvidia Surge Results in Historic $1 Trillion Market Valuation",
    "Nvidia hits $1 trillion in market value on booming AI demand",
    "Nvidia Surpasses $1 Trillion Market Capitalization",
    "Nvidia becomes first US chipmaker valued at over $1 trillion; joins exclusive FAANG group",
    "Nvidia hits $1T market cap as market opens",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Nvidia hits $1tn market cap as chipmaker rides AI wave",
    "Nvidia Set for $1 Trillion Market Cap",
    "NVIDIA is now worth 1 trillion dollars",
    "Nvidia stock set to hit $1 trillion market cap for the first time",
    "Nvidia CEO Gets Rock Star Reception in Taiwan With AI Stock Surge",
    "Nvidia Isn't The Only One Getting a Massive AI Boost",
    "Nvidia CEO Says Intel's Test Chip Results For Next-Gen Process Are Good",
    "Intel Cedes Spotlight at Global Tech Gala to AI Darling Nvidia",
    "Intel is struggling to make good on its chip-making bet",
    "Silicon Valley Business Journal",
    "Intel's contract chipmaking business is off to a mixed start",
    "Can Intel Compete With Taiwan Semi? Nvidia CEO Says Test Chips ‘Look Good.’",
    "The game programming flex of all time. [video]",
    "This is the 2023 version of the Last of Us Part 2 rope physics https://twitter.com/...",
    "@yaeleisenstat.bsky.social",
    "Artificial intelligence could lead to extinction, experts warn",
    "AI ‘godfather’ Yoshua Bengio feels ‘lost’ over life's work",
    "AI Poses ‘Risk of Extinction’ on Par With Pandemics and Nuclear War, Tech Executives Warn",
    "The Morning After: Industry leaders say AI presents ‘risk of extinction’ on par with nuclear war",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in 22-word statement",
    "OpenAI's Altman and other AI giants back warning of advanced AI as ‘extinction’ risk",
    "A.I. poses human extinction risk on par with nuclear war, Sam Altman and other tech leaders warn",
    "Researchers and industry leaders warn about AI and a ‘risk of extinction’",
    "Experts and CEOs warn of extinction risk posed by AI, compare dangers to nuclear war",
    "AI, extinction, nuclear war, pandemics ... That's expert open letter bingo",
    "AI leaders warn about ‘risk of extinction’ in open letter",
    "Top AI titans unite to sign a letter against AI dangers",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "Runaway AI Is an Extinction Risk, Experts Warn",
    "AI poses existential risk, warn tech leaders in open letter",
    "AI leaders sign an open letter to openly acknowledge the dangers of AI",
    "Eminent AI experts and corporate heads caution about the probability of ‘extinction risk’",
    "AI poses “risk of extinction,” leading researchers and CEOs warn in 22-word statement",
    "What is the real point of all these letters warning about AI?",
    "Industry leaders warn ‘AI poses risk of extinction’",
    "Next generation arms race could cause ‘extinction’ event akin to nuclear war, pandemic: tech chief",
    "Leading experts warn of a risk of extinction from AI",
    "Prominent AI leaders warn of ‘risk of extinction’ from new technology",
    "The AI hallucinations intensify",
    "AI is an ‘extinction risk’ for humanity, say tech industry leaders",
    "‘The Risk of Extinction:’ AI Leaders Agree on One-Sentence Warning About Technology's Future",
    "Artificial Intelligence leaders warn of ‘risk of extinction’ from AI",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in joint statement",
    "AI experts sign doc comparing risk of ‘extinction from AI’ to pandemics, nuclear war",
    "ChatGPT creators and others plead to reduce risk of global extinction from their tech",
    "Mitigating risk of ‘extinction’ from AI technology should be ‘global priority’, experts say",
    "In 22 Words, Tech Leaders Warn of Colossal AI Risks",
    "OpenAI execs warn of “risk of extinction” from artificial intelligence in new open letter",
    "Are AI execs worried there's a dark future looming for AI?",
    "Coalition of AI leaders sees ‘societal-scale risks’ from the technology's misuse",
    "Geoffrey Hinton, Yoshua Bengio warn “risk of extinction from AI” in public letter",
    "Risk of extinction by AI should be global priority, say experts",
    "AI Is as Risky as Pandemics and Nuclear War, Top CEOs Say, Urging Global Cooperation",
    "Top AI CEOs, experts warn that humans may face risk of extinction from AI",
    "AI experts and industry leaders issue warning on AI risks",
    "AI poses ‘extinction’ risk comparable to nuclear war, pandemics: experts",
    "Top AI experts warn of tech's ‘risk of extinction’ — similar to nuclear weapons, pandemics",
    "We can't put the ChatGPT AI genie back in the bottle, even if it means risking extinction",
    "AI Experts From Google, OpenAI And Elsewhere Issue Dire Extinction Warning",
    "‘Extinction event’ from AI? Yes, tech leaders warn in call for controls",
    "OpenAI and Google DeepMind CEOs Sign Statement Warning That AI Poses “Risk of Extinction”",
    "Artificial intelligence threatens extinction, experts say in new warning",
    "AI Could Cause Human ‘Extinction,’ Tech Leaders Warn",
    "AI executives warn its threat to humanity rivals ‘pandemics and nuclear war’",
    "Scientists, experts saying mitigating ‘extinction’ risk of AI should be global priority",
    "Artificial intelligence poses ‘risk of extinction,’ tech execs and experts warn",
    "The hotdog guy in this instance is the New York Times lol https://twitter.com/...",
    "Couldn't buy better PR if you tried https://twitter.com/...",
    "This has quickly become the self aggrandizement super bowl https://twitter.com/...",
    "They're not warning they're bragging https://www.nytimes.com/...",
    "Panicky or visionary? https://twitter.com/...",
    "This seems promising https://www.safe.ai/... (organized by @ai_risks) [image]",
    "I was proud to sign this statement alongside a remarkable list of experts https://twitter.com/..."
]