[
    "@FrankPasquale@mastodon.social",
    "Junk websites filled with AI-generated text are pulling in money from programmatic ads",
    "Digital Work: Pick Up the Rake and Get with the Program",
    "Sounds like we're going to need AI to police AI.  —  https://www.theverge.com/...",
    "“A.I. is overwhelming the internet's capacity for scale” https://www.theverge.com/...",
    "Now is the time of monsters. https://www.theverge.com/...",
    "AI is polluting the web with low quality content and spam. https://twitter.com/...",
    "Great and damning piece from @jjvincent: https://www.theverge.com/...",
    "AI is killing the old web, and the new web struggles to be born",
    "‘AI is Killing the Old Web’ 1",
    "Junk News Sites Are Abusing Ad Systems With AI-Generated Content",
    "Next-gen content farms are using AI-generated text to spin up junk websites",
    "Blue Chip Ads Feeding Unreliable AI-Generated News Websites",
    "Made for Advertising Sites Are Programmatic's Latest Boogeyman",
    "Ads for major brands are appearing on AI-generated spam sites",
    "Lawyers: Email proves Microsoft's Activision bid is designed to eliminate PlayStation",
    "Microsoft considered acquiring Bungie and Sega to bolster Xbox Game Pass, internal emails show",
    "Microsoft Considered Xbox Acquisition Push to Drive Sony out of Business",
    "All the new things we've learned from Microsoft and the FTC's internal documents at court",
    "Microsoft's Potential Game Plan in 2020: ‘Spend Sony Out of Business’",
    "Microsoft wanted to buy Sega, Bungie and Io Interactive before Activision Blizzard",
    "Microsoft seriously considered acquiring Sega and Bungie to bolster Xbox Game Pass",
    "Xbox exec Matt Booty wanted to “spend Sony out of business”",
    "More Microsoft Xbox email and document leaks show cloud investment plans and more",
    "Xbox Game Studios' VP Was Prepared to ‘Spend Sony Out of Business’ to Grow the Xbox Brand",
    "Xbox Looked at Acquiring Sega, Supergiant, Bungie",
    "Xbox Game Studios Head Wanted to “Spend Sony Out of Business” in December 2019",
    "Xbox Studios Head Said Microsoft Could ‘Spend Sony Out of Business’ in 2019 Email",
    "Microsoft Considered Acquiring Sega To Help Bolster Game Pass",
    "Xbox Aimed to “Spend Sony Out of Business,” Acquisitions/Cloud Prioritized over XSX Supply",
    "Microsoft's Proposed Strategy To “Spend Sony Out Of Business” Revealed In 2019 Internal Email",
    "Xbox internal emails: Microsoft ‘positioned’ to ‘spend Sony out of business’",
    "Internal Email Reveals Microsoft Seriously Considered Buying Bungie and SEGA",
    "Microsoft was ready to ‘go spend Sony out of business’ to strengthen Xbox",
    "Microsoft was ready to “go spend Sony out of business” to strengthen Xbox",
    "Apple inventing tech to make iPhone & Apple Watch screens last longer",
    "Ron Amadeo's Pixel Fold Lasted Four Days",
    "Google Pixel Fold: 7 unfiltered thoughts after 8 days with the device",
    "Gurmanizing Apple's OLED Plans With Added Kuo",
    "The Pixel Fold is brilliant, according to reviews, but is Google's quality control a problem?",
    "Google Pixel Fold display breaks already — and this could be the cause",
    "Google Pixel Fold vs Samsung Galaxy Z Fold 4: Which one should you get?",
    "The Pixel Fold shows how far ahead Samsung's folding phones are",
    "I lost interest in Google's Pixel Fold after this story about a display breaking",
    "A Google Pixel Fold has died after just four days: Questions on durability",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Pixel Fold Breaks in Just 4 Days For High-Profile Reviewer",
    "Someone's Pixel Fold has died already and the bezels may be to blame",
    "Google Pixel Fold review: It's what's on the inside that counts",
    "Reviewer's Pixel Fold unit display wrecked exposing potential design vulnerability",
    "Google Pixel Fold Review: Smooth Innovation At A Considerable Cost",
    "Google Pixel Fold review: it surprised the heck out of me",
    "This is the reason you might choose the Pixel Fold over the Galaxy Z Fold 5",
    "Sorry. https://arstechnica.com/...",
    "RIP to my Pixel Fold: Dead after four days",
    "Ars Technica: “RIP to my Pixel Fold: Dead after four days”",
    "Google Pixel Fold review: Wider is better",
    "Marques Brownlee on YouTube",
    "@jstevenyork@mastodon.social",
    "The Morning After: The verdict on Google's Pixel Fold",
    "Does the Google Pixel Fold have a pen?",
    "Google Pixel Fold Initial Review: Shockingly good, but is it worth the money?",
    "Google Pixel Fold just beat Samsung for best foldable phone",
    "Google Pixel Fold: An Excellent Foldable Phone With One Big Problem",
    "Google Pixel Fold Review: Foldable Phones Are Improving",
    "Google Pixel Fold review: The first foldable phone that gets it right",
    "Allison Johnson Reviews the $1,800 Google Pixel Fold",
    "Pixel Fold review roundup: Google's turning heads and hinges",
    "Google Pixel Fold Review: A Promising Start, but Not Perfect",
    "Google Pixel Fold is a quality first swing at a foldable",
    "Google Pixel Fold unboxing and first impressions [VIDEO]",
    "Google Pixel Fold Review: Maybe Next Year!",
    "Google Pixel Fold Review: For Those Who Really Want to Multitask",
    "Is the Google Pixel Fold the best foldable? This feature could convince me it is",
    "Google Pixel Fold review: First impressions of Google's $1800 folding phone",
    "Google Pixel Fold review: Competent, not captivating",
    "Tried this briefly at Google I/O and I kinda want a foldable phone now... https://twitter.com/...",
    "Ron from ars technica's pixel fold broke",
    "Ars Technica: RIP To My Pixel Fold After Four Days",
    "FDA creates path for psychedelic drug trials",
    "International Business Times",
    "Decentralized Twitter rival Damus will be removed from the App Store over Bitcoin tipping",
    "Jack Dorsey to Tim Cook: 'Why Doesn't Apple Pay Support Bitcoin'",
    "Twitter Founder Questions Why Apple Pay Doesn't Support Bitcoin",
    "Apple Boots Out Jack Dorsey-Backed Damus From App Store Over Bitcoin Tipping Feature",
    "Decentralised social network Damus to be kicked from App Store",
    "Bitcoin Tipping Service Damus Gets Booted From Apple App Store",
    "Damus Zaps vs. the App Store",
    "Tips aren't unlocking content, @Apple https://twitter.com/...",
    "Why doesn't Apple Pay support bitcoin @tim_cook? https://twitter.com/...",
    "Apple must be stopped. https://twitter.com/...",
    "This is why I prefer web apps! We need decentralization!! https://twitter.com/...",
    "App Store policies becoming too aggressive?",
    "Look mom, we made the paper! Exciting time for the team at @AbridgeHQ. https://twitter.com/...",
    "Thomson Reuters to acquire legal AI firm Casetext for $650 mln",
    "Thomson Reuters Adds to AI Stable With $650M Casetext Deal",
    "Thomson Reuters Corporation Signs Definitive Agreement to Acquire Casetext",
    "Inaugural YC Top Companies List by Revenue",
    "Data security startup Cyera lands a $100M investment",
    "UT Mourns Lithium-Ion Battery Inventor and Nobel Prize Recipient John Goodenough",
    "Lithium-ion battery pioneer John Goodenough dies, aged 100",
    "Co-creator of lithium-ion battery and the oldest Nobel winner dies at age 100",
    "John Goodenough, a Battery Trailblazer, Dies at 100",
    "John Goodenough, creator of the lithium-ion battery, dies at 100",
    "Oldest person to win Nobel Prize, a force lithium battery development, dies",
    "Lithium-ion battery creator John Goodenough dies at 100",
    "Will sodium-ion battery launch stabilize lithium carbonate prices?",
    "John Goodenough, Creator Of The Lithium Ion Battery, Dead At 100",
    "John Goodenough, Nobel laureate and battery pioneer, dies at 100",
    "After decades contributing to science, John Goodenough powers down",
    "John Goodenough, Nobel laureate and Li-ion battery inventor, dies at 100",
    "John B. Goodenough, who shared a Nobel Prize for his work on the lithium-ion battery, has died",
    "John B. Goodenough, 100, Dies; Nobel-Winning Creator of the Lithium-Ion Battery",
    "John Goodenough, Lithium-Ion Battery Inventor and Nobel Prize Recipient, Dies",
    "Introducing ERNIE 3.5: Baidu's Knowledge-Enhanced Foundation Model Takes a Giant Leap Forward",
    "Baidu Claims Ernie Bot Outperforms OpenAI's ChatGPT",
    "Baidu Says Ernie 3.5 Outdid ChatGPT and GPT-4 in Key Metrics",
    "China's Baidu says its new AI beat ChatGPT on some metrics",
    "China's Baidu claims its Ernie Bot beats ChatGPT on key tests as A.I. race heats up",
    "Baidu's Ernie AI chatbot outperforms ChatGPT, company says",
    "Baidu incorporates plugin functionality into ERNIE Bot",
    "@Techmeme I'm really excited to have Ernie summarize the Tiananmen Square Massacre.",
    "TikTok is jumping off the BeReal bandwagon by killing TikTok Now",
    "TikTok Now is the latest BeReal knockoff",
    "TikTok is shutting down its BeReal clone https://www.theverge.com/...",
    "‘Last minute’ law change bid to ‘muzzle’ critics of Data Protection Commission - ICCL",
    "Irish Gov makes critizising Big Tech and Irish DPC a crime!",
    "Irish Council for Civil Liberties",
    "Last-minute Government amendment seeks to muzzle DPC critics",
    "New Irish law might make data protection procedures confidential",
    "ICCL says “last minute” amendments to bill aim to “muzzle” critics of DPC",
    "ICCL accuses government of seeking to ‘muzzle’ DPC critics",
    "Irish Government Accused of Trying to Muzzle Privacy Critics",
    "Irish government criticized over proposed law-change that would ‘muzzle’ Big Tech critics",
    "Irish Gov Makes Critizising Big Tech and Irish DPC a Crime",
    "Amazon's AI-powered robots to revolutionise warehouse automation",
    "How Amazon deploys collaborative robots in its operations to benefit employees and customers",
    "US to spend $42 billion to make internet access universal by 2030",
    "Broadband subsidies: How much will your state receive?",
    "Biden announces $42 billion to expand high-speed internet access",
    "White House announces over $42 billion to expand high-speed broadband access across the U.S.",
    "Biden announces $42 billion high-speed internet initiative",
    "White House announces $40 billion in broadband funding",
    "White House announces state BEAD allocations",
    "US President Unveils $42B Initiative for High-Speed Internet Initiative in America",
    "Govt announces breakdown of USD42.25bn BEAD programme funding; Texas tops the list with USD3.3bn",
    "Biden unveils $42 billion broadband internet plan",
    "Biden Unveils $42B Investment In Universal Internet Access",
    "US announces $42 billion plan to make high-speed internet universal by 2030",
    "White House Announces $42 Billion to Expand Broadband Across US",
    "Biden lines up $42.5B for US broadband boost",
    "More than $42 billion in broadband funding allocations announced",
    "US announces $42 billion program for affordable high-speed broadband",
    "U.S. to spend $42 billion to expand broadband internet access under Biden plan",
    "US allocates $42B in broadband funding—find out how much your state will get",
    "U.S. to Invest $42 Billion in Universal Internet Access",
    "White House Announces Historic $42 Billion Investment in Nationwide Broadband Access",
    "States to Learn Their Share of $42.5 Billion in Federal Broadband Money",
    "North Carolina lands $1.5 billion in federal broadband infrastructure funding",
    "Here's how much every state is getting from BEAD grant program",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Meta is rolling out new parental control tools for Instagram and Messenger",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Meta is giving parents more visibility into who their teens are messaging on social media",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Meta thinks teens need help to stop using Facebook.A new batch of parental supervision features …",
    "Meta launches more parental supervision tools for Instagram. Is it enough?",
    "Facebook adds parental control tools to Messenger",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Stability AI's head of research quits",
    "Mark Zuckerberg announced upcoming release of new business features for WhatsApp",
    "WhatsApp Business reaches 200 million users, will allow Facebook ads without an account",
    "Making it Easier for Small Businesses to Connect with More Customers",
    "Good news - WhatsApp will soon let businesses send you personalized messages",
    "WhatsApp Business Announces 200M Active Users and Launches Personalized Customer Messages",
    "WhatsApp Business users jump four-fold in three years",
    "Here's how WhatsApp Business app's new features will benefit small businesses",
    "Zuckerberg announces new features coming on WhatsApp Business app",
    "Personalized wealth management, built for tech people",
    "Socure Acquires Berbix for Approx. $70M",
    "Socure's $70 million acquisition of Berbix: What it means for the identity verification market",
    "Socure Buys Berbix for $70M to Fortify Identity Verification",
    "Socure Acquires ID Verification Company Berbix for $70 Million",
    "Snowflake partners with Nvidia, expands Microsoft partnership",
    "Snowflake, Nvidia partner to enable generative AI app development in the Snowflake Data Cloud",
    "Nvidia, Snowflake to help enterprises build customised AI apps",
    "Nvidia, Snowflake announce partnership for custom generative AI models",
    "Snowflake adds partnerships with Nvidia and Microsoft for AI double play",
    "Snowflake and Nvidia bring generative AI to Data Cloud",
    "Snowflake and Nvidia partner to let businesses use their own data to build custom AIs",
    "Nvidia Partners With Snowflake to Bring More AI Power to Corporations",
    "Snowflake, Nvidia team up to enable custom enterprise generative AI apps",
    "Redpanda raises $100M as streaming data demand grows",
    "Redpanda Raises $100M in Series C Funding",
    "Redpanda lands $100M to expand its streaming data pipelines",
    "Free compensation benchmarking data from 3,000 startups",
    "5 common data and analytics pitfalls businesses should avoid",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/26 - The M&A Deluge In AI Begins",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Cart.com Announces $60 Million Series C Funding Round at $1.2 Billion Valuation",
    "EU launches four new testing facilities to develop responsible AI",
    "EU to open artificial intelligence ‘crash test’ centres",
    "Europe launches massive AI test facilities",
    "NoTraffic Raises $50 Million For Its AI Powered Traffic Monitoring Platform",
    "Israeli mobility platform NoTraffic raises $50m",
    "NoTraffic closes on $50M funding round to accelerate smart traffic management",
    "Can AI help reduce traffic jams? NoTraffic raises $50M to outfit roads with smart sensors",
    "Byju's likely in advance talks to raise $1 billion funding to prevent investors revolt: Report",
    "India's Byju's seeks to raise $1 bln to stave off investor revolt - Bloomberg News",
    "Amid Mounting Troubles, BYJU'S Seeks $1 Bn To Fight Off Investor Pressure",
    "OpenAI reportedly plans “supersmart” ChatGPT business assistant",
    "Someone has made ChatGPT for Windows 3.1 and it's hilarious",
    "Would an OpenAI work assistant put the company in conflict with Microsoft?",
    "Telegram Stories with customizable expiration times are coming next month",
    "Telegram will get Stories feature before Samsung's Unpacked event",
    "Telegram Stories feature is coming in July 2023: Here's the first look",
    "Telegram is soon getting its own version of Stories: Check details inside",
    "Telegram CEO Pavel Durov confirms Stories are coming to the messaging app next month",
    "Telegram announces Stories with lifespan from 6 hours",
    "Telegram will introduce Stories in July, it's official",
    "Telegram gets new feature ‘Stories’; Arriving in early July",
    "Romance Novel Recommendations From Authors Who Love the Genre",
    "First pushback against EU's Digital Services Act and it's not Google",
    "Legal battle erupts over EU's groundbreaking digital rules",
    "Zalando Takes the EU to Court Over Its New Digital Rules",
    "Zalando sues EU Commission over landmark online content rules",
    "Twitter's new TikTok copycat is filled with animal cruelty videos. Elon calls content “Edgy”",
    "Just swipe up to see the next video",
    "FTX splurged on cartoon, book about humans and ‘Pineapple House,’ alleges CEO",
    "FTX Debtors Release Second Investigative Report",
    "The history of crypto exchanges trading against their own customers",
    "FTX CEO reveals extravagant expenditures on silly cartoon",
    "FTX recovers $7b, making strides in creditor repayment",
    "FTX's New Management Recovers $7 Billion in ‘Substantial Progress’",
    "FTX Misused Customer Funds Since The Beginning, New CEO Claims",
    "New FTX Management Team Recovers $7 Billion In Liquid Assets",
    "FTX Recovers $7 Billion in Assets in Liquid Assets",
    "FTX debtors release second investigative report, details on commingling and misuse of deposits",
    "FTX Owes its Customers A lot of Money: Internal Audit",
    "FTX Exchange in $8.7B Debt to Clients Amid Bankruptcy: Misappropriation of Funds Revealed",
    "FTX Recovers $7 Billion As New Investigative Report Is Released",
    "FTX Lied to Banks for Years About Commingling Funds, New CEO Claims",
    "is it good when the flow of commingled funds looks like this [image]",
    "Puts those “FTT isn't worthless” claims in a new light. https://twitter.com/...",
    "hell of a flow chart from an FTX bankruptcy filing, showing commingled funds [image]",
    "FTX Bankruptcy Team Says the Exchange Owed Customers $8.7B",
    "DeepMind claims its next chatbot will rival ChatGPT",
    "Google DeepMind CEO takes aim at ChatGPT with next version of AI",
    "Google says its next AI ‘Gemini’ will be more powerful than ChatGPT",
    "Will Google DeepMind's AI Chatbot Kill OpenAI's ChatGPT?",
    "DeepMind's Gemini: Google's Bid to Eclipse OpenAI's ChatGPT",
    "Deepmind founder shares details on Gemini, Google's next-gen response to GPT-4",
    "DeepMind develops Gemini chatbot, rivals OpenAI's ChatGPT",
    "Google DeepMind Claims Its New Algorithm Will Trump ChatGPTs",
    "Google DeepMind devises a strategy to outwit ChatGPT with Gemini",
    "“Google DeepMind's CEO says its next algorithm will eclipse ChatGPT”",
    "Google DeepMind's CEO Says Its Next Algorithm Will Eclipse ChatGPT",
    "Say Hello to Meta Quest+, Our New VR Subscription Service",
    "Introducing Meta Quest+ | VR Title Subscription",
    "Meta Unveils Curated VR Game Subscription Service Quest+",
    "How to run Steam games on Oculus Quest 2",
    "Meta's Quest+ subscription offers two VR titles per month",
    "Meta launches VR subscription service that costs $7.99 a month",
    "Meta Quest Plus VR subscription service: How much, why its necessary",
    "Meta Quest users get their own version of PS Plus",
    "Meta is launching a VR gaming subscription service called Meta Quest+",
    "Meta Quest Plus subscription service launches - and it's pretty decent value",
    "Meta launches a subscription service for virtual reality",
    "Meta Quest+ gaming subscription last roll for Meta's Metaverse",
    "Meta launches VR subscription service called Quest+",
    "Meta Quest+ is a new VR games subscription service launching today",
    "Meta now offers a Game Pass-like subscription called Quest Plus",
    "Meta Launches Quest+ Subscription Service for VR Experiences",
    "Meta's first VR subscription, Quest+, delivers two new titles to your library for $8/month",
    "Meta Launches Subscription Service on Games for Virtual Reality Headsets",
    "Meta Quest Now Has Its Own Games Subscription Service",
    "Meta announces its Quest+ subscription for VR gaming",
    "Meta Quest+ VR subscription launches at $7.99/mo",
    "Meta Quest+ VR Subscription Service Launches at $7.99/month",
    "Meta Launches VR Subscription Service",
    "Meta Launches ‘Meta Quest+’ VR Subscription For $7.99",
    "Meta Quest+ wants to be Game Pass for VR, but it doesn't stand a chance yet",
    "Meta Quest Plus subscription: How it works, and is it worth paying?",
    "Meta Quest+ Subscription Service Offers Cheaper Way to Get Into VR Games",
    "Meta Launches Quest+ VR Subscription Service",
    "Meta debuts PlayStation Plus-like Quest+ subscription",
    "Meta Quest+ VR Game Subscription Service Launches",
    "Meta unveils Meta Quest+ subscription service",
    "Meta Launches Monthly VR Game Subscription Service for Quest",
    "Meta announces Quest+, a VR subscription that will offer two titles every month",
    "Meta Quest Plus — Meta's VR gaming subscription is finally here",
    "Meta launches new VR subscription ‘Meta Quest+’ for $7.99",
    "Meta announces new VR subscription service Meta Quest+",
    "CalypsoAI raises $23M to add guardrails to generative AI models",
    "Databricks picks up MosaicML, an OpenAI competitor, for $1.3B",
    "MosaicML Agrees to Join Databricks to Power Generative AI for All",
    "Databricks Signs Definitive Agreement to Acquire MosaicML, a Leading Generative AI Platform",
    "Databricks to Acquire Generative AI Startup MosaicML",
    "Databricks snaps up MosaicML to build private, custom machine models",
    "Databricks buys AI darling MosaicML for $1.3B",
    "Deal Monday Returns With Spate of AI and Enterprise Acquisitions",
    "Databricks to acquire MosaicML for blockbuster $1.3B as M&A freeze thaws",
    "Databricks acquires AI startup MosaicML",
    "Databricks To Acquire Generative AI Startup In $1.3B Deal",
    "Databricks to Acquire AI Startup MosaicML for $1.3 Billion",
    "Databricks Buys Generative AI Startup MosaicML For $1.3B",
    "Databricks Acquires MosaicML To Make Generative AI More Accessible",
    "Databricks' $1.3 billion MosiacML acquisition to boost generative AI offerings",
    "Databricks acquires generative AI startup MosaicML in $1.3B deal",
    "Databricks' $1.3 billion buy of AI startup MosaicML is a battle for the database's future",
    "Databricks adds on to the Lakehouse, acquires MosaicML for $1.3 billion",
    "Databricks strikes $1.3 bln deal for generative AI startup MosaicML",
    "Man, two billion dollar acquisitions today.",
    "Instagram style acquisitions now going down in AI. This is a big deal for startups. [image]",
    "AI Software M&A is hot! https://twitter.com/...",
    "Databricks Strikes $1.3B Deal for Generative AI Startup MosaicML"
]