[
    "Inflection AI Secures $1.3 Billion Funding Led by Tech Titans and Industry Giants",
    "AI Chatbot Startup Rockets to $4 Billion Valuation With Microsoft, Nvidia Backing",
    "Inflection AI Raises $1.3 Billion From Reid Hoffman, Bill Gates and Nvidia",
    "AI Funding Explosion: Inflection AI Nabs $1.3B, Runway and Typeface Also Raise Big",
    "Inflection raises $1.3 billion from Microsoft, Nvidia, and others for generative AI",
    "Inflection lands $1.3B investment to build more ‘personal’ AI",
    "Inflection AI raises $1.3 bln in funding from Microsoft, others",
    "Microsoft and Nvidia join $1.3bn fundraising for Inflection AI",
    "Inflection AI Announces $1.3 Billion of Funding Led by Current Investors, Microsoft, and NVIDIA",
    "Inflection AI: Maker of Personal AI Chatbot Raises $1.3 Billion from Microsoft and Others",
    "Reid Hoffman personally invested in ...the AI company he co-founded? https://www.forbes.com/...",
    "Not concerning at all https://twitter.com/...",
    "Niantic Organizational Update",
    "Pokémon GO maker says Apple Vision Pro validates their work as it closes studio and cancels games",
    "Niantic is Laying Off Around 25% of Its Workforce, Shutting Down Some Games",
    "Niantic lays off 230 employees, cancels NBA and Marvel games",
    "Niantic shutters LA office, lays off 230 employees",
    "Pokémon Go maker to close LA studio",
    "‘Pokémon Go’ developer Niantic is laying off 230 employees",
    "Niantic lays off staff and shuts down games as it focuses on Pokémon Go",
    "Pokemon Go Maker Niantic Closes Studio, Cancels Games",
    "Niantic cancels projects, closes LA office to prioritize Pokémon Go",
    "Developer of Pokemon GO closes studio, cancels two games, and lays off 230 workers",
    "Pokemon Go developer Niantic Labs lays off 230 team members, cancels Marvel-based AR game",
    "Pokemon Go Developer Niantic Shuttering LA Studio, Canceling Marvel: World of Heroes",
    "Pokemon GO Developer Niantic is Laying Off Over 200 People",
    "Pokemon Go maker Niantic lays off 230 employees, cancels games",
    "Pokemon Go Dev Cancels Marvel Game, Lays Off 230 People",
    "Pokémon Go developer Niantic laying off hundreds of staff",
    "Pokemon Go still “top priority” as Niantic lays off 230 employees",
    "Pokemon Go studio Niantic is reportedly laying off 230 staff and cancelling its Marvel game",
    "Niantic lays off 230 staff, cancels two games, closes LA studio",
    "Niantic lays off 230 employees and cancels Marvel AR game",
    "Pokémon Go maker Niantic laying off hundreds, cancels NBA and Marvel games",
    "Pokémon GO dev to lay off 230+ employees, shutter a studio",
    "Niantic cuts hundreds of jobs and shuts down multiple games to focus on Pokémon Go",
    "Niantic is sunsetting NBA All-World",
    "@WarnerCrocker@mastodon.social",
    "@mercedesallen@mastodon.social",
    "@jeffjarvis@mastodon.social",
    "@joshmcconnell@mastodon.nz",
    "Google says it will start blocking Canadian news stories in response to new law",
    "Google is dropping local news links in Canada",
    "Google will locally remove Canadian news sites from Search, Discover over new law",
    "A Massive Own-Goal for the Government: Google to Stop News Links in Canada Due to Bill C-18",
    "Google will pull news links in Canada in response to new law",
    "Google to remove Canadian news links from Search, News, and Discover",
    "Google to block news in Canada on Search and other services over new law",
    "Our approach to news regulation",
    "Google to scrap local news links in Canada over Online News Act",
    "Canada fucked around and found out https://twitter.com/...",
    "This went well for other countries that went this route... https://twitter.com/...",
    "Google and Meta will stop showing Canadian sourced news",
    "@aristeon89@mastodon.online",
    "@therealahall@infosec.exchange",
    "@colincornaby@mastodon.social",
    "@emilygorcenski@indieweb …",
    "@MagentaRocks@mastodon.coffee",
    "@juandesant@astrodon.social",
    "Twitter's New Chief Eases Into the Hot Seat",
    "Inside Linda Yaccarino's ambitious plan for Twitter 2.0",
    "@emilygorcenski@indieweb.social",
    "wait what why would you hire someone with an active non-compete clause https://twitter.com/...",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Linda Yaccarino's vision for Twitter 2.0 emerges",
    "New AI-powered Microsoft Shopping tools arrive on the new Bing and Edge",
    "Microsoft Adds New AI-Powered Shopping Tools in Bing and Edge",
    "Microsoft gives Bing and Edge new AI tools to help you shop",
    "New Bing & Edge Features Use AI To Streamline Shopping",
    "Microsoft Rolls Out AI-Generated Buying Guides In Bing And Edge",
    "Bing adds new AI-powered shopping tools",
    "Microsoft will use AI to help you save money online when shopping with Edge and Bing",
    "Microsoft Taps Bing AI to Generate Shopping Guides",
    "Microsoft announces new AI-powered shopping tools in Bing and Edge",
    "Bing will now surface AI-generated buying guides",
    "New AI-based Microsoft Shopping features added to Bing search, Bing Chat, and Edge browser",
    "Bing with ChatGPT now produces AI-generated shopping guides for you",
    "New Bing and Edge features give online shopping an AI makeover",
    "Microsoft announces new AI-powered Microsoft Shopping tools on the new Bing and Edge",
    "How AI Influences What You See on Facebook and Instagram",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta outlines AI use on platforms",
    "How Facebook ranks content in 2023: Feed, Stories, Reels and more",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "Meta Explains How AI Determines What You See on Instagram",
    "Nick Clegg Is Meta's Transparency Man",
    "Our Approach to Facebook Feed Ranking",
    "Meta Shares How AI Dictates Instagram and Facebook Feeds",
    "Meta reveals how its AI systems show you posts on Facebook and Instagram",
    "Meta explains how AI influences content on your Facebook and Instagram feeds",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta's new feature will tell you all about reels that you on Instagram, Facebook",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Is this when you desperately want your stock to go up? https://twitter.com/...",
    "@williamgunn@mastodon.social",
    "Transparency and brand safety on Google Video Partners",
    "Ad-Fraud Claims Could Force Google to Pay Billions. But Don't Hold Your Breath.",
    "Advertisers demand billions in refunds from YouTube over skippable ads",
    "The Problem With ‘Independent’ Third-Party Verification On YouTube (Is That It Ain't)",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google Accused of ‘Ad Fraud’ and Misleading Advertisers",
    "Google needs to be broken up https://gizmodo.com/...",
    "An Interview with Marc Andreessen about AI and How You Change the World",
    "FTC prepares “the big one,” a major lawsuit targeting Amazon's core business",
    "FTC reportedly plans major antitrust lawsuit against Amazon",
    "FTC Preps for Battle With Amazon. It's the Big One.",
    "FTC Set to File Major Amazon Antitrust Suit Over Marketplace Practices",
    "Amazon to soon face big FTC antitrust suit over online marketplace power, report says",
    "Amazon Faces Broadscale FTC Antitrust Suit",
    "U.S. antitrust regulator plans to target Amazon's online marketplace - Bloomberg News",
    "@campuscodi@mastodon.social",
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Activision's Bobby Kotick says he made ‘a bad decision’ not bringing Call of Duty to Switch",
    "Xbox Claims Worldwide Regulators Onboard With Activision Blizzard Merger, Canada Disagrees",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Microsoft CEO Satya Nadella claims he has “no love” for video game exclusivity deals",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "Microsoft CEO blames Sony for Xbox exclusive games like Starfield",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Bobby Kotick Says He Wouldn't Put ‘Call Of Duty’ On Xbox Game Pass Or Other Services",
    "Microsoft, Sony CEOs Clash in FTC Trial Over Console Exclusives and Game Pass",
    "Sony's Call of Duty Deal With Activision Only Includes One More Game",
    "Sony Accidentally Revealed How Deeply Loyal Call Of Duty Players Are",
    "FTC documents reveal how much money Sony makes from Call of Duty",
    "Microsoft CEO Satya Nadella says exclusive Activision games make no sense",
    "Microsoft CEO Would ‘Get Rid’ of Console Exclusives if He Could",
    "Microsoft CEO Satya Nadella admits he doesn't love console game exclusives",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Microsoft CEO Satya Nadella blames Sony for console game exclusives",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Will the Biggest Tech Merger of All Time Go Through?",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "@BrendanSinclair@mastodon.social",
    "U.S. Securities and Exchange Commission",
    "Fidelity Refiles For Spot Bitcoin ETF",
    "Fidelity joins the rush for a bitcoin ETF, following BlackRock, Ark Invest and others",
    "Fidelity rejoins rush to spot bitcoin ETF with fresh filing",
    "Exchange operator Cboe files with US SEC to list Fidelity's spot bitcoin ETF",
    "Fidelity Refiles Bitcoin ETF Application With SEC as BlackRock Renews Hope",
    "Fidelity becomes latest firm to re-up bid for spot bitcoin ETF",
    "Fidelity refiles for a Bitcoin spot ETF, mimicking structure of BlackRock filing",
    "Fidelity submits renewed application for spot bitcoin ETF",
    "Fidelity officially files for spot bitcoin ETF in second attempt",
    "Fidelity files new spot bitcoin ETF application, following BlackRock, Invesco",
    "Fidelity Refiles Bitcoin Spot ETF Application After BlackRock",
    "Fidelity reapplies for spot Bitcoin ETF despite 2022 rejection",
    "Fidelity Officially Files for Spot Bitcoin ETF",
    "Crypto gets a boost following reports of Fidelity's imminent Bitcoin spot ETF filing",
    "@danilo.redeem-tomorrow.com",
    "As Reddit protests turn to porn-bombing, advertisers face increasing brand safety concerns",
    "Minecraft developers quit Reddit after company's controversial changes",
    "Mojang leaving official Minecraft subreddit amid current protests",
    "Minecraft Developers Are Dropping Reddit For Community Feedback",
    "Minecraft Devs Are Leaving the Subreddit Behind",
    "Is Minecraft subreddit shutting down?",
    "Minecraft Developers Leave Subreddit with 7.5m Members amid Controversial Reddit API Changes",
    "Mojang ends official support for Minecraft subreddit",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Reddit Is Already on the Rebound",
    "Reddit Ramps Up Its Threats To Protesting Mods, As Ad Buyers Leave",
    "Reddit tells protestors to reopen subreddits",
    "Reddit Threatens Subs to Go Public Again, or Else...",
    "New Communities + Beehaw is once again looking for community moderators",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "Binance's European banking partner Paysafe to withdraw support",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Binance to lose support of its euro banking partner",
    "Binance's euro banking partner pulls support - Why?",
    "Binance loses euro banking Paysafe amid global regulatory scrutiny",
    "Binance hit by two further banking setbacks in Europe",
    "Binance's European Banking Partner, Paysafe, To Withdraw Support On September 25",
    "Binance's European Banking Service Provider Paysafe to Halt Support",
    "Binance Loses European Banking Partner Paysafe",
    "Binance Loses Another Banking Partner Amid Global Regulatory Storm",
    "Binance's EUR banking partner announces plan to halts support",
    "Binance Faces Another Blow as EUR Banking Partner Halts Support in September",
    "Binance loses Euro payment partner; denied licensing in Germany",
    "Binance to change euro banking partner from September",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "@mattburgess@infosec.exchange",
    "Pornhub accused of abusing user data",
    "Pornhub Is Being Accused of Illegal Data Collection",
    "TSMC sending more workers to speed up building of new Arizona plant",
    "TSMC to Send More Taiwanese Workers to U.S. to Speed Up Arizona Fab",
    "TSMC Arizona chip plant over budget and behind schedule; US workers blamed",
    "TSMC's Arizona headache and a surprise chip deal in Japan",
    "TSMC sends more Taiwanese workers to finish Arizona plant",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "That's a lot of words to say “no bid” and “inflated marks” https://twitter.com/...",
    "Bitpanda Pro spins out under Josh Barraclough, raises €30 million",
    "Bitpanda Pro spins out as One Trading and raises €30M",
    "One Trading springs from Bitpanda Pro rebrand and secures $33m investment",
    "Bitpanda crypto exchange spins out with €30m funding",
    "AI-generated text is hard to spot. It could play a big role in the 2024 campaign",
    "Exploring How Image Upscalers Can Integrate Into Existing Design Workflows & Tools",
    "Online Hate and Harassment: The American Experience 2023",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "More than half of Americans have experienced online harassment, says ADL report",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "Over half of Americans report targeted online harassment - ADL survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "Snapchat+ gains 4 million paying subscribers in its first year",
    "Snapchat+ gained four million subscribers in its first year",
    "Snapchat+ Marks One Year Anniversary with 4 Million Subscribers",
    "Snapchat+ reaches 4 million paid subscribers since launching a year ago",
    "Snapchat+ hits 4 mln paid subscribers",
    "Snapchat has found more than 4 million people willing to pay it $4/month",
    "Pretty damn impressive https://twitter.com/...",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Runway AI Raises $141M From Investors Like Google and NVIDIA",
    "Runway draws fresh $141 million as next-level generative AI video begins to emerge",
    "Runway, a startup building generative AI for content creators, raises $141M",
    "Inflection, Runway and Stability get new funding as capital pours into generative AI startups",
    "Runway raises $141 million to continue building the future of creativity",
    "AI company Runway valued at $1.5 bln in latest funding -source",
    "Runway Raises $141M in Addiditional Series C Funding",
    "Is this the return of “vendor financing” from 2000? https://twitter.com/...",
    "More gasoline for awesome things! https://twitter.com/...",
    "Meta oversight board wants Cambodian leader's account suspended",
    "Oversight Board overturns Meta's decision in “Cambodian prime minister” case",
    "Oversight Board Tells Facebook to Remove Video of Cambodian Prime Minister Threatening Opponents",
    "Cambodia PM Hun Sen accused of inciting violence on social media",
    "Cambodian leader Hun Sen, a huge Facebook fan, says he is jumping ship to Telegram",
    "Cambodian PM Hun Sen deletes Facebook page after criticism",
    "Meta oversight board orders firm to take down video by Cambodian leader",
    "Meta's Oversight Board urges Facebook to suspend Cambodia's Prime Minister",
    "Meta Oversight Board Urges Cambodia Prime Minister's Suspension from Facebook",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "Best Samsung Phone of 2023",
    "Asus Zenfone 10 Review: Small Yet Beautiful Smartphone",
    "The new ASUS Zenfone 10 packs a lot of performances into a small package",
    "Asus Zenfone 10 review: Rinse and repeat",
    "Asus Zenfone 10 review: a gimble-toting compact superphone",
    "The Asus Zenfone 10 is a flagship in almost every department",
    "Asus Zenfone 10: Everything you need to know",
    "ASUS Zenfone 10 review: Should you buy it?",
    "The Asus Zenfone 10 is your best bet for a high-powered, small Android phone",
    "Asus Zenfone 10 review: The compact phone of your dreams",
    "Asus continues its legacy of compactness with the Asus Zenfone 10 smartphone",
    "The ASUS Zenfone 10 is bringing compact smartphones back",
    "Asus Zenfone 10 review: meet the anti-Galaxy S23 Ultra",
    "Asus Zenfone 10 Review: A Small Phone With Some Big Compromises",
    "Zenfone 10: Unleashing Compact Power with Snapdragon 8 Gen 2",
    "ASUS's New Zenfone 10 Boasts Stronger Performance and Cameras in a Compact Frame",
    "ASUS Shows Off Zenfone 10, Keeping the Little Flagship Phone Dream Alive",
    "Asus Zenfone 10 arrives with Snapdragon 8 Gen 2 chipset and surprisingly small display",
    "Asus Zenfone 10 review: The best small smartphone gets even better",
    "Asus Zenfone 10 review: A mighty mini phone",
    "Asus Zenfone 10 review: The last of the (good) small phones",
    "Asus Zenfone 10 review: a true flagship Android phone... but smaller",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Lightmatter: Next-gen computing built for AI.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/29 - Big Interesting (AI) Raises",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "YouTube could be testing a three-strikes policy for ad blocking",
    "YouTube is Showing New Alerts to Free Users With Ad Blockers",
    "YouTube is about to get VERY aggressive with ad blockers",
    "YouTube Ramps Ups Its Efforts In Fight Against Ad Blockers",
    "YouTube intensifies crackdown on adblockers with this new restriction",
    "what if someone invents an ad blocker blocker blocker?  [embedded post]",
    "Official Tesla Support For Third-Party API-Based Services Is Coming, What Could This Mean?",
    "Narwhal will continue to be available even after the new API pricing kicks in on July 1st",
    "How is it some apps are staying up with subscriptions in the $4-7 range and Apollo isn't?",
    "Meituan buys founder's months-old ‘OpenAI for China’ for $280M",
    "Chinese food delivery giant Meituan acquires four-month-old AI startup for $234 million",
    "Meituan buys out four-month-old AI start-up Light Year for US$281 million",
    "Meituan to buy all shares of AI startup Light Year from HongShan, co-founder",
    "Meituan Buys Co-Founder's Months-Old AI Startup for $234 Million",
    "I see AI has reached the “acquisitions mad lib” stage.  [embedded post]",
    "Three Reasons to Look Past the 40% Drop in VC Funding",
    "Worldcoin launches in Germany and integrates with Okta's Auth0 platform",
    "Worldcoin integrates with Okta's Auth0, initiates World ID registrations in Germany",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple to argue against EU antitrust charge at hearing triggered by Spotify",
    "Apple argues no more changes necessary to App Store policy in Spotify EU antitrust case",
    "Apple to defend itself against Spotify's antitrust accusations in the EU",
    "Apple says it already changed its rules enough to satisfy Spotify EU complaint",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "Big Tech corporate venture capital 🤝 generative AI startups",
    "AI Firm Typeface Valued at $1 Billion After Salesforce/Google Funding",
    "Generative AI Startup Typeface Raises $100M for Branded Synthetic Media Platform",
    "Generative AI Platform Typeface Bags $100M in Series B, Hitting Unicorn Status",
    "Typeface Raises $100M in Series B Funding",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface lands $100M for its generative AI content creation engine",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "Apple livestreaming through Chinese e-commerce apps, but no bargains to be had",
    "Oracle Ports Database to Arm-Based Ampere CPUs: Might Ditch Intel and AMD",
    "Oracle Bets On AMD, Ampere CPUs; Ellison Says ‘Intel x86 Architecture’ Is ‘Reaching Its Limit’",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Building Momentum for the Sustainable Cloud",
    "Oracle Increases Ampere's Momentum with New Database Support",
    "Oracle spending ‘billions’ on Nvidia chips this year",
    "Silicon Valley Business Journal",
    "Oracle is no longer buying Intel processors for its data centers",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Mastercard pilots tokenized bank deposits",
    "Mastercard announces plan to launch its blockchain",
    "Mastercard Unveils Multi Token Network (MTN) to Scale, Secure Blockchain Tech",
    "Tokenized Deposits: Unlocking New Possibilities in Finance",
    "Mastercard Unveils Multi-Token Network (MTN)",
    "Mastercard Building Ethereum-Based Blockchain App Store for Regulated Financial Apps",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "Microsoft, OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "OpenAI, Microsoft face class-action suit over internet data use for AI models",
    "OpenAI Sued for Using ‘Stolen’ Data, Violating Your Privacy With ChatGPT",
    "OpenAI and Microsoft face new class-action lawsuit over ChatGPT",
    "OpenAI sued for ‘stealing’ data from the public to train ChatGPT",
    "OpenAI and Microsoft Sued for $3 Billion Over Alleged ChatGPT ‘Privacy Violations’",
    "Microsoft and OpenAI face $3B lawsuit alleging privacy violations with ChatGPT",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "The AI Arms Race and Why We Need to Come Together Now",
    "Lawsuit says OpenAI violated US authors' copyrights to train AI chatbot",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "OpenAI is being sued for training ChatGPT with ‘stolen’ personal data",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "Microsoft and OpenAI sued for $3 Billion for breach of privacy with ChatGPT",
    "Explosive allegations: OpenAI faces lawsuit for data breach",
    "OpenAI and Microsoft Accused of Scraping and Exploiting Private Data for AI Training",
    "ChatGPT maker OpenAI hit with class-action lawsuit over alleged data theft",
    "OpenAI and Microsoft Hit With $3 Billion Data Theft Lawsuit",
    "OpenAI sued for allegedly ‘stealing’ data from millions",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "@ravirockks@infosec.exchange",
    "@kimzetter@infosec.exchange",
    "@metacurity@infosec.exchange",
    "SEC notices spark alarm for cyber executives",
    "Micron to Introduce GDDR7 Memory in 1H 2024",
    "Micron Expects to Debut GDDR7 Memory in 2024",
    "Expect GPU Upgrades in Early 2024 With the Launch of Micron's GDDR7",
    "Memory chipmaker Micron's sales down 57% as market bottoms out",
    "Micron still bumping along memory trough",
    "Chip maker Micron beats estimates on demand from booming AI, easing glut",
    "It's Not Just Nvidia—Micron Has China Problems, Too. Why the Stock Got Upgraded.",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Micron Technology, Inc. Reports Results for the Third Quarter of Fiscal 2023",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’"
]