[
    "Docket updates for Mata v. Avianca …",
    "Mata v. Avianca, Inc. (1:22-cv-01461)",
    "A Lawyer's Filing “Is Replete with Citations to Non-Existent Cases”—Thanks, ChatGPT?",
    "@kendraserra@dair-community.social",
    "grabbed the funniest bit of that legal case where someone used ChatGPT to write a brief [image]",
    "Office of the Arizona Attorney General",
    "Office of Attorney General …",
    "48 states sue phone company that allegedly catered to needs of robocallers",
    "Avid Telecom sued by multistate task force for making billions of unauthorized robocalls",
    "Case 4:23-cv-00233-EJM  —  INTRODUCTION 19.  Every day, millions of American consumers receive …",
    "Forty-eight states sue Avid Telecom over robocalls",
    "Nearly 50 state AGs sue company that allegedly facilitated billions of spam calls",
    "Office of Attorney General for the District …",
    "AG Schwalb Sues Avid Telecom Over Illegal Robocalls",
    "Company Behind Billions of Robocalls Is Being Sued by Nearly Every State",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Maryland sues Avid Telecom over alleged robocall scheme",
    "Billions of Robocalls and Alleged Scams Gets Telecom Sued by 48 States",
    "New Jersey Office of Attorney General",
    "Firm Hit With Robocalls Suit: ‘Americans Are Sick and Tired’",
    "There is a New Plan to Stop Robocalls",
    "Robocalls are out of control but this could change things",
    "Dolphin on Steam Indefinitely Postponed",
    "Buzzkill Nintendo Slams Valve With DMCA Takedown Over Dolphin Wii Emulator",
    "Nintendo Hits Valve With Steam DMCA Takedown Notice",
    "Dolphin emulator's Steam launch blocked by Nintendo DMCA notice to Valve",
    "Nintendo Sends DMCA to Wii/Game Cube Emulator Dolphin Ahead of Steam Launch",
    "Wii emulator Dolphin hit with DMCA notice by Nintendo to block Steam launch",
    "Nintendo serves Valve a takedown notice to remove an emulator from Steam",
    "Nintendo Sends Valve DMCA Notice Over Wii Emulator Listing On Steam",
    "Dolphin Emulator Steam release Indefinitely Postponed due to Nintendo DMCA",
    "OpenAI has no plans to leave Europe - Sam Altman makes a U-Turn",
    "Europe pitches ‘AI Pact’ to curtail the booming tech's risks",
    "OpenAI CEO Reverses Threat to Leave Europe",
    "Sam Altman's threat to quit EU is met with criticism from lawmakers",
    "Sam Altman Says OpenAI Will Not Leave Europe",
    "OpenAI's Sam Altman Promises His Company Won't Leave the EU, Actually",
    "ChatGPT-maker U-turns on threat to leave EU over AI law",
    "OpenAI CEO Altman ‘Blackmails’ EU Over AI Regulation",
    "Tech lords threatening to pull services should stop crying wolf",
    "OpenAI's Sam Altman charmed lawmakers in DC. In Europe, it's a different story",
    "OpenAI's Sam Altman downplays fears ChatGPT maker could leave Europe over AI rules",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "OpenAI's Sam Altman makes U-turn, says ‘no plans of leaving Europe’",
    "OpenAI CEO Sam Altman Says the Company May Remove ChatGPT from Europe Then Backtracks",
    "OpenAI has ‘no plans to leave’ Europe due to regulations, CEO says",
    "OpenAI's Sam Altman reverses threat to cease European operations",
    "OpenAI Considers Withdrawing from Europe Amid Regulatory Pressure",
    "OpenAI CEO Reverses Threat to Leave Europe Due to Regulations",
    "OpenAI says it's not going to leave Europe",
    "ChatGPT Could be Pulled from Europe, OpenAI CEO Warns",
    "Sam Altman reverses threat to ‘leave Europe’ over AI regulations",
    "No plans to leave Europe: OpenAI CEO Sam Altman",
    "Sam Altman's big European tour",
    "Methinks the lad doth protest too much https://twitter.com/...",
    "When life comes at you fast! https://twitter.com/...",
    "Blur Dominates 82% of the NFT Lending Market",
    "New Crypto Protocol Captures More Than 80% of the NFT Lending Market in Just One Month: DappRadar",
    "Blur's NFT lender Blend sees volume reach $225 million in less than a month",
    "More NFT Holders On Blur Are Taking Loans, Not Trading",
    "Blur's Lending Protocol Blend Commands 82% of NFT Lending Market Share",
    "Market Monopoly: Blur Claims 82% Share in NFT Lending, DappRadar Report Reveals",
    "Blur's Blend protocol facilitates nearly 170,000 ETH loans in 22 days",
    "Binance launches NFT loan service to rival Blend",
    "Blur: Blend Secures Top Spot in NFT Lending With 82% Market Share",
    "How the Internet Shrank Musk and DeSantis",
    "Twitter Space team narrowed down from 100 to roughly three employees",
    "DeSantis' Twitter launch disaster shows Musk's platform isn't ready for prime time",
    "A top Twitter engineering boss says he quit the day of Ron DeSantis' botched campaign launch",
    "Elon Musk And Ron DeSantis Prove That Twitter Spaces Is Kind Of A Joke",
    "The GOP girlies are fighting",
    "Platformer: 'Inside Twitter's Failed Space Launch'",
    "DeSantis's Twitter Event Falls Short of the Reach of Past Livestreams",
    "Twitter's Spaces team now has “roughly three” people.",
    "How did announcing a presidential campaign ‘melt the Internet’?",
    "Google removes ‘Slavery Simulator’ game from store following a wave of criticism in Brazil",
    "Google pulls ‘Slavery Simulator’ from app store after backlash from Brazilian gamers",
    "Google removes “Slavery Simulator” game from Play Store",
    "Google removes ‘Slavery Simulator’ game amid outrage in Brazil",
    "How could Google have ever allowed this to be sold, even for a second? https://www.bbc.com/...",
    "Twitter set to exit EU Code of Practice on Disinformation, sources say",
    "Twitter pulls out of EU's voluntary Code of Practice against disinformation",
    "Twitter to pull back from Europe's disinformation crusade",
    "Elon Musk takes Twitter out of the EU's Disinformation Code of Practice",
    "Twitter likely to quit EU code against disinformation, EU official says",
    "EU commissioner says Twitter has left its Code of Practice on Disinformation.",
    "Twitter cannot hide from EU rules after exit from code, EU's Breton says",
    "Elon Musk pulls Twitter from EU Code against disinformation",
    "Twitter pulls out of voluntary EU disinformation code",
    "Twitter Withdraws From EU Disinformation Code, Commissioner Says",
    "Twitter quits EU disinformation code: EU industry commissioner Thierry Breton",
    "Twitter leaves EU's voluntary pact on fighting disinformation",
    "Twitter withdraws from EU disinformation code ahead of landmark new rules",
    "Musk's Twitter Ditches EU Code of Practice on Disinformation",
    "AI Stocks Are Flying, but Don't Call the Craze a Bubble",
    "Silicon Valley Business Journal",
    "5 questions for Ampere CEO Renee James",
    "What Factors Contributed to Nvidia's Astonishing Rise as Top-Tier Global Corporation?",
    "Riding on AI wave, Nvidia inches closer to trillion-dollar market cap",
    "Azure Linux released at Build - where Microsoft revealed why it did not fork Fedora",
    "Introducing the Azure Linux container host for AKS",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "(IHP) The History Of Internet Porn",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Portugal moves closer to banning Chinese suppliers from 5G",
    "This newly-discovered malware could disrupt power generation — and do physical damage",
    "Portugal Effectively Bans Chinese Companies From 5G Network",
    "Portugal gov't could ban Huawei from country's 5G network",
    "Update Regarding Shipment Zero",
    "Sekoia.io Raises €35M in Series A Financing",
    "Cybersecurity firm Sekoia.io secures €35m in fresh funding",
    "United States District Court, Northern District of California",
    "Google Hit With $32.5M Verdict In Sonos Speaker Patent Fight",
    "Jury Finds that Google Infringed on Sonos Patent",
    "Google ordered to pay $32.5 million in Sonos patent infringement decision",
    "Google to pay $32.5M as jury sides with Sonos on patent lawsuit",
    "Google fined over US$30 million for patent infringement",
    "US jury says Google owes Sonos $32.5 million in smart-speaker patent case",
    "Google fined $32.5 million for infringing on Sonos patent",
    "Also looks like multi-room audio really isn't a primary use case for Google speakers.",
    "Sastrify, the platform for managing SaaS Subscriptions raises $32m",
    "Streamlining SaaS usage: Sastrify raises $32M to transform procurement process",
    "German SaaS platform Sastrify raises Series B",
    "Sastrify Raises $32 Million to Tackle ‘SaaS Sprawl’",
    "SaaS tool procurement platform Sastrify raises $32 million",
    "Germany's Sastrify raises €29.6M in Series B funding led by Amsterdam-based Endeit Capital",
    "Bluesky launches alternative feeds with custom algorithms",
    "Bluesky rolls out feeds with custom algorithms",
    "Bluesky rolled out custom algorithm feeds to everyone",
    "Commission Nationale de l'Informatique et des Libertés",
    "Microsoft Successfully Evades Additional French Fines, Alters Bing's Data Tracking Procedures",
    "Closure of the injunction issued against MICROSOFT IRELAND OPERATIONS LIMITED",
    "Meta layoffs affected the teams that were fighting fake news on Facebook",
    "Tesla-Files nähren Zweifel an Elon Musks Versprechen",
    "Report: ‘massive’ Tesla leak reveals data breaches, thousands of safety complaints",
    "Huge Tesla leak reveals thousands of safety concerns, privacy problems",
    "Shocking Leaked Tesla Documents Hint at Cybertruck Problems",
    "Tesla employee leaks thousands of safety and privacy breach reports",
    "This is your brain on Elon Musk",
    "Huge Tesla data leak reportedly reveals thousands of safety complaints. 4 things to know",
    "Tesla could face a $3.3 billion fine over a massive data leak",
    "Tesla Whistleblower Leaks 100 Gb of Data to German News Outlet",
    "Tesla Whistleblower Leaks 100GB of Data, Revealing Safety Complaints",
    "Tesla Keeps Doing Something No Other Company Dares To",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Tesla Data Leak Tips Thousands of Autopilot Safety Complaints",
    "Tesla data breach? 100GB of company information ‘leaked by whistleblower’",
    "Tesla's FSD Beta Goes Live Internationally, But Not Everywhere Just Yet",
    "Tesla customers reported thousands of Full Self-Driving complaints, leaked data shows",
    "Whistleblower Drops 100 Gigabytes Of Tesla Secrets To German News Site: Report",
    "Tesla leak reveals thousands of safety complaints",
    "Nvidia Stock Surge Is a Warning to Tesla—and Vice Versa",
    "YouTube Stories Are Being Retired on June 27",
    "YouTube Stories are Going Away on 6/26/2023",
    "YouTube Stories To Be Discontinued",
    "YouTube Stories Heading for the Google Graveyard",
    "YouTube kills a feature you probably weren't using anyway",
    "YouTube to Sunset ‘Stories’ Feature on June 26th",
    "Google is mercy killing YouTube Stories",
    "YouTube is killing Stories",
    "YouTube Stories will be killed off next month",
    "YouTube to abandon Stories next month",
    "Time to bid farewell to YouTube Stories",
    "YouTube will shut down YouTube Stories next month: Check Stories' alternatives",
    "Google is killing a stolen YouTube feature",
    "“Stories” time for YouTube ends June 26th; platform tells creators to use Posts and Shorts",
    "YouTube's Retiring YouTube Stories Next Month",
    "The limited time YouTube Stories videos are going away for good on June 26",
    "YouTube Stories, Google's clone of Snapchat, is dying on June 26",
    "Add YouTube ‘Stories’ to the list of failed Snapchat copycats",
    "YouTube is killing off Stories in favor of Shorts",
    "I did not know YouTube had stories. They plan to shut it down. 🤣🤣🤣🤣 https://techcrunch.com/..."
]