[
    "The Official Microsoft Blog",
    "Microsoft 365 Developer Blog",
    "@thekenyeung@mastodon.social",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Microsoft goes all in on plug-ins for AI apps",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "Bing at Microsoft Build 2023: Continuing the Transformation of Search",
    "Microsoft 365 Copilot now works with plugins, making it much more powerful",
    "Windows 11's widgets will finally become useful",
    "The 5 biggest announcements from Microsoft Build 2023",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft Edge is getting Copilot and support for ChatGPT plugins",
    "Build 2023: Microsoft 365 Copilot to Get Plugins Support",
    "Microsoft Build 2023 Puts AI in Everything, Adds Dev Mode for Windows 11",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "Microsoft's M365 Copilot AI assistant gets third-party app integrations",
    "Microsoft expands AI plugins and copilot ecosystem for developers",
    "Microsoft launches generative AI tools for developers",
    "All the major Bing Chat and AI announcements from Microsoft Build 2023",
    "Microsoft Build 2023: What businesses need to know",
    "Microsoft Bing search is being added to ChatGPT; new Bing Chat plugin partners revealed",
    "OpenAI's Brockman: Industry use cases, developers next stage for generative AI, ChatGPT",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft announces Windows Copilot, Bing in ChatGPT at Build 2023",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft is bringing OpenAI ChatGPT plugins to Windows 11",
    "Build 2023: AI announcements recap",
    "Microsoft Presents Shared Plugin-Ecosystem for Bing, ChatGPT and Microsoft Products",
    "Build 2023: Building apps that bring together AI and collaboration",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "Microsoft is bringing AI Copilot features to Edge",
    "Microsoft 365 Copilot Gets Support for Plugins",
    "Microsoft Announces AI Integrations at Build 2023, Including Windows Copilot",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft Developer on YouTube",
    "A livestream of the Microsoft Build 2023 keynote",
    "Windows AI Copilot Rolls Out in Preview Next Month, Plug-Ins Coming to Bing AI",
    "How to watch Microsoft's Build 2023 conference",
    "Is this Apple's sneaky way of teasing an AR headset at WWDC 2023? …",
    "Watch the Microsoft Build keynotes here, starting at 12PM ET",
    "How to watch Microsoft Build 2023",
    "Microsoft Build 2023: How to watch, what to expect",
    "Microsoft Build 2023: How to watch, what to expect, and more",
    "“Do legendary shit!” Powerful message from @kevin_scott at #MSBuild!",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft confirms 365 Copilot AI will be ‘natively integrated’ into Edge",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Bing Search is coming to ChatGPT",
    "Microsoft to Release Windows 11 “Moment 3” Update on May 24, 2023",
    "The man who put Microsoft in the AI lead",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Why Microsoft is combining all its data analytics products into Fabric",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "At Build 2023, Microsoft unveils new Fabric OneLake Shortcuts for ADLS, AWS, Google Storage",
    "Microsoft unveils Microsoft Fabric at Build 2023, pitches integration, simplified pricing",
    "Microsoft Brings AI Copilot to PowerBI, Power Pages and Microsoft Fabric",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft Fabric Brings New AI-Powered Data Analytics Features to Boost Productivity",
    "Build 2023: Microsoft officially announces Fabric, an end-to-end, unified analytics platform",
    "Microsoft beats Google by integrating an AI assistant straight into its OS",
    "Windows Copilot AI assistant brings ChatGPT straight to your desktop",
    "Microsoft brings Copilot assistant AI to Windows 11",
    "Microsoft makes a push for AI responsibility and safety through Azure",
    "Build 2023: Microsoft Tackles Inappropriate Content with Azure AI Content Safety",
    "Safety. https://twitter.com/...",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsot Introduces Azure AI Studio for Building, Training, and Deploying Intelligent Apps",
    "Microsoft Wants Companies to Build Their Own Generative AI Chatbot Copilots",
    "Microsoft wants to make Windows a better place for developers",
    "Microsoft's cloud-hosted developer workstations will soon be generally available",
    "Microsoft's new Dev Home app for Windows 11 makes it easier to set up your workflow",
    "Microsoft boosts Windows developer productivity with Dev Home",
    "Microsoft Dev Box preview to soon end and be generally available, 2TB SSD added",
    "Build 2023: Cloud based Microsoft Dev Box to hit general availability in July",
    "Reimagining Developer Workstations with Microsoft Dev Box",
    "Microsoft Dev Box Adds New Features Ahead of its General Availability in July",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple enters multibillion-dollar mobile chip deal with Broadcom",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple Extends Broadcom Pact With Multibillion-Dollar 5G Deal",
    "Apple Inks Multibillion-Dollar Wireless-Chip Supply Deal With Broadcom",
    "Apple to Pay Broadcom Billions for US-Made 5G Chips",
    "Apple and Broadcom sign multi-billion dollar deal to manufacture more 5G components in the U.S.",
    "Apple announces multibillion-dollar agreement with Broadcom for components made in US",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple's Broadcom Deal Is a Big Moment—but Not Because of 5G Chips",
    "Apple inks multibillion-dollar chip deal with Broadcom",
    "Apple strikes ‘multibillion-dollar’ deal with Broadcom for 5G parts",
    "Apple inks multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple Strikes Multibillion-Dollar Supply Deal With Broadcom",
    "Apple Strikes Multibillion-Dollar Deal to Use U.S.-Made Chips",
    "Apple boosts its commitment to US manufacturing with a massive Broadcom deal worth billions",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple signs multi-billion-dollar 5G deal with Broadcom",
    "Apple and Broadcom sign deal that will power your iPhone 16 next year - and beyond",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple in multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple signs deal with Broadcom to ‘deepen investments in the U.S. economy’",
    "Apple And Broadcom Sign Multibillion-Dollar Deal",
    "Apple multibillion-dollar Broadcom deal seems mostly for 5G",
    "Apple announces multibillion-dollar Broadcom deal amid rumors of in-house 5G iPhone radio",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Welcoming AI to the Microsoft Store on Windows",
    "Microsoft puts a spotlight on AI in its Windows app store",
    "Microsoft Store hones in on AI in Windows with new section and AI-generated reviews",
    "Windows 11's Microsoft Store is getting AI-powered reviews and dedicated ‘AI Hub’ features",
    "Microsoft Store will use AI to summarize app reviews by customers",
    "The Microsoft Store will finally restore your pinned apps across Windows 11 devices",
    "Build 2023: Microsoft Brings AI Features to the Microsoft Store",
    "The Microsoft Store will help curate AI tools for you now",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft Store gets AI-generated review summaries, keywords and a dedicated AI Hub",
    "Build 2023: Microsoft Store is adding an AI Hub, expanding Store Ads",
    "The Seamless Transition: Microsoft Store's New Backup and Restore Feature",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "Microsoft Bing will become ChatGPT's default search engine in latest OpenAI collaboration",
    "Bing Chat will get boosted by plugins — here's which ones are on the way",
    "OpenAI makes Microsoft Bing the default search in ChatGPT",
    "ChatGPT is Using Microsoft's Bing to Deliver Answers",
    "Microsoft confirms Bing AI and ChatGPT plugins will work together",
    "Microsoft beefs up ChatGPT and Bing in wide-ranging AI product launch",
    "Bing to be default search engine on Open AI's ChatGPT",
    "Bing is coming to ChatGPT as the default search experience",
    "Microsoft Sticks Bing Into ChatGPT after Sticking ChatGPT Into Bing",
    "Build 2023: Microsoft Announces Bing Search Integration Into ChatGPT",
    "Microsoft just supercharged ChatGPT with Bing's AI-powered search",
    "Microsoft to Add Bing Search to OpenAI's ChatGPT in Battle With Google",
    "Microsoft says Bing can be default search engine for ChatGPT users",
    "ChatGPT Will Use Bing to Answer Questions",
    "How To Use Bing Chat On Your Android Phone",
    "Bing coming to ChatGPT is a seismic shift for generative AI — here's why",
    "Microsoft Bing will connect ChatGPT to the internet for all users",
    "Build 2023: OpenAI's ChatGPT to use Bing as its default search experience",
    "Bing Search Tests Blue Highlighted Text In AI Chat Answers Within Search",
    "Microsoft pledges to watermark AI-generated images and videos",
    "Microsoft Designer and Bing Image Creator will soon tag images and videos with metadata info",
    "Build 2023: Microsoft to watermark AI generated content created by Bing Image Creator and Designer",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "Meta loses millions as made to sell Giphy to Shutterstock",
    "Meta Sells Giphy To Shutterstock For $53M Following Antitrust Lawsuit",
    "Meta sells Giphy for $53M to Shutterstock after UK blocked GIF platform purchase",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Meta sells Giphy at a significant loss after UK breakup order",
    "Shutterstock picks up Giphy for $53 million after UK blocks Meta's acquisition",
    "Shutterstock to Buy Meta's Giphy for $53 Million on UK Antitrust Order",
    "Shutterstock Agrees to Acquire Giphy From Meta",
    "Meta sells Giphy to Shutterstock for $53 million to comply with UK regulator order",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Meta Sells Giphy for $53 Million to Shutterstock. U.K. Regulators Score a Big Win.",
    "Meta sells Giphy at a $347m loss to comply with UK regulator",
    "Meta Sells GIPHY To Shutterstock, Reportedly Taking A Big Loss In The Process",
    "Shutterstock to Acquire Giphy from Meta for $53M",
    "Meta sold Giphy at a $262 million loss",
    "Meta sells GIPHY to Shutterstock for a big loss after regulators force a sale",
    "Meta complies with UK order, sells Giphy to Shutterstock at a huge loss",
    "Meta Sells Giphy to Shutterstock in $53 Million Deal",
    "Feels like a steal https://www.reuters.com/...",
    "Binance Denies Commingling ‘Billions’ in Customer Funds",
    "Binance Blasts ‘Desperate’ Reuters Report It Commingled Customer and Company Funds",
    "Binance pushes back against Reuters report alleging company commingled funds",
    "Binance reportedly mixed customer funds with company revenue at a US bank",
    "Binance Calls Out Reuters Over Report Alleging Commingling of Customer Funds",
    "Crypto Giant Binance Commingled Customer Funds and Revenue: Report",
    "Inside Binance Scandal: Former Insiders Claim Customer Funds Were “Mishandled”",
    "Binance allegedly commingled customer funds: Reuters",
    "Binance Denies Reuters Report That It Commingled Customer Funds",
    "Binance commingled funds at Silvergate: Reuters",
    "Binance Exchange Allegedly Commingled Customer Funds and Company Revenue",
    "Binance regularly commingled customer funds with corporate revenue in 2020 and 2021: Reuters",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "@chrismessina@mastodon.xyz",
    "Google Product Studio brings AI-generated images to advertisers",
    "What ads will look like in Google's Search Generative Experience [Gallery]",
    "New tools to help small businesses connect with online shoppers",
    "Google Leans Into Generative AI to Power Product Imagery for Merchants",
    "Google Product Studio Lets Merchants Create Product Imagery With Generative AI",
    "Google Will Soon Show You AI-Generated Ads",
    "Google to test ads in generative AI search results",
    "Google Ads will create AI-powered assets that target search queries",
    "Introducing a new era of AI-powered ads with Google",
    "Google Introduces Chatbot, Other Generative AI Creation Tools for Marketers",
    "Google Marketing Live 2023: What you need to know",
    "Google Search Generative Experience integrates Search, Shopping ads",
    "@caseynewton@mastodon.social",
    "Social Media and Youth Mental Health",
    "‘Take action and protect our kids’: U.S. Surgeon General warns of social media risks",
    "US Surgeon General says social media can pose ‘a profound risk’ to teens' mental health",
    "Surgeon General Warns of Social Media's ‘Profound Risk of Harm’ to Kids",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Surgeon general issues advisory about social media risks for kids",
    "Social Media a ‘Profound Risk’ to Kids, Warns U.S. Surgeon General",
    "8 Social Media Tips for Parents and Teens from the U.S. Surgeon General",
    "Car seats and baby formula are regulated. Is social media next?",
    "On ‘Defining Public Health Issue of Our Time,’ a Warning",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "Surgeon general issues urgent warning about kids and social media",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "US Surgeon General says social media may be hazardous to teen health",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "These generative AI tools coming to Adobe Photoshop will blow your mind",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Don't Believe Your Lying Eyes in the AI Era",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "Adobe harnesses Firefly to bring new generative AI features to Photoshop",
    "Photoshop's new AI features look like magic",
    "Adobe Unleashes Generative AI in Photoshop Beta",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Adobe Firefly now works with Photoshop, wants to improve your business' content",
    "Adobe Integrates Firefly Directly Into Photoshop, Brings Generative AI to Creative Cloud",
    "Adobe Adds AI Image Generator Firefly to Photoshop",
    "Photoshop's new AI-powered tricks will fix your biggest mistakes",
    "Adobe adds AI features to Photoshop with new Generative Fill feature",
    "Adobe Photoshop just got even easier to use with Generative Fill AI edits",
    "Photoshop's New ‘Generative Fill’ Uses AI to Expand or Change Photos",
    "Photoshop just got a massive upgrade thanks to Adobe Firefly generative AI",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use,",
    "Adobe adds generative AI editing to Photoshop",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "Apple updates Final Cut Pro, Logic Pro, Motion, Compressor for Mac with support for iPad apps",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "First Impressions: Final Cut Pro for iPad",
    "Apple has officially released Final Cut Pro and Logic Pro for iPad",
    "Hands-On With Apple's Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for macOS updated with new features and support for iPad apps",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Hands On With Apple's Logic Pro for iPad",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro and Logic Pro for iPad are here",
    "Apple's Final Cut Pro and Logic Pro for the iPad Are Now Available to Download",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Final Cut Pro for iPad Now Available",
    "No subscriptions in Final Cut Pro and Logic Pro for Mac following iPad versions.  Yet...",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "Apple releases Final Cut Pro and Logic Pro for iPad",
    "Logic Pro now available for iPad: Here's everything you need to know",
    "Download: Final Cut Pro And Logic Pro For iPad Released",
    "@johnvoorhees@mastodon.macstories.net",
    "San Francisco Business Journal",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "Anthropic raises $450M to build powerful but trustworthy AI systems",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "Anthropic secures $450M in Series C funding from Google, Salesforce and others",
    "AI start-up Anthropic raises $450mn from Google and Spark Capital",
    "Alphabet-backed AI startup Anthropic raises $450 million",
    "OpenAI rival Anthropic raises $450 million in funding with backing from Google to take on ChatGPT",
    "AI startup Anthropic raises $450M from Spark, Google, Salesforce",
    "Anthropic pulls in another $450 million to build safe AI",
    "Ex-OpenAI execs raise $450 million for Anthropic, a rival A.I. venture backed by Google",
    "Max makes its U.S. debut, giving subscribers 35K hours of content",
    "Here's why Max's new $20-a-month 4K plan is worth it",
    "Max Goes Live With New $19.99 4K Plan",
    "HBO Max relaunches as Max — here's what you need to know",
    "Max streaming guide: Signing up, pricing, features, 4K content availability and more",
    "HBO Max is officially just MAX: what this means for you",
    "Warner Bros. reveals Max: Rebranded HBO Max",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Everything You Need to Know About Max When Service Launches on May 23",
    "Max launches as HBO Max and Discovery+ mash-up with even more 4K",
    "HBO Max is now simply ‘Max’ with a new ‘Ultimate Ad-Free’ tier",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "how do you fuck up this badly https://twitter.com/...",
    "I keep clicking “Start Streaming” and nothing happens. Great product launch. No notes. [image]",
    "why are all the streaming services blue now [image]",
    "Waymo and Uber partner to bring Waymo's autonomous driving technology to the Uber platform",
    "Waymo's self-driving cars will be available on Uber's app, starting in Phoenix",
    "Uber Teams With Google's Waymo to Offer Driverless Ride-Hailing",
    "Uber partners with Alphabet's Waymo to offer driverless rides",
    "Uber will offer Waymo robotaxi rides and deliveries in Phoenix starting later this year",
    "Waymo robotaxis coming to Uber app with new partnership",
    "Waymo partners with Uber to bring self-driving cars to its vast ride-share network",
    "Uber taps into self-driving tech of former rival Waymo",
    "Waymo Partners With Rival Uber In Phoenix For Rides And Food",
    "Uber and Waymo Partner on Driverless Taxis in Phoenix",
    "Waymo and Uber sign multi-year partnership to provide driverless rides and deliveries",
    "Uber and Waymo fought in court over self-driving trucks. Now they're teaming up",
    "headlines i would never imagine a mere six years ago https://blog.waymo.com/... [image]",
    "So excited to bring Waymo's incredible technology to the @Uber platform 🙌 https://twitter.com/...",
    "A Waymo car stopping to do food delivery seems less than ideal: https://www.theverge.com/...",
    "Uber and Waymo team up to bring autonomous taxis to Phoenix. [ai] https://www.theverge.com/...",
    "Unsafe levels of dork energy in one place https://twitter.com/...",
    "Wonder if this is going to be the thing that makes Trump start tweeting again?",
    "Musk hasn't even endorsed DeSantis and praised one of his opponents last week lmao [image]",
    "Elon Musk: Twitter must be politically neutral also Elon Musk: [image]",
    "Worth noting Sacks is belligerently isolationist on Ukraine https://twitter.com/...",
    "The guy DeSantis is launching his campaign with hasn't even endorsed him lmao [image]",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "IOSCO Sets the Standard for Global Crypto Regulation",
    "Global securities watchdog urges governments to regulate crypto like traditional financial assets",
    "Global Standard Setter Recommends More Investor Protection Following Turmoil Over the Past Year",
    "IOSCO: Crypto Regulators Should ‘Just Push Ahead’",
    "Global securities watchdog IOSCO call for crypto regulation standards",
    "IOSCO Urges Global Regulators to Accelerate and Strengthen Oversight of Crypto Markets",
    "Crypto Regulation Goes Global: Watchdog Presents Landmark Framework For Digital Markets",
    "International watchdog launches consultation on crypto regulations",
    "FTX filings hint at reboot, OKX exchange picks Paris as hub",
    "Peloton the rebrand: High end exercise bike maker says it's now for a health company for all",
    "Peloton relaunches its workout app with new free and pricer subscription tiers",
    "Peloton's new subscriptions leave behind its pricey hardware",
    "Peloton's New App Pricing: Bad for Off-Brand Bike Owners",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "Personalized wealth management, built for tech people",
    "Caroline Ellison's ‘diary’ a key piece of evidence in Sam Bankman-Fried's FTX fraud case: report",
    "Amazon Fire Max 11 is a $229 tablet aimed at productivity",
    "The 6 best features of Amazon's new Fire Max 11, our biggest and most powerful tablet yet",
    "Amazon launches its biggest tablet, the $230 Fire Max 11",
    "Fire Max 11 is Amazon's largest and most powerful tablet yet",
    "Amazon takes aim at Apple and Google with the $230 Fire Max 11, its biggest tablet ever",
    "Introducing the All-New Fire Max 11: Amazon's Biggest and Most Powerful Tablet Yet",
    "Amazon Announces Fire Max 11 Tablet With Fingerprint Sensor",
    "Amazon Fire Max 11 is a $230 Android tablet with keyboard and stylus",
    "Amazon's new Fire Max 11 is its biggest and most powerful tablet yet",
    "Amazon's New Fire Max 11 Tablet Promises Better Everything",
    "Amazon's new $329 Fire Max 11 productivity bundle looks surprisingly promising",
    "The Fire Max 11 Is Amazon's Largest Tablet Yet (and the First With Fingerprint Recognition)",
    "Amazon Fire Max 11 launches with keyboard case, fingerprint sensor and stylus",
    "Amazon's Fire Max 11 debuts with companion keyboard case, stylus, and $230 price tag",
    "Who needs the Pixel Tablet? Amazon's new Fire Max 11 looks great",
    "This Fire Max 11 Tablet Is How Amazon Plans To Squash The iPad",
    "Good luck getting work done on Android 9 ! https://twitter.com/...",
    "reminder: the 11-inch Fire Max 11 is now Max https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Universal Music Group signs deal with AI-music startup Endel",
    "Universal Music Group Embraces AI “Soundscapes” With New Deal",
    "Pixar meets The Last of Us movie about botulism toxin controlling a chef https://twitter.com/...",
    "BandLab Adds USD$25M in Series B1 Financing At $425M Post-Money Valuation",
    "BandLab Parent Raises Another $25 Million — This Time At a $425 Million Post-Capital Valuation",
    "BandLab Raises Another $25 Million, Now Valued at $425 Million",
    "Prometheum Ember Capital is the First SEC Qualified Custodian for Digital Assets Securities",
    "Crypto Startup Says It Found Path to Register With SEC Under a Broker Rule",
    "Prometheum Approved as Special Purpose Broker for Digital Asset Securities Following ATS Approval",
    "Hong Kong Expected to Lift Crypto Retail Trading Ban Next Month",
    "New Crypto Rules Suggest Hong Kong Is ‘Testing Ground’ for China, Say Experts",
    "SFC finalises rules for retail cryptocurrency trading in Hong Kong from June 1",
    "Hong Kong? Singapore? Tokyo? Seoul? Dubai? The race is on for the Web3 hub of Asia | Part 2",
    "Hong Kong set to offer retail crypto trading licenses soon",
    "Hong Kong to issue crypto licences with measures to protect retail investors",
    "Bitcoin climbs back above $27,000 after Hong Kong greenlights some retail crypto trading",
    "Hong Kong greenlights retail trading of cryptocurrency",
    "Hong Kong's Security and Futures Commission (SFC) to open doors for crypto trading platforms",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "Builder.ai Raises $250 Million Amid Surge in AI Investments",
    "QIA Leads $250-Mn Funding In British-Indian Entrepreneur's Builder.Ai",
    "London-Based Startup Builder.ai Raises $250 Million",
    "London AI firm bags $250m injection led by Qatari sovereign wealth fund",
    "Microsoft-Backed Builder.ai Raises $250 Mn In Series D Funding Round Led BY QIA",
    "QIA Leads $250 Million Funding Round for App Platform Builder.ai",
    "Builder.ai keeps on building, now with a fresh $250+ million",
    "The best TV streaming service 2023",
    "Tech industry coalition launches Stop Scams UK to combat online fraud",
    "Big tech and banks conspire in new scheme to combat fraud",
    "Very confusing country where Schemes are Good but Scams must be Stopped. https://twitter.com/...",
    "Judge Dismisses Shareholder Lawsuit Over Elon's Twitter Takeover",
    "Tesla (TSLA) shareholders show overwhelming support for Elon Musk despite controversies",
    "Exclusive: Reliance JioMart fires 1,000, a bigger layoff round likely",
    "Reliance JioMart cuts 1,000 jobs and to eliminate thousands more, report says",
    "General Secretariat of the Council of the European Union",
    "@mattburgess@infosec.exchange",
    "A day of bad news for spyware makers",
    "Spain seeks to ban encryption, leaked document reveals",
    "Leaked EU files suggest Spain supports end-to-end encryption ban",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "European Data Protection Board",
    "Data Protection Commission",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "How Meta got caught in tensions between the US and EU",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "TikTok's lead privacy regulator in Europe takes heat from MEPs",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Meta has a $11 billion reason not to leave the EU",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "EU regulators fine Meta $1.3 billion, but some say potential data losses could be even harsher",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "European regulators signal they are fed up with Facebook",
    "EU hits Meta with record €1.2B privacy fine",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "Facebook's Parent Company Meta Fined €1.2bn for Data Breach",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "EU Fines Meta Record €1.2bn; New Twitter CEO Reassures Top Ad Group",
    "TechScape: Warnings of a ‘splinternet’ were greatly exaggerated - until now",
    "Irish watchdog opposed €1.2bn Meta fine, saying it would have no ‘meaningful dissuasive effect’",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "DPC fine should be a wake-up call for government",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes."
]