[
    "International Business Times",
    "Twitter has reportedly refused to pay its Google Cloud contract",
    "Twitter is refusing to pay its Google Cloud bills- Platformer",
    "Twitter refuses to pay its Google Cloud bills, puts Trust and Safety services at risk",
    "Twitter blatantly refuses to pay its Google Cloud bills",
    "Twitter says won't pay Google for its cloud services, trust and safety teams at risk",
    "Elon Musk still hasn't paid Twitter's Google Cloud bill.",
    "Twitter Refuses To Pay Google Cloud Bill; Trust And Safety Services At Risk [Details]",
    "Google is pretty good at shutting down its own products, but... https://twitter.com/...",
    "Good thing enterprise migrations between cloud providers is trivial... https://twitter.com/...",
    "Awwwe they can repurpose Elon's old laptop and host it there https://twitter.com/...",
    "Pepperidge farm remembers https://blog.twitter.com/... https://twitter.com/...",
    "You good, @lindayacc? https://twitter.com/...",
    "Elon be stiffin' https://twitter.com/...",
    "Twitter is refusing to pay its Google Cloud bills, Platformer reports",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "All the Apple subreddits set to go dark in protest of Reddit's API charges",
    "Reddit users are planning a 48-hour blackout to protest its new pricing policy",
    "iPhone subreddit starting protest early, going dark indefinitely",
    "Reddit's CEO's AMA turns into disaster",
    "Reddit CEO: We're Sticking With API Changes, Despite Subreddits Going Dark",
    "Redditors: Your favorite subreddit might go dark on Monday. Here's what's happening",
    "Reddit's users and moderators are revolting against its CEO",
    "Thousands of subreddits pledge to go dark after the Reddit CEO's recent remarks",
    "Reddit's users and moderators are pissed at its CEO",
    "/r/gaming will go dark on June 12th in protest of reddit's API changes",
    "r/pics will go dark on June 12th in protest of Reddit's API changes that will kill 3rd party apps",
    "Reddit won't budge on the API changes that are shutting down apps like Apollo",
    "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "The Reddit App War Is Getting Messy",
    "Reddit is showing no signs of relenting in its fight against third-party client Apollo",
    "Reddit CEO Cites Profit Push in Response to Backlash",
    "Apollo will shut down as tempers flare over Reddit API changes",
    "Reddit Shows No Signs Of Backing Down From Controversial API Changes In Heated AMA",
    "Reddit's Hoped-For IPO and Pipe Dream of Cashing in on OpenAI's Hype",
    "Reddit CEO does AMA, doesn't address or even mention upcoming subreddit protests",
    "Reddit CEO Says Keeping Explicit Content on the Site Is a ‘Constant Fight’",
    "What an absolute dumpster fire for Reddit's CEO here: https://www.reddit.com/...",
    "Spez, the CEO of Reddit, doubles down on his accusations against @apolloreddit [image]",
    "the reddit AMA regarding the API changes is going about as well as you'd expect [image]",
    "The reddit AMA surround the API apocalypse has some gems in it [image]",
    "the reddit ama with the CEO is going as well as you'd expect lol https://www.reddit.com/...",
    "The way spez is treating @ChristianSelig is absolutely disgusting. Shame on Reddit [image]",
    "the ceo of reddit is an actual dumb little piggy boy [image]",
    "Addressing the community about changes to our API",
    "[DISCUSSION] Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "Reddit CEO Steve Huffman defends API changes in AMA",
    "Everything about this “AMA”",
    "The Securities and Exchange Commission, Nigeria",
    "Circular on the Activities of Binance Nigeria Limited",
    "Nigeria regulator says local Binance operations ‘illegal’",
    "Nigeria's SEC Says Binance Operations in Country Are ‘Illegal’",
    "Binance Faces Regulatory Hurdle in Nigeria: Ordered to Cease Operations",
    "Binance Hit With Suspension Notice In Nigeria By Market Regulator",
    "Nigerian Regulator Labels Binance Affiliate's Local Operations Illegal",
    "Binance ordered out of Nigeria",
    "Nigeria regulator halts Binance operations: Report",
    "Nigeria SEC declares Binance operations in country illegal",
    "Nigerian Regulator Moves Against Binance Amid U.S. Crypto Crackdown",
    "BREAKING: Binance Declared illegal By Nigerian SEC, Accused Of Wrongful Operation",
    "Nigeria's SEC declares Binance Nigeria's operations illegal",
    "Nigeria's SEC orders Binance Nigeria Limited to stop operations",
    "Nigeria regulator says Binance not registered and must stop soliciting investors: Reuters",
    "Breaking: Binance Declared “Illegal” By Nigeria SEC, Ordered To Cease Operations",
    "Binance is illegal in Nigeria",
    "These guys are really running out of road, eh? https://www.bloomberg.com/...",
    "Does anyone remember Pink Care Token? https://twitter.com/...",
    "Binance getting pressure from other jurisdictions now. https://twitter.com/...",
    "This is terrible news for scammers. https://twitter.com/...",
    "The crypto pivot to Africa just took a hit https://twitter.com/... [image]",
    "Binance Declared Illegal By Nigeria SEC",
    "Hundreds Hear ChatGPT Sermon, Sometimes Snickering",
    "AI-Powered Chatbot ChatGPT Meets Spirituality: A Revolutionary Leap in Church Sermons",
    "Lutheran church in Germany has AI deliver sermon",
    "300 People Attend a Church Sermon Generated by ChatGPT",
    "Germany refusing Intel's additional demand for subsidies for chip plant: report",
    "The Vision Pro's biggest advantage isn't Apple's hardware",
    "How AI art killed an indie book cover contest",
    "Personalized wealth management, built for tech people",
    "@BenPatrickWill@mastodon …",
    "@BenPatrickWill@mastodon.social",
    "A new tool can tell if your paper was written by AI",
    "AI-generated academic science writing can be identified with over 99% accuracy",
    "Scientists claim >99 percent identification rate of ChatGPT content",
    "New tool claims it can identify AI-written science papers 99% of the time",
    "ChatGPT Is Convincing But Researchers Say They Can Spot AI Writing With 99% Accuracy",
    "U. Kansas researchers crack the code on ChatGPT detection",
    "New Tool Can Tell If Something Is AI-Written With 99% Accuracy",
    "Was the science paper written by a scientist or a LLM? https://www.cell.com/... [image]",
    "AI detecting AI.....I sense a never ending loop here... https://twitter.com/...",
    "Tesla Autopilot Crashes Way More Common Than Thought",
    "Germans beat Tesla to autonomous L3 driving in the Golden State",
    "can't wait for this guy to put a chip in my brain https://twitter.com/...",
    "17 fatalities, 736 crashes: The shocking toll of Tesla's Autopilot",
    "17 Fatalities, 736 Crashes: The Shocking Toll Of Tesla's Autopilot",
    "Free compensation benchmarking data from 3,000 startups",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) Microsoft CTO Kevin Scott",
    "Jun 8-12VIRTUAL: Summer Game Fest",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Verizon DBIR: Social Engineering Breaches Double, Leading to Spiraling Ransomware Costs",
    "2023 DBIR Executive Summary",
    "2023 Data Breach Investigations Report (DBIR)",
    "Seven key insights from the 2023 Verizon Data Breach Investigations Report",
    "DBIR Report 2023 - Master's Guide",
    "Verizon 2023 DBIR: Human Error Involved in Many Breaches, Ransomware Cost Surges",
    "DOS Attacks Dominate, but System Intrusions Cause Most Pain",
    "Verizon 2023 DBIR: Credential Leaks Continue To Be A Major Issue",
    "Report Details Three Top Cyber Threats for Public Sector",
    "Verizon DBIR: Ransomware accounts for one in four data breaches",
    "Verizon 2023 Data Breach Investigations Report: 74% of breaches involve human element",
    "ChatGPT's Humor Barely Extends Beyond The Same 25 Jokes, Researchers Find",
    "ChatGPT is fun, but it is not funny! Humor is still challenging Large Language Models",
    "ChatGPT can only tell 25 jokes, and can't come up with new ones, researchers find",
    "ChatGPT fun but not funny: Students in Germany put ChatGPT's humor to the test",
    "So it's just like your dad then. https://arstechnica.com/...",
    "Researchers discover that ChatGPT prefers repeating 25 jokes over and over",
    "Sberbank, Russia's Biggest Lender, To Offer Crypto Asset Trading This Month",
    "Credit Suisse CEO teases UBS deal finalization",
    "New Crypto Banking System Coming Amidst Coinbase and Binance Crackdown",
    "Bias and stolen data are the core problems with “AI” not X-risk. https://twitter.com/...",
    "Smart TV industry rocked by alleged patent conspiracy from chip maker",
    "China's Crucial Role in Shaping Global AI Safety: A Call from OpenAI's CEO",
    "OpenAI CEO Sam Altman Backs China To Lead AI Regulations",
    "OpenAI CEO Calls for Collaboration With China to Counter AI Risks",
    "Remember the Uyghurs? And how they are monitored? https://twitter.com/...",
    "Bing Preview Release Notes: Voice Chat on Desktop",
    "Microsoft adds voice mode to Bing AI on the web",
    "Bing Chatbot Can Now Have A Voice Conversation With You On Desktop Systems",
    "Microsoft Brings Voice Chat to Bing Chat on Desktop",
    "You can now talk to Bing Chat in Windows 11 with your voice",
    "Bing AI Voice Chat Comes to Desktop"
]