[
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Activision's Bobby Kotick says he made ‘a bad decision’ not bringing Call of Duty to Switch",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Crunch time in FTC fight against Microsoft deal to buy Activision",
    "Microsoft CEO Satya Nadella admits he doesn't love console game exclusives",
    "Activision CEO doesn't “agree” with Xbox Game Pass-style services",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Sony's Call of Duty Deal With Activision Only Includes One More Game",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Microsoft CEO Would ‘Get Rid’ of Console Exclusives if He Could",
    "Microsoft CEO defends Activision deal, says he wants games across platforms",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Not Supporting the Switch Was “a Bad Decision on My Part” - Activision CEO",
    "Microsoft CEO Satya Nadella blames Sony for console game exclusives",
    "Microsoft CEO Nadella tells a judge his planned Activision takeover is good for gaming",
    "Microsoft CEO Says He Would “Love” To Get Rid Of Xbox Exclusives But Can't Because Of Sony",
    "Microsoft's CEO Wants To Get Rid Of Console Exclusives Entirely",
    "Satya Nadella wants to remove all game exclusivity: ‘I have no love for that world’",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Activision would likely ditch Microsoft takeover if FTC pauses deal",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Activision Will Be Jilted if Microsoft Deal Blocked, CEO Kotick Says",
    "Massive PlayStation leak reveals Call of Duty revenues and first-party game budgets",
    "Sony court documents removed after redacted details spotted",
    "Sony Made A Truckload Of Cash From Call Of Duty Players In 2021",
    "Sony Accidentally Revealed How Deeply Loyal Call Of Duty Players Are",
    "Both TLOU Part II and Horizon Forbidden West cost over $200 million to develop",
    "Sony accidentally reveals trade secrets by using sharpie marker",
    "Leaked PlayStation intel reveals shocking number of Call of Duty players only play CoD",
    "Sony says nearly 50 percent of PS5 users also own Nintendo Switch in this market",
    "The Risks of Cutting Off China",
    "Sony Accidentally Reveals Major PlayStation Game Budgets",
    "Call Of Duty's Worth to PlayStation May Have Been Revealed by Sony",
    "Sony's secrets: Poor redactions show first-party development costs",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "A staggering number of PlayStation users only play Call of Duty and literally nothing else",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "Sony's Confidential PlayStation Secrets Just Spilled Because of a Sharpie",
    "@danilo.redeem-tomorrow.com",
    "Mojang leaving official Minecraft subreddit amid current protests",
    "Is Minecraft subreddit shutting down?",
    "Minecraft Will No Longer Use Reddit In Light Of The API Changes",
    "Minecraft Developer Mojang Quits Reddit Citing API Change, Protests",
    "The huge Minecraft subreddit will no longer get any official messages from Mojang",
    "Fresh Blow To Reddit As Minecraft Makers Walk Out",
    "Minecraft's developers are stepping away from Reddit. …",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Reddit Is Already on the Rebound",
    "Data suggests Reddit protests negatively affected traffic, advertiser engagement",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "Twitter's New Chief Eases Into the Hot Seat",
    "The Download: AI disinformation, and lab-grown meat",
    "Inside Linda Yaccarino's ambitious plan for Twitter 2.0",
    "Twitter's new chief working on plans to bring advertisers back to platform - FT",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Transparency and brand safety on Google Video Partners",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "YouTube is about to get VERY aggressive with ad blockers",
    "Google says report claiming violations of its own video ad standards is inaccurate",
    "New Research Suggests that Google Has Misled Advertisers Over Video Ad Placement",
    "Do Google's video ads violate its standards? A new report claims the tech giant “misled” buyers.",
    "Google accused of mis-selling ads on third-party websites for years",
    "Google reportedly violates its own standards in third-party ad deals 80% of the time",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "Google's Ad Scam Eerily Similar To Facebook's Metric Inflation Scam",
    "Google accused of misleading its advertisers on over 80% of ad placements",
    "YouTube ads accused of primarily serving on low-quality websites, Google denies",
    "Study Says Google Violated Own Ad Standards, Could Face Refunds",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "OpenAi Sued for ‘Unprecedented’ Data Theft and Privacy Violations",
    "ChatGPT creator sued for data theft in $3 billion class-action lawsuit",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "OpenAI sued for allegedly ‘stealing’ data from millions",
    "ChatGPT maker OpenAI hit with class-action lawsuit over alleged data theft",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "The AI Arms Race and Why We Need to Come Together Now",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Binance hit by two further banking setbacks in Europe",
    "Binance Loses European Banking Partner Paysafe",
    "Binance loses euro banking Paysafe amid global regulatory scrutiny",
    "Binance Faces Another Blow as EUR Banking Partner Halts Support in September",
    "Binance's EUR banking partner announces plan to halts support",
    "Binance's European banking partner to withdraw support - CoinDesk",
    "Here's When Binance Users Have to Provide New Banking Details for EUR Deposits",
    "Binance's European Banking Partner Paysafe Withdraws Support",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "Online Hate and Harassment: The American Experience 2023",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech is Up on Twitter Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "Most Americans Have Been Harassed Online: Survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "Introducing Proton Pass - Protecting your passwords and online identity",
    "Proton Pass end-to-end encrypted password manager is here and free for everyone",
    "Proton Pass is free, but I think the paid Plus version is the way to go",
    "Proton Launches Proton Pass: The Free Encrypted Password Manager You Need",
    "Proton Pass: Free Password Manager for iOS, Android and More",
    "Proton Pass  —  Free and fully encrypted password manager to keep your login credentials safe.",
    "Proton's Password Manager Is Now Available for Everyone",
    "Proton's password manager Proton Pass comes out of beta",
    "Proton's encrypted password manager is now available to everyone.  - The Verge",
    "ProtonMail Developer Launches Free, Encrypted Password Manager",
    "Proton's got a new password manager with email masking and more",
    "Proton launches its password manager Proton Pass, now available for download",
    "Proton Pass password manager leaves beta: here is our take",
    "Proton's new password manager has just landed for all users",
    "Proton Pass, the free password manager from Proton Mail, is out of beta",
    "Save 80% Off ‘Proton Pass Plus’ Password Manager Forever! [Limited Time Deal]",
    "Proton Pass password manager launches with a deal that's just too good to pass up",
    "Proton Pass free password manager emerges from beta",
    "Proton Pass password manager is out of beta and available for free",
    "@zackwhittaker@mastodon.social",
    "Android Spy App LetMeSpy Suffers Major Data Breach, Exposing Users' Personal Data",
    "How to Find & Remove Spyware From iPhone or Mac",
    "Spy app LetMeSpy spied on: hackers leak victim and user data going back years",
    "LetMeSpy Phone-Tracking App Hacked, Revealing User Data",
    "Mobile spyware app LetMeSpy breached",
    "This hidden spyware app was hacked revealing thousands of users' data — was it on your phone?",
    "LetMeSpy App Hacked, Sensitive Victim and User Data Leaked",
    "Ironic: LetMeSpy Spyware Hackers Were Hacked (by Hackers)",
    "This top mobile phone spying app says it has been hacked, with thousands of users at risk",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "Data stolen in hack of spyware provider LetMeSpy",
    "Android Users, Beware! Major Security Breach Reported Via Stealth App",
    "LetMeSpy, a stalkerware app spying on thousands, says it was hacked",
    "Amazon to Soon Face Big FTC Antitrust Suit Over Online Marketplace Power, Report Says",
    "GOP chairs accuse FTC's Khan of ‘misleading Congress’ over ‘ethical failure’ in Meta probe",
    "AI-generated text is hard to spot. It could play a big role in the 2024 campaign",
    "Oversight Board Tells Facebook to Remove Video of Cambodian Prime Minister Threatening Opponents",
    "Meta oversight board orders firm to take down video by Cambodian leader",
    "Cambodia PM Hun Sen accused of inciting violence on social media",
    "Oversight Board overturns Meta's decision in “Cambodian prime minister” case",
    "Oversight board recommends Facebook suspend Cambodian premier's account for violent language",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "Tiger Global rejects low bids, aims for cash through startup stakes",
    "That's a lot of words to say “no bid” and “inflated marks” https://twitter.com/...",
    "@mattburgess@infosec.exchange",
    "TSMC sending more workers to speed up building of new Arizona plant",
    "TSMC sends more Taiwanese workers to finish Arizona plant",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "Micron to Introduce GDDR7 Memory in 1H 2024",
    "Memory chipmaker Micron's sales down 57% as market bottoms out",
    "Micron to introduce next-gen GDDR7 graphics memory in the first half of 2024",
    "Chip maker Micron beats estimates on demand from booming AI, easing glut",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Micron Technology, Inc. Reports Results for the Third Quarter of Fiscal 2023",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "@ravirockks@infosec.exchange",
    "@kimzetter@infosec.exchange",
    "@metacurity@infosec.exchange",
    "How AI Influences What You See on Facebook and Instagram",
    "Meta finally explains how Facebook & Instagram AI algorithms work",
    "Meta releases clues on how AI is used on Facebook and Instagram",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple says it already changed its rules enough to satisfy Spotify EU complaint",
    "Apple argues no more changes necessary to App Store policy in Spotify EU antitrust case",
    "Apple in standoff with EU over treatment of music streaming rivals",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/28 - Who Needs A Mac Pro?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Runway raises $141 million to continue building the future of creativity",
    "Meituan buys out four-month-old AI start-up Light Year for US$281 million",
    "Meituan Buys Co-Founder's Months-Old AI Startup for $234 Million",
    "Meituan Completes Acquisition of 100% Equity of Guangnian Zhiwai",
    "I see AI has reached the “acquisitions mad lib” stage.  [embedded post]",
    "Worldcoin launches in Germany and integrates with Okta's Auth0 platform",
    "Massachusetts man is offloading 2,200 vintage Z80 computers on eBay one at a time",
    "Why 2,000 Ancient PCs Mysteriously Appeared on eBay",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "Typeface Raises $100M in Series B Funding",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface lands $100M for its generative AI content creation engine",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "Apple livestreaming through Chinese e-commerce apps, but no bargains to be had",
    "Silicon Valley Business Journal",
    "Oracle is no longer buying Intel processors for its data centers",
    "Oracle Increases Ampere's Momentum with New Database Support",
    "Oracle spending ‘billions’ on Nvidia chips this year",
    "Building Momentum for the Sustainable Cloud",
    "Chip startup Ampere pitches climate-friendly data centers",
    "US tech ban and strong demand for AI chips in China is fuelling NVIDIA GPU smuggling",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Mastercard Building Ethereum-Based Blockchain App Store for Regulated Financial Apps",
    "Mastercard Unveils Multi-Token Network (MTN)",
    "Local Government Federal Credit Union offerings",
    "Mastercard UK To Test Tokenized Bank Deposits",
    "Mastercard Ventures into Tokenized Bank Deposits with Multi-Token Network Pilot",
    "Mastercard Launches Digital Assets and Blockchain Initiative",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "Celestial AI Raises $100M in Series B Funding",
    "Photonics To Make Celestial HBM3 Memory Fabric",
    "Celestial AI's $100M raise shines light on AI computing wall",
    "Visa acquires core banking platform Pismo for $1bn",
    "Visa to Acquire Pismo for US$ 1 billion",
    "Visa Buys Brazilian Techfin Pismo For $1 Billion",
    "Visa to Acquire Core Banking Platform Pismo for $1 Billion",
    "Visa Buys Brazilian Fintech Pismo for $1 Billion",
    "Visa to acquire Brazilian fintech Pismo for $1 billion in cash",
    "Visa to Buy Brazilian Payments Provider Pismo for $1 Billion",
    "Visa to acquire Brazilian startup Pismo for $1B",
    "Snowflake and Databricks are putting the data stored in their services to work",
    "What's New in Data Engineering and Streaming at Data + AI Summit 2023",
    "Databricks reinforces commitment to truly open data lakehouses with Delta Lake 3.0",
    "Databricks injects array of AI tools into Lakehouse",
    "Databricks Unveils Lakehouse AI - A Platform For Building Generative AI Models",
    "Databricks Data + AI Summit 2023 Keynote Recap: LakehouseIQ, Delta Lake 3.0, and More!",
    "Databricks Introduces New Generative AI Tools, Investing in Lakehouse AI",
    "Databricks Unleashes New Tools for Gen AI in the Lakehouse",
    "Leveraging Data in Snowflake and Databricks for Optimal Results",
    "What is Delta Lake in Databricks?",
    "Databricks Offers Data Unity Option With New Delta Lake Release",
    "Databricks adds federation, generative AI front end and development tools to its lakehouse",
    "Databricks continues generative AI push, launches LakehouseIQ, Lakehouse AI tools",
    "Databricks Data + AI Summit: LakehouseIQ, Lakehouse AI and everything announced",
    "Introducing Lakehouse Federation Capabilities in Unity Catalog",
    "Snowflake, Databricks set to collide over AI",
    "Databricks Delta Lake 3.0 to counter Apache Iceberg tables",
    "Databricks builds a data mesh with the launch of Lakehouse Federation",
    "What's New with Data Sharing and Collaboration on the Lakehouse",
    "Lakehouse AI: A Data-Centric Approach to Building Generative AI Applications",
    "What's new with Unity Catalog at Data and AI Summit 2023",
    "Introducing LakehouseIQ: The AI-Powered Engine that Uniquely Understands Your Business",
    "Introducing Materialized Views and Streaming Tables for Databricks SQL",
    "Databricks' Delta Lake 3.0 bridges compatibility gaps with Apache Iceberg and Hudi",
    "WSJ News Exclusive | FTX Begins Talks on Reboot Amid Regulatory Crackdown on Crypto Exchanges",
    "FTX begins talks to relaunch international cryptocurrency exchange - WSJ",
    "FTX reboot on the way: CEO holds talks with ‘interested parties’ — Report",
    "FTX token (FTT) soars over 20% as exchange relaunch plans resurface",
    "FTT Flies 45% On Rumors Of FTX Planned Relaunch",
    "Failed Crypto Exchange FTX Looks to Make a Comeback",
    "FTX would take the first steps to restart its operations",
    "FTT jumps as much as 33% on news of potential FTX ‘reboot’",
    "FTX ‘Reboot’ Talks Begin and Send FTT Token Soaring 15%",
    "FTX Reportedly Seeking to Relaunch",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange"
]