[
    "U.S. District Court, Western District of Washington",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "Amazon Settles Complaints Over Ring Surveillance, Use of Children's Voice Recordings",
    "Amazon to pay $30m over Alexa and Ring privacy violations",
    "FTC fines Amazon $25M for violating children's privacy with Alexa",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon settles with FTC for $25M after ‘flouting’ kids' privacy and deletion requests",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Federal regulators fine Amazon $25 million over child privacy issues",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "Amazon.com to pay $25 million to settle Alexa privacy lawsuit with FTC",
    "U.S. District Court, District of Columbia",
    "Amazon's Ring used to spy on customers, FTC says in privacy settlement",
    "Ring's Response to Our Recent Settlement With the FTC",
    "Federal Trade Commission v. Ring LLC",
    "Amazon to pay over $30 million for Ring and Alexa privacy violations",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Amazon charged with privacy violations over Alexa and Ring cameras",
    "Amazon settles Alexa and Ring privacy violations for $30 million",
    "Amazon's Ring used to spy on customers, FTC says",
    "Amazon will pay more than $30M to settle FTC complaints over Alexa and Ring privacy issues",
    "Ring Settles FTC Allegations of Poor Cybersecurity, Privacy",
    "Amazon to pay $30M in FTC settlements over Alexa, Ring privacy violations",
    "Amazon will pay over $30 million for Alexa and Ring privacy violation allegations",
    "FTC Orders Ring to Pay $5.8 Million in Refunds For Surveilling Customers, Failing to Stop Hackers",
    "Amazon To Pay $30 Million For Alexa, Ring Privacy Violations",
    "How to be sure your home security isn't spying on you",
    "FTC: Security failings at Amazon's Ring let hackers, employees access customer videos",
    "Amazon's Ring agrees to pay $5.8 million to settle FTC spying suit",
    "Amazon's Ring and FTC Settle Charges of Privacy Violations",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "Amazon gets slap on the wrist over privacy violations with Ring cameras",
    "FTC's Ring Settlement Shows Why Companies Don't Respect User Privacy",
    "Apple is testing M2 Max and M2 Ultra Macs just before WWDC",
    "Apple preps first Mac with M2 Ultra chip and M2 Max desktop ahead of WWDC",
    "Two new Macs with M2 Max & M2 Ultra being tested ahead of WWDC",
    "New Desktop Macs With M2 Ultra and M2 Max Chips Could See WWDC Debut",
    "Apple Tests High-End Mac Desktops Ahead of WWDC: Report",
    "Apple might announce ‘several’ Macs at WWDC",
    "Apple is Testing New M2 Max and M2 Ultra Macs Ahead of WWDC [Report]",
    "Apple to open Mac Studio, M2 MacBook trade-ins next week as WWDC rumors swirl",
    "Multichain Can't Find Its CEO as Company Loses Access to Its Servers",
    "Crypto Bridging Protocol Multichain ‘Unable to Contact’ CEO Zhaojun",
    "Multichain Loses Server Access After CEO Goes Missing",
    "Multichain Shuts Cross-Chain Bridge Protocol After CEO Goes Missing: What Next?",
    "Multichain unable to contact CEO, has no access to project servers",
    "Multichain (MULTI) team locked out as CEO goes missing",
    "Multichain team cannot locate CEO, halts service for affected chains",
    "Breaking: Multichain Suspends Cross-Chain Services, Fails To Contact CEO",
    "PKI at its finest. One man has the private 🔑 everyone else... not so much https://twitter.com/...",
    "I don't know a single chain mentioned in this tweet https://twitter.com/...",
    "interesting, ceo is gone $multi https://www.theblock.co/... [image]",
    "Multichain team says it can't contact CEO amid protocol problems https://www.theblock.co/...",
    "📣 Had a call with Reddit to discuss pricing. …",
    "Reddit's API pricing results in shocking $20 million-a-year bill for Apollo",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "The best Reddit client app is in danger due to price demands",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Reddit wants to make a ‘million dollars’ from API following Twitter",
    "Popular Reddit app Apollo may go out of business over Reddit's new, unaffordable API pricing",
    "Reddit might destroy third-party Reddit apps (Update: Reddit stands firm)",
    "Apollo for Reddit might shut down due to Reddit's new API pricing",
    "Reddit Joins Twitter In Squeezing Devs With Unreasonable Fees",
    "Proposed changes to Reddit API could mean the end of third-party apps like Apollo",
    "Reddit has it in for third-party clients ↦",
    "Reddit Slaps Apollo with Hefty $20 Million Annual Fee",
    "The attack on third-party social client apps continues https://twitter.com/...",
    "API Extortion Era https://twitter.com/...",
    "bro is there even gonna be any of the Old Internet left by the end of 2023 https://twitter.com/...",
    "International Business Times",
    "Improving mathematical reasoning with process supervision",
    "OpenAI Announces New Approach To Fight AI ‘Hallucinations’ After Legal Fabrications",
    "OpenAI develops LLM that uses a chain of thought like humans",
    "Access to models → Alignment progress https://twitter.com/...",
    "Process supervision makes intuitive sense too! https://twitter.com/...",
    "It's about the journey and not about the destination they say... https://openai.com/...",
    "India Semiconductor Mission",
    "India expands scope of its semiconductor ambitions; Vedanta likely gets a lifeline",
    "Centre invites applications for setting up Semiconductor and Display Fabs. Details here",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Report shows the amazing strength of the global App Store ecosystem last year",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "Apple App Store Commerce Climbed 29% Last Year to $1.1 Trillion",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "Cortex Raises $35M in Series B Funding",
    "A new standard for Internal Developer Portals - Putting our new Series B financing to work",
    "Cortex Applications raises $35M to bring visibility into microservices quality",
    "Ultraleap launches 2nd gen of its hand tracking camera with the Leap Motion Controller 2",
    "Ultraleap launches Leap Motion Controller 2",
    "Leap Motion's gesture control quest continues with the Leap Motion Controller 2",
    "Introducing the Leap Motion Controller 2 from Ultraleap",
    "Vive XR Elite Getting New Tracking And Mixed Reality Features & Improvements",
    "Supply Chain Risk from Gigabyte App Center Backdoor",
    "Critical vulnerability in Gigabyte Motherboards discovered",
    "Firmware Backdoor Discovered in Gigabyte Motherboards, 250+ Models Affected",
    "Gigabyte firmware component can be abused as a backdoor",
    "Gigabyte Sold Millions of Motherboards with Firmware Backdoor",
    "Gigabyte brought new top-tier motherboards and more to Computex 2023",
    "Gigabyte shipped hundreds of models of motherboards with a hidden firmware backdoor",
    "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
    "Tons of Gigabyte motherboards come with a hidden firmware backdoor",
    "Millions of PCs could be targeted by hackers in firmware blunder",
    "Organizations Warned of Backdoor Feature in Hundreds of Gigabyte Motherboards",
    "Definitely be aware if your mobo is on the list. https://www.wired.com/...",
    "Scream in supply chain security... https://twitter.com/...",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Rarbg: Popular movie and TV torrent site shuts down",
    "RARBG: Over 267,000 Movie & TV Show Magnet Links Appear Online",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Comcast could enter the $200 billion video games market, analysts speculate",
    "Activision Blizzard substantiated more than two dozen misconduct incidents by employees last year",
    "Bobby Kotick “broke his silence”—but his claims don't add up",
    "Activision Blizzard Investigators Confirm 29 Cases Of Harassment Last Year",
    "Activision Blizzard seriously considered buying Time Warner",
    "Activision Blizzard CEO claims widespread toxic workplace allegations are ‘mischaracterizations’",
    "Call Of Duty CEO Says Activision Never Had A ‘Systemic Issue With Harassment’",
    "Kotick blames scandals on “a very aggressive labor movement”",
    "Activision Blizzard CEO States Company Never Had a “Systemic Issue With Harassment”",
    "Bobby Kotick blames Activision toxicity on ‘outside forces’ - but he's pro-union",
    "Activision never had “systemic issue with harassment”, says CEO Bobby Kotick",
    "Activision Blizzard wanted to acquire Time Warner, says Bobby Kotick",
    "https://twitter.com/... [image]",
    "As part of AI push, Chinese tech giant Baidu is now rolling out an AI venture fund",
    "Amazon Implementing AI Solution to Spot Damaged Items Before Shipping",
    "Amazon is using AI in its warehouses to spot damaged items.",
    "Damn the Amazon AI just identified me as damaged goods :(",
    "Lightmatter triples valuation to solve generative AI's energy crunch",
    "Lightmatter's photonic AI hardware is ready to shine with $154M in new funding",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "Lightmatter reels in $154M for its optical interconnect and chips",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "Italy to launch €150M fund for AI startups",
    "Salesforce posts slowest quarterly revenue growth since 2010",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Salesforce delivers to expectations but contract delays and rising capital costs weigh on stock",
    "Salesforce Delivers On Margin Improvement But Sales Outlook Only Edges By Views",
    "Salesforce CEO Benioff Predicts AI Spending Boom",
    "Salesforce Q1 better than expected, margins improve",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Free compensation benchmarking data from 3,000 startups",
    "Amazon corporate workers stage walkout, citing ‘lack of trust’ in leadership",
    "Amazon corporate workers stage walkout at Seattle headquarters",
    "Amazon Workers Walk Out Over Layoffs and Broken Climate Promises",
    "Hundreds of Amazon workers walk out to protest return-to-office, climate",
    "Some Amazon employees walk out in Seattle to protest climate, office policies",
    "Amazon employees stage walkout at HQ over frustrations with leadership",
    "Amazon employees walk out, seeking bolder climate action and end of return-to-office policy",
    "Amazon Employees Walk Out to Fight Back-to-Office Policy and Climate Change",
    "Amazon workers walk out to protest return to office mandates and the company's climate impact",
    "Corporate Amazon workers walk out over climate goals and return to office",
    "Amazon workers walk out over ‘lack of trust’ in leadership",
    "Gotta love a good white collar walkout. https://twitter.com/...",
    "Oppo introduced a new MR glass partnered with Qualcomm in China",
    "It'd basically be a miracle if Apple is able to unveil its mixed-reality headset at WWDC",
    "The VR space just got more crowded.",
    "Measurabl, an ESG platform for real estate, raises $93M",
    "Proptech Firm Measurabl Closes $93 Million Series D Raise",
    "Measurabl raises $93M Series D for real estate ESG",
    "Measurabl Raises $93M in Series D Funding",
    "Measurabl Snags $93M For Carbon Footprint Management",
    "Personalized wealth management, built for tech people",
    "What is Generative AI and how does AI improve customer experience?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "GetYourGuide raises $194 million to fuel curated travel experiences and global expansion",
    "GetYourGuide nabs $194M for global expansion, more AI development",
    "Capillary raises $45 Mn from Avataar Ventures and others",
    "After Deferring IPO Plan, Capillary Bags $45 Mn Funding From Avataar Ventures And Its LPs",
    "SaaS startup Capillary Technologies secures $45M from Avataar Ventures, others",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "Okta and CrowdStrike shares plunge on broader macroeconomic concerns",
    "CrowdStrike Earnings Top Estimates, But Recurring Revenue Metric Disappoints",
    "CrowdStrike Reports First Quarter Fiscal Year 2024 Financial Results",
    "Meta Platforms asks federal court to halt further FTC restrictions: WSJ",
    "Facebook Accuses FTC of Power Grab Over Proposed Changes to $5 Billion Privacy Settlement",
    "Meta Platforms Asks Federal Court to Block FTC in Privacy Fight",
    "Silicon Valley Business Journal",
    "Google head of communications and advisor to CEO Sundar Pichai to exit",
    "Google's Communications Chief to Depart",
    "Says a lot about where Google is right now. https://twitter.com/...",
    "How Activists Proved to be Salesforce's ‘Superpower’",
    "Canadian Regulator Investigates Legality of Binance Serving Clients from Canada",
    "Binance Faces Probe By Canadian Securities Regulator",
    "Bybit follows Binance in departure from Canadian market",
    "Ah. So that's why it has barred Canadians. https://twitter.com/...",
    "Amazon introduces Echo Pop smart speaker in India: Check price, specs, features",
    "The new Amazon Echo Pop is stylish, affordable, and offers good sound for small spaces",
    "Amazon Echo Pop review: The latest Echo flops rather than pops",
    "Amazon Echo Pop Review: An Alexa Speaker That Looks Nice And Talks Back",
    "Amazon Echo Pop Review: a perfectly priced Alexa",
    "Amazon Echo Pop review: A portable smart speaker for small spaces",
    "Talis Capital Holds First Close of $175M Fund III",
    "Magic announces $52M Strategic Funding Round led by PayPal Ventures",
    "PayPal Ventures Leads $52M Round for Crypto Firm Magic",
    "Crypto Startup Magic Raises $52M in Round Led by PayPal Ventures",
    "Payments Giant PayPal Invests in New Crypto Wallet Software in Push for Web3 Adoption",
    "Multi Cryptocurrency Wallet Development: A Comprehensive Guide for Crypto Enthusiasts",
    "Magic Raises $52M in Strategic Funding",
    "Magic raises $52m despite crypto bear market",
    "Web3 Firm Magic Summons $52 Million With PayPal Ventures' Help",
    "Crypto wallet Magic raises $52M to expand ‘wallet-as-a-service’ solution",
    "Web3 Infrastructure Company Magic Raises $52M in a Round Led By PayPal Ventures",
    "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "PayPal Ventures invests in web3 onboarding startup Magic",
    "Garmin unveils next-gen fēnix 7 Pro Series",
    "Conquer every day and every adventure with epix Pro Series from Garmin",
    "Garmin unveils new Fenix 7 Pro and Epix Pro Gen 2 series watches",
    "Garmin unveils Fenix 7 Pro and Epix Pro smartwatches with New Sizes, Nighttime Features",
    "Garmin Fenix 7 Pro & Epix Pro Promise Weeks of Battery Life",
    "Garmin Fenix 7 vs 7 Pro: Garmin's top-end smartwatches compared",
    "Garmin Fenix 7 Pro and Epix Pro unveiled with new LED flashlights and features",
    "Garmin Fenix 7 Pro arrives with improved heart sensor and even more flashlights",
    "Garmin reveals high-end smartwatches for explorers with deep pockets",
    "Garmin Epix 2 Pro & Fenix 7 Pro are official: here's what's new & different",
    "Epix 2 Pro: Garmin announces new smartwatches in three sizes with flashlight and improved sensors",
    "EU commissioner calls for AI code of conduct ‘within months’",
    "Europe turns to existing laws to regulate cutting-edge AI",
    "The struggle to control AI",
    "EU, US ready common code of conduct on artificial intelligence",
    "ChatGPT Risks Divide Biden Administration Over AI Rules in EU",
    "Twitter will now put Community Notes ‘fact checks’ on images",
    "Twitter Extends Community Notes to Images After Pentagon Explosion Tweet",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter Adds Crowdsourced Fact Checks To Images",
    "Twitter launches Community Notes to tackle the spread of misleading media",
    "Twitter Community Notes for images is currently in the testing stage",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Twitter launches Community Notes for images",
    "Twitter “Notes on Media” to fight bad actors",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Twitter Expands Crowdsourced Fact-Checking Following Phony Viral Photo",
    "Twitter is testing Community Notes for images",
    "Data about Apple's AR headset screens has been leaked",
    "Apple Reality Pro VR Headset: New Report Claims Massive Leak",
    "Curved Apple headset design is manufacturing's worst nightmare",
    "Apple Reality Pro VR Headset Could Be 50X Brighter Than The Quest 2 And Support HDR",
    "Display analyst Ross Young tweets out possible specs for Apple's AR headset",
    "Apple mixed reality headset specs leak right before WWDC 2023 — here's what you get",
    "Apple's Reality Pro headset specs just leaked",
    "This leaked Apple Reality Pro AR/VR brightness spec puts the competition in the shade",
    "The Apple VR headset display could be 50 times brighter than your Oculus Quest 2's",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Rumored 4K screens could let Apple VR/AR headset offer real world-like clarity",
    "Apple's mixed reality headset will reportedly have some insane brightness levels",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "Apple's First AR/VR Headset Could Offer Impressive Display Specs",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Apple's MR headset tipped to have dual 4K displays with an eye-popping 4,000ppi",
    "Here are the specs for Apple's ‘Reality One’ XR headset displays",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate"
]