[
    "AI means everyone can now be a programmer, Nvidia chief says",
    "WPP teams up with Nvidia to use generative AI in advertising",
    "Live From Taipei: NVIDIA CEO Unveils Gen AI Platforms for Every Industry",
    "NVIDIA Keynote at COMPUTEX 2023",
    "NVIDIA ACE for Games Sparks Life Into Virtual Characters With Generative AI",
    "Nvidia Announces Four Supercomputers, with Two in Taiwan",
    "NVIDIA: Grace Hopper Has Entered Full Production & Announcing DGX GH200 AI Supercomputer",
    "NVIDIA Launches Accelerated Ethernet Platform for Hyperscale Generative AI",
    "Nvidia to build Israeli supercomputer as AI demand soars",
    "Nvidia creates open server spec to house its own chips - and the occasional x86",
    "Watch this Nvidia demo and imagine actually speaking to AI game characters",
    "Nvidia CEO unveils flurry of AI projects, products in Taiwan",
    "Nvidia ACE Brings AI to Game Characters, Allows Lifelike Conversations",
    "Nvidia Unveils DGX GH200 Supercomputer, Grace Hopper Superchips in Production",
    "WPP Partners With NVIDIA to Build Generative AI-Enabled Content Engine for Digital Advertising",
    "Nvidia unveils GH200 super chip and DGX GH200 computing platform for AI",
    "Nvidia revolutionizes content creation using generative AI with ad giant",
    "Nvidia unveils more AI products after $184 billion rally",
    "Nvidia unveils latest supercomputer for generative AI",
    "Nvidia Unveils DGX GH200 Next-Generation AI Supercomputer at Computex 2023",
    "Nvidia chief Jensen Huang says AI is creating a ‘new computing era’",
    "NVIDIA's Quantum Leap: Unleashing the Power of Generative AI, NVDA Up 172% in YTD Period",
    "Nvidia unveils DGX GH200, supercharges AI development and gaming industry",
    "NVIDIA Grace Hopper enters full production, with insane AI supercomputer coming",
    "Nvidia unveils a new engine for enterprise AI",
    "Nvidia reveals ridiculous supercomputer built to create next-gen AI",
    "NVIDIA Unveils Powerful NVIDIA DGX GH200 AI Supercomputer for Next-Gen AI Applications",
    "All the Nvidia news announced by Jensen Huang at Computex",
    "NVIDIA's next DGX supercomputer is all about generative AI",
    "Nvidia's supercomputer may bring on a new era of ChatGPT",
    "Nvidia CEO highlights chips for the historic wave of generative AI at Computex",
    "Nvidia launches GH200 Superchip to accelerate generative AI workloads",
    "Nvidia CEO reveals groundbreaking generative AI innovations for industries at COMPUTEX Taipei",
    "World's most valuable chipmaker Nvidia unveils more AI products after $184-billion rally",
    "Nvidia unveils new products and services as it heads for $1 trillion valuation",
    "The H100 is in full production. Cost: $200k Weight: 65lbs Needs robots to install [image]",
    "Grace Hopper is in production. 200 billion transistors. [image]",
    "At Computex @nvidia's Huang highlights the role of AI in graphics development, esp games. [image]",
    "Makes one giant DGX GH200 which is essentially “one GPU.” [image]",
    "Jensen Huang (co-founder and CEO of NVIDIA) [image]",
    "MediaTek Partners With NVIDIA to Transform Automobiles With AI and Accelerated Computing",
    "MediaTek Partners With NVIDIA to Provide Full-Scale Product Roadmap to the Automotive Industry",
    "Taiwan Chipmaker MediaTek Adopts Nvidia's AI Tech for Future Semiconductors and Cars",
    "MediaTek and Nvidia team up to make car cockpits smarter and better connected",
    "NVIDIA is upgrading the in-car experience with AI, streaming, and advanced safety features",
    "MediaTek and NVIDIA are working toward automotive applications",
    "MediaTek taps Nvidia GPU and AI for connected car chipsets",
    "MediaTek and Nvidia to partner on new Windows on Arm chips",
    "Nvidia and MediaTek partner to advance in-car technology",
    "MediaTek and NVIDIA team up to bring AI to cars",
    "Nvidia, MediaTek partner on advanced vehicle infotainment systems",
    "NVIDIA and MediaTek team up to bring AI to all types of cars",
    "MediaTek wants to bring its phone tech to cars, and Nvidia's going to help",
    "MediaTek, NVIDIA Partner to Bring Advanced AI to Cars",
    "Nvidia teams up with MediaTek to develop a new generation of automotive chips",
    "MediaTek, Nvidia team up for connected cars",
    "Quest 3 Passthrough Reportedly ‘Almost Lifelike’, Good Enough To Use Your Phone",
    "Gurman Corroborates iPhone 16 Pro Display Size Increase Rumor",
    "Apple Pay director in charge of Tap to Pay partnerships departs company",
    "Further Reports Suggest iPhone 16 Pro and Pro Max May Feature Larger Displays",
    "Meta Quest 3 could signal a slim Reality Pro headset; but also tough competition",
    "Best Memorial Day 2023 deals: Save on the latest from Apple, Google, OnePlus, more",
    "Rumor: 3 recent Macs to become eligible for Apple trade-ins as new models get unveiled at WWDC",
    "Meta Quest 3 Prototype Previewed In The Wild, Is It An Apple VR Headset Killer?",
    "Revealed: Meta's Quest 3 will battle Apple's Reality Pro AR/VR headset",
    "Bigger iPhone 16 Pro sizes are rumored to be making room for camera upgrades",
    "Quest 3 Features Confirmed in First Hands-on",
    "Apple services' Eric Hoffman exits Apple",
    "Meta (Oculus) Quest 3: News and Expected Price, Release Date, Specs; and More Rumors",
    "iPhone 16 Pro models rumored to get a screen size boost",
    "Mark Gurman Tried a Prototype of Meta's Quest 3",
    "iPhone 16 Pro models again rumoured to sport larger displays",
    "Gurman approves iPhone 16's larger screen rumors",
    "Reliable source claims iPhone 16 Pro series could be Apple's largest",
    "The Meta Quest 3 VR headset is reportedly “far lighter and thinner” than the Quest 2",
    "Meta Quest 3 Reportedly Boosts Mixed-Reality Tech To Take On Apple",
    "Meta's Quest 3 VR Headset: A Potential Challenger to Apple's Mixed Reality Throne",
    "Quest 3 hands-on confirms Meta's building a ‘far thinner and lighter’ headset",
    "iPhone 16 Pro Models Again Reported to Feature Bigger 6.3-inch and 6.7-Inch Display Sizes",
    "Meta's Quest 3 headset could feature color cameras for more lifelike pass-through video",
    "Apple to make changes to iPhone 16 Pro to compete better with Samsung, report says",
    "Gurman: WWDC 2023 to be hardware-focused with less emphasis on new software features",
    "iPhone 16 Pro screen once again rumored be larger than iPhone 15 Pro",
    "Meta Quest 3 compared to Apple “Reality” and Quest 2 headsets in new hands-on leak",
    "WWDC 2017 vibes. https://twitter.com/...",
    "Total Compute Solutions (TCS23) provide the complete platform for mobile computing",
    "Arm Cortex-X4 advances frontiers of CPU performance",
    "Arm Unveils Cortex-X4 And Immortalis GPU For Big Mobile Performance And Efficiency Gains",
    "Arm GPUs built on new 5th Generation GPU architecture to redefine visual computing",
    "Arm Cortex-A720 and Cortex-A520 CPUs extend Armv9 benefits to all consumer device markets",
    "Arm's new Immortalis G720 should yield big gains in performance and efficiency",
    "Arm's new Total Complete Solution means your next phone will be stronger while using less battery",
    "Arm Launches the Cortex-X4, A720 and A520, Immortalis-G715 GPU",
    "Arm announces Cortex-X4 among latest CPU and GPU designs",
    "ARM shows Cortex-X4 core, DSU for laptop chips",
    "Arm debuts Cortex-X4 with better performance, coming to MediaTek's next flagship",
    "Arm's new CPU and GPU cores promise increased performance with improved power-efficiency",
    "Arm's new GPU promises big gains for mobile gaming",
    "ARM's latest CPUs push Android phone makers toward 64-bit only devices",
    "Arm unveils Cortex-X4: Fastest so far",
    "Arm Details The Cortex-X4 With +15% Performance, Armv9.2 ISA",
    "ARM Cortex-X4, A720 and A520 CPUs, Immortalis-G720 GPU with Ray-tracing announced",
    "COMPUTEX 2023: Arm Unveils Total Compute Solutions 2023",
    "Arm Rolls Out Next-Gen Smartphone Chip Tech",
    "ARM unveils new CPU cores for Exynos chips",
    "Arm launches Cortex-X4, billing it as the first CPU built on TSMC's N3E process",
    "ARM unveils the Cortex-X4, its fastest CPU yet, Cortex-A720 and A520 and 5th gen GPUs join it",
    "Arm announce new mobile CPUs and GPUs for Qualcomm Snapdragon 8 Gen 3, other next-gen chips",
    "Arm Cortex-X4, A720, and A520: 2024 smartphone CPUs deep dive",
    "Arm's new design could result in chipsets that take up way less energy",
    "Arm Unveils New CPU Cores for Next-Gen Smartphone Processors",
    "Arm's New CPU, GPU Cores to Deliver Next-Gen AI Experiences on Phones",
    "Everything Arm just announced in 4 minutes - Cortex-X4, A720, A520, and Immortalis-G720",
    "Arm's next-gen mobile computing platform to deliver improved AI, 3D and gaming to 2024 phones",
    "5 things you must know about next-gen smartphone processors",
    "Arm's new Cortex X4, A720, and A520 are 64-bit only cores with a big focus on efficiency",
    "Arm unveils 5th generation GPUs with Immortalis-G720",
    "ARM unveils new CPU cores to be used in future Exynos chips",
    "Arm unveils TCS23, driving immersive experiences and new-generation AI applications",
    "Arm rolls out new smartphone tech and MediaTek signs up to use",
    "Arm launches new chips for faster smartphone performance during Computex",
    "Arm unveils Cortex-X4, Cortex-A720, Cortex-A520 CPUs, Immortalis-720 GPU",
    "Arm Launches Next-Gen Efficiency Core; Cortex-A520",
    "Office of the Maine Attorney General",
    "Lockbit ransomware attack on MCNA Dental impacts 8.9M individuals",
    "Data Breach at MCNA Dental Insurer Impacts 9 Million Users",
    "MCNA Admits LockBit Ransomware Stole Data of 8.9M People",
    "Dental Health Insurer Hack Affects Nearly 9 Million",
    "Bcrypt at 25: A Retrospective on Password Security",
    "A Popular Password Hashing Algorithm Starts Its Long Goodbye",
    "Columbia Journalism Review",
    "Personalized wealth management, built for tech people",
    "Robotics & Automation News",
    "Your First Robot Butler Will Need Human Eyes",
    "Space Robotics Startup GITAI Raises US$30 Million in Funding",
    "Japan Startup Raises $30 Million to Build Space Robot Workforce",
    "Japan's GITAI raises $29 million for space robotics business",
    "Gitai Raises $30 Million to Expand Manufacturing Footprint in Los Angeles",
    "Gitai raises $30 million to lead space robotics industry",
    "Gitai Raises US$30M in Funding",
    "Figure raises $70 million Series A to support commercialization of Figure 01 humanoid robot",
    "The SCP entries are bleeding into the real world https://www.vice.com/...",
    "Do you know what a ‘Yoko’ is? Of course you don't because it's not real. https://www.vice.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "How can recruiters bring balance to the talent landscape in the IT industry?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "(IHP) Gary Flake On The Search Wars",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Burning Metrics: Ethereum Burns 3.33 Million Ether Valued at $6.1 Billion in 21 Months",
    "Ethereum burned $6.1 billion ETH in 21 months",
    "South Korea's Naver to Offer AI to Foreign Governments: FT",
    "AI in the Workplace: A Deep Dive into the Hopes and Fears of American Workers",
    "Here's which generation you're part of based on your birth year — and why those distinctions exist",
    "@continuousorbit@mstdn.social",
    "@chockenberry@mastodon.social",
    "xrOS: What to Expect From the Software Designed for Apple's AR/VR Headset",
    "WWDC 2023: How Apple has been preparing for launching its MR headset for years",
    "Three Massive Decisions That Could Unlock Apple's Reality Pro AR Headset",
    "Will Apple's Reality Pro signal the beginning of the immersive internet?",
    "I don't think Apple's Reality Pro ambitions are rooted in reality",
    "Apple's MR headset receives attention; rapid growth of AR/VR expected to come two years later",
    "Display Supply Chain Consultants",
    "Biannual Augmented and Virtual Reality Display Technologies and Market Report",
    "At WWDC, Apple will lay out the blueprint for mixed-reality ‘killer apps’",
    "@chockenberry - right eye is free, left eye is $5/month",
    "Third-party Twitter apps historically accounted for 17% of all engagement, former exec says",
    "Texas Monthly Profiles Tapbots Founders Paul Haddad and Mark Jardine",
    "Samsung's $230bn chip hub draws top equipment makers to Seoul area",
    "China claims semiconductor consensus with South Korea, while Seoul stays quiet",
    "News Publishers Looking for Traffic Can Probably Ignore Twitter",
    "I love any “search remains” tweets 💪🏽💪🏽 https://twitter.com/...",
    "@delroth@mastodon.delroth.net",
    "Nintendo Has Issued A Cease And Desist Over The Steam Release Of The Dolphin Emulator [UPDATED]",
    "Dolphin says Nintendo blocked a Steam release of its Wii and GameCube emulator",
    "An interpretation of the Dolphin on Steam situation.  As a reminder, Dolphin …",
    "Nintendo says emulators ‘stifle innovation’ after taking legal action against Dolphin",
    "Nintendo Defends Legal Action Against Dolphin, Says Emulators “Stifle Innovation”",
    "Nintendo issues Valve DMCA takedown to remove Dolphin emulator",
    "Nintendo Takes Legal Action Against the Popular Dolphin Wii Emulator",
    "Dolphin Steam Release Postponed, But What Exactly Happened? No DMCA",
    "Nintendo stops Steam launch of popular Dolphin emulator",
    "Nintendo Dolphin emulator blocked on Steam before it's even launched",
    "Dolphin speaks out: Nintendo blocks Steam release of Wii Emulator",
    "Nintendo explains its decision to block Dolphin's Steam release, saying it ‘stifles innovation’",
    "Nintendo Reveals Why it Blocked Dolphin Emulator Steam Release",
    "Nintendo scuttles Dolphin emulator's Steam release",
    "“Stifling Innovation” - Nintendo Issues Statement on Dolphin Emulator",
    "Why Nintendo are now targeting the Dolphin emulator",
    "Nintendo explains the decision behind blocking release of Dolphin emulator",
    "Nintendo explains their Dolphin emulator DMCA, says the project ‘stifles innovation’",
    "Nintendo Says Dolphin Emulator on Steam ‘Harms Development and Ultimately Stifles Innovation’",
    "Nintendo targets Steam with fresh DMCA strike to remove Dolphin Emulator",
    "Dolphin on Steam Indefinitely Postponed",
    "Nintendo Blocks Release of Dolphin Emulator on Steam",
    "Dolphin Emulator release on Steam is “indefinitely postponed”",
    "Dolphin Emulator Steam listing removed following Nintendo DMCA",
    "Nintendo filed a DMCA notice against Dolphin emulator's release on Steam",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Buzzkill Nintendo Slams Valve With DMCA Takedown Over Dolphin Wii Emulator",
    "Nintendo Hits Valve With Steam DMCA Takedown Notice",
    "Dolphin emulator's Steam launch blocked by Nintendo DMCA notice to Valve",
    "Australian Financial Review",
    "Big trouble for US lawyer caught using ChatGPT",
    "ChatGPT: US lawyer admits using AI for case research",
    "Lawyer cites fake cases invented by ChatGPT, judge is not amused",
    "A lawyer used ChatGPT for legal filing. The chatbot cited nonexistent cases it just made up",
    "A lawyer used ChatGPT and now has to answer for its ‘bogus’ citations",
    "Lawyer Uses ChatGPT in Court, Cases Turn Artificial Instead of Intelligent",
    "NYC lawyer in big trouble after using ChatGPT to write legal brief",
    "ChatGPT v. The Legal System: Why Trusting ChatGPT Gets You Sanctioned",
    "A US attorney faces punishment for citing fake cases ChatGPT fed him",
    "ChatGPT's made-up cases puts a lawyer's career in danger",
    "Lawyer uses ChatGPT in court and now ‘greatly regrets’ it",
    "A lawyer faces sanctions after he used ChatGPT to write a brief riddled with fake citations",
    "A Lawyer's Filing “Is Replete with Citations to Non-Existent Cases”—Thanks, ChatGPT?",
    "Lawyer's reliance on ChatGPT leads to false case citations in airline lawsuit",
    "Mata v. Avianca, Inc. (1:22-cv-01461)",
    "US lawyer penalised for using ChatGPT: Here's why",
    "‘I apologize for the confusion earlier’: Here's what happens when your lawyer uses ChatGPT",
    "A lawyer used ChatGPT for legal research, but later found the chatbot created fake cases",
    "What's the Matter With Mata v. Avianca, Inc",
    "Shock as judge catches lawyer using AI to prepare for case - and chat bot makes fatal error",
    "Lawyer faces punishment after ChatGPT gave him fake cases to cite on a court-submitted brief",
    "Lawyer ‘Greatly Regrets’ Relying on ChatGPT After Filing Motion Citing Six Non-Existent Cases",
    "ChatGPT's Erroneous Legal Citations Land Lawyer in Trouble",
    "@kendraserra@dair-community.social",
    "Now imagine it being used to as a “clinical co-pilot” as promoted https://twitter.com/...",
    "AI will make idiots dumber. https://twitter.com/...",
    "grabbed the funniest bit of that legal case where someone used ChatGPT to write a brief [image]"
]