[
    "@profcarroll@federate.social",
    "@jamesthomson@mastodon.social",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "Apple Unveils Vision Pro AR Headset Priced at $3,500",
    "Apple Vision Pro $3,499 mixed-reality headset launches at WWDC after years of rumors",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "Hands on: Apple Vision Pro: I just wore the future",
    "Disney To Create Content For Apple Vision Pro, Disney+ Available From Day One",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple's new VR headset will feature over 100 Apple Arcade games at launch",
    "Apple Vision Pro first take: 3 reasons this changes everything",
    "Apple's $3,499 Vision Pro Headset Will Test Marketing Might",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "I just tried the Apple Vision Pro — and it's truly amazing (and a bit unsettling)",
    "Price tag of Apple's newly unveiled ‘Vision Pro’ headset draws mockery",
    "Apple Vision Pro: When does it come out?",
    "Live: Expectations of Apple's headset set to meet reality",
    "Apple unveils the Vision Pro, it's $3,500 mixed reality headset",
    "Apple: Vision Pro headset looks good but offers no new ideas for VR",
    "Apple sure kicked Meta's butt today, right?",
    "Meta's heated rivalry with Apple enters new phase as the tech giants go after headsets",
    "Apple Vision Pro: Technical Marvel with WTF Pricing",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "should i buy a used car or an apple vision pro",
    "Bloomberg Terminal on Vision Pro when",
    "I am looking at two 32\" monitors and it's a field of vision problem.",
    "Apple just made folding phones seem like a bargain.",
    "Meanwhile at Meta [Mark Zuckerberg's Eiffel Tower photo]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "whatever you do, don't look into their ey.....! [image]",
    "Ok I used it. It's good. Real good. More soon. [image]",
    "I can't wait to see the first one of these in Starbucks.",
    "going to wear a vision pro into molotov's",
    "apple invents an augmented reality headset and they're like “so you can run safari in it”",
    "More or less exactly as rumoured. [image]",
    "Apple is so much better at this than Facebook.",
    "Did any leak get the name Vision Pro right?",
    "💯🥽 #WWDC23 https://twitter.com/... [image]",
    "Man, Meta's Reality Labs team must not be feeling too great today",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "new reaction image just dropped [image]",
    "We're all about to look like we're scuba diving through real life. 🤿 [image]",
    "Lordy, this vision pro presentation is making Meta look like dogshit.",
    "Microsoft Excel, Word, and Teams in Apple Vision Pro [image]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "“We studied thousands of heads”",
    "Their new Jony Ive sounds a lot like their old Jony Ive.",
    "Everyone saying before they weren't going to get Apple's headset just changed their mind.",
    "This is the video camera from Minority Report! #WWDC23",
    "i am absolutely gonna be wearing these to da club [image]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "At this point, I can't imagine my life without Apple Vision Pro. I'm serious. [image]",
    "How many things has Zuck thrown and broken so far https://twitter.com/...",
    "Funny joke @gruber 😜 [image]",
    "Standing in line for Apple Glasses.",
    "Room dims as things are played: Magic Leap 2 has this feature too, I thought it was cool",
    "Ah - here's why the stock dropped. Menswear guy isn't a fan https://twitter.com/...",
    "Dictating Typing Typing on glass Typing on air Dictating",
    "Here's the battery pack [image]",
    "deleting the email like [image]",
    "The killer app for AR. Infinite monitors. [image]",
    "Yep, don't think all the reports were to sandbag on the cost here... This tech is nuts. #wwdc23",
    "Steve wouldn't have named it Vision Pro though...",
    "This will be the new Patagonia Vest for Silicon Valley VCS",
    "Being able to see people's eyes while people are nearby is cool, but a little creepy ngl",
    "No controllers. Everything is controlled with hand movements. [image]",
    "And not inside a case like in 2007! https://twitter.com/...",
    "3D cameras — Well, I guess we know what to expect in the iPhone 15 Pro now...",
    "Mom? Mom? Mom! Mom are you spatially computing again? [image]",
    "the Vision Pro seems like a lonely device",
    "snorkeling never looked so good with Apple Vision Pro [image]",
    "i need to know where this mystery cord is going",
    "The entire TV set market right now. [Image: Michael Scott yelling “Everybody stay calm!\"]",
    "Fitting Apple has one of its design leaders discuss Apple Vision Pro.",
    "brb, going skiing inside my mac [image]",
    "Vision Pro is also a 3D camera. They call it a Spatial photo or video. #WWDC23 [image]",
    "First in person look at Apple Vision Pro #WWDC23 [video]",
    "This is just a great way to parent, that won't affect your children negatively at all [image]",
    "paying $3499 to rewatch my wife and children leave me #WWDC23 [image]",
    "It's far better than I expected, and I had high expectations.",
    "Here it is. Apple Vision Pro. [video]",
    "This line is haunted: “video conferencing apps can leverage your digital persona”",
    "time to get a new mortgage 🥴 [image]",
    "I feel kind of sorry for Meta.",
    "can't wait to confidently blurt our “no updates from me” while looking like this [image]",
    "i just know i'm gonna hate buy this thing so hard [image]",
    "I'm buying this Day 1. https://twitter.com/...",
    "interviewer “are you reading from a script?” me: “no why” [image]",
    "Vision Pro is basically the standard VR experience with Apple polish—not revolutionary",
    "In Canada, the sales tax on the Vision Pro is the price of a Quest 3",
    "Apple using lots of work/productive use cases as the lead is smart.",
    "Not a word on battery life.",
    "Wall St: Vision Pro to disrupt external monitor sales.",
    "@WinObs It connects to this setup: [image]",
    "What do others see when I'm FaceTiming with a headset?",
    "Digital Photography Review",
    "Introducing Apple Vision Pro",
    "Twitter reacts with laughs to Apples Vision Pro headset shown at WWDC23",
    "Apple Vision Pro first look: Can this be worth $3,500?",
    "Apple Vision Pro is Company's First Spatial Computer, Packs 23 Million Pixels Across Two Displays",
    "Apple enters AR/VR headset market with Vision Pro",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "mfw watching #WWDC23 [image]",
    "Me, accepting GDPR popups next year: [image]",
    "Apple worked with Zeiss to create custom inserts for glasses wearers. #WWDC23 [image]",
    "Zuck at the Oculus team rn [Image: “Code. I wanna see some fucking code!\"]",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Apple Vision Pro is a mix of innovation, and year-2016 VR, for a hefty price. But...",
    "Apple Headset Looks Sleek in Person But Battery Pack Stands Out",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "Apple's Vision Pro Hands-On: This Is the VR Headset I'd Use to Watch 3D ‘Avatar’",
    "Dear Tech Industry, Can You Please Stop Trying To Strap Stuff To Our Face?",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "Apple's entry into VR with its new headset is a ‘watershed moment,’ say top industry execs",
    "Apple's Vision Pro AR/VR Headset: Features, Price, Release Date, and More",
    "Apple Vision Pro first look: A glimpse at the spatial computing future",
    "got my new apple headset [image]",
    "This is crazy! #WWDC23 [image]",
    "First look at Joaquin Phoenix in Ridley Scott's ‘NAPOLEON’. (Shown at #WWDC23) [image]",
    "It does look better in photos than it did in the keynote or on the site. https://twitter.com/...",
    "Apple Unveils Vision Pro AR Spatial Computer: For Immersive Digital Experiences @ 3500 USD",
    "Disney+ will be available on the Apple Vision Pro at launch",
    "WWDC 2023: Apple announces partnership with Disney, Apple Vision Pro to run Disney Plus",
    "Apple Vision Pro + cooperation with Disney is 🔥🔥🔥 #WWDC23",
    "Yeah, Apple just killed Meta and Oculus with this Disney partnership.",
    "Unity + Apple Disney + Apple Meta is done.",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Apple Vision Pro headset runs visionOS with a 3D-spatial user interface",
    "Apple reveals new AR headset, and we're jealous",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "VisionOS — Everything we know about the Apple Vision Pro's platform",
    "Someone needs to build a spatial code editor for visionOS",
    "The new OS is called visionOS. Not xrOS, lol. [image]",
    "“Exploring visionOS”. Going to take on my most challenging writing project yet. 🤗 [image]",
    "imagine seeing this in VR [image]",
    "Phew. “visionOS” MUCH better than “xrOS”. #wwdc23",
    "Optic ID Is The Vision Pro's Twist On Face ID Security",
    "Apple's OpticID authentication in the Vision Pro is Worldcoin orb built into a mainstream device",
    "This seems timely. A technical deep dive on our iris biometric pipeline. https://worldcoin.org/...",
    "Apple about to murder WorldCoin too? Didn't think about that one.",
    "@FEhrsam so RIP to worldcoin?",
    "WWDC 2023: Apple allows you to monitor mental health via new features",
    "Apple WWDC 10 biggest announcements: Vision Pro, MacBook Air, iOS 17, and more",
    "Apple WWDC '23 Live Blog: recap of all the unveilings during Apple's keynote",
    "Here are the most important new changes coming to your iPhone this fall",
    "Watch Apple's WWDC 2023 keynote in 23 minutes",
    "visionOS: everything you need to know about the Vision Pro's operating system",
    "An example of great interaction between brands 😂 @McDonalds @AXE [image]",
    "AirDrop now works by bringing two devices together #WWDC23 [image]",
    "Huge software improvements to AirPods was not on my bingo card. But great!",
    "apple using better AI to make autocorrect not terrible would actually be a good thing if it works",
    "⌨️ It's about ducking time. Big autocorrect and typing predictions coming.",
    "- Here's a cool new Standby feature, with an accessory we'd love to sell you! [image]",
    "watchOS “Time in Daylight” also perfect to protect Dracula. #wwdc23",
    "Sorry but I've heard Jonny Ive say “aluminum” and you are no Jonny Ive.",
    "Mac pro with m2 ultra. Been waiting for this for keeping 10 tabs open in chrome.",
    "damn this new mac pro is a whole pixar studio in one cheesegrater box",
    "apple headset will make you jump off a building trying to catch bubbles.... just like reefer",
    "A new AR platform with a revolutionary product.... $AAPL",
    "The features that didn't get discussed onstage at #WWDC https://sixcolors.com/...",
    "the best part about apple vision pro is that it makes you look like a dick",
    "damn...it's a sega genesis controller for the face [image]",
    "Apple is updating Mac Pro with Apple Silicon #WWDC23 [image]",
    "macOS Jersey Shore https://twitter.com/...",
    "Desktop widgets! Truly what's old is new again.",
    "YOOOOO #WWDC23 macOS Sonoma [image]",
    "One thing is for sure after today, Apple's product marketing team is better than Meta's",
    "Also if this is all happening on-device there's a model loaded in memory here.",
    "iMessage apps didn't really get traction so now they are tucked away.",
    "iPhone can now help you locate the Apple TV remote [image]",
    "Uh oh, now @mmhmmapp getting some pressure from Apple too.",
    "Man there a lot of consumer updates for a developer conference here",
    "Apple updates iPadOS. #WWDC23 [image]",
    "lots more apps sherlocked. Feel bad for journal app developers. also Palm beaming Sherlocked",
    "Apple says it has fixed iPhone autocorrect with iOS 17",
    "iOS 17 will autofill verification codes in Safari from the Mail app",
    "iOS 17 will transcribe your audio messages, customize contact posters",
    "10 big upgrades coming to iPhones with iOS 17, unveiled at WWDC 2023",
    "Ducking hell! Apple to tweak autocorrect that replaces one of the most common expletives",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "NameDrop allows for easy transfer of contact info. Very 1996 PalmPilot. [image]",
    "OK, NameDrop is dope. This is what we had with Bump back in the day. https://twitter.com/...",
    "This NameDrop thing is so 🔥 !!! #WWDC23",
    "PalmPilot users: “Does NameDrop use Infrared????”",
    "iOS 17 is one of the smallest updates ever it seems. #WWDC23 [image]",
    "How do you NameDrop a fake number? Asking for all women",
    "Namedrop - Apple reinvents the Palm IR contact blaster with NFC.... [image]",
    "Apple announces powerful new privacy and security features",
    "iOS 17 feature roundup: StandBy, NameDrop, Contact Posters, more",
    "Apple announces iOS 17 with NameDrop, StandBy, Live Voicemail, and more",
    "iOS 17 StandBy mode can transform your iPhone into a versatile home hub",
    "Apple shows off new NameDrop feature coming with iOS 17",
    "feel like this new Apple Journal app is basically Facebook-ish for an audience of one [image]",
    "New iPhone standby mode is an excuse to sell a $100 horizontal stand charger thingy isn't it?",
    "iOS 17 Standby mode #WWDC23 What is this dock!?! I need it [image]",
    "iOS 17 makes iPhone more personal and intuitive",
    "Will my iPhone get iOS 17? Here's every supported model",
    "WWDC 2023: Apple allows you to monitor mental health via new features. Details here",
    "Craig Federighi outlines iOS 17 privacy & Apple's stance on AI",
    "Love the App icon of Journal 😻 [image]",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "SEC's Lawsuit Against Binance Strikes at Heart of Ailing Crypto Sector",
    "SEC sues Binance and CEO Zhao over alleged mishandling funds, lying to regulators",
    "Bitcoin steadies above $25,000 as Binance SEC lawsuit rattles investors",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "Binance Entities And CEO Face Legal Turmoil As SEC Files 13 Charges",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "Pepecoin Frenzy Fades: How Meme Token's Price, Market Cap Were Cut In Half",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "Binance Is in Deep Trouble",
    "Blow For Metaverse, SEC Classifies SAND And MANA As Securities",
    "SEC charges Binance, CEO Zhao with 13 violations",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "SEC filing calls BNB a security [image]",
    "both coley and brooks testified to SEC [image]",
    "Strong together. https://twitter.com/...",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "The gears of justice grind slowly but they grind exceedingly fine. https://twitter.com/...",
    "Potential bankrun type situation 👀 https://twitter.com/...",
    "Those Binance charges in full https://www.ft.com/...",
    "And another one bites the dust (maybe?) https://markets.businessinsider.com/ ...",
    "[DB] SEC Alleges BNB, BUSD Are Securities in Lawsuit",
    "SEC charges Binance with the exact same accusations as FTX: https://www.nytimes.com/... [image]",
    "Binance Lawsuit Triggers $700M in Withdrawals; Metaverse Tokens Named by SEC Lead Decline",
    "SEC Calls Solana, Cardano, Polygon Securities In Binance Lawsuit",
    "SEC Lawsuit Against Binance Adds $115 Billion Worth of Tokens to Unregistered Securities List",
    "Seven key points from the SEC's charges against Binance and Binance.US",
    "SEC vs. Binance: $115 billion battle over crypto regulation",
    "61 Crypto Including ADA, SOL, BNB Deemed as ‘Securities’ by the SEC",
    "Reuters Accuses Binance For Controlling Bank Accounts Of Binance.US",
    "Report: Binance Controlled Bank Accounts Belonging to Its US Affiliate Between 2019 and 2020",
    "Binance Exposed For Allegedly Controlling U.S. Affiliate's Bank Accounts",
    "Apple Silicon Mac Pro does not support PCI-E Radeon video cards",
    "Apple Introduces New Mac Pro With M2 Ultra Chip, Available to Order Starting Today",
    "My ten takeaways from WWDC 2023",
    "Apple Unveils M2 Ultra Chip as Most Powerful Apple Silicon Chip Yet",
    "Mac Pro 2023  —  Mac Pro, now featuring M2 Ultra, combines the unprecedented performance …",
    "Vision Pro and everything else Apple announced during the WWDC keynote",
    "Apple Debuts New Mac Studio and Mac Pro",
    "why is the mac pro 3k more than the mac studio with the same chip lol",
    "@MKBHD This is an insane update for MacStudio",
    "This is not powerful enough for pros",
    "@ianzelbo No MPX slots. Means no GPUs...",
    "Sorry, but the new Mac Pro is a meme [image]",
    "MAC PRO GETS APPLE SILICON",
    "Apple introduces the 15‑inch MacBook Air",
    "Apple Announces New MacBook Air With 15.3-inch Display and M2 Chip Starting at $1,299",
    "Apple WWDC 2023: This MacBook Air model has become cheaper by ₹5,000. Here's the new price",
    "Apple Unveils 15-Inch MacBook Air: Powerful Performance and Striking Design",
    "Apple Cuts 13-Inch MacBook Air Price by $100 - but You Can Already Save More",
    "nm i hate my macbook pro, macbook air 15\" new best friend",
    "The 15-inch MacBook Air is all about competing with Windows, Apple wasn't being subtle at all",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "WWDC 2023: Apple launches M2 Ultra chip",
    "Apple Announces New Mac Studio With M2 Max and M2 Ultra Chips",
    "M2 Mac Studio 2023: Specs, price, release date, and everything you need to know",
    "Apple announces the M2 Ultra chip and new Mac Studio.",
    "Very excited for a Mac Studio update https://twitter.com/...",
    "HealthcareInfoSecurity.com",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft will pay the FTC $20 million to settle charges over collecting children's data",
    "Microsoft Fined $20 Million For ‘Illegally’ Collecting Children's Information On Xbox",
    "Microsoft Pays $20M to Settle FTC COPPA Complaint",
    "EU Urges Tech Giants to Label AI-Generated Content to Fight Disinformation",
    "Personalized wealth management, built for tech people",
    "Clop ransomware claims responsibility for MOVEit extortion attacks",
    "Many across Ireland and the UK affected by global data breach",
    "BA, Boots and BBC staff details targeted in Russia-linked cyber-attack",
    "CISA orders govt agencies to patch MOVEit bug used for data theft",
    "Ransomware Group Used MOVEit Exploit to Steal Data From Dozens of Organizations",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "British Airways, BBC and Boots were impacted the by Zellis data breach",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "BBC and British Airways affected by data breach at payroll company Zellis",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "Russian hackers raid British Airways and BBC in cyber attack",
    "British Airways, Boots and BBC among companies hit by cyber security attack",
    "Introducing watchOS 10, a milestone update for Apple Watch",
    "Apple Announces watchOS 10 With Widgets, Redesigned Apps, and More",
    "There's a lot to love about watchOS 10",
    "Widgets on Apple Watch, A new road to delight watch owners with watchOS 10",
    "Love the new cycling features for the apple watch. Time to get one",
    "All right, the @apple Watch upgrades are quite solid. Well done team. #WWDC23",
    "Apple Watch now has a touch grass measurement, nice.",
    "Apple Watch will now track your mental health. #WWDC23 #watchOS10 [image]",
    "Probably the biggest disappointment today. https://twitter.com/...",
    "Twitter US ad sales plunged 59%, and internal forecasts are grim, NYT reports",
    "Apple's New Headset Makes Meta Look Like AR's BlackBerry",
    "Hate speech is driving advertisers away from Twitter",
    "Linda Yaccarino finishes first day as Twitter CEO",
    "real “everything must go” vibes around here these days https://twitter.com/...",
    "All the advertisers have tragically contracted the Woke Mind Virus https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/05 - WWDC And The Apple Headset",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Byju's files suit in US to disqualify lender Redwood over alleged ‘predatory tactics’",
    "High-Flying Indian Startup Byju's Skips Payment on Dollar Loan",
    "BYJU'S Files Suit Against TLB Lenders, Halts Payments Of $1.2 Bn Loan",
    "GIGABYTE releases new firmware to fix recently disclosed security flaws",
    "AirPods redefine the personal audio experience",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "What is Adaptive Audio on AirPods and how does it work?",
    "WWDC 2023: Apple introduces Adaptive Audio, Personalized Volume, more for AirPods",
    "@MKBHD “Adaptive Audio” rebrand: “Selective Listening”",
    "tvOS 17 brings FaceTime and video conferencing to the biggest screen in the home",
    "I may never make a regular phone call again once iOS 17 adds this FaceTime feature",
    "Apple TV hardware will get VPN access with tvOS 17",
    "tvOS gets stage time?! Pigs are flying.",
    "Google TV needs to copy that smart home integration in tvOS yesterday",
    "So, there's an updated Control Center. There's just one problem. It's on tvOS, not iOS... [image]",
    "Finally some love for tvOS. Video conferencing with an iPhone as camera seems clunky though.",
    "woo the tvOS style screen savers on the Mac",
    "tvOS now supports Find My on Apple TV remote!",
    "ok is this tvOS update the secret star of the show lmao",
    "FaceTime on Apple TV... using your iPhone cameras [image]",
    "@parismarx@mastodon.online",
    "@chrismessina@mastodon.xyz",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "Apple debuts macOS 14 Sonoma",
    "macOS Sonoma drops support for another wide swath of Intel Macs",
    "macOS Sonoma brings new Lock Screen with aerial wallpapers, here's how it works",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Every website can now be an app thanks to Safari — it's macOS Sonoma's secret weapon",
    "Twitter and Bluesky as web apps on Sonoma, with widgets in background.  Coolio.",
    "MacOS Sonoma wallpaper Has some windows XP vibes [image]",
    "Windows Vista lives on with MacOS Sonoma widgets. Yey! #WWDC2023 #WWDC23 [image]",
    "Next year's improvement to macOS Sonoma will be called macOS Napa. [image]",
    "Safari getting a web app feature (I billed it's better than the iPadOS version). [image]",
    "Apple Webapps: “Please please please don't make us add third-party app stores” [image]",
    "Presenter Overlay is going to kill many indie apps #WWDC23 [image]",
    "macOS S̶o̶n̶o̶m̶a̶ Windows XP looks alright [image]",
    "Safari web apps on dock. Back to the future again. My head is spinning.",
    "iPadOS 17 brings new levels of personalization and versatility to iPad",
    "Apple Announces iOS 17, iPadOS 17, watchOS 10, and macOS Sonoma",
    "Apple is bringing its Health app to the iPad",
    "Apple announces iPadOS 17 with New Lock Screen, Interactive Widgets, and more",
    "iPadOS 17: Here's a first look at the customizable Lock Screen",
    "Apple Announces iPadOS 17 With Custom Lock Screens and Interactive Widgets",
    "iPadOS 17 brings a raft of new features in better-than-expected update",
    "The new iPad Lock Screen and widgets look terrific https://www.bloomberg.com/...",
    "iPad Lock Screen just looks so much nicer now. #WWDC23 [image]",
    "Apple adds AI to PDF She said “machine learning models” = AI #WWDC23 [video]",
    "I have to leave for a doctors appointment and you're talking about iPadOS 17? COME ON. #WWDC23",
    "Apple just killed PDFElement and other PDF editing apps",
    "How far off are we from Apple making PDF the dominant replacement format for .DOC files?",
    "Lol iPadOS is downstairs, in the cellar.",
    "both iOS and iPadOS seem like nice updates, but as rumored they are fairly light in a lot of ways",
    "Finally the Health App comes to the iPad.. Yayy!!! #WWDC23 [image]",
    "Add your voice … - Letter  — Signatures  — FAQ  —  This page was originally designed by ArtOfCode.",
    "‘Fake Putin’ announces Russia under attack as Ukraine goes on offensive",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’"
]