[
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Activision's Bobby Kotick says he made ‘a bad decision’ not bringing Call of Duty to Switch",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Microsoft CEO Would “Love” to See Console Exclusive Games Go Away",
    "Activision CEO Bobby Kotick suggests company “will be jilted” if ABK deal blocked",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "It's Sony's Fault We Have Console Exclusives, Says Microsoft CEO",
    "Microsoft CEO Satya Nadella says exclusive Activision games make no sense",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Microsoft, Sony CEOs Clash in FTC Trial Over Console Exclusives and Game Pass",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Microsoft CEO Would “Love to Get Rid of” Console Exclusives Entirely",
    "Microsoft CEO Satya Nadella admits he doesn't love console game exclusives",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Sony's Call of Duty Deal With Activision Only Includes One More Game",
    "Microsoft CEO would “love” to drop Xbox exclusives but can't because of Sony",
    "Microsoft CEO Satya Nadella blames Sony for console game exclusives",
    "Microsoft CEO Would ‘Get Rid’ of Console Exclusives if He Could",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Microsoft CEO Says He Would “Love” To Get Rid Of Xbox Exclusives But Can't Because Of Sony",
    "Microsoft's CEO Wants To Get Rid Of Console Exclusives Entirely",
    "Satya Nadella wants to remove all game exclusivity: ‘I have no love for that world’",
    "Activision would likely ditch Microsoft takeover if FTC pauses deal",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Activision Will Be Jilted if Microsoft Deal Blocked, CEO Kotick Says",
    "Massive PlayStation leak reveals Call of Duty revenues and first-party game budgets",
    "Sony Accidentally Revealed How Deeply Loyal Call Of Duty Players Are",
    "Both TLOU Part II and Horizon Forbidden West cost over $200 million to develop",
    "Sony court documents removed after redacted details spotted",
    "Sony Made A Truckload Of Cash From Call Of Duty Players In 2021",
    "Sony accidentally reveals trade secrets by using sharpie marker",
    "Leaked PlayStation intel reveals shocking number of Call of Duty players only play CoD",
    "The Risks of Cutting Off China",
    "Sony Accidentally Reveals Major PlayStation Game Budgets",
    "Call Of Duty's Worth to PlayStation May Have Been Revealed by Sony",
    "Sony's secrets: Poor redactions show first-party development costs",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "A staggering number of PlayStation users only play Call of Duty and literally nothing else",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "I never liked COD but Sony's loss is huge if Microsoft acquisition acquisition is done",
    "Sony's Confidential PlayStation Secrets Just Spilled Because of a Sharpie",
    "Twitter's New Chief Eases Into the Hot Seat",
    "Inside Linda Yaccarino's ambitious plan for Twitter 2.0",
    "Twitter's new chief working on plans to bring advertisers back to platform - FT",
    "wait what why would you hire someone with an active non-compete clause https://twitter.com/...",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Linda Yaccarino's vision for Twitter 2.0 emerges",
    "Inflection lands $1.3B investment to build more ‘personal’ AI",
    "Inflection AI raises $1.3 bln in funding from Microsoft, others",
    "Microsoft and Nvidia join $1.3bn fundraising for Inflection AI",
    "Inflection AI: Maker of Personal AI Chatbot Raises $1.3 Billion from Microsoft and Others",
    "Inflection AI Announces $1.3 Billion of Funding Led by Current Investors, Microsoft, and NVIDIA",
    "Reid Hoffman personally invested in ...the AI company he co-founded? https://www.forbes.com/...",
    "Not concerning at all https://twitter.com/...",
    "Transparency and brand safety on Google Video Partners",
    "The Problem With ‘Independent’ Third-Party Verification On YouTube (Is That It Ain't)",
    "Ad-Fraud Claims Could Force Google to Pay Billions. But Don't Hold Your Breath.",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "YouTube is about to get VERY aggressive with ad blockers",
    "Google says report claiming violations of its own video ad standards is inaccurate",
    "New Research Suggests that Google Misled Advertisers Over Video Ad Placement",
    "Do Google's video ads violate its standards? A new report claims the tech giant “misled” buyers.",
    "Google accused of mis-selling ads on third-party websites for years",
    "Google reportedly violates its own standards in third-party ad deals 80% of the time",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "Google's Ad Scam Eerily Similar To Facebook's Metric Inflation Scam",
    "Google accused of misleading its advertisers on over 80% of ad placements",
    "YouTube ads accused of primarily serving on low-quality websites, Google denies",
    "Study Says Google Violated Own Ad Standards, Could Face Refunds",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "FTC Preps for Battle With Amazon. It's the Big One.",
    "FTC Set to File Major Amazon Antitrust Suit Over Marketplace Practices",
    "Amazon Faces Broadscale FTC Antitrust Suit",
    "FTC reportedly plans major antitrust lawsuit against Amazon",
    "Amazon to soon face big FTC antitrust suit over online marketplace power, report says",
    "GOP chairs accuse FTC's Khan of ‘misleading Congress’ over ‘ethical failure’ in Meta probe",
    "@danilo.redeem-tomorrow.com",
    "Reddit protest updates: news on the apps shutting down and Reddit's fights with mods",
    "As Reddit protests turn to porn-bombing, advertisers face increasing brand safety concerns",
    "Minecraft developers quit Reddit after company's controversial changes",
    "Mojang ends official support for Minecraft subreddit",
    "Is Minecraft subreddit shutting down?",
    "Mojang leaving official Minecraft subreddit amid current protests",
    "Minecraft Will No Longer Use Reddit In Light Of The API Changes",
    "Minecraft Developer Mojang Quits Reddit Citing API Change, Protests",
    "The huge Minecraft subreddit will no longer get any official messages from Mojang",
    "Fresh Blow To Reddit As Minecraft Makers Walk Out",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Reddit Is Already on the Rebound",
    "Reddit Threatens Subs to Go Public Again, or Else...",
    "Reddit tells protestors to reopen subreddits",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "New AI-powered Microsoft Shopping tools arrive on the new Bing and Edge",
    "Bing adds new AI-powered shopping tools",
    "Microsoft will use AI to help you save money online when shopping with Edge and Bing",
    "Microsoft Taps Bing AI to Generate Shopping Guides",
    "Microsoft announces new AI-powered shopping tools in Bing and Edge",
    "Bing will now surface AI-generated buying guides",
    "Bing with ChatGPT now produces AI-generated shopping guides for you",
    "New Bing and Edge features give online shopping an AI makeover",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Binance's European banking partner Paysafe to withdraw support",
    "Binance Loses European Banking Partner Paysafe",
    "Binance's European Banking Partner, Paysafe, To Withdraw Support On September 25",
    "Binance hit by two further banking setbacks in Europe",
    "Binance's euro banking partner pulls support - Why?",
    "Binance's European Banking Service Provider Paysafe to Halt Support",
    "Binance Faces Another Blow as EUR Banking Partner Halts Support in September",
    "Binance's EUR banking partner announces plan to halts support",
    "Binance loses euro banking Paysafe amid global regulatory scrutiny",
    "Binance loses Euro payment partner; denied licensing in Germany",
    "Binance to change euro banking partner from September",
    "Binance's European Banking Partner Paysafe Withdraws Support",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "@mattburgess@infosec.exchange",
    "Pornhub accused of abusing user data",
    "Pornhub Is Being Accused of Illegal Data Collection",
    "Online Hate and Harassment: The American Experience 2023",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech via Tweet Has Increased Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "Bitpanda Pro spins out under Josh Barraclough, raises €30 million",
    "Bitpanda Pro spins out as One Trading and raises €30M",
    "One Trading springs from Bitpanda Pro rebrand and secures $33m investment",
    "Bitpanda crypto exchange spins out with €30m funding",
    "Bitpanda Pro Morphs to One Trading after Closing Series A Funding Round with €30 Million",
    "Bitpanda Pro becomes One Trading, raises €30m",
    "Bitpanda Pro rebrands to One Trading, raises €30m Series A",
    "Bitpanda's crypto exchange separates from Bitpanda and secures $33 million",
    "Peter Thiel backs Italian crypto assets exchange One Trading in €30 million round",
    "Italy-based One Trading raises €30M to bridge the gap between crypto, traditional asset trading",
    "Bitpanda Pro Spinout Raises €30 Million Led by Thiel's Valar",
    "Tiger Global rejects low bids, aims for cash through startup stakes",
    "That's a lot of words to say “no bid” and “inflated marks” https://twitter.com/...",
    "Snapchat+ reaches 4 million paid subscribers since launching a year ago",
    "Snapchat+ hits 4 mln paid subscribers",
    "Snapchat has found more than 4 million people willing to pay it $4/month",
    "Report: Snapchat Now At 4 Million Paid Subscribers",
    "Pretty damn impressive https://twitter.com/...",
    "Runway Raises $141M in Addiditional Series C Funding",
    "Runway raises $141 million to continue building the future of creativity",
    "More gasoline for awesome things! https://twitter.com/...",
    "AI-generated text is hard to spot. It could play a big role in the 2024 campaign",
    "Exploring How Image Upscalers Can Integrate Into Existing Design Workflows & Tools",
    "Meta's Oversight Board urges Facebook to suspend Cambodia's Prime Minister",
    "Oversight Board overturns Meta's decision in “Cambodian prime minister” case",
    "Oversight Board Tells Facebook to Remove Video of Cambodian Prime Minister Threatening Opponents",
    "Cambodian PM Hun Sen's Facebook account faces 6-month ban",
    "Cambodian leader Hun Sen, a huge Facebook fan, says he is jumping ship to Telegram",
    "Cambodia PM Hun Sen accused of inciting violence on social media",
    "Meta oversight board orders firm to take down video by Cambodian leader",
    "Meta Oversight Board Urges Cambodia Prime Minister's Suspension from Facebook",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple says it already changed its rules enough to satisfy Spotify EU complaint",
    "Apple to defend itself against Spotify's antitrust accusations in the EU",
    "Apple to argue against EU antitrust charge at hearing triggered by Spotify",
    "Apple argues no more changes necessary to App Store policy in Spotify EU antitrust case",
    "TSMC to Send More Taiwanese Workers to U.S. to Speed Up Arizona Fab",
    "TSMC Arizona chip plant over budget and behind schedule; US workers blamed",
    "Taiwanese chipmaker sending more workers to speed up building of new Arizona plant",
    "TSMC's Arizona headache and a surprise chip deal in Japan",
    "TSMC sends more Taiwanese workers to finish Arizona plant",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "How AI Influences What You See on Facebook and Instagram",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta finally explains how Facebook & Instagram AI algorithms work",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Is this when you desperately want your stock to go up? https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "OpenAI Sued for Using ‘Stolen’ Data, Violating Your Privacy With ChatGPT",
    "Microsoft, OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "Lawsuit says OpenAI violated US authors' copyrights to train AI chatbot",
    "Microsoft and OpenAI face $3B lawsuit alleging privacy violations with ChatGPT",
    "OpenAI and Microsoft Accused of Scraping and Exploiting Private Data for AI Training",
    "OpenAI and Microsoft Hit With $3 Billion Data Theft Lawsuit",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "The AI Arms Race and Why We Need to Come Together Now",
    "Explosive allegations: OpenAI faces lawsuit for data breach",
    "Microsoft and OpenAI sued for $3 Billion for breach of privacy with ChatGPT",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "ChatGPT maker OpenAI hit with class-action lawsuit over alleged data theft",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "OpenAI sued for allegedly ‘stealing’ data from millions",
    "This is where I come to play …",
    "Well, I lasted less than a month of locking my ao3 fics to registered users. …",
    "OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Lightmatter: Next-gen computing built for AI.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/29 - Big Interesting (AI) Raises",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Meituan buys out four-month-old AI start-up Light Year for US$281 million",
    "Meituan to buy all shares of AI startup Light Year from HongShan, co-founder",
    "Meituan Buys Co-Founder's Months-Old AI Startup for $234 Million",
    "I see AI has reached the “acquisitions mad lib” stage.  [embedded post]",
    "Worldcoin launches in Germany and integrates with Okta's Auth0 platform",
    "Massachusetts man is offloading 2,200 vintage Z80 computers on eBay one at a time",
    "Why 2,000 Ancient PCs Mysteriously Appeared on eBay",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Generative AI Platform Typeface Bags $100M in Series B, Hitting Unicorn Status",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "Typeface lands $100M for its generative AI content creation engine",
    "Typeface Raises $100M in Series B Funding",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Apple livestreaming through Chinese e-commerce apps, but no bargains to be had",
    "Building Momentum for the Sustainable Cloud",
    "Oracle Increases Ampere's Momentum with New Database Support",
    "Oracle spending ‘billions’ on Nvidia chips this year",
    "Silicon Valley Business Journal",
    "Oracle is no longer buying Intel processors for its data centers",
    "Chip startup Ampere pitches climate-friendly data centers",
    "US tech ban and strong demand for AI chips in China is fuelling NVIDIA GPU smuggling",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Mastercard Unveils Multi Token Network (MTN) to Scale, Secure Blockchain Tech",
    "Tokenized Deposits: Unlocking New Possibilities in Finance",
    "Mastercard Building Ethereum-Based Blockchain App Store for Regulated Financial Apps",
    "Mastercard Unveils Multi-Token Network (MTN)",
    "Mastercard UK To Test Tokenized Bank Deposits",
    "Local Government Federal Credit Union offerings",
    "Mastercard Ventures into Tokenized Bank Deposits with Multi-Token Network Pilot",
    "Mastercard Launches Digital Assets and Blockchain Initiative",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "@ravirockks@infosec.exchange",
    "@kimzetter@infosec.exchange",
    "@metacurity@infosec.exchange",
    "SEC notices spark alarm for cyber executives",
    "Micron Expects to Debut GDDR7 Memory in 2024",
    "Micron to Introduce GDDR7 Memory in 1H 2024",
    "Memory chipmaker Micron's sales down 57% as market bottoms out",
    "Micron Has China Problems, Too. Why the Stock Got Upgraded.",
    "Micron to introduce next-gen GDDR7 graphics memory in the first half of 2024",
    "Micron still bumping along memory trough",
    "Chip maker Micron beats estimates on demand from booming AI, easing glut",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Micron Technology, Inc. Reports Results for the Third Quarter of Fiscal 2023",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’",
    "Celestial AI Raises $100M in Series B Funding",
    "Photonics To Make Celestial HBM3 Memory Fabric",
    "Celestial AI's $100M raise shines light on AI computing wall",
    "@zackwhittaker@mastodon.social",
    "Spy app LetMeSpy spied on: hackers leak victim and user data going back years",
    "How to Find & Remove Spyware From iPhone or Mac",
    "Android Spy App LetMeSpy Suffers Major Data Breach, Exposing Users' Personal Data",
    "LetMeSpy Phone-Tracking App Hacked, Revealing User Data",
    "Mobile spyware app LetMeSpy breached",
    "This hidden spyware app was hacked revealing thousands of users' data — was it on your phone?",
    "LetMeSpy App Hacked, Sensitive Victim and User Data Leaked",
    "Ironic: LetMeSpy Spyware Hackers Were Hacked (by Hackers)",
    "This top mobile phone spying app says it has been hacked, with thousands of users at risk",
    "LetMeSpy, a stalkerware app spying on thousands, says it was hacked",
    "Proton launches open-source password manager with some limitations",
    "Introducing Proton Pass - Protecting your passwords and online identity",
    "Proton Launches a Password Manager - Proton Pass",
    "Proton Pass end-to-end encrypted password manager is here and free for everyone",
    "Proton Pass is free, but I think the paid Plus version is the way to go",
    "Proton Launches Proton Pass: The Free Encrypted Password Manager You Need",
    "Proton Pass: Free Password Manager for iOS, Android and More",
    "Proton Pass  —  Free and fully encrypted password manager to keep your login credentials safe.",
    "Proton's Password Manager Is Now Available for Everyone",
    "Proton's password manager Proton Pass comes out of beta",
    "Proton's encrypted password manager is now available to everyone.  - The Verge",
    "ProtonMail Developer Launches Free, Encrypted Password Manager",
    "Proton's got a new password manager with email masking and more",
    "Proton launches its password manager Proton Pass, now available for download",
    "Proton Pass password manager leaves beta: here is our take",
    "Proton's new password manager has just landed for all users",
    "Proton Pass, the free password manager from Proton Mail, is out of beta",
    "Save 80% Off ‘Proton Pass Plus’ Password Manager Forever! [Limited Time Deal]",
    "Proton Pass password manager launches with a deal that's just too good to pass up",
    "Proton Pass free password manager emerges from beta",
    "Proton Pass password manager is out of beta and available for free",
    "🎉 Announcing Slang.ai's $20M in funding",
    "Slang.ai Raises $20M in Series A Funding Led by Homebrew",
    "Slang.ai Closes $20 Million Led By Homebrew to Empower Restaurants and Retailers with Voice AI",
    "Slang taps AI to answer phone calls for brick-and-mortar businesses",
    "Generative AI Voice Startup Slang.ai Raises $20M to Answer Phones at Restaurants and Retailers",
    "Slang.ai raises $20M to bring the power of voice AI to retailers and restaurants"
]