[
    "SEC sues Coinbase over exchange and staking programs, stock drops 12%",
    "U.S. Securities and Exchange Commission",
    "US SEC sues crypto exchange Coinbase, one day after suing Binance",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "SEC sues Coinbase, continues major crackdown on cryptocurrency exchanges",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "Bitcoin bounces higher in wake of Coinbase lawsuit",
    "Coinbase Violated Securities Laws With Staking Program, Multiple U.S. State Regulators Allege",
    "Coinbase short sellers set to rake in $307m on stock crash",
    "Coinbase, don't feel left out. SEC has a lawsuit for you, too",
    "SEC sues Coinbase in widening crackdown on crypto exchanges",
    "Coinbase is being sued by the SEC",
    "SEC to Coinbase: You're Making Billions But Failing to Protect Investors",
    "Coinbase sued by SEC in New York Federal court",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "SEC Sues Coinbase on Unregistered Securities Exchange Allegations",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "SEC Lawsuits Against Binance, Coinbase Critiqued By Crypto Lawyer and Former Employee",
    "Coinbase responds to SEC lawsuit - Here is what they said",
    "SEC Says Coinbase Made Billions of Dollars Unlawfully",
    "SEC Charges Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "SEC files complaint against Coinbase",
    "Crypto Wilts in Summer Heat as SEC Charges Both Binance and Coinbase",
    "Coinbase CEO Brian Armstrong Looks Forward To Facing Off Against SEC In Court",
    "SEC Chair Gensler lambasts crypto industry after agency charges Binance, Coinbase",
    "US Crypto Crackdown Reaches Fever Pitch as SEC Sues Coinbase",
    "SEC Goes After Coinbase, Biggest US Crypto Exchange",
    "Crypto Twitter abuzz with Coinbase banter after SEC lawsuit",
    "Coinbase (COIN) Shares Tumble 9% amid SEC's Binance Securities Violation Allegations",
    "Coinbase Stock Price: Can Crypto Exchange Survive COIN Shares Slump, SEC Charges?",
    "SEC accuses Coinbase cryptocurrency exchange of breaking US regulations",
    "Coinbase Sued By SEC, Regulator Says Crypto Exchange Is Offering Unregistered Securities",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "How are the “we take a long view of crypto” people doing today",
    "mission driven company, where the mission is failure",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "They didn't sue FTX. https://twitter.com/...",
    "Yes. https://twitter.com/...",
    "Gary upping the ante this week. https://twitter.com/...",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "BREAKING WE'RE ALL CRIMINALS",
    "Mistakes were apparently made... https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "SEC is going crazy https://twitter.com/...",
    "SEC's Latest Crackdown Could Drive Crypto Firms Out of the U.S.",
    "Doubling Down: SEC Charges Coinbase For Operating Illegally, A Day After Charging Binance",
    "US SEC Indicts Coinbase over Unregistered Exchange and Broker Platform",
    "Coinbase CEO responds to SEC suit, says team is ‘confidant’ in facts and law",
    "‘We will continue to operate our business as usual’ says Coinbase legal chief",
    "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market",
    "Levine on the SEC's 1-2 punch on Binance and Coinbase",
    "SEC Named 16 Cryptos As Unregistered Securities Between Binance and Coinbase Lawsuits",
    "Coinbase COIN Stock Drops 10% Following SEC's Lawsuit Against Binance",
    "US securities regulator sues cryptocurrency platform Coinbase",
    "Coinbase Sued by SEC; Another Violation of Securities Laws",
    "Round 2: SEC Charges Coinbase for Operating as an Unregistered Securities Exchange, Shares Plunge",
    "BNB, BUSD ‘not securities’ - Binance rejects SEC's security labels",
    "SEC cracking down on crypto: Coinbase, Binance face charges",
    "SEC Sues Coinbase Over Alleged Securities Violations",
    "SEC Sues Coinbase, Alleging It Acted As An Unregistered Broker",
    "SEC charges Coinbase with running an illegal exchange in fresh blow for crypto",
    "New Jersey Office of Attorney General",
    "US States Are Going After Coinbase Following SEC Lawsuit — Here's How",
    "Coinbase Hit With Pending Cease and Desist Orders From 11 States",
    "Secretary of State Giannoulias Charges Coinbase in Groundbreaking Suit",
    "The Best- and Worst-Case Scenarios for Coinbase",
    "The Department of Financial Protection …",
    "DFPI Issues Action Against Coinbase Citing Staking Rewards Program Violates Securities Law",
    "Coinbase COIN Shares Dump 13% as Alabama Regulator Joins SEC Lawsuit",
    "Coinbase Drops 9% Post Binance Lawsuit: Company Rallies for ‘Clear’ Crypto Rules",
    "SEC sues Coinbase over alleged violations of securities laws",
    "Apple Makes Developer Betas Free to Download and Install",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Apple's developer betas are now free to download and install",
    "It wasn't a mistake — Apple betas are now free",
    "Apple will let you install its newest developer betas right now — for free",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple briefly made the iOS 17 Developer Beta available to all",
    "iOS 17 Developer Beta accidentally made available to all",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "How to get iOS 17 — Quick! You might get it for free",
    "Apple Makes Developer Betas Available to Everyone for Free",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "How to install the watchOS 10 Developer Beta",
    "Download the new iPadOS 17 wallpapers right here",
    "iOS 17 beta is here, but only for developers",
    "Apple macOS Sonoma: Features, compatibility, more",
    "How to download the iOS 17 beta on your iPhone right now",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Whatever you do, don't download the iOS 17 developer beta - Apple made a huge mistake",
    "iOS 17 Lets You Insert Contacts and Passwords into Any Text Field",
    "Apple announces powerful new privacy and security features",
    "Apple Music on iOS 17 Introduces Crossfade, Collaborative Playlists, and New Music Player",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "iOS 17 Tidbits: Enhanced Siri Suggestions, Multiple Timers, Recipe Visual Look Up, and More",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple's Craig Federighi discusses iOS 17 privacy features, AI and more in new interview",
    "Apple is finally tweaking the autocorrect function with iOS 17",
    "Which iPhones and iPads Are Compatible With iOS 17 and iPadOS 17?",
    "Apple Music Gains Crossfade, Collaborative Playlists, And More With iOS 17",
    "Craig Federighi on new Apple privacy features; how Apple will protect us from AI",
    "Marques Brownlee on YouTube",
    "Apple Vision Pro Impressions!",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple's Vision Pro Is a $3,500 Ticket to Nowhere",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Hands on: Apple Vision Pro: I just wore the future",
    "Even with so many demonstrated use cases, Apple Vision Pro might not yet have a purpose",
    "Apple's AR headset suffers from a lack of vision",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Apple made the best face computer.  But it's still a face computer.",
    "3 things I learned by trying Apple Vision Pro headset (and 3 I didn't)",
    "Apple's Vision Pro Headset May Be a Flop. It's Still a Win for the Company.",
    "Here's What Early Testers Are Saying About Apple's Vision Pro Headset",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Early Apple Vision Pro neurological research helps it predict when you'll click",
    "What Resolution Is Apple's New Vision Pro AR/VR Headset?",
    "Why AR is the future despite Apple Vision Pro backlash, and one thing Google Glass did right",
    "Vice wag: Apple's Vision Pro ‘is a $3,500 ticket to nowhere’",
    "What it's like to try Apple's new Vision Pro headset",
    "Apple Vision Pro hands-on impressions make it seem cool, but not essential",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "I tried the Apple Vision Pro mixed-reality headset — here's what it's like",
    "First Hands-On Demos with Apple Vision Pro [VIDEOS]",
    "Apple Vision Pro Demo Roundup: Here's What Everyone Is Saying",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro first look",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "Markup on Apple Vision Pro #AppleVisionPro #visionOS #WWDC23 #SpatialComputing #AR #VR #MR [video]",
    "Incredibly clear and lifelike. Best I've seen yet. https://twitter.com/...",
    "wow this is a way better demo than what Apple showed during its keynote https://twitter.com/...",
    "These are the people you are up against if you think the Apple Vision Pro will fail [image]",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "This is not the final form https://9to5mac.com/...",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "I gotta admit, this part made me a bit sad. [image]",
    "Apple's AR headset is a game-changer for startups",
    "Apple's Vision Pro: The Groundbreaking Headset to Accelerate AR/VR Adoption?",
    "The Unveiling of Apple's Vision Pro: A Revolutionary Leap Forward in Augmented Reality",
    "The Apple Vision Pro marks a turning point in the AR/VR market",
    "Everything We Dislike About Apple's Vision Pro AR/VR Headset",
    "The Apple Vision Pro Makes Drawing Easier Than We Imagined",
    "Apple's Vision Pro AR headset cheat sheet: Release date, price and more",
    "How Apple Vision Pro Works With the Mac",
    "This First Reaction To Vision Pro's Price Probably Wasn't What Apple Hoped For",
    "I wanted the “Wow” factor for the Apple Vision Pro reveal, but all I got was a “Why?”",
    "WWDC 2023: Apple launches Vision Pro and raft of products powered by new chipsets",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "United States District Court for the District of Columbia",
    "SEC files motion to freeze cryptocurrency held by Binance.US",
    "SEC Asks Court to Freeze Binance.US Assets",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "SEC files motion for restraining order against Binance",
    "SEC requests asset freeze on Binance.US amidst lawsuit alleging compliance failures",
    "SEC Strikes: Seeks Temporary Restraining Order To Freeze Binance.US Assets",
    "SEC Files Motion to Freeze Crypto Held by Binance.US",
    "Fineqia: SEC's Actions Against Coinbase Could Push Digital Asset Exchanges Outside the US",
    "SEC requests restraining order to temporarily freeze Binance.US assets",
    "Why Did the SEC File Charges Against Binance? What You Need to Know",
    "Binance Withdrawal On Track to be Largest Since March Crypto Banking Crisis",
    "Coinbase Traders Withdraw $600M in a Day Amid SEC Lawsuits",
    "Binance Users Pull $778 Million Amid SEC Crackdown",
    "Investors pull $790 million from crypto exchange Binance after SEC charges",
    "SEC/crypto: the knives are out for exchanges",
    "Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours",
    "Binance adds Bitcoin NFTs to its marketplace one day after SEC lawsuit",
    "Binance Reportedly Bleeds $790M in Investor Funds Following SEC's Damning Charges",
    "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen",
    "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "Robinhood ‘actively reviewing’ the listing of SOL, other tokens named in SEC lawsuits",
    "Bitcoin Rallies Above $27K as Crypto Market Shrugs Off SEC Lawsuits Against Binance, Coinbase",
    "Coinbase CEO Calls on Congress to ‘Fix the Situation’ After SEC Lawsuit",
    "SEC Crackdown: Inside the Tokens the Commission Labeled Securities",
    "Binance lawsuit adds another 10 cryptos to SEC securities list",
    "Binance Responds to SEC's Complaint, Pledges “Vigorous” Defense Amid Overwhelming Industry Support",
    "Binance Sees Massive Outflows Following SEC Lawsuit: Data",
    "Bitcoin (BTC) and Broader Crypto Market Come Crashing Down Following SEC Lawsuit on Binance",
    "Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "Crypto liquidations peak as SEC's Binance lawsuit shakes crypto markets",
    "BNB price prediction: Is it safe to buy Binance Coin now?",
    "US District Court for the District of Columbia",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC Sues Coinbase for Breaking Securities Laws",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC files motion for restraining order to freeze Binance US assets",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "One-Two Punch Finally Registers SEC View on Binance, Coinbase, Rest of Crypto",
    "Binance Saw Net Outflows of $69 Million in One Hour",
    "Coinbase and Binance Lawsuits Put Crypto on Ice",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "Coinbase CEO Brian Armstrong Fires Back at SEC, Vows to Fight for Crypto Rules",
    "House Debate Over New Crypto Bill Comes As Binance Suit Shows Regulatory Cracks In U.S.",
    "Crypto Stocks Plunge As SEC's Lawsuit Against Binance And Coinbase Intensfies",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "SEC Sues Binance Over Violations of US Securities Rules, Exchange Hits Back",
    "Breaking: Coinbase Sued by SEC Just a Day After Binance Lawsuit - Which Firm is Next?",
    "NFT Mogul Transfers NFTs Worth Millions To Show Support For Binance",
    "The SEC is suing Binance, the world's largest crypto exchange",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "Those Binance charges in full",
    "SEC sues crypto giant Binance and its CEO",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "Strong together. https://twitter.com/...",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "we welcome clarity and guida— NOT THAT KIND OF CLARITY AND GUIDANCE",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "Potential bankrun type situation 👀 https://twitter.com/...",
    "The gears of justice grind slowly but they grind exceedingly fine. https://twitter.com/...",
    "Those Binance charges in full https://www.ft.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "[DB] SEC Alleges BNB, BUSD Are Securities in Lawsuit",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "And another one bites the dust (maybe?) https://markets.businessinsider.com/ ...",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "SEC charges Binance with the exact same accusations as FTX: https://www.nytimes.com/... [image]",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia Capital's U.S. Partners May Reap China Gains Even After Split",
    "Sequoia Splits Into Three Entities, Makes China Standalone Firm",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Sequoia Splits Its Global Fund Into 3 Separate Businesses",
    "Sequoia splitting into three independent entities for India & SEA, China, US & Europe",
    "Why Did Sequoia India Change Its Structure And Brand Identity To Peak XV Partners?",
    "Sequoia rebrands to Peak XV Partners in India and SEA",
    "Sequoia India and SEA rebrands as Peak XV Partners",
    "Sequoia Spins Off India Unit; Rebrands To Peak XV Partners",
    "Sequoia Capital to split into three parts, separating its China and India businesses",
    "Sequoia to separate China, India and Southeast Asia by March 2024",
    "Sequoia splits China and India arms from US mothership",
    "Here is the global business update we shared with our LPs. [image]",
    "really solid piece from @alexrkonrad https://www.forbes.com/...",
    "👀😳 https://twitter.com/...",
    "End of an era. https://twitter.com/...",
    "Massive moment for venture in India https://www.forbes.com/...",
    "Reddit to Cut 5% of Staff and Trim Hiring Goals in Restructuring",
    "Reddit to lay off about 5% of its workforce - WSJ",
    "Reddit is cutting ‘roughly 90’ staffers and reducing hiring.",
    "Reddit Laying Off 5% of Workforce, Trims Hiring Plans",
    "Reddit to lay off about 5% of workforce: Report",
    "For better or worse, Apple is avoiding the AI hype train",
    "Apple avoids the AI trap at WWDC",
    "‘Ducking hell’ to disappear from Apple autocorrect",
    "Why AI wasn't mentioned at all during Apple's big WWDC presentation",
    "What Is a Large Language Model?",
    "Siri is not a chatbot and that may be just the way Apple likes it",
    "Apple Ghosts the Generative AI Revolution",
    "Apple's Vision Pro: Where's the 5G?",
    "Apple's practical approach to A.I.: No bragging, just features",
    "Apple WWDC AI word count: 0",
    "Not really, they just use a different buzzword called ML. https://www.theverge.com/...",
    "“Transformer-based” in the keyboard. First LLM mention. Everyone take a drink. #WWDC",
    "Not sure why anyone thought there would be an AI focus today... https://twitter.com/...",
    "Apple bought the AR company behind the tech in Nintendo's ‘Mario Kart’ ride",
    "Apple acquires Mira, a startup building lightweight AR hardware",
    "Mira made AR headsets for the US Military — and Apple owns the company now",
    "Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World",
    "Apple buys AR company behind Super Nintendo World's Mario Kart ride",
    "Apple reportedly acquired AR start-up Mira as it pushes new headset vision",
    "Apple Buys the AR Startup Behind the Mario Kart Ride Headset",
    "Apple acquires AR headset startup Mira",
    "@RichLightShed ... Funny part there is Apple looked at buying Within first!",
    "Instagram appears to be developing an AI chatbot with 30 different personalities to choose from",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram might be working on an AI chatbot",
    "Instagram AI Chatbot: Leaked Image Hints to Upcoming “AI Agents”",
    "Instagram works on AI Chatbots in DMs",
    "Free Figma template of onboarding & activation designs",
    "Now in beta: Save and sign in with passkeys using 1Password in the browser",
    "Google Workspace users can now log in without a password, thanks to passkeys",
    "Passkey support for 1Password arrives in beta today",
    "Passkey feature for Google Cloud, Workspace enters open beta",
    "1Password rolls out support for Passkeys in beta for browsers, with limited support on mobile",
    "Google launches passkeys for Workspace",
    "Simplify and strengthen sign-in by enabling passkeys for your users, available now in open beta",
    "Google rolls out passkeys for Workspace customers: Here's how to allow users to skip password",
    "Marc Andreessen has a plan to use ‘AI to save the world’ - and it doesn't involve regulation",
    "Andreessen Horowitz Co-Founder Marc Andreessen on ‘Why AI Will Save the World’",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Important new post from @pmarca https://a16z.com/...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft to pay $20 million for XBOX children privacy violations",
    "Microsoft to pay $20 million to settle Xbox Live privacy allegations",
    "Xbox COPPA violations cost Microsoft $20 million in FTC settlement",
    "Microsoft cops $20M slap on the wrist for mishandling kids' Xbox data",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "The FTC issued Xbox with a hefty fine for collecting children's data",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Children's Data",
    "Microsoft to pay $20M FTC fine over Xbox child account data collection practices",
    "Microsoft to Pay $20M to Settle FTC Charges It Violated Children's Privacy",
    "Microsoft To Settle FTC Kids' Privacy Case With $20M",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Kids' Xbox Data",
    "Microsoft Hit With $20M Illegal Data Storage Fine from FTC",
    "Microsoft hit with $20 million fine after collecting children's data on Xbox consoles",
    "Microsoft to pay $20 million for violating children's privacy laws",
    "Microsoft settles with FTC for $20 million over Xbox child data violations",
    "Microsoft Settles FTC Charges for $20 Million over Xbox Child Privacy Violations",
    "Microsoft Charged $20 Million by FTC Over ‘Illegally Collected’ Children's Information on Xbox",
    "Microsoft Must Pay US Government $20 Million Over Xbox Privacy Violations",
    "FTC Fines Microsoft For COPPA Violations Affecting Younger Xbox Users",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Microsoft Fined $20 Million by FTC Over Storage of Xbox Data",
    "Microsoft fined $20m for violating online child protection laws",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "That fine is 49 minutes of Microsoft's revenue.",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Actor Leonardo DiCaprio Invests in NUVIEW's LiDAR Satellite Constellation",
    "GitLab soars on plan for new AI-powered product",
    "GitLab Reports First Quarter Fiscal Year 2024 Financial Results",
    "Payroll platform Immedis snapped up by US workforce management firm",
    "Payroll provider UKG to acquire Immedis from CluneTech",
    "Terry Clune-owned Immedis sold in deal valued at nearly €600m",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Digital asset-denominated life insurer Meanwhile snags $19 million funding round",
    "Instabase lands $45M investment to help companies automate document processing",
    "AI-Enhanced Business Services Startup Instabase Raises At $2B Valuation",
    "TSMC Says Capex to Be Near Low End of Target at $32 Billion",
    "TSMC can help ‘stabilize’ U.S.-China relations: Chairman",
    "TSMC Employees Experiencing Problems in Arizona",
    "TSMC feeling ‘good’ about possible Germany plant, in talks on subsidies",
    "TSMC expects H2 performance to be better than H1",
    "“Going to the US is not all downside” https://www.ft.com/...",
    "Made it. $TSM AGM. I'm at the back, final row. 🙃 [image]",
    "These 21 Subreddits Are Going Dark to Protest Reddit's API Changes",
    "Redditors to shut down communities in response to API price changes",
    "Here's why so many Reddit communities are planning to go offline for 48 hours (or more)",
    "Reddit in Mass Revolt Over Astronomical API Fees That Would Kill Third Party Apps",
    "Reddit communities are ‘going dark’ to protest changes that would hurt third-party apps",
    "Intel Details PowerVia Backside Power Delivery Technology",
    "Intel has unveiled a weapon against TSMC and Samsung. PowerVia technology is unparalleled",
    "Intel Shows Off Bottleneck-Busting PowerVia Tech, On Schedule For 2024 Arrival",
    "Intel's backside power delivery process could make CPUs a whole lot more efficient",
    "Intel gets a speed boost from its PowerVia power delivery tech for its 2024 Arrow Lake CPUs",
    "Intel Claims It's 2 Years Ahead of Its Rivals With Backside Power Delivery",
    "Intel researchers claim to be two years ahead with breakthrough PowerVia tech",
    "CareRev Exec Addresses Allegations About Founder in Email",
    "AI generated content should be labelled, EU Commissioner Jourova says",
    "EU Urges Tech Giants to Label AI-Generated Content to Fight Disinformation",
    "Reading the tea leaves for Apple's AI plans",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "Several Major Organizations Confirm Being Impacted by MOVEit Attack",
    "BA, BBC and Boots hit by cyber security breach with contact and bank details exposed",
    "Clop Ransom Gang Breaches Big Names Via MOVEit Flaw",
    "What we know about the MOVEit vulnerability and compromises",
    "Extent of N.S. software breach still unknown, Microsoft blames ransomware gang",
    "Boots, BA and BBC have data stolen in cyber attack",
    "MOVEit victims emerge: British Airways, BBC and Nova Scotia",
    "Major Data Breach Exposes BA, BBC and Boots to File Transfer Hack: What You Need to Know",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "British Airways, Boots and BBC among companies hit by cyber security attack"
]