[
    "@0x00string@infosec.exchange",
    "@JoeUchill@mastodon.social",
    "@santim@social.vivaldi.net",
    "@chrismessina@mastodon.xyz",
    "Google challenger Neeva gives up on consumer search, goes all in on AI and the enterprise",
    "Neeva, the would-be Google competitor, is shutting down its search engine",
    "Neeva shuts down its search engine to focus on AI products",
    "Google search rival Neeva is shutting down its search engine to work on AI products",
    "Neeva, The Ad-Free Search Engine, Announces Closure",
    "Neeva Shut Downs its Search Engine",
    "Neeva Shuts Down Search Engine Ahead of Snowflake Deal",
    "LLMs are a bigger opportunity for startups than search https://twitter.com/...",
    "Startup aims to steal Apple's AR thunder by launching the Spacetop augmented reality laptop",
    "The esports world is starting to teeter",
    "Reported offers for TSM's LCS slot fall well short of league's record sale price",
    "Hidden crypto holdings turn divorce battles into high-stakes cases, attorneys warn",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "Bitcoin's Price Faces Bleak Outlook as Selling Pressure from Miners Surge",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Private debt delivers calm waters in storm of volatility",
    "The first AI navigator for your entire network",
    "FBI misused surveillance tool on Jan. 6 suspects, BLM arrestees and others",
    "FBI misused intelligence database in 278,000 searches, court says",
    "The FBI Broke The Law Over 278,000 Times With Illegal Searches On Americans",
    "FBI Searched Jan. 6 Rioters and George Floyd Demonstrators in Spy Database",
    "FBI issued 278,000 improper searches in 2021: filings",
    "FBI repeatedly misused surveillance tool, unsealed FISA order reveals",
    "POV: The FBI will keep abusing personal data until we end Section 702",
    "G7 Hiroshima Leaders' Communiqué",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 leaders unite to regulate generative AI globally under the ‘Hiroshima Process’",
    "G7 countries call to have global technical standards for AI",
    "G7 calls for ‘responsible’ use of generative AI",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "(BNS) @BradyDale On SBF, FTX, All The Stuff",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Strike Goes Global Adding USDt Support and Enhanced App Unveiled at Bitcoin 2023 Conference",
    "Strike Relocates Global Headquarters To El Salvador, Expands Presence To 65 Countries",
    "Strike Expands Services To 65 Global Markets, Moves Headquarters To El Salvador",
    "Strike moves global headquarters to El Salvador, expands bitcoin payments to 65 countries",
    "Bitcoin Payments App Strike Expands to More Than 65 Countries From Three",
    "Strike moves global headquarters to El Salvador, expands to 65 countries",
    "Bitcoin Wallet Strike Expands Support to 3 Billion People, Targets Global South",
    "Max Keiser Says XRP And All Cryptocurrencies Are Securities, Except For Bitcoin — Here's Why",
    "Dennis Duffy was ahead of his time. https://www.wsj.com/...",
    "Microsoft Gains China's Approval to Acquire Activision Blizzard amid Ongoing Antitrust Scrutiny",
    "Microsoft says China approves its plan to buy video game-maker Activision Blizzard",
    "China's antitrust committee joins Microsoft's growing list of Activision approvals",
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard",
    "@film_girl@mastodon.social",
    "@rodhilton@mastodon.social",
    "Instagram clones Elons app with Metas social media might: Is Twitter in danger",
    "Leaked slide reveals Instagram's challenger to Twitter; app could launch next month",
    "Instagram challenges Twitter with text-based app",
    "Instagram might be working on a Twitter killer",
    "This is Instagram's new Twitter competitor",
    "Images of Instagram's Twitter Competitor Leaked, Lets Users Reach New Audiences",
    "Instagram Is Preparing A Twitter-Like App To Be Launched This Summer, Report Says",
    "Meta planning to use Instagram to supplant Twitter - here's the proof",
    "Instagram is readying a Twitter-like service",
    "Meta to release text-based version of Instagram, similar to Twitter",
    "Instagram's New Twitter Competitor Leaks",
    "Meta's Instagram is working on a text-based app to rival Twitter",
    "Meta's Twitter Competitor App is Set to be Launched Some Time Next Month",
    "Instagram's Twitter-Like App Could Be Released Next Month",
    "Look Out Bluesky, Instagram's Twitter Clone Could Launch in June,",
    "Everything we know about Instagram's Twitter clone, due this summer",
    "Meta's Twitter rival Instagram app “P92” reportedly coming in June",
    "Instagram's New Twitter Competitor Revealed",
    "... are you seriously telling me Facebook is pushing “pivot to text?” https://twitter.com/...",
    "This is Instagram's new Twitter rival app https://www.theverge.com/...",
    "@mattmday Right??? I think I've joined like 9 new apps in the last 6 months",
    "Let's see how this goes. https://www.theverge.com/...",
    "curious to see how well this does... https://twitter.com/...",
    "Instagram joins Fediverse? https://twitter.com/...",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]"
]