[
    "Behind the Musk-Zuckerberg ‘Cage Match’ Is a Yearslong Billionaire Feud",
    "Will Elon Musk Fight Mark Zuckerberg in a Cage? You Can Bet on It",
    "@ianbetteridge@writing.exchange",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "@lauren@mastodon.laurenweinstein.org",
    "@Techmeme This company is a dumpster fire 🔥",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "LastPass users furious after being locked out due to MFA resets",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "@summeremacs@fashionsocial.host",
    "This is a good read: https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "YouTube could host mobile and desktop video games",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "The 10 Best Offline Android Games To Play With No Internet Connection",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering",
    "@tananarivedue.bsky.social",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "A cyber-focused candidate is running for president. Does he have a chance?",
    "Starfield exclusivity was the last straw for Microsoft, led to $7.5 billion ZeniMax buyout",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Xbox Says That The Console War Is Just A Social Construct",
    "FTC vs. Xbox: Sony ‘uses revenue’ from Microsoft's games to block games from coming to Xbox",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Xbox Has ‘Lost the Console Wars,’ Microsoft Says",
    "Has Xbox lost the console wars?",
    "The Flex Report (June 2023)",
    "Flex Report: Tech Industry Deep Dive",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "Effective scheduling is key to workforce optimization",
    "New Technologies and Jobs in Europe",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio - WSJ",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "Amazon to take its India investment to $26 billion by 2030",
    "Amazon CEO Andy Jassy says ready to invest $15 billion more in India",
    "Modi in US: Amazon CEO Andy Jassy commits to $15 billion investment in India",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "Amazon CEO Andy Jassy meets PM Modi, ups India investment commitment to $26 billion",
    "Amazon to invest $15b more in India",
    "Amazon Plans To Invest Another $15 Billion in India By 2030",
    "Amazon, Google to expand investment in India after meeting PM Modi in US",
    "Amazon, Google to Expand India Investments After Modi Visits US",
    "Google to invest $10 billion in digitisation: CEO Sundar Pichai after meeting PM Modi",
    "What Amazon, Google, And Microsoft Announced After PM's ‘Hi-Tech Handshake’",
    "Google will open global fintech centre in Gujarat: Sundar Pichai after meet with PM",
    "‘Way Ahead of Its Time’: Google's Sundar Pichai on PM Modi's Vision for Digital India",
    "Major investments. Google, Amazon commit $25 billion investments in India after meeting Modi",
    "Google CEO Sundar Pichai unveils plans for fintech hub in GIFT City, Gujarat",
    "Google investing $10 billion in India's digitisation fund: Sundar Pichai tells PM Modi",
    "Google, Amazon Announce Major Investments In India After Meeting PM Modi In US",
    "'PM Modi's vision for Digital India was way ahead of its time,' says Google CEO Sundar Pichai",
    "Google, Amazon announce major investments in India after meeting with PM Modi in US",
    "Modi in US: Google to setup global fintech operation centre in Gujarat, says Sundar Pichai",
    "Biden and Indian Prime Minister Meet With Tech Executives",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Social media's fragmented future",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe",
    "EU, Meta agree to July stress test on EU online content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "Aloud - dubbing for everyone",
    "YouTube integrates AI-powered dubbing tool",
    "YouTube's New Aloud AI Tool Will Dub Your Videos Into Other Languages",
    "YouTube is testing an AI-powered dub tool to translate creators' videos",
    "YouTube is getting a powerful AI dubbing tool — here's how it works",
    "YouTube's new tool can automatically dub videos in other languages",
    "YouTube video translation is getting an AI-powered dubbing tool upgrade",
    "YouTube is testing an AI voice-dubbing feature for creators, and it's incredibly fast",
    "You may soon listen to YouTube videos in any language thanks to AI",
    "YouTube could soon automatically dub videos using AI",
    "YouTube to boost AI-generated foreign language dubs",
    "YouTube Integrates AI-Powered Dubbing Service",
    "How to dub YouTube videos with AI-powered Aloud tool",
    "YouTube will soon be introducing its new AI-powered dubbing tool",
    "ICYMI: Twitch Says Competition Will Make Us Stronger; VidCon Recap Day One",
    "YouTube Is Adding AI-Powered Dubbing",
    "YouTube adding AI dub technology to translate videos for creators",
    "YouTube AI Dubbing: Overcoming Language Barriers",
    "International Business Times",
    "Khai Wu, Mark Zuckerberg's MMA Trainer Talks Potential Cage Fight With Elon Musk And More",
    "Elon Musk, Mark Zuckerberg ‘dead serious’ about cage fight, UFC boss says",
    "Instagram's Twitter Competitor Launching in Mid-July: Report",
    "Elon Musk Vs. Mark Zuckerberg In MMA Fight - How Will This Shake The Crypto, Metaverse Arena?",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "Elon Musk, Mark Zuckerberg ‘Dead Serious’ About UFC Fight: 'Let's Go Full MMA'",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Elon Musk vs. Mark Zuckerberg Cage Match Prompts Hypothetical Odds",
    "No Joke: Musk and Zuckerberg Really Want to Fight, Says UFC Boss",
    "Dana White reveals Elon Musk & Mark Zuckerberg “dead serious” about fight",
    "Here's the real reason behind Elon Musk, Mark Zuckerberg cage fight",
    "Gov. Abbott weighs in on potential Mark Zuckerberg-Elon Musk cage match: ‘Biggest fight’",
    "Sam Altman says he'd go watch Elon Musk cage fight Mark Zuckerberg",
    "Here's everything about the Elon Musk vs Mark Zuckerberg cage fight",
    "sanely? so who's running it https://twitter.com/...",
    "@petergyang It's a totally new text based app",
    "@SlugtalesNews @alexeheath Jack's Blue Sky is my choice. Can't wait.",
    "I have a feeling this might be the Twitter-killer. https://twitter.com/...",
    "@alexeheath So Instagram is not only TikTok but also Twitter?",
    "Some more reporting on the Fediverse aspect of this app: [image]",
    "Was he featured in Forbes https://twitter.com/...",
    "Another unicorpse. Who's keeping a list? https://www.theinformation.com/ ...",
    "Barely scratching the surface... https://twitter.com/...",
    "Katie wins the year with unicorpse https://twitter.com/...",
    "New tech fraud just dropped! 🍿 https://twitter.com/...",
    "Another Frank! https://twitter.com/...",
    "Why do so many startups funded by SoftBank end up imploding like a submersible? ↓ [image]",
    "19 out of 20 “users” were not 🤯 https://twitter.com/...",
    "Such negativity—why not say 5% are real? https://twitter.com/...",
    "Social app IRL, which raised $200 million, shuts down after CEO misconduct probe",
    "@zackwhittaker@mastodon.social",
    "U.K. Citizen Sentenced To Five Years In Prison For Cybercrime Offenses",
    "$794K SIM swap hacker PlugwalkJoe sentenced to five years in prison",
    "UK man who pleaded guilty to celebrity Twitter hack gets five years in prison",
    "Twitter hacker and crypto scammer sentenced to five years in prison",
    "Twitter Hacker Sentenced to 5 Years in Prison for $120,000 Crypto Scam",
    "Matthew Russell Lee's Newsletter",
    "British Hacker Gets 5 Years for Stealing Crypto and Swatting Social Media Influencers in NDCA",
    "Twitter Hacker Gets Five Years in Prison for Breaching Accounts of Top US Leaders",
    "Hacker responsible for 2020 Twitter breach sentenced to prison",
    "@TriflingTree@mastodon.social",
    "@WeavingWithAI@sigmoid.social",
    "Midjourney v5.2 Update Features Impressive ‘Zoom Out’ Tool",
    "Midjourney 5.2 brings zoom out and integrated prompt analysis",
    "MidJourney 5.2 zoom out feature needs a tad bit of work [image]",
    "Midjourney 5.2 Zoom out feature is insane. [image]",
    "Zoom Out with Midjourney v5.2 [image]",
    "“Stunning”—Midjourney update wows AI artists with camera-like feature",
    "New York Times Reveals an SBF-DeSantis connection",
    "SBF denied access to FTX's former law firm documents",
    "FTX Sues to Reclaim $700M Bankman-Fried Allegedly Spent on Celebrity Connections",
    "FTX sues ex-Clinton aide's investment firm for $700 million",
    "FTX Strikes Back: Sues Ex-Clinton Aide's Investment Firm For $700 Million",
    "FTX Seeks to Claw Back $700 Million From K5 Global and Related Entities",
    "FTX files suit against SBF's old pals to attempt $700M clawback",
    "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "FTX Attempts Clawback of $700M Allegedly Spent After A Networking Party",
    "Alameda seeks to claw back $700 million SBF paid ‘super networkers’",
    "FTX Seeks to Recover $700 Million from Sam Bankman Fried's Affiliated Funds",
    "FTX Sues K5 Global Investment Firm for $700 Million",
    "Alameda Seeks Return of $700M Paid to ‘Super Networkers’ for Celebrity, Political Access",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple set to launch Apple Pay and a credit card in India - see their benefits",
    "Apple to launch credit card in India, will also introduce Apple Pay: Report",
    "Apple Sets Sights on Indian Credit Card Market in Partnership with HDFC Bank",
    "Apple Card to arrive in India",
    "Apple set to launch its credit card in India: Report",
    "Apple to launch credit card in India, in talks with NPCI for Apple Pay",
    "Apple Is Planning To Launch Its Credit Card In India: Report",
    "Apple Pay May Finally Come to India",
    "Apple explores launching Apple Card in India",
    "Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Pay and US-exclusive Apple Card could expand to India",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple Card may arrive in India soon in partnership with HDFC Bank",
    "Apple Card could expand to India, four years after US rollout",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card may launch next in India",
    "Apple Card will launch in India next, report claims",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Apple Card and Apple Pay could soon launch in India",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Will Apple Card arrive in India before it reaches Europe?",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple in talks to launch Apple Pay in India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Reportedly in Discussions with Banks to Launch Apple Card in India",
    "@HopelessDemigod@mstdn.social",
    "Twitter agrees to comply with tough EU disinformation laws",
    "Technology is stress testing our society. Time to turn the tables.",
    "EU welcomes Meta plans for tough content rules",
    "Meta agrees to July ‘stress test’ on new EU content rules",
    "EU to Push Ahead With Data Act Despite Criticism",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "EU plants flag in Silicon Valley ahead of big tech crackdown",
    "Is Twitter ready for Europe's new Big Tech rules? EU official says it has work to do",
    "EU warns Twitter to beef up content moderation as new rules loom",
    "Twitter agrees to comply with tough EU disinformation laws |  Twitter"
]