[
    "Electronic Frontier Foundation",
    "@williamgunn@mastodon.social",
    "@ChanceHMiller@mastodon.social",
    "@Aaron@social.aaroncrocco.com",
    "@dcseifert@mastodon.social",
    "Reddit blackout: Read internal memo shared by CEO Steve Huffman addressing the issue",
    "Reddit CEO assures employees that API pricing protests haven't hurt revenue",
    "Reddit Blackout Crashes The Site As Reddit Users Realize They're In The Power Position",
    "Reddit CEO Says Blackout Hasn't Really Cost Them Money Yet And ‘Will Pass’",
    "Reddit Blackout: CEO downplays protest. Subreddits vow to keep fighting.",
    "Top Reddit Communities Make Blackout Indefinite Following Leaked Memo",
    "New Revelations About Shopify's Deliverr Sale Spotlights CEO",
    "Reddit CEO Comments on Subreddit Blackout, Tells Employees It ‘Will Pass’",
    "Reddit's CEO doesn't seem worried his social network is on pause",
    "Reddit CEO warns employees not to wear Reddit swag in public as users revolt",
    "Reddit CEO says like all other blowups this too will pass to employees in an internal memo",
    "Internal memo from Reddit CEO leaks, shows company will not back down",
    "Reddit CEO digs in on API tomfoolery, warns employees of wearing logo in public",
    "Reddit's CEO reportedly told staff that the community's API protest will blow over",
    "Reddit CEO Steve Huffman Is Confident the Current Sitewide Protest Is No Big Deal",
    "Reddit's largest Apple community will stay dark, as CEO promises to ride out shutdowns",
    "Reddit CEO: Apollo-Related Subreddit Blackouts ‘Will Pass,’ No Significant Revenue Impact So Far",
    "Reddit CEO Tells Employees in a Memo the Blackout ‘Will Pass’",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "my usage of reddit shall too pass https://www.theverge.com/...",
    "There is nothing more heinous than reddit wanting to be a sustainable business.",
    "I think he forgets just how hive-mindey and virtue-flaggy Redditors are https://twitter.com/...",
    "this seems like a great way to absolutely ensure it will never pass https://twitter.com/...",
    "The Reddit blackout has improved the overall state of Reddit and should remain permanent",
    "Reddit CEO tells employees that subreddit blackout ‘will pass’",
    "Reddit CEO tells employees that subreddit blackout “will pass”",
    "Reddit CEO is not negotiating with the hostage takers lmao what will the nerds do now?",
    "Reddit CEO Tells Employees That Subreddit Blackout ‘Will Pass’",
    "Reddit CEO assures employees that API protests haven't hurt revenue",
    "Reddit protests see some of the most useful Android subreddits ‘go dark’ [U]",
    "Popular subreddits plan to extend API protests indefinitely",
    "Here are some of the major subreddits that will stay down indefinitely",
    "Subreddits respond to CEO's comments by extending blackouts indefinitely",
    "48-hour Reddit user blackout kicks off, affecting 8K subreddits",
    "Rolling strikes in force, as a summer of discontent hits Reddit. https://twitter.com/...",
    "“Will pass” .... Maybe not https://t.co/mTERSe2VTx",
    "The Reddit blackout will continue",
    "Indefinite Blackout: Next Steps, Polling Your Community, and Where We Go From Here",
    "@christianselig@mastodon …",
    "@christianselig@mastodon.social",
    "Apollo's Christian Selig explains his fight with Reddit - and why users revolted",
    "@MikeRiverso@mastodon.social",
    "Reddit's CEO isn't worried about the 8,000+ subreddits going offline, ‘this one will pass’",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "Here's what the internet might look like without Reddit",
    "Reddit: profits, not protests, will determine IPO success",
    "This third-party Reddit app may survive — but only with a paid subscription",
    "Reddit says protesting communities crashed the site",
    "You're making money while increasing interest in our site?  Bad third party apps, bad.",
    "“The adventure that is the end of free money continues!” https://twitter.com/...",
    "won't be anything left to take public. https://twitter.com/...",
    "Open letter by Embracer Group CEO on restructuring program",
    "Embracer Group announces comprehensive restructuring program with immediate implementation",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Crystal Dynamics Confirms No Impact to Tomb Raider Following Embracer Restructuring",
    "Swedish gaming giant Embracer Group to cut studios",
    "Embracer Group Is Closing Studios And Cancelling Projects In A Major Restructure",
    "Embracer Plans to Turn Lord of the Rings Into ‘One of the Biggest Game Franchises in the World’",
    "Embracer's plan for The Lord of the Rings is bad for everyone",
    "Embracer confirms plans for layoffs in effort to become ‘leaner and more focused’",
    "Embracer Group announces restructuring with layoffs, game cancelations and more",
    "Embracer to restructure games empire, layoffs, studio closures, game cancellations imminent",
    "Crystal Dynamics Says Tomb Raider, Perfect Dark Won't Be Affected By Embracer Layoffs",
    "Embracer announces restructuring program, studio closures expected",
    "Function calling and other API updates",
    "OpenAI: Function calling and other API updates.  Huge set of announcements from OpenAI today. …",
    "OpenAI Upgrades GPT-4 and GPT-3.5 Turbo Models, Reduces API Prices",
    "OpenAI Updates API, GPT-3.5 Turbo, And GPT-4 For Enhanced Generative AI Applications",
    "OpenAI rolls out big chatbot API upgrades for developers",
    "lots of good updates including function calling and 16k context 3.5-turbo: https://openai.com/...",
    "16k 3.5 turbo is my hot new friend https://twitter.com/...",
    "New OpenAI update: lowered pricing and a new 16k context version of GPT-3.5",
    "OpenAI reportedly warned Microsoft about integrating GPT-4 into Bing",
    "Microsoft was reportedly warned about putting GPT-4 in Bing Chat too early by OpenAI",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing",
    "Microsoft CEO Satya Nadella discusses his “eureka moment” with AI in new interview",
    "Looks to me more and more like Zucks bet on Metaverse. https://twitter.com/...",
    "Microsoft's Satya Nadella Is Betting Everything on AI",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "Apple will remove Damus app unless it drops Bitcoin tipping feature",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Damus App must drop bitcoin tipping or face Apple app store removal",
    "Apple to delist Nostr-based Damus app over Bitcoin tip feature",
    "Apple threatens to ban popular social media App over Bitcoin tipping",
    "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted",
    "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "Due To Bitcoin Payments, Apple Bans Nostr Client Damus From App Store",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/...",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    "Lightspeed Venture Partners",
    "Four-week-old AI start-up raises record €105mn in European push",
    "Meet Europe's Next Great Generative AI Startup: Mistral AI",
    "AI Startup Mistral Raises Over €105 Million in Seed Round",
    "Generating mania: Month-old Paris-based startup Mistral AI raises $113M in seed funding",
    "France's Mistral AI Raises $113 Million in Big EU Startup Debut",
    "French company Mistral AI raises 105 mln euros shortly after being set up",
    "Dot com bubble all over again. https://twitter.com/...",
    "The rates are too low https://www.ft.com/...",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "SEC and Binance.US Engage in Negotiations to Avoid Total Asset Freeze",
    "Binance.US and SEC told to reach compromise on restraining order",
    "Binance.US Says SEC's Attempt To Freeze Assets Will Effectively Put it Out of Business: Court Docs",
    "Binance.US, SEC agree to work out deal to avoid full asset freeze: Bloomberg",
    "Asset Freeze to Halt Binance US Operations, Exchange Says, Seeks Rejection of SEC Request",
    "Hands-free photos, SpO2 and more for the Pixel family",
    "New blog articles in Google Nest Community",
    "Introducing the new home panel on Pixel devices",
    "Your Google Pixel phone's June update is here: The biggest new features",
    "Google starts unlocking the long awaited Pixel Watch SpO2 sensor",
    "Google Pixel devices receive massive June feature drop and security patches",
    "Google's June 2023 Pixel Feature Drop is a big one",
    "Pixel Drop June 2023: Enhanced Safety Features, Hands-Free Photos, and Fitness Updates",
    "June's Pixel feature drop adds hands-free photos and oxygen saturation tracking",
    "Your Pixel 7 Pro can now get *really* close in videos",
    "Google Pixel feature drop includes safety check and macro video — here's everything new",
    "Google Launches Pixel Watch Metal Bands, Delivers A Slew Of Updates For Fitbit, Pixel Phones",
    "Google's June 2023 Pixel feature drop doubles down on personal safety",
    "Big Google Pixel Update Brings Safety Features, New Customization",
    "Welcome Rubicon to Databricks: The Future of AI Storage and Serving Systems",
    "Databricks hits $1B revenue milestone as it doubles down on AI with Rubicon acquisition",
    "International Business Times",
    "Microsoft-Activision Blizzard merger temporarily blocked by US judge",
    "Court Temporarily Blocks Microsoft's $69B Buyout Of Activision Blizzard After FTC Intervention",
    "Microsoft-Activision Blizzard deal temporarily blocked by US judge",
    "US judge temporarily blocks Microsoft acquisition of Activision",
    "Microsoft-Activision: US judge temporarily blocks $69bn deal",
    "Microsoft Purchase of Activision Temporarily Blocked by Judge",
    "FTC wins a temporary restraining order blocking the Microsoft—Activision deal",
    "FTC has been granted its restraining order to keep Microsoft from buying Activision Blizzard",
    "Judge temporarily blocks Microsoft's $69 billion purchase of Activision",
    "FTC looks to hit the pause button on Microsoft's Activision Blizzard deal",
    "Microsoft's $69B Activision Blizzard deal temporarily blocked in U.S.",
    "FTC Files Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "Meta releases ‘human-like’ AI image creation model",
    "I-JEPA: The first AI model based on Yann LeCun's vision for more human-like AI",
    "Meta Shares New Generative AI Paper, Which Looks at its Advancing Predictive Models",
    "Self-Supervised Learning from Images with a Joint-Embedding Predictive Architecture",
    "Method  —  I-JEPA is a method for self-supervised learning.  At a high level …",
    "Well if LLM's dont give us AGI, Yann's other projects will xD https://twitter.com/...",
    "@MetaAI @ylecun Fantastic 👏👏👏🙏",
    "Meta are goated for this Take notes closedAI @openAI https://twitter.com/...",
    "Meta Releases ‘Human-Like’ AI Image Creation Model",
    "Advanced Micro Devices, Inc.",
    "AMD Unleashes EPYC Bergamo And Genoa-X Data Center CPUs, AI-Ready Instinct MI300X GPUs",
    "AMD Cloud-Native EPYC Bergamo, HPC Optimized Genoa-X CPUs And MI300 AI Accelerators Take Flight",
    "AMD Uses AI Day To Launch Genoa-X & Bergamo",
    "AMD Details EPYC Bergamo CPUs With 128 Zen 4C Cores, Available Now",
    "AMD Intros EPYC 97x4 “Bergamo” CPUs: 128 Zen 4c CPU Cores For Servers, Shipping Now",
    "AMD EPYC Bergamo Launched 128 Cores Per Socket and 1024 Threads Per 1U",
    "AMD adds 128-core Bergamo and 3D V-Cache Genoa CPUs to Zen 4 Epyc lineup",
    "AMD unleashes 128-core Epyc ‘Bergamo’, trounces Intel's most expensive CPU",
    "AMD announces hyperscaler-focused Epyc 97X4 processor, featuring 128 Zen 4c cores",
    "AMD says Meta is using its cloud chip as it rolls out AI strategy update",
    "AMD Has a GPU to Rival Nvidia's H100",
    "AMD Instinct MI300X accelerator for AI revealed, combines CPU, GPU, and 192 GB of HBM3 memory",
    "AMD launches new Instict MI300X AI chip to take on Nvidia's GPUs",
    "AMD reveals new A.I. chip to challenge Nvidia's dominance",
    "AMD unveils new wave of Data Center and AI hardware",
    "AMD Talks Up Open-Source Software For AI, Introduces Instinct MI300X",
    "AMD makes its case for generative AI workloads vs. Nvidia",
    "AMD unveils MI300x AI chip as ‘generative AI accelerator’",
    "AMD Instinct MI300 is THE Chance to Chip into NVIDIA AI Share",
    "AMD Preps GPU to Challenge Nvidia's Grip on the Generative AI Market",
    "Is The New AMD MI300X Better Than The NVIDIA H100?",
    "AMD Eyes AI, Cloud Expansion With Instinct MI300X, EPYC 97X4 Chips",
    "AMD Expands MI300 With GPU-Only Model, Eight-GPU Platform with 1.5TB of HBM3",
    "AMD Gives Peek at Upcoming Line of AI Processors in Challenge to Rival Nvidia",
    "AMD's Instinct MI300X GPU targets generative AI workloads",
    "What are the odds Nvidia will be pushing out a 144GB H100 in Q4? 🤔 https://twitter.com/...",
    "AMD Expands AI Product Lineup with GPU-Only Instinct Mi300X with 192GB Memory",
    "AMD Expands AI/HPC Product Lineup With Flagship GPU-only Instinct Mi300X with 192GB Memory",
    "AI Video Creation Pioneer Synthesia Raises $90 Million Series C Led by Accel",
    "AI video creation startup Synthesia reels in $90M from investors",
    "Nvidia-Backed AI Startup Synthesia Achieves Unicorn Status With $90 Million Fundraising Success",
    "Generative AI Video Platform Synthesia Raises $90 Million at $1 Billion Valuation",
    "AI-Generated Video Platform Synthesia Receives Nvidia Backing At Unicorn Valuation",
    "Synthesia Raises $90M in Series C Funding",
    "Application security startup Kodem emerges from stealth with $25M",
    "Kodem Raises $25M in Seed and Series A Funding",
    "This reads like a plot device from a lame 80s hacker flick https://arstechnica.com/...",
    "Hackers can steal cryptographic keys by video-recording power LEDs 60 feet away",
    "Hackers Can Steal Cryptographic Keys By Video-Recording Power LEDs 60 Feet Away",
    "New report says most of Microsoft's supply chain partners are not cutting fossil fuel use",
    "Microsoft faces challenges in achieving carbon-negative goal by 2030",
    "ZertES-compliant qualified electronic signatures (QES) for the European Union and Switzerland",
    "Silicon Valley Business Journal",
    "Cloudera's CEO is stepping down",
    "SEC asks for more time to respond to Coinbase call for crypto clarity",
    "SEC Responds to Coinbase Request for Crypto Clarity, Wants More Time",
    "SEC Indicates Potential Decision on Coinbase Petition Expected in Upcoming 4 Months",
    "SEC responds to Coinbase's second request for action: ‘Still no’",
    "SEC Says It May Make a Recommendation on Coinbase Petition Within 4 Months",
    "Developer sentiment around AI/ML",
    "AI and coding: How Seattle tech companies are using generative AI for programming",
    "GitHub Survey Finds 92% of Programmers Are Using AI Tools",
    "Surprise! GitHub finds 92% of developers love AI tools",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/13 - New Beatles Song Thanks To AI",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Germany to face EU ire over Huawei supplies ahead of China talks",
    "Mayo Clinic, Disney CEO back AR medtech's $20M investment round",
    "Medivis Raises $20M in Series A Funding",
    "Google delays EU launch of its AI chatbot after privacy regulator raises concerns",
    "Google Delays Bard AI Launch in the EU Over Privacy Concerns",
    "Irish data watchdog blocks Google from launching Bard in the EU: Report",
    "Google's Bard chatbot has been blocked in the European Union over privacy concerns",
    "Google Bard's EU launch gets delayed due to privacy issues",
    "Logitech Announces CEO Departure",
    "Logitech says CEO stepping down, to leave company",
    "Logitech CEO is stepping down",
    "Logitech's CEO is leaving for another job",
    "AWS experiment with Lambda in cloudless configuration fails to impress",
    "Amazon server outage makes some websites go dark",
    "Outage of Amazon's cloud service causes some websites to go dark",
    "Amazon Alexa, other services stop working; AWS outage causes chaos for users",
    "AWS outage causes some websites to go dark",
    "Amazon's cloud computing service recovers from outage",
    "AWS Outage Appeared to Affect Delta, McDonald's and Others",
    "Big Amazon cloud services recovering after outage hits thousands of users",
    "AWS US-East-1 Lamda outage causes issues globally",
    "Amazon Web Services briefly hit by wide-ranging outage, impacting major websites",
    "Amazon Says It's Resolving Outage That Knocked Websites Offline",
    "Amazon Web Services Meltdown Temporarily Breaks the Internet",
    "AWS went down, taking parts of the Internet with it — what we know",
    "AWS Outage Downs Other Websites, Apps",
    "AWS is down. Here's how you can track outage progress",
    "Amazon excludes Chinese e-commerce app Temu from competitive price checks",
    "Google challenges OpenAI's calls for government A.I. czar",
    "Google suggests a hub and spoke framework towards regulating AI",
    "Google and OpenAI Disagree on Government Oversight of AI",
    "Meta Horizon Worlds v114 Release Notes",
    "Meta Adds Text-Based ‘World Chat’ in Horizon Worlds VR Experience",
    "At Meta, Everything Old Is New Again",
    "Meta Horizon Worlds Introduces World Chat in v114 Update",
    "Nothing can go wrong with resurrecting Barrens chat.",
    "Microsoft's complicated relationship with OpenAI",
    "Report Details Internal Conflicts Over Microsoft's AI Push",
    "Microsoft CFO Says OpenAI and Other AI Products Will Add $10 Billion in Revenue",
    "The Awkward Partnership Leading the AI Boom: The Microsoft and OpenAI Saga",
    "Microsoft and OpenAI have an open partnership - and it's complicated",
    "Microsoft may have ignored warnings about Bing Chat's unhinged responses",
    "Accenture to Invest $3 Billion in AI to Accelerate Clients' Reinvention",
    "Accenture announced a $3 billion investment in AI",
    "Accenture to invest $3B in AI and double AI workforce",
    "Accenture plans to invest $3B into AI",
    "Accenture to invest $3 billion in AI",
    "Accenture pouring $3 billion into AI, joining long list of tech companies prepping to meet demand",
    "Accenture to double size of AI and data practice",
    "Accenture Places $3B AI Bet Following Multiple Acquisitions",
    "Accenture Commits $3 Billion Investment in AI to Increase Efficiency for Enterprise Clients",
    "Accenture bets big on AI with $3bn investment",
    "Uniswap Labs releases draft code for ‘entirely new’ version of Uniswap",
    "Uniswap v4: A Closer Look at the Proposed Updates",
    "Uniswap Unveils Game-Changing Version 4 With Customizable Liquidity Pools via Innovative Hooks",
    "Uniswap Upgrades to v4: Here's What's New",
    "Uniswap Unveils v4 Upgrade, Aims to Foster Community Feedback",
    "Uniswap v4 code now available on GitHub",
    "Uniswap Labs Shares Roadmap for Uniswap v4",
    "Uniswap v4: Customizable And Cost-Effective Solution For DEXs?",
    "Uniswap releases version 4 code, allowing for new types of liquidity pools",
    "Uniswap Update Means ‘The Possibilities Are Pretty Endless,’ Says Developer",
    "Congrats to the team on Uni v4 https://github.com/...",
    "From Fan Funding to Shopping: More ways for creators to earn on YouTube",
    "YouTube is lowering the eligibility requirements for creators to make money",
    "Overview of the expanded YouTube Partner Program",
    "YouTube makes it easier for new creators to earn money",
    "YouTube makes it easier for creators to monetize their channels",
    "YouTube Unleashes Game-Changing Updates to Partner Program for Creators",
    "YouTube's new Partner Program standards are tailored to live-streaming creators",
    "YouTube lowers the criteria to join its partner program, adds more benefits for US creators",
    "Making Money On YouTube Just Got Easier",
    "YouTube is making it easier for creators to make money — here's how",
    "YouTube Just Made It Even Easier To Make Money Through Its Monetization Program",
    "YouTube Announces new Monetization Policies for Creators",
    "It's now easier to get your YouTube channel monetized",
    "Smaller Creators Can Now Access YouTube Partner Program",
    "Earning Money on YouTube Just Got Easier",
    "YouTube makes it much easier for everyone to earn money from making videos",
    "ICYMI Alert: YouTube Gives Smaller Creators Earlier Access to YPP",
    "Ripple Victorious As Hinman Materials Unsealed, Why is XRP Down?",
    "Hinman docs unsealed: SEC concerned over ‘Ether is not a security’ statement",
    "The Hinman Documents Reveal a Deceitful SEC",
    "XRP reverses gains after document release in SEC lawsuit vs Ripple",
    "What's in the SEC's Hinman Emails and Do They Really Help Ripple?",
    "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials",
    "SEC vs Ripple: Two-year crypto beef could soon be settled",
    "Ripple's Chief Legal Officer Dissects Hinman's Speech and Its Impact on Crypto Regulation",
    "Court Documents Reveal SEC's Changing Thoughts on Crypto Regulation",
    "Ripple CLO Demands Answers From SEC Over Hinman Speech Controversy",
    "XRP price surges 7.4% as traders anticipate Ripple's legal outcome",
    "Hinman Ignored All Warnings, Split Up Howey Test: Ripple Legal Chief",
    "SEC emails show multiple officials examining ethereum in 2018",
    "SEC Emails Reveal: Hinman Wasn't Only Official Deliberating ETH Security",
    "Ripple v. SEC and the Hinman Speech: What Happened Behind the Scenes",
    "In Response to Hinman Docs, Ripple CEO Slams SEC's “Politically-Motivated Overreach”",
    "SEC officials pushed Hinman to clarify ETH wasn't a security: Court docs",
    "Ripple's chief legal officer calls for investigation after release of Hinman docs",
    "Full document 👇🏼 https://www.dropbox.com/...?",
    "Hinman details very clearly saying ETH is not a security https://twitter.com/...",
    "Paul McCartney: “Final” Beatles song out this year, thanks to AI",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Paul McCartney used AI to make a new Beatles song",
    "AI is all you need: Artificial intelligence is about to help the Beatles release a new record",
    "Paul McCartney got a little help from AI to create one last Beatles song",
    "The Beatles will release a final record, using John Lennon's voice via an AI assist",
    "The Beatles Come Together for ‘Last Record’ Using AI, Paul McCartney Says",
    "How AI was used to turn a raw demo into the Beatles' next (and last) record",
    "Paul McCartney says All You Need is AI to make one “final” Beatles song",
    "AI Is Helping Paul McCartney Create the Final Beatles Song",
    "Paul McCartney Uses AI to Complete Unfinished Beatles Song with John Lennon's Vocals",
    "Paul McCartney Says New Beatles Song Finished With Help From Artificial Intelligence",
    "Paul McCartney says A.I. got John Lennon's voice on ‘last Beatles record’",
    "A ‘new’ Beatles song is coming, with a little help from AI",
    "Paul McCartney says AI helped him finish one last Beatles song - here's what I think is coming",
    "Paul McCartney Says ‘Final’ Beatles Song Coming Soon—Thanks to AI",
    "Paul McCartney Says A.I. Helped Complete ‘Last’ Beatles Song",
    "The Beatles are dropping one last track with the help of AI",
    "Did Paul McCartney use AI to create a new Beatles song?",
    "Paul McCartney uses AI to resurrect old John Lennon demo for “final Beatles record”",
    "How Paul McCartney Used AI to Create the ‘Final Beatles Record’",
    "Paul McCartney Says “Final Beatles Record” In Works With AI-Assisted John Lennon Vocal",
    "Paul McCartney: AI helps create ‘the last Beatle record’",
    "Paul McCartney Is Using AI To Complete ‘Final’ Beatles Song",
    "Paul McCartney Used AI to Make a Final Beatles Song — But Not In a Creepy Way",
    "Paul McCartney Says He Used AI to Produce a “Final” Beatles Song",
    "The Beatles are over. Why can't McCartney just let it be?https://www.bbc.com/...",
    "Paul McCartney says artificial intelligence has enabled a ‘final’ Beatles song",
    "AI-powered “final” Beatles song due this year, says Paul McCartney",
    "Oracle is on course to make Larry Ellison the world's third-richest man",
    "Larry Ellison passes Bill Gates to become world's fourth richest person",
    "Bill Gates falls another notch on the world's billionaire list, as AI takes Larry Ellison higher",
    "Larry deserves it. Relentless https://twitter.com/...",
    "Netflix Is Reportedly Gearing Up to Stream Sports",
    "Netflix Planning Its First Live Sports Event, Report Says",
    "Netflix Explores Live-Streaming Sports with Celebrity Golf Tournament",
    "Netflix reportedly plans first live sports event with celebrities playing golf",
    "Netflix Could Stream its First Live Sports Event This Fall",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "I feel like the professional golfers have an edge here",
    "Lolwut  —  Not sure what the opposite of clickbait is (click repellent?) but this qualifies",
    "I'm going to put my money on the professional golfers https://twitter.com/...",
    "Together at last: the two dullest non-sports on the planet https://twitter.com/...",
    "I would very much watch this please and thank you https://twitter.com/..."
]