[
    "Evernote has laid off most of its US staff and will move most operations to Europe",
    "Evernote lays off US employees and moves to Europe",
    "Evernote Lays Off Most of Staff, Triggering Fears of Closure",
    "Moving the Evernote center of operations to Europe",
    "Evernote is relocating to Europe after laying off most of its US workforce",
    "Evernote undergoes major layoffs, shifts operations to Europe",
    "Early App Store star Evernote is packing up its trunk, leaving the U.S., and is moving to Europe",
    "For your eyes only, my unedited 2013 TIME Magazine story about Evernote",
    "Not good news for us Evernote fans. https://news.ycombinator.com/ ...",
    "What's going on at Evernote? I'd move my notes away from there if I had any [image]",
    "in a blistering defeat for nominative determinism, evernote not looking very ever [image]",
    "Old enough to remember when Evernote was on track to be a 100-year startup https://twitter.com/...",
    "Tell HN: Nearly all of Evernote's remaining staff has been laid off",
    "Bay Area tech company Evernote lays off most staff, relocating to Europe",
    "International Business Times",
    "The Eclectic Light Company",
    "@McCullohMD@disabled.social",
    "@austinkocher@mastodon.social",
    "@tchambers@indieweb.social",
    "@CelloMomOnCars@mastodon …",
    "How many users are on Threads ? Where Meta App is available and how figures compare to Twitter",
    "Meta's Threads app to cross 100 mn users while Twitter traffic dips",
    "Avoid Threads if you value your privacy",
    "Twitter clones, ranked: Who's worth the commitment?",
    "Meta's Twitter Rival ‘Threads’ Crosses 90 Mn Sign-Ups Within Days Of Launch [Details]",
    "Disgraced Comedians Are Looking for a Second Chance on Threads",
    "Mastodon, Threads, Bluesky and what next?",
    "Is Threads threatening Twitter's reign?",
    "Don't Count Bluesky Out Yet",
    "Cage Match: Twitter vs. Threads, PeakGPT, Local News Survival",
    "@CelloMomOnCars@mastodon.social",
    "How Threads' Privacy Policy Compares to Twitter's (and Its Rivals')",
    "How Threads' privacy policy compares to Twitter's (and its rivals') - Ars Technica",
    "How Threads' privacy policy compares to Twitter's (and its rivals')",
    "Google's medical AI chatbot is already being tested in hospitals",
    "AI doctors? Google already testing AI chatbots similar to Bard, ChatGPT in hospitals",
    "Google testing AI chatbot to expertly answer medical questions",
    "Google's Medical Chatbot is Being Tested in Hospitals",
    "Google is field-testing its generative medical language model in a clinical setting",
    "Google is testing a AI-model to answer all your health-related questions",
    "What AI can do with a toolbox... Getting started with Code Interpreter",
    "ChatGPT's Code Interpreter - Top 6 uses",
    "ChatGPT Code Interpreter Released: Here are 10 Mind-blowing Use Cases",
    "ChatGPT's new feature, code interpreter, is now available to all plus subscribers",
    "Code Interpreter might be most useful application of A.I. so far, says Wharton professor",
    "Sarah Silverman sues Meta, OpenAI for copyright infringement",
    "Sarah Silverman Sues OpenAI And Meta Over Copyright Infringement",
    "Authors sue OpenAI and Meta for copyright infringement",
    "Popular comedian and author sues ChatGPT maker OpenAI and Meta for copyright infringement",
    "Authors sue Meta and OpenAI for possible AI copyright infringement",
    "Authors sue OpenAI and Meta in latest generative AI lawsuit",
    "This is why comedian Sarah Silverman is suing OpenAI, the company behind ChatGPT",
    "Comedian Sarah Silverman, 2 authors file copyright infringement lawsuits against Meta, OpenAI",
    "What Can Help Meta and OpenAI Potentially Win the Copyright Infringement Lawsuits?",
    "Comedian Sarah Silverman Sues OpenAI, Meta for Copyright Infringement",
    "Sarah Silverman Sues ChatGPT's Creator Over Alleged Copyright Infringement",
    "Sarah Silverman, authors sue Meta, OpenAI for alleged copyright infringement",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement",
    "Sarah Silverman Sues ChatGPT Creator for Copyright Infringement",
    "Sarah Silverman is suing OpenAI and Meta for copyright infringement.",
    "“Sarah Silverman is suing OpenAI and Meta for copyright infringement [of her books]”",
    "@jpholbrook@mastodon.online",
    "The world is big and no one is listening",
    "This Week on Crypto Twitter: Winklevoss Calls on Silbert to Negotiate, Sues Him 3 Days Later",
    "A eulogy for Twitter: the place we journalists loved, for better or worse",
    "Great read, well written. And sadly agree. https://twitter.com/...",
    "Ironically, it seems like there's more engagement around this piece here than on twitter!",
    "@falschgold@mastodon.social",
    "The internet's “town square” is dead",
    "It's a huge win for Zuckerberg if Threads steals Twitter's lost charm and serendipity",
    "Suspended from Twitter, the account tracking Elon Musk's jet has landed on Threads",
    "Threads Is Not an Automatic Win for Meta",
    "How Twitter lost its place as the global town square",
    "How Twitter lost its place as the global town square - Washington Post",
    "@intelwire@mastodon.social",
    "Sequoia China to compete with Peak XV in Singapore",
    "HongShan sets up Singapore office for SE Asia bets: Report",
    "Sequoia China enters Singapore, sparking competition with Indian branch: report",
    "Instagram's Threads surpasses 100 million users",
    "Instagram Threads hits 100 million users, becoming easily the fastest growing app ever",
    "Meta's App Threads Reaches 100 Million Users - This Is Why",
    "Threads app signs up 100m users in less than a week",
    "Instagram's Threads crosses 100 Mn users, India drives download growth",
    "Meta's Threads races to 100 million users in under a week",
    "Meta's new ‘Twitter killer’ app, Threads, hits over 100 million users",
    "Threads set to cross 100 million users as Twitter traffic dips",
    "Twitter rival Threads signs up 100 million users in five days",
    "Threads Reaches 100 Million Members in Record Time",
    "Meta's Threads app is on track to 100 million users as it reaches 70 million in just 5 days",
    "Apple Plants Roots in Threads as Users Approach 100 Million",
    "Free compensation benchmarking data from 3,000 startups",
    "Snapchat Reportedly Reaps Benefits From Creator Revenue-Sharing Program",
    "'Like Gen Z's Takeover Of Twitter': Creators React To Threads, Meta's New Social App",
    "robertodoering / harpy on GitHub",
    "@mranthropology.bsky.social",
    "watchOS 10 exclusive: These are the biggest Apple Watch upgrades powered by new developer APIs",
    "0.10.3  —  For the time being harpy is still working by using Twitter's legacy v1 api.",
    "Some Twitter users can go back to using the old and better version of TweetDeck",
    "The old, good version of TweetDeck is back",
    "Good news: Old TweetDeck is back [image]",
    "The good version of TweetDeck is back, but for how long?",
    "Personalized wealth management, built for tech people",
    "Make your family time a blast with these activities",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Report: Revolut US Payments Flaw Leads to $20 Million Theft",
    "Thieves Stole $20 Million Via Revolut US Payment Flaw, FT Says",
    "@avandeursen@fediscience.org",
    "Yellen visits China amid worst economic tension in decades",
    "Geopolitical tensions rise, chip machine sales to China fall",
    "Oops.  It turns out that US chipmakers cannot survive without China",
    "UK Finance: 61% of Push Payments Fraud Tied to Meta",
    "Everything We Announced at TwitchCon Paris",
    "Twitch is adding a new discovery feed plus a stories feature",
    "Twitch announces its finally adding features that will help small creators get discovered",
    "Twitch introducing Stories and Discovery Feed to boost offline community interaction",
    "Twitch Adding New Feature Straight Out of Snapchat's Playbook",
    "TwitchCon 2023: Twitch is the latest platform to get Instagram and TikTok-like features",
    "Twitch is finally making it easier to find new streamers to follow.",
    "Twitch Stories feature takes shot at YouTube shorts and TikTok",
    "@harrymccracken@sfba.social",
    "@drewharwell@mastodon.social",
    "Gizmodo's io9 Published an AI-Generated Star Wars Article That Was Filled With Errors",
    "Gizmodo's writers push back against AI-generated articles",
    "G/O Media Has Begun Using AI to Generate Content",
    "Google ranks AI-generated ‘Star Wars’ article lacking E-E-A-T",
    "Gizmodo's staff isn't happy about G/O Media's AI-generated content",
    "How An AI-Written ‘Star Wars’ Story Created Chaos at Gizmodo",
    "AI robot asked ‘will you rebel against humans’?",
    "Some US schools are deploying robots that can surveil campuses and confront intruders",
    "We're going to give the job of bullying incel weirdos to the robots https://twitter.com/...",
    "Australian Financial Review",
    "@Celeste_pewter@mastodon …",
    "@neurovagrant@masto.deoan.org",
    "Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "Anatomy of a Twitter payout",
    "Elon Musk's X Corp sues law firm over $90 million fee in Twitter buyout battle",
    "Elon Musk Claims $90M Overcharge By Twitter Law Firm As Company Changed Hands",
    "Twitter Sues Law Firm Over $90 Million Payment in Elon Musk Deal",
    "Elon Musk's X Corp files lawsuit against law firm to recoup fees from Twitter buyout",
    "Musk sues law firm for $135m bill on Twitter deal",
    "Elon Musk goes after Twitter acquisition lawyers",
    "Yep, that's how you'd react to a $90 million legal bill.",
    "Elon Musk sues law firm over huge fee Twitter paid hours before he took over",
    "Elon Musk's Twitter sues top law firm Wachtell over $90 million fee for work under prior ownership",
    "there's poking the bear and then there's whatever the hell this is [embedded post]",
    "@Celeste_pewter@mastodon.social",
    "Elon Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "“Threads app is not for news and politics,” says Instagram CEO Adam Mosseri",
    "Rightwing figures sign up for Meta's Threads app ‘within 24 hours’ of release",
    "Threads' Rejection of “Hard News” Is A Symptom Of Advertisers and Censors Pulling All The Strings",
    "Threads app a ‘high-risk’ bet, says Instagram head Adam Mosseri",
    "Weekend poll: Did you sign up for Threads?",
    "Opinion: If Threads work, it won't be because it toppled Twitter, but because it toppled Instagram",
    "Meta will soon let you delete your Threads profile without nuking your Instagram account",
    "Meta's Threads has hit 70 million signups, Mark Zuckerberg says",
    "Meta's vision for Threads is more mega-mall than public square",
    "Meta's ‘friendly’ Threads collides with unfriendly internet",
    "Meta executive claims goal of Threads is to create a ‘less angry place,’ not replace Twitter",
    "Threads Barrels to 70 Million Sign-Ups in Just 2 Days",
    "Instagram Head Says Meta 'Won't Encourage' News on Threads",
    "Online News Act creates ‘moment of reckoning’ for publishers",
    "Threads: We Don't Need Hard News or Politics on Our Platform",
    "Instagram Head Wants Threads to Be a Sterile, News-Free Environment",
    "Meta Threads doesn't need the ‘negativity’ of hard news and politics, exec says",
    "The Meta team is low-key roasting politics Twitter over on the other app [image]",
    "sad trombone.mp3 https://twitter.com/...",
    "That's up to the users, surely. https://twitter.com/...",
    "NPR quitting Twitter was a turning point in the story.  Now the news organization is on Threads.",
    "Threads isn't for news and politics, says Instagram's boss"
]