[
    "International Business Times",
    "San Francisco Business Journal",
    "Threads already has over 95 million posts",
    "Meta launches Android beta for Threads after it amasses 70 million users",
    "Instagram Threads Hits 70 Million As Tech Stars Join Twitter Clone: Here's Who To Follow",
    "Meta launches Android beta version for Threads, reaches 70 million users",
    "Meta launches a Threads beta program for Android users",
    "Zuckerberg's ‘Twitter killer’ Threads hits 70m sign-ups in two days",
    "Threads is All The Worst Parts of Twitter And Instagram in One Very Bad App",
    "Threads, Data Or Not, Giving Brands Somewhere To Go Other Than Twitter",
    "The Algorithmic Anti-Culture of Scale",
    "Bluesky Reaches 1 Million Downloads as Threads Topples 70 Million",
    "Is Threads threatening Twitter's reign?",
    "Meta's Threads Might Be the Most Downloaded App on Launch Day in History: Analysts",
    "Meta's new Threads social network reaches 70M users",
    "Iran Blocks Public Access to Threads App; Raisi's Account Created",
    "Elon Musk and Mark Zuckerberg's surprisingly long history of trying to outdo each other",
    "‘Clone’ or competitor? Users and lawyers compare Twitter and Threads",
    "A ‘Thread’ About Twitter....And The End Of The Honest Internet",
    "Threads: New Twitter rival looks like a shrewd move but Meta lacks credibility",
    "Threads is now up to 70 million users, which is “way beyond” Meta's expectations",
    "Mark Zuckerberg touts 70 million sign ups to Threads",
    "Meta's Threads upends social media in less than 48 hours",
    "Official Google and YouTube accounts join Threads",
    "Meta Reports 70 Million Threads Sign-ups in First 2 Days",
    "Twitter's Desktop App Sees Surge in Outages as Meta's Threads Takes Off",
    "Meta's Threads Has 70 Million Signups, Surprising Zuckerberg",
    "Twitter threatens to sue its new rival, Threads, claiming Meta stole trade secrets",
    "Daily Digest: Threads up to 50 million users; PE firm secures $20B for buyout fund",
    "All these features are on the way to Threads by Instagram",
    "Threads installation touches 55 million mark, 30 million within 24 hours",
    "Instagram Threads hits 30m signups as Twitter threatens to sue",
    "Hours In, Threads Is Already a Big Hit",
    "Twitter sends Mark Zuckerberg a cease-and-desist over Threads",
    "Twitter threatens legal action over Threads, calling Meta's new app a ‘copycat’",
    "The definition of a mass social network! [embedded post]",
    "Opinion: If Threads work, it won't be because it toppled Twitter, but because it toppled Instagram",
    "Online News Act creates ‘moment of reckoning’ for publishers",
    "Will Meta's ‘friendly’ Threads thrive in an unfriendly internet",
    "Meta Threads doesn't need the ‘negativity’ of hard news and politics, exec says",
    "The Missing Threads Features Adam Mosseri Says Are ‘On The List’",
    "Meta executive claims goal of Threads is to create a ‘less angry place,’ not replace Twitter",
    "Meta's vision for Threads is more mega-mall than public square",
    "Threads: We Don't Need Hard News or Politics on Our Platform",
    "Instagram Head Says Meta 'Won't Encourage' News on Threads",
    "Meta examining allowing users to delete Threads ‘separately’ from Instagram",
    "Threads Is Working On A Chronological Feed",
    "Head of Instagram reveals what's coming to Threads",
    "Instagram Threads to soon get a Following tab, says Adam Mosseri",
    "Threads Is Breaking Download Records",
    "Threads will soon allow deleting your account separately from Instagram",
    "You can't delete your Threads account if you want to keep Instagram — here's why",
    "Threads is getting a following feed, but not for a while",
    "Threads Will Get a Chronological Feed Option Eventually",
    "good luck with that [embedded post]",
    "The Meta team is low-key roasting politics Twitter over on the other app [image]",
    "sad trombone.mp3 https://twitter.com/...",
    "That's up to the users, surely. https://twitter.com/...",
    "NPR quitting Twitter was a turning point in the story.  Now the news organization is on Threads.",
    "Threads isn't for news and politics, says Instagram's boss",
    "A Threadful plot twist in the race to displace Twitter",
    "With Threads, Meta Has Plenty of Opportunity And Underappreciated Risk",
    "Twitter's Final Boss: Zuckerberg Wages War",
    "Meta's Threads has hit 70 million signups, Mark Zuckerberg says",
    "Elon Musk replies to his own parody Twitter account. Here's what he says ...",
    "Mark Zuckerberg Trolls Elon Musk With A Spider-Man Meme",
    "Mark Zuckerberg vs Elon Musk: clash of the tech egos",
    "Twitter vs. Threads - Elon Musk and Jack Dorsey go after Mark Zuckerberg",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Could Meta's Threads deal a knockout blow to Twitter?",
    "Musk files lawsuit against Meta as Threads surpasses 50 million users in one day",
    "Threads sees 30 million downloads in first few hours, Zuckerberg says",
    "Meta's Threads Passes 70M Signups; Users More Than Double In One Day",
    "Twitter vs Meta: Elon Musk and Jack Dorsey Criticize Zuckerberg's Threads",
    "Musk and Zuck promised us a cage fight, but what we've got are 2 reply guys trading petty jabs",
    "Twitter vows to sue Meta over new rival Threads app",
    "Elon Musk accuses Mark Zuckerberg of cheating: Twitter vs. Threads",
    "Threads Token Up 4800% Amid Meta-Musk Saga",
    "Musk threatens lawsuit as Twitter rival Threads takes off",
    "Threads App Reaches More Than 30 Million Signups",
    "Mark Zuckerberg Hard-Launched Threads, and It Worked",
    "Elon threatens to sue Mark Zuckerberg over the Threads app - here's the letter from Elon's lawyer",
    "Musk vs. Zuckerberg Threads throwdown: Twitter threatening to sue over Twitter ‘killer’",
    "Meta's New Twitter Competitor, Threads, Boasts Tens of Millions of Sign-Ups",
    "How Threads Could Kill Twitter",
    "Incredible. Seriously, add this to Musk's list of accomplishments. https://www.wsj.com/...",
    "Twitter alleges Meta Platforms stole trade secrets for Threads, potential legal battle looms",
    "Threads won't be fun — but it will give brands a refuge from Twitter",
    "YouTuber MrBeast becomes first to get 1 mn followers on Threads",
    "How Wendy's and 12 other brands jumped on Threads",
    "Instagram's Threads threatens to destabilize Twitter, enticing users & potential ad spend",
    "Instagram Head Wants Threads to Be a Sterile, News-Free Environment",
    "‘All aboard the Threads train!’ New York agencies join Instagram's new alternative to Twitter",
    "Meta's Threads App Sees Early Success, Drawing Advertiser Interest and Twitter's Ire",
    "Who's on Threads? And Who's Sitting Out?",
    "Want to Video Chat Your Twitter Followers? It's Happening",
    "Threads, Meta's Twitter clone, just launched and people are already complaining about it",
    "Meta's Advertising Backbone Guarantees Threads' Monetization",
    "hey @zuck, you should go to space just to really make him mad lol",
    "Reply with the mood you're in and i'll send you a recco 😌",
    "15 features of the new Meta Threads",
    "Why is Threads unavailable in the EU?",
    "A brief review of the Threads Android app",
    "Threads app breaks records on first day. Here's how",
    "How to join and use Meta's Twitter rival Threads",
    "SUPREME COURT OF THE STATE OF NEW YORK",
    "GEMINI TRUST COMPANY, LLC, v. DIGITAL CURRENCY GROUP, INC. and BARRY SILBERT",
    "Gemini Sues Digital Currency Group and Founder Barry Silbert Alleging ‘Fraud’",
    "Crypto firm Gemini sues Genesis-owner DCG",
    "Crypto Clash: Gemini And Genesis Owner Barry Silbert Go To Court Over Lost Bitcoin",
    "Gemini Sues Barry Silbert, DCG as Genesis Restructuring Stalls",
    "Gemini takes legal action against Digital Currency Group for alleged fraudulent activities",
    "Winklevoss twins sue crypto investor DCG after dispute over restructuring",
    "US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute",
    "Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency",
    "Gemini Files Lawsuit Against Digital Currency Group and Barry Silbert Alleging Fraud and Deception",
    "Winklevoss' Gemini Sues DCG and Barry Silbert For Fraud",
    "Gemini Sues Digital Currency Group Founder for Fraud",
    "Gemini Sues Barry Silbert And His Company DCG Alleging Fraud Against Earn Users",
    "Gemini Lawsuit Accuses Barry Silbert and Digital Currency Group of Fraud",
    "Gemini files lawsuit against DCG and Barry Silbert alleging fraudulent activities",
    "Gemini suit accuses DCG, Silbert of ‘aiding and abetting fraud’",
    "Gemini Sues Genesis Owner Over Failure to Recover Customers' Bitcoin",
    "Breaking: Gemini Files A Lawsuit Against Digital Currency Group and Barry Silbert for Fraud",
    "I cannot wait to see discovery https://twitter.com/...",
    "Our whole industry is becoming a novella. https://twitter.com/... [image]",
    "Could have been avoided by doing 15 minutes of due diligence. https://twitter.com/...",
    "@Celeste_pewter@mastodon …",
    "@neurovagrant@masto.deoan.org",
    "Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "Twitter Sues Law Firm Over $90 Million Payment in Elon Musk Deal",
    "Elon Musk's Twitter sues top law firm Wachtell over $90 million fee for work under prior ownership",
    "Elon Musk sues law firm over huge fee Twitter paid hours before he took over",
    "Musk Claims Lawyers Overbilled in Fight to Make Him Buy Twitter",
    "Musk Sues Wachtell, Lipton To Recover $90 Million Fee",
    "Musk sues law firm Wachtell Lipton over $90mn Twitter legal fee",
    "Twitter Sues Wachtell Over $90 Million Payout for Musk's Buyout Deal",
    "there's poking the bear and then there's whatever the hell this is [embedded post]",
    "@Celeste_pewter@mastodon.social",
    "Google alleges India's antitrust agency protecting Amazon in Android case - report",
    "Google Challenges India's Antitrust Body Over Alleged Favoritism Towards Amazon",
    "Google, CCI, Rs 2,200 crore and the Amazon ‘twist’",
    "Google ‘accuses’ Competition Commission of India of protecting rival Amazon in anti-trust case",
    "SC To Hear Google, CCI Pleas In Android Case On July 14",
    "DoorDash, Uber and Grubhub sue New York City over minimum wage for delivery workers",
    "New Minimum Wage Rule for NYC Food Delivery Workers Temporarily Halted by Judge",
    "A DoorDash worker cursed at her over a $5 tip. Then she learned what they're paid",
    "Food delivery companies fight NYC wage law",
    "Food Delivery Companies Challenge New York City Minimum Wage Law",
    "Doordash, Grubhub and Uber sue New York City over minimum wage law",
    "Uber, DoorDash, Grubhub sue over NYC $18-per-hour rule",
    "App makers sue to halt NYC rule setting $18 hourly wage for food delivery",
    "Uber, DoorDash Sue NYC to Stop Delivery Drivers From Getting a Minimum Wage",
    "Uber, DoorDash and Grubhub sue New York City over $18 minimum-wage law",
    "Food delivery apps DoorDash, Grubhub to block driver wage hike: lawsuit",
    "Uber, DoorDash sue New York City over minimum wage law",
    "DoorDash, Uber file lawsuits against New York City's minimum wage law",
    "Food delivery companies sue New York City over minimum wage law",
    "There it is, these scumbags will never give up their fraudulently low pay without being forced to.",
    "Uber, DoorDash Sue NYC Over Minimum Wage Law",
    "Make your family time a blast with these activities",
    "@arstechnica@mastodon.social",
    "Reddit demands moderators remove NSFW labels, or else",
    "Reddit Gives Final Warning to Subreddits Using NSFW Protest Tactic",
    "Cyberpunk 2077 subreddit goes extremely NSFW in Reddit protest",
    "Reddit NSFW protestors now given ‘final warning’ by company",
    "Reddit is forcing moderators to remove NSFW label. Here's why",
    "BotDefense is wrapping up operations",
    "Reddit mods fear spam overload as BotDefense leaves “antagonistic” Reddit",
    "Ant's share repurchase plan values firm at nearly $79 billion",
    "Bill stalls to make Big Tech pay California publishers for news",
    "This leaves out more than it reveals, trust me. https://www.washingtonpost.com/ ...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Lightmatter: Next-gen computing built for AI.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "PayPal: Opening opportunities for all.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Bangladesh government website leaked data of millions of citizens",
    "Bangladesh Government Website Leaks Citizens' Personal Data",
    "@GossiTheDog@cyberplace.social",
    "@franksting@mastodon.cloud",
    "How Threads Became One of the Fastest Growing Apps Ever",
    "Can you run Threads on a desktop?",
    "Threads Barrels to 70 Million Sign-Ups in Just 2 Days",
    "Meta launches a Threads beta program for Android",
    "How to use Threads on desktop using Windows 11",
    "Bluesky Hits 1 Million Installs As Competition With Threads Heats Up",
    "Don't Count Bluesky Out Yet",
    "Meta launches Threads app as an alternative to Twitter",
    "Chinese securities regulator fines Ant Group almost $1 billion for ‘illegal acts’: AFP",
    "Chinese Regulators Fine Ant Group $985M in Signal That Tech Crackdown May End",
    "China ends probe of Ma-backed Ant with $984 million fine",
    "Ant Group, Jack Ma-founded fintech giant, gets fined almost $1 billion by China regulators",
    "China wraps up fintech crackdown with big fines on Tencent, Alibaba",
    "Ant Group launches $6bn buyback after regulatory crackdown ends",
    "Alibaba Stock Rises As China Concludes Probe Of Affiliate Ant Group",
    "China fines Jack Ma's Ant Group nearly $1 billion",
    "Alibaba Up 3.4% as China Completes Ant Group Probe With a $984M Fine",
    "China hits tech firms with hefty fines as crackdown draws to close",
    "China's financial regulators wrap up makeover of Ant Group and Tencent",
    "China finalises Ant Group's regulatory overhaul with hefty fine",
    "China Fines Ant Group $985 Million, in Sign Crackdown Is Over",
    "China hits Alibaba affiliate Ant Group with $985 million fine for violating various regulations",
    "China fines Ant 7.1 billion yuan",
    "Alibaba Stock Soars After China Fines Ant Group $1 Billion. Here's Why.",
    "Ant Group faces hefty $1.1b fine",
    "China to end Ant Group's regulatory revamp with fine of at least $1.1 billion: sources",
    "China Ends Tech Crackdown With Fines on Tencent, Ant Group",
    "Apple cracks down on lending apps after deepfake nudes threat",
    "After Google, now Apple also removes predatory lending apps in India",
    "Apple Removes Predatory Lending Apps from Indian App Store",
    "Apple India Cracks Down On Illegal Digital Lending Operators, Delists Multiple Apps",
    "Apple pulls predatory lending apps from India App Store",
    "Apple's App Store removes predatory lending apps in India",
    "Scam loan apps in the App Store threaten to send fake nudes to contacts",
    "Mystery $120 Million Outflow Hits Crypto Bridge Multichain Whose CEO Is Missing",
    "Multichain shuts down amidst $130 million suspected hack",
    "Multichain Halts All Services Following Exploit, Losses Over $126 Million",
    "DeFi Protocol Multichain Hacked For $126 Million, PechShield Confirms",
    "Circle freezes $63m in USDC in response to Multichain breach",
    "Circle Intervenes, Freezes $63 Million From Multichain Hack",
    "More than $125 million taken from crypto platform Multichain",
    "$63 million in USDC frozen by Circle following Multichain breach",
    "CZ Says Binance Users' Assets are Not Affected by Multichain Hack",
    "Multichain Fantom Bridge Exploited and Drained of $126M, Aptos Twitter Account Hacked",
    "Multichain Halts Operations, Warning Users of Mysterious $126M Outflow",
    "$130M Worth Of Outflows From Multichain Spark Fears Of Exploit",
    "Multichain halts services after $126M exploit",
    "$126M in Multichain Funds ‘Abnormally’ Moved to Unknown Address, Says Troubled Bridging Project",
    "Multichain MPC Bridge Experiences Massive Outflows, Triggering Concerns of Potential Exploit",
    "Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit",
    "PRICE PREDICTIONS  —  Fantom Price Prediction: Can FTM Shrug Off Multichain Users' Selloff?",
    "Hack or Rugpull? Multichain Sees $126 Million ‘Abnormal’ Outflows",
    "Another bridge hacked. Sleep on $ROUTE https://twitter.com/...",
    "Exploit of Fantom, Moonriver and Dogechain Crypto Bridges Confirmed by Multichain Team",
    "China's Alibaba and Huawei showcase new AI products amid frenzy",
    "Huawei launches Pangu Large Model 3.0",
    "Apple Is Planning a Slow, In-Store Rollout for Its Vision Pro Headset",
    "Apple Vision Pro Will Reportedly Have A Very Slow Rollout, UK & Canada Next",
    "Apple working on inclusive Vision Pro accessories and a head scanning app",
    "Buying an Apple Vision Pro Will Be a Boutique Experience",
    "Apple reportedly plans to launch its Vision Pro headset in Canada by the end of 2024",
    "You'll need an appointment, a head scan, and prescription data to buy an Apple Vision Pro",
    "Apple Will Require Appointments to Buy Vision Pro Headset",
    "Apple reportedly requiring in-store appointment to buy Vision Pro headset",
    "Apple Will Require Appointments to Test Vision Pro Headset",
    "Apple's Vision Pro retail plan will be a velvet-rope experience",
    "Apple Vision Pro rumored to launch in the UK and Canada by end of 2024",
    "Apple Vision Pro Might Hit Canada in 2024, Says Report",
    "The Apple Vision Pro headset may only be purchasable by appointment",
    "Apple Vision Pro Sales to Reportedly Require an Appointment and Face Scan",
    "Apple's Vision Pro won't ship outside US for over a year",
    "Report: Apple Vision Pro Sales Process to Include Face Scans",
    "Apple's Vision Pro headset will be very hard to buy-even if you can afford one",
    "Apple Vision Pro May Be Sold By Appointment Only To Start",
    "You're Going to Need an Appointment to Get Your Hands on Apple's Vision Pro",
    "Apple Vision Pro may require in-store appointments — and there's more bad news",
    "Apple Vision Pro Headset: New Leak Reveals Design And Release Date Update",
    "Apple preps measured, appointment-only sales of Apple Vision Pro",
    "Apple's Vision Pro Could Land In UK And Canada By End Of 2024",
    "The “appointment-only” Vision Pro will reportedly arrive in UK and Canada by the end of 2024",
    "There's a bunch of bad news about Apple's Vision Pro headset",
    "Buying Apple's Vision Pro headset could require an appointment and a face scan",
    "Apple may launch the Vision Pro headset with appointment-only sales",
    "Apple Vision Pro buying experience will reportedly be by appointment only",
    "Buying Apple's Vision Pro headset will require in-store appointment",
    "Vision Pro will require an appointment, initially only in Apple Stores",
    "Apple will require retail appointments to purchase Vision Pro, slow rollout planned for 2024",
    "Apple Plans a Slow, Appointment-Only Rollout of Its $3,500 Vision Pro",
    "AI for All: Powering APIs and Large Language Models with Lightning ⚡🤖",
    "The complexities and challenges of integrating LLM into applications",
    "Lightning Labs Unveils Toolkit to Enable AI Transact in Bitcoin",
    "Lightning Labs Unveils Innovative Bitcoin Toolkit for AI",
    "Lightning Labs unveils tools that will allow AI to make bitcoin transactions",
    "ChatGPT plug-in can now send Bitcoin payments",
    "Lightning Labs Unveils New Tools to Ease Bitcoin Transactions for AI",
    "Lightning Labs Empowers AI Agents like ChatGPT to Transact in Bitcoin",
    "Lightning Labs unveils tools enabling AI apps to seamlessly interact with Bitcoin network",
    "Lightning Labs Releases Tools for Bitcoin-Powered AI Products",
    "Lightning Labs releases tools letting AI transact and hold Bitcoin",
    "Lightning Labs releases new Bitcoin tools for AI development",
    "Bitcoin + AI  —  run  —  run as fast as you can  —  away from this [embedded post]",
    "Binance Unravels as Executives Flee and Layoffs Proliferate",
    "Binance Appoints New Chief Strategy Officer Amid Regulatory Scrutiny",
    "Binance Defies FUD With $2B Inflows In 24 Hours Amid Senior Execs Departure Controversy",
    "Binance senior execs deny they're resigning over DoJ probe",
    "CZ Says Binance Is Not FTX As Exchange Inflows Near $2 Billion",
    "Binance Facing Leadership Crisis as Top Execs Quit: Should Exchange Users be Worried?",
    "Was Binance to Blame for the Bitcoin Price Plunge Today? Find Out Here.",
    "Binance's CZ Dispels “FUD” Around Leadership Departures",
    "Binance CCO Will not Join the Resignation Spree",
    "Exodus of Senior Managers From Binance ‘No Cause For Concern,’ Says CZ",
    "Binance CEO Calls Reasons Behind Employee Turnover ‘Completely Wrong’",
    "Top Binance Executives Exit Over CEO's Response to DOJ Investigation",
    "Another Binance Exec Resigns Amid US Legal Scrutiny",
    "Top Binance Execs Leave Company Over CZ's Handling of DOJ Investigation: Report",
    "Senior Binance Execs Quit Over CZ's Response to DOJ Probe: Report",
    "Binance's top strategist confirms departure amid reports of US resignations",
    "CZ denies rumors senior Binance executives resigning due to ongoing regulatory challenges",
    "Top Binance Executives Quit",
    "“what justice department investigation?” https://fortune.com/...",
    "@MilkRoadDaily Definitely false, only one this week. They exaggerate everything.",
    "Binance is in full-on turmoil. https://fortune.com/...",
    "Right when we expect things to slow it just gets busy. Not a great look! https://twitter.com/...",
    "$COIN trading at $16.4B market cap https://twitter.com/...",
    "be pretty fun to see SBF and CZ sharing a cell https://twitter.com/... [image]",
    "Hey @cz_binance - 4 or is this legit? https://twitter.com/...",
    "Probably nothing https://twitter.com/...",
    "hahah NOW Patrick quits? https://twitter.com/...",
    "Why can't they just say 4? https://twitter.com/...",
    "14) How did Binance fall apart ? Slowly and then all at once. https://twitter.com/...",
    "Rats, ship https://twitter.com/...",
    "Heading 4 the door https://twitter.com/...",
    "GPT-4 API general availability and deprecation of older models in the Completions API",
    "An AI model deprecation dilemma",
    "GPT-4 API is now generally available to paying customers",
    "OpenAI Releases GPT-4 API, Announces Retirement of Older Models",
    "OpenAI's GPT-4 Language Model Now Available to All Paid API Users",
    "OpenAI announces general availability of GPT-4, depreciation of older models",
    "OpenAI Makes ChatGPT-4 API Publicly Accessible for Developers",
    "OpenAI Upgrades API With GPT-4 and Opens DALL-E and Whisper API Access",
    "GPT-4 API now available to all, as OpenAI goes all-in on chat",
    "OpenAI Announces GPT-4 General Release For Developers",
    "OpenAI announces general availability of GPT-4",
    "OpenAI Expands API Access and Embraces Chat Format for GPT-4",
    "Why OpenAI Expansion Of GPT-4 API Means Apps Will Become More Powerful",
    "OpenAI announces general availability of its GPT-4 API: Here's what it means",
    "OpenAI's GPT-4 is now available to paying developers",
    "Deploying Falcon-7B Into Production",
    "OpenAI opens up GPT-4 to all paying customers",
    "JumpCloud resets admin API keys after unspecified ‘ongoing incident’",
    "OpenAI makes GPT-4 generally available to all paid API customers",
    "GPT-4 cheat sheet: What is GPT-4, and what is it capable of?",
    "GPT-4 API now available to all",
    "Fine-tuning is coming to GPT-4 and GPT-3.5 later this year — huge! https://openai.com/...",
    "GPT-4 API now generally availible",
    "OpenAI Makes GPT-4 Generally Available"
]