[
    "India vs West Indies Schedule",
    "LiveCyclone Biparjoy live: Gujarat CM holds review meeting; 94,000 evacuated",
    "Delhi Police seek cancellation of minor's case vs Brij Bhushan",
    "Is Imran Khan's party finally over?",
    "How to stay safe as Cyclone Biparjoy approaches",
    "'Khul ke khelo': Rishabh Pant's advice for Abhishek Porel",
    "Watch: Meet the chaiwala who works out of an Audi",
    "India does not criminalise sex with a corpse. Should it?",
    "Indian-Irish teenager among 3 killed in Nottingham stabbings",
    "6-day-old infant lies near bodies of parents for 3 days, survives",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "Shopping: Big Discounts & Coupons on Great Products You Can't Miss",
    "AlUla through the eyes of Janhvi Kapoor",
    "Cyclone: Earthquake-prone Kutch faces yet another fury of nature",
    "105 universities sign up for four-year UG programme",
    "03:26Uneasy calm inn Purola, Hindu outfits postpone Mahapanchayat",
    "00:54'Marne do' : Kapil Sharma’s co-actor attempts suicide, GF reacts",
    "00:50Nawazuddin's intimate video with Avneet sparks controversy",
    "UP: Woman, five children charred to death as hut catches fire",
    "$3bn drone deal likely to be announced during PM’s US trip",
    "Cyclone Biparjoy: How are cyclones named?",
    "4 gens of family, including 90-yr-old, booked for rape",
    "US Fed pauses after 15 months, but not done with hikes yet",
    "IPL: Ponting, Ganguly stay with DC; Agarkar to get bigger role",
    "Setalvad was a politician's tool: Guj govt to HC",
    "Fadnavis back in picture as Sena issues fresh ad",
    "21K people affected in first wave of Assam floods",
    "9 killed, 10 injured in bloodiest day of Manipur ethnic clashes",
    "Watch: Ashwin ‘reviews’ TV umpire’s ‘not out’ call in TNPL",
    "Yogi stresses on holistic plan for 'bhayva, divya' Ayodhya",
    "Film producer arrested for peddling cocaine in Telangana",
    "Singer Sharda, the voice behind 'Titli Udi', dead",
    "Times Top10: When celebration turned into a tragedy",
    "WTC: India to start 2023-25 cycle with WI tour",
    "LiveLive: Cyclone Biparjoy to make landfall today; 74k evacuated",
    "Parts of Madhya Pradesh school in hijab row demolished",
    "NEET results: Gadchiroli tribal youth fulfils dream of illiterate parents",
    "Devendra Fadnavis back in picture as Sena issues fresh advertisement",
    "Northeastern states hit by rain; 21,000 people affected in first wave of Assam floods",
    "Senthil Balaji Arrest Live Updates: Court rejects minister's plea seeking to reject 15 days remand",
    "Brawl with restaurant staff in Ajmer; IAS, IPS officers suspended",
    "Rohtak villagers supported by Khap Panchayats block Highway, demand arrest of former WFI chief",
    "When Senthil Balaji was in ADMK, Tamil Nadu CM MK Stalin called him corrupt: BJP",
    "Aamir Khan showers love on team Adipurush",
    "Will Hema Malini attend Karan's wedding?",
    "Netizens are impressed with Ajay's AI images",
    "Why Kareena and Saif are the OG couple",
    "Kundali Bhagya’s Preeta-Karan get stars named after them",
    "Prosenjit to work with THIS director after 14 yrs",
    "Jimit: Was fed up of playing a buffoon",
    "Sonam signs on with a new talent agency",
    "Bollywood celebs and their biggest regrets",
    "Karan Drisha won't move out of Deol family",
    "Kriti on how she transformed into Janaki",
    "Healthy foods to eat with chopsticks",
    "9 signs that indicate you are mentally strong",
    "Model celebrates pride month with nude shots",
    "Crime Patrol overshadowed other roles: Anup",
    "Netizens react to pregnant Aashka's headstand",
    "Exclusive: Are Arjit Taneja and Soundous dating?",
    "10 lovely looks of Priya Bhavani in yellow!",
    "Most Mesmerising Photos Of Madhuri Dixit Nene",
    "Alia steals hearts in crochet top",
    "Rakul turns heads in pink gown",
    "30Saumya's bikini look from Mauritius",
    "20Pics: Gujarat braces for Biparjoy",
    "Anjali Arora radiates style and glamour",
    "Nora wows in royal blue gown",
    "20Bebo looks easy-breezy in co-ord set",
    "30Tamannaah & Kriti stun at ZHZB party",
    "Rhea shares unseen pics with SSR",
    "00:35Sakshi Malik sums up her Maldives vacation like this",
    "'The door locks': Republicans defend storing docus in bathroom",
    "First woman to serve as NYC top cop quits suddenly",
    "US judge pauses Microsoft's Activision buy",
    "Donald Trump calls indictment 'evil and heinous abuse of power'",
    "Looking forward to 'engaging talks' with Biden: PM Modi",
    "US Fed pauses rate hikes after 10 straight increases",
    "EAM Jaishankar, US NSA Sullivan take stock of preparations for PM Modi's visit to Washington",
    "Golden Globes gets new owners as HFPA shutters",
    "The day RTI Act was enacted: Why it remains a landmark decision",
    "'US looks forward to PM Modi's upcoming address to Congress': Congresswoman Sheila Jackson Lee",
    "'The time is now': US lawmaker on defence ties with India",
    "How Cyclone Biparjoy may impact India",
    "In-depth debates required for passing legislations: Lok Sabha speaker Om Birla",
    "Wrestlers protest: Delhi Police files chargesheet against Brij Bhushan Sharan Singh",
    "NEET opposition in TN is political: Dharmendra Pradhan",
    "President nod to try HPSC ex-chief in jobs scam case",
    "Breaking news live updates: Live: Delhi Police file chargesheet against Brij Bhushan",
    "No pre-arrest bail for  Sam D'Souza, co-accused of Sameer Wankhede",
    "Goa outfit wants film on 'Portuguese horror'",
    "Active Covid cases in country dip to 3,001",
    "India's active Covid case tally down to 5,259",
    "India reports 490 new Covid cases in last 24 hours; active caseload dips to 5,707",
    "India reports 535 new Covid cases; active caseload declines to 6,168",
    "Active Covid cases in country dip to 7,104",
    "Active Covid cases in country decrease to 7,623",
    "India logs 174 new Covid-19 cases",
    "Covid-19: India records 237 fresh cases, active caseload declines to 3,502",
    "Active Covid cases in country dip to 4,709",
    "Active Covid cases in country dip to 4,972",
    "03:58Shinde and Fadnavis in new ad but is the damage done?",
    "02:36Cyclone Biparjoy to hit Gujarat with wind speed of 125 kmph",
    "00:54Make Shah Rukh Khan accused in Rs 50 lakh case: PIL",
    "02:34Caught on cam: Two stabbed after Delhi teenagers’ fight turns ugly",
    "01:01'Saw Deepika sitting on Ranveer’s lap on the set of Ram Leela’",
    "03:02Viral Video: Fire breaks out inside Kolkata airport",
    "10​Fitness lessons from \"Sita\" Kriti Sanon​",
    "Can prediabetes be reversed?",
    "How to make a simple dal healthier",
    "10Best white outfits seen on Priyanka Chopra Jonas",
    "Bong beauty Suchitra Sen was way ahead of her time",
    "Best dressed celebs at Madhu-Ira's wedding reception",
    "Lies we tell ourselves to make us feel better",
    "Zodiacs who tend to befriend liars",
    "1110 things to do daily if you don't want to age",
    "10 reasons why Taiwanese women stay young forever",
    "10 nutrients that promise to reduce dark circles",
    "1312 ways to raise a curious child",
    "12 Indian etiquette kid should be taught",
    "Baby names inspired by Indian superheroes",
    "43 Indian curries included in the world's top 10 list",
    "No-soak instant Hummus recipe for weight loss",
    "18 food and drink names and their right pronunciation",
    "Lake cities in India for unforgettable travel experiences",
    "The most spectacular samurai castles of Japan!",
    "Pictures that'll make you want to travel to Goa RIGHT NOW!",
    "Trans beauty queen celebrates pride month with nude shots",
    "Beauty queen found dead inside her home",
    "Miss Influencer Facebook Challenge begins!",
    "Unsure About Your Skincare Routine During Pregnancy?",
    "Bollywood Stars Who Are Making A Fashion Statement In Suits",
    "Easy Dinner Recipe: Crispy Tofu & Noodles",
    "Countries best known for welcoming tourists with open heartTravel",
    "9 signs that indicate you are mentally very strongLifestyle",
    "​12 Indian etiquette every kid should be taught​Lifestyle",
    "10 reasons why Taiwanese women stay young foreverLifestyle",
    "9 signs your relationship is moving too fastLifestyle",
    "Healthy foods to eat with chopsticks (with benefits)Lifestyle",
    "Brilliant tips to keep bananas fresh and prevent browning in SummersFood",
    "13 vitamin B12-rich foods for brain and nerve healthFood",
    "10:06Watch: How to make Multani Moth Kachori",
    "02:43Watch: How to make Gulab Jamun Panna Cotta",
    "06:16Watch: How to make Gluten-Free Bajra Pizza",
    "'Bindaas khelo, khul ke khelo': Rishabh Pant's advice for Abhishek Porel",
    "WTC: India to start 2023-25 cycle with WI tour, will also play Aus, Eng",
    "Live Score, One-off Test, Day 2: Bangladesh vs Afghanistan",
    "Indonesia Open: Kidambi beats Sen in all-India duel",
    "09:31Another WTC Final, another loss for Team India",
    "Delhi Police files chargesheet against WFI chief Brij Bhushan",
    "Ashes: England’s 'Bazball' approach gets ultimate test vs Australia",
    "Kyrgios reveals he ended up in psychiatric ward during Wimbledon in 2019",
    "Certain brands 'cannot bid' as BCCI invites tender for lead sponsor",
    "Croatia stun hosts Netherlands to reach Nations League final",
    "There is an aura around Dhoni when he walks into team room: Conway",
    "In Pics - Croatia reach Nations League final",
    "Wimbledon prize money increased to record 44.7 million pounds",
    "'Oil prices may see upward trend in 2nd half of year'",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Shell to exit Pakistan unit with sale of shares",
    "Tata Steel inks deal to cut carbon emissions with Germany's SMS group",
    "BSE sells 4.5% stake in CDSL for Rs 468 crore",
    "Home purchases reduce during festivals: Report",
    "With return to office, TCS staff gets less time to upskill",
    "India well placed to emerge as green hydrogen hub: Hardeep Puri",
    "Wholesale inflation shrinks 3.5% in May, lowest in 8 years",
    "Bill Gates to meet Chinese President Xi on June 16",
    "May WPI inflation hits over 7-year low of (-) 3.48% on declining fuel, manufactured items prices",
    "Sensex, Nifty rise on gains in metal, commodity stocks",
    "Shaktikanta Das wins international 'Governor of the Year' award",
    "7Things your dad said in your childhood!",
    "10Weight loss: ‘I learned to swim at age 41'",
    "109 signs that indicate you are mentally strong",
    "13How to make a simple dal healthier",
    "10How Ayesha Jhulka looks so young at 50!",
    "11Top 10 healthiest variety of mangoes",
    "Indian American Taral Patel running for county commissioner in Texas",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "iPhone Production in India",
    "Terms of Use and Grievance Redressal Policy",
    "Kerala Plus One Result 2023",
    "Bihar Police Recruitment 2023"
]