[
    "India vs West Indies Schedule",
    "HC: No rationale to issue lookout notices ‘left, right & centre’",
    "Tremors in parts of Delhi-NCR as 5.4-quake jolts J&K",
    "What it will take for Ukraine's counterattack to be a 'success'",
    "Mumbai murder: Chopped, cooked body parts hamper probe",
    "Deportation fears: Canada reassures 'defrauded' Indian students",
    "WTC Final Poll results: Fans blame Ashwin's exclusion, IPL for defeat",
    "After football, golf, F1, is tennis Saudi's next big bet?",
    "Live: Cyclone Biparjoy may cause extensive damage, warns IMD",
    "Gujarat riots: Mumbai court acquits two in Best Bakery case",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "Shopping: Big Discounts & Coupons on Great Products You Can't Miss",
    "AlUla through the eyes of Janhvi Kapoor",
    "Massive fire on Pune-Mumbai Expressway: 3 dead, 2 injured",
    "Waves get stronger along coast as Cyclone Biparjoy nears",
    "00:50Philippines: Mayon Volcano Erupts, families start to leave homes",
    "01:01Kiara Advani's 'wedding' pic with Kartik Aaryan sparks controversy",
    "00:52OMG! 29-yr-old actress DIES after falling from stairs",
    "AI grounds 2 pilots for female friend in cockpit, 2nd such case",
    "PM attacks Lalu, Mamata, says his govt has safeguard against their rate-cards",
    "Watch: What is the secret Digital China strategy all about?",
    "At Rs 14,000, Delhi-Mumbai airfares among steepest",
    "Woman kills mother in Bengaluru, stuffs body in trolley bag",
    "Jitan Ram Manjhi's son resigns from Nitish Kumar's cabinet",
    "Patole demands dismissal of Shinde govt over alleged lathi charge on Warkaris",
    "PM Modi distributes over 70k appointment letters at Rozgar Mela",
    "'Outright lie': Centre rejects Dorsey's claim that govt 'pressurised' Twitter",
    "Why this village churns out generations of well climbers",
    "Live: Toll from Russian strike on Ukraine city rises to six",
    "100s bid adieu to autistic boy, 11, killed by stray dogs in Kerala",
    "NEET Result 2023 live updates",
    "In UP, burqa-clad woman buys liquor, threatened with beheading",
    "Man killed in Manipur as governor visits relief camp in district",
    "How to know if your forgetfulness is no longer normal",
    "In UP's Muzaffarnagar, burqa-clad woman buys liquor, threatened with beheading; 3 held",
    "Parents donate organs of 3-yr-old brain-dead son, save four lives",
    "Kolhapur man arrested for social media status on Tipu Sultan, calling him ‘India’s king’",
    "In sensitive times, even WhatsApp DP can invite action: Legal experts",
    "Bhopal's Satpura Bhawan fire: Critical records burnt to ashes, what may be lost",
    "Powerful 5.7-magnitude earthquake strikes J&K, sends tremors through Delhi-NCR",
    "Enjoyable escapade at Mumbai's Juhu beach turns tragic as kids drown",
    "Jailed don Khan Mubarak, known for filmy acts, dies of 'dehydration'",
    "Latest news updates from cities",
    "Paps ask Sonakshi, Zaheer 'shadi kab hai'",
    "When Salman said Govinda is better than Khans",
    "Aamir, Zoya to collaborate for a project?",
    "Bollywood films accused of copying content",
    "Check out major controversies of Bigg Boss OTT",
    "South actor Kazan Khan passes away",
    "Has 'Adipurush' already crossed 100 crore?",
    "Sunny gets on the dance floor at Karan's sangeet",
    "Bollywood actors who play football",
    "Fans compare Suhana to SRK as she poses with fan",
    "Abhishek dances on Jhumma Chumma: WATCH",
    "5 signs of deteriorating kidney health",
    "12 Indian etiquette kid should be taught",
    "Miss World 2023 to be hosted in INDIA!",
    "Sana Khan's unmissable pregnancy glow in abayas",
    "Barun Sobti on quitting Iss Pyaar...Doon in 2012",
    "Rakhi says iconic dialogue, 'Meri clone ban sakti hai...'",
    "Ragini Dwivedi's saree magic",
    "Pictures of ‘ProjectK’ actress Disha Patani",
    "Tamannaah spills the sass in new look",
    "Rakul's fusion fashion in shimmery outfit",
    "Kriti doles out ethnic inspiration",
    "391Alaya F's bewitching pictures",
    "50For Raveena age is just a number!",
    "45Radhika sets the internet ablaze",
    "25Pics: Krishna Bhatt's wedding",
    "Tabu stuns in a halter neck wrap dress",
    "30Inside pics: Madhu and Ira’s wedding",
    "Pichaikkaran 2Pichaikkaran 2 MovieCritic Rating2.5",
    "00:31WATCH: Sara Ali Khan runs towards her car ignoring paps, netizens get confused",
    "US military says helicopter accident in north Syria left 22 American troops injured",
    "JPMorgan to pay $290 million to settle with Epstein victims",
    "Economic ties at heart of India, US strategic partnership: Secretary of State Antony Blinken",
    "Blinken says too soon to say where Ukraine counteroffensive is going",
    "The Great Grift: How billions in Covid-19 relief aid was stolen or wasted",
    "Top US-China exchanges since Biden took office",
    "Trump prepares for court appearance as 1st ex-president to face federal criminal charges",
    "To check China influence? US to rejoin Unesco",
    "Donald Trump escalates efforts to undermine criminal case",
    "2 terrorists gunned down near LoC in J&K's Kupwara",
    "AIADMK passes resolution against Tamil Nadu BJP chief K Annamalai",
    "5.4-magnitude earthquake hits Jammu & Kashmir's Doda, tremors felt in Delhi-NCR",
    "India logs 80 fresh Covid cases",
    "Bengal rural polls: BJP fights to retain main opposition space amid Cong-Left resurgence",
    "Twitter violated laws between 2020-22: Amit Malviya",
    "Can innovation make cancer treatment more affordable?",
    "National Cancer Survivors Day: The role of palliative care in managing this condition",
    "26 years of Uphaar cinema tragedy: 15 unknown facts",
    "PM Modi attacks Lalu, Mamata, says his govt has safeguard against their rate-cards",
    "India's most beautiful temples!",
    "Active Covid cases in country dip to 3,001",
    "India's active Covid case tally down to 5,259",
    "India reports 490 new Covid cases in last 24 hours; active caseload dips to 5,707",
    "India reports 535 new Covid cases; active caseload declines to 6,168",
    "Active Covid cases in country dip to 7,104",
    "Active Covid cases in country decrease to 7,623",
    "India logs 174 new Covid-19 cases",
    "Covid-19: India records 237 fresh cases, active caseload declines to 3,502",
    "Active Covid cases in country dip to 4,709",
    "Active Covid cases in country dip to 4,972",
    "01:30Enjoyable escapade at Mumbai's Juhu beach turns tragic as kids drown",
    "00:45Powerful 5.7-magnitude earthquake strikes J&K, sends tremors through Delhi-NCR",
    "00:51'Grace is 0 … ': Kajol gets trolled for her walking style",
    "02:00Nana Patole demands dismissal of Shinde govt over alleged lathi charge on Warkaris",
    "01:09Tamannaah Bhatia's bold photos in white bralette",
    "00:31Sara Ali Khan runs towards her car, fans confused",
    "Shenaz Treasury diagnosed with hypothyroidism",
    "Disha Patani is QUEEN of martial arts",
    "Is your forgetfulness no longer normal?",
    "India Couture Week 2023 to kickstart from July 25",
    "Models call out show organiser for Vanshika Chopra's death on ramp",
    "Why is diamond considered to be unlucky for some people?",
    "Your daily horoscope: 14th June, 2023",
    "Types of toxic people that you meet every day",
    "Why should you practice mindfulness",
    "10Drink this juice daily for a Glowing Skin",
    "Wedding skin prep for brides-to-be",
    "Remedies for quick solutions to avoid skin problems this summer",
    "Mobile game addiction is hurting your child!",
    "How 4 kids survived in Amazon for 40 days!",
    "11 ways to master ​lazy parenting",
    "106 benefits of eating Mishri during summer",
    "Disha Patani eats 3-4 meals a day",
    "5 edible flowers and their culinary uses",
    "Inside world’s largest rainforests",
    "Port Blair: Ultimate guide to the Andaman Islands",
    "This road in Kerala reopens, to give access to all prominent tourist places",
    "Strela Luwang donates money to rebuild Manipur",
    "Hurry and VOTE for India's Pragnya Ayyagari",
    "The Orgasm Handbook: Tips For Mind-Blowing Climaxes",
    "9 Ways To Enjoy Salzburg On A Budget",
    "Lizzo Silver Gaurav Gupta Outfit",
    "13 vitamin B12-rich foods for brain and nerve healthFood",
    "​12 Indian etiquette every kid should be taught​Lifestyle",
    "10 reasons why Taiwanese women stay young foreverLifestyle",
    "Is coconut water safe for diabetics?Food",
    "8 desi Indian foods to help stay active and fitFood",
    "#VarunLav: Stylish engagement pictures of Telugu stars Varun Tej and Lavanya TripathiLifestyle",
    "Best dressed celebs at Madhu Mantena-Ira Trivedi's wedding receptionLifestyle",
    "10 times Erica Fernandes rocked saris better than any Bollywood divaLifestyle",
    "01:56Watch: How to make Murgh Pista",
    "00:01Watch: How to make Appam",
    "04:02Watch: How to make Kosha Mangsho",
    "Only Virat Kohli can reveal why he left Test captaincy: Sourav Ganguly",
    "Transition pangs: No 'A' tours, Indian cricket feeder line dries up",
    "Djokovic reclaims no.1 spot, Nadal out of top 100",
    "Indonesia Open: Sindhu, Prannoy make pre-quarters",
    "Denver Nuggets beat Miami Heat to win maiden NBA title",
    "Ben Stokes' England won't tone down 'Bazball' approach",
    "09:31Another WTC Final, another loss for Team India",
    "WTC Final Poll results: Fans blame Ashwin's exclusion, IPL for India's defeat",
    "With Indian middle-order batters past their prime, is it time for transition?",
    "WTC Final Report Card: What Australia did right and India got wrong",
    "In Pics: Time for Team India to bite the transition bullet?",
    "Australia head coach credits 'subcontinent journey' for WTC triumph",
    "Jokic gives Serbia another sports hero to celebrate",
    "Financial aid for Pakistan hockey ahead of Champions Trophy in Chennai",
    "Mbappe not to renew PSG contract when it ends in 2024",
    "Reliance Industries tops India Inc in Forbes Global 2000 list for 2023",
    "What easing retail inflation means for economy",
    "Bajaj Housing Finance offers home loans with 40-year tenure",
    "RBI norms on guarantee may hit unsecured loans: Crisil",
    "MCA calls meetings on website snags",
    "Egyptian minister says no credit line has been opened with India",
    "Private life insurers grow 10% in May, LIC shrinks 6%",
    "Market benchmarks rally in early trade",
    "'Investing in Indian startups for long run'",
    "Residential realty prices increase in Mumbai, Delhi",
    "Retail inflation dips to 25-month low in May as food prices ease",
    "UBS completes takeover of Credit Suisse",
    "Centre imposes stock limit on wheat to check prices",
    "Retail inflation eases further to 4.25% in May from 4.7% in April",
    "10Natural remedies to reverse balding",
    "10Signs your relationship is moving too fast",
    "1211 ways to master ​lazy parenting",
    "6\"Don't pull an all-nighter before exam\"",
    "1110 tips to make your hair strong",
    "1110 summer inspired names for babies",
    "Indian American Taral Patel running for county commissioner in Texas",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Sundar Pichai on Vision Pro",
    "Terms of Use and Grievance Redressal Policy",
    "Beautiful Temples In India",
    "Bihar Police Recruitment 2023"
]