[
    "ICC World Cup 2023 Schedule",
    "West Bengal Panchayat Election",
    "Take 'public action' against anti-India radicals, UK told",
    "West Bengal panchayat election live: Polling under way",
    "Zuckerberg's Threads can take on Twitter, but what after that?",
    "EC giving Rahul Gandhi time to seek legal remedy",
    "MLC celebrates launch with NYSE closing bell ceremony",
    "Indian wrestling suffers with no clarity on trial dates for Asian Games",
    "How opium linked India and China",
    "Adani company's 6,000kg iron bridge 'stolen' from Mumbai, 4 held",
    "Can govt have unlimited discretion to label what is fake & misleading: HC",
    "Know why data science is a promising career",
    "Shopping: Big Discounts & Coupons on Great Products You Can't Miss",
    "Soon, India may have 24x7 virtual courts deciding cases",
    "Balasore tragedy: CBI arrests 3 railway staffers, invokes culpable homicide",
    "Rahul Gandhi's offence serious, affects a large population: Gujarat HC",
    "03:17Musk vs Zuckerberg: Twitter threatens to sue Meta over Threads",
    "02:02Sameer Wankhede-Shah Rukh Khan chats: New UPDATE",
    "02:04Pak actress' comment on SRK sparks outrage: 'He Isn't Handsome...'",
    "No state in top 5 grades of school performance index",
    "Dutch government collapses over immigration policy",
    "Who moved my tomato? McD's stares at shortage",
    "Student killed in Manipur crossfire, sparks protests",
    "Cong mantri says can take law into own hands to oust Modi govt",
    "NCP vs NCP: Ajit again stakes claim to party name, symbol",
    "BJP names poll in-charges of four states",
    "Law panel: Not linked to UCC WhatsApp messages doing rounds",
    "Rahul Gandhi offence serious, affects a large population: Gujarat HC",
    "Wary of reel hunters, Kedarnath mulls ban on mobile phones",
    "U-turn complete: Rs 2cr relief for Bihar hooch deaths 'on the way'",
    "Close shave for 100 as 5 train coaches catch fire",
    "US economy adds 209,000 jobs as hiring slows",
    "3rd Test: Moeen Ali's strikes revive England's Ashes hopes",
    "US lawmakers, PIOs condemn consulate arson",
    "New Canadian scheme for H-1B visa holders may appeal to some Indians",
    "West Bengal Panchayat Elections",
    "Falaknuma Express Fire Accident",
    "Maharashtra Political Crisis",
    "England vs Australia Live Score",
    "Rahul Gandhi Defamation Case",
    "Breathe! Delhi may get year’s first ‘good’ air day tomorrow",
    "Happy landing! Wait time in aircraft to be cut by 10 min",
    "It's 10% water cut but some Mumbai areas feel bigger pinch",
    "Union minister Dharmendra Pradhan stresses on construction of Paika Memorial at Barunei",
    "AAP to launch 'Bijli Aandolan' in Haryana from July 9",
    "Supreme Court transfers Chhattisgarh HC Judge P Sam Koshy to Telangana HC on his request",
    "Indian Coast Guard evacuates a critically ill 48-year-old man, rescues 5 fishermen",
    "Why are American teachers visiting Delhi government schools?",
    "Love affair turns tragic as man kills self, woman ends life 3 days after her wedding",
    "Latest news updates from cities",
    "Major League Cricket celebrates launch with NYSE closing bell ceremony",
    "Knight Riders aim to replicate IPL success in the US",
    "New Zealand players in Major League Cricket 2023",
    "South African players in Major League Cricket 2023",
    "Faf du Plessis - from Chennai Super Kings to Texas Super Kings",
    "MLC gives Shane Watson maiden break as head coach",
    "Major League Cricket 2023 set for a glittering opening night",
    "Kieron Pollard: From Mumbai Indians star to leading MI New York",
    "Alia's fun video with Gal Gadot & Jamie Dornan",
    "Kajol: Magic of 'DDLJ' cannot be replicated",
    "Ameesha: Content on OTT is full of homosexuality",
    "Actresses who wore the most expensive outfits",
    "BBOTT2: Jad on Pooja: Can someone shut her down",
    "Vivek takes an indirect dig at Prabhas' Salaar",
    "Jawan: Trailer runtime, certification revealed",
    "Shehnaaz Gill terms Alia as a heartbreaker",
    "Sizzling pics of the sultry Ameesha Patel",
    "Ameesha: Actresses snatched films under my nose",
    "Alia Bhatt is okay with being called a clown",
    "Meet Mahesh Babu's beautiful daughter",
    "12 foods that can increase your stamina",
    "Apply now for LIVA Miss Diva 2023",
    "Surbhi's blouses in Naagin 5 were a trendsetter",
    "BBOTT2: Jad breaks down in tears, packs his bags",
    "Rakhi breaks 5 eggs to get a good hubby",
    "Komal Thacker's bewitching photos",
    "Mouni Roy's iconic saree moments",
    "20Katrina and Bhumi make heads turn",
    "Alia serves boss babe vibes in a suit",
    "Dimple's pre-draped saree is pure perfection",
    "30Gaurav Gupta’s couture show at Paris",
    "30Aditi channels her inner Audrey",
    "B’day Special: MS Dhoni’s car and bikes",
    "Madhuri is a sight to behold in saree",
    "Mouni Roy stuns in midi skirt & red top",
    "40Pics: Aamna’s monochrome style",
    "03:14Hilarious! Rakhi Sawant breaks eggs on her head to get new husband",
    "02:55Sara Ali Khan ditches car, takes auto rickshaw ride to avoid Mumbai traffic",
    "The US will provide cluster bombs to Ukraine and defends the delivery of the controversial weapon",
    "US to give cluster munitions to Ukraine, Biden administration says",
    "​US set to destroy the last of its once-vast chemical weapons arsenal",
    "Shooter who killed 23 at Texas Walmart gets 90 life terms",
    "Twitter threatens legal action against Meta over Threads",
    "US to give Ukraine weapons banned by many of its allies",
    "US has destroyed all its chemical weapons: Biden",
    "World Bank President Ajay Banga to travel to India next week to attend G20 meeting",
    "Man dozes off on bench in C'garh hospital, gets locked up for night",
    "Over Rs 7,000 cr provided under Nirbhaya fund so far: Centre",
    "SC stays HC order for fresh hiring of 32k teachers in West Bengal",
    "Congress worker killed day before Bengal panchayat polls",
    "HC nixes BJP opposition leader Suvendu Adhikari's plea on poll-day curbs",
    "5 Oppn MLAs suspended for ruckus over porn in Tripura House",
    "Graft Cong's biggest ideology: PM Modi in C'garh",
    "Infra linked to social justice: PM Modi",
    "Man, who fell into 300m deep gorge, rescued",
    "HC issues fresh summons to BBC in defamation case over Modi documentary",
    "Shillong thana attacked after drunken brawl",
    "SC to hear contempt plea against UP priest",
    "02:07Sidharth remembers Captain Vikram Batra on his 24th death anniv",
    "05:28Horoscope today, July 8, 2023: Here are the astrological predictions for your zodiac signs",
    "02:05Did you know Dharmendra booked entire nursing home for Hema Malini during Esha Deol's birth?",
    "Can You Spot the Hidden Cat in 10 Seconds?",
    "Barbie: How to get feet like Margot Robbie",
    "Harsh realities of male vs. female depression",
    "10Bridal outfit inspiration from Bollywood brides in 2023",
    "Stylish pictures of Yumna Zaidi-Wahaj Ali",
    "5 times Tabu dressed better than any other 51-year-old",
    "6These zodiacs never give up",
    "Daily horoscope: 8th July 2023",
    "6 LUCKY signs on your PALM you must know",
    "Do smoking and drinking lead to hair loss?",
    "Meet Mahesh Babu's beautiful daughter Sitara Ghattamaneni",
    "Here's how to slow down premature hair greying",
    "11​Middle names of FRIENDS characters​",
    "Top 10 baby names in the US",
    "No. 1 secret to raise happy, successful kids",
    "138 Indian breads in the list of best flatbreads in the world",
    "Common mistakes that ruin baking for us",
    "This tomato seed variety sells for INR 3 crore per kg!",
    "REVEALED: World’s most liveable cities for 2023",
    "Going on a babymoon in India",
    "Whistling Village, where everyone has a tune for their name",
    "108 inspirational Japanese mantras from Ikigai",
    "Huma Qureshi's favourite books and authors",
    "Micro review: ‘Too Late’ by Colleen Hoover",
    "00:57Celebrity book recommendations for July 2023",
    "Rhea Chakraborty's fitness secrets for a curvy figure",
    "Meet Mahesh Babu's beautiful daughter Sitara GhattamaneniLifestyle",
    "12 foods that can increase your staminaLifestyle",
    "12 lesser-known desserts of IndiaFood",
    "10 youngest countries in the world!Travel",
    "10 charming pictures of Krithi ShettyEntertainment",
    "16 types of Pakodas from across India that are a must have in MonsoonFood",
    "High protein snacks that are low in caloriesLifestyle",
    "RANKED: Top 6 zodiac signs who make good parentsLifestyle",
    "00:58Watch: How to make Tawa Mutton Biryani",
    "01:49Watch: How to make Millet Dahi Kebab",
    "07:00Watch: How to make Badam Chicken Handi",
    "3rd Test: Moeen Ali's strikes revive England's Ashes hopes at Headingley",
    "Carlos Alcaraz cruises into Wimbledon third round",
    "Ashwin sends birthday wishes to MS Dhoni with a 'disclaimer'",
    "Delhi court summons Brij Bhushan Sharan Singh on July 18",
    "Watch: Siraj gifts his bat and shoes to young cricketer in Barbados",
    "01:45Andy Murray's best shots on grass court",
    "02:41Best dives by players on grass court",
    "Retired players in overseas leagues: Office-bearers to take final call",
    "Former India captain Sourav Ganguly turns 51",
    "Media rights deal for home bilaterals will be done by August-end: Jay Shah",
    "Sri Lanka beat West Indies in World Cup qualifier dead rubber",
    "Tamim takes U-turn, withdraws retirement after meeting Bangladesh PM",
    "MS Dhoni turns 42: A look at career, accomplishments of 'captain cool'",
    "Wimbledon: Former champion Petra Kvitova cruises into the third round",
    "'Grass courts at Wimbledon remain grippy despite high-profile tumbles'",
    "Apple cruises to $3tn on iSequels, not iDeas",
    "India best-performing nation in South Asian region in terms of trade facilitation: UNESCAP",
    "Ant Group fined $985 million by Chinese regulators",
    "'Reliance Retail independently valued at $92-96 billion'",
    "HDFC Bank to replace HDFC Ltd on MSCI indexes",
    "Indian Oil Corp to raise $2.7 billion through share sale",
    "Pay Rs 380cr to Maran: SC to SpiceJet",
    "Reliance Retail to buy back Rs 1k cr shares to hold 100%",
    "IOC's board clears Rs 22k cr rights issue",
    "Vedanta to take over Foxconn chip JV from holding company",
    "Sensex tanks 505 points, Nifty ends lower at 19,330 on profit-booking after record rally",
    "Forex reserves rise by $1.85 billion to $595.05 billion",
    "IMF to talk to Pakistan parties including Imran Khan's PTI on bailout deal",
    "9Why green chilli has become so expensive",
    "10High protein snacks that are low in calories",
    "11These dog breeds stink the most!",
    "14When you are the problem, not your kid​",
    "6Zodiacs which are the most pessimistic",
    "10Konkona has the best sari collection",
    "Indian American Taral Patel running for county commissioner in Texas",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Linda Yaccarino about Threads App",
    "Realme Narzo 60 VS Narzo 60 Pro",
    "Smart TV Useful Tips and Tricks",
    "Nothing Ear 2 Black Colour Variant",
    "Terms of Use and Grievance Redressal Policy",
    "Food Increase Your Stamina",
    "West Bengal Panchayat Election 2023",
    "PM Modi Uttar Pradesh Visit",
    "Rahul Gandhi Defamation Case Verdict",
    "TS Inter Supplymentary Results",
    "Mithun Chakraborty Death News"
]