[
    "CBI books Aryan Khan's case officer Sameer Wankhede for demanding Rs 25 crore bribe",
    "Friend in cockpit: DGCA fines Air India; suspends pilot's licence for 3 months",
    "Does India gain anything by hosting summits like SCO?",
    "Retail inflation declines to 18-month low of 4.7% in April; IIP up 1.1%",
    "MI vs GT Live: Rohit, Ishan off to a fast start",
    "Karnataka polls: BJP sees silver lining in last-minute voter surge",
    "Another NEET aspirant hangs self in Kota, blames study-related stress in suicide note",
    "Was allowing Pak unrest part of army's dangerous game?",
    "Shopping: Coolest Offers on Most Sold Electronics & Appliances",
    "Live: Speaker resigns amid speculations of cabinet reshuffle in Odisha",
    "19 smartphones you can download Android 14 on right now",
    "Live: Imran Khan gets blanket relief from arrest till May 15",
    "Google finds the bug that showed WhatsApp accessing Mic",
    "Live: IMD Kolkata issues 3-day red alert for fishermen",
    "Google AI search vs Bard chatbot: How the two differ",
    "Karnataka polls: 'Both Congress and BJP have approached JD(S)'",
    "Adani-Hindenburg row: Sebi seeks more time for probe",
    "K'taka: BJP & Cong mount backroom operations to woo JD(S)",
    "Caught on cam: Bouncers brutally thrash a man at mall",
    "Maternal uncle shares sketch of Raghav Chadha's outfit",
    "Give Hindu woman security to pray at mosque, HC tells cops",
    "02:52Uddhav Thackeray urges speaker to decide on disqualification of 16 MLAs",
    "00:46Priyanka reveals she is 'fine' with having s*x on the first date",
    "00:52Bikini row and JNU incident: Deepika breaks silence",
    "07:02'The Kerala Story': 'This film must be shown in all parts of country', say UP Ministers",
    "02:38LG vs AAP government tussle: How the power struggle impacted Delhi",
    "Court allows carbon-dating of 'Shivling' at Gyanvapi mosque",
    "Pakistan demands neutral WC venues in row with India",
    "What SC verdict means for Kejriwal vs Modi tussle",
    "Why Maharashtra SC judgment is 65:35 in Uddhav Thackeray's favour",
    "Do you want a right to repair your mobile – cheap and fast?",
    "CBSE announces class 10th and class 12th board exam results",
    "BWF puts interim ban on new 'unplayable' spin serve",
    "SC issues notice to Bengal govt over ban on 'The Kerala Story'",
    "Atiq’s lawyer handled his money, passed it on to Shaista, claim police",
    "Here are all IPL playoffs possibilities in 10 points",
    "In TN, man cons pal of Rs 2cr claiming to talk to Sai Baba's soul",
    "​Alzheimer’s disease stages and risk factors",
    "Eknath Shinde vs Uddhav Thackeray",
    "Karnataka Election Result Date",
    "00:28Man climbs a mobile tower, creates ruckus in Moradabad",
    "Viral: Wife thrashes her alcoholic husband in Mathura",
    "Shocking! 50 kg donation box stolen from Jain temple in Jaipur",
    "​Types of vehicle number plates in India and their meaning",
    "SUVs with 200 mm+ ground clearance under Rs 20 lakh: Tata Nexon to Mahindra Thar",
    "Russia-Ukraine war: 10 car brands that have left Russia since Ukraine conflict began in 2022",
    "CBSE Board Results 2023: Twitter abuzz with memes after CBSE exam results",
    "CBSE Results 2023: 93% in 10th, 87% in 12th declared pass; supplementary exams in July",
    "CGPSC PCS 2023 result announced on psc.cg.gov.in; direct link",
    "Live: Parineeti-Raghav's engagement venue details revealed",
    "PeeCee is okay with having sex on first date",
    "Review: Dahaad Season 1 - 3.5/5",
    "Latest OTT releases for your binge watch list",
    "Jennifer, Asit's controversy to Ashneer getting booked: Top TV news",
    "Guardians of the Galaxy worldwide BO report",
    "Salman Khan treats fans with a dapper photo",
    "Parineeti-Raghav's engagement guest list",
    "Revisiting Mira Rajput's love for Indian wear",
    "Palak on not following her mother's footsteps",
    "Did Alia copy DP's Cannes look?",
    "Virtual tour of UK PM Rishi Sunak’s properties",
    "Madhubala was ahead of her time in fashion",
    "Nandini Gupta crowned Miss India 2023",
    "Siddharth Nigam buys a new house",
    "Shivya Pathania turns the heat in a red bikini",
    "Taarak's Jennifer accuses Asit Modi of sexual harassment",
    "9 Cutest Pics of Harnaaz Sandhu",
    "Uber-Glamorous Pictures of Amruta Khanvilkar",
    "20Vinny Arora's weight loss in pictures",
    "20#WorldView: Pictures of the week",
    "Yami Gautam stuns in saree",
    "Pics: Shama Sikander's stylish looks",
    "Newest moms of Bollywood in pictures",
    "Bikini-clad Esha Gupta turns up heat",
    "Parineeti’s house lights up, see pics",
    "Meera Nandan's saree looks in pictures",
    "Gauahar and Zaid blessed with a boy",
    "The Kerala StoryCritic Rating3.0",
    "'Mini Neptune’ outside of our solar system captured by James Webb Space telescope",
    "Trivandrum triumphs in CBSE Class 10 results with highest pass percentage in 2023",
    "Voice-over artist Akansha Sharma's hilarious mimicry turns emotional song into a chuckle fest!",
    "Capturing the moon: A detailed Gigapixel image by Andrew McCarthy",
    "Viral Video: Curious Black Bear attempts to open Mercedes car door",
    "Hajmola Mocktail goes viral as it gets used for making mouth sizzling",
    "00:58Mahima Chaudhry’s daughter Ariana gets compared with Aaradhya",
    "00:46OMG! Priyanka Chopra reveals she is 'fine' with having s*x on the first date",
    "INDIAN PREMIER LEAGUE 2023",
    "MI vs GT Live: Rashid gets Rohit, Ishan in same over straight after powerplay",
    "'Jaiswal is knocking down Team India door with incredible performances'",
    "What Graeme Smith has observed about MS Dhoni",
    "Yashasvi Jaiswal: 'Routine & process' is his 'thumb rule'",
    "IPL Live Score: Mumbai Indians vs Gujarat Titans",
    "IPL 2023: All playoffs probabilities in 10 points",
    "6Royal Challengers Bangalore",
    "Mudassachem: Goa College of Agriculture set to celebrate millets, mango and music",
    "Two minor tribal girls gang-raped in Tripura",
    "5-year-old raped in Madhya Pradesh's Sidhi district; accused arrested",
    "Kerala doctor Vandana Das murder: Medicos intensify protests",
    "Tragic: Electrocution claims lives of 4 elephants in Andhra Pradesh",
    "BJP alleges rice scam in Chhattisgarh, demands CM’s resignation",
    "9Everything about veteran actress Sudha Chandran",
    "10How to know if mango is ripened with chemicals",
    "7Too much chia seeds can harm you!",
    "7Zodiac signs who are perfect husband material!",
    "7​Undiagnosed hypertension has THESE SILENT symptoms; know them​",
    "6Samantha's 'Shaakuntalam': A cinematic journey from box-office disaster to OTT redemption",
    "Weekly News: End to COVID emergency & more",
    "​Stages and risk of Alzheimer’s disease",
    "5 tastes in mouth signaling health problems",
    "Maternal uncle shares a sketch of Raghav Chadha's engagement outfit",
    "Meet Shloka Ambani's elegant mother Mona Mehta",
    "Beyoncé kicks off Renaissance tour in a bold catsuit",
    "109 best pieces of marriage advice I have ever heard",
    "My husband married me for my money",
    "Ways to test if your fiance will be an ideal partner",
    "How to glow like Nita Ambani in 10 steps",
    "This Ancient ayurvedic Ubtan recipe promises glowing skin in 7 days",
    "10 FOODS which are super BAD for the skin",
    "11ChatGPT lists the popular Hindi baby names",
    "What to Write in a Mother's Day Card",
    "​Mother's Day gift ideas by numerology expert",
    "3Why Baking Soda and Turmeric shouldn't be combined",
    "Urfi Javed’s love for Chai is so relatable",
    "14 best classic summer cocktails",
    "Exploring the bright and dark side of Coorg’s Dubare Elephant Camp",
    "​10 camping destinations near Delhi for the weekend​",
    "Planning a camping trip…Here’s what you need to pack",
    "Model passes away in a tragic horse-riding accident",
    "Watch out for Miss India '23 finale telecast",
    "Miss Universe Pia Wurtzbach hitched for life",
    "Prowling Is The New Toxic Dating Trend",
    "#BeautifulIndians:  Season 2 Of Femina Mamaearth",
    "12 Party Hairstyles For Girls To Rock Any Occasion",
    "Pics that prove Madhubala was way ahead of her time in fashionLifestyle",
    "12 habits of fathers who raise confident kidsLifestyle",
    "10 fittest beauty queens of IndiaLifestyle",
    "Amala Paul's breathtaking saree looks every Bong girl can copyEntertainment",
    "5 foods you should never combine with mangoLifestyle",
    "​6 foods you should avoid combining with curd​Lifestyle",
    "11 foods that have more iron than spinachFood",
    "Inside Parineeti Chopra’s home in MumbaiLifestyle",
    "00:58Mahima Chaudhry’s daughter gets compared with Aaradhya",
    "03:35Ban on 'The Kerala Story': SC issues notice to West Bengal and Tamil Nadu govt",
    "01:17'Kitna kamina hai', says Urfi Javed to underprivileged kids",
    "00:57When Shah Rukh was SCOLDED by Imran Khan!",
    "12Movies rejected by Aishwarya Rai Bachchan",
    "9 desi looks approved by Kriti Sanon that are perfect for weddings",
    "Kriti Sanon's mesmerising saree pics",
    "The Kerala Story - What's the REAL story behind this brouhaha? - ETimes Explainer",
    "Just Mohabbat’s Harsh wife Karishma blessed with a baby girl",
    "Anjum Fakih: My dad doesn't like me wearing skimpy clothes",
    "Would like to play the lead role in future: Mukund from YRKKH",
    "Asit Modi calls Jennifer's allegations baseless",
    "11Amala Paul's breathtaking saree looks",
    "Shriya Saran’s red carpet looks",
    "Srinidhi Shetty's elegant lehenga choices",
    "Arijit Singh: Being reclusive helps me stay focused",
    "'Currents is a crossover between my Indian and Western identities'",
    "Akul's music to showcase The Great Khali's journey",
    "Art meets sustainability: Israeli and Indian artists repurpose old records",
    "Israel marks independence day with dance and music",
    "LiveMI vs GT Live: Rohit, Ishan off to a fast start after Gujarat opt to bowl",
    "World Boxing C'ships: Hussamuddin, Deepak settle for bronze medals",
    "Pics - Top 5: Players with the most ducks in IPL history",
    "2nd ODI Live Score: Ireland vs Bangladesh",
    "Pakistan demands neutral ODI World Cup venues in row with India",
    "01:14IPL 2023: Desperate LSG aim for big win against SRH",
    "'With Hardik as captain, you can expect new faces in India's T20 WC squad'",
    "Wrestlers' Protest Live: Police record statement of Brij Bhushan",
    "Oppo’s chip ‘experiment’ comes to an end",
    "Google Pixel Fold reportedly cannot be completely unfolded to lay flat",
    "Facebook parent Meta joins AI-powered ads race with Google, Microsoft and Amazon",
    "WhatsApp to soon introduce channels feature: Here’s what it does",
    "Realme rolls out of Android 14 Beta 1 update for Realme GT 2 Pro",
    "5 Google Home updates to manage smart home",
    "Kingston Fury Beast, Renegade DDR5 RAM modules launched in India",
    "New listing reveals Microsoft job cuts may cross 10,000",
    "Now you can stream apps from your Android phone to Chromebooks, here’s how",
    "Asus ROG Ally launched: All the details",
    "Airtel new postpaid family plan",
    "Inflation cooling very satisfying; confident that monetary policy is on right track: RBI Governor",
    "Colgate-Palmolive India Q4 profit down 2.3% to Rs 316.2cr, Sales up 4% to Rs 1,341cr",
    "DLF Q4 profit up 40% to Rs 569.6 crore; net profit in FY23 rises 36% to Rs 2,034 crore",
    "Vedanta net profit falls 57% to Rs 3,132cr in January-March",
    "Cipla Q4 net up 45% at Rs 526cr; revenue at Rs 5,739cr",
    "Go First fallout: AI seeing how to quickly add domestic flights to ‘minimise airfare disruptions’",
    "Govt starts inquiry into Google app payments antitrust compliance",
    "Retail inflation declines to 18-month low of 4.7% in April",
    "India's forex reserves jump by $7.2 billion to $595.98 billion",
    "Tata Motors posts consolidated net profit at Rs 5,408 crore in Q4",
    "Sensex loses over 150 points, Nifty tests 18,250; Adani Transmission falls 5%",
    "Elon Musk 'hires' new Twitter CEO, says she will join in 6 weeks",
    "Go First crisis will not change Indian aviation's growth trajectory: Boeing",
    "Rupee records worst week since mid March as dollar regains strength",
    "Islamabad high court gives ex-PM Imran Khan a 2-week reprieve from arrest in graft case",
    "Two Indians on final list of Rs 2 crore global nursing award",
    "Electric vehicle maker Polestar cuts production guidance, jobs",
    "Serbians hand over thousands of weapons after shootings",
    "Turkey's Tayyip Erdogan lags election rival in poll",
    "Pak FM Bilawal asks Imran Khan's party to 'not make matters worse'",
    "Sri Lanka's airline posts $525 million annual loss",
    "Migrants rush across US border in final hours before Title 42 expires",
    "Russia denies reports of Ukrainian breakthroughs along front lines",
    "Pakistan SC declares Imran Khan’s arrest 'illegal’, orders his 'immediate release'",
    "Mother's Day: History, significance and story",
    "10 fittest beauty queens of India",
    "UPPSC Civil Judge Main Admit Card 2023 released on uppsc.up.nic.in, direct link to download",
    "UKPSC Assistant Accountant Answer Key 2023 released on ukpsc.net.in, direct link here",
    "75+ Mother's Day messages for 2023",
    "Top 50 Mother's Day Wishes, Messages & Quotes",
    "Beautiful & thoughtful gift ideas for your mom",
    "Almost 80% of Workplaces Have Mental Health Issues",
    "Building a Foundation of Communication at Workplace",
    "Trust and Transparency: Key Factors in Employee Engagement",
    "Five Event Ideas to Boost Employee Engagement",
    "6Benefits of Lemongrass Tea",
    "This is the world’s costliest mango",
    "Parineeti Chopra's favourite dal recipe",
    "Vijay Deverakonda's free ice cream trucks",
    "9 foods one should not eat in the morning",
    "Excl: Palak Tiwari reveals her daily diet",
    "02:02Watch: How to make Banana Leaf Fish with Thai Herbs",
    "04:48Watch: Food Talk with Palak Tiwari",
    "02:11Watch: How to make Weight Loss Cucumber Tuna Salad",
    "07:54Watch: How to make Brinjal Parmesan with Marinara & Béchamel Sauce",
    "85 exercises to defeat diabetes",
    "What you see first tells your dominant trait",
    "THESE yoga poses can improve your sex life",
    "​Tips to reverse type 2 diabetes naturally​",
    "The way you form a fist reveals THIS",
    "Can viral infection turn into asthma?",
    "1110 fitness secrets of Manoj Bajpayee at 54",
    "7SILENT symptoms of hypertension",
    "119 healthy amino acids in pistachios",
    "6Detailed diet plan for a flat belly",
    "Coconut scent drives away mosquitoes?",
    "4 early signs of alcohol-related fatty liver",
    "Parkinson's: New study to find early causes",
    "The Kerala Story actor Adah Sharma's diet",
    "Can untreated PCOD cause Ovarian cancer?",
    "6 foods you should avoid with curd",
    "10Get inspired by Mitali Mayekar's outfits",
    "Raj Thackeray to feature in Khupte Tithe Gupte",
    "BB Malayalam 5: Junaiz talks about having crush on Cerena",
    "6Peek into Raj-Subhashree's anniversary celebrations",
    "BB Malayalam 5: Nadira Mehrin confesses love to Sagar",
    "Sucharita alleges ex-husband of harassing her family",
    "Did you know Nayana KM was a lecturer?",
    "11​Charming looks of Shobha Shetty​",
    "13​Types of vehicle number plates in India and their meaning",
    "Volkswagen CFO: Next-generation software platform to come towards 2027, 2028",
    "Watch: Delhi woman caught on cam setting motorcycle on fire",
    "Pure ePluto 7G Pro electric scooter launched at under Rs one lakh: More range than Ola S1 Air",
    "Maruti Suzuki Jimny 5-door production begins: Expected price, launch timeline, features",
    "India-bound Mercedes-Benz E-Class LWB first images leaked ahead of global debut",
    "Share of electric cars imported from China into Germany more than triples",
    "10 popular car names we wish for a return in India: Tata Sierra to Mahindra Armada",
    "Highest-selling mid-size sedans in April 2023: New Verna beats VW Virtus and Skoda Slavia",
    "Tata Altroz gets new features including sunroof, wireless charger and more!",
    "Royal Enfield Super Meteor 650 prices hiked: Details",
    "NITI Aayog seeks consultant for evaluation of road projects and functioning of NHAI",
    "Hyundai Exter vs Citroen C3 vs Renault Kiger vs Nissan Magnite: Fetaures, engine, specs",
    "CBSE 12th Result 2023 Live: CBSE Class 12 results announced on cbseresults.nic.in",
    "How to improve your reading speed?",
    "CBSE Board Results 2023: How to download marksheet via DigiLocker?",
    "CBSE Class 12 result 2023 declared: Girls outshine boys again",
    "Top Engineering Colleges in Maharashtra - Check Out Our Web Story!",
    "MHT CET PCB Admit Card 2023 releases today: Here's how to download",
    "Top 10 Engineering Colleges in Tamil Nadu",
    "HP TET June 2023 registration begins, apply on hpbose.org",
    "BharatPe ‘failed fintech’, it has no business left: Ashneer Grover",
    "01:40Karnataka polls: Fearing hung House, BJP & Congress mount backroom operations to woo JD(S)",
    "Assembly elections: Exit polls give Congress edge in Karnataka, but differ on clear win",
    "10 South Indian Celeb couples with 10 or more years of Age Gap or Age difference",
    "Yashasvi Jaiswal smashes fastest fifty in IPL history",
    "PM to attend Quad summit in US on Sept 24",
    "New university in Aligarh: PM Modi visit to bolster BJP’s efforts to woo Jats",
    "Live: US to reassess Pak's role in last 20 years",
    "Profound quotes by Ruskin Bond",
    "Times Mahira dressed better than actresses",
    "12 habits of fathers of confident kids",
    "How each zodiac acts before they crying",
    "Ayurvedic food to increase sexual power",
    "Terms of Use and Grievance Redressal Policy",
    "Karnataka Election Result 2023",
    "Uddhav Thackeray vs Eknath Shinde"
]