[
    "LiveLive: Imran to appear before HC tomorrow; Pak govt denounces 'special reprieve' to ex-PM",
    "India-US relations can counterbalance the world: Envoy",
    "How Zeenat Aman is slaying Instagram at 71",
    "'Works in Delhi stopped forcefully': Kejriwal on SC's verdict",
    "IPL Live: Jaiswal slams fastest fifty to lead Royals run chase",
    "Not going to be part of third front: Odisha CM Naveen Patnaik",
    "Russian national drowns at Goa beach",
    "Delhi News Live Updates: City logs 43 fresh Covid cases; positivity rate 1.8 pc",
    "'It took two years to accept that my child is gay'",
    "Shopping: Amazing Deals on Summer Electronics, TV & Gadgets",
    "Fadnavis: 'Uddhav had not resigned on moral grounds but due to fear'",
    "10 not-to-miss announcements from Google's biggest event of 2023",
    "WHO declares end to Monkeypox public health emergency",
    "Satya Nadella gives ‘bad news’ to Microsoft employees",
    "Delhi govt removes services secretary hours after SC verdict",
    "Google Pixel 6a sees a price drop after launch of Pixel 7a",
    "SC holds Uddhav can't be restored as CM; Fadnavis says satisfied",
    "Watch: No Congress flags in Sachin Pilot’s padyatra",
    "4 early signs of alcohol-related fatty liver disease",
    "The Kerala Story: What's the real story behind this brouhaha?",
    "IPL 2023: Top performers across all 10 teams so far",
    "Kerala woman doctor murder: CM calls emergency meeting",
    "01:34Caught on cam: Man suffers massive heart attack while dancing at a wedding, dies on spot",
    "01:52'Angry' Neena Gupta warns, 'Khabardar Hindi medium bola...'",
    "00:28Disha Patani looks stunning in THIS throwback video",
    "03:22Works in Delhi stopped forcefully: Delhi CM Kejriwal on Supreme Court's unanimous verdict",
    "05:50Pakistan Supreme Court declares Imran Khan's arrest 'null and void'",
    "Gauahar Khan and Zaid Darbar blessed with a baby boy",
    "ONGC makes 2 discoveries in Mumbai offshore OALP blocks",
    "The fury of #MeToo finally comes for the man who inspired it",
    "Polygamy in Assam? Here’s what data and law say",
    "Why SC ‘punished’ a judge for denying bail",
    "IPL Live Score: Kolkata Knight Riders vs Rajasthan Royals",
    "Hyundai announces Rs 20,000 crore investment in Tamil Nadu",
    "Van carrying oxygen tanks explodes in Milan; driver injured",
    "Times when TMKOC was mired in controversies",
    "TV celebs who starred in South Indian films",
    "Pics - IPL: Most overall sixes by a batter in the 20th over",
    "Catch Miss India 2023 finale on Colors!",
    "UP Municipal Elections 2023 Live",
    "Maharashtra political crisis",
    "00:28Man climbs a mobile tower, creates ruckus in Moradabad",
    "Viral: Wife thrashes her alcoholic husband in Mathura",
    "Shocking! 50 kg donation box stolen from Jain temple in Jaipur",
    "Eicher Motors Q4 profit jumps 48% YoY to Rs 905 crore: Dividend declared at Rs 37 per share",
    "Maruti Suzuki Jimny launch in early June: Expected price, specs, features",
    "Porsche 911 Turbo S goes up in flames after crashing into a tree in Gurugram: Images go viral",
    "UKPSC Assistant Accountant Answer Key 2023 released on ukpsc.net.in, direct link here",
    "UPPSC Civil Judge Main Admit Card 2023 released on uppsc.up.nic.in, direct link to download",
    "How to improve your reading speed?",
    "Live: Sania Mirza gives fitting reply on balancing personal and professional life",
    "Ishita Raj: I hope Salman Khan notices my work",
    "ETimes Explainer: The Kerala Story",
    "Revisiting most popular superhero characters",
    "KKK13 contestants jet off to South Africa; pics",
    "Deepika shares some tips from her married life",
    "Times when Amitabh nearly lost his life",
    "Sara Ali Khan dubs for Luka Chuppi 2",
    "These natural pics of Katrina are all heart!",
    "Akshay's next titled The Great Indian Rescue",
    "Sohail Khan on working with Salman again",
    "75+ Mother's Day messages for 2023",
    "Top 50 Mother's Day Wishes and Quotes",
    "Nandini Gupta crowned Miss India 2023",
    "Asit Modi calls Jennifer's allegations baseless",
    "Gauahar and Zaid blessed with a baby boy",
    "Taarak's Jennifer accuses Asit Modi of sexual harassment",
    "Kollywood actors who beefed up for their films",
    "Ten Latest photo shoots of Adah Sharma",
    "35Malaika Arora hits the gym in style",
    "Sara offers prayers at Kedarnath",
    "40Inside photos: Sandeep Khosla's b'day",
    "Radhika Merchant slays in an ethnic look",
    "Nidhhi is a vision in white gown",
    "Deepika Padukone's new pics",
    "Georgina raises temperature in blue bikini",
    "Celebs, their romance outside film circle",
    "Vacation pics of Priya Prakash",
    "The Kerala StoryCritic Rating3.0",
    "US company sells Indian Charpai for over Rs. 1 lakh",
    "Father-in-law attacks his son-in-law by beating him with slippers in front of all the guests",
    "Anand Mahindra's starts a captioning contest on Twitter; see the caption that won",
    "Lip readers reveal King Charles’ frustrated words at his coronation",
    "Where did Prince Harry disappear after the coronation?",
    "00:57Is Sushmita still dating Lalit Modi or she has reconciled with Rohman?",
    "INDIAN PREMIER LEAGUE 2023",
    "KKR vs RR, IPL Live: Jaiswal slams fastest fifty to lead Royals run chase",
    "Yashasvi Jaiswal smashes fastest IPL fifty ever",
    "WATCH: Hetmyer grabs a fine running catch to get rid of Jason Roy",
    "Yuzvendra Chahal becomes highest wicket-taker in IPL",
    "'No one can match Kohli's level in world cricket': RCB fans shower love",
    "7Royal Challengers Bangalore",
    "Chhattisgarh CM Bhupesh Baghel accuses ED of trying to link him to alleged liquor scam",
    "Cyclone Mocha Live Updates: 'Mocha' to intensify into severe cyclonic storm by midnight, says IMD",
    "Kerala woman doctor murder: CM calls emergency meeting as stir intensified",
    "Watch: Speeding super luxury car bursts into flames, turns into ashes",
    "Delhi Govt vs LG: Real power must stay with elected government, says Supreme Court",
    "Nine students experience side effects after tetanus vaccination in Ludhiana",
    "9Everything about veteran actress Sudha Chandran",
    "10How to know if mango is ripened with chemicals",
    "7Too much chia seeds can harm you!",
    "7Zodiac signs who are perfect husband material!",
    "6Samantha's 'Shaakuntalam': A cinematic journey from box-office disaster to OTT redemption",
    "106 foods you should avoid with curd",
    "11​Tips to reverse type 2 diabetes naturally​",
    "The way you form a fist reveals THIS",
    "Can viral infection turn into asthma?",
    "10Madhubala was ahead of her time in fashion",
    "This is what Meghan Markle wore on Coronation day",
    "Alia becomes Gucci ambassador as LV signs up Deepika",
    "13Why you are SINGLE, as per zodiac sign",
    "How do different colours affect your mood?",
    "Life lessons to learn from romantic K-Dramas",
    "10 FOODS which are super BAD for the skin",
    "Meet KKR captain Nitish Rana's beautiful wife Saachi Marwah",
    "Summer hair care tips by celebrity hairstylist Adhuna Bhabani",
    "1110 baby names that are banned",
    "Thoughtful gift ideas for Mother's Day 2023",
    "Prince George made THIS change to coronation",
    "10Excl: Palak Tiwari reveals her daily diet",
    "This Japanese mango is being sold at INR 19,000 per piece",
    "Summer salads made with just 1 homemade dressing",
    "Best nature holidays in India for the season",
    "Odisha’s Kapilesvara Temple declared an ancient monument of national importance",
    "Cold places to visit for a summer honeymoon",
    "Model passes away in a tragic horse-riding accident",
    "Watch out for Miss India '23 finale telecast",
    "Miss Universe Pia Wurtzbach hitched for life",
    "Mistakes Parents Make When Raising Readers",
    "#BeautifulIndians:  Season 2 Of Femina Mamaearth",
    "There’s More To Khajuraho Than The Erotic Carvings",
    "5 foods you should never combine with mangoLifestyle",
    "10 fittest beauty queens of IndiaLifestyle",
    "11 foods that have more iron than spinachFood",
    "Amala Paul's breathtaking saree looks every Bong girl can copyEntertainment",
    "12 habits of fathers who raise confident kidsLifestyle",
    "Inside Parineeti Chopra’s home in MumbaiLifestyle",
    "World's most unforgettable train journeys!Travel",
    "10 best names for babies born in MayLifestyle",
    "00:59WHAT! Alia Bhatt acknowledges her privileges",
    "03:45Fadnavis: 'Uddhav had not resigned on moral grounds but due to fear'",
    "00:30'Aree bag rhe gaya...' - Jacqueline screams at the airport",
    "01:16Pakistan mayhem! Celebs react to Imran Khan's arrest",
    "12Kriti Sanon's mesmerising saree pics",
    "The Kerala Story - What's the REAL story behind this brouhaha? - ETimes Explainer",
    "Chaitanya on rumours about his relationship",
    "Shraddha throws a send-off dinner for Anjum",
    "Ashneer, wife booked for cheating and fraud of Rs 81 cr",
    "11Amala Paul's breathtaking saree looks",
    "Srinidhi Shetty's elegant lehenga choices",
    "Shraddha Kapoor's most iconic selfies",
    "10 times when Simran was the epitome of beauty",
    "Arijit Singh: Being reclusive helps me stay focused",
    "'Currents is a crossover between my Indian and Western identities'",
    "Akul's music to showcase The Great Khali's journey",
    "Israel marks independence day with dance and music",
    "Delhiites enjoy a sufiyaana shaam",
    "LiveKKR vs RR, IPL Live: Jaiswal slams fastest fifty to lead Royals run chase",
    "WATCH: Hetmyer grabs a fine running catch to get rid of Roy",
    "Pics: Chahal surpasses Bravo to become leading wicket-taker in IPL",
    "PCB threatens to move out of ACC if it is not allowed to host 4 games",
    "01:32IPL 2023: Kolkata face under-pressure Rajasthan at Eden Gardens",
    "10:14The big reasons for Chennai Super Kings' incredible consistency in the IPL",
    "Breaking Sachin's record will be an emotional moment for me: Kohli",
    "Sanju Samson is like young MS Dhoni: Graeme Swann",
    "Wrestlers' Protest Live: Minor wrestler records statement",
    "Here's how WhatsApp aims to curb international calls scam in India",
    "Nothing to roll out Android 14 beta for Phone (1)",
    "How Google Translate helped a 68-year-old woman lost in Uttarakhand reunite with her family",
    "Realme Narzo N53 to launch in India on May 18: What to expect",
    "Here are the biggest Android ecosystem announcements at Google I/O 2023",
    "Nokia C22 with 5000 mAh battery launched: Price, launch offers and more",
    "These customisation features are coming first to Pixel phones, other Android users need to wait",
    "YouTube to users: Disable ad blockers or ‘pay’",
    "EU may have good news coming for Microsoft in ‘Call of Duty’ deal next week",
    "Google's new tool will help identify AI-generated, fake images",
    "Airtel new postpaid family plan",
    "Hindenburg shorts Icahn Enterprises bonds as battle with billionaire heats up",
    "METRO completes Rs 2,850cr deal with Reliance Retail to sell its India Cash & Carry business",
    "Billionaire Adani’s firms weigh raising up to $5 billion: Report",
    "No question of filing for insolvency: SpiceJet CMD Ajay Singh",
    "IndiGo announces codeshare connections to Edinburgh via Istanbul",
    "Sensex, Nifty close lower in choppy trade; L&T biggest drag",
    "'Equity mutual fund inflows moderate to five-month low in April'",
    "ONGC discovers oil, gas in Arabian Sea blocks",
    "US jobless claims rise to highest since October 2021",
    "Siemens net profit jumps 62% to Rs 516cr in March quarter",
    "Motown set to drive record sales with big launches in 2023",
    "Sensex recovers 62k level as global sentiments improve after US inflation eases",
    "No plans to file for insolvency: SpiceJet",
    "Rupee holds near 2-week lows on strengthening US dollar",
    "Pakistan SC declares Imran Khan’s arrest 'illegal’, orders his 'immediate release'",
    "25 dead as Israel, Gaza militants trade fire for third day",
    "Finland PM Sanna Marin divorces husband",
    "71 million people internally displaced worldwide",
    "Finland footbridge collapse injures 27, mostly children: Rescuers",
    "Imran Khan's U-turn from military's man to army critic",
    "Electric vehicle maker Polestar cuts production guidance, jobs",
    "Serbians hand over thousands of weapons after shootings",
    "Turkey's Tayyip Erdogan lags election rival in poll",
    "Pak FM Bilawal asks Imran Khan's party to 'not make matters worse'",
    "Mother's Day: History, significance and story",
    "5 foods you should never combine with mango",
    "6 Zodiac Signs Who Will Never Betray You",
    "CBSE Board Results 2023: How to download marksheet via DigiLocker?",
    "Top 50 Mother's Day Wishes, Messages & Quotes",
    "Beautiful & thoughtful gift ideas for your mom",
    "Almost 80% of Workplaces Have Mental Health Issues",
    "Building a Foundation of Communication at Workplace",
    "Trust and Transparency: Key Factors in Employee Engagement",
    "Five Event Ideas to Boost Employee Engagement",
    "Delhi, Mumbai street food 'best' in the world",
    "This Korean wine is 2000-year-old",
    "How to make Bengali Aam er Dal",
    "Urfi's top is made of real bubble gum",
    "02:02Watch: How to make Banana Leaf Fish with Thai Herbs",
    "04:48Watch: Food Talk with Palak Tiwari",
    "02:11Watch: How to make Weight Loss Cucumber Tuna Salad",
    "07:54Watch: How to make Brinjal Parmesan with Marinara & Béchamel Sauce",
    "Coconut scent drives away mosquitoes?",
    "6 foods you should avoid with curd",
    "Is cold water bad for the heart?",
    "Can you find the phone within 10 seconds?",
    "Ayurvedic food to increase sexual power",
    "One of the world's oldest optical illusion!",
    "64 early signs of alcohol-related fatty liver",
    "6Parkinson's: New study to find early causes",
    "10The Kerala Story actor Adah Sharma's diet",
    "Can untreated PCOD cause Ovarian cancer?",
    "9 side effects of drinking too much water",
    "Breathing exercise to reduce Alzheimer's risk",
    "How overactive thyroid is risky for your bones",
    "Commotio cordis: A rare cardiac arrest event",
    "Fitness & diet secrets of 'Adipurush' cast",
    "Bowel cancer: THESE are the \"earliest\" signs",
    "10Revati Lele's beautiful pictures in purple saree",
    "BB Malayalam 5: Vishnu becomes game changer",
    "8Kannada actresses who faced body-shaming",
    "Raj and Subhashree celebrate 5th anniversary",
    "6Much-waited reality shows on Marathi television",
    "Teammate makes shocking allegations against Roopa",
    "Khushboo Tawde on joining Aai Kuthe Kay Karte",
    "10​In pics: Ashmita dazzles like a diva ​",
    "Made-in-India Toyota Urban Cruiser Hyryder launched in South Africa",
    "Ola, Rapido bike taxis get green flag: Delhi govt approves Motor Vehicle Aggregator Scheme 2023",
    "BMW X3 M340i Performance SUV launched in India at Rs 86.5 lakh: 0-100 in just 4.9 seconds!",
    "Marc Marquez set to return at French GP: No penalty for Portugal crash, says FIM",
    "Hyundai announces Rs 20,000 crore investment in Tamil Nadu for EV ecosystem development",
    "How to become a Rapido Captain: Here's everything you need to know",
    "GM, Volkswagen face idled capacity risk in China, need faster EV transition: Greenpeace",
    "Top five SUVs to launch in India this year: Maruti Suzuki Jimny to Hyundai Creta facelift",
    "Diesel ban will hit these 10 Indian SUVs badly: Scorpio-N, Fortuner and more",
    "Most powerful sedans in India under Rs 20 lakh: Hyundai Verna to Volkswagen Virtus",
    "Top 10 highest-selling SUVs in April 2023: Tata Nexon to Maruti Suzuki Fronx",
    "Top Engineering Colleges in Maharashtra - Check Out Our Web Story!",
    "MHT CET PCB Admit Card 2023 releases today: Here's how to download",
    "Top 10 Engineering Colleges in Tamil Nadu",
    "HP TET June 2023 registration begins, apply on hpbose.org",
    "UPSC Exam Calendar 2024: UPSC Civil Services Prelims on May 26, NDA & CDS I on April 21",
    "WBBSE Madhyamik Result 2023 Date and Time Confirmed: Check details here",
    "Telangana SSC results released, 86.60% candidates cleared exams",
    "SSC CHSL 2023 notification released: Registration open until June 8, apply here",
    "UGC NET 2023 registration begins today for June session on ugcnet.nta.nic.in, details here",
    "Cambodian athlete refuses to give up despite the rains",
    "IPL 2023: Days after altercation with Gautam Gambhir, Virat Kohli posts a video on 'grudges'",
    "02:12America's mass shooting epidemic claims an Indian life as parents weigh alternatives to US",
    "He hunted for kids, targeted 30: Shocking details of abductions, rapes and murders in Delhi",
    "NEET aspirants’ bra strap checked, some had to swap clothes with kin",
    "PM to attend Quad summit in US on Sept 24",
    "New university in Aligarh: PM Modi visit to bolster BJP’s efforts to woo Jats",
    "Live: US to reassess Pak's role in last 20 years",
    "Profound quotes by Ruskin Bond",
    "Times Mahira dressed better than actresses",
    "12 habits of fathers of confident kids",
    "How each zodiac acts before they crying",
    "Terms of Use and Grievance Redressal Policy",
    "Karnataka Election Result 2023",
    "Maharashtra Political Crisis"
]