[
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "Completing a squad of severe weather satellites, testing out a ssssnake-like robot, and sending the second all-private astronaut mission to the \n@Space_Station\n—all in a week’s work at NASA. See what we’ve been up to.",
    "We’re launching solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n on the next \n@SpaceX\n cargo mission, set for June 3.\n\nTune in on May 30 at 2pm ET (1800 UTC) for details. #AskNASA your questions and we may answer them on-air. https://go.nasa.gov/430oldn",
    "We completed a joint checkpoint review with @BoeingSpace ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the @Space_Station: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from @NASAWebb and x-ray data from @ChandraXray make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "Completing a squad of severe weather satellites, testing out a ssssnake-like robot, and sending the second all-private astronaut mission to the @Space_Station—all in a week’s work at NASA. See what we’ve been up to.",
    "We’re launching solar arrays, small satellites, and a plant experiment to the @Space_Station on the next @SpaceX cargo mission, set for June 3.\n\nTune in on May 30 at 2pm ET (1800 UTC) for details. #AskNASA your questions and we may answer them on-air. https://go.nasa.gov/430oldn",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "Join us tomorrow from the \n@Space_Station\n!\n\nWith #Crew6 aboard, \n@SpaceX\n's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "@WomenNASA\n Liz Landau, host and science communicator\n\n\n@ChandraXray\n Daryl Haggard, astrophysicist\n\n\n@NASAJPL\n Michele Vallisneri, theoretical physicist\n\n\n@NASAUniverse\n Regina Caputo, astrophysicist",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Bring balance to the force, not leave it in darkness.\n\nHappy #StarWarsDay. And #MayThe4thBeWithYou.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "Happy Earth Day from me and our good friends over at NASA.\n \nFor our children and grandchildren, we must stand united in our effort to save our only home.",
    "What was it like when Apollo 8 astronaut Bill Anders saw Earth rise over the Moon’s horizon in 1968?\n\nHe reflects with Dr. Kate Calvin, NASA senior climate advisor and chief scientist, on taking the famous photo helped humanity \"discover\" Earth. https://go.nasa.gov/43QKQCr\n\n#EarthDay",
    "Watch as \n@NorthropGrumman\n’s S.S. Sally Ride undocks from the \n@Space_Station\n 250 miles over the Mediterranean.",
    "Live Now: Watch as the uncrewed \n@NorthropGrumman\n S.S. Sally Ride Cygnus cargo spacecraft departs from the \n@Space_Station\n.\n\nThe spacecraft delivered snacks, science, and supplies to the orbiting laboratory in November 2022:\nhttp://go.nasa.gov/3MWtqhI",
    "We celebrate International #HumanSpaceFlight Day honoring the accomplishments of the first person in space in 1961, and the first launch of the space shuttle in 1981. \n\nNext, with \n@NASAArtemis\n, we continue humanity’s progress with Moon & Mars exploration!",
    "Tail installed \n\nSoon, \n@NASAAero\n’s X-59 will take to the skies to demonstrate a new quiet form of supersonic flight. This technology could bring a return to supersonic flight over land—cutting flight times in half. More on the Quesst mission: https://nasa.gov/specials/Quesst/…",
    "What's new on the Web(b)?\n\nWe always have the latest hi-res images from \n@NASAWebb\n available to view (and download) at http://webbtelescope.org. Stop by and make sure you haven't missed any!",
    "Astronaut \n@Astro_Watkins\n spent 170 days in space as a member of #Crew4. In our Curious Universe podcast season finale, she talks about how her background and training prepared her for life and work in space. https://go.nasa.gov/41j8YLT",
    "Designed to endure at least 7 passes through Jupiter's intense radiation, the JunoCam instrument has survived 50 so far – and it’s still going strong. In this new @googlearts exhibition, celebrate the otherworldly vistas “the public’s camera” has shown us: https://artsandculture.google.com/story/XwUxhKx1GDOOTA…",
    "The #JunoMission completed its 50th close pass of Jupiter this past weekend. Relive highlights from its journey around the solar system’s largest planet, download high-res images and learn more: https://go.nasa.gov/40ZRrIQ"
]