[
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "I have spaceships",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Until the Supreme Court struck down Biden’s vaccination decree, he tried to demand that we fire all unvaccinated personnel – some of our finest people",
    "Feels so long ago …",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship.",
    "Model S Plaid track pack coming soon",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to @ClarkCountyNV for the great partnership.",
    "The idea that governments around the world have for years been secretly censoring ordinary citizens sounds crazy, but it's true. Worse, they are now on the cusp of imposing what can only be described as a totalitarian system to end freedom of speech as we know it.",
    "Such a great day in so many ways"
]