[
    "Just swipe up to see the next video",
    "Here we go again",
    "Who should be President in 2032?",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "“What are you thinking?”",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "Spaces discussion with Mary Barra, CEO of \n@GM\n! \n@mtbarra",
    "Model 3 & Y have great air filtration too, but they’re too small to fit the monster HEPA filters",
    "Tesla Model S & Model X have hospital-grade HEPA air filters, protecting you from dust, bacteria, pollen (allergies), spores & many toxic gases",
    "And on June 6, the Dragon 2 fleet's cumulative time in space surpassed the Space Shuttle fleet's time with 1,324 total days in orbit!",
    "",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Would be great to have shows from all parts of the political spectrum on this platform!",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!"
]