[
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "This week at NASA, astronauts prepped the @Space_Station for more solar arrays, @NASAHubble celebrated its 33rd anniversary with a new image of a dark nebula, and @VP and @President_KR visited @NASAGoddard.",
    "Astronauts Steve Bowen and @Astro_Alneyadi concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of @NASA_Astronauts and @Astro_Alneyadi will route power cables to prepare for future power system upgrades outside the @Space_Station.",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of @NASA_Astronauts and @Astro_Alneyadi work on upgrades to the @Space_Station's power system.",
    "Two cosmonauts will conduct a pair of spacewalks on Wednesday, May 3, and Friday, May 12, to relocate hardware outside the @Space_Station. Details and coverage info: https://go.nasa.gov/44blzDe",
    "We need your help to \n@DoNASAScience\n! Many of our citizen science projects can be done by anyone, anywhere, with just a cell phone or laptop. Find a project that sparks your curiosity this #CitSciMonth: http://science.nasa.gov/citizenscience",
    "Astronauts need spacesuits for different occasions: life and work inside a spacecraft, spacewalks, and one day, planetary walks. In this episode of the Curious Universe podcast, we explore spacesuit design and creation, from fittings to new features: https://go.nasa.gov/3zxE6LK",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "One week until you meet the astronauts flying to the Moon aboard the #Artemis II mission!\n\nThe \n@NASA_Orion\n spacecraft will return to the Moon — this time, with four astronauts aboard. Set a reminder for April 3 for the reveal: https://youtube.com/live/mua1Lysc_JQ?si=EnSIkaIECMiOmarE…",
    "If you’ve been tuning in, you know landing on Mars is half of the battle–returning the first astronauts home from the Red Planet is the other half.\nListen in as four experts discuss in this week's episode of “Houston, We have a Podcast”: https://go.nasa.gov/42FdMN9",
    "Want to help keep Earth safe from near-Earth asteroids? Join the International Astronomical Search Collaboration and help us find more of these remnants left over from the early formation of our solar system. \n@DoNASAScience\n at: https://science.nasa.gov/citizenscience?field_division_tid=81…",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…",
    "Through the lens of NASA photographer Aubrey Gemignani, we witness the people and hear the stories behind awe-inspiring missions to space. As a co-founder of \"Faces of NASA,\" we turn the camera on her and share her story: https://go.nasa.gov/42CIoPj"
]