[
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from \n@NASAKennedy\n at 5:37pm ET (2137 UTC).",
    "Did you catch our latest \n@NASAArtemis\n Moon Minute in the Axiom-2 launch broadcast?\n\n\n@NASA\n and \n@Axiom_Space\n are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "Today, \n@VP\n and \n@President_KR\n toured \n@NASAGoddard\n for a close-up look at how we study our changing planet—and got a glimpse of \n@NASARoman\n, our next space telescope, as it's being built: https://go.nasa.gov/3mXIRf3",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "The first of two TROPICS launches will send cyclone-tracking CubeSats to low Earth orbit from New Zealand. The launch window opens at 9pm ET April 30 (0100 UTC May 1).\n\nA second launch is planned for May 16 to complete the constellation: http://go.nasa.gov/3Ax7aDG",
    "We did it together. Thanks to you, we're bringing home five People's Voice Awards in this year's #Webbys.\n\nFrom \n@NASAWebb\n's first images to \n@NASA_Eyes\n's interactive map of the asteroids, check out our full set of Webby winners: https://go.nasa.gov/3n7iNOw",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9",
    "Congratulations, \n@ESA\n! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "...and rounding out our #Artemis II Moon crew: mission commander \n@Astro_Reid\n! \n\nReid Wiseman lived & worked aboard the \n@Space_Station\n as a flight engineer in 2014. He also commanded the undersea research mission NEEMO21, and most recently served as Chief of the \n@NASA_Astronauts\n.",
    "Our #Artemis II pilot is \n@AstroVicGlover\n! \n\nVictor Glover is part of our 2013 class of \n@NASA_Astronauts\n  and was the pilot for NASA’s \n@SpaceX\n Crew-1 mission. He’s logged 3,000 flight hours in more than 40 different aircraft, and will pilot \n@NASA_Orion\n around the Moon.",
    "Representing the \n@csa_asc\n on #Artemis II to the Moon is \n@Astro_Jeremy\n, from London, Ontario. \n\nJeremy Hansen was a fighter pilot before joining CSA, and currently works with NASA on astronaut training and mission operations. This will be Hansen’s first mission in space.",
    "Look westward to find the Moon as a beautiful slim crescent this evening after sunset, hanging just below blazing-bright Venus. Tomorrow evening, look west again to spot the Moon once more, this time shining from above Venus.\n\nSpot the duo? Share your pictures.",
    "This #NationalPuppyDay, we salute all the dog stars out there. Exploring is more fun with your best friend at your side. ",
    "Pause. Rewind. \n@NASAWebb\n may have found sand particles in the atmosphere of planet VHS 1256 b, which orbits a pair of stars 40 light-years away. Webb also detected water, carbon monoxide, and methane. Get the gritty details: https://go.nasa.gov/3lDePfN",
    "Reporters: Interview the four astronauts who will travel around the Moon and deeper into space than any humans before them.\n\nMedia credentialing to cover the joint \n@NASA\n-\n@CSA_ASC\n reveal of the #Artemis II crew in Houston on April 3 is open now: https://go.nasa.gov/404oRpc",
    " LIVE: We celebrate #WomensHistoryMonth by announcing a new campaign to connect women with students for \n@NASASTEM\n mentorship.",
    "Live outside of the continental United States? You can check out upcoming eclipses around the world here.",
    "Where will you be during the eclipses in 2023 and 2024?\n\nThis map shows the path of the Moon’s shadow as it crosses the contiguous U.S. during the eclipse on Oct. 14, 2023 and total solar eclipse on April 8, 2024. Will you get a chance to see them? https://go.nasa.gov/40pj5hL"
]