[
    "Our \n@NASASTEM\n educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the \n@usedgov\n, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig",
    "50 years ago today, Pete Conrad, Joseph Kerwin, and Paul Weitz lifted off from \n@NASAKennedy\n, heading to Skylab: America's first space station.\n\nOur Skylab missions laid the groundwork for \n@NASA_Astronauts\n to live and work in space, from the \n@Space_Station\n to the Moon and beyond.",
    "It’s handy to have one of these. Know why?",
    "Soon, we'll announce the company selected to develop the landing system for the #Artemis V Moon mission, which will take astronauts from lunar orbit to the surface and back. Tune in Friday, May 19 at 10am ET (1400 UTC): https://go.nasa.gov/42T3sk4",
    "LIVE: Leaders from NASA, \n@Axiom_Space\n, and \n@SpaceX\n are sharing updates on #Ax2's upcoming mission to the \n@Space_Station\n following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "REPORTERS: The #Artemis II crew is coming to Washington with media availability on May 17-18.\n\nThese four astronauts will fly around the Moon during the 10-day flight test. https://go.nasa.gov/3I8qR9a",
    "A \n@NASAWebb\n finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Who made you the star you are today? Mention them to give them cosmic #MothersDay flowers.  \n\nThe Rosette Nebula, about 5,000 light-years from Earth, is a region in space where stars are formed. This image by the Spitzer Space Telescope shows the stellar nursery in infrared.",
    "LIVE: Leaders from NASA, @Axiom_Space, and @SpaceX are sharing updates on #Ax2's upcoming mission to the @Space_Station following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "A @NASAWebb finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of @NASA_Astronauts, proving that humans could live and work in space for extended periods of time. Learn more with @NASA_History: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n@Space_Station crew members relocated their @SpaceX Dragon to a new docking port, @NASAWebb imaged a nearby star, and @RocketLab launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission is flying free from its \n@SpaceX\n Falcon 9 rocket and on its way to geostationary orbit.",
    "Liftoff! Our #TEMPO mission and its host satellite are on the way to space. The size of a dishwasher, TEMPO is powerful enough to observe air pollutants across North America down to a resolution of 4 square miles (10 square km).",
    "LIVE: Watch #TEMPO launch to orbit on a \n@SpaceX\n Falcon 9 rocket. Liftoff expected as early as 12:30am ET (0430 UTC).\n\nThe \n@NASAEarth\n & \n@CenterForAstro\n mission is set to revolutionize air quality observations.",
    "Last October, a pulse of intense radiation swept through the solar system so extraordinary that astronomers quickly dubbed it the BOAT – the brightest of all time. The source? A gamma-ray burst, the most powerful class of explosions in the universe. https://go.nasa.gov/42HrCyB",
    "On April 3, you will meet the team of astronauts flying to the Moon on the #Artemis II mission.\n\nThese explorers will pave the way for future lunar landings and our next giant leap — human exploration of Mars. https://youtube.com/live/mua1Lysc_JQ?feature=share…",
    "See what it's like to have a 6.2-million-gallon pool as your office and dive into \n@NASASTEM\n's latest Surprisingly STEM episode. NASA diver Arielle Valdez shares her STEM career story & what it's like to find #YourPlaceInSpace.",
    "LIVE: After splashing down off the coast of Florida last weekend, our #Crew5 spacefarers are answering questions about their five-month stay aboard the \n@Space_Station\n.\n\nShare your questions with #AskNASA!",
    "Did you try your hand at this year’s #NASAPiDay challenge? Check your answers here: https://go.nasa.gov/3yDXyWT",
    "Live now: \n@Axiom_Space\n and NASA reveal the spacesuit prototype for \n@NASA_Astronauts\n to wear near the Moon’s South pole on #Artemis III.\n \nRemarks & suit demo – 10:30am EDT (1430 UTC)\n\nStudent Q&A – 11:15am EDT (1515 UTC)",
    "Come stargazing with us! In this week’s episode of our Curious Universe podcast, listen and read along as we take you on a tour of the stars from your very own backyard. http://nasa.gov/curiousuniverse",
    "Curious about the science and research en-route to the \n@Space_Station\n? More on the new investigations heading to space:",
    "Liftoff! Science, supplies & snacks are flying to the \n@Space_Station\n. \n@SpaceX\n #CRS27 is carrying blueberries, apples, cherry tomatoes, and four kinds of cheese. All the makings of a space charcuterie board? If you were going on a trip to space, what snacks would you want to take?",
    "LIVE NOW: Watch a rocket launch to the \n@Space_Station\n. Liftoff of the \n@SpaceX\n #CRS27 cargo resupply mission is slated for 8:30pm ET (0030 UTC).",
    "Cosmic spring is in the air! The latest image from \n@NASAWebb\n features a blooming Wolf-Rayet star, 15,000 light-years away. This rare phase is as fleeting as the cherry blossom it resembles. Luckily, Webb can study its \"petals\" of dust in detail: https://go.nasa.gov/3YL5D6I #SXSW",
    "Researchers are using \n@NASAEarth\n-observing satellites to track wildfires increasing in intensity & frequency due to climate change.\n\nLearn how an outside perspective helps scientists study wildfires on the latest episode of our Curious Universe podcast: http://go.nasa.gov/3kODD4f"
]