[
    "Falcon 9’s first stage booster has landed on Landing Zone 1, a first for a human spaceflight mission",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Verified organization is one of the most important additions to Twitter. @elonmusk",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of \n@ViasatInc\n's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Home",
    "Content creators may wish to enable subscriptions on this platform. \n\nJust tap on Monetization in settings.",
    "We live in the most interesting of times",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Given the moves by Fox and CNN news today with the firings of Don Lemon and Tucker Carlson, I think what we have is mainstream media realizing that change is needed. People don't want to be mislead by news stations. They also don't want misogynistic viewpoints to flourish.\n\nAs… Show more",
    "We’re rapidly improving transparency & fairness on this platform, but there is still a lot of work to do",
    "Hard to believe Starship actually did launch on 4/20 lol",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "check mate",
    "We may get it wrong occasionally, so authors will be able to submit feedback on the label if they think we incorrectly limited their content’s visibility. In the future, we plan to allow authors to appeal our decision to limit a Tweet’s visibility.",
    "These actions will be taken at a tweet level only and will not affect a user’s account. Restricting the reach of Tweets helps reduce binary “leave up versus take down” content moderation decisions and supports our freedom of speech vs freedom of reach approach.",
    "We’re adding more transparency to the enforcement actions we take on Tweets. As a first step, soon you’ll start to see labels on some Tweets identified as potentially violating our rules around Hateful Conduct letting you know that we’ve limited their visibility. … Show more",
    "Canadian Broadcasting Corp said they’re “less than 70% government-funded”, so we corrected the label",
    "Mini Starship with flame!"
]