[
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Starlink satellites are equipped with optical space lasers (pew pew), which allow us to provide truly global coverage and serve customers in the most remote locations on Earth http://starlink.com/technology",
    "Excited to welcome Ford owners to thousands of Superchargers across North America next year",
    "Congratulations Neuralink team!",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "AKA, don’t pull out. @elonmusk",
    "@GovRonDeSantis announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "Spaces with @RonDeSantis in ~2 hours!",
    "BREAKING: @FoxNews confirms Florida Governor @RonDeSantis will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with @elonmusk.",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Why is sleep so hard!? Perhaps we will never know.",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the @FortniteGame Chapter 4 release with @FindYourBattle—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "Increasing lithium refining capacity is critical to a sustainable energy economy—today, we're breaking ground on our in-house lithium refinery outside of Corpus Christi, TX. \n\nThis facility will also prioritize the elimination of a challenging refinery byproduct (sodium sulfate).… Show more",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon"
]