[
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of \n@NASAInterns\n. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Our \n@NASASTEM\n educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the \n@usedgov\n, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig",
    "50 years ago today, Pete Conrad, Joseph Kerwin, and Paul Weitz lifted off from \n@NASAKennedy\n, heading to Skylab: America's first space station.\n\nOur Skylab missions laid the groundwork for \n@NASA_Astronauts\n to live and work in space, from the \n@Space_Station\n to the Moon and beyond.",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of @NASAInterns. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Our @NASASTEM educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the @usedgov, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig",
    "50 years ago today, Pete Conrad, Joseph Kerwin, and Paul Weitz lifted off from @NASAKennedy, heading to Skylab: America's first space station.\n\nOur Skylab missions laid the groundwork for @NASA_Astronauts to live and work in space, from the @Space_Station to the Moon and beyond.",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for \n@NASASTEM\n: http://go.nasa.gov/3nm6fTI",
    "Interacting galaxies, known as AM 1214-255, shine bright in this new view from Hubble!\n\nBoth galaxies contain active galactic nuclei, which are luminous central regions that host a black hole. Learn more for #BlackHoleWeek: https://go.nasa.gov/3VoUSa9",
    "LIVE: Two cosmonauts are about to start a spacewalk to help install an experiment airlock on the \n@Space_Station\n's Nauka science module. Tune in for NASA TV coverage at http://nasa.gov/live.",
    "Live Now: Watch as the uncrewed \n@NorthropGrumman\n S.S. Sally Ride Cygnus cargo spacecraft departs from the \n@Space_Station\n.\n\nThe spacecraft delivered snacks, science, and supplies to the orbiting laboratory in November 2022:\nhttp://go.nasa.gov/3MWtqhI",
    "HOP IN SPACEFOLKS! \n\nWe're blasting off together on a new mission—\n@TheWebbyAwards\n. Together we've: launched #Artemis I, watched DART smash into an asteroid, and explored with \n@NASAWebb\n. Now we're hoping to land #Webbys. You in? Vote by the end of today: https://bit.ly/3zHiqgs",
    "As we open up the next generation of opportunities in low-Earth orbit, \n@CollinsAero\n is designing a new spacesuit that's more adaptable, flexible, and easy to use for spacewalks outside the \n@Space_Station\n. Get the details: https://go.nasa.gov/3MUIUmm",
    "Houston, we have Posty\n\nAs we approach #EarthDay, watch \n@PostMalone\n get astronaut-struck as he chats with two crew members aboard the \n@Space_Station\n, Stephen Bowen & Woody Hoburg, about how their unique perspective changes the way they see our home planet. http://nasa.gov/earth-day-2023",
    "Congrats to \n@SpaceX\n on Starship’s first integrated flight test! Every great achievement throughout history has demanded some level of calculated risk, because with great risk comes great reward. Looking forward to all that SpaceX learns, to the next flight test—and beyond.",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "On Friday, April 21, \n@NorthropGrumman\n's uncrewed Cygnus cargo craft is scheduled to depart the \n@Space_Station\n. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    "Two cosmonauts are about to venture outside the \n@Space_Station\n for a six-and-a-half-hour spacewalk. Live coverage begins at 9pm ET (0100 UTC April 19) on https://go.nasa.gov/3Lc1mFI.",
    ".\n@VP\n spoke to the #Artemis II astronauts about their upcoming mission around the Moon, and how it will pave the way for future long-term human exploration missions to the Moon, and eventually Mars.",
    "Our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission successfully launched. TEMPO will provide hourly, daytime measurements of air quality in North America. It will monitor three main pollutants and reveal disparities in exposure in our cities and communities: https://go.nasa.gov/40Q9v89",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission is flying free from its \n@SpaceX\n Falcon 9 rocket and on its way to geostationary orbit.",
    "An epic dance: At this very moment, the #JunoMission spacecraft is approaching Jupiter for its 50th close pass of the giant planet. Ride along using our 3D solar system simulator: https://go.nasa.gov/3ZI8Q7v",
    "Stars: always making a dramatic exit!  \n\nWebb’s powerful infrared eye has captured never-before-seen detail of Cassiopeia A (Cas A). 11,000 light-years away, it is the remnant of a massive star that exploded about 340 years ago: https://go.nasa.gov/3ZJnk72",
    ".@VP spoke to the #Artemis II astronauts about their upcoming mission around the Moon, and how it will pave the way for future long-term human exploration missions to the Moon, and eventually Mars.",
    "Our @NASAEarth & @CenterForAstro #TEMPO mission successfully launched. TEMPO will provide hourly, daytime measurements of air quality in North America. It will monitor three main pollutants and reveal disparities in exposure in our cities and communities: https://go.nasa.gov/40Q9v89",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our @NASAEarth & @CenterForAstro #TEMPO mission is flying free from its @SpaceX Falcon 9 rocket and on its way to geostationary orbit.",
    "Liftoff! Our #TEMPO mission and its host satellite are on the way to space. The size of a dishwasher, TEMPO is powerful enough to observe air pollutants across North America down to a resolution of 4 square miles (10 square km).",
    "LIVE: Watch #TEMPO launch to orbit on a @SpaceX Falcon 9 rocket. Liftoff expected as early as 12:30am ET (0430 UTC).\n\nThe @NASAEarth & @CenterForAstro mission is set to revolutionize air quality observations."
]