[
    "Oh hi lol",
    "\"We should be able to express things, otherwise it is censorship and at some point, censorship goes against you.\" \n- \n@ElonMusk\n discusses with \n@Cheydema\n, CEO \n@Orange\n at #VivaTech",
    "“What are you thinking?”",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "It is worth noting that kids who are same-sex attracted and/or autistic are the most vulnerable",
    "Big difference",
    "Archived version",
    "Powerful article",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Would be great to have shows from all parts of the political spectrum on this platform!",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Dagan Shani has IMHO made the most important film of the year -  about the harsh #AI truth:",
    "Starlink on Igloolik Island in the northern territory of Nunavut, Canada ",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "BREAKING: @Tesla says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750."
]