[
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from \n@NASAKennedy\n at 5:37pm ET (2137 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "Did you catch our latest \n@NASAArtemis\n Moon Minute in the Axiom-2 launch broadcast?\n\n\n@NASA\n and \n@Axiom_Space\n are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the \n@Space_Station\n for scientific research, student outreach and commercial activities on \n@Axiom_Space\n's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and \n@SpaceX\n—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from @NASAKennedy at 5:37pm ET (2137 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, @Axiom_Space's second all-private mission to the @Space_Station.",
    "#Ax2's @SpaceX Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the @Space_Station.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "Did you catch our latest @NASAArtemis Moon Minute in the Axiom-2 launch broadcast?\n\n@NASA and @Axiom_Space are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the @Space_Station for scientific research, student outreach and commercial activities on @Axiom_Space's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and @SpaceX—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n work on upgrades to the \n@Space_Station\n's power system.",
    "Two cosmonauts will conduct a pair of spacewalks on Wednesday, May 3, and Friday, May 12, to relocate hardware outside the \n@Space_Station\n. Details and coverage info: https://go.nasa.gov/44blzDe",
    "Are you ready for a spacewalk?\n\nAstronauts Steve Bowen and \n@Astro_Alneyadi\n will step out of the \n@Space_Station\n around 9:15am ET (1315 UTC) on Friday, April 28 to prepare for upcoming power upgrades. Coverage starts here and on NASA TV at 7:45am (1145 UTC): https://go.nasa.gov/40Iopww",
    "Having trouble sleeping? Try some of these seven techniques our astronauts use to get better sleep in space!\n \nThese methods help \n@NASA_Astronauts\n sleep well through the disruptions of their natural sleep cycle — and they may help you too: https://go.nasa.gov/3MNWYhA",
    "Last year was pretty busy. \n\nWe launched to the Moon. We yeeted a spacecraft into an asteroid (on purpose.) And we unveiled images from a brand new space telescope. NBD. \n\nOh yeah, we also nabbed nine noms for the #Webbys. If you like what you saw, vote? http://go.nasa.gov/3KBXNZl",
    "Dragon is soaring home! \n\n\n@SpaceX\n's cargo spacecraft separated from the \n@Space_Station\n at 11:05am ET (1505 UTC), carrying space-grown tomatoes and other \n@ISS_Research\n for analysis back on the ground. Follow our ISS blog for the latest #CRS27 updates: http://blogs.nasa.gov/spacestation",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "LIVE: \n@SpaceX\n's #CRS27 cargo mission is scheduled to undock from the \n@Space_Station\n at 11:05am ET (1505 UTC) today.\n\nLearn more about the \n@ISS_Research\n it's bringing back to Earth: https://go.nasa.gov/4059R9F",
    " \n@NASAAero\n gets closer to quiet supersonic flight, \n@NASA_Orion\n’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "Two cosmonauts will conduct a series of spacewalks outside the \n@Space_Station\n beginning Tuesday, April 18, to transfer hardware. Full schedule and NASA TV coverage: https://go.nasa.gov/3L18AfG",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "NASA experts will join \n@Axiom_Space\n at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the \n@Space_Station\n. How to tune in: https://go.nasa.gov/412KmqK",
    "Get to know the #Artemis II astronauts headed to the Moon! Learn more about \n@Astro_Christina\n, \n@Astro_Jeremy\n, \n@AstroVicGlover\n, and \n@Astro_Reid\n: https://nasa.gov/specials/artemis-ii/…",
    "Welcome to Twitter, \n@NASAScienceAA\n! \n\nDr. Nicky Fox, our head of #NASAScience, will share updates about topics and missions ranging from our changing planet to our expanding universe. Follow along: http://science.nasa.gov",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…",
    "Through the lens of NASA photographer Aubrey Gemignani, we witness the people and hear the stories behind awe-inspiring missions to space. As a co-founder of \"Faces of NASA,\" we turn the camera on her and share her story: https://go.nasa.gov/42CIoPj",
    "First light data from the NASA-\n@CNES\n SWOT mission reveals that it provides 10 times the resolution of ocean measurements than data gathered by seven other satellites combined. These measurements will help us better study Earth’s surface water. https://go.nasa.gov/3z5hIJj",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "Join us March 24 at 1pm ET to chat with \n@JHUAPL\n's Zibi Turtle about Saturn’s mammoth moon Titan and the #Dragonfly mission that will study the prebiotic chemistry occurring on its surface. Use #AskAstrobio for questions! \n\nSet a reminder to join  https://youtube.com/live/v-hS1koBJns?feature=share…"
]