[
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "What’s your favorite planet?",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n work on upgrades to the \n@Space_Station\n's power system.",
    "Two cosmonauts will conduct a pair of spacewalks on Wednesday, May 3, and Friday, May 12, to relocate hardware outside the \n@Space_Station\n. Details and coverage info: https://go.nasa.gov/44blzDe",
    "Are you ready for a spacewalk?\n\nAstronauts Steve Bowen and \n@Astro_Alneyadi\n will step out of the \n@Space_Station\n around 9:15am ET (1315 UTC) on Friday, April 28 to prepare for upcoming power upgrades. Coverage starts here and on NASA TV at 7:45am (1145 UTC): https://go.nasa.gov/40Iopww",
    "Last year was pretty busy. \n\nWe launched to the Moon. We yeeted a spacecraft into an asteroid (on purpose.) And we unveiled images from a brand new space telescope. NBD. \n\nOh yeah, we also nabbed nine noms for the #Webbys. If you like what you saw, vote? http://go.nasa.gov/3KBXNZl",
    "Dragon is soaring home! \n\n\n@SpaceX\n's cargo spacecraft separated from the \n@Space_Station\n at 11:05am ET (1505 UTC), carrying space-grown tomatoes and other \n@ISS_Research\n for analysis back on the ground. Follow our ISS blog for the latest #CRS27 updates: http://blogs.nasa.gov/spacestation",
    "LIVE: \n@SpaceX\n's #CRS27 cargo mission is scheduled to undock from the \n@Space_Station\n at 11:05am ET (1505 UTC) today.\n\nLearn more about the \n@ISS_Research\n it's bringing back to Earth: https://go.nasa.gov/4059R9F",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "NASA experts will join \n@Axiom_Space\n at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the \n@Space_Station\n. How to tune in: https://go.nasa.gov/412KmqK",
    "Get to know the #Artemis II astronauts headed to the Moon! Learn more about \n@Astro_Christina\n, \n@Astro_Jeremy\n, \n@AstroVicGlover\n, and \n@Astro_Reid\n: https://nasa.gov/specials/artemis-ii/…",
    "Welcome to Twitter, \n@NASAScienceAA\n! \n\nDr. Nicky Fox, our head of #NASAScience, will share updates about topics and missions ranging from our changing planet to our expanding universe. Follow along: http://science.nasa.gov",
    "We’re developing new resources for finding and tracking asteroids.\n\nLive from \n@UNOOSA\n #IAAPDC2023, hear from Dr. Bhavya Lal, head of NASA technology, policy, and strategy on our commitment to planetary defense.\n\nWatch April 4 7:40am ET (1140 UTC) https://unoosa.org/oosa/en/ourwork/topics/neos/2023/IAAPDC/index.html…",
    ".\n@WHOSTP\n just released a new planetary defense strategy that will help our nation more effectively detect, prepare for,  and thwart near-Earth object hazards.\n\nLearn more about our work to advance  leadership and international cooperation in space.",
    "The \n@NASA\n Artemis II crewed mission around the Moon will inspire the next generation of explorers, and show every child – in America, in Canada, and across the world – that if they can dream it, they can be it.",
    "Here they are. \n@SenBillNelson\n announces the #Artemis II crew, the next astronauts to fly around the Moon:\n\n\n@Astro_Christina\n\n\n@Astro_Jeremy\n\n\n@AstroVicGlover\n\n\n@Astro_Reid\n\n\nWe go together. http://nasa.gov/specials/artemis-ii/…",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to @NASAWebb’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "NASA experts will join @Axiom_Space at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the @Space_Station. How to tune in: https://go.nasa.gov/412KmqK",
    "Get to know the #Artemis II astronauts headed to the Moon! Learn more about @Astro_Christina, @Astro_Jeremy, @AstroVicGlover, and @Astro_Reid: https://nasa.gov/specials/artemis-ii/…",
    "Welcome to Twitter, @NASAScienceAA! \n\nDr. Nicky Fox, our head of #NASAScience, will share updates about topics and missions ranging from our changing planet to our expanding universe. Follow along: http://science.nasa.gov"
]