[
    "Training begins for the \n@NASAArtemis\n II astronauts!\n\nWhile some of us are enjoying the start of summer vacation, they just began training for their mission to the Moon and back.\n\nHere's the trajectory map they covered in class this week: https://go.nasa.gov/44dztUs",
    "A new way to visualize our changing planet, \n@NASAWebb\n searches for an atmosphere on TRAPPIST-1 c, and a look inside the future home of asteroid samples from OSIRIS-REx.\n\nAll this and more—This Week at NASA. http://nasa.gov/subscribe",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "We created the Earth Information Center with founding partners across the federal government, including the \n@EPA\n, \n@FEMA\n, \n@NOAA\n, \n@USAID\n, \n@USDA\n, and \n@USGS\n.\n \nTogether, we're delivering satellite data directly to people, whether they live on farms or in cities.… Show more",
    "LIVE: Watch the ribbon-cutting for our new Earth Information Center at NASA Headquarters in Washington. The new tool will provide data to the public and decision makers to help adapt and respond to our changing planet: https://go.nasa.gov/eic",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Two Roscosmos cosmonauts will conduct a spacewalk to make upgrades to the \n@Space_Station\n on Thursday, June 22, beginning around 10:20am ET (1420 UTC). NASA TV coverage starts at 9:45am ET (1345 UTC): https://go.nasa.gov/43M2AOM",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "Astronauts-eye view \n\nTake a look through the helmet cams of \n@Astro_Woody\n and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Suits are set to battery power and today's spacewalk is underway!\n\nThis is Hoburg's second spacewalk and Bowen's 10th—tying a record for most spacewalks made by a U.S. astronaut.",
    "Astronauts Frank Rubio and \n@Astro_Alneyadi\n are closing the hatch in the \n@Space_Station\n's Quest airlock as Steve Bowen and \n@Astro_Woody\n prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with \n@GoogleArts\n, \n@NASAGoddard\n scientist Dr. Heather Graham sits down with \n@Astro_Kobi\n to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. \n@NASAJPL\n's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n will install another roll-out solar array on the \n@Space_Station\n, scheduled to start at 8:55am ET (1255 UTC).",
    "Live Now \n\nJoin us for a \"guided tour\" of our \"Eyes on Asteroids\" real-time visualization app. Learn how to use the tool and explore the 28,000 known asteroids and comets in our cosmic neighborhood.",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "Time for work! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the \n@Space_Station\n.",
    "LIVE: Spacewalk with us. Watch as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n install a new roll-out solar array on the \n@Space_Station\n, scheduled to start at 9:15am ET.",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the @Space_Station and @NASA_Astronauts Steve Bowen and @Astro_Woody performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This @NASAEarth computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at @NASA. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".@NASA_Astronauts Stephen Bowen and @Astro_Woody successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today."
]