[
    "Come one, come all. Am talking commercial space tomorrow with \n@elonmusk",
    "Solar Roof is built to withstand any weather, including heavy storms & hail",
    "After ice severed a fiber optic cable in the Arctic Ocean, cutting internet & cell service across Northern Alaska, the Starlink team has been coordinating with the State of Alaska, various local governments & Native communities to help provide connectivity where it’s needed most",
    "Come one, come all. Am talking commercial space tomorrow with @elonmusk",
    "Great conversation with @NarendraModi",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Liftoff!",
    "“Highlights Tab” is now live on Twitter. You can now showcase your favorite tweets on your profile. ",
    "Oh hi lol",
    "\"We should be able to express things, otherwise it is censorship and at some point, censorship goes against you.\" \n- @ElonMusk discusses with @Cheydema, CEO @Orange at #VivaTech",
    "Accounts that try to game our verification system with non-sequitur self-promotion or advertise in a misleading way will be suspended",
    "Or a social media media company",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "It is worth noting that kids who are same-sex attracted and/or autistic are the most vulnerable",
    "Big difference",
    "Archived version",
    "Powerful article",
    "It’d be great to have \n@maddow\n, \n@donlemon\n & others on the left put their shows on this platform. No exclusivity or legal docs required!\n\nYou will receive our full support. The digital town square is for all.",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Would be great to have shows from all parts of the political spectrum on this platform!",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    ".",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…"
]