[
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "Great statement by @votetimscott!",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "",
    "Feeling nostalgic",
    "Dragon is go for docking",
    "Thank you to our 1.5M+ customers around the world! ",
    "Highly recommend that organizations sign up and validate their affiliates to prevent impersonation",
    "Starlink is self-orienting and connects in minutes as long as it has a clear view of the sky. Open the Starlink App to check for any obstructions ",
    "Given the moves by Fox and CNN news today with the firings of Don Lemon and Tucker Carlson, I think what we have is mainstream media realizing that change is needed. People don't want to be mislead by news stations. They also don't want misogynistic viewpoints to flourish.\n\nAs… Show more",
    "We’re rapidly improving transparency & fairness on this platform, but there is still a lot of work to do",
    "Hard to believe Starship actually did launch on 4/20 lol",
    "Content creators may wish to enable subscriptions on this platform. \n\nJust tap on Monetization in settings.",
    "We live in the most interesting of times",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "check mate",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "What makes @CommunityNotes so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "Teams are working towards Thursday, April 20 for the first flight test of a fully integrated Starship and Super Heavy rocket → http://spacex.com/launches/mission/?missionId=starship-flight-test…"
]