[
    "The problem is that the passive/index funds outsource voting to shareholder services companies, which are controlled by activists who act in a manner contrary to the interests of shareholders. \n\nThis is probably the biggest class-action opportunity in history.",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Beat previous record by >8 seconds!",
    "Hosting @RobertKennedyJr’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 @Starlink satellites to orbit from Florida",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Sorry this app takes up so much space",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "Office Space is an awesome movie",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more"
]