[
    "Scientists using \n@NASAWebb\n have detected a crucial carbon compound in space for the first time. Known as methyl cation (pronounced cat-eye-on), it’s thought to aid in building more complex carbon molecules—the foundation for all known life: https://go.nasa.gov/3NpjpIA",
    "Mark your calendars for April 8, 2024: A total solar eclipse will darken the skies of North America as the Moon blocks the light of the Sun for a few minutes.\n\nWe're funding five experiments to study the Sun, Earth, and their interactions: https://go.nasa.gov/42T5U9L",
    "I think we win this one. Happy #NationalSelfieDay ",
    "We've reaffirmed our shared commitment with the \n@USDA\n to benefit people everywhere. Our continued collaboration aims to address climate challenges and bolster plant-based research on the \n@Space_Station\n that could help improve food security on Earth. https://go.nasa.gov/3qXbYAN",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "We created the Earth Information Center with founding partners across the federal government, including the \n@EPA\n, \n@FEMA\n, \n@NOAA\n, \n@USAID\n, \n@USDA\n, and \n@USGS\n.\n \nTogether, we're delivering satellite data directly to people, whether they live on farms or in cities.… Show more",
    "LIVE: Watch the ribbon-cutting for our new Earth Information Center at NASA Headquarters in Washington. The new tool will provide data to the public and decision makers to help adapt and respond to our changing planet: https://go.nasa.gov/eic",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Suits are set to battery power and today's spacewalk is underway!\n\nThis is Hoburg's second spacewalk and Bowen's 10th—tying a record for most spacewalks made by a U.S. astronaut.",
    "Astronauts Frank Rubio and \n@Astro_Alneyadi\n are closing the hatch in the \n@Space_Station\n's Quest airlock as Steve Bowen and \n@Astro_Woody\n prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the \n@Space_Station\n and \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\"",
    "LIVE: Tune in as we review next steps for the Psyche mission, set to launch no earlier than Oct. 2023. The spacecraft will study a metal-rich asteroid of the same name that may be the partial core of a building block of rocky planets in our solar system.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the \n@Space_Station\n, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "LIVE: Experts at \n@NASA_Johnson\n are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the \n@Space_Station\n.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post."
]