[
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "After just over a week in space, @Axiom_Space's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two @NASA_Astronauts will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the @Space_Station. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with @BoeingSpace ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the @Space_Station: https://go.nasa.gov/3MZR1xG",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two \n@NASA\n Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Join us tomorrow from the \n@Space_Station\n!\n\nWith #Crew6 aboard, \n@SpaceX\n's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "@WomenNASA\n Liz Landau, host and science communicator\n\n\n@ChandraXray\n Daryl Haggard, astrophysicist\n\n\n@NASAJPL\n Michele Vallisneri, theoretical physicist\n\n\n@NASAUniverse\n Regina Caputo, astrophysicist",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "What's your favorite @NASAHubble image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, @VP Kamala Harris & @President_KR Yoon Suk Yeol will tour @NASAGoddard and meet with scientists to see firsthand climate change research underway. They will also take an early look at @NASARoman, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades.",
    "NOW: @NASAEarth and @CenterForAstro scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at @nasa.",
    "Space tomatoes, heart studies, and other @ISS_Research experiments are heading back to Earth this weekend on @SpaceX's #CRS27, the latest cargo return from the @Space_Station.\n\nUndocking coverage begins Saturday, April 15, at 10:45am ET (1445 UTC): https://go.nasa.gov/3zRgx0q"
]