[
    "Interview with \n@BillMaher",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "Interview with @BillMaher",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the @FortniteGame Chapter 4 release with @FindYourBattle—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "For my part, I just want to support content creators, whether or not they provide extra content when you subscribe",
    "Your support of content creators on this platform is very much appreciated.\n\nWe keep none of the subscription revenue for the first 12 months & only 10% thereafter.",
    "Increasing lithium refining capacity is critical to a sustainable energy economy—today, we're breaking ground on our in-house lithium refinery outside of Corpus Christi, TX. \n\nThis facility will also prioritize the elimination of a challenging refinery byproduct (sodium sulfate).… Show more",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "First Model Y deliveries in Türkiye",
    "We’re purging accounts that have had no activity at all for several years, so you will probably see follower count drop",
    "Tesla Lithium Refinery groundbreaking will be streamed live on Twitter at 3 PM CDT",
    "What should do more of or less of or aren’t including at all?",
    "We’re trying hard to make your feed as compelling as possible (maximize unregretted user minutes). \n\nHow is it now vs 6 months ago?",
    "Interesting article. Perhaps @CommunityNotes can add further context & corrections.",
    "Sorry our video upload is so bad! We’re working on major improvements. \n\nI recommend 480p for video longer than 10 mins, as that resolution is fine for phone/laptop users.",
    "The more screentime users spend looking at a post, whether text, pic or video, the more it is boosted. \n\nVideo posted natively to this platform will be boosted more than an external link, because way more time is spent watching a video than clicking on a link.",
    "The more screentime users spend looking at a post, whether text, pic or video, the more it is boosted. \n\nVideo posted natively to this platform will be boosted more than an external link, because way more time is spent watching a video than clicking on a link. https://twitter.com/EdKrassen/status/1653444378101161987…",
    "Sunset in space",
    "They are the same picture",
    "Cult / Culture",
    "Falcon Heavy’s 27 Merlin engines together generate more than 5 million pounds of thrust at liftoff",
    "Falcon Heavy launches \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit",
    "How it started:                                              How it's going:",
    "Even benign dependency on AI/Automation is dangerous to civilization if taken so far that we eventually forget how the machines work"
]