[
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of \n@NASAInterns\n. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Soon, we'll announce the company selected to develop the landing system for the #Artemis V Moon mission, which will take astronauts from lunar orbit to the surface and back. Tune in Friday, May 19 at 10am ET (1400 UTC): https://go.nasa.gov/42T3sk4",
    "LIVE: Leaders from NASA, \n@Axiom_Space\n, and \n@SpaceX\n are sharing updates on #Ax2's upcoming mission to the \n@Space_Station\n following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "REPORTERS: The #Artemis II crew is coming to Washington with media availability on May 17-18.\n\nThese four astronauts will fly around the Moon during the 10-day flight test. https://go.nasa.gov/3I8qR9a",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for \n@NASASTEM\n: http://go.nasa.gov/3nm6fTI",
    "Interacting galaxies, known as AM 1214-255, shine bright in this new view from Hubble!\n\nBoth galaxies contain active galactic nuclei, which are luminous central regions that host a black hole. Learn more for #BlackHoleWeek: https://go.nasa.gov/3VoUSa9",
    "LIVE: Two cosmonauts are about to start a spacewalk to help install an experiment airlock on the \n@Space_Station\n's Nauka science module. Tune in for NASA TV coverage at http://nasa.gov/live.",
    "“I can see you’re lonely down there... Don’t you know that I’m right here?”\n\nHonored to be an inspiration to robots everywhere, \n@Harry_Styles\n. ",
    "Our #BlackHoleWeek event is on the horizon.  \n\nJoin our May 5 \n@TwitterSpaces\n to learn from experts as they talk about black holes, including the one at the center of our galaxy. #AskNASA your questions and they might be answered live.",
    "LIVE NOW: The Czech Republic is signing the #Artemis Accords, joining more than 20 nations from all over the world committed to the peaceful and safe exploration of space: http://nasa.gov/live",
    "May is a good month for skywatchers. Venus, Mars, and Jupiter cozy up to the Moon, and even Saturn makes a cameo. Where and when to look: https://go.nasa.gov/37ePy0B",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the \n@Space_Station\n: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    "Houston, we have Posty\n\nAs we approach #EarthDay, watch \n@PostMalone\n get astronaut-struck as he chats with two crew members aboard the \n@Space_Station\n, Stephen Bowen & Woody Hoburg, about how their unique perspective changes the way they see our home planet. http://nasa.gov/earth-day-2023",
    "Congrats to \n@SpaceX\n on Starship’s first integrated flight test! Every great achievement throughout history has demanded some level of calculated risk, because with great risk comes great reward. Looking forward to all that SpaceX learns, to the next flight test—and beyond.",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    ".\n@VP\n spoke to the #Artemis II astronauts about their upcoming mission around the Moon, and how it will pave the way for future long-term human exploration missions to the Moon, and eventually Mars.",
    "Our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission successfully launched. TEMPO will provide hourly, daytime measurements of air quality in North America. It will monitor three main pollutants and reveal disparities in exposure in our cities and communities: https://go.nasa.gov/40Q9v89",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission is flying free from its \n@SpaceX\n Falcon 9 rocket and on its way to geostationary orbit.",
    "Liftoff! Our #TEMPO mission and its host satellite are on the way to space. The size of a dishwasher, TEMPO is powerful enough to observe air pollutants across North America down to a resolution of 4 square miles (10 square km).",
    "LIVE: Watch #TEMPO launch to orbit on a \n@SpaceX\n Falcon 9 rocket. Liftoff expected as early as 12:30am ET (0430 UTC).\n\nThe \n@NASAEarth\n & \n@CenterForAstro\n mission is set to revolutionize air quality observations.",
    " Launch alert: A new space-based instrument will monitor air quality across North America, providing hourly measurements to improve forecasts & inform policymakers.\n\n#TEMPO is set to lift off no earlier than 12:30am ET (0430 UTC), Friday, April 7. Watch: https://go.nasa.gov/3Gsbt6v",
    "From space, air, and on the ground, \n@nasa\n studies Earth and the ways it is changing. These observations help us better understand – and prepare for – the effects of human-caused climate change.\n \nToday we released our 2023 climate strategy. https://go.nasa.gov/40rbT5a",
    "Travel to the Australian Outback to learn about the launch of a sounding rocket – a small rocket bringing science instruments briefly to space, studying everything from our atmosphere to the stars.\n\nThe latest episode of our Curious Universe podcast: http://go.nasa.gov/3G0K4IF",
    "Last October, a pulse of intense radiation swept through the solar system so extraordinary that astronomers quickly dubbed it the BOAT – the brightest of all time. The source? A gamma-ray burst, the most powerful class of explosions in the universe. https://go.nasa.gov/42HrCyB",
    "LIVE NOW: Join NASA and \n@BoeingSpace\n mission experts for a media teleconference with an update on the Crew Flight Test of the #Starliner spacecraft to the \n@Space_Station\n: https://youtube.com/live/ABVJ6qpgy1M?feature=share…",
    "On April 3, you will meet the team of astronauts flying to the Moon on the #Artemis II mission.\n\nThese explorers will pave the way for future lunar landings and our next giant leap — human exploration of Mars. https://youtube.com/live/mua1Lysc_JQ?feature=share…",
    "See what it's like to have a 6.2-million-gallon pool as your office and dive into \n@NASASTEM\n's latest Surprisingly STEM episode. NASA diver Arielle Valdez shares her STEM career story & what it's like to find #YourPlaceInSpace.",
    "Join NASA and \n@BoeingSpace\n mission experts for a media teleconference with an update on the Crew Flight Test of the #Starliner spacecraft to the \n@Space_Station\n, this Wednesday, March 29, at 2pm ET (1800 UTC). More details: https://go.nasa.gov/42Oi4lq"
]