[
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Excited to welcome Ford owners to thousands of Superchargers across North America next year",
    "Watch Falcon 9 launch 22 @Starlink satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "I have spaceships",
    "AI ",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "I recommend subscribing to \n@shellenberger",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship.",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "The idea that governments around the world have for years been secretly censoring ordinary citizens sounds crazy, but it's true. Worse, they are now on the cusp of imposing what can only be described as a totalitarian system to end freedom of speech as we know it.",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Two Falcons on two SpaceX pads in Florida. If the weather cooperates, launch windows open 2+ hours apart for these two missions → http://spacex.com/launches",
    "Note, it takes a few days longer for subscriptions to go active on iPhone vs web, as all subscriptions currently have to be approved by Apple",
    "Content creators can now enable subscriptions to their text, pics & video worldwide on this platform!"
]