[
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "@NASAUniverse\n: Judy Racusin, astronomer at NASA Goddard\n\n@NASA_Marshall\n: Cori Fletcher, astronomer at NASA Marshall via USRA\n\n@PSUScience\n: Jamie Kennea, astronomer at #PennState\n\n@WomenNASA\n: Liz Landau, host, NASA HQ",
    ".\n@EuropaClipper\n is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at \n@NASAJPL\n your questions live now:",
    "We're going on a spacewalk!\n\nJoin us tomorrow, June 9, as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n step outside the \n@Space_Station\n. Friday's spacewalk is scheduled to start at 9:15am ET (1315 UTC), with live coverage beginning at 7:45am ET (1145 UTC) on Twitter and NASA TV.",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this \n@NASA_SLS\n model: https://go.nasa.gov/3MXGvpc",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "The image from this post is by Lauren Dauphin, who used an image from @NOAA’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "We're going on a spacewalk!\n\nJoin us tomorrow, June 9, as @NASA_Astronauts Steve Bowen and @Astro_Woody step outside the @Space_Station. Friday's spacewalk is scheduled to start at 9:15am ET (1315 UTC), with live coverage beginning at 7:45am ET (1145 UTC) on Twitter and NASA TV.",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this @NASA_SLS model: https://go.nasa.gov/3MXGvpc",
    "Congrats to @SpaceX on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for @NASA helping build @Space_Station, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. @NASAClimate scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with @Astro_Woody, who will make his first trip outside the @Space_Station on Friday, June 9:",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Almost all known black holes come in two sizes: small and gigantic. Data suggests intermediate-sized ones exist, but they're rare.\n \nAstronomers using \n@NASAHubble\n have found evidence of one in a star cluster about 6,000 light-years away: https://go.nasa.gov/3WBaMys",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the \n@Space_Station\n at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi"
]