[
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from \n@NASAKennedy\n at 5:37pm ET (2137 UTC).",
    "Did you catch our latest \n@NASAArtemis\n Moon Minute in the Axiom-2 launch broadcast?\n\n\n@NASA\n and \n@Axiom_Space\n are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the \n@Space_Station\n for scientific research, student outreach and commercial activities on \n@Axiom_Space\n's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and \n@SpaceX\n—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the \n@Space_Station\n, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "Recent studies from @NASAAmes shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four @Axiom_Space private astronauts entered the orbital outpost after opening the @SpaceX Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The @SpaceX Dragon crew ship with four private astronauts from @Axiom_Space docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on @NASA TV.",
    "NOW: Watch the @Axiom_Space #Ax2 astronauts arrive at the @Space_Station. The @SpaceX Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, @Axiom_Space's second all-private mission to the @Space_Station.",
    "#Ax2's @SpaceX Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the @Space_Station.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from @NASAKennedy at 5:37pm ET (2137 UTC).",
    "Did you catch our latest @NASAArtemis Moon Minute in the Axiom-2 launch broadcast?\n\n@NASA and @Axiom_Space are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the @Space_Station for scientific research, student outreach and commercial activities on @Axiom_Space's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and @SpaceX—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the @Space_Station, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "What’s your favorite planet?",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…"
]