[
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "Forty years ago today, Sally Ride launched into history as the first U.S. woman to go to space. An astronaut, physicist, and educator, she inspired generations of women and girls to pursue careers in science and technology. https://go.nasa.gov/3NzVmHU",
    "Happy Father’s Day, Sun \n\nOur Sun may be old, large, and full of gas, but it also provides our solar system with energy and light, without which life as we know it would not exist. Shout out a father figure who gives you energy:",
    "Every December, the Geminids light up the night sky in one of the biggest meteor showers of the year.\n\nAs our Parker Solar Probe swoops around the Sun—closer than any spacecraft in history—it's helping uncover how these shooting stars came into existence: https://go.nasa.gov/3NfS0se",
    "Suits are set to battery power and today's spacewalk is underway!\n\nThis is Hoburg's second spacewalk and Bowen's 10th—tying a record for most spacewalks made by a U.S. astronaut.",
    "Astronauts Frank Rubio and \n@Astro_Alneyadi\n are closing the hatch in the \n@Space_Station\n's Quest airlock as Steve Bowen and \n@Astro_Woody\n prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with \n@GoogleArts\n, \n@NASAGoddard\n scientist Dr. Heather Graham sits down with \n@Astro_Kobi\n to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. \n@NASAJPL\n's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n will install another roll-out solar array on the \n@Space_Station\n, scheduled to start at 8:55am ET (1255 UTC).",
    "Live Now \n\nJoin us for a \"guided tour\" of our \"Eyes on Asteroids\" real-time visualization app. Learn how to use the tool and explore the 28,000 known asteroids and comets in our cosmic neighborhood.",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "Astronauts Frank Rubio and @Astro_Alneyadi are closing the hatch in the @Space_Station's Quest airlock as Steve Bowen and @Astro_Woody prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and @Astro_Woody are installing a new roll-out solar array outside the @Space_Station.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with @GoogleArts, @NASAGoddard scientist Dr. Heather Graham sits down with @Astro_Kobi to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. @NASAJPL's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! @NASA_Astronauts Steve Bowen and @Astro_Woody will install another roll-out solar array on the @Space_Station, scheduled to start at 8:55am ET (1255 UTC).",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control @NASA_Johnson was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Teamwork makes the dream work! Researchers at @NASAAmes are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the @Space_Station and @NASA_Astronauts Steve Bowen and @Astro_Woody performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This @NASAEarth computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at @NASA. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".@NASA_Astronauts Stephen Bowen and @Astro_Woody successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the @Space_Station. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more @ISS_Research.",
    "Time for work! @NASA_Astronauts Steve Bowen and @Astro_Woody have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the @Space_Station.",
    "LIVE: Spacewalk with us. Watch as @NASA_Astronauts Steve Bowen and @Astro_Woody install a new roll-out solar array on the @Space_Station, scheduled to start at 9:15am ET.",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay",
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\""
]