[
    "Our next cargo mission to the \n@Space_Station\n is set to lift off from \n@NASA_Wallops\n on Tuesday, Aug. 1!\n\n\n@NorthropGrumman\n's #NG19 launch will carry gene therapy research, materials to study fires in space, and digital art from students around the world: https://go.nasa.gov/3JAWhFE",
    "As Chair of the National Space Council, I am thrilled to announce the public opening of \n@NASA\n's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, \n@NASAAero\n leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "\"And when we do things that improve equity for the people who have it the worst, we are improving equity across the board.\" — S. J. Ralston, Mars research scientist, advocates for transgender and nonbinary people in the workplace. #PrideMonth https://nasa.gov/faces-of-nasa/sj-ralston…",
    "LIVE: Two cosmonauts are stepping outside the \n@Space_Station\n to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "I think we win this one. Happy #NationalSelfieDay ",
    "We've reaffirmed our shared commitment with the \n@USDA\n to benefit people everywhere. Our continued collaboration aims to address climate challenges and bolster plant-based research on the \n@Space_Station\n that could help improve food security on Earth. https://go.nasa.gov/3qXbYAN",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "In the early universe, the gas between stars and galaxies was opaque – energetic starlight could not penetrate it. But 1 billion years after the big bang, the gas had become completely transparent. Why? New data from \n@NASAWebb\n has pinpointed the reason: https://go.nasa.gov/3qCcOmn",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our \n@NASAUniverse\n NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the \n@EuropaClipper\n spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the \n@Space_Station\n and \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this \n@NASA_SLS\n model: https://go.nasa.gov/3MXGvpc",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in."
]