[
    "LIVE: Experts at \n@NASA_Johnson\n are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the \n@Space_Station\n.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the \n@Space_Station\n at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " LIVE: Deputy Administrator \n@Astro_Pam\n delivers a plenary address at #38Space discussing progress towards a blueprint for sustained human exploration of the Moon and beyond with \n@NASAArtemis\n. https://bit.ly/3GQNi1S",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "Astronauts need spacesuits for different occasions: life and work inside a spacecraft, spacewalks, and one day, planetary walks. In this episode of the Curious Universe podcast, we explore spacesuit design and creation, from fittings to new features: https://go.nasa.gov/3zxE6LK",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…",
    "If you’ve been tuning in, you know landing on Mars is half of the battle–returning the first astronauts home from the Red Planet is the other half.\nListen in as four experts discuss in this week's episode of “Houston, We have a Podcast”: https://go.nasa.gov/42FdMN9",
    "Want to help keep Earth safe from near-Earth asteroids? Join the International Astronomical Search Collaboration and help us find more of these remnants left over from the early formation of our solar system. \n@DoNASAScience\n at: https://science.nasa.gov/citizenscience?field_division_tid=81…",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at"
]