[
    "What are gravitational waves? We dove into this topic in an episode of our Curious Universe podcast (transcript included):",
    "Congratulations to NANOGrav for detecting evidence that gravitational waves fill the cosmos. \n\nThese ripples in the fabric of space happen when massive objects like black holes circle one another before colliding. The result brings us closer to understanding how galaxies evolve.… Show more",
    "Is NASA mining asteroids? No, but we love studying them. \n\nThe science gained from asteroid missions—like our upcoming #PsycheMission to a unique metal-rich world—could one day benefit future cosmic resource endeavors. http://nasa.gov/asteroids",
    "Come explore asteroids with us!\n\nTake a guided tour of our “Eyes on Asteroids” visualization app today at 11am PT (2pm ET). Our guide and an asteroid expert will show you how to explore ~28,000 near-Earth objects and talk about the ways we study them. http://bit.ly/asteroids-live",
    "NOW: A \n@NASAAero\n project update on the experimental X-57 all-electric aircraft.",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "Another busy week at NASA\n\n\n@NASA_Astronauts\n install solar arrays on the \n@Space_Station\n, a new X-plane is named, and a laser communication system for #Artemis awaits integration.\n\nSubscribe for more space and aeronautics in your life: http://nasa.gov/subscribe",
    "U.S. and international media: You are invited to \n@NASAKennedy\n to interview subject matter experts and view the \n@NASA_Orion\n spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at \n@NASAKennedy\n. https://go.nasa.gov/3NfJcCU",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "@NASAUniverse\n: Judy Racusin, astronomer at NASA Goddard\n\n@NASA_Marshall\n: Cori Fletcher, astronomer at NASA Marshall via USRA\n\n@PSUScience\n: Jamie Kennea, astronomer at #PennState\n\n@WomenNASA\n: Liz Landau, host, NASA HQ",
    ".\n@EuropaClipper\n is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at \n@NASAJPL\n your questions live now:",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "We're going on a spacewalk!\n\nJoin us tomorrow, June 9, as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n step outside the \n@Space_Station\n. Friday's spacewalk is scheduled to start at 9:15am ET (1315 UTC), with live coverage beginning at 7:45am ET (1145 UTC) on Twitter and NASA TV.",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the \n@Space_Station\n, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Keep your eyes in the sky throughout June — you may see the Moon, Mars, Venus, Saturn, Jupiter, or even the Stars of the Summer Triangle!\n\nGet the details with our monthly episode of What’s Up: http://go.nasa.gov/37ePy0B",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "There’s space for everyone this #PrideMonth, and we’re celebrating the LGBTQI+ employees who help us reach for the stars, examine humanity’s place in the universe, and study our home planet: http://go.nasa.gov/3C9ncnU"
]