[
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "@NASAUniverse\n: Judy Racusin, astronomer at NASA Goddard\n\n@NASA_Marshall\n: Cori Fletcher, astronomer at NASA Marshall via USRA\n\n@PSUScience\n: Jamie Kennea, astronomer at #PennState\n\n@WomenNASA\n: Liz Landau, host, NASA HQ",
    "Time for work! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the \n@Space_Station\n.",
    "LIVE: Spacewalk with us. Watch as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n install a new roll-out solar array on the \n@Space_Station\n, scheduled to start at 9:15am ET.",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the \n@Space_Station\n, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "LIVE: Listen as we discuss the science aboard the next \n@SpaceX\n cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: Watch the second pair of shoebox-sized satellites launch to orbit for our storm-tracking TROPICS mission. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 11:46pm ET (0346 UTC) at the opening of the launch window.",
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of \n@NASAInterns\n. Apply by Saturday, May 27: https://intern.nasa.gov",
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow \n@NASAEarth\n!",
    "Liftoff! Two small satellites are on the way to join two already in orbit for our TROPICS mission. TROPICS will provide near-hourly data that could improve forecasts of tropical cyclones and severe weather.",
    "Our \n@NASASTEM\n educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the \n@usedgov\n, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig",
    "50 years ago today, Pete Conrad, Joseph Kerwin, and Paul Weitz lifted off from \n@NASAKennedy\n, heading to Skylab: America's first space station.\n\nOur Skylab missions laid the groundwork for \n@NASA_Astronauts\n to live and work in space, from the \n@Space_Station\n to the Moon and beyond.",
    "Almost all known black holes come in two sizes: small and gigantic. Data suggests intermediate-sized ones exist, but they're rare.\n \nAstronomers using \n@NASAHubble\n have found evidence of one in a star cluster about 6,000 light-years away: https://go.nasa.gov/3WBaMys",
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y"
]