[
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "NASA experts will join \n@Axiom_Space\n at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the \n@Space_Station\n. How to tune in: https://go.nasa.gov/412KmqK",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…",
    "Through the lens of NASA photographer Aubrey Gemignani, we witness the people and hear the stories behind awe-inspiring missions to space. As a co-founder of \"Faces of NASA,\" we turn the camera on her and share her story: https://go.nasa.gov/42CIoPj",
    "Want to help keep Earth safe from near-Earth asteroids? Join the International Astronomical Search Collaboration and help us find more of these remnants left over from the early formation of our solar system. \n@DoNASAScience\n at: https://science.nasa.gov/citizenscience?field_division_tid=81…",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "First light data from the NASA-\n@CNES\n SWOT mission reveals that it provides 10 times the resolution of ocean measurements than data gathered by seven other satellites combined. These measurements will help us better study Earth’s surface water. https://go.nasa.gov/3z5hIJj",
    "Join us March 24 at 1pm ET to chat with \n@JHUAPL\n's Zibi Turtle about Saturn’s mammoth moon Titan and the #Dragonfly mission that will study the prebiotic chemistry occurring on its surface. Use #AskAstrobio for questions! \n\nSet a reminder to join  https://youtube.com/live/v-hS1koBJns?feature=share…",
    "Scientists originally developed this lightweight material to protect spacecraft during atmospheric re-entry. Now, this \n@NASASpinoff\n technology is being used in clothing to keep the wearer warm without overheating when they’re on the move. https://go.nasa.gov/3lC99Tm",
    "Look westward to find the Moon as a beautiful slim crescent this evening after sunset, hanging just below blazing-bright Venus. Tomorrow evening, look west again to spot the Moon once more, this time shining from above Venus.\n\nSpot the duo? Share your pictures.",
    "JWST x SXSW: Tune in now to catch the \n@NASAWebb\n keynote LIVE from #SXSW, see an all-new image from the world's most powerful space telescope, and chat with space enthusiasts from around the world.",
    "Following their five-month mission aboard the space station, Crew-5 is safely back on Earth and will answer questions in a news conference at 2pm ET Wednesday, March 15, at \n@NASA_Johnson\n. Watch live on \n@NASA\n TV!",
    "LIVE: The \n@ISS_Research\n we're sending to space on tonight's #CRS27 launch could lead to healthier hearts and cleaner spacecraft—and that's just for starters.\n\nTune in now to our CRS-27 science telecon to learn more and share your Qs with #AskNASA:",
    "How about a big slice of pi(e)?\n\nWhether your favorite is apple, blueberry, or irrational, celebrate #PiDay with us! Check out some of the ways we use this mathematical constant to explore the universe: https://go.nasa.gov/2IKTXMB\n\nTell us how you're celebrating!",
    "LIVE: \n@NASAEarth\n & \n@CenterForAstro\n managers discuss TEMPO, a space-based instrument set for launch as early as April. TEMPO will improve life on Earth by revolutionizing the way scientists observe air quality.",
    " LIVE: Listen in as mission experts discuss the status of NASA's \n@SpaceX\n #CRS27 mission, which will bring new science, supplies, and snacks to the \n@Space_Station\n."
]