[
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "Time for work! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the \n@Space_Station\n.",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from \n@NASAKennedy\n at 5:37pm ET (2137 UTC).",
    "Did you catch our latest \n@NASAArtemis\n Moon Minute in the Axiom-2 launch broadcast?\n\n\n@NASA\n and \n@Axiom_Space\n are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the \n@Space_Station\n for scientific research, student outreach and commercial activities on \n@Axiom_Space\n's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and \n@SpaceX\n—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the \n@Space_Station\n, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "Recent studies from @NASAAmes shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four @Axiom_Space private astronauts entered the orbital outpost after opening the @SpaceX Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The @SpaceX Dragon crew ship with four private astronauts from @Axiom_Space docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on @NASA TV.",
    "NOW: Watch the @Axiom_Space #Ax2 astronauts arrive at the @Space_Station. The @SpaceX Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, @Axiom_Space's second all-private mission to the @Space_Station.",
    "#Ax2's @SpaceX Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the @Space_Station.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from @NASAKennedy at 5:37pm ET (2137 UTC).",
    "Did you catch our latest @NASAArtemis Moon Minute in the Axiom-2 launch broadcast?\n\n@NASA and @Axiom_Space are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the @Space_Station for scientific research, student outreach and commercial activities on @Axiom_Space's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and @SpaceX—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the @Space_Station, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "What’s your favorite planet?",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo"
]