[
    "Also, you can now change video playback speed",
    "→ → ",
    "Scrolling through tweets while watching mini video (pic in pic) is great",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "fwiw you can post thirst pics on twitter too",
    "All those moments, \nwill be lost in time\nlike tears in rain …",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "AKA, don’t pull out. @elonmusk",
    "@GovRonDeSantis announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "Spaces with @RonDeSantis in ~2 hours!",
    "BREAKING: @FoxNews confirms Florida Governor @RonDeSantis will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with @elonmusk.",
    "Welcome aboard the station #Ax2! The four @Axiom_Space private astronauts entered the orbital outpost after opening the @SpaceX Dragon crew ship hatch at 11am ET today.",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "As seen by an unaffected third party",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Powerwall now available in Spain →",
    "Say goodbye to prying eyes and hello to secure conversations. We're giving early access to Encrypted Direct Messages v1 to our verified users.\n\nWe're excited to get feedback, improve the experience, and roll it out to even more users. Learn more:",
    "Excited to announce that I’ve hired a new CEO for X/Twitter. She will be starting in ~6 weeks!\n\nMy role will transition to being exec chair & CTO, overseeing product, software & sysops."
]