[
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the @Space_Station shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in @SpaceX's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the @Space_Station. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their @SpaceX Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what @NASAExoplanets scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: @VP Kamala Harris & @President_KR Yoon Suk Yeol deliver remarks during their tour of @NASAGoddard to see our climate change research.",
    "What's your favorite @NASAHubble image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, @VP Kamala Harris & @President_KR Yoon Suk Yeol will tour @NASAGoddard and meet with scientists to see firsthand climate change research underway. They will also take an early look at @NASARoman, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades.",
    "NOW: @NASAEarth and @CenterForAstro scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at @nasa.",
    "Representing the \n@csa_asc\n on #Artemis II to the Moon is \n@Astro_Jeremy\n, from London, Ontario. \n\nJeremy Hansen was a fighter pilot before joining CSA, and currently works with NASA on astronaut training and mission operations. This will be Hansen’s first mission in space.",
    "Meet the first member of our #Artemis II Moon crew: mission specialist \n@Astro_Christina\n! \n\nChristina Koch visited the \n@Space_Station\n in 2019, where she took part in the first all-woman spacewalk. She began her career as an electrical engineer at \n@NASAGoddard\n.",
    "LIVE NOW: Who’ll fly around the Moon aboard the #Artemis II mission? You’re about to find out.\n\nThese astronauts will take the next giant leap — paving the way for future lunar landings and human exploration of Mars.",
    "If you’re on \n@Facebook\n, you can hit “going” for our watch event to get notifications and updates: https://fb.me/e/2BZNQrYBt"
]