[
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Beat previous record by >8 seconds!",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "Office Space is an awesome movie",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Deployment of @Arabsat BADR-8 confirmed",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Great statement by @votetimscott!",
    "Watch Falcon 9 launch 22 @Starlink satellites to orbit → http://spacex.com/launches"
]