[
    "50 schools across Rwanda are now connected with Starlink’s high-speed internet  \n\nh/t \n@RwandaGov\n and \n@InstituteGC\n → https://twitter.com/InstituteGC/status/1671196208948449280?s=20…",
    "Liftoff!",
    "These video foundation models will serve as the brain of both the car & Optimus robot \n\nJoin the Tesla AI team to build the future of robotics!\n\n→",
    "And will be trained on enormous amounts of compute",
    "50 schools across Rwanda are now connected with Starlink’s high-speed internet  \n\nh/t @RwandaGov and @InstituteGC → https://twitter.com/InstituteGC/status/1671196208948449280?s=20…",
    "Within 15 mins, you can recover up to 200 miles/275 km",
    "Once again, I’d like to offer this platform to anyone on the left. You will get equal treatment.",
    "Bold",
    "Why ESG is the devil …",
    "After delivering 72 spacecraft to orbit, Falcon 9 returns to Earth and completes SpaceX’s 200th landing of an orbital class rocket",
    "Falcon 9’s first stage has landed on Landing Zone 4, marking SpaceX’s 200th successful recovery of an orbital class rocket!",
    "Watch Falcon 9 launch 72 spacecraft to orbit → http://spacex.com/launches",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit from Florida",
    "Sentry Mode enables your Tesla to monitor & record potential threats while parked https://twitter.com/BLKMDL3/status/1667648464279437312…",
    "It’d be great to have \n@maddow\n, \n@donlemon\n & others on the left put their shows on this platform. No exclusivity or legal docs required!\n\nYou will receive our full support. The digital town square is for all.",
    "Great to work with you!",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…",
    "Beat previous record by >8 seconds!",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors."
]