[
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Keep your eyes in the sky throughout June — you may see the Moon, Mars, Venus, Saturn, Jupiter, or even the Stars of the Summer Triangle!\n\nGet the details with our monthly episode of What’s Up: http://go.nasa.gov/37ePy0B",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "LIVE: Get the latest details on the launch of @SpaceX’s #CRS28 uncrewed cargo resupply mission to the @Space_Station. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, @SpaceX’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the @Space_Station. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds @EuropaClipper travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "REPORTERS: The #Artemis II crew is coming to Washington with media availability on May 17-18.\n\nThese four astronauts will fly around the Moon during the 10-day flight test. https://go.nasa.gov/3I8qR9a",
    "A \n@NASAWebb\n finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Who made you the star you are today? Mention them to give them cosmic #MothersDay flowers.  \n\nThe Rosette Nebula, about 5,000 light-years from Earth, is a region in space where stars are formed. This image by the Spitzer Space Telescope shows the stellar nursery in infrared.",
    "LIVE: Leaders from NASA, \n@Axiom_Space\n, and \n@SpaceX\n are sharing updates on #Ax2's upcoming mission to the \n@Space_Station\n following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "LIVE: Two cosmonauts are about to start a spacewalk to help install an experiment airlock on the \n@Space_Station\n's Nauka science module. Tune in for NASA TV coverage at http://nasa.gov/live.",
    "Our #BlackHoleWeek event is on the horizon.  \n\nJoin our May 5 \n@TwitterSpaces\n to learn from experts as they talk about black holes, including the one at the center of our galaxy. #AskNASA your questions and they might be answered live.",
    "LIVE NOW: The Czech Republic is signing the #Artemis Accords, joining more than 20 nations from all over the world committed to the peaceful and safe exploration of space: http://nasa.gov/live",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for \n@NASASTEM\n: http://go.nasa.gov/3nm6fTI",
    "Interacting galaxies, known as AM 1214-255, shine bright in this new view from Hubble!\n\nBoth galaxies contain active galactic nuclei, which are luminous central regions that host a black hole. Learn more for #BlackHoleWeek: https://go.nasa.gov/3VoUSa9",
    "May is a good month for skywatchers. Venus, Mars, and Jupiter cozy up to the Moon, and even Saturn makes a cameo. Where and when to look: https://go.nasa.gov/37ePy0B",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the \n@Space_Station\n: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    "Looking for the latest news from low Earth orbit?\n\nFollow \n@NASASpaceOps\n for mission leadership updates as we live and work beyond our home planet.",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "Houston, we have Posty\n\nAs we approach #EarthDay, watch \n@PostMalone\n get astronaut-struck as he chats with two crew members aboard the \n@Space_Station\n, Stephen Bowen & Woody Hoburg, about how their unique perspective changes the way they see our home planet. http://nasa.gov/earth-day-2023",
    "Congrats to \n@SpaceX\n on Starship’s first integrated flight test! Every great achievement throughout history has demanded some level of calculated risk, because with great risk comes great reward. Looking forward to all that SpaceX learns, to the next flight test—and beyond."
]