[
    "Lil X just asked if there are police cats, since there are police dogs ",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Congratulations Neuralink team!",
    "Starlink helping to connect schools in Rwanda ",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Excited to welcome Ford owners to thousands of Superchargers across North America next year",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "",
    "I hope this platform increasingly brings you joy & elucidation",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Starlink on Siargao Island in the Philippines  \n\n: @buddhasiargao",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything"
]