[
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "Sentry Mode enables your Tesla to monitor & record potential threats while parked",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t @flyjsx",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "Office Space is an awesome movie",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Deployment of @Arabsat BADR-8 confirmed",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches"
]