[
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Liftoff!",
    "“Highlights Tab” is now live on Twitter. You can now showcase your favorite tweets on your profile. ",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi @elonmusk. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "“What are you thinking?”",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Starlink satellites are equipped with optical space lasers (pew pew), which allow us to provide truly global coverage and serve customers in the most remote locations on Earth http://starlink.com/technology",
    "Also, you can now change video playback speed",
    "→ → ",
    "Scrolling through tweets while watching mini video (pic in pic) is great",
    " For those who died for freedom ",
    "Dragon and the Ax-2 astronauts are set to depart the \n@space_station\n tomorrow at 11:05 a.m. ET → http://spacex.com/launches/mission/?missionId=ax-2…",
    "A escala em que a Starlink está conectando aqueles que antes não estavam conectados ou tinham acesso não confiável à Internet continua a crescer a cada dia\n\nDe escolas em áreas remotas a comunidades em toda a Amazônia, a Starlink está conectando mais de 50 mil clientes no Brasil!… Show more",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration"
]