[
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "Looking for the latest news from low Earth orbit?\n\nFollow @NASASpaceOps for mission leadership updates as we live and work beyond our home planet.",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "This week at NASA, astronauts prepped the @Space_Station for more solar arrays, @NASAHubble celebrated its 33rd anniversary with a new image of a dark nebula, and @VP and @President_KR visited @NASAGoddard.",
    "Astronauts Steve Bowen and @Astro_Alneyadi concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of @NASA_Astronauts and @Astro_Alneyadi will route power cables to prepare for future power system upgrades outside the @Space_Station.",
    "We need your help to \n@DoNASAScience\n! Many of our citizen science projects can be done by anyone, anywhere, with just a cell phone or laptop. Find a project that sparks your curiosity this #CitSciMonth: http://science.nasa.gov/citizenscience",
    "Astronauts need spacesuits for different occasions: life and work inside a spacecraft, spacewalks, and one day, planetary walks. In this episode of the Curious Universe podcast, we explore spacesuit design and creation, from fittings to new features: https://go.nasa.gov/3zxE6LK",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "Curious about the science and research en-route to the \n@Space_Station\n? More on the new investigations heading to space:",
    "Liftoff! Science, supplies & snacks are flying to the \n@Space_Station\n. \n@SpaceX\n #CRS27 is carrying blueberries, apples, cherry tomatoes, and four kinds of cheese. All the makings of a space charcuterie board? If you were going on a trip to space, what snacks would you want to take?",
    "LIVE NOW: Watch a rocket launch to the \n@Space_Station\n. Liftoff of the \n@SpaceX\n #CRS27 cargo resupply mission is slated for 8:30pm ET (0030 UTC).",
    "Cosmic spring is in the air! The latest image from \n@NASAWebb\n features a blooming Wolf-Rayet star, 15,000 light-years away. This rare phase is as fleeting as the cherry blossom it resembles. Luckily, Webb can study its \"petals\" of dust in detail: https://go.nasa.gov/3YL5D6I #SXSW",
    "JWST x SXSW: Tune in now to catch the \n@NASAWebb\n keynote LIVE from #SXSW, see an all-new image from the world's most powerful space telescope, and chat with space enthusiasts from around the world.",
    "Following their five-month mission aboard the space station, Crew-5 is safely back on Earth and will answer questions in a news conference at 2pm ET Wednesday, March 15, at \n@NASA_Johnson\n. Watch live on \n@NASA\n TV!",
    "LIVE: The \n@ISS_Research\n we're sending to space on tonight's #CRS27 launch could lead to healthier hearts and cleaner spacecraft—and that's just for starters.\n\nTune in now to our CRS-27 science telecon to learn more and share your Qs with #AskNASA:",
    "How about a big slice of pi(e)?\n\nWhether your favorite is apple, blueberry, or irrational, celebrate #PiDay with us! Check out some of the ways we use this mathematical constant to explore the universe: https://go.nasa.gov/2IKTXMB\n\nTell us how you're celebrating!",
    "Curious about the science and research en-route to the @Space_Station? More on the new investigations heading to space:",
    "LIVE: \n@NASAEarth\n & \n@CenterForAstro\n managers discuss TEMPO, a space-based instrument set for launch as early as April. TEMPO will improve life on Earth by revolutionizing the way scientists observe air quality."
]