[
    "What are gravitational waves? We dove into this topic in an episode of our Curious Universe podcast (transcript included):",
    "Congratulations to NANOGrav for detecting evidence that gravitational waves fill the cosmos. \n\nThese ripples in the fabric of space happen when massive objects like black holes circle one another before colliding. The result brings us closer to understanding how galaxies evolve.… Show more",
    "Welcome to the #Artemis Accords, Ecuador and India. \n\nThis week, the two nations became the 26th and 27th, respectively, to commit to the peaceful and safe exploration of space as we journey to the Moon, Mars, and beyond.\n\n: https://go.nasa.gov/3Jwkwox\n: https://go.nasa.gov/3r16pBl",
    "What's new with the Moon?\n\nOur Daily Moon Guide highlights what you're apt to see with clear skies, along with upcoming lunar events and other fun \n@NASAMoon\n facts. Take a look (up): https://go.nasa.gov/MoonGuide",
    "NOW: A \n@NASAAero\n project update on the experimental X-57 all-electric aircraft.",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, \n@NASAAero\n leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "\"And when we do things that improve equity for the people who have it the worst, we are improving equity across the board.\" — S. J. Ralston, Mars research scientist, advocates for transgender and nonbinary people in the workplace. #PrideMonth https://nasa.gov/faces-of-nasa/sj-ralston…",
    "LIVE: Two cosmonauts are stepping outside the \n@Space_Station\n to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "What's new with the Moon?\n\nOur Daily Moon Guide highlights what you're apt to see with clear skies, along with upcoming lunar events and other fun @NASAMoon facts. Take a look (up): https://go.nasa.gov/MoonGuide",
    "NOW: A @NASAAero project update on the experimental X-57 all-electric aircraft.",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and @ChandraXray’s sonification: http://go.nasa.gov/46da7rL",
    ".@POTUS Biden and Prime Minister @narendramodi know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, @NASAAero leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "LIVE: Two cosmonauts are stepping outside the @Space_Station to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "@NASAUniverse\n: Judy Racusin, astronomer at NASA Goddard\n\n@NASA_Marshall\n: Cori Fletcher, astronomer at NASA Marshall via USRA\n\n@PSUScience\n: Jamie Kennea, astronomer at #PennState\n\n@WomenNASA\n: Liz Landau, host, NASA HQ",
    ".\n@EuropaClipper\n is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at \n@NASAJPL\n your questions live now:",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "We're going on a spacewalk!\n\nJoin us tomorrow, June 9, as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n step outside the \n@Space_Station\n. Friday's spacewalk is scheduled to start at 9:15am ET (1315 UTC), with live coverage beginning at 7:45am ET (1145 UTC) on Twitter and NASA TV.",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay"
]