[
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our \n@NASAUniverse\n NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the \n@EuropaClipper\n spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the \n@Space_Station\n and \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our @NASAUniverse NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the @EuropaClipper spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the @Space_Station and @NASA_Astronauts Steve Bowen and @Astro_Woody performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This @NASAEarth computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the \n@Space_Station\n at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n."
]