[
    "Watch the entire first episode on this platform. Great move by Apple!\n\nNote, you can Airplay from your iPhone to TV to watch on a big screen.",
    "Improved longform posts",
    "Thank you for the kind words",
    "Here we go again",
    "Interesting Spaces about Wagner revolt",
    "The most entertaining outcome (as if we were in a movie) is the most likely",
    "Best coverage of the situation I’ve seen so far is from Mario",
    "Don’t even trust nobody",
    "Falcon 9 launches 56 \n@Starlink\n satellites to orbit from Florida",
    "Solar Roof is built to withstand any weather, including heavy storms & hail",
    "Falcon 9 launches 56 @Starlink satellites to orbit from Florida",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Benvenuti contributors from Italy, Willkommen to those from Germany & Austria, Bienvenue France & Luxembourg, Welkom to our Belgian & Dutch contributors, and Herzlich Willkommen to those in Switzerland!",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "It is worth noting that kids who are same-sex attracted and/or autistic are the most vulnerable",
    "Big difference",
    "Archived version",
    "Powerful article",
    "",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Would be great to have shows from all parts of the political spectrum on this platform!",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today."
]