[
    "Just swipe up to see the next video",
    "Here we go again",
    "And will be trained on enormous amounts of compute",
    "Tesla is building the foundation models for autonomous robots",
    "Watching Twitter videos on my TV only took me a few seconds to set up\n\nAn awesome feature, if you’re watching longer videos on X/Twitter \n@elonmusk",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "Who should be President in 2032?",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "Ho accolto con grande piacere oggi a Palazzo Chigi @elonmusk. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "“What are you thinking?”",
    "And on June 6, the Dragon 2 fleet's cumulative time in space surpassed the Space Shuttle fleet's time with 1,324 total days in orbit!",
    "",
    "Extremely concerning",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Hosting @RobertKennedyJr’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 @Starlink satellites to orbit from Florida",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Starlink helping to connect schools in Rwanda "
]