[
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Benvenuti contributors from Italy, Willkommen to those from Germany & Austria, Bienvenue France & Luxembourg, Welkom to our Belgian & Dutch contributors, and Herzlich Willkommen to those in Switzerland!",
    "Within 15 mins, you can recover up to 200 miles/275 km",
    "Once again, I’d like to offer this platform to anyone on the left. You will get equal treatment.",
    "Bold",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Dagan Shani has IMHO made the most important film of the year -  about the harsh #AI truth:",
    "Starlink on Igloolik Island in the northern territory of Nunavut, Canada ",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "BREAKING: @Tesla says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "And works almost everywhere on Earth with global roaming enabled!"
]