[
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the \n@Space_Station\n at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA @SpaceX #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the @Space_Station at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new @NASAEarth mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n@NASASolarSystem researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the @Space_Station is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from @NASAAmes shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four @Axiom_Space private astronauts entered the orbital outpost after opening the @SpaceX Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The @SpaceX Dragon crew ship with four private astronauts from @Axiom_Space docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on @NASA TV.",
    "NOW: Watch the @Axiom_Space #Ax2 astronauts arrive at the @Space_Station. The @SpaceX Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n will route power cables to prepare for future power system upgrades outside the \n@Space_Station\n.",
    "This week at NASA, astronauts prepped the @Space_Station for more solar arrays, @NASAHubble celebrated its 33rd anniversary with a new image of a dark nebula, and @VP and @President_KR visited @NASAGoddard.",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and @Astro_Alneyadi concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of @NASA_Astronauts and @Astro_Alneyadi will route power cables to prepare for future power system upgrades outside the @Space_Station.",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of @NASA_Astronauts and @Astro_Alneyadi work on upgrades to the @Space_Station's power system.",
    "Two cosmonauts will conduct a pair of spacewalks on Wednesday, May 3, and Friday, May 12, to relocate hardware outside the @Space_Station. Details and coverage info: https://go.nasa.gov/44blzDe",
    "Are you ready for a spacewalk?\n\nAstronauts Steve Bowen and @Astro_Alneyadi will step out of the @Space_Station around 9:15am ET (1315 UTC) on Friday, April 28 to prepare for upcoming power upgrades. Coverage starts here and on NASA TV at 7:45am (1145 UTC): https://go.nasa.gov/40Iopww",
    "The first of two TROPICS launches will send cyclone-tracking CubeSats to low Earth orbit from New Zealand. The launch window opens at 9pm ET April 30 (0100 UTC May 1).\n\nA second launch is planned for May 16 to complete the constellation: http://go.nasa.gov/3Ax7aDG",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o"
]