[
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the \n@Space_Station\n: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    "Looking for the latest news from low Earth orbit?\n\nFollow \n@NASASpaceOps\n for mission leadership updates as we live and work beyond our home planet.",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the @Space_Station: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow @NASAUniverse and get pulled in: https://go.nasa.gov/3ncukw9",
    "Looking for the latest news from low Earth orbit?\n\nFollow @NASASpaceOps for mission leadership updates as we live and work beyond our home planet.",
    "This week at NASA, astronauts prepped the @Space_Station for more solar arrays, @NASAHubble celebrated its 33rd anniversary with a new image of a dark nebula, and @VP and @President_KR visited @NASAGoddard.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "On Friday, April 21, \n@NorthropGrumman\n's uncrewed Cygnus cargo craft is scheduled to depart the \n@Space_Station\n. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    "Two cosmonauts are about to venture outside the \n@Space_Station\n for a six-and-a-half-hour spacewalk. Live coverage begins at 9pm ET (0100 UTC April 19) on https://go.nasa.gov/3Lc1mFI.",
    "To help defend Earth from potentially hazardous asteroids and comets, we developed the #PlanetaryDefense Strategy & Action Plan. We’re eager to work with \n@WHOSTP\n in implementing it. https://go.nasa.gov/3mI3MlZ\n\nNote: There are no known asteroid impact threats for 100+ years.",
    "NASA astronaut Steve Bowen and UAE astronaut \n@Astro_Alneyadi\n will step outside the \n@Space_Station\n on Friday, April 28, to prepare for new solar arrays that will boost the station's power capacity.\n\nTune in Monday, April 24, for a live spacewalk preview: https://go.nasa.gov/3KJ8isB",
    " LIVE: Deputy Administrator \n@Astro_Pam\n delivers a plenary address at #38Space discussing progress towards a blueprint for sustained human exploration of the Moon and beyond with \n@NASAArtemis\n. https://bit.ly/3GQNi1S",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "The Soyuz MS-23 crew ship with three Exp 69 crewmates aboard docked to the Prichal docking module at 5:22am ET today completing a 37-minute relocation maneuver. More... https://go.nasa.gov/3nPnhcF"
]