[
    "Interview with \n@BillMaher",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Powerwall now available in Spain →",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "They are the same picture",
    "Cult / Culture",
    "Falcon Heavy’s 27 Merlin engines together generate more than 5 million pounds of thrust at liftoff",
    "Sorry our video upload is so bad! We’re working on major improvements. \n\nI recommend 480p for video longer than 10 mins, as that resolution is fine for phone/laptop users.",
    "The more screentime users spend looking at a post, whether text, pic or video, the more it is boosted. \n\nVideo posted natively to this platform will be boosted more than an external link, because way more time is spent watching a video than clicking on a link.",
    "The more screentime users spend looking at a post, whether text, pic or video, the more it is boosted. \n\nVideo posted natively to this platform will be boosted more than an external link, because way more time is spent watching a video than clicking on a link. https://twitter.com/EdKrassen/status/1653444378101161987…",
    "Sunset in space",
    "Falcon Heavy launches @ViasatInc’s ViaSat-3 Americas mission to orbit",
    "How it started:                                              How it's going:",
    "Even benign dependency on AI/Automation is dangerous to civilization if taken so far that we eventually forget how the machines work",
    "Worth reading The Machine Stops by EM Forster if you haven’t already\nhttps://cs.ucdavis.edu/~koehl/Teaching/ECS188/PDF_files/Machine_stops.pdf…",
    "Falcon Heavy",
    "Congrats \n@SpaceX\n team on an exciting test launch of Starship!\n\nLearned a lot for next test launch in a few months.",
    "Liftoff of Starship!",
    "T-0 in 4 mins",
    "10 minutes to launch",
    "Starship on track to launch in ~37 mins",
    "The Starship team is go for prop load; team is keeping an eye on the weather → http://spacex.com/launches",
    "Starship at sunset",
    "All systems currently green for launch"
]