[
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Hosting @RobertKennedyJr’s upcoming Space",
    "Falcon 9 launches 22 @Starlink satellites to orbit from Florida",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Liftoff!",
    " Happy Mother’s Day! ",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the @PolarisProgram, this @StJude hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "When you walk on to a plane with Starlink, the internet just works – it's that simple",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Starlink is self-orienting and connects in minutes as long as it has a clear view of the sky. Open the Starlink App to check for any obstructions ",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n"
]