[
    "On a power trip. \n\nAfter a 10-month voyage attached to the \n@Space_Station\n, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "The first of two TROPICS launches will send cyclone-tracking CubeSats to low Earth orbit from New Zealand. The launch window opens at 9pm ET April 30 (0100 UTC May 1).\n\nA second launch is planned for May 16 to complete the constellation: http://go.nasa.gov/3Ax7aDG",
    "We did it together. Thanks to you, we're bringing home five People's Voice Awards in this year's #Webbys.\n\nFrom \n@NASAWebb\n's first images to \n@NASA_Eyes\n's interactive map of the asteroids, check out our full set of Webby winners: https://go.nasa.gov/3n7iNOw",
    "Today, \n@VP\n and \n@President_KR\n toured \n@NASAGoddard\n for a close-up look at how we study our changing planet—and got a glimpse of \n@NASARoman\n, our next space telescope, as it's being built: https://go.nasa.gov/3mXIRf3",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9",
    "Congratulations, \n@ESA\n! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "Ingenuity perseveres.\n\nOur #MarsHelicopter just flew its 50th flight on the Red Planet (out of a planned five), nearly two years after it first took to the Martian skies. This demo is giving a glimpse of the future of powered flight on other worlds. https://mars.nasa.gov/ingenuity",
    " @NASAAero gets closer to quiet supersonic flight, @NASA_Orion’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "Two cosmonauts will conduct a series of spacewalks outside the @Space_Station beginning Tuesday, April 18, to transfer hardware. Full schedule and NASA TV coverage: https://go.nasa.gov/3L18AfG",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "Congratulations, @ESA! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "We love Lucy!\n\nThe @NASASolarSystem #LucyMission captured its first views of four of its Trojan asteroid targets, from 330 million miles (530 million kilometers) away. Set to fly by in 2027-2028, Lucy will be the first mission ever to visit them:\nhttps://go.nasa.gov/43tu8c3",
    "Space tomatoes, heart studies, and other @ISS_Research experiments are heading back to Earth this weekend on @SpaceX's #CRS27, the latest cargo return from the @Space_Station.\n\nUndocking coverage begins Saturday, April 15, at 10:45am ET (1445 UTC): https://go.nasa.gov/3zRgx0q",
    "We’re bringing back a bit of Bennu. Have questions about our asteroid sample return mission? Submit your question below and hear from experts starting at 2 pm ET."
]