[
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "What’s your favorite planet?",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n work on upgrades to the \n@Space_Station\n's power system.",
    "Two cosmonauts will conduct a pair of spacewalks on Wednesday, May 3, and Friday, May 12, to relocate hardware outside the \n@Space_Station\n. Details and coverage info: https://go.nasa.gov/44blzDe",
    "Are you ready for a spacewalk?\n\nAstronauts Steve Bowen and \n@Astro_Alneyadi\n will step out of the \n@Space_Station\n around 9:15am ET (1315 UTC) on Friday, April 28 to prepare for upcoming power upgrades. Coverage starts here and on NASA TV at 7:45am (1145 UTC): https://go.nasa.gov/40Iopww",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n will route power cables to prepare for future power system upgrades outside the \n@Space_Station\n.",
    "The first of two TROPICS launches will send cyclone-tracking CubeSats to low Earth orbit from New Zealand. The launch window opens at 9pm ET April 30 (0100 UTC May 1).\n\nA second launch is planned for May 16 to complete the constellation: http://go.nasa.gov/3Ax7aDG",
    "We did it together. Thanks to you, we're bringing home five People's Voice Awards in this year's #Webbys.\n\nFrom \n@NASAWebb\n's first images to \n@NASA_Eyes\n's interactive map of the asteroids, check out our full set of Webby winners: https://go.nasa.gov/3n7iNOw",
    "Today, \n@VP\n and \n@President_KR\n toured \n@NASAGoddard\n for a close-up look at how we study our changing planet—and got a glimpse of \n@NASARoman\n, our next space telescope, as it's being built: https://go.nasa.gov/3mXIRf3",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    "Last year was pretty busy. \n\nWe launched to the Moon. We yeeted a spacecraft into an asteroid (on purpose.) And we unveiled images from a brand new space telescope. NBD. \n\nOh yeah, we also nabbed nine noms for the #Webbys. If you like what you saw, vote? http://go.nasa.gov/3KBXNZl",
    "Dragon is soaring home! \n\n\n@SpaceX\n's cargo spacecraft separated from the \n@Space_Station\n at 11:05am ET (1505 UTC), carrying space-grown tomatoes and other \n@ISS_Research\n for analysis back on the ground. Follow our ISS blog for the latest #CRS27 updates: http://blogs.nasa.gov/spacestation",
    "LIVE: \n@SpaceX\n's #CRS27 cargo mission is scheduled to undock from the \n@Space_Station\n at 11:05am ET (1505 UTC) today.\n\nLearn more about the \n@ISS_Research\n it's bringing back to Earth: https://go.nasa.gov/4059R9F",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "Having trouble sleeping? Try some of these seven techniques our astronauts use to get better sleep in space!\n \nThese methods help \n@NASA_Astronauts\n sleep well through the disruptions of their natural sleep cycle — and they may help you too: https://go.nasa.gov/3MNWYhA",
    " \n@NASAAero\n gets closer to quiet supersonic flight, \n@NASA_Orion\n’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "Two cosmonauts will conduct a series of spacewalks outside the \n@Space_Station\n beginning Tuesday, April 18, to transfer hardware. Full schedule and NASA TV coverage: https://go.nasa.gov/3L18AfG",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9"
]