[
    "Watch the entire first episode on this platform. Great move by Apple!\n\nNote, you can Airplay from your iPhone to TV to watch on a big screen.",
    "Some chance fight happens in Colosseum",
    "Starlink in the Yukon ",
    "Key milestone completed for flight 2",
    "Fanaticism is always a function of repressed doubt – Dune",
    "“Ads” like this where you learn or are entertained are great, as they’re effectively content.\n\nConsider Vogue Magazine, which consists mostly of “advertisements”, but they’re so beautiful that they’re worth seeing in & of themselves.",
    "Of course, not all products & services are glamorous, but still there is a true value proposition for anything useful/enjoyable",
    "Just swipe up to see the next video",
    "Here we go again",
    "Interesting Spaces about Wagner revolt",
    "The most entertaining outcome (as if we were in a movie) is the most likely",
    "Best coverage of the situation I’ve seen so far is from Mario",
    "Don’t even trust nobody",
    "Falcon 9 launches 56 \n@Starlink\n satellites to orbit from Florida",
    "Watching Twitter videos on my TV only took me a few seconds to set up\n\nAn awesome feature, if you’re watching longer videos on X/Twitter \n@elonmusk",
    "Optimus will come in many forms",
    "Great conversation with \n@NarendraModi",
    "Bold",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "“What are you thinking?”",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Benvenuti contributors from Italy, Willkommen to those from Germany & Austria, Bienvenue France & Luxembourg, Welkom to our Belgian & Dutch contributors, and Herzlich Willkommen to those in Switzerland!",
    "Within 15 mins, you can recover up to 200 miles/275 km",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever"
]