[
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "A \n@NASAWebb\n finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Who made you the star you are today? Mention them to give them cosmic #MothersDay flowers.  \n\nThe Rosette Nebula, about 5,000 light-years from Earth, is a region in space where stars are formed. This image by the Spitzer Space Telescope shows the stellar nursery in infrared.",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "May is a good month for skywatchers. Venus, Mars, and Jupiter cozy up to the Moon, and even Saturn makes a cameo. Where and when to look: https://go.nasa.gov/37ePy0B",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the \n@Space_Station\n: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "On Friday, April 21, \n@NorthropGrumman\n's uncrewed Cygnus cargo craft is scheduled to depart the \n@Space_Station\n. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    " Launch alert: A new space-based instrument will monitor air quality across North America, providing hourly measurements to improve forecasts & inform policymakers.\n\n#TEMPO is set to lift off no earlier than 12:30am ET (0430 UTC), Friday, April 7. Watch: https://go.nasa.gov/3Gsbt6v",
    "Uranus. (Go ahead, get it out of your system. We tried.)⁣\n\nOnly Voyager 2 in the 1980s & Keck (with adaptive optics) have imaged the planet's rings before, and they've never been this clear. \n@NASAWebb\n highlights atmospheric features & 11 of its 13 rings: https://go.nasa.gov/414SqXV",
    "LIVE: NASA and \n@Axiom_Space\n leaders are providing the latest updates on #Ax2, scheduled to send an international crew of private astronauts to the \n@Space_Station\n in early May. Listen in:",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our @NASAEarth & @CenterForAstro #TEMPO mission is flying free from its @SpaceX Falcon 9 rocket and on its way to geostationary orbit.",
    "Liftoff! Our #TEMPO mission and its host satellite are on the way to space. The size of a dishwasher, TEMPO is powerful enough to observe air pollutants across North America down to a resolution of 4 square miles (10 square km).",
    "LIVE: Watch #TEMPO launch to orbit on a @SpaceX Falcon 9 rocket. Liftoff expected as early as 12:30am ET (0430 UTC).\n\nThe @NASAEarth & @CenterForAstro mission is set to revolutionize air quality observations.",
    "Uranus. (Go ahead, get it out of your system. We tried.)⁣\n\nOnly Voyager 2 in the 1980s & Keck (with adaptive optics) have imaged the planet's rings before, and they've never been this clear. @NASAWebb highlights atmospheric features & 11 of its 13 rings: https://go.nasa.gov/414SqXV",
    "LIVE: NASA and @Axiom_Space leaders are providing the latest updates on #Ax2, scheduled to send an international crew of private astronauts to the @Space_Station in early May. Listen in:",
    "The Soyuz MS-23 crew ship with three Exp 69 crewmates aboard docked to the Prichal docking module at 5:22am ET today completing a 37-minute relocation maneuver. More... https://go.nasa.gov/3nPnhcF",
    "LIVE: Astronaut Frank Rubio and two cosmonauts are moving their Soyuz MS-23 spacecraft to a new docking port on the @Space_Station. Undocking is scheduled for 4:45am ET (0845 UTC), with redocking targeted for 5:23am (0923 UTC).",
    "We need your help to @DoNASAScience! Many of our citizen science projects can be done by anyone, anywhere, with just a cell phone or laptop. Find a project that sparks your curiosity this #CitSciMonth: http://science.nasa.gov/citizenscience",
    "LIVE: After splashing down off the coast of Florida last weekend, our #Crew5 spacefarers are answering questions about their five-month stay aboard the \n@Space_Station\n.\n\nShare your questions with #AskNASA!"
]