[
    "Falcon 9’s first stage has landed on Landing Zone 4, marking SpaceX’s 200th successful recovery of an orbital class rocket!",
    "Watch Falcon 9 launch 72 spacecraft to orbit → http://spacex.com/launches",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit from Florida",
    "Sentry Mode enables your Tesla to monitor & record potential threats while parked",
    "Powerful article",
    "Would be great to have shows from all parts of the political spectrum on this platform!",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    ".",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Liftoff!",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…",
    "Beat previous record by >8 seconds!",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Every parent should watch this",
    "Incompetence, in the limit, is indistinguishable from sabotage",
    "Transparency builds trust …",
    "Yikes",
    "Is this true, \n@Target\n?",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Excited to welcome Ford owners to thousands of Superchargers across North America next year"
]