[
    ".",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Liftoff!",
    "→ → ",
    "Scrolling through tweets while watching mini video (pic in pic) is great",
    " For those who died for freedom ",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "Powerwall now available in Spain →",
    "Say goodbye to prying eyes and hello to secure conversations. We're giving early access to Encrypted Direct Messages v1 to our verified users.\n\nWe're excited to get feedback, improve the experience, and roll it out to even more users. Learn more:",
    "Excited to announce that I’ve hired a new CEO for X/Twitter. She will be starting in ~6 weeks!\n\nMy role will transition to being exec chair & CTO, overseeing product, software & sysops.",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "First Model Y deliveries in Türkiye",
    "We’re purging accounts that have had no activity at all for several years, so you will probably see follower count drop",
    "The more screentime users spend looking at a post, whether text, pic or video, the more it is boosted. \n\nVideo posted natively to this platform will be boosted more than an external link, because way more time is spent watching a video than clicking on a link. https://twitter.com/EdKrassen/status/1653444378101161987…",
    "Sunset in space",
    "They are the same picture",
    "Cult / Culture",
    "Falcon Heavy’s 27 Merlin engines together generate more than 5 million pounds of thrust at liftoff",
    "Falcon Heavy launches \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit",
    "How it started:                                              How it's going:",
    "Even benign dependency on AI/Automation is dangerous to civilization if taken so far that we eventually forget how the machines work"
]