[
    "And on June 6, the Dragon 2 fleet's cumulative time in space surpassed the Space Shuttle fleet's time with 1,324 total days in orbit!",
    "",
    "Extremely concerning",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Why is sleep so hard!? Perhaps we will never know.",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "You asked (loudly), we listened.\n\nWe’ve reduced the signup flow for creators from 27 steps to just 4.\n\nIt’s never been easier to earn a living on Twitter. Tap on “Monetization” in settings to apply today.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "As seen by an unaffected third party",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Powerwall now available in Spain →",
    "Say goodbye to prying eyes and hello to secure conversations. We're giving early access to Encrypted Direct Messages v1 to our verified users.\n\nWe're excited to get feedback, improve the experience, and roll it out to even more users. Learn more:",
    "Excited to announce that I’ve hired a new CEO for X/Twitter. She will be starting in ~6 weeks!\n\nMy role will transition to being exec chair & CTO, overseeing product, software & sysops.",
    "With each launch of our first gen \n@Starlink\n satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space",
    "Super easy to use Starlink out of the box, no professional installer needed!",
    "As soon as @LindaYacc is ready, we will do a Spaces where you can ask us anything",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n@LindaYacc will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app."
]