[
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n will route power cables to prepare for future power system upgrades outside the \n@Space_Station\n.",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "Having trouble sleeping? Try some of these seven techniques our astronauts use to get better sleep in space!\n \nThese methods help \n@NASA_Astronauts\n sleep well through the disruptions of their natural sleep cycle — and they may help you too: https://go.nasa.gov/3MNWYhA",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Last year was pretty busy. \n\nWe launched to the Moon. We yeeted a spacecraft into an asteroid (on purpose.) And we unveiled images from a brand new space telescope. NBD. \n\nOh yeah, we also nabbed nine noms for the #Webbys. If you like what you saw, vote? http://go.nasa.gov/3KBXNZl",
    "Dragon is soaring home! \n\n\n@SpaceX\n's cargo spacecraft separated from the \n@Space_Station\n at 11:05am ET (1505 UTC), carrying space-grown tomatoes and other \n@ISS_Research\n for analysis back on the ground. Follow our ISS blog for the latest #CRS27 updates: http://blogs.nasa.gov/spacestation",
    "LIVE: \n@SpaceX\n's #CRS27 cargo mission is scheduled to undock from the \n@Space_Station\n at 11:05am ET (1505 UTC) today.\n\nLearn more about the \n@ISS_Research\n it's bringing back to Earth: https://go.nasa.gov/4059R9F",
    " \n@NASAAero\n gets closer to quiet supersonic flight, \n@NASA_Orion\n’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "We need your help to \n@DoNASAScience\n! Many of our citizen science projects can be done by anyone, anywhere, with just a cell phone or laptop. Find a project that sparks your curiosity this #CitSciMonth: http://science.nasa.gov/citizenscience",
    "Astronauts need spacesuits for different occasions: life and work inside a spacecraft, spacewalks, and one day, planetary walks. In this episode of the Curious Universe podcast, we explore spacesuit design and creation, from fittings to new features: https://go.nasa.gov/3zxE6LK",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "NASA experts will join \n@Axiom_Space\n at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the \n@Space_Station\n. How to tune in: https://go.nasa.gov/412KmqK",
    "Get to know the #Artemis II astronauts headed to the Moon! Learn more about \n@Astro_Christina\n, \n@Astro_Jeremy\n, \n@AstroVicGlover\n, and \n@Astro_Reid\n: https://nasa.gov/specials/artemis-ii/…",
    "Welcome to Twitter, \n@NASAScienceAA\n! \n\nDr. Nicky Fox, our head of #NASAScience, will share updates about topics and missions ranging from our changing planet to our expanding universe. Follow along: http://science.nasa.gov",
    "We’re developing new resources for finding and tracking asteroids.\n\nLive from \n@UNOOSA\n #IAAPDC2023, hear from Dr. Bhavya Lal, head of NASA technology, policy, and strategy on our commitment to planetary defense.\n\nWatch April 4 7:40am ET (1140 UTC) https://unoosa.org/oosa/en/ourwork/topics/neos/2023/IAAPDC/index.html…",
    ".\n@WHOSTP\n just released a new planetary defense strategy that will help our nation more effectively detect, prepare for,  and thwart near-Earth object hazards.\n\nLearn more about our work to advance  leadership and international cooperation in space.",
    "Want to help keep Earth safe from near-Earth asteroids? Join the International Astronomical Search Collaboration and help us find more of these remnants left over from the early formation of our solar system. \n@DoNASAScience\n at: https://science.nasa.gov/citizenscience?field_division_tid=81…",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)"
]