[
    "Falcon 9’s first stage booster has landed on Landing Zone 1, a first for a human spaceflight mission",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Watch Falcon 9 launch Dragon and Ax-2 to the @space_station → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "",
    "Feeling nostalgic",
    "Dragon is go for docking",
    "Thank you to our 1.5M+ customers around the world! ",
    "Highly recommend that organizations sign up and validate their affiliates to prevent impersonation",
    "Your Tesla can automatically navigate to destinations based on your calendar",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of \n@ViasatInc\n's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Home",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h).",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB.",
    "All proceeds go to content creators, we keep nothing",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Content creators may wish to enable subscriptions on this platform. \n\nJust tap on Monetization in settings.",
    "We live in the most interesting of times",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Given the moves by Fox and CNN news today with the firings of Don Lemon and Tucker Carlson, I think what we have is mainstream media realizing that change is needed. People don't want to be mislead by news stations. They also don't want misogynistic viewpoints to flourish.\n\nAs… Show more",
    "We’re rapidly improving transparency & fairness on this platform, but there is still a lot of work to do",
    "Hard to believe Starship actually did launch on 4/20 lol",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown"
]