[
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow \n@NASAEarth\n!",
    "Liftoff! Two small satellites are on the way to join two already in orbit for our TROPICS mission. TROPICS will provide near-hourly data that could improve forecasts of tropical cyclones and severe weather.",
    "LIVE: Watch the second pair of shoebox-sized satellites launch to orbit for our storm-tracking TROPICS mission. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 11:46pm ET (0346 UTC) at the opening of the launch window.",
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of \n@NASAInterns\n. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Astronaut Dr. Jonny Kim joins Anita Dey, strategic partnerships manager at NASA, in a chat with chief historian Dr. Brian Odom as they delve into supporting the #AANHPI community, Kim's journey in the space program, and the impact of stereotypes:",
    "The launch of two more small satellites for our \n@NASAEarth\n TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a \n@RocketLab\n rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "It’s handy to have one of these. Know why?",
    "Bring balance to the force, not leave it in darkness.\n\nHappy #StarWarsDay. And #MayThe4thBeWithYou.",
    "Reflecting on the past two years, I am humbled by the dedication of the \n@NASA\n team and their commitment to advancing science and exploration. We have so much to look forward to. Together, we will continue to push the limits of exploration and achieve the impossible.",
    "“I can see you’re lonely down there... Don’t you know that I’m right here?”\n\nHonored to be an inspiration to robots everywhere, \n@Harry_Styles\n. ",
    "Happy Earth Day from me and our good friends over at NASA.\n \nFor our children and grandchildren, we must stand united in our effort to save our only home.",
    "What was it like when Apollo 8 astronaut Bill Anders saw Earth rise over the Moon’s horizon in 1968?\n\nHe reflects with Dr. Kate Calvin, NASA senior climate advisor and chief scientist, on taking the famous photo helped humanity \"discover\" Earth. https://go.nasa.gov/43QKQCr\n\n#EarthDay",
    "Watch as \n@NorthropGrumman\n’s S.S. Sally Ride undocks from the \n@Space_Station\n 250 miles over the Mediterranean.",
    "Live Now: Watch as the uncrewed \n@NorthropGrumman\n S.S. Sally Ride Cygnus cargo spacecraft departs from the \n@Space_Station\n.\n\nThe spacecraft delivered snacks, science, and supplies to the orbiting laboratory in November 2022:\nhttp://go.nasa.gov/3MWtqhI",
    "HOP IN SPACEFOLKS! \n\nWe're blasting off together on a new mission—\n@TheWebbyAwards\n. Together we've: launched #Artemis I, watched DART smash into an asteroid, and explored with \n@NASAWebb\n. Now we're hoping to land #Webbys. You in? Vote by the end of today: https://bit.ly/3zHiqgs",
    "As we open up the next generation of opportunities in low-Earth orbit, \n@CollinsAero\n is designing a new spacesuit that's more adaptable, flexible, and easy to use for spacewalks outside the \n@Space_Station\n. Get the details: https://go.nasa.gov/3MUIUmm",
    "Houston, we have Posty\n\nAs we approach #EarthDay, watch \n@PostMalone\n get astronaut-struck as he chats with two crew members aboard the \n@Space_Station\n, Stephen Bowen & Woody Hoburg, about how their unique perspective changes the way they see our home planet. http://nasa.gov/earth-day-2023",
    "Congrats to \n@SpaceX\n on Starship’s first integrated flight test! Every great achievement throughout history has demanded some level of calculated risk, because with great risk comes great reward. Looking forward to all that SpaceX learns, to the next flight test—and beyond.",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    "From Monday's #Artemis II crew announcement to the latest science updates from Mars and Uranus, it's been a whirlwind week across the solar system.\n\nCheck out what else has been going on This Week at NASA—then get the details on our Artemis II mission: https://nasa.gov/specials/artemis-ii/…",
    "An epic dance: At this very moment, the #JunoMission spacecraft is approaching Jupiter for its 50th close pass of the giant planet. Ride along using our 3D solar system simulator: https://go.nasa.gov/3ZI8Q7v",
    "Stars: always making a dramatic exit!  \n\nWebb’s powerful infrared eye has captured never-before-seen detail of Cassiopeia A (Cas A). 11,000 light-years away, it is the remnant of a massive star that exploded about 340 years ago: https://go.nasa.gov/3ZJnk72",
    "One year from now, millions of skywatchers across the U.S. will have the opportunity to see a total solar eclipse. It will be the last time one will cross the U.S. for more than 20 years. \n\nWhere will you be? https://go.nasa.gov/3KnSYRL",
    ".\n@VP\n spoke to the #Artemis II astronauts about their upcoming mission around the Moon, and how it will pave the way for future long-term human exploration missions to the Moon, and eventually Mars.",
    "Our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission successfully launched. TEMPO will provide hourly, daytime measurements of air quality in North America. It will monitor three main pollutants and reveal disparities in exposure in our cities and communities: https://go.nasa.gov/40Q9v89",
    "Spacecraft separation confirmed! The Intelsat satellite hosting our \n@NASAEarth\n & \n@CenterForAstro\n #TEMPO mission is flying free from its \n@SpaceX\n Falcon 9 rocket and on its way to geostationary orbit.",
    "Liftoff! Our #TEMPO mission and its host satellite are on the way to space. The size of a dishwasher, TEMPO is powerful enough to observe air pollutants across North America down to a resolution of 4 square miles (10 square km).",
    "\"Galactic winds\" can spread starstuff far and wide—including elements crucial for life on Earth.\n\nA new \n@chandraxray\n study is taking a look at the giant star clusters that cause this cosmic wind to blow: https://go.nasa.gov/40rNn3S",
    "Launch update: \n@NASA\n and \n@BoeingSpace\n are now targeting no earlier than July 21 for the company's Crew Flight Test (CFT). \n\nThe CST-100 #Starliner flight will take  \n@NASA_Astronauts\n Suni Williams and Barry \"Butch\" Wilmore to the \n@Space_Station\n."
]