[
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "I have spaceships",
    "AI ",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "",
    "I hope this platform increasingly brings you joy & elucidation",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Until the Supreme Court struck down Biden’s vaccination decree, he tried to demand that we fire all unvaccinated personnel – some of our finest people",
    "Feels so long ago …",
    "Extremely destructive if accurate",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to @SpaceX propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months"
]