[
    "The problem is that the passive/index funds outsource voting to shareholder services companies, which are controlled by activists who act in a manner contrary to the interests of shareholders. \n\nThis is probably the biggest class-action opportunity in history.",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Hold on to your horse as the carousel of destiny spins ever faster",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide "
]