[
    "On a power trip. \n\nAfter a 10-month voyage attached to the \n@Space_Station\n, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    " \n@NASAAero\n gets closer to quiet supersonic flight, \n@NASA_Orion\n’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "Two cosmonauts will conduct a series of spacewalks outside the \n@Space_Station\n beginning Tuesday, April 18, to transfer hardware. Full schedule and NASA TV coverage: https://go.nasa.gov/3L18AfG",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9",
    "Congratulations, \n@ESA\n! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "Ingenuity perseveres.\n\nOur #MarsHelicopter just flew its 50th flight on the Red Planet (out of a planned five), nearly two years after it first took to the Martian skies. This demo is giving a glimpse of the future of powered flight on other worlds. https://mars.nasa.gov/ingenuity",
    "Our #Artemis II pilot is \n@AstroVicGlover\n! \n\nVictor Glover is part of our 2013 class of \n@NASA_Astronauts\n  and was the pilot for NASA’s \n@SpaceX\n Crew-1 mission. He’s logged 3,000 flight hours in more than 40 different aircraft, and will pilot \n@NASA_Orion\n around the Moon.",
    "Representing the \n@csa_asc\n on #Artemis II to the Moon is \n@Astro_Jeremy\n, from London, Ontario. \n\nJeremy Hansen was a fighter pilot before joining CSA, and currently works with NASA on astronaut training and mission operations. This will be Hansen’s first mission in space.",
    "Meet the first member of our #Artemis II Moon crew: mission specialist \n@Astro_Christina\n! \n\nChristina Koch visited the \n@Space_Station\n in 2019, where she took part in the first all-woman spacewalk. She began her career as an electrical engineer at \n@NASAGoddard\n.",
    "Scientists originally developed this lightweight material to protect spacecraft during atmospheric re-entry. Now, this \n@NASASpinoff\n technology is being used in clothing to keep the wearer warm without overheating when they’re on the move. https://go.nasa.gov/3lC99Tm",
    "Look westward to find the Moon as a beautiful slim crescent this evening after sunset, hanging just below blazing-bright Venus. Tomorrow evening, look west again to spot the Moon once more, this time shining from above Venus.\n\nSpot the duo? Share your pictures.",
    "This #NationalPuppyDay, we salute all the dog stars out there. Exploring is more fun with your best friend at your side. ",
    "Pause. Rewind. \n@NASAWebb\n may have found sand particles in the atmosphere of planet VHS 1256 b, which orbits a pair of stars 40 light-years away. Webb also detected water, carbon monoxide, and methane. Get the gritty details: https://go.nasa.gov/3lDePfN",
    "Reporters: Interview the four astronauts who will travel around the Moon and deeper into space than any humans before them.\n\nMedia credentialing to cover the joint \n@NASA\n-\n@CSA_ASC\n reveal of the #Artemis II crew in Houston on April 3 is open now: https://go.nasa.gov/404oRpc",
    " LIVE: We celebrate #WomensHistoryMonth by announcing a new campaign to connect women with students for \n@NASASTEM\n mentorship.",
    "Live outside of the continental United States? You can check out upcoming eclipses around the world here."
]