[
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "Live from @LibraryCongress: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the @EuropaClipper spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and @BoeingSpace officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " @NASA and @BoeingSpace will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the @Space_Station.\n\nListen in: http://nasa.gov/live",
    "LIVE: Experts at @NASA_Johnson are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the @Space_Station.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the \n@Space_Station\n: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    "Looking for the latest news from low Earth orbit?\n\nFollow \n@NASASpaceOps\n for mission leadership updates as we live and work beyond our home planet.",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "This weekend, our #Crew6 astronauts are taking their Dragon out for a spin. Tune in at 7am ET (1100 UTC) on Saturday, May 6, as they move the Dragon Endeavour spacecraft to a new port on the @Space_Station: https://go.nasa.gov/3AKmaOD",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow @NASAUniverse and get pulled in: https://go.nasa.gov/3ncukw9",
    "Looking for the latest news from low Earth orbit?\n\nFollow @NASASpaceOps for mission leadership updates as we live and work beyond our home planet.",
    "This week at NASA, astronauts prepped the @Space_Station for more solar arrays, @NASAHubble celebrated its 33rd anniversary with a new image of a dark nebula, and @VP and @President_KR visited @NASAGoddard.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more"
]