[
    "With a phone or computer, you can help astronomers \n@DoNASAScience\n and uncover some of the most elusive objects in the universe—brown dwarfs. These balls of gas never became stars, so this is your chance to shine a light on them: https://go.nasa.gov/3r4wdMO",
    "Our next cargo mission to the \n@Space_Station\n is set to lift off from \n@NASA_Wallops\n on Tuesday, Aug. 1!\n\n\n@NorthropGrumman\n's #NG19 launch will carry gene therapy research, materials to study fires in space, and digital art from students around the world: https://go.nasa.gov/3JAWhFE",
    "With a phone or computer, you can help astronomers @DoNASAScience and uncover some of the most elusive objects in the universe—brown dwarfs. These balls of gas never became stars, so this is your chance to shine a light on them: https://go.nasa.gov/3r4wdMO",
    "Our next cargo mission to the @Space_Station is set to lift off from @NASA_Wallops on Tuesday, Aug. 1!\n\n@NorthropGrumman's #NG19 launch will carry gene therapy research, materials to study fires in space, and digital art from students around the world: https://go.nasa.gov/3JAWhFE",
    "As Chair of the National Space Council, I am thrilled to announce the public opening of @NASA's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Spaceship update! @SpaceX's Dragon spacecraft for the uncrewed #CRS28 cargo mission is scheduled to undock from the @Space_Station at 12:05pm ET (1605 UTC) on Thursday, June 29, with splashdown early Friday morning. Here's the full timeline: https://go.nasa.gov/3NLmWCi",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "U.S. and international media: You are invited to @NASAKennedy to interview subject matter experts and view the @NASA_Orion spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at @NASAKennedy. https://go.nasa.gov/3NfJcCU",
    "Steve Bowen, 10-time spacewalker.  ",
    "@Astro_Kobi asked a @NASASolarSystem scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n@NASA\n#UnpackItNASA",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and @Astro_Woody installed a new roll-out solar array and completed numerous additional tasks outside the @Space_Station.",
    "Watch the @Space_Station's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Spacewalkers Steve Bowen and @Astro_Woody have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    "Astronauts-eye view \n\nTake a look through the helmet cams of @Astro_Woody and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the \n@Space_Station\n at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live"
]