[
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - \n@SeanEcom\n CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "Congratulations Tesla Texas Team!!",
    "When you walk on to a plane with Starlink, the internet just works – it's that simple",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "All proceeds go to content creators, we keep nothing",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Support content creators around the world in near & far away places!\n\nFor many this represents a vital source of income & enables them to put more time into creating great content for you.",
    "I propose the lmfao test for AI",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "check mate",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song",
    "Such a great day in so many ways",
    "Starship Liftoff",
    "We may get it wrong occasionally, so authors will be able to submit feedback on the label if they think we incorrectly limited their content’s visibility. In the future, we plan to allow authors to appeal our decision to limit a Tweet’s visibility.",
    "These actions will be taken at a tweet level only and will not affect a user’s account. Restricting the reach of Tweets helps reduce binary “leave up versus take down” content moderation decisions and supports our freedom of speech vs freedom of reach approach.",
    "We’re adding more transparency to the enforcement actions we take on Tweets. As a first step, soon you’ll start to see labels on some Tweets identified as potentially violating our rules around Hateful Conduct letting you know that we’ve limited their visibility. … Show more"
]