[
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Every parent should watch this",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Hold on to your horse as the carousel of destiny spins ever faster",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Deployment of @Arabsat BADR-8 confirmed",
    "Is this true, @Target?",
    "Lot of noise about @RonDeSantis announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. @Tesla   https://ford.to/FordTeslaEVCharging…",
    "Feels so long ago …",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship."
]