[
    "Amphitheatrum Flavium",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi @elonmusk. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "Great to work with you!",
    "Internet from space supporting Titanic dive expedition ",
    "Spaces discussion with Mary Barra, CEO of \n@GM\n! \n@mtbarra",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Liftoff!",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…",
    "Beat previous record by >8 seconds!",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "A number of political shows and podcasts have announced their intention to upload on Twitter alongside, or even in place of, Youtube. This new move by Youtube may be intended to stem the bleeding. \n\nSource: \n\n https://axios.com/2023/06/02/us-election-fraud-youtube-policy…",
    "Falcon 9 launches 22 \n@Starlink\n satellites to orbit from Florida",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Every parent should watch this",
    "The Babylon Bee + \n@elonmusk\n at Twitter HQ\n\nTOMORROW. Premiering exclusively on Twitter.",
    "Powerwall is one of the best products I've ever purchased. Nothing but sunny blue skies for over a week, yet power is out for 5k+ customers.\n\nCheck out more details of my \n@Tesla\n Powerwall experience here https://youtu.be/DA3fRMm3a0c",
    "Lil X just asked if there are police cats, since there are police dogs ",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "Office Space is an awesome movie",
    "Yikes",
    "Sorry this app takes up so much space",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day "
]