[
    "It’d be great to have \n@maddow\n, \n@donlemon\n & others on the left put their shows on this platform. No exclusivity or legal docs required!\n\nYou will receive our full support. The digital town square is for all.",
    "Great to work with you!",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship.",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "The idea that governments around the world have for years been secretly censoring ordinary citizens sounds crazy, but it's true. Worse, they are now on the cusp of imposing what can only be described as a totalitarian system to end freedom of speech as we know it.",
    "Fairing reentry on the ViaSat-3 mission was the hottest and fastest we've ever attempted.  The fairings re-entered the atmosphere greater than 15x the speed of sound, creating a large trail of plasma in its wake",
    "Sorry our video upload is so bad! We’re working on major improvements. \n\nI recommend 480p for video longer than 10 mins, as that resolution is fine for phone/laptop users."
]