[
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "Forty years ago today, Sally Ride launched into history as the first U.S. woman to go to space. An astronaut, physicist, and educator, she inspired generations of women and girls to pursue careers in science and technology. https://go.nasa.gov/3NzVmHU",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at @SpaceCenterHou, @AstroVicGlover reflects on the holiday and its history.",
    "Happy Father’s Day, Sun \n\nOur Sun may be old, large, and full of gas, but it also provides our solar system with energy and light, without which life as we know it would not exist. Shout out a father figure who gives you energy:",
    "Every December, the Geminids light up the night sky in one of the biggest meteor showers of the year.\n\nAs our Parker Solar Probe swoops around the Sun—closer than any spacecraft in history—it's helping uncover how these shooting stars came into existence: https://go.nasa.gov/3NfS0se",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "Time for work! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the \n@Space_Station\n.",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\"",
    "LIVE: Tune in as we review next steps for the Psyche mission, set to launch no earlier than Oct. 2023. The spacecraft will study a metal-rich asteroid of the same name that may be the partial core of a building block of rocky planets in our solar system.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! @SpaceX's #CRS28 cargo launch lifted off from @NASAKennedy at 11:47am ET (1547 UTC). Learn more about the @ISS_Research it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the @Space_Station!\n\n@SpaceX's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the @Space_Station, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "LIVE: Get the latest details on the launch of @SpaceX’s #CRS28 uncrewed cargo resupply mission to the @Space_Station. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, @SpaceX’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the @Space_Station. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow \n@NASAEarth\n!",
    "Liftoff! Two small satellites are on the way to join two already in orbit for our TROPICS mission. TROPICS will provide near-hourly data that could improve forecasts of tropical cyclones and severe weather.",
    "LIVE: Watch the second pair of shoebox-sized satellites launch to orbit for our storm-tracking TROPICS mission. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 11:46pm ET (0346 UTC) at the opening of the launch window."
]