[
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "fwiw you can post thirst pics on twitter too",
    "All those moments, \nwill be lost in time\nlike tears in rain …",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Why is sleep so hard!? Perhaps we will never know.",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the @FortniteGame Chapter 4 release with @FindYourBattle—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "First Model Y deliveries in Türkiye",
    "We’re purging accounts that have had no activity at all for several years, so you will probably see follower count drop",
    "Tesla Lithium Refinery groundbreaking will be streamed live on Twitter at 3 PM CDT",
    "What should do more of or less of or aren’t including at all?",
    "We’re trying hard to make your feed as compelling as possible (maximize unregretted user minutes). \n\nHow is it now vs 6 months ago?",
    "Yesterday in the pit",
    "I read \n@paulg\n’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Falcon Heavy launches \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit",
    "How it started:                                              How it's going:",
    "Even benign dependency on AI/Automation is dangerous to civilization if taken so far that we eventually forget how the machines work",
    "They are the same picture"
]