[
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to @SpaceX and @Axiom_Space for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next @SpaceX cargo mission to the @Space_Station. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "LIVE: Listen as we discuss the science aboard the next @SpaceX cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the @Space_Station. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the @Space_Station shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "#Ax2 has arrived! The @SpaceX Dragon crew ship with four private astronauts from @Axiom_Space docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on @NASA TV.",
    "NOW: Watch the @Axiom_Space #Ax2 astronauts arrive at the @Space_Station. The @SpaceX Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, @Axiom_Space's second all-private mission to the @Space_Station.",
    "#Ax2's @SpaceX Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the @Space_Station.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from @NASAKennedy at 5:37pm ET (2137 UTC).",
    "Did you catch our latest @NASAArtemis Moon Minute in the Axiom-2 launch broadcast?\n\n@NASA and @Axiom_Space are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the @Space_Station for scientific research, student outreach and commercial activities on @Axiom_Space's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and @SpaceX—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the @Space_Station, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from @NASAKennedy. https://youtube.com/watch?v=63TWnnZhePo…",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones."
]