[
    "Produced our 10 millionth 4680 cell at Giga Texas this week!",
    "Who should be President in 2032?",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Within 15 mins, you can recover up to 200 miles/275 km",
    "Once again, I’d like to offer this platform to anyone on the left. You will get equal treatment.",
    "Bold",
    "Why ESG is the devil …",
    "After delivering 72 spacecraft to orbit, Falcon 9 returns to Earth and completes SpaceX’s 200th landing of an orbital class rocket",
    "Falcon 9’s first stage has landed on Landing Zone 4, marking SpaceX’s 200th successful recovery of an orbital class rocket!",
    "It’d be great to have \n@maddow\n, \n@donlemon\n & others on the left put their shows on this platform. No exclusivity or legal docs required!\n\nYou will receive our full support. The digital town square is for all.",
    "Powerful article",
    "Great to work with you!",
    "Internet from space supporting Titanic dive expedition ",
    "Spaces discussion with Mary Barra, CEO of \n@GM\n! \n@mtbarra",
    "Model 3 & Y have great air filtration too, but they’re too small to fit the monster HEPA filters",
    "It’d be great to have @maddow, @donlemon & others on the left put their shows on this platform. No exclusivity or legal docs required!\n\nYou will receive our full support. The digital town square is for all.",
    "Spaces discussion with Mary Barra, CEO of @GM! @mtbarra",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Every parent should watch this",
    "The Babylon Bee + \n@elonmusk\n at Twitter HQ\n\nTOMORROW. Premiering exclusively on Twitter.",
    "Powerwall is one of the best products I've ever purchased. Nothing but sunny blue skies for over a week, yet power is out for 5k+ customers.\n\nCheck out more details of my \n@Tesla\n Powerwall experience here https://youtu.be/DA3fRMm3a0c",
    "Lil X just asked if there are police cats, since there are police dogs "
]