[
    "Every parent should watch this",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Hold on to your horse as the carousel of destiny spins ever faster",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch 22 @Starlink satellites to orbit → http://spacex.com/launches",
    "I have spaceships",
    "AI ",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "The spice must flow",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - \n@SeanEcom\n CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "Congratulations Tesla Texas Team!!",
    "With latest version of app, you can DM reply to any message in the thread (not just most recent) and use any emoji reaction. \n\nRelease of encrypted DMs V1.0 should happen tomorrow. This will grow in sophistication rapidly. The acid test is that I could not see your DMs even if… Show more",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - @SeanEcom CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get @CommunityNotes. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more"
]