[
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "Happy Father’s Day, Sun \n\nOur Sun may be old, large, and full of gas, but it also provides our solar system with energy and light, without which life as we know it would not exist. Shout out a father figure who gives you energy:",
    "Every December, the Geminids light up the night sky in one of the biggest meteor showers of the year.\n\nAs our Parker Solar Probe swoops around the Sun—closer than any spacecraft in history—it's helping uncover how these shooting stars came into existence: https://go.nasa.gov/3NfS0se",
    "Another busy week at NASA\n\n\n@NASA_Astronauts\n install solar arrays on the \n@Space_Station\n, a new X-plane is named, and a laser communication system for #Artemis awaits integration.\n\nSubscribe for more space and aeronautics in your life: http://nasa.gov/subscribe",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "It’s giving…life.    #WorldOceansDay",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "LIVE: Listen as we discuss the science aboard the next \n@SpaceX\n cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to @SpaceX and @Axiom_Space for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next @SpaceX cargo mission to the @Space_Station. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "LIVE: Listen as we discuss the science aboard the next @SpaceX cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the @Space_Station. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the @Space_Station shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in @SpaceX's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the @Space_Station. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their @SpaceX Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22."
]