[
    "Come explore asteroids with us!\n\nTake a guided tour of our “Eyes on Asteroids” visualization app today at 11am PT (2pm ET). Our guide and an asteroid expert will show you how to explore ~28,000 near-Earth objects and talk about the ways we study them. http://bit.ly/asteroids-live",
    "With a phone or computer, you can help astronomers \n@DoNASAScience\n and uncover some of the most elusive objects in the universe—brown dwarfs. These balls of gas never became stars, so this is your chance to shine a light on them: https://go.nasa.gov/3r4wdMO",
    "NOW: A \n@NASAAero\n project update on the experimental X-57 all-electric aircraft.",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, \n@NASAAero\n leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "\"And when we do things that improve equity for the people who have it the worst, we are improving equity across the board.\" — S. J. Ralston, Mars research scientist, advocates for transgender and nonbinary people in the workplace. #PrideMonth https://nasa.gov/faces-of-nasa/sj-ralston…",
    "LIVE: Two cosmonauts are stepping outside the \n@Space_Station\n to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "I think we win this one. Happy #NationalSelfieDay ",
    "We've reaffirmed our shared commitment with the \n@USDA\n to benefit people everywhere. Our continued collaboration aims to address climate challenges and bolster plant-based research on the \n@Space_Station\n that could help improve food security on Earth. https://go.nasa.gov/3qXbYAN",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Another busy week at NASA\n\n\n@NASA_Astronauts\n install solar arrays on the \n@Space_Station\n, a new X-plane is named, and a laser communication system for #Artemis awaits integration.\n\nSubscribe for more space and aeronautics in your life: http://nasa.gov/subscribe",
    "U.S. and international media: You are invited to \n@NASAKennedy\n to interview subject matter experts and view the \n@NASA_Orion\n spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at \n@NASAKennedy\n. https://go.nasa.gov/3NfJcCU",
    "Steve Bowen, 10-time spacewalker.  ",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Spacewalkers Steve Bowen and \n@Astro_Woody\n have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    ".\n@EuropaClipper\n is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at \n@NASAJPL\n your questions live now:",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this \n@NASA_SLS\n model: https://go.nasa.gov/3MXGvpc",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7"
]