[
    "We’re launching solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n on the next \n@SpaceX\n cargo mission, set for June 3.\n\nTune in on May 30 at 2pm ET (1800 UTC) for details. #AskNASA your questions and we may answer them on-air. https://go.nasa.gov/430oldn",
    "Paula Cain started her career in fashion design—now, she's a thermal blanket technician at \n@NASAGoddard\n, making sure our telescopes and spacecraft can run at a steady temperature.\n\nLearn more about her journey in our latest \n@NASASTEM\n episode of \"Surprisingly STEM!\"",
    "Our \n@NASAEarth\n TROPICS mission is safely in orbit following today's successful launch by \n@RocketLab\n. Two small satellites join a pair already in space, where they'll track the formation and evolution of tropical cyclones, including hurricanes. https://go.nasa.gov/3MVXPwa",
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow \n@NASAEarth\n!",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "Want to help us find asteroids? A new \n@DoNASAScience\n project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "What healthy and sustainable ways would you use to keep astronauts fed on long-duration missions to the Moon, Mars, and beyond?\n\nThe Phase 2 winners of our Deep Space Food Challenge will be revealed live Friday, May 19, at the #NYCxDESIGN Festival: https://go.nasa.gov/3MCRLIF",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "Happy Earth Day from me and our good friends over at NASA.\n \nFor our children and grandchildren, we must stand united in our effort to save our only home.",
    "What was it like when Apollo 8 astronaut Bill Anders saw Earth rise over the Moon’s horizon in 1968?\n\nHe reflects with Dr. Kate Calvin, NASA senior climate advisor and chief scientist, on taking the famous photo helped humanity \"discover\" Earth. https://go.nasa.gov/43QKQCr\n\n#EarthDay",
    "Watch as \n@NorthropGrumman\n’s S.S. Sally Ride undocks from the \n@Space_Station\n 250 miles over the Mediterranean.",
    "Live Now: Watch as the uncrewed \n@NorthropGrumman\n S.S. Sally Ride Cygnus cargo spacecraft departs from the \n@Space_Station\n.\n\nThe spacecraft delivered snacks, science, and supplies to the orbiting laboratory in November 2022:\nhttp://go.nasa.gov/3MWtqhI",
    "HOP IN SPACEFOLKS! \n\nWe're blasting off together on a new mission—\n@TheWebbyAwards\n. Together we've: launched #Artemis I, watched DART smash into an asteroid, and explored with \n@NASAWebb\n. Now we're hoping to land #Webbys. You in? Vote by the end of today: https://bit.ly/3zHiqgs",
    "As we open up the next generation of opportunities in low-Earth orbit, \n@CollinsAero\n is designing a new spacesuit that's more adaptable, flexible, and easy to use for spacewalks outside the \n@Space_Station\n. Get the details: https://go.nasa.gov/3MUIUmm",
    "We’ve been nominated for nine \n@TheWebbyAwards\n for bringing discoveries from across the universe right to your screen. \n\nWe love sharing space with you. If the feeling is mutual, cast your #Webbys vote for NASA social media by Thursday, April 20: http://bit.ly/3zHiqgs",
    "For solar eclipses visible around the world, check out: https://go.nasa.gov/3mrbj8y",
    "One year from now, millions of skywatchers across the U.S. will have the opportunity to see a total solar eclipse. It will be the last time one will cross the U.S. for more than 20 years. \n\nWhere will you be? https://go.nasa.gov/3KnSYRL",
    "Designed to endure at least 7 passes through Jupiter's intense radiation, the JunoCam instrument has survived 50 so far – and it’s still going strong. In this new @googlearts exhibition, celebrate the otherworldly vistas “the public’s camera” has shown us: https://artsandculture.google.com/story/XwUxhKx1GDOOTA…",
    "The #JunoMission completed its 50th close pass of Jupiter this past weekend. Relive highlights from its journey around the solar system’s largest planet, download high-res images and learn more: https://go.nasa.gov/40ZRrIQ",
    "From Monday's #Artemis II crew announcement to the latest science updates from Mars and Uranus, it's been a whirlwind week across the solar system.\n\nCheck out what else has been going on This Week at NASA—then get the details on our Artemis II mission: https://nasa.gov/specials/artemis-ii/…",
    "An epic dance: At this very moment, the #JunoMission spacecraft is approaching Jupiter for its 50th close pass of the giant planet. Ride along using our 3D solar system simulator: https://go.nasa.gov/3ZI8Q7v",
    "Stars: always making a dramatic exit!  \n\nWebb’s powerful infrared eye has captured never-before-seen detail of Cassiopeia A (Cas A). 11,000 light-years away, it is the remnant of a massive star that exploded about 340 years ago: https://go.nasa.gov/3ZJnk72",
    ".\n@VP\n spoke to the #Artemis II astronauts about their upcoming mission around the Moon, and how it will pave the way for future long-term human exploration missions to the Moon, and eventually Mars.",
    " What's up in the night sky this April?\n\nThe Moon will pair up beautifully with several planets, while viewing conditions may be ideal for the Lyrid meteor shower. More skywatching tips:",
    "In our search to provide drinking water for astronauts, we helped solve water problems here on Earth. One resulting \n@NASASpinoff\n has been incorporated into water bottles, industrial water purification & a water-recycling shower, filtering out contaminants. https://go.nasa.gov/3nD3ltd",
    "Tiny bits of Saturn’s rings are falling into the massive planet, causing its upper atmosphere to heat up. The discovery was made using 40 years of data from several \n@NASASolarSystem\n missions, including \n@NASAHubble\n: https://go.nasa.gov/3G4ova1"
]