[
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two \n@NASA\n Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "What's your favorite @NASAHubble image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, @VP Kamala Harris & @President_KR Yoon Suk Yeol will tour @NASAGoddard and meet with scientists to see firsthand climate change research underway. They will also take an early look at @NASARoman, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades.",
    "NOW: @NASAEarth and @CenterForAstro scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at @nasa.",
    "Meet the first member of our #Artemis II Moon crew: mission specialist \n@Astro_Christina\n! \n\nChristina Koch visited the \n@Space_Station\n in 2019, where she took part in the first all-woman spacewalk. She began her career as an electrical engineer at \n@NASAGoddard\n.",
    "LIVE NOW: Who’ll fly around the Moon aboard the #Artemis II mission? You’re about to find out.\n\nThese astronauts will take the next giant leap — paving the way for future lunar landings and human exploration of Mars.",
    "If you’re on \n@Facebook\n, you can hit “going” for our watch event to get notifications and updates: https://fb.me/e/2BZNQrYBt",
    "You can learn which astronauts will fly around the Moon while you chat on \n@Twitch\n:",
    "Set a reminder on \n@YouTube\n to find out which astronauts are a part of the \n@NASAArtemis\n II mission:",
    "One mission. Four astronauts. So many ways to watch the #Artemis II astronaut announcement.     The thread below tells you all the places you can find this historic event. We make history on Monday, April 3, starting at 11am ET (1500 UTC).",
    " Need more space in your inbox? Subscribe to our weekly newsletter for the latest stories from across the universe.\n\nSign up: http://nasa.gov/subscribe\n\n¡También en español! http://nasa.gov/suscribete",
    "A new \n@NASAEarth\n & \n@CenterForAstro\n mission preparing for launch will be the first to take hourly observations of air quality in North America. Data from #TEMPO will improve forecasts & reveal disparities in pollution exposure within cities and communities. https://go.nasa.gov/3K3Zhd4",
    "Our crawler-transporter was recognized as the world's heaviest self-powered vehicle, DC welcomed the #Crew4 astronauts, and we prepare to recover asteroid samples returning in September—This Week at NASA.\n\nSubscribe for videos on Earth, flight & space at http://bit.ly/3mFZr2s",
    "Through #WomensHistoryMonth and every day, we honor the women at NASA who brought us to where we are and inspire generations past, present, and future to explore the cosmos. http://nasa.gov/women"
]