[
    "Edufuture Excellence Awards",
    "Siliguri Mango Festival: West Bengal Farmers Grow World's Most Expensive Mango, It Is Priced At..",
    "Partygate: Boris Johnson Resigns As UK Lawmaker With Immediate Effect Over Partygate Report",
    "WTC 2023 Final: From India's Top Order Failure To Steve Smith's Century, All About WTC | Day 2",
    "Why Is ICC Preparing Two Pitches In The Oval Stadium? | WTC Finals | Rohit Sharma | Pat Cummins",
    "Kapil Sibal Joins Kejriwal In Fight Against Centre's Ordinance",
    "'Team India Is New South Africa Of World Cricket', Unhappy Fans Slam BCCI",
    "Blame Game In Team India's Camp After Defeat Against Australia In WTC Final",
    "Prabhas, Kriti Sanon's Adipurush Advance Booking Starts, Over 10000 Tickets So",
    "How Has Team India Performed In ICC Knockout Games Since 2013 Champions Trophy",
    "How Is Stress And Headache Related To Brain Tumours? Check Expert Guide",
    "What Is Taurine? How Can It Boost A Healthier Life - Reveals Study",
    "India In Grip Of Communal Tension; BJP Indulging In Individual Worship: JD(U)",
    "What Is UP's 'Love-Jihad' Law? 5 Must Know Facts",
    "Analysis: How Powerful Is Sachin Pilot In Rajasthan?",
    "india vs australia wtc final 2023",
    "Highlights | IND VS AUS: Australia Beat India By 209 Runs To Claim WTC Title",
    "'Right Decision Was Made,' Carey On Green's Controversial Catch Of Gill",
    "7 Travel Destinations You Must-Visit To Witness Breathtaking Waterfalls",
    "Relief For Home Buyers! RBI MPC keeps repo rate unchanged; maintains withdrawal of accommodation",
    "Horoscope Today, June 11 By Astro Sundeep Kochar: Gemini, Meet your Friends",
    "News Wrap: Modi's Meet With Biden With To Green's Controversial Catch- In Pics",
    "What Was Vyapam Scam? 10 Must Know Facts",
    "Chhattisgarh Election 2023",
    "Chhattisgarh Election 2023: Baghel's Big Statement On Next Congress CM Face",
    "Amarnath Yatra: Do You Know Traditional Routes To The Holy Cave? Read Here",
    "Amarnath Yatra 2023: Why Is Samosa, Jalebi, Pizza, Burgers And More Banned?",
    "Lionel Messi's AI-Generated Miami Look Avatar Sets Internet On Fire",
    "Men Should These 10 THINGS For Sexual Health",
    "10 Super-Cool Beach Looks For Men",
    "10 Best Wedding Saree Trends",
    "10 Easy Ways To Get Rid Of Dark Circles",
    "Top Most Mad, Cruelest Monarchs Of World In Ancient History",
    "10 Best Books For Holiday Reading",
    "10 Beauty Tips For Teen Girls",
    "10 Places To Visit Allahabad Prayagaraj",
    "AI Pics Of World Leaders Like Modi, Trump, Obama In Baby Avatar Go Viral",
    "Horoscope Today, June 11 By Astro Sundeep Kochar: Gemini, Get Back To Your Social Cycle",
    "Horoscope Today, June 10 By Astro Sundeep Kochar: Pisces, Be Swift Today",
    "Horoscope Today, June 9 By Astro Sundeep Kochar: Taurus, Focus On Your Work",
    "Ranbir Kapoor Unleashes The Roar Of 'Animal' In Pre-Teaser - Watch",
    "Sanjay Kapoor Opens Up About His Character In Shahid Kapoor's 'Bloody Daddy'",
    "Director Sudipto Sen Comes On Board For Subrata Roy Biopic 'Saharasri'",
    "Who Is 'Sholay Girl' Reshma Pathan? India’s Best Dancer Season 3 Honours Her",
    "Meet Rakshitha Reddy, The Ravishing Wife Of Telugu Star Sharwanand - Pics",
    "Veteran Actor Gufi Paintal Dies Of Heart Failure In Mumbai Due To Heart Failure",
    "Manoj Bajpayee Talks About His Favourite Moments While Shooting Sirf Ek Bandaa Kaafi Hai",
    "IIFA 2023: Vicky Kaushal Gets A Hug From Salman Khan, Shares The Truth Behind The Viral Video",
    "UPCOMINGBOTSWANA VS RWANDABOTVSRWATue, 13 Jun (06:30 GMT|12:00 IST)",
    "UPCOMINGWEST INDIES VS SCOTLANDWIVSSCOTue, 13 Jun (07:00 GMT|12:30 IST)",
    "UPCOMINGZIMBABWE VS OMANZIMVSOMATue, 13 Jun (07:00 GMT|12:30 IST)",
    "UPCOMINGNEPAL VS UNITED ARAB EMIRATESNEPVSUAETue, 13 Jun (07:00 GMT|12:30 IST)",
    "MATCH ENDED | 11-15RWANDA VS UGANDARWA 81VS 82/2UGAUganda beat Rwanda by 8 wickets",
    "MATCH ENDED | 11-15GERMANY VS BELGIUMGER 150/2VS 148/9BELGermany beat Belgium by 8 wickets",
    "MATCH ENDED | 11-15KENYA VS BOTSWANAKEN 98/2VS 92/8BOTKenya beat Botswana by 8 wickets",
    "Why Team India Has Failed To Win ICC Knockouts In Last 10 Years?",
    "Fact Check: Is T20 World Cup 2024 Shifting To UK From USA And West Indies?",
    "Watch: Angry Sunil Gavaskar Slams Virat Kohli's Poor Shot Selection",
    "Shubman Gill To Face One Match Ban? India Star In Deep Trouble",
    "Who Is The Best Sledger In Indian Cricket Team? Ravindra Jadeja Answers",
    "CSK Star Ruturaj Gaikwad Marries Utkarsha Pawar, Shares Pics From Wedding Ceremony; See Here",
    "Happy Birthday Wasim Akram: Top 6 Records Which Belong Exclusively To 'Sultan Of Swing'",
    "Shakira Drops New Hint Of Dating F1 Racer Lewis Hamilton Amid Romance Rumours",
    "India Outclass Korea To Win Women's Junior Asia Cup 2023 Title",
    "French Open Final 2023: Djokovic vs Ruud LIVE Streaming Details",
    "Watch: French Open Trophy's Lid Drops After Iga Swiatek Celebrates Her Third W",
    "Man City Are Champions Of Europe As They Clinch Historic CL Title For 1st Time",
    "WTC 2023 Final: Australia Wins WTC Final Beating India By 209 Runs | Zee News English",
    "French Open 2023: Iga Swiatek Reigns Supreme At French Open For The Third Time",
    "WTC 2023 Final: From Australia setting daunting Target To Virat-Rahane Partnership | WTC | Day 4",
    "2023 Range Rover Autobiography Review: Design, Features, Performance- IN PICS",
    "Top 5 Bizarre Pre-Batting Antics Of Cricketers - In Pics",
    "Smith's Record Ton To Rahane's Landmark Catch: TOP Records From WTC Final",
    "2023 Range Rover Autobiography Review: Design, Features, Performance, Price - IN PICS",
    "Citroen C3 Hatchback Prices Hiked By Up To Rs 17,500 In India",
    "Odisha-Like Train Accident Averted In Chhattisgarh; Head On Collision Avoided",
    "Air India Begins Second Mumbai-Mangaluru Daily Flight Services",
    "Delta Airlines Flight's Air Slide Opens Inside Plane, Injures Crew Member",
    "IndiGo Flight Strays Into Pakistan Amid Inclement Weather: Report",
    "Odisha Train Tragedy: No Trains To Stop At Bahanaga Bazar As CBI Seals Station",
    "Meet zPod, India's 'first autonomous car' unveiled in Bengaluru",
    "Honda Elevate Review: Can This Mid Size SUV Dominate Hyundai Creta, Maruti Suzuki Grand Vitara?",
    "Tata Altroz iCNG First Drive Review: Enough Trunk To Put Rivals At Rest?",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "WhatsApp Rolling Out Redesigned Emoji Keyboard On Android Beta",
    "Twitter Is Refusing To Pay Its Google Cloud Bills - Platformer",
    "LinkedIn Introduces AI Copy Suggestion Feature For Ad Creatives",
    "WhatsApp Rolling Out New Interface For Group Settings Screen On iOS",
    "JioTag Launched In India: Track Your Belongings With Ease, Know Its Cost",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Nora Fatehi's Summer Wardrobe: 7 Times Diva Flirted With Floral Prints - In Pics",
    "Rubina's Car Meets With Road Accident, Actor Shares Pic Of Damaged Cars",
    "Sensitive Skin Care Routine",
    "7 Tips To Take Care Of Sensitive Skin During Summers",
    "Shraddha Kapoor Is Excited For 'Her Season,' Shares Stunning Pics Of Monsoon",
    "Wedding Bells For Gehna Vasisth And Faizan Ansari? Here's What We Know",
    "Priyanka Chopra Performs Puja With Daughter On Father's Death Anniversary",
    "'Buniyaad' Actor Mangal Dhillon Passes Away After Battling Cancer",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "Mahima Makwana looks hot flaunts her sexy curvy figure in dazzling saree",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Aditya L-1: All About ISRO's First Solar Mission",
    "10 Deadliest Animals Found in India and Other Countries Across World",
    "Why Do We Crave 'Comfort Food' When Chronically Stressed? Study Explains",
    "How Does Hot Weather Affect The Heart And Brain? Check Symptoms & Diagnosis",
    "Who Is Navniet Sekera: The IPS Officer Who Inspired Web Series 'Bhaukaal'?",
    "NExT Mandatory For Foreign Medical Graduates; Will It Replace NEET PG?",
    "Live| AP ICET 2023 Result: Manabadi Rank Cards To Be Out SOON, Check Updates",
    "CSBC Recruitment: Over 21,000 Vacancies For Constable Posts Announced",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]