[
    "Khalistani Separatist Gurpatwant Singh Pannun Killed In An Accident In United States?",
    "Chandrayaan-3 Launch: ISRO Integrates Spacecraft With GSLV-MkIII, Know All About It",
    "Israel's Counter Terrorist Operations In West Bank Creates Rift, US Back Israel's Right To Defend",
    "Taliban orders closure of hair and beauty salons in Afghanistan",
    "Made In Heaven Season 2 Coming Soon: Sobhita Dhulipala, Arjun Mathur Are Back!",
    "Ranveer Singh's Whopping Net Worth Is Over Rs 300 Cr - See His Car Collection",
    "SCO: 72-3 (17) | NED vs SCO, CWC Qualifiers 2023: Scotland Lose Third Wicket",
    "Popular IAS Tina Dabi Pregnant! Her 'Boy Or Girl' Message Will Win Your Heart",
    "Who Is India’s Richest Cricketer With Net Worth Of Rs 20,000 Crore",
    "Twist In Jyoti Maurya Case! Husband Allegedly CHEATED Her At Time Of Marriage",
    "Chandra Arya Punches Khalistanis On Face: 'Snakes Raising Heads And Hissing'",
    "NCP Pari-War Meet: Ajit Ahead Of Sr Pawar In MLA Number Game; 32 With Nephew",
    "MP CM Washes Feet Of Sidhi Urination Incident Victim, Apologises To Him",
    "NCP Crisis: Sharad Pawar Rushes To Delhi For National Executive Meet",
    "Who Is Tahawwur Rana? 26/11 Attacks Accused, David Headley's Childhood Friend",
    "India Vs WI 2023: Kohli Dismissed Cheaply By Unadkat In Practice Tie, WATCH",
    "sharad pawar vs ajit pawar",
    "Sharad Pawar vs Ajit Pawar: Who Is Real President Of NCP?",
    "Tamim Iqbal Shockingly Retires From All Forms Of Cricket Just Months Before WC",
    "India win SAFF C'ship with penalty shootout win over Kuwait",
    "Kia Unveils Seltos 2023 In India For The First Time, Check Out Full Video Of The Specs",
    "Vietnam Bans 'Barbie' Movie Over Controversial Map Of South China Sea",
    "10 New OTT Releases This Weekend: Adhura, Tarla, Blind To Fatal Seduction",
    "Jaiswal To Sai Sudharsan: IPL Stars Who Have Earned Call-Up To Indian Teams",
    "Horoscope Today, July 6 By Astro Sundeep Kochar: Scorpio, Shift Your Focus",
    "CBSE Class 12 Board Exams 2024",
    "The Key to Success in CBSE Class 12 Board Exams 2024 through Previous Papers",
    "Supriya Pattanayak Success Story",
    "Supriya Pattanayak Story: From Rs 10,000 Job To VC Of Centurion University",
    "JEE Main 2024 Registration to Start in December 2023, Know Application Dates",
    "10 Health Benefits Of Vajrasana",
    "9 Things To Learn From Japanese Culture",
    "9 Reasons You Should Quit Eating Non-Vegetarian Food",
    "10 Hindi Baby Names Based On Sun",
    "10 Most Iconic Korean Dramas Of All Time",
    "10 Out Of The Box Schools Across Globe",
    "10 Things To Know About Mughal Harems",
    "10 Super-Fruits Good For Morning Meal",
    "10 Powers Of President Of India",
    "Horoscope Today, July 6 By Astro Sundeep Kochar: Scorpio, Shift Your Focus Inwards",
    "Horoscope Today, July 5 By Astro Sundeep Kochar: Libra, Today Is Your Lucky Day",
    "Horoscope Today, July 4 By Astro Sundeep Kochar: Cancerians, Be Yourself",
    "Bawaal Teaser Reactions: Varun Dhawan-Janhvi Kapoor's New Jodi Excites Fans",
    "Ranveer Singh Turns 38: 6 Times He Left The Audience Spellbound",
    "Pathaan Set To Conquer Japanese Audience After Spectacular Impact In India",
    "Will SRK Have A Cameo In Rocky Aur Rani Kii Prem Kahaani? Find Out",
    "Salaar Teaser: Prabhas-Prithviraj Sukumaran In Violent, Thrilling Ride - Watch",
    "Varun Dhawan, Janhvi Kapoor's Chemistry In Bawaal Teaser Sets Screen On Fire",
    "Who Is YouTuber Devraj Patel? The ‘Dil Se Bura Lagta Hai' Meme Person Passes Away",
    "LIVE-1 Inning |06-10SCOTLAND VS NETHERLANDSSCO 75/3VSNEDNetherlands elected to field",
    "LIVE-1 Inning |06-10USA VS UNITED ARAB EMIRATESUSAVS 67/0UAEUnited Arab Emirates elected to bat",
    "UPCOMINGENGLAND VS AUSTRALIAENGVSAUSThu, 06 Jul (10:00 GMT|15:30 IST)",
    "UPCOMINGNAMIBIA VS UGANDANAMVSUGAThu, 06 Jul (12:00 GMT|17:30 IST)",
    "UPCOMINGSRI LANKA VS WEST INDIESSLVSWIFri, 07 Jul (07:00 GMT|12:30 IST)",
    "UPCOMINGJERSEY VS GUERNSEYJSYVSGSYFri, 07 Jul (16:00 GMT|21:30 IST)",
    "MATCH ENDED | 05-9NAMIBIA VS UGANDANAM 191/6VS 165/4UGANamibia beat Uganda by 26 runs",
    "MATCH ENDED | 05-9WEST INDIES VS OMANWI 222/3VS 221/9OMAWest Indies beat Oman by 7 wickets",
    "MATCH ENDED | 04-8IRELAND VS NEPALIRE 269/8VS 268/9NEPIreland beat Nepal by 2 wickets",
    "Shaheen Afridi’s Bold Statement: ‘India Versus Pakistan’ Is ‘Just One Game’",
    "Ashes 2023: McGrath Slams England, Says They Are Playing ‘Cazball Not Bazball’",
    "EXPLAINED: Why Rinku Singh Was Not Selected For T20Is Vs West Indies?",
    "Sachin Tendulkar Shares Pic With Yuvraj Singh, Ajit Agarkar: Brian Lara Reacts",
    "As Hotel Booking Gets EXPENSIVE In Ahmedabad For IND vs PAK, Sehwag Says THIS",
    "England Vs  Australia 3rd Ashes Test: Dream11 Team, Fantasy Hints, More",
    "Steve Smith To Usman Khawaja, Top 5 Leading Run Scorers In Tests In 2023",
    "Neeraj Chopra Became Non-Vegetarian Only In 2016: Know His 5 Fitness Secrets Here; In Pics",
    "Jeakson Breaks Silence On Flaunting 'Manipur' Flag During Championship Win",
    "EPL: Man United Give Ronaldo's Number 7 To Mount After $69 Million Move",
    "Wimbledon 2023: Medvedev Marches Into Second Round With Win Over Fery",
    "Happy Birthday PV Sindhu: A Look Indian Shuttler's Career - In Pics",
    "WATCH: 'Vande Mataram', Chants Echo At Stadium After India Win SAFF C'ship",
    "What Is Thappad Kabaddi? This Variant Has Taken Internet By Storm",
    "Meet Ajit Agarkar, BCCI's New Chief Selector, Indian Pacer Who Created Unwanted Records",
    "MCC Responds To Long Room Incident, Suspends 3 Members | Zee News English",
    "ICC World Cup 2023 Qualifiers: The Massive And Powerful West Indies Have Collapsed",
    "10 New OTT Releases This Week",
    "Shah Rukh Khan Spotted At Mumbai Airport With Wife Gauri, Son AbRam - In Pics",
    "SAFF 2023: Chhetri Wins Both Golden Boot, Ball; Full List Of Award Winners",
    "Best Dog Breed for Each Zodiac Sign: A 'Pawsome' Buddy As Per Your Personality",
    "Rohit Sharma To Virat Kohli: Batters With Most Sixes In International Cricket",
    "Go First Insolvency: High Court Allows Lessors To Access, Maintain Aircraft",
    "Triumph Speed 400 Launched In India At Rs 2.33 Lakh For First 10,000 Buyers",
    "Vande Bharat Passenger Shares 'Now vs Then' Pics Of Food, Points Out Problem",
    "Maruti Suzuki Invicto Hybrid MPV Launched In India Priced At Rs 24.79 Lakh",
    "Watch: UK Man Tries To Open Plane's Door On Ryanair Flight, Tackled",
    "Kochi-Ho Chi Minh City Direct Flight Services To Begin Soon",
    "2023 Range Rover Autobiography Review: Colossal, Capable, Comfortable, Classy, But Costly?",
    "Interview with Santosh Iyer, MD and CEO of Mercedes-Benz India",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "Apple May Introduce New Colours For iPhone 15 Lineup",
    "Gboard Calculator On iPhone Will Simplify Daily Calculations: How It Works",
    "Twitter Quietly Removes Login Requirement To View Tweets",
    "Mark Zuckerberg Returns To Twitter After 11 Years As He Launches Threads",
    "OnePlus Nord 3 Launched In India: Check Price In India, Processor & More",
    "Do You Want To Get Rid Of Anxiety & Depression? Stop Scrolling Instagram, &...",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "International Yoga Day 2023: 6 Yoga Asanas To Manage High Blood Sugar - In Pics",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Diva Who Wed Salman Khan's Close Friend, Worked with SRK, Died Mysteriously",
    "Happy Birthday Ranveer Singh",
    "Happy Birthday Ranveer Singh: His Most Lovable Moments With Deepika Padukone",
    "Disha Patani Glams Up For Hello Magazine Cover In Sheer Cut-Out Dress - Pics",
    "Throwback Thursday: When Priyanka Chopra's Mom Left Medical Practice For Her",
    "DNA: If you use more phone then pay more insurance premium",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "NASA Re-Establishes Contact With Mars Ingenuity Helicopter",
    "Life In Space? NASA Discovers Crucial Carbon Molecule In Space For First-Time",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Young Adult Kidney Cancer Survivors At Higher Risk Of Heart Problems: Study",
    "Researchers Try To Identify Early Stages Of Osteoarthritis",
    "Endometriosis Linked To Reduction In Fertility: Study",
    "10 Tips To Ensure Adequate Nutrition For Urban Women",
    "LIVE | UGC NET 2023: Answer Key To Be OUT Today, Result Soon- Direct Link Here",
    "TS Inter Supplementary Results 2023",
    "TS Inter Supplementary Results 2023: 1st, 2nd Year Result To Be Released Soon",
    "TSPSC Group 1 Prelims Result 2023 Likely To Be Released Today At tspsc.gov.in",
    "Live| NEET UG 2023 Counselling (SHORTLY): MCC To Begin Registration SOON",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]