[
    "Al Jazeera, link to home page",
    "Ukraine says six killed in Russ­ian at­tack on Kryvyi Rih",
    "US envoy to Kyiv comments on the missile strikes on Ukraine’s Kryvyi Rih",
    "Russia says it arrested ex-defence industry workers suspected of spying for Ukraine",
    "US expected to send depleted-uranium tank rounds to Ukraine: WSJ",
    "New Zealand’s RNZ apologises for ‘pro-Kremlin garbage’ on Ukraine",
    "Trump’s arraignment: What to expect at court appearance in Miami?",
    "Three people found dead in UK city: Police",
    "UN chief backs proposal to create watchdog to monitor AI",
    "India and Nigeria threatened to shut down Twitter, founder says",
    "US says 22 soldiers injured in Syria helicopter accident",
    "Fate of jailed fighters still unknown months after Ethiopia truce",
    "China spinning a ‘web’ of influence campaigns to win over Taiwan",
    "At least nine people injured in Denver shooting",
    "How common is albinism and what gene causes it?",
    "Cau­tious calm pre­vails around US court where Trump will ap­pear",
    "Trump’s ar­raign­ment: What to ex­pect at court ap­pear­ance in Mi­a­mi?",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Ukraine says six killed in Russian attack on Kryvyi Rih",
    "NATO’s largest air force drill prepares for ‘crisis situation’",
    "‘Extraordinarily difficult operation’: All eyes on Ukraine attack",
    "Russia-Ukraine war: List of key events, day 475",
    "‘Massive’ Russian missile attack on Ukraine’s Kryvyi Rih city",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]