[
    "Al Jazeera, link to home page",
    "Rus­sia, Ukraine ex­tend wartime Black Sea grain deal, says Er­do­gan",
    "‘Our assessment regarding the Black Sea Grain deal has not changed’: Kremlin spokeswoman",
    "Russian shelling in Kherson region kills a child: Ukraine’s Yermak",
    "Turkey’s Erdogan says Black Sea Grain deal extended for two more months",
    "Russia and Belarus reaffirm commitment to nuclear non-proliferation treaty: TASS",
    "Global warming likely to breach 1.5C threshold for first time",
    "At least eight dead in north Italy floods; Grand Prix postponed",
    "Is India projecting ‘normalcy’ in Kashmir by holding G20 meeting?",
    "Will Thailand’s royalist-military elite let the opposition rule?",
    "Russia orders arrests of anti-war theatre director, film producer",
    "Turkey slams Charlie Hebdo’s cover of electrocuted Erdogan in tub",
    "Ecuador president dissolves legislature, bringing vote forward",
    "Pakistan official gives Khan 24 hours to hand over riot suspects",
    "In a scandal-filled election, will Greece’s youth be decisive?",
    "Flee­ing Su­dan: ‘I had to do it for my daugh­ter’",
    "Su­dan: To break the cy­cle of vi­o­lence, end the klep­toc­ra­cy",
    "Su­dan fight­ing: One month on and no so­lu­tion in sight",
    "Amid Su­dan’s clash­es, a doc­tor de­liv­ers dozens of ba­bies",
    "Analy­sis: Sau­di Ara­bia’s diplo­mat­ic en­er­gy, soft pow­er in Su­dan",
    "Photos: Displaced Turkish family in Gaziantep talks about run-off",
    "Russia, Ukraine extend wartime Black Sea grain deal, says Erdogan",
    "Patriot missile system in Ukraine likely ‘damaged’: Report",
    "US releases nuclear warhead data in bid to pressure Russia",
    "Five key takeaways from OpenAI CEO’s Senate hearing",
    "Russia-Ukraine war: List of key events, day 448",
    "Pig heads, BBQs: Mosque backlash tests S Korea religious freedom",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]