[
    "Al Jazeera, link to home page",
    "Evac­u­a­tions un­der way af­ter Nova Kakhov­ka dam blast",
    "Photos: Ukraine’s interior ministry says 885 people evacuated after dam blast",
    "Russia’s attacks on Ukraine have reached “an unprecedented level”: EU’s Borrell",
    "Russia shelling Kherson despite evacuations: Ukraine’s interior ministry",
    "Who controls the Nova Kakhovka dam?",
    "All to know about Ukraine’s Nova Kakhovka dam explosion",
    "Dozens of bodies remain unclaimed days after India rail disaster",
    "What does Erdogan’s re-election mean for Turkey-Gulf relations?",
    "Old is gold: Can ageing spark a surprise economic boom?",
    "Uighur siblings in India jail since 2013 face deportation threat",
    "Tottenham name Ange Postecoglou as new manager",
    "US, UK push against child abuse online alarms Asia dissidents",
    "‘Dead zone’: how the Ukraine war moved inside Russia",
    "Living the ‘Chinese Dream’: Beijing’s new world order",
    "Photos: Indonesia volcano draws thousands for ritual sacrifice",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Kazakhstan is a bridge between the North, South, East and WestquotesOpinion bySerik Zhumangarin",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "Sanctions on Russia may not be working, we now know whyquotesOpinion byBerit Lindeman",
    "Brazil’s Lula is right on global politics and wrong on UkrainequotesOpinion byBruno Cava",
    "Evacuations under way after Nova Kakhovka dam blast",
    "Ukraine, Russia trade blame for destruction of Nova Kakhovka dam",
    "‘Wild fantasies’: Wagner boss tears into Russian success claims",
    "Russia faces a new neighbourhood threat: China",
    "The Middle East: Goodbye America, hello China?",
    "Fattah: Iran unveils its first hypersonic missile",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]