[
    "Al Jazeera, link to home page",
    "‘Kyiv’s bar­bar­ic act’: Putin blames Ukraine for dam col­lapse",
    "54,000 Ukrainian troops trained by Kyiv allies so far",
    "NATO must discuss Kyiv’s security after the war: Stoltenberg",
    "Everything you need to know about the dam explosion",
    "Putin blames Ukraine for a ‘barbaric act’ on the Kakhovka dam",
    "Nova Kakhovka dam blast: Is Russia trying to freeze the war?",
    "Tear gas, water cannon fired on protesting Sri Lankan students",
    "CNN’s embattled CEO Chris Licht is out",
    "US elections 2024: Who is Republican challenger Mike Pence?",
    "Before and after: Satellite images show Kakhovka dam destruction",
    "Germany prepares to host biggest NATO air deployment exercise",
    "Iran has a hypersonic missile. What does that mean?",
    "What does the shock PGA Tour-LIV merger mean for golf?",
    "The sexual assault case behind Senegal’s unrest",
    "Photos: Iraq’s Christians fight to save ancient language",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Kazakhstan is a bridge between the North, South, East and WestquotesOpinion bySerik Zhumangarin",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "‘Kyiv’s barbaric act’: Putin blames Ukraine for dam collapse",
    "Canadian democracy is on edge — and China isn’t to blame",
    "Malaysia hails ‘victory’ in row with Sulu sultan’s Filipino heirs",
    "Russia faces a new neighbourhood threat: China",
    "All to know about Ukraine’s Nova Kakhovka dam explosion",
    "Why a map in India’s new parliament has riled its neighbours",
    "Russia-Ukraine war: List of key events, day 469",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]