[
    "Al Jazeera, link to home page",
    "‘Real good shape’: Biden-Sunak hail ties at White House meet",
    "Sunak under pressure as net migration to UK hits record 606,000",
    "Rishi Sunak’s proposed anti-asylum bill is dangerous",
    "UK Prime Minister Sunak talks trade, AI and Ukraine on US trip",
    "Warring sides trade blame for shelling in flood-hit Kherson",
    "‘Enduring commitment’: Key takeaways from US-GCC joint statement",
    "Why is Hannibal Gaddafi on hunger strike in a Lebanese prison?",
    "Children fight for their lives after French Alps knife attack",
    "At least 11 killed in Afghanistan mosque explosion",
    "El Nino under way, raising fears of extreme weather patterns",
    "USAID says it is halting all food aid to Ethiopia amid diversions",
    "Bodies floating in flooded areas after dam collapse: Zelenskyy",
    "Why has Saudi sovereign fund taken over kingdom’s football clubs?",
    "How much plas­tic is in our oceans?",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "China’s backlash against Little Mermaid exposes Hollywood bind",
    "India slams Canada for parade float showing ex-PM Gandhi’s murder",
    "Living the ‘Chinese Dream’: Beijing’s new world order",
    "Scientists find ‘lost world’ in billion-year-old Australian rock",
    "Blowing up Ukraine’s dam is a war crime — with a long history",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]