[
    "Al Jazeera, link to home page",
    "Evac­u­a­tions un­der way af­ter Nova Kakhov­ka dam blast",
    "UN chief says dam burst is due to Russia’s invasion of Ukraine",
    "Russia says town of Oleshky is ‘almost completely flooded’",
    "Kyiv will build new power plant on destroyed dam site: Ukraine’s energy company",
    "Finland to expel nine people working at the Russian embassy",
    "All to know about Ukraine’s Nova Kakhovka dam explosion",
    "Beirut’s Sursock Museum reopens three years after port blast",
    "New trials show increased survival rates for a range of cancers",
    "PGA Tour and Saudi-backed rival LIV Golf announce shock merger",
    "What does Erdogan’s re-election mean for Turkey-Gulf relations?",
    "Old is gold: Can ageing spark a surprise economic boom?",
    "Uighur siblings in India jail since 2013 face deportation threat",
    "US, UK push against child abuse online alarms Asia dissidents",
    "‘Dead zone’: how the Ukraine war moved inside Russia",
    "Why are Arab nations cosying up to Syria’s al-Assad? | Start Here",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Kazakhstan is a bridge between the North, South, East and WestquotesOpinion bySerik Zhumangarin",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "Sanctions on Russia may not be working, we now know whyquotesOpinion byBerit Lindeman",
    "Brazil’s Lula is right on global politics and wrong on UkrainequotesOpinion byBruno Cava",
    "Evacuations under way after Nova Kakhovka dam blast",
    "Russia faces a new neighbourhood threat: China",
    "Ukraine, Russia trade blame for destruction of Nova Kakhovka dam",
    "‘Wild fantasies’: Wagner boss tears into Russian success claims",
    "Dozens of bodies remain unclaimed days after India rail disaster",
    "Fattah: Iran unveils its first hypersonic missile",
    "Living the ‘Chinese Dream’: Beijing’s new world order",
    "The Middle East: Goodbye America, hello China?",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]