[
    "Al Jazeera, link to home page",
    "Ukraine, Rus­sia ac­cuse each oth­er of blow­ing up a ma­jor dam",
    "Russian-installed officials plan to evacuate three districts after dam breach",
    "Ukraine accuses Russia of ‘ecocide’",
    "Ukraine says at least 150 tons of motor oil has been released into the Dnipro River",
    "‘Dead zone’: How the Ukraine war moved inside Russia",
    "What does Erdogan’s re-election mean for Turkey-Gulf relations?",
    "Old is gold: Can ageing spark a surprise economic boom?",
    "Uighur siblings in India jail since 2013 face deportation threat",
    "US, UK push against child abuse online alarms Asia dissidents",
    "‘Dead zone’: how the Ukraine war moved inside Russia",
    "Living the ‘Chinese Dream’: Beijing’s new world order",
    "Australian soldier Ben Roberts-Smith ‘complicit in murder’: Judge",
    "Kuwait votes in parliamentary polls in hopes of ending deadlock",
    "Pakistan PM hopeful of IMF deal this month amid escalating crisis",
    "Kazakhstan is a bridge between the North, South, East and WestquotesOpinion bySerik Zhumangarin",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "Sanctions on Russia may not be working, we now know whyquotesOpinion byBerit Lindeman",
    "Brazil’s Lula is right on global politics and wrong on UkrainequotesOpinion byBruno Cava",
    "‘So trapped’: A young Iraqi dri­ver’s cost­ly taxi to nowhere",
    "Could AI car­ry out coups next un­less stopped now?",
    "The ac­tivists con­fronting pe­ri­od taboos in Pak­istan",
    "The Alep­po elec­tron­ic artists us­ing mu­sic to heal in Gaziantep",
    "Recre­at­ing a Pales­tin­ian vil­lage 75 years af­ter the Nak­ba",
    "Ukraine, Russia accuse each other of blowing up a major dam",
    "‘Wild fantasies’: Wagner boss tears into Russian success claims",
    "Ukraine says Russian forces blew up Nova Kakhovka dam in Kherson",
    "Russia faces a new neighbourhood threat: China",
    "Fattah: Iran unveils its first hypersonic missile",
    "Zelenskyy lauds Ukraine advance amid counteroffensive speculation",
    "Sanctions on Russia may not be working, we now know why",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]