[
    "Al Jazeera, link to home page",
    "Three killed in Ode­sa as Rus­sia-Ukraine war in­ten­si­fies",
    "UK intelligence: uptick in Russian tactical combat air sorties in the last two weeks",
    "Areas to watch out for in Ukraine’s counteroffensive",
    "Medvedev says Moscow has free hand to destroy undersea communications cables",
    "Russian missile attack on Odesa kills three civilians: Ukraine",
    "Will the Lebanese parliament manage to elect a president today?",
    "Defiant Trump outlines potential defences against federal charges",
    "Here are the key takeaways from UN report on forced displacement",
    "Israeli forces face no charges over death of Palestinian-American",
    "Nine killed as ethnic violence continues to grip India’s Manipur",
    "China targets ‘unity in thought’ with campaign on Xi’s philosophy",
    "Police say about 100 killed after boat capsizes in Nigeria",
    "Germany returns remains of Indigenous people to New Zealand",
    "Israel missiles target Damascus in latest attack on Syria: Media",
    "Trump pleads not guilty at fed­er­al ar­raign­ment in Flori­da",
    "Trump’s ar­raign­ment: The scene out­side the Mi­a­mi cour­t­house",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Three killed in Odesa as Russia-Ukraine war intensifies",
    "Top Russian officer reported killed in Ukraine counteroffensive",
    "Putin claims Ukraine suffered ‘catastrophic losses’ in offensive",
    "Russia-Ukraine war: List of key events, day 476",
    "Ukraine latest updates: Putin tells West to stop arming Ukraine",
    "Ukraine’s counteroffensive begins: What do we know so far?",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]