[
    "Al Jazeera, link to home page",
    "Ukraine of­fi­cial says Russ­ian shelling kills six in Ly­man town",
    "Spain says cluster bombs should not be sent to Ukraine",
    "European Commission chief vows support on 500th day of Ukraine war",
    "UK says Russia lacks reserves for Bakhmut fight",
    "Russia seeks UN Security Council meeting on Nord Stream blasts",
    "500 days of war in Ukraine: At what cost?",
    "Paris memorial march banned as fresh protests planned in France",
    "Thousands march in Bosnia to mark 1995 Srebrenica genocide",
    "Dutch gov’t falls over failure to agree on asylum seeker policy",
    "Ukraine ‘deserves’ NATO membership, Turkey’s Erdogan says",
    "UN chief refuses to retract condemnation of Israel’s Jenin raid",
    "Iran publicly executes two over deadly Shiraz shrine attack",
    "At least 11 killed in local polls in India’s West Bengal: Reports",
    "Syrian refugee sworn in as mayor of German town",
    "His­to­ry Il­lus­trat­ed: The Jenin refugee camp sto­ry",
    "Is­raeli forces kill three Pales­tini­ans in Nablus, Ra­mal­lah",
    "Is Is­rael’s at­tack on Jenin a war crime?",
    "Video Duration 27 minutes 30 seconds 27:30",
    "Did Is­rael achieve its mil­i­tary goals in Jenin?",
    "‘Dis­as­ter’: Pales­tin­ian homes used as Is­raeli bases in Jenin",
    "Why the Western media lied about Israel’s Jenin siegequotesOpinion byAndrew Mitrovica",
    "Towards a Chinese missile crisis?quotesOpinion byBelén Fernández",
    "The US doesn’t need age limits – it needs term limitsquotesOpinion byChristopher Rhodes",
    "I thought fossil fuel firms could change. I was wrongquotesOpinion byChristiana Figueres",
    "Lessons from DRC: Africa should not reward Russian expansionismquotesOpinion byTafi Mhaka",
    "Believe it or not, justice will prevail in PalestinequotesOpinion byRami G Khouri",
    "Ukraine official says Russian shelling kills six in Lyman town",
    "Syria cracked down on Wagner after mutiny in Russia: Report",
    "Russia-Ukraine war: List of key events, day 500",
    "Why the Western media lied about Israel’s Jenin siege",
    "Afghan interpreter who fled the Taliban killed in US gun violence",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]