[
    "Al Jazeera, link to home page",
    "‘Kyiv’s bar­bar­ic act’: Putin blames Ukraine for dam col­lapse",
    "Kakhovka dam destruction will affect locating mines: Red Cross",
    "China-Russia trade highest since Moscow’s war on Ukraine",
    "China ‘deeply concerned’ over dam destruction’s impact",
    "Destruction of Kakhovka dam ‘environmental catastrophe’: Ukraine PM",
    "Nova Kakhovka dam blast: Is Russia trying to freeze the war?",
    "Iran has a hypersonic missile. What does that mean?",
    "Tear gas, water cannon fired on protesting Sri Lankan students",
    "‘It’s a nightmare’: Kherson locals on the Kakhovka dam blast",
    "Germany prepares to host biggest NATO air deployment exercise",
    "CNN’s embattled CEO Chris Licht is out",
    "US elections 2024: Who is Republican challenger Mike Pence?",
    "Before and after: Satellite images show Kakhovka dam destruction",
    "What does the shock PGA Tour-LIV merger mean for golf?",
    "Photos: Iraq’s Christians fight to save ancient language",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "The Middle East: Goodbye America, hello China?quotesOpinion byMarwan Bishara",
    "Kazakhstan is a bridge between the North, South, East and WestquotesOpinion bySerik Zhumangarin",
    "Russia faces a new neighbourhood threat: ChinaquotesOpinion byBradley Jardine",
    "‘Kyiv’s barbaric act’: Putin blames Ukraine for dam collapse",
    "Russia faces a new neighbourhood threat: China",
    "Ukraine ramps up operations as dam destruction blame game unfolds",
    "Malaysia hails ‘victory’ in row with Sulu sultan’s Filipino heirs",
    "The Middle East: Goodbye America, hello China?",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]