[
    "Al Jazeera, link to home page",
    "Ukraine’s Zelenskyy brings home Azovstal commanders from Turkey",
    "Ukraine ‘deserves’ NATO membership, Turkey’s Erdogan says",
    "US to give Ukraine widely banned cluster munitions despite fears",
    "500 days of war in Ukraine: At what cost?",
    "Yellen sees progress in US-China ties at end of Beijing visit",
    "Nauru prepares to mine deep seas in big climate controversy",
    "Russia-Ukraine war: List of key events, day 501",
    "Air raid kills at least 22 in Sudan’s city of Omdurman",
    "What makes South Asia so vulnerable to climate change?",
    "Uzbekistan presidential election: No choice amid apathy and heat",
    "EU envoy blasts Israel over deadly Jenin raid",
    "Thousands defy bans in France to rally against police violence",
    "His­to­ry Il­lus­trat­ed: The Jenin refugee camp sto­ry",
    "Is­raeli forces kill three Pales­tini­ans in Nablus, Ra­mal­lah",
    "Is Is­rael’s at­tack on Jenin a war crime?",
    "Video Duration 27 minutes 30 seconds 27:30",
    "Did Is­rael achieve its mil­i­tary goals in Jenin?",
    "‘Dis­as­ter’: Pales­tin­ian homes used as Is­raeli bases in Jenin",
    "The road to climate stability runs through us, not SCOTUSquotesOpinion byEmily Nyrop",
    "Windfall oil revenue is buying illusory stability in IraqquotesOpinion byKamaran Palani",
    "Why the Western media lied about Israel’s Jenin siegequotesOpinion byAndrew Mitrovica",
    "Towards a Chinese missile crisis?quotesOpinion byBelén Fernández",
    "The US doesn’t need age limits – it needs term limitsquotesOpinion byChristopher Rhodes",
    "I thought fossil fuel firms could change. I was wrongquotesOpinion byChristiana Figueres",
    "Syria cracked down on Wagner after mutiny in Russia: Report",
    "Ukraine official says Russian shelling kills eight in Lyman town",
    "Why the Western media lied about Israel’s Jenin siege",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]