[
    "Al Jazeera, link to home page",
    "Pales­tini­ans fire bar­rage of rock­ets af­ter Is­rael bombs Gaza",
    "Pakistan army warns protesters of retaliation if targeted again",
    "What happens if the US defaults on its debt?",
    "Women face political barriers ahead of Turkey elections",
    "US unveils rule that rights groups say stifles access to asylum",
    "Ukraine’s occupied nuclear plant faces possible staffing crunch",
    "‘Another provocation!’: Georgia balks as Russia ends visa regime",
    "‘Unforgettable journey’: Busquets to leave Barca after 18 years",
    "Could Greece and Turkey reconcile after elections?",
    "First baby born using DNA from three people: UK",
    "Turkey elec­tion: A guide to Er­do­gan’s biggest test at the polls",
    "‘Own­ing a home a dream’: Hous­ing cri­sis hits Turks ahead of polls",
    "Women face po­lit­i­cal bar­ri­ers ahead of Turkey elec­tions",
    "Turk­ish elec­tions, West­ern il­lu­sions",
    "Why the Turk­ish elec­tions are a big test for Er­doğan | Start Here",
    "Video Duration 13 minutes 09 seconds 13:09",
    "Sudan can turn this crisis into an opportunityquotesOpinion byMagdi A Mofadal",
    "To achieve peace, both Ukraine and Russia must feel securequotesOpinion byJoergen Moeller",
    "Why are Indian cities a mess? Because they’re not about peoplequotesOpinion bySomdeep Sen",
    "This Victory Day, Putin has no victory to celebratequotesOpinion byMaximilian Hess",
    "Turkish elections, Western illusionsquotesOpinion byMarwan Bishara",
    "It’s psychological warfare season on the US borderquotesOpinion byBelén Fernández",
    "Palestinians fire barrage of rockets after Israel bombs Gaza",
    "Russian troops abandon positions near Bakhmut, says Wagner boss",
    "How the world reacted to Imran Khan’s arrest in Pakistan",
    "This Victory Day, Putin has no victory to celebrate",
    "Iran hangs ‘sultan of cocaine’ as UN warns of rising executions",
    "To achieve peace, both Ukraine and Russia must feel secure",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]