[
    "Al Jazeera, link to home page",
    "Don­ald Trump pleads not guilty to fed­er­al charges in Mi­a­mi court",
    "Trump aide Nauta to be arraigned on June 27",
    "At cafe, Trump invokes familiar themes",
    "Trump defenders focusing on politics, not law: Legal analyst",
    "Putin claims Ukraine suffered ‘catastrophic losses’ in offensive",
    "Police say about 100 killed after boat capsizes in Nigeria",
    "‘If we came second, we got nothing’: Berlusconi’s football legacy",
    "Trump’s arraignment: The scene outside the Miami courthouse",
    "Israeli army kills Palestinian in occupied West Bank raid",
    "Acclaimed US novelist Cormac McCarthy dies at 89",
    "Sprinter Tori Bowie died from childbirth complications: Autopsy",
    "Migrant death toll nearly 3,800 for Middle East, North Africa: UN",
    "US lawmaker group wants S Africa punished over Russia ties",
    "Trump’s ar­raign­ment: The scene out­side the Mi­a­mi cour­t­house",
    "Trump’s ar­raign­ment: A sim­ple guide to his­toric court ap­pear­ance",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "AI must not become a driver of human rights abusesquotesOpinion byEliza Campbell",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Ukraine latest updates: Putin tells West to stop arming Ukraine",
    "Donald Trump pleads not guilty to federal charges in Miami court",
    "Ukraine’s counteroffensive begins: What do we know so far?",
    "Read the full text of the Donald Trump indictment",
    "Donald Trump is doomed. Finally",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]