[
    "Al Jazeera, link to home page",
    "UN’s Guter­res wel­comes Black Sea grain deal ex­ten­sion",
    "More than 30.2 million tonnes of grain transported through Black Sea grain corridor",
    "UN chief says issues remain after Black Sea grain deal renewed",
    "Extension of the Black Sea grain deal ‘is fragile’: AJ Correspondent",
    "Ukraine tells Chinese envoy it would not cede its territories to end the war with Russia",
    "Global warming likely to breach 1.5C threshold for first time",
    "Russia agrees to renew Ukraine Black Sea grain deal for 60 days",
    "Kilicdaroglu turns to anti-migrant fears before Turkey run-off",
    "Is ‘shareholder supremacy’ driving the layoffs in tech?",
    "Turkey slams Charlie Hebdo’s cover of electrocuted Erdogan in tub",
    "Tunisia: Dozens of academics call for Ghannouchi’s release",
    "Is India projecting ‘normalcy’ in Kashmir by holding G20 meeting?",
    "At least eight dead in north Italy floods; Grand Prix postponed",
    "Prince Harry, Meghan followed by photographers in car chase",
    "Freez­ing the RSF’s bank as­sets won’t stop it in Su­dan: An­a­lysts",
    "Women speak out about sex­u­al vi­o­lence in Su­dan fight­ing",
    "Flee­ing Su­dan: ‘I had to do it for my daugh­ter’",
    "Su­dan: To break the cy­cle of vi­o­lence, end the klep­toc­ra­cy",
    "Su­dan fight­ing: One month on and no so­lu­tion in sight",
    "LIVE: Man­ches­ter City vs Real Madrid – Cham­pi­ons League build-up",
    "Rudiger makes way for the returning Militao",
    "Camavinga’s growing impact",
    "Fans arriving at the Etihad",
    "UN’s Guterres welcomes Black Sea grain deal extension",
    "Patriot missile system in Ukraine likely ‘damaged’: Report",
    "US releases nuclear warhead data in bid to pressure Russia",
    "Pakistan official gives Khan 24 hours to hand over riot suspects",
    "Russia-Ukraine war: List of key events, day 448",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]