[
    "Al Jazeera, link to home page",
    "Ukraine says it downed Russ­ian cruise mis­siles, drones",
    "Russia reports heavy fighting in Zaporizhia region of Ukraine",
    "One killed in latest Russian air attack on Ukraine: Kyiv",
    "Ukraine counteroffensive against Russia under way: Think tank",
    "Dutch to send rescue boats, water pumps to Ukraine",
    "Malaysia will ‘not survive’ if it does not change: Anwar Ibrahim",
    "Ukraine counteroffensive against Russia under way: think tank",
    "Thailand’s cannabis lovers face comedown amid legalisation U-turn",
    "Rohingya in Bangladesh protest to be sent home after UN aid cut",
    "Sudan declares UN envoy Volker Perthes ‘persona non grata’",
    "El Nino under way, raising fears of extreme weather patterns",
    "Hong Kong refuses to clarify law as uncertainty dims business hub",
    "Crypto giant Binance’s US arm suspends dollar deposits",
    "Trump says he faces indictment in classified document case",
    "How much plas­tic is in our oceans?",
    "Donald Trump is doomed. FinallyquotesOpinion byAndrew Mitrovica",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "Ukraine says it downed Russian cruise missiles, drones",
    "Russian man killed in shark attack off Egypt’s Red Sea resort",
    "Donald Trump is doomed. Finally",
    "‘Poor people don’t have friends’: A Pakistani widow’s life",
    "Russia-Ukraine war: List of key events, day 471",
    "China’s backlash against Little Mermaid exposes Hollywood bind",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]