[
    "Al Jazeera, link to home page",
    "‘Impressive victory’ as Thai opposition cruses military parties",
    "What you need to know about Thailand’s parliament election",
    "Youth party galvanises Thai voters with promises of royal reforms",
    "Thailand’s political parties make final pitch to voters",
    "Runoff likely as Erdogan’s share of votes falls below 50%",
    "France promises more tanks, armoured vehicles for Ukraine",
    "How did Modi lose Karnataka — and could he lose India?",
    "Three dead as cyclone Mocha hits Myanmar, Bangladesh",
    "Russia-Ukraine war: List of key events, day 446",
    "Turkey parties squabble as crucial vote count seesaws",
    "Gaza ceasefire largely holds, despite rocket fire ‘in error’",
    "Imran Khan calls for street protests as Pakistan crisis deepens",
    "Turkey election vote tracker: Follow live results",
    "Turkey elec­tion vote track­er: Fol­low live re­sults",
    "Polling sta­tions in Turkey close af­ter mo­men­tous elec­tion",
    "Turkey elec­tion: Your guide to how the elec­toral sys­tem works",
    "Er­do­gan: The man who has dom­i­nat­ed Turk­ish pol­i­tics for 20 years",
    "Kil­ic­daroglu: The chal­lenger who could un­seat Er­do­gan",
    "Youth par­ty gal­vanis­es Thai vot­ers with promis­es of roy­al re­forms",
    "Thai­land elec­tion: Who could be­come the next prime min­is­ter?",
    "In Thai­land’s north, op­po­si­tion vies for votes in skewed sys­tem",
    "Thai­land’s po­lit­i­cal par­ties make fi­nal pitch to vot­ers",
    "Myan­mar’s de­mo­c­ra­t­ic strug­gle at stake in Thai­land’s elec­tion",
    "The forever war on Julian AssangequotesOpinion byBelén Fernández",
    "The Arab world has forsaken the Palestine causequotesOpinion byImad K Harb",
    "Israel denies the Nakba while perpetuating itquotesOpinion byNeve Gordon",
    "Ethiopia needs an all-inclusive peace process led by womenquotesOpinion byFilsan Abdi",
    "Sudanese refugees deserve as much help as UkrainiansquotesOpinion byTafi Mhaka",
    "Healing from the trauma of childhood sexual violence is possiblequotesOpinion byTabitha Mpamira",
    "How a Turk­ish fam­i­ly of eight man­ages soar­ing food costs",
    "A David vs Go­liath bat­tle un­fold­ing in the dat­ing app in­dus­try",
    "Prayer for rain, wa­ter ra­tions: Cat­alo­nia strug­gles with drought",
    "‘Nor­mal­i­sa­tion of vi­o­lence’: What led to Ser­bia mass shoot­ings?",
    "What does the British monar­chy mean to you?",
    "‘We’re going to America’: Border hope and fear as Title 42 ends",
    "South Africa to investigate gold mafia uncovered by Al Jazeera",
    "Su­dan talks to re­sume in Sau­di Ara­bia as bat­tles rage in Khar­toum",
    "Clouds gath­er over South Su­dan as bat­tles rage next door",
    "Fam­i­lies, friends search for the miss­ing as Su­dan fight­ing rages",
    "Tu­ber­cu­lo­sis rates rock­et amid Ukraine, Su­dan con­flicts",
    "Su­dan doc­tors tar­get­ed with threats and smear cam­paigns",
    "Israeli demolition of Palestinian Bedouin homes spike in Naqab",
    "Prominent Sudanese singer Shaden Gardood killed in crossfire",
    "Charred bod­ies, burned homes: A ‘cam­paign of ter­ror’ in Myan­mar",
    "Germany’s Scholz vows to support Ukraine ‘as long as needed’",
    "Government sells 9.5% of state-controlled Telecom Egypt",
    "Polling stations in Turkey close after momentous election",
    "PUK returns to Kurdish Regional Government meetings after boycott",
    "Six lions killed by herders in blow to Kenya’s conservation push",
    "Islamic Jihad says Gaza truce agreed with Israel: Officials",
    "Nepali Sherpa becomes second person to scale Everest 26 times",
    "Germany pledges almost $3bn in new military aid to Ukraine",
    "Art, Surveillance & Investigation: Trevor Paglen & Eyal Weizman",
    "Sweden’s Loreen wins Eurovision with Ukraine symbolism on show",
    "Iran summons Iraq envoy to protest presence of ‘terrorist groups’",
    "Reports of 4 Russian military aircraft downed near Ukraine border",
    "Turkey to vote in key election, Erdogan faces toughest test yet",
    "Modi’s ruling BJP voted out in key Indian state of Karnataka",
    "Families, friends search for the missing as Sudan fighting rages",
    "Russia-Ukraine war: List of key events, day 445",
    "‘Moving forward’: Ukraine claims gains on Bakhmut front",
    "Turkey’s Erdogan, Kilicdaroglu end campaigning before election",
    "Erdogan: The man who has dominated Turkish politics for 20 years",
    "Kilicdaroglu: The challenger who could unseat Erdogan",
    "‘This is the culture’: The Indian wrestlers fighting sexual abuse",
    "Syria extends permission on post-quake aid border crossings",
    "Kenya starvation cult death toll climbs to 201",
    "Ukraine used British missiles to attack Luhansk: Moscow",
    "Sudan talks to resume in Saudi Arabia as battles rage in Khartoum",
    "What’s being done to help the people of Haiti?",
    "Pakistan ex-PM Imran Khan returns home after arrest saga",
    "Two killed in West Bank as Gaza attacked by Israel for 5th day",
    "‘What now?’: Scenes from the US-Mexico border",
    "More than a dozen dead in Balochistan attack in Pakistan",
    "Thousands evacuated as Cyclone Mocha nears Myanmar, Bangladesh",
    "Russian troops ‘fall back to regroup’ north of Ukraine’s Bakhmut",
    "How Cuba’s sugar industry has been ground into dust",
    "Russia-Ukraine war: List of key events, day 444",
    "Could AI disrupt economies or transform them?",
    "As Title 42 ends in US, asylum seekers wait for relief on border",
    "Turkey’s opposition opens up to the hijab",
    "Doha photo exhibition sheds light on life of Rohingya refugees",
    "Turkey election 2023 updates: Voting ends in tight race",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]