[
    "Al Jazeera, link to home page",
    "Ukraine says 10 killed in Russ­ian at­tack on Kryvyi Rih",
    "Wagner chief ‘unsure’ if his troops will remain in Ukraine",
    "Listen: What to expect from Ukraine’s counteroffensive",
    "One killed in Russian shelling of Ukraine’s Bilozerka: Zelenskyy aide",
    "Belarus to get Russian tactical nuclear weapons in ‘several days’: TASS",
    "Trump’s arraignment: What to expect at court appearance in Miami",
    "Three people found dead in UK city: Police",
    "Djokovic raises bar to 23 slams: Is he the greatest of all time?",
    "UN chief backs proposal to create watchdog to monitor AI",
    "India and Nigeria threatened to shut down Twitter, founder says",
    "At least nine people injured in Denver shooting",
    "Fate of jailed fighters still unknown months after Ethiopia truce",
    "Cyclone Biparjoy to hit India, Pakistan: What we know so far",
    "How common is albinism and what gene causes it?",
    "Cau­tious calm pre­vails around US court where Trump will ap­pear",
    "Trump’s ar­raign­ment: What to ex­pect at court ap­pear­ance in Mi­a­mi",
    "Don­ald Trump is doomed. Fi­nal­ly",
    "Read the full text of the Don­ald Trump in­dict­ment",
    "Five things to ex­pect from Trump’s ap­pear­ance in Flori­da court",
    "The case for bottom-up AIquotesOpinion byJovan Kurbalija",
    "Southern Iraq’s toxic skies are a colonial legacyquotesOpinion byTaif Alkhudary",
    "The West has lost the plot in the BalkansquotesOpinion byJasmin Mujanović",
    "Germany’s anti-Palestinianism is escalatingquotesOpinion byMajed Abusalama",
    "Why are most US historians against Critical Race Theory?quotesOpinion byDonald Earl Collins",
    "Artificial intelligence without bordersquotesOpinion byBelén Fernández",
    "Ukraine says 10 killed in Russian attack on Kryvyi Rih",
    "NATO’s largest air force drill prepares for ‘crisis situation’",
    "‘Extraordinarily difficult operation’: All eyes on Ukraine attack",
    "Russia-Ukraine war: List of key events, day 475",
    "‘Massive’ Russian missile attack on Ukraine’s Kryvyi Rih city",
    "China spinning a ‘web’ of influence campaigns to win over Taiwan",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]