[
    "Al Jazeera, link to home page",
    "Ukraine and Russia trade places in battle for Bakhmut",
    "Satellite images show scale of destruction in Ukraine’s Bakhmut",
    "Ukraine courts ‘Global South’ in push to challenge Russia",
    "Brazen raids into Russia aim to stretch forces thin: Analysts",
    "DeSantis launches US presidential bid in glitch-filled broadcast",
    "Ex-PM Khan’s PTI jolted by more resignations",
    "‘Simply the best’: Singer Tina Turner dies at 83",
    "Chinese Indonesians reflect on life 25 years from Soeharto’s fall",
    "Tasered 95-year-old great-grandmother dies in Australia",
    "NGO in ‘race against time’ to rescue 500 onboard boat in distress",
    "‘Incalculable loss’: Oakland battles to save last pro sports team",
    "Four Filipinas sue diplomat employers in Switzerland for slavery",
    "US elections 2024: Who is the Republican contender Ron DeSantis?",
    "How will Turkey’s pres­i­den­tial run-off shape the econ­o­my?",
    "Video Duration 25 minutes 15 seconds 25:15",
    "Five ways Kil­ic­daroglu will try to beat Er­do­gan in Turkey run-off",
    "Er­do­gan’s me­dia dom­i­na­tion and the vote in Turkey",
    "Video Duration 24 minutes 25 seconds 24:25",
    "Ogan en­dors­es Er­do­gan in Turkey’s pres­i­den­tial run-off",
    "Turkey’s Kil­ic­daroglu promis­es to kick out refugees post-elec­tion",
    "How Russia tried to colonise Africa and failedquotesOpinion byOleksandr Polianichev",
    "Why is the African Union absent in Sudan?quotesOpinion byTafi Mhaka",
    "AI won’t replace teachers — but a classroom revolution is comingquotesOpinion byMomo Bertrand",
    "Not your grandfather’s cold warquotesOpinion byRabah Arezki",
    "Welcome back, Salman RushdiequotesOpinion byAndrew Mitrovica",
    "Why Europe needs Roma to drive its economyquotesOpinion byCiprian Necula",
    "Ukraine updates: ‘20,000’ Wagner fighters killed in Bakhmut",
    "France bans short-haul flights in effort to fight climate change",
    "Russia says Su-27 jet sent to prevent US planes violating border",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]