[
    "Al Jazeera, link to home page",
    "In­ter­cept­ed call proves Rus­sia was be­hind dam blast: Ukraine",
    "Greta Thunberg accuses Russia of ecocide after dam collapse",
    "Ukraine will not be providing commentary on offensive: AJ Correspondent",
    "Ukraine’s GDP falls by 10.5 percent",
    "‘The situation is tense in all areas of the front’: Ukraine",
    "Malaysia will ‘not survive’ if it does not change: Anwar Ibrahim",
    "Ukraine counteroffensive against Russia under way: think tank",
    "Are Canada’s wildfires under control? Here’s what to know",
    "France’s Macron visits victims of Alps knife attack in hospital",
    "Crisis-hit Pakistan set to present budget as IMF watches",
    "Palestinian president to visit China after mediation offer",
    "In Russia-occupied Kherson, flood aid slow to come: Residents",
    "Rohingya in Bangladesh protest to be sent home after UN aid cut",
    "Sudan declares UN envoy Volker Perthes ‘persona non grata’",
    "Why I’m strik­ing: UK roads union rep fights back against pay cuts",
    "Donald Trump is doomed. FinallyquotesOpinion byAndrew Mitrovica",
    "South Africa is failing, and it’s failing Zimbabwe, tooquotesOpinion byTafi Mhaka",
    "Blowing up Ukraine’s dam is a war crime — with a long historyquotesOpinion byAlexander Gillespie",
    "(Mis)understanding and (mis)managing the Sudanese crisisquotesOpinion byAbdelwahab El-Affendi",
    "Europe’s technocracy is killing its global dreamsquotesOpinion byKaterina Kolozova",
    "Canadian democracy is on edge — and China isn’t to blamequotesOpinion byAndrew Mitrovica",
    "Intercepted call proves Russia was behind dam blast: Ukraine",
    "Donald Trump is doomed. Finally",
    "Russian man killed in shark attack off Egypt’s Red Sea resort",
    "‘Poor people don’t have friends’: A Pakistani widow’s life",
    "China’s backlash against Little Mermaid exposes Hollywood bind",
    "Thailand’s cannabis lovers face comedown amid legalisation U-turn",
    "Messi’s move to Inter Miami sparks huge fan reaction",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]