[
    "Al Jazeera, link to home page",
    "Is­raeli strikes on Gaza kill 27 as its of­fen­sive en­ters third day",
    "Israel keeps Gaza crossings closed, denying patients medical attention",
    "US reiterates its ‘ironclad support for Israel’",
    "Israeli air raid in southern Gaza Strip kills Islamic Jihad commander",
    "As tensions flare in Gaza, Egyptian mediation efforts continue",
    "Pakistan top court orders immediate release of ex-PM Imran Khan",
    "Shireen Abu Akleh, Al Jazeera Reporter and Daughter of Palestine",
    "Days ahead of vote, Ince withdraws from Turkey presidential race",
    "UK sends Ukraine long-range cruise missiles to fight Russia",
    "Title 42 is about to expire in US. Here’s what you need to know",
    "UK raises interest rates to highest level since 2008",
    "EU details violations at Greece’s ‘model’ refugee camps",
    "Ukraine strikes back in Bakhmut, as Russia wrangles with Wagner",
    "Israel’s prime target: What is Palestinian Islamic Jihad?",
    "Al Jazeera re­news pledge to seek jus­tice for Shireen Abu Ak­leh",
    "Shireen Abu Ak­leh killing: Ad­vo­cates de­cry ‘ab­hor­rent’ US stance",
    "Shireen Abu Ak­leh’s for­got­ten mur­der",
    "One year on, no jus­tice at ICC for Shireen Abu Ak­leh",
    "Time­line: How US stance shift­ed on killing of Shireen Abu Ak­leh",
    "Healing from the trauma of childhood sexual violence is possiblequotesOpinion byTabitha Mpamira",
    "Shireen Abu Akleh’s forgotten murderquotesOpinion byAndrew Mitrovica",
    "Imran Khan’s arrest has exploded Pakistan’s reservoir of ragequotesOpinion byZarrar Khuhro",
    "Sudan can turn this crisis into an opportunityquotesOpinion byMagdi A Mofadal",
    "To achieve peace, both Ukraine and Russia must feel securequotesOpinion byJoergen Moeller",
    "Why are Indian cities a mess? Because they’re not about peoplequotesOpinion bySomdeep Sen",
    "Israeli strikes on Gaza kill 27 as its offensive enters third day",
    "Trump jokes about sexual assault verdict at CNN town hall event",
    "Imran Khan’s arrest has exploded Pakistan’s reservoir of rage",
    "How a US Supreme Court ruling is transforming gun control",
    "Al Jazeera Investigative Unit",
    "Al Jazeera Centre for Studies",
    "Al Jazeera Media Institute",
    "Al Jazeera Centre for Public Liberties & Human Rights"
]