[
    "More than 280 dead in India train crash",
    "Parents clash in Pride protest at US primary school",
    "Biden says debt deal averted 'economic collapse'",
    "City v United in first all-Manchester FA Cup final",
    "Mystery of a deadly boat accident on an Italian lake",
    "Utah schools ban Bible for 'vulgarity and violence'",
    "Can US spelling bee champs spell British words?",
    "Anger in Belgium over verdict in student's hazing death",
    "The schools where tomorrow’s stars walk the corridors",
    "Mourinho charged for abusive language at official",
    "Djokovic through in Paris with 'long' injury list",
    "11 of the best films to watch in June",
    "The first lab-grown burger: 10 years on",
    "An underrated LGBTQ+ haven in the US",
    "A rare insight into Hitler's private life",
    "Is this the Dutch secret to a healthier, happier life?",
    "How modern life is making men infertile",
    "The generation clocking the most hours",
    "8 ways to make your clothes last longer",
    "The birds ensnared by plastic",
    "Row over jail term for woman who attacked neo-Nazis",
    "Blood test for 50 cancers excites scientists",
    "Why is a top British morning TV show in crisis?",
    "1 Strong job gains in US add to economic puzzle",
    "2 Congress approves debt deal, averting a US default",
    "3 Twitter loses second head of trust under Elon Musk",
    "4 iPhone maker in major India production expansion",
    "5 British Airways fined $1.1m by US government",
    "Why we need more female electricians",
    "Where the sound of nature is too quiet",
    "Lebanon's unexpected solar boom",
    "Sign up for the latest tech news direct to your inbox",
    "The tech tricks that make computer games look real",
    "Do Russians really hate the West?",
    "How ref got caught in fiery Euro final...",
    "How ref got caught in fiery Euro final crossfire... in 60 seconds",
    "Huge sandstorm sweeps across Suez Canal in...",
    "Huge sandstorm sweeps across Suez Canal in Egypt",
    "Alison Hammond breaks down on air about...",
    "Alison Hammond breaks down on air about Schofield",
    "Will Sophie step up from kitchen disco to...",
    "Will Sophie step up from kitchen disco to Eurovision 2024 stage?",
    "Affair my 'biggest, sorriest secret' -...",
    "Affair my 'biggest, sorriest secret' - Phillip Schofield speaks to the BBC",
    "Andrew Tate denies allegations of...",
    "Andrew Tate denies allegations of manipulation",
    "A war crimes case and what's next... in 83...",
    "A war crimes case and what's next... in 83 seconds",
    "Moment climber found in rare Everest ‘death...",
    "Moment climber found in rare Everest ‘death zone’ rescue",
    "Performance, protest and pigs: Photos of the week",
    "Jojo Moyes: 'I've always been a woman's woman'",
    "Are tornadoes in the US getting worse?",
    "Popular Twitch streamer Puppers dies aged 32",
    "Brics ministers call for rebalancing of global order",
    "Argentina eases access to morning-after pill",
    "Beijing's comedy crackdown is hitting its music scene",
    "Five revelations from Nasa's public UFO meeting  By Mike Wendling",
    "Andrew Tate challenged on misogyny in combative BBC interview  By Lucy Williamson",
    "Peas that don't taste like peas could help planet  By Pallab Ghosh",
    "She bought an abandoned US lighthouse. Now you can too  By Chelsea Bailey",
    "AI 'godfather' feels 'lost' over life's work  By Zoe Kleinman",
    "A top soldier's defamation case rocks Australia  By Tiffanie Turnbull",
    "Why Erdogan's victory matters for the West  By Katya Adler",
    "Why prosperity can't break India's dowry curse  By Soutik Biswas",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Long lashes and fashion flair: Africa's top shots",
    "Windrush generations mark 75th anniversary",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "Photographer blends Africa with Welsh communities",
    "روزنامه فایننشال تایمز: رابرت مالی با امیر سعید ایروانی چندین بار دیدار کرده است",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]