[
    "Defiant Trump still headline Republican act despite charges",
    "Russia moves to take direct control of Wagner Group",
    "How 4 children survived 40 days in hostile Colombian jungle",
    "Djokovic wins men's record 23rd major to surpass Nadal",
    "Where tipping can be considered rude",
    "Three dead as Russia shells flood evacuation boat",
    "Migrants stuck in ‘hell’ on UK's middle-of-nowhere military island",
    "Canada wildfire crews try to control the uncontrollable",
    "Rohit wants three-match Test Championship final",
    "Murray lands first grass-court singles title since 2016",
    "'Man City among the greatest sides I have seen'",
    "The nation that is the 'land of song'",
    "Why fish are finding it hard to breathe",
    "Five myths about wildfires",
    "Is this the worst country to be gay?",
    "The 'alien' lifeforms discovered in the deep ocean",
    "How an advanced civilisation vanished 2,500 years ago",
    "The workers quitting digital nomadism",
    "Why are there mountains inside Earth?",
    "11 of the best New York films",
    "Croatia's healthy, uncomplicated lunch",
    "The memes that lay bare China's youth disillusionment",
    "What became of The Full Monty's stripping friends?",
    "'How I became a world champion stone-skimmer'",
    "1 Facebook owner Meta plans to create Twitter rival",
    "2 Reddit communities to go private on Monday",
    "3 Windfall tax to end if energy prices drop",
    "4 Sunak and Biden announce green funding agreement",
    "5 Airline Qantas relaxes gender-based uniform rules",
    "Could hosepipe drones tackle wildfires?",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "India attempts to revive its dwindling rubber industry",
    "'Two of my gay friends have gone missing'",
    "Busy US highway collapses after oil tanker blaze",
    "Busy US highway collapses after oil tanker...",
    "Nicola Sturgeon's arrest - explained in 80...",
    "Nicola Sturgeon's arrest - explained in 80 seconds",
    "Watch: How Colombia children jungle rescue...",
    "Watch: How Colombia children jungle rescue unfolded",
    "Trombonist soldier plays on after fainting",
    "Boris Johnson's political career... in 72...",
    "Boris Johnson's political career... in 72 seconds",
    "Watch: The public no longer believe Johnson -...",
    "Watch: The public no longer believe Johnson - Curtice",
    "Drone footage shows blaze at listed building",
    "Train smashes through truck on railway...",
    "Train smashes through truck on railway crossing",
    "Drone footage shows extent Ukraine dam burst...",
    "Drone footage shows extent Ukraine dam burst flooding",
    "Gladiator 2 crew injured in stunt accident on set",
    "How AI is helping doctors spot breast cancers",
    "US cancer drug shortage hits thousands of patients",
    "The divisive debate over California's anti-caste bill",
    "Mediterranean-style wildfire fighting coming to UK",
    "Surreal skies grip New Yorkers - in pictures",
    "How Riley Keough 'struggled' to get her new film funded",
    "UK heatwave: How does sunscreen work?  By Rachel Schraer",
    "The ghost of Boris Johnson haunts Rishi Sunak  By Chris Mason",
    "'The level of cruelty... it's like Stalin's time'  By Steve Rosenberg",
    "Is this indictment a threat to Trump's 2024 campaign?  By Anthony Zurcher",
    "El Niño planet-warming weather phase has begun  By Matt McGrath",
    "Taurine may extend life and health, scientists find  By James Gallagher",
    "Catching the men who sell subway groping videos  By Zhaoyin Feng, Aliaume Leroy & Shanshan Chen",
    "Smoke from Canada wildfires delays NYC flights  By Chelsea Bailey",
    "Why millions of useable hard drives are being destroyed",
    "The tech tricks that make computer games look real",
    "Mosque plasterers and rock cutters: Africa's top shots",
    "Strawberry Moon captured over England",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "Top Scottish landscape photographers announced",
    "Long lashes and fashion flair: Africa's top shots",
    "مراسم ۱۰ سالگی کیان پیرفلک؛ یک عضو خانواده کیان و یک پلیس کشته شدند",
    "روس سے خام تیل کا پہلا کارگو پاکستان پہنچ گیا",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]