[
    "Erdogan leads as Turkey heads for election run-off",
    "China jails US citizen, 78, for spying",
    "The life of India's gangster-politician killed on live TV",
    "The world's most expensive replacement",
    "The return of London's lost rivers",
    "Sunak tells Russia 'we're not going away' after Zelensky talks",
    "Vice and Motherboard owner files for bankruptcy",
    "Professor breaks record for time living underwater",
    "Premier League reaction as Man City near title, plus Chelsea & Barca glory",
    "Barcelona crowned La Liga champions after derby win",
    "Arteta apologises as title race hopes fade",
    "The surprising truth about the most active generation",
    "The mystery structures of an ancient Atlantic civilisation",
    "The controversial millionaire paying to become 18 again",
    "The surprising power of horror stories",
    "Are pay transparency laws working?",
    "How our genes influence our decisions",
    "India's disappearing Chinese community",
    "How a DNA-first caught a serial killer 30 years on",
    "In Pictures: Stars walk red carpet at TV Baftas",
    "I don't have ADHD, but three private clinics say I do",
    "1 Elon Musk names Linda Yaccarino new Twitter boss",
    "2 Percy Pig ice cream renamed after M&S request",
    "3 AI creator on whether it will make humans 'boring'",
    "4 Scrap tax on sunscreen, say cancer charities",
    "The 1968 photo that changed the world",
    "What 1.5C living actually looks like",
    "The revival of a historic Italian fruit",
    "Should social media face-altering filters be regulated?",
    "How war-torn Ukraine won Eurovision 2022",
    "Watch: Man invades stage during Rees-Mogg speech",
    "Watch: Man invades stage during Rees-Mogg...",
    "Watch: Best bits from the Baftas... in 80...",
    "Watch: Best bits from the Baftas... in 80 seconds",
    "Watch: Telecom tower buckles and falls in...",
    "Watch: Telecom tower buckles and falls in cyclone",
    "Eurovision: The final party in 90 seconds",
    "All the times Eurovision's presenters stole...",
    "All the times Eurovision's presenters stole the show",
    "Watch: Tense moment Eurovision winner is...",
    "Watch: Tense moment Eurovision winner is revealed",
    "Watch: Mel Giedroyc milking her presenting...",
    "Watch: Mel Giedroyc milking her presenting role",
    "Imran Khan's dramatic arrest saga... in under...",
    "Imran Khan's dramatic arrest saga... in under 90 seconds",
    "Can you finish all these Eurovision lyrics?",
    "Claudia and The Traitors win at Bafta TV Awards",
    "UK tech tycoon extradited to US in fraud case",
    "Canada wildfire smoke reaches US",
    "In pictures: Eurovision performances fire up fans",
    "Vernon Kay's says new Radio 2 show 'more the same'",
    "Fears grow for cancer patients trapped in Gaza",
    "YouTuber admits to crashing plane for views",
    "'My grandma died alone in Sudan, now I can't bury her'  By Barbara Plett Usher",
    "Thai vote counting shows ex-PM's daughter in lead  By Jonathan Head",
    "Astronomers detect largest cosmic blast ever seen  By Pallab Ghosh",
    "'Nonsense' - Trump rivals blast town hall performance  By Anthony Zurcher",
    "Hacker market still active after police 'takedown'  By Joe Tidy",
    "Australia government approves first new coal mine  By Tiffanie Turnbull",
    "Why an Indian film on Islamic State is so controversial  By Meryl Sebastian",
    "Panel backs first US over-the-counter birth control  By Sam Cabral",
    "Which European nations are winning the heat pump race?",
    "Sweet firms try to sugar coat price rises",
    "Crowns, protests and a landslide: Photos of the week",
    "Angel wings and chess champs: Africa's top shots",
    "The Coronation concert and street parties in pictures",
    "Must see pictures from the King's Coronation",
    "In pictures: Royal superfans camp out ahead of Coronation",
    "Tổng thống Ukraine bất ngờ thăm Anh vào 'thời điểm quan trọng'",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]