[
    "Russia says it thwarted major Ukrainian offensive",
    "Signal fault likely cause of rail crash - India minister",
    "War with US would be unbearable disaster - China minister",
    "The long quest for personalised drugs",
    "Will a four-day week get workers back?",
    "The mums and babies heading home to the front line",
    "'I pray that we find him': Desperate hunt for the missing",
    "Why is Prince Harry suing the Mirror Group?",
    "Spurs expected to open talks with Celtic's Postecoglou",
    "Ibrahimovic retires from football at 41",
    "England spinner Leach ruled out of Ashes",
    "Esports helps F1 to find stars of the future",
    "Popular Twitch streamer Puppers dies aged 32",
    "AI 'godfather' feels 'lost' over life's work",
    "Is this the spectacular tomb of king Minos?",
    "Inside the world’s biggest 'mirror' solar plant",
    "Is this the Dutch secret to a healthier, happier life?",
    "Japan's ultimate lesson in gratitude",
    "The generation clocking the most hours",
    "Sex, violence and sparkling one-liners",
    "The birds ensnared by plastic",
    "How many Russians have left during war - and who are they?",
    "Dua Lipa: 'I've been the new girl all my life'",
    "Solar panels - an eco-disaster waiting to happen?",
    "1 Oil prices rise as Saudi Arabia pledges output cut",
    "2 Strong job gains in US add to economic puzzle",
    "3 Congress approves debt deal, averting a US default",
    "4 Twitter loses second head of trust under Elon Musk",
    "5 iPhone maker in major India production expansion",
    "The first lab-grown burger: 10 years on",
    "Why we need more female electricians",
    "Where the sound of nature is too quiet",
    "Sign up for the latest tech news direct to your inbox",
    "The tech tricks that make computer games look real",
    "Wreckage cleared from tracks after India train crash",
    "Wreckage cleared from tracks after India...",
    "Why Brian Cox hasn't watched the Succession...",
    "Why Brian Cox hasn't watched the Succession finale",
    "'Chaos' outside hospital after India train...",
    "'Chaos' outside hospital after India train crash",
    "Uganda's Ghetto Kids seek glory in UK talent...",
    "Uganda's Ghetto Kids seek glory in UK talent show",
    "Protester dragged from track at Epsom Derby",
    "Drone shows extent of India train crash...",
    "Drone shows extent of India train crash destruction",
    "Eyewitnesses describe pain and agony of India...",
    "Eyewitnesses describe pain and agony of India train crash",
    "Do Russians really hate the West?",
    "Your pictures on the theme of 'bridges'",
    "Love Island: Is the reality series past its prime?",
    "Blood test for 50 cancers excites scientists",
    "British Airways fined $1.1m by US government",
    "US Air Force denies AI drone attacked operator",
    "Stormzy at Hay: 'Black people are not monolithic'",
    "How is my country doing tackling climate change?",
    "How the Pakistani military feel about Imran Khan  By Farhat Javed",
    "Putin - South Africa's big headache  By Andrew Harding",
    "Five revelations from Nasa's public UFO meeting  By Mike Wendling",
    "Andrew Tate challenged on misogyny in combative BBC interview  By Lucy Williamson",
    "Peas that don't taste like peas could help planet  By Pallab Ghosh",
    "She bought an abandoned US lighthouse. Now you can too  By Chelsea Bailey",
    "A top soldier's defamation case rocks Australia  By Tiffanie Turnbull",
    "Why Erdogan's victory matters for the West  By Katya Adler",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Performance, protest and pigs: Photos of the week",
    "Long lashes and fashion flair: Africa's top shots",
    "Windrush generations mark 75th anniversary",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "انتقال تجهیزات سنگین نظامی به مرز با عراق؛ «احزاب کرد ایرانی در اقلیم محدود شده‌اند‌»",
    "Mi viaje al “lugar más peligroso del mundo”, la ciudad de los sueños de mi madre",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]