[
    "Professional soldiers to petty thieves - the changing face of Russia's dead",
    "Kyiv under attack as African leaders visit on peace mission",
    "Canada highway crash leaves at least 15 dead",
    "The film that Churchill tried to ban",
    "San Francisco's best LGBTQ+ spots",
    "McGregor accused of sex assault after NBA game",
    "Three dead and dozens injured in Texas tornado",
    "Spotify ends podcast deal with Harry and Meghan",
    "England batting first against Australia as Ashes gets under way",
    "Maresca set for Leicester job, Russo to leave WSL side Man Utd",
    "Leicester set to name Man City's Maresca as manager",
    "The giant planet scientists can't find",
    "Have we sent life to other planets?",
    "The UFO-mania that swept the US",
    "The poisonous origin of life on Earth",
    "Why New York's skyscrapers are causing it to sink",
    "The surprising trick to boost your sex appeal",
    "The colours that can save your life",
    "The 'best chef' of the US South",
    "A show that 'revels in its twists'",
    "The people who feel guilty not working",
    "My surgeon experimented on me and ruined my life",
    "Quiz of the week: What was blamed on Beyoncé?",
    "Scottish camping 'grandad' is TikTok hit age 74",
    "1 iPhone maker to shift to cars as US-China ties sour",
    "2 Gates meets Xi as US-China tensions simmer",
    "3 Branson to launch space tourism flights this month",
    "4 Hacker gang Clop publishes victim names on dark web",
    "Finland's plan to bury nuclear waste",
    "Could hosepipe drones tackle wildfires?",
    "A 'game changer' for tracking species",
    "The workers already replaced by artificial intelligence",
    "Kelly Hoppen: 'Music is design to me'",
    "Tears as Greece shipwreck survivor reunited with brother",
    "Tears as Greece shipwreck survivor reunited...",
    "Watch: Otter plays basketball to help ease...",
    "Watch: Otter plays basketball to help ease arthritis",
    "'My beautiful boy' - family tributes at...",
    "'My beautiful boy' - family tributes at Nottingham vigil",
    "Robber gets trapped under shop shutters",
    "First look at Banksy's secret solo show in...",
    "First look at Banksy's secret solo show in Glasgow",
    "Heartbroken fathers address Nottingham vigil",
    "Watch: What happened and where in Nottingham...",
    "Watch: What happened and where in Nottingham attacks",
    "Video shows woman freed from Kramatorsk...",
    "Video shows woman freed from Kramatorsk rubble",
    "Trump's historic day in court... in 60...",
    "Trump's historic day in court... in 60 seconds",
    "Speeding police officer pulled over by...",
    "Speeding police officer pulled over by another cop",
    "The Indians taking on giant Saudi-backed refinery",
    "The pop band who ditched Mormonism and found themselves",
    "Twitter sued by music publishers for $250m",
    "Super-engineered vaccines created to help end polio",
    "Burna Boy bling and high flyers: Africa's top shots",
    "UN to unmask fossil fuel lobbyists at climate talks",
    "Al Pacino welcomes fourth child at 83",
    "Brutal report is devastating for Boris Johnson  By Chris Mason",
    "Anger at Israeli probe into shooting of toddler  By Yolande Knell",
    "Who are the Republican hopefuls not named Trump?  By Sam Cabral",
    "Harvard morgue manager accused of selling body parts  By Chelsea Bailey",
    "North Koreans tell of neighbours starving to death  By Jean Mackenzie",
    "Israeli troops not charged over Palestinian's death  By Yolande Knell",
    "Elizabeth Holmes says she cannot pay back victims  By Sam Cabral",
    "How Berlusconi paved the way for populist politics  By Katya Adler",
    "Can Amsterdam make the circular economy work?",
    "Sacked workers tell the inside story of Musk's Twitter takeover",
    "Man trots globe blending scenes into film locations",
    "In pictures: Nottingham attack shakes city to core",
    "Surreal skies grip New Yorkers - in pictures",
    "In Pictures: The biggest music acts to play Wales",
    "Mosque plasterers and rock cutters: Africa's top shots",
    "گزارش تحقیقی بی‌بی‌سی: ۲۵ هزار سرباز روسیه از آغاز جنگ اوکراین کشته شده‌اند",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]