[
    "Detected noise is a target in search for Titanic sub - Coast Guard",
    "Sounds a glimmer of hope in sub search - but what next?",
    "'Monstrous murder of women' in Honduran prison fire",
    "The Gen Xers making mid-life career pivots",
    "'A big disappointment' from Wes Anderson ★★☆☆☆",
    "Biden calls Xi a dictator a day after Beijing talks",
    "If US firms 'go woke', do they really go broke?",
    "Zelensky admits slow progress in Ukraine offensive",
    "Transfer latest as Man City agree Kovacic deal",
    "Man City agree £30m deal for Chelsea's Kovacic",
    "'England, keep creating chaos but please pick your moments'",
    "The desperate search for the tiny missing sub",
    "How dangerous is the Titanic wreck?",
    "How deep-sea tourism became so popular",
    "Why is the missing submersible so hard to find?",
    "How modern tech is helping scientists talk to animals",
    "How to rewire your brain and tame your dark memories",
    "The LGBTQ+ landmark almost no one knows",
    "Do you have an end-of-history illusion?",
    "A big job-market problem for women",
    "America's black national anthem",
    "Vietnamese comfort food for the soul",
    "Glastonbury Festival under way as gates open",
    "The fisherman who found a dead baby in his net",
    "1 Musk vows to bring Tesla to India after meeting Modi",
    "2 Interest rate rise expected after inflation shock",
    "3 Ride-hailing and food delivery giant cuts 1,000 jobs",
    "4 Bernie Sanders announces Amazon safety investigation",
    "5 Push to rebuild Ukraine's economy starts with UK's $3bn",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "Could hosepipe drones tackle wildfires?",
    "Airbus experiments with more control for the autopilot",
    "Today's newsletter: Zuckerberg’s astonishing comeback",
    "Watch: Huge fire burns by Las Vegas highway",
    "'Hi miss!': Hollywood star surprises sister...",
    "'Hi miss!': Hollywood star surprises sister in class",
    "Watch: Glastonbury fan gets the giggles live...",
    "Watch: Glastonbury fan gets the giggles live on TV",
    "Watch: The missing Titanic sub... in 77...",
    "Watch: The missing Titanic sub... in 77 seconds",
    "How the search for the Titanic sub is...",
    "How the search for the Titanic sub is unfolding",
    "St John's hoping for missing sub's safe...",
    "St John's hoping for missing sub's safe return",
    "Search expert describes friends missing on...",
    "Search expert describes friends missing on Titan sub",
    "Titanic sub visitor: We're aware of risks,...",
    "Titanic sub visitor: We're aware of risks, it's not a lark",
    "Bodycam shows officer dragged into drainpipe...",
    "Bodycam shows officer dragged into drainpipe in flood rescue",
    "Hackers claim not to have BBC, Boots and BA data",
    "Southgate play hits back of the net, critics say",
    "Future of UK fossil fuels at stake in test case",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "Ex-medical officer close to tears over Covid deaths",
    "Global monkey torture ring exposed by BBC",
    "Elliot Page: 'I'm living my life for the first time'",
    "Why the US is rolling out the red carpet for Modi  By Vikas Pandey",
    "The struggles and scandals of Hunter Biden  By Sam Cabral",
    "Three key priorities in crucial US-China talks  By Anthony Zurcher",
    "Hacker gang Clop publishes victim names on dark web  By Joe Tidy",
    "Why African leaders are travelling to Ukraine  By Barbara Plett Usher",
    "McGregor accused of sex assault after NBA game  By Chelsea Bailey",
    "Japan rewrites sex crime laws in landmark move  By Kelly Ng",
    "First synthetic human embryo raises ethical issues  By James Gallagher",
    "The workers already replaced by artificial intelligence",
    "Kelly Hoppen: 'Music is design to me'",
    "Beauty of insects revealed in photo competition",
    "Dazzling ancient bronze sword found in Germany",
    "Burna Boy bling and high flyers: Africa's top shots",
    "Man trots globe blending scenes into film locations",
    "In pictures: Nottingham attack shakes city to core",
    "واکنش تند پکن به اظهارات جو بایدن در تشبیه رئیس جمهوری چین به دیکتاتورها",
    "Hơn 60 tổ chức nhân quyền kêu gọi Obama thúc giục VN trả tự do cho bà Minh Hồng",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]