[
    "Russia has blown up major Ukrainian dam, says Kyiv",
    "Watch: Water gushes through damaged Ukraine dam",
    "Ukraine troops advance on eastern front, Kyiv says",
    "Europe's under-the-radar gay hotspot",
    "James Beard Award winners announced",
    "FBI agent who spied for Russia found dead in prison",
    "Harry due in court to give evidence in hacking trial",
    "Who is no longer world's richest? Our quickfire quiz...",
    "Transfer news and football latest",
    "Celtic's Postecoglou agrees to become Spurs boss",
    "Question marks surround India for World Test final",
    "How your phone can check your heart",
    "The latest trends in tech direct to your inbox",
    "The anxiety of being replaced by AI",
    "Is this the spectacular tomb of king Minos?",
    "Inside the world's biggest 'mirror' solar plant",
    "Is this the Dutch secret to a healthier, happier life?",
    "Japan's ultimate lesson in gratitude",
    "Will a four-day week get workers back?",
    "The search for Earth's hidden mountains",
    "Sex, violence and sparkling one-liners",
    "Bleak future puts Afghan women in mental health crisis",
    "First sprinter to run 100m in under 10 seconds dies",
    "Harry surrounded by 'web of unlawful activity'",
    "1 Apple unveils $3,499 mixed reality headset",
    "2 Singapore to hold final horse race after 180 years",
    "3 Crypto giant accused of 'web of deception' by US",
    "4 IMF: Immigration can help push down UK inflation",
    "5 Energy giant SSE to pay £9.8m for pricing breach",
    "The birds ensnared by plastic",
    "The first lab-grown burger: 10 years on",
    "Why we need more female electricians",
    "Why millions of useable hard drives are being destroyed",
    "The tech tricks that make computer games look real",
    "Cat upstages royal historian mid-BBC interview",
    "Cat upstages royal historian mid-BBC...",
    "Why is Prince Harry heading to the High...",
    "Why is Prince Harry heading to the High Court?",
    "Wreckage cleared from tracks after India...",
    "Wreckage cleared from tracks after India train crash",
    "'Chaos' outside hospital after India train...",
    "'Chaos' outside hospital after India train crash",
    "Brian Cox 'hasn't watched Succession finale'",
    "Uganda's Ghetto Kids seek glory in UK talent...",
    "Uganda's Ghetto Kids seek glory in UK talent show",
    "Protester dragged from track at Epsom Derby",
    "Drone shows extent of India train crash...",
    "Drone shows extent of India train crash destruction",
    "Eyewitnesses describe pain and agony of India...",
    "Eyewitnesses describe pain and agony of India train crash",
    "Striking Full Monty writers picket own premiere",
    "Ghana patients in danger as nurses head for UK - medics",
    "BBC, BA and Boots among victims of mass payroll hack",
    "Lewis Capaldi cancels shows to 'rest and recover'",
    "How is my country doing tackling climate change?",
    "Strawberry Moon captured over England",
    "Could ultra-processed foods be harmful for us?",
    "Why Putin has put this religious art on display  By Steve Rosenberg",
    "Ex-Vice-President Mike Pence joins White House race  By Sam Cabral",
    "How did three trains collide in India?  By Geeta Pandey",
    "How the Pakistani military feel about Imran Khan  By Farhat Javed",
    "Putin - South Africa's big headache  By Andrew Harding",
    "Five revelations from Nasa's public UFO meeting  By Mike Wendling",
    "Andrew Tate challenged on misogyny in combative BBC interview  By Lucy Williamson",
    "Peas that don't taste like peas could help planet  By Pallab Ghosh",
    "The 'exploding' demand for giant heat pumps",
    "The chip maker that became an AI superpower",
    "Top Scottish landscape photographers announced",
    "Long lashes and fashion flair: Africa's top shots",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "Photographer blends Africa with Welsh communities",
    "انفجار سدی بزرگ در خرسون؛ اوکراین و روسیه یکدیگر را متهم می‌کنند",
    "Sau đụng độ nguy hiểm, Mỹ cáo buộc sự 'hung hăng' của quân đội Trung Quốc",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]