[
    "At least 150 arrests in violent protests over France police killing",
    "Presumed human remains found in Titan sub debris",
    "Madonna postpones tour after intensive care stay",
    "India's ancient, mysterious folk ritual",
    "The weird bugs in giant seaweed blobs",
    "Row over Trump's strength exposes Republican dilemma",
    "He didn't confront a school shooter. Should he be jailed?",
    "US great Biles set to return after two-year absence",
    "Transfer latest - Havertz, Rice, Maddison",
    "Ashes build-up: Will England slow Australia's progress in Lord's Test?",
    "'Your life changed' – Wimbledon's ball boys from Barnardo’s",
    "The surprising truth about frozen fruit",
    "The intriguing brain condition that makes you forget people",
    "The truth about the most iconic French 'vice'",
    "The roofs cooling Indian slums",
    "Indonesia's futuristic take on travel",
    "The power of 'the sweater' in The Bear",
    "Orcas have a dangerous new hobby",
    "The reality of marriage after babies",
    "'The Hajj is my dream but I'm shocked by the cost'",
    "'I find silence very intimidating - there has to be noise'",
    "1 Warning Thames Water must address 'significant issues'",
    "2 Five-day bank holiday in Sri Lanka for debt restructure",
    "3 Heating down but spending up for royal finances",
    "4 Holidays in Greece, Spain and Turkey soar in price",
    "5 A new India verdict recognises value of women's work",
    "How a photo changed our view of chimps",
    "The homes built from cannabis",
    "Finland's plan to bury nuclear waste",
    "The women tackling the 'woeful' diversity in plumbing",
    "The latest technology news direct to your inbox",
    "Watch: Rioters hurl fireworks at police in France",
    "Watch: Rioters hurl fireworks at police in...",
    "Video shows wreckage of Titan sub brought...",
    "Video shows wreckage of Titan sub brought ashore",
    "What we know about killing of Paris teen......",
    "What we know about killing of Paris teen... in 55 seconds",
    "Australian skateboarder, 13, makes history...",
    "Australian skateboarder, 13, makes history with rare trick",
    "Russian missile strike hits restaurants in...",
    "Russian missile strike hits restaurants in Ukrainian city",
    "Police hunt man filmed carving names on...",
    "Police hunt man filmed carving names on Colosseum",
    "'It's so disheartening' - Dolly Parton...",
    "'It's so disheartening' - Dolly Parton tribute act on Meta 'ban'",
    "Fire engulfs tower and sprays embers over UAE...",
    "Fire engulfs tower and sprays embers over UAE city",
    "Watch moment horse airlifted to safety from...",
    "Watch moment horse airlifted to safety from pit",
    "Eid al-Adha around the world in pictures",
    "Arise 'Sir G': Grayson Perry accepts knighthood",
    "Cut broadband tax to help more online, peers say",
    "Scientists pick up shock waves from colliding galaxies",
    "China's green power surge offers hope for climate",
    "The loan sharks profiting from the pain of soaring prices",
    "Health alert issued over malaria spread in the US",
    "Why French government backed shot teenager's family  By Hugh Schofield",
    "When Miss World's arrival in India ignited protests  By Zoya Mateen",
    "Deforestation surges in 2022 despite pledges  By Matt McGrath & Mark Poynting",
    "US high court stops school's skirt rule for girls  By Holly Honderich",
    "Myanmar army cuts off aid to cyclone survivors  By Kelly Ng & BBC Burmese",
    "Fox picks Jesse Watters to replace Tucker Carlson  By Sam Cabral",
    "Instability ratchets up pressure on Russian president  By Steve Rosenberg",
    "Teen on sub took Rubik's Cube to break record - mother  By Nomia Iqbal & Chelsea Bailey",
    "Cheers! Can AI help drinkers buy a better bottle of wine?",
    "Students switch to AI to learn languages",
    "Masks, fighters and witches: Student photographers on show",
    "Photographer shares shots of famous musicians",
    "Fans, foes and foil clothes: Africa's top shots",
    "Millinery masterpieces at Royal Ascot",
    "Rihanna, Lizzo and Marilyn shine in Divas exhibition",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]