[
    "Millions advised to mask up due to wildfire smoke",
    "Children in critical condition after France knife attack",
    "Catching the men who sell subway groping videos",
    "The world's most underrated dive spots?",
    "The nation that is the 'land of song'",
    "Canada fires shroud New York City with orange haze",
    "Trump told he could face charges over documents",
    "Why this teen says he was rejected by top US colleges",
    "World Test Championship final: Head falls for superb 163",
    "Reaction to West Ham's first major trophy in 43 years & transfer news",
    "Liverpool complete £55m Mac Allister signing",
    "Jodie Comer stops stage show due to New York air",
    "Five myths about wildfires",
    "How to keep safe from wildfire smoke in 80 seconds",
    "The newly discovered 'alien' lifeforms of the deep ocean",
    "How an advanced civilisation vanished 2,500 years ago",
    "Why one of the world's greatest composers was erased from history",
    "Why fish are finding it hard to breathe",
    "Where tipping is considered offensive?",
    "The best comic book movies ever made",
    "Why AI won't be a burnout cure",
    "The only place in the world selling lab-grown meat",
    "Misogyny helped jail a mother. Science freed her.",
    "Egypt bans Dutch archaeologists over Black music exhibit",
    "1 Long-time boss of Guinness maker Diageo dies at 63",
    "2 CNN chief out after just 13 months",
    "3 'Massive shift' in shopping habits as prices soar",
    "4 Telegraph Media Group set to be put up for sale",
    "5 Heathrow security officers announce summer strikes",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "The first lab-grown burger: 10 years on",
    "'Two of my gay friends have gone missing'",
    "Why millions of useable hard drives are being destroyed",
    "Ukraine drones drop water bottles to people stranded by floods",
    "Ukraine drones drop water bottles to people...",
    "Watch: Chaotic scenes as busy escalator...",
    "Watch: Chaotic scenes as busy escalator switches direction",
    "Watch moment trapped whale is cut free from...",
    "Watch moment trapped whale is cut free from net",
    "Ukraine dam breach rescue... in 62 seconds",
    "Watch Hawaii's Kilauea volcano erupting in...",
    "Watch Hawaii's Kilauea volcano erupting in fiery display",
    "Prince Harry arrives at the High Court for...",
    "Prince Harry arrives at the High Court for day two",
    "Colorado wildlife officer frees bear from car",
    "Watch moment woman is rescued from...",
    "Watch moment woman is rescued from floodwaters",
    "Watch moment thief gives up on liquor store...",
    "Watch moment thief gives up on liquor store robbery",
    "Sunak to raise trade issues in US talks with Biden",
    "Are Coldplay fans as eco-conscious as the band?",
    "Warning firms may use brain data to watch workers",
    "US cancer drug shortage hits thousands of patients",
    "Crocodile found to have made herself pregnant",
    "Strawberry Moon captured over England",
    "Bomb inquiry recommendation delays 'heartbreaking'",
    "GPs in England set to offer weight-loss jab to reduce obesity  By Michelle Roberts",
    "Cyber gang issues ultimatum to mass hack victims  By Joe Tidy",
    "No means no: Japan is set to redefine rape  By Tessa Wong & Sakiko Shiraishi",
    "Why Putin has put this religious art on display  By Steve Rosenberg",
    "Ex-Vice-President Mike Pence joins White House race  By Sam Cabral",
    "How did three trains collide in India?  By Geeta Pandey",
    "How the Pakistani military feel about Imran Khan  By Farhat Javed",
    "Putin - South Africa's big headache  By Andrew Harding",
    "The tech tricks that make computer games look real",
    "The 'exploding' demand for giant heat pumps",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "Top Scottish landscape photographers announced",
    "Long lashes and fashion flair: Africa's top shots",
    "New Yorkers gather for Manhattanhenge",
    "Photographing history: The quarrymen of Wales",
    "نئی جماعت بنانے والوں کے لیے عمران خان کی نیک تمنائیں",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]