[
    "Silvio Berlusconi, former Italian PM, dies at 86",
    "Trump is 'toast' if indictment correct, Barr says",
    "Mum told plane crash children to leave her and survive",
    "Is 'burning bridges' a career killer?",
    "The film that 'scared kids witless'",
    "Four memorable moments from Silvio Berlusconi's life",
    "Joni Mitchell makes triumphant return to the stage",
    "Busy US highway collapses after oil tanker blaze",
    "AC Milan pay tribute to former owner Berlusconi",
    "Missing World Cup was worse than ban - Toney",
    "'Australia are formidable - but they can be beaten'",
    "Federal Indictment of Donald Trump",
    "Why Trump indictment revelations could be so damaging",
    "Could Donald Trump go to prison over secret files?",
    "See where Trump allegedly kept classified docs",
    "How to rewire your brain and tame your dark memories",
    "The island that switches nationality every six months",
    "The English language 'laws' you never knew you knew",
    "The millions of undiscovered shipwrecks",
    "The British Camino de Santiago trail",
    "The workers quitting digital nomadism",
    "11 of the best New York films",
    "Top Belgian museum rethinks its Africa relationship",
    "George Soros hands reins of $25bn empire to son Alex",
    "The Scottish islands desperately seeking doctors",
    "1 Facebook owner Meta plans to create Twitter rival",
    "2 Reddit communities to go private on Monday",
    "3 Warning UK mortgage rates set to rise further",
    "4 Food boss calls for higher taxes on unhealthy food",
    "Could hosepipe drones tackle wildfires?",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "India attempts to revive its dwindling rubber industry",
    "'Two of my gay friends have gone missing'",
    "Nicola Sturgeon's arrest - explained in 80 seconds",
    "Nicola Sturgeon's arrest - explained in 80...",
    "Watch: How Colombia children jungle rescue...",
    "Watch: How Colombia children jungle rescue unfolded",
    "Trombonist soldier plays on after fainting",
    "Boris Johnson's political career... in 72...",
    "Boris Johnson's political career... in 72 seconds",
    "Watch: The public no longer believe Johnson -...",
    "Watch: The public no longer believe Johnson - Curtice",
    "Drone footage shows blaze at listed building",
    "Train smashes through truck on railway...",
    "Train smashes through truck on railway crossing",
    "Windfall tax to end if energy prices drop",
    "The Cube voice reveals prostate cancer diagnosis",
    "Man trots globe blending scenes into film locations",
    "Reddit communities go dark in protest at changes",
    "US cancer drug shortage hits thousands of patients",
    "UK satellite to map heat inefficient buildings",
    "Jodie Comer among winners at Tony Awards",
    "The elephant that has two India states on edge  By Meryl Sebastian",
    "UK heatwave: How does sunscreen work?  By Rachel Schraer",
    "The ghost of Boris Johnson haunts Rishi Sunak  By Chris Mason",
    "'The level of cruelty... it's like Stalin's time'  By Steve Rosenberg",
    "Is this indictment a threat to Trump's 2024 campaign?  By Anthony Zurcher",
    "El Niño planet-warming weather phase has begun  By Matt McGrath",
    "Taurine may extend life and health, scientists find  By James Gallagher",
    "Catching the men who sell subway groping videos  By Zhaoyin Feng, Aliaume Leroy & Shanshan Chen",
    "Why millions of useable hard drives are being destroyed",
    "The tech tricks that make computer games look real",
    "Surreal skies grip New Yorkers - in pictures",
    "In Pictures: The biggest music acts to play Wales",
    "Mosque plasterers and rock cutters: Africa's top shots",
    "Strawberry Moon captured over England",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "سخنگوی وزارت خارجه ایران مذاکرات با واسطه با آمریکا را تایید کرد",
    "Nga thuê nhóm Akhmat từ Chechnya, Ukraine nói 'giải phóng bốn làng'",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]