[
    "What will it take for Ukraine's offensive to succeed?",
    "How Trump, Biden and Clinton cases compare",
    "Damon and Affleck's studio condemn Trump ad",
    "Canada wildfires: Is climate to blame?",
    "The film that 'scared kids witless'",
    "Trump arrives in Florida ahead of court appearance",
    "Former Italian PM Silvio Berlusconi dies at 86",
    "JP Morgan agrees to pay $290m to Epstein victims",
    "Fans celebrate Man City's historic Treble",
    "US Senate investigating PGA Tour-PIF agreement",
    "AC Milan pay tribute to former owner Berlusconi",
    "Federal Indictment of Donald Trump",
    "Who is Walt Nauta, the indicted Trump aide?",
    "Here's how Trump's historic day in court will unfold",
    "Trump is 'toast' if indictment correct, Barr says",
    "How to rewire your brain and tame your dark memories",
    "The island that switches nationality every six months",
    "The English language 'laws' you never knew you knew",
    "Is 'burning bridges' a career killer?",
    "The millions of undiscovered shipwrecks",
    "The world's most generous city?",
    "11 of the best New York films",
    "Schoolgirl striker's 143 goals in super season",
    "US highway collapse will take 'months' to repair",
    "France shooting suspect under investigation for murder",
    "1 Facebook owner Meta plans to create Twitter rival",
    "2 Reddit communities to go private on Monday",
    "3 Warning UK mortgage rates set to rise further",
    "4 Food boss calls for higher taxes on unhealthy food",
    "Could hosepipe drones tackle wildfires?",
    "A 'game changer' for tracking species",
    "The birds ensnared by plastic",
    "Sacked workers tell the inside story of Musk's Twitter takeover",
    "The best of Boston's Seaport District",
    "Thousands of fish wash up on Texas coast",
    "What Trump's rivals have to say about his...",
    "What Trump's rivals have to say about his indictment",
    "Giant alligator removed from Florida pool",
    "Trump's arrest in Florida explained in 90...",
    "Trump's arrest in Florida explained in 90 seconds",
    "Cars in London push through thunderstorm...",
    "Cars in London push through thunderstorm flooding",
    "WATCH: Memorable moments from Silvio...",
    "WATCH: Memorable moments from Silvio Berlusconi's life",
    "Busy US highway collapses after oil tanker...",
    "Busy US highway collapses after oil tanker blaze",
    "Nicola Sturgeon's arrest - explained in 80...",
    "Nicola Sturgeon's arrest - explained in 80 seconds",
    "Berlusconi offers handshake advice to BBC...",
    "Berlusconi offers handshake advice to BBC reporter",
    "Watch: How Colombia children jungle rescue...",
    "Watch: How Colombia children jungle rescue unfolded",
    "Food boss calls for higher taxes on unhealthy food",
    "Joni Mitchell makes triumphant return to the stage",
    "Man trots globe blending scenes into film locations",
    "Reddit communities go dark in protest at changes",
    "US cancer drug shortage hits thousands of patients",
    "Flight turbulence increasing as planet heats up",
    "Ofcom to research attitudes to politician TV hosts",
    "UK satellite to map heat inefficient buildings  By Jonathan Amos",
    "The elephant that has two India states on edge  By Meryl Sebastian",
    "UK heatwave: How does sunscreen work?  By Rachel Schraer",
    "The ghost of Boris Johnson haunts Rishi Sunak  By Chris Mason",
    "'The level of cruelty... it's like Stalin's time'  By Steve Rosenberg",
    "Is this indictment a threat to Trump's 2024 campaign?  By Anthony Zurcher",
    "El Niño planet-warming weather phase has begun  By Matt McGrath",
    "Taurine may extend life and health, scientists find  By James Gallagher",
    "India attempts to revive its dwindling rubber industry",
    "'Two of my gay friends have gone missing'",
    "Surreal skies grip New Yorkers - in pictures",
    "In Pictures: The biggest music acts to play Wales",
    "Mosque plasterers and rock cutters: Africa's top shots",
    "Strawberry Moon captured over England",
    "Bywyd ar fferm fynydd Gymreig // Life on a Welsh hill farm",
    "Phi công đào ngũ người Nga trả lời phỏng vấn BBC",
    "Make an editorial complaint",
    "Read about our approach to external linking."
]