[
    "Dow jumps 500 points to break four-day losing streak as regional banks and Apple shares surge",
    "Second half of Berkshire Hathaway's annual meeting begins now. Follow all of Warren Buffett's comments here",
    "Rocket builder Firefly takes on high-speed Space Force mission for crucial next launch",
    "Buffett says letting SVB clients go under would’ve been `catastrophic’ for U.S.",
    "Oprah Winfrey almost turned down her first TV job—a professor changed her mind",
    "Buffett says the key to value investing is people 'doing dumb things'",
    "How Amazon bought more renewable energy than any other company in 2022",
    "Just 5 stocks make up the lion's share of Warren Buffett's equity portfolio",
    "Here's the No. 1 skill for raising highly resilient kids, says parenting expert and neuropsychologist",
    "As earnings season winds down, investors turn to Tuesday's debt ceiling meeting",
    "26-year-old pays $1,157 a month for a 240-square-foot studio",
    "4 of the best places for cash as the Fed weighs a pause in interest rate hikes",
    "WWE fans are worried about the UFC merger, but they love the drama, too",
    "Threat of TikTok ban has creators on edge, seeking to build following on Instagram",
    "Forgiveness can boost happiness, improve mental health: 5 steps to get started",
    "You're right to be scared of A.I., says Ivy League expert and White House advisor",
    "Restaurants embrace premium reservations to target big spenders",
    "22-year-old earned $2M in scholarships and graduated from Princeton debt-free",
    "Berkshire operating earnings pop 12%, cash hoard tops $130 billion",
    "What Chile's state-led lithium policy means for the future of electric vehicles",
    "Rocket builder Firefly takes on Space Force mission for crucial next launch",
    "How the $8 billion parking industry is evolving to stay alive",
    "Second half of Berkshire Hathaway's annual meeting begins now. Follow all of Warren Buffett's comments here",
    "How Cramer's 'own it; don't trade it' stance on Apple paid off in a tough week",
    "Here’s what's going on at Warren Buffett’s shopping extravaganza",
    "Apple shares jump after earnings beat. Here's what the experts have to say",
    "Here’s what the SEC will require under its new stock buyback disclosure rules",
    "Regional bank stocks could be a market afterthought in the week ahead",
    "Florida Gov. Ron DeSantis signs bill to void Disney development deals",
    "Energy was due for Friday's rally. How we're approaching our oil-and-gas stocks now",
    "Bitcoin could rally 30% in the next month, says Canaccord Genuity chart analyst",
    "Warren Buffett's successor Greg Abel is wooing shareholders",
    "Mark Cuban: Potential impact of AI chatbots is 'beyond anything' I’ve seen",
    "King Charles and Queen Camilla crowned in historic ceremony",
    "Just 5 stocks make up the lion's share of Warren Buffett's equity portfolio. Here’s what they are",
    "Buffett explains value investing: 'What gives you opportunities is other people doing dumb things'",
    "How Amazon bought more renewable energy than any other company in 2022",
    "Warren Buffett says letting Silicon Valley Bank customers go under would’ve been 'catastrophic’",
    "Ukraine downs Russian hypersonic missile with U.S. Patriot",
    "Warren Buffett owns these stocks and analysts love them too",
    "Restaurants embrace premium reservations to target big spenders",
    "Oprah Winfrey almost turned down her first TV job—how a college professor changed her mind",
    "TurboTax payments for $141 million settlement to begin next week. Here's who qualifies",
    "This dividend-paying fund may help protect investors during wild market swings",
    "As earnings season winds down, investors turn to Tuesday's debt ceiling meeting",
    "Berkshire operating earnings increase 12% in the first quarter, cash hoard tops $130 billion",
    "Fox asks Dominion Voting to probe leaks of Tucker Carlson messages",
    "Threat of TikTok ban has creators scrambling to build followings on Instagram, YouTube",
    "Hardcore wrestling fans are torn over the WWE-UFC merger – but they love the drama",
    "Impactive takes a stake in Clarivate and sets the tone for activism in the post-SPAC world",
    "Should you pay for your insurance with a credit card?",
    "Here's the No. 1 skill for raising highly resilient kids, says parenting expert and neuropsychologist",
    "Second half of Berkshire Hathaway's annual meeting begins now. Follow all of Warren Buffett's...",
    "Warren Buffett says letting Silicon Valley Bank customers go under would’ve been 'catastrophic’",
    "Warren Buffett's Berkshire Hathaway has been a fortress stock during recessions and bear markets....",
    "Ether rallies 5% as meme mania tries to reenter the crypto market",
    "Ramit Sethi: How renting could make you richer than buying",
    "We renovated a $100,000 abandoned high school into a 31-unit apartment building - take a look inside",
    "This side gig can be done at any time of day—and pays as much as $60 per hour",
    "The most effective—but unpopular—way to raise happy kids, says Ivy League child psychologist",
    "Second half of Berkshire Hathaway's annual meeting begins now. Follow all of Warren Buffett's comments here",
    "Fox asks Dominion Voting to probe leaks of Tucker Carlson messages",
    "TurboTax payments for $141 million settlement to begin next week. Here's who qualifies",
    "Just 5 stocks make up the lion's share of Warren Buffett's equity portfolio. Here’s what they are",
    "Regional bank stocks could be a market afterthought in the week ahead",
    "Apple shares jump after earnings beat. Here's what the experts have to say",
    "Oakmark Funds' Bill Nygren buys this regional bank with strong deposits",
    "Bitcoin could rally 30% in the next month, says Canaccord Genuity chart analyst",
    "Warren Buffett owns these stocks and analysts love them too",
    "Insider buying: These regional bank execs are buying the dip in their stocks",
    "How Amazon bought more renewable energy than any other company in 2022",
    "What Chile's state-led lithium policy means for the future of the electric vehicle industry",
    "Billionaire Richard Branson defends space travel, argues it can benefit planet",
    "Westinghouse announces a small nuclear reactor — a step in the industry's efforts to remake itself",
    "Auto giants are setting their sights on a new growth market for EVs: India",
    "A looming El Niño could prompt a spike in global temperatures, UN agency warns",
    "This former Tesla engineer is reinventing the home electrical panel",
    "New York poised to pass first statewide law banning natural gas in new buildings",
    "Restaurants embrace premium reservations to target big spenders",
    "Hardcore wrestling fans are torn over the WWE-UFC merger – but they love the drama",
    "Rocket builder Firefly takes on high-speed Space Force mission for crucial next launch",
    "Here’s what the SEC will require under its strict new stock buyback disclosure rules",
    "It might sound weird, but the future of DC starts with Marvel's 'Guardians of the Galaxy Vol 3'",
    "Florida Gov. Ron DeSantis signs bill to void Disney development deals",
    "Kenvue CEO looks to brand, product innovation to drive growth after IPO",
    "Trump town hall will test CNN CEO Chris Licht's disinformation rule",
    "Threat of TikTok ban has creators scrambling to build followings on Instagram, YouTube",
    "Ether rallies 5% as meme mania tries to reenter the crypto market",
    "OpenAI changed its plans and won't train on customer data, Sam Altman says",
    "Apple and fintechs like Robinhood chase yield-hungry depositors as Fed rate hikes continue",
    "Apple posts record quarter in India; analyst says Cook eyes market to be bigger than China",
    "Tesla hikes price of high-end Model S and Model X in China by roughly $2,750",
    "Apple reports better-than-expected quarter driven by iPhone sales",
    "Lyft shares plunge 15% on weak second-quarter guidance",
    "Here’s what the SEC will require under its strict new stock buyback disclosure rules",
    "Florida Gov. Ron DeSantis signs bill to void Disney development deals",
    "Biden tells Americans: Say goodbye to job growth and low unemployment if debt ceiling isn't lifted",
    "DeSantis used Florida's whirlwind legislative session as a potential presidential launching pad",
    "SEC awards record $279 million to whistleblower",
    "Trump says in deposition video that stars have 'historically' grabbed women",
    "Wagner leader says his forces will leave Bakhmut; Bill Clinton says he foreshadowed Russian invasion",
    "More than 250 business leaders back Julie Su for Labor secretary as nomination hangs in the balance",
    "TurboTax payments for $141 million settlement to begin next week. Here's who qualifies",
    "4 of the best places for cash as the Federal Reserve weighs a pause in interest rate hikes",
    "A recession could hit single women especially hard, says financial advisor. How they can prepare",
    "What is the debt ceiling? Why it's important and how it affects you",
    "How to buy your first car: Tips for navigating an 'unprecedented' market, according to auto experts",
    "3 financial risk areas for consumers to watch ahead of a possible recession",
    "Making these 5 moves can help you save big on the massive cost of college",
    "Here's what the Federal Reserve's quarter-point interest rate hike means for you",
    "Oprah Winfrey almost turned down her first TV job—how a college professor changed her mind",
    "Here's the No. 1 skill for raising highly resilient kids, says parenting expert and neuropsychologist",
    "26-year-old pays $1,157 a month for a 240-square-foot studio: 'I didn't even know they made apartments this tiny'",
    "Use these 5 steps to forgive others, from a psychologist who studied forgiveness for 30 years",
    "You're right to be scared of A.I., says Ivy League expert and White House advisor",
    "This 22-year-old earned $2 million in scholarships and graduated from Princeton debt-free",
    "This 22-year-old won $2 million in scholarships, graduated from Princeton and lives debt-free in NYC",
    "Mark Cuban: Potential impact of AI tools like ChatGPT is 'beyond anything I’ve ever seen in tech'",
    "Here are 8 interest savings accounts offering 5% APY (or close to it)",
    "One of the best travel credit cards has a new 80,000-point bonus offer",
    "3 ways to spring clean your finances this season",
    "Should you pay for your insurance with a credit card?",
    "Here's what you should know about construction loans before applying for one",
    "Is the Apple high-yield savings account worth it? Here are 6 accounts with higher APY",
    "Considering a custom built home? Here are 4 of the best construction loan lenders",
    "Fed raises rates again — why this is the perfect time to open a flexible CD"
]