[
    "AP/Getty Images\n\n\n\n\n\n•Live Updates",
    "Analysis: The West must now consider possibility of a Russian political collapse",
    "Putin's power threatened: Ex-KGB officer says Putin’s grip ‘nonexistent’",
    "The Wagner insurrection is over, but Putin and Prigozhin are keeping a low profile",
    "Analysis: The ‘mayfly’ mutiny evaporates, but Russia is a changed place",
    "Moscow reacts to rebellion: Hear what residents think of Yevgeny Prigozhin",
    "Explainer: Belarus says it doesn’t know where Wagner chief Prigozhin is",
    "Russian Presidential Press Service/AP\n\n\n\n\n\n•Opinion",
    "The next shoe to drop in Russia",
    "China throws support behind ‘strategic partner’ Russia",
    "John Bolton advises not to ‘underestimate’ Putin",
    "Santosh Kumar/Hindustan Times/Getty Images",
    "Humans approaching limits of ‘survivability’ as sweltering heatwaves engulf parts of Asia",
    "This is what happens to your body when temperatures soar",
    "Planet-heating pollution from global energy sector continues to rise: report",
    "‘Unbearable’: Desperation takes hold in Uruguay as water crisis deepens",
    "Christine Dawood says she gave up her place on Titan sub for her teenage son",
    "Retired conservative judge calls GOP ‘spineless’ in scathing rebuke of Trump",
    "Forgotten and stranded: Sudanese struggle as US embassy destroys passports",
    "Louisiana ordered to draw congressional map with 2nd majority-Black district",
    "Meet the key Putin ally that brokered the deal ending the Wagner insurrection",
    "Why PwC is selling part of its business in Australia for less than $1",
    "For some refugees these AI images depict a painful truth",
    "YouTube star says he declined to join submersible trip to Titanic",
    "Andrew Parsons/Kensington Palace",
    "Prince William believes you can have zero homelessness, and he’s using Finland as a case study",
    "New suspect named in racist murder of Black British teen 30 years ago",
    "Bodycam captures ‘unsettling exchange’ moments before fatal shooting",
    "Airport worker dies after being ‘ingested’ into plane engine in Texas",
    "How a heat dome can push temperatures to dangerous highs",
    "Duchess of York undergoes surgery after breast cancer diagnosis",
    "Courtesy Chelsea Dickenson",
    "She arrived at the airport and stuffed a bra with clothes. Here’s why",
    "Chandan Khanna/AFP/Getty Images",
    "Ultra runner breaks record of world’s oldest 100-mile race by almost 80 minutes",
    "Woohae Cho/The New York Times/Redux",
    "In country with the world’s lowest fertility rate, a debate rages about kids in public",
    "Ayhan Mehmet/Anadolu Agency/Getty Images",
    "Joe Kohen/WireImage/Getty Images",
    "This endangered bird has found a refuge among Hong Kong’s skyscrapers",
    "Alberto E. Rodriguez/Getty Images",
    "Hollywood stars Ryan Reynolds and Rob McElhenney part of group taking 24% stake in Alpine F1 team",
    "Caroline Brehman/EPA-EFE/Shutterstock",
    "Rent is falling in America for the first time in years",
    "The world’s 50 best restaurants for 2023 revealed",
    "J. Vespa/WireImage/Getty Images",
    "Celebrities epitomized ‘Barbiecore’ trend two decades before it had a name",
    "Costfoto/Barcroft Media/Getty Images",
    "Flying without wings: The world’s fastest trains",
    "Cold pizza in a glass? The rise of savory cocktails",
    "Tim Graham Photo Library/Getty Images",
    "Princess Diana’s famous ‘black sheep’ sweater is going up for auction",
    "Erik Van Leeuwen/AFP/BELGA MAG/Getty Images",
    "Belgian shot putter competes in 100-meter hurdles after injuries to teammates",
    "Micah Kimberlin/TMX\n\n\n\n\n\n•Video",
    "Watch: Alligator chases fisherman",
    "Kourtney Kardashian and Travis Barker reveal sex of baby on the way",
    "Erik Pendzich/Shutterstock",
    "Why it might be time to get optimistic about the stock market",
    "Oil price gains fade but gas and wheat rise after weekend of turmoil in Russia",
    "The world’s fight against inflation is about to get more serious – and painful",
    "Why chaos in Russia could spell trouble for the global economy",
    "Drive-thrus are creating problems for cities and towns",
    "Are investors ignoring the Federal Reserve’s warning?",
    "He delivered a baby on an airplane. Here’s what happened next",
    "The fire that’s ‘burned for 4,000 years and never gone out’",
    "Qantas reveals economy seats for 19-hour NYC-Sydney ultra long-haul flights",
    "A world in three islands on the Mediterranean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "Adrian Dennis/AFP/Getty Images",
    "Carlos Alcaraz set to reclaim world No. 1 spot after winning first-ever grass title",
    "One of the world’s fastest athletes is without a country to run for",
    "Meet the photographer redefining how we view the world of chess",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Unseen photos of Glastonbury from 1971 show just how much the festival has changed",
    "Li Cunxin, ‘Mao’s Last Dancer,’ to step away from ballet due to ‘serious health concerns’",
    "Rubens painting ‘lost’ for centuries could sell for $7.7 million",
    "Could these air purification towers tackle India’s pollution problem?",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Bay Ismoyo/AFP/Getty Images",
    "A relationship that could rearrange the geopolitical chessboard",
    "While we hope for the best for missing Titanic sub, let’s not forget these other victims",
    "A sign Putin is losing ground",
    "As a father, I’ll be sure my Black daughters get ‘The Talk’",
    "Why I flew to Jamaica to take magic mushrooms … on camera",
    "A plane crash, a miracle rescue, and the balm we were all looking for",
    "The city of love has a plan for its rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "Municipality of Tiel/Reuters",
    "Archaeologists unearth 4,000-year-old Stonehenge-like sanctuary in the Netherlands",
    "Ancient galaxy reveals a surprising way to annihilate a star",
    "What we know about the ocean’s depths — and why it’s so risky to explore it",
    "Muscle memory has physiological and neurological implications",
    "Study: How much contact you have with people could be a risk factor for early death",
    "Tom Werner/Stone RF/Getty Images",
    "Everything you need to know about AI but were too afraid to ask",
    "SolarWinds chief vows to fight any legal action from US regulators over alleged Russian hack",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Reddit users bombard site with John Oliver pictures in latest protest over new policy",
    "Malaysia to take legal action against Meta over ‘undesirable’ content",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "‘Price is Right’ celebration goes horribly wrong",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’"
]