[
    "Exploding fire extinguisher",
    "Mark Phillips/CNN\n\n\n\n\n\n•Live Updates",
    "Villages liberated in counteroffensive are little more than ruins",
    "Ukraine takes political flak over progress of counteroffensive",
    "OceanGate co-founder cautions against speculation on tragic loss of Titanic submersible",
    "What is a ‘catastrophic implosion’ and what happened to the sub crew?",
    "Deep-sea tragedy renews scrutiny of OceanGate’s operations",
    "Hellenic Coast Guard/Reuters",
    "Nicolas Economou/NurPhoto/Getty Images",
    "150 US Starbucks stores go on strike over Pride decorations",
    "Modi takes reporters’ questions in remarkable moment at White House visit",
    "Thousands of dead fish wash up on Thai beach",
    "Video shows key Russian supply bridge knocked out by missile",
    "Beijing records its hottest ever June day",
    "Teenager killed by exploding fire extinguisher during school drill",
    "CNN’s Amanpour asks Obama about ‘spectacle’ of Trump. Hear his answer",
    "Leon Neal/AFP/Getty Images\n\n\n\n\n\n•Analysis",
    "William’s bold moves as the new Prince of Wales",
    "Intruder breaks into home. See what happens when police arrive with a K-9",
    "Abortion is ancient history: Long before Roe, women terminated pregnancies",
    "Malaysia to take legal action against Meta over ‘undesirable’ content",
    "Summer transfer window: The biggest moves so far as Saudi Arabia becomes major factor",
    "A 2-year-old boy fatally shot his pregnant mother in Ohio, police say",
    "He delivered a baby on an airplane. Here’s what happened next",
    "Inside Anna Sorokin’s strange life under house arrest in New York",
    "The year’s first serious Oscar contender is here",
    "John Wessels/AFP/Getty Images",
    "Panthera/WildCRU/WWF Cambodia/FA",
    "Tom Williams/CQ-Roll Call, Inc/Getty Images",
    "French cave markings may be the oldest known engravings by Neanderthals",
    "Remember Furby? Watch what it was like to buy the nostalgic toy in 1998",
    "Neil Mockford/GC Images/Getty Images",
    "Paul McCartney clarifies use of artificial intelligence for ‘final’ Beatles song",
    "James Manning/PA Images/Getty Images",
    "British Museum apologizes after using translator’s work in exhibition without pay",
    "Thomas Samson/AFP/Getty Images",
    "The shimmering mirrored building that vanishes into the desert",
    "The golf academy in the ‘City of God’",
    "Is cortisol sabotaging your weight loss efforts? Experts sound off",
    "Arturo Holmes/Getty Images",
    "Basketball star Gradey Dick dazzles in ‘Wizard of Oz’ themed suit at NBA Draft",
    "Adorable baby seal hops on surfers’ boards",
    "Lab-grown meat is coming. Here’s everything you need to know",
    "Felipe Ramales/SplashNews.com",
    "Mary-Kate Olsen makes rare appearance in colorful outfit",
    "Kazuhiro Nogi/AFP/Getty Images",
    "Global markets slide as recession fears grip investors",
    "3M agrees to pay $10.3 billion to settle ‘forever chemicals’ drinking water lawsuits",
    "Nearly 80% of women’s jobs could be disrupted, automated by AI",
    "A bipartisan bill aims to protect journalists from being forced to reveal their sources",
    "Bud Light rolls out a new ad campaign to turn around slumping sales",
    "The fire that’s ‘burned for 4,000 years and never gone out’",
    "Qantas reveals economy seats for 19-hour NYC-Sydney ultra long-haul flights",
    "A world in three islands on the Mediterranean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "One of the world’s fastest athletes is without a country to run for",
    "Meet the photographer redefining how we view the world of chess",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "Unseen photos of Glastonbury from 1971 show just how much the festival has changed",
    "Li Cunxin, ‘Mao’s Last Dancer,’ to step away from ballet due to ‘serious health concerns’",
    "Rubens painting ‘lost’ for centuries could sell for $7.7 million",
    "Could these air purification towers tackle India’s pollution problem?",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Bay Ismoyo/AFP/Getty Images",
    "A relationship that could rearrange the geopolitical chessboard",
    "While we hope for the best for missing Titanic sub, let’s not forget these other victims",
    "A sign Putin is losing ground",
    "As a father, I’ll be sure my Black daughters get ‘The Talk’",
    "Why I flew to Jamaica to take magic mushrooms … on camera",
    "A plane crash, a miracle rescue, and the balm we were all looking for",
    "The city of love has a plan for its rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "Municipality of Tiel/Reuters",
    "Archaeologists unearth 4,000-year-old Stonehenge-like sanctuary in the Netherlands",
    "Ancient galaxy reveals a surprising way to annihilate a star",
    "What we know about the ocean’s depths — and why it’s so risky to explore it",
    "Muscle memory has physiological and neurological implications",
    "Study: How much contact you have with people could be a risk factor for early death",
    "Top TikTok exec and public face of company in US is stepping down",
    "Australia says Twitter is top platform for online hate, demands explanation",
    "Microsoft faces off against US government over Activision deal, with top execs set to testify",
    "Twitter accused of failing to pay millions in employee bonuses after Musk takeover",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "This is what happens to your body when temperatures soar",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "‘Price is Right’ celebration goes horribly wrong",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’"
]