[
    "Ramil Sitdikov/Sputnik/Reuters\n\n\n\n\n\n•Live Updates",
    "‘From Ukraine with love’: The elite night-time drone units bombing Russian forces",
    "See elite Ukrainian drone team attack key Russian position",
    "African leaders greeted with explosions over Kyiv on peace mission to Ukraine",
    "UAE says Russia ties are a ‘calculated risk’ in an increasingly polarized world",
    "Mutasim A. Ali/Twitter\n\n\n\n\n\n•CNN Exclusive",
    "Kill, terrorize, expel: Wagner-backed militia atrocities recall ethnic cleansing",
    "Video exposes rape allegedly carried out by Wagner-backed militia",
    "Wagner chief rejects Russian Defense Ministry efforts to rein in his force",
    "Fiery soccer game between US and Mexico ends early amid homophobic chants",
    "Millions of Americans’ personal data exposed in global hack",
    "Daniel Ellsberg, Pentagon Papers leaker and anti-war activist, dies at 92",
    "Cyclist Gino Mäder dies at 26 after high-speed Tour de Suisse crash",
    "15 dead in Canada highway collision",
    "See what Melania Trump has been up to amid Trump legal battles",
    "Pittsburgh synagogue gunman found guilty on all 63 charges",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Psychiatrists to assess starvation cult survivors as they still refuse food",
    "China’s Xi greets ‘old friend’ Bill Gates",
    "Bayerisches Landesamt für Denkmalpflege",
    "Archaeologists find a 3,000-year-old sword so well preserved it’s still gleaming",
    "Duke and Duchess of Sussex and Spotify have ‘mutually agreed to part ways’",
    "Terrifying video shows strong wind throw people into the sky",
    "Pete Davidson charged with reckless driving after Beverly Hills car crash",
    "Obama reacts to GOP presidential candidate’s remarks about race",
    "Why does King Charles get 2 birthdays?",
    "China omits cremation data from the period of its winter Covid surge in 2022",
    "He met the love of his life but lost her. Then he had a genius idea to find her again",
    "The wild, remote island at the heart of a billion-dollar industry",
    "Victor Lochon/Gamma-Rapho/Getty Images",
    "Fendi’s factory catwalk makes a case for craft-core",
    "Tim Nwachukwu/Getty Images/FILE",
    "Petty Officer 2nd Diolanda Caballero\n\n\n\n\n\n•Video",
    "Masanori Genko/The Yomiuri Shimbun/AP",
    "bee32/iStockphoto/Getty Images/iStockphoto",
    "The truth about how often you should wash your hair",
    "RunPhoto/The Image Bank RF/Getty Images",
    "Forget about the AI apocalypse. The real dangers are already here",
    "Charles Laberge/LIV Golf/Getty Images",
    "LIV-PGA Tour deal probe urged by Rep. Maxine Waters and Sen. Sherrod Brown",
    "Fathers’ role in breastfeeding and infant sleep is key, study finds",
    "New dinosaur with blade-like spikes for armor discovered on UK’s Isle of Wight",
    "Oleksandra Butova/Ukrinform/Future Publishing/Getty Images",
    "Banksy announces new exhibition of his statement-making street art",
    "Nicolas Economou/NurPhoto/Getty Images",
    "Air travel is toxic for the planet. But some airlines are better than others",
    "Presley Ann/Patrick McMullan/Getty Images",
    "Jennifer Aniston and Courteney Cox reveal their nicknames for each other",
    "Young Chinese soccer fan gives security the slip to hug his hero Messi mid-game",
    "Ocean Exploration Trust / NOAA\n\n\n\n\n\n•Video",
    "Strange fish spotted smiling for cameras",
    "Ross Kinnaird/Getty Images",
    "Tiger Woods set to miss Open Championship",
    "Frank Einar Vatne/NTB/AFP/Getty Images/FILE",
    "European gas prices are soaring again. Full tanks should avert a new energy crisis",
    "Why the Fed paused its rate hikes: It’s tired of playing a giant guessing game",
    "Anheuser-Busch is writing checks to distributors as Bud Light sales sink",
    "UPS Teamsters overwhelmingly authorize strike if no deal is reached by August 1",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "He ran out of countries to visit, so he created his own",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Clive Brunskill/Getty Images",
    "After retiring at 28, ex-tennis star avoided ‘big black hole of depression’",
    "Novak Djokovic stands alone at the top of the men’s grand slam count. And he’s not done yet",
    "‘Messi mania’ in China as fans clamor for a glimpse of Argentina star",
    "He was one of the world’s top surfers but grew up scared of the ocean",
    "Jean-Sebastien Evrard/AFP/Getty Images",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Miriam Margolyes poses nude for British Vogue",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Environment activists smear red paint on Monet artwork at Stockholm museum",
    "Lupita Nyong’o wows in breastplate cast from a mold of her own body",
    "How a 13-year-old saved her 3 siblings in a snake-infested jungle",
    "Before Trump or Viktor Orban, there was Italy’s Berlusconi",
    "What Germany’s most famous trans woman could teach us about queer joy",
    "A tail of two cities – how Parisians and New Yorkers take on rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "NASA/JPL/Space Science Institute",
    "Key building block of life found on ocean world orbiting Saturn",
    "Curiosity rover captures dramatic new portrait of the Martian landscape",
    "Early humans left Africa and reached Asia earlier than thought, fossil discovery reveals",
    "Night owls may have unhealthy habits that lead to early death, study says",
    "What is eclampsia, the condition that may have contributed to Olympian Tori Bowie’s death?",
    "Patrick T. Fallon/AFP/Getty Images",
    "Amazon reinstates Alabama warehouse worker and union leader weeks after her firing",
    "Europe is leading the race to regulate AI. Here’s what you need to know",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Micron invests another $600 million in China despite partial sales ban",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’",
    "Video shows the moment after multiple British soldiers collapsed due to extreme heat"
]