[
    "Jewelry fetches $196 million",
    "CIA launches video to recruit Russian spies",
    "Watch new CIA video aimed at recruiting Russians to spy for the US",
    "What we know about reports that Russia lost 4 aircraft in its own territory",
    "See video raising questions about health of Kremlin-backed leader",
    "FBI never should have launched full Trump-Russia probe, special counsel Durham concludes",
    "Analyst points to this ‘revealing moment’ from Durham",
    "Thailand’s opposition won a landslide in elections. But will the military elite let them rule?",
    "A barbecue frenzy is gripping China. Can street food revive the economy?",
    "At least six dead in New Zealand hostel fire, according to report",
    "Video shows man chasing screaming woman with bat before allegedly attacking congressman staffers",
    "Turkey’s opposition faces uphill battle in runoff with Erdogan",
    "Argentina raises interest rate to 97% as it struggles to tackle inflation",
    "China sentences elderly US citizen to life in prison on spying charges",
    "Nigerian chef cooks for 100 hours in world record attempt",
    "From LigaMXExpansion/Twitter",
    "Goalkeeper scores incredible goal from almost full length of the soccer pitch",
    "Man attacks US congressman’s staff, hitting an aide in head with baseball bat",
    "Musk subpoenaed in US Virgin Islands lawsuit into Epstein sex trafficking ring",
    "Hitler speech and Nazi slogans played on Austrian train’s loudspeakers",
    "Osprey mother gets pummeled protecting her eggs from hailstorm",
    "Cyclone damage in Myanmar is ‘extensive,’ aid groups warn",
    "Ruven Afanador/Sports Illustrated",
    "Martha Stewart lands ‘historic’ Sports Illustrated Swimsuit cover",
    "How technology is changing our idea of beauty",
    "Alain Jocard/AFP/Getty Images",
    "He makes the best baguette in Paris, but he’s not French",
    "Dr. David Duffy, the University of Florida",
    "RAUL ARBOLEDA/AFP/AFP via Getty Images",
    "This could be the world’s largest ocean restoration project",
    "Controversial jewelry collection fetches a record-shattering $196 million",
    "Webb telescope uncovers new mystery in rare comet",
    "Travel expert explains the ‘unspoken rights’ for every plane seat",
    "Tuul & Bruno Morandi/The Image Bank RF/Getty Images",
    "Karakorum: Mongolia’s ancient capital is a cultural delight",
    "Chris Jackson/Getty Images",
    "Does British tourism really need the royal family?",
    "Two rare, unknown Rembrandt portraits worth millions discovered in private collection",
    "Jason Sudeikis says he changed Ted Lasso character because of Donald Trump",
    "courtesy Richard Avedon/The Richard Avedon Foundation",
    "Brooke Shields, Emma Watson and others on their favorite Avedon photos",
    "Jordan Strauss/Invision/AP",
    "The Weeknd is ditching his artistic name for his birth name",
    "Nepali Sherpa enters the Mount Everest record books",
    "Ben Brewer/Bloomberg/Getty Images",
    "3M chief business officer fired for inappropriate conduct",
    "Ex-ByteDance worker: China had ‘supreme access’ to all data",
    "Biden administration to buy 3 million barrels of oil to begin replenishing emergency oil stockpile",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "Adam Friedlander/The New York Times/Redux",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Italy’s Friuli region is one of Europe’s best kept secrets",
    "They wanted a house in Italy and bought a castle",
    "Italian food: Classic dishes everyone needs to try",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "Pitch invasion mars Barcelona’s La Liga title celebration",
    "How Erling Haaland brought new dimension to Treble-chasing Manchester City",
    "Chelsea wins Women’s FA Cup in front of world record crowd",
    "Why this centuries-old schoolboy match caused division and debate in England",
    "New York is getting a new $780 million, 25,000-seat soccer-specific stadium",
    "Andrea Gjestvang/GOST Books",
    "Portrait of the lives of Faroe Islands’ unmarried men",
    "See inside Chanel’s Los Angeles catwalk show",
    "Remember when Prince bared his butt at the 1991 VMAs?",
    "World’s first 3D-printed mosque to be built in Dubai",
    "This Y2K pastime is becoming a big hit among South Korean youth",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Notable legal clouds that continue to hang over Donald Trump in 2023",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Alina Rosanova/iStockphoto/Getty Images",
    "Trying to lose weight? Avoid sugar substitutes, WHO says",
    "Astronomers spot largest cosmic explosion ever witnessed",
    "Sleeping will be one of the challenges for astronauts on Mars missions",
    "How did massive prehistoric ‘thunder beasts’ get super big, super fast?",
    "You should make your own salad dressing",
    "John Shearer/TAS23/Getty Images for TAS Rights Management",
    "The agony and ecstasy of scoring last-minute face value Taylor Swift tickets",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "How Lyft’s new CEO is ‘copying’ his former boss Jeff Bezos to turn around the company",
    "Twitter’s new encrypted message feature criticized by security and privacy experts",
    "The most popular search engine in the world is about to look different",
    "Peloton is recalling 2 million bikes",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Teacher feared dead after shark attack off South Australia",
    "Biden picks cancer surgeon Monica Bertagnolli to be next NIH director",
    "Robert De Niro welcomes his 7th child at 79",
    "Ten lions killed in Kenya as conflict between humans and wild animals worsens",
    "County with high rate of overdose deaths doesn’t use opioid settlement funds for addiction program",
    "Buckingham Palace releases official coronation portraits",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Americans’ debt surpasses $17 trillion for the first time",
    "Tom Hanks responds to reviews of his debut novel",
    "World’s most beautiful castles"
]