[
    "Influencer weight loss death",
    "King Charles’ official birthday",
    "Julia Nikhinson/AFP/Getty Images",
    "Analysis: Ukraine’s counteroffensive is underway. Here’s what’s happened so far",
    "Putin warns NATO over being drawn into Ukraine war, says Russia has more nuclear weapons",
    "See Russian infantry fighting vehicle captured by Ukrainian forces",
    "African leaders meet with Putin seeking ‘road to peace’",
    "Four alarming charts that show just how extreme the climate is right now",
    "Cyclone Biparjoy makes landfall in India",
    "Activist faces 10 years in jail for fake letter ‘canceling’ oil industry conference",
    "Without climate change, these extreme weather events would not have happened",
    "Heathcliff O'Malley/Pool/AFP/Getty Images\n\n\n\n\n\n•Analysis",
    "Britain’s Covid inquiry has become a political farce",
    "Adrian Dennis/AFP/Getty Images",
    "King Charles III rides on horseback in first official birthday parade",
    "Blinken heads to China vowing to raise ‘real concerns’",
    "This country just raised the age of consent from 13 in a landmark rethink of its sex crime laws",
    "Chinese influencer died after trying to lose 100kg at weight loss boot camps",
    "At least 41 people killed in attack on Ugandan school",
    "Greek migrant boat disaster may be ‘worst ever tragedy’ in Mediterranean sea, EU commissioner says",
    "See what Melania Trump has been up to amid Trump legal battles",
    "Nikki Haley calls husband’s National Guard deployment a ‘moment of pride’",
    "Millions of Americans’ personal data exposed in global hack",
    "Another remarkable hole-in-one at the US Open",
    "AI drive-thrus may be good for business. But not for the rest of us",
    "As a teacher he stopped kids from mixing English and Spanish. Then he had an epiphany",
    "$200 ‘Jeopardy!’ clue stumps guests, stuns viewers",
    "Polish LGBTQ crowds march to demand equal rights as election looms",
    "Michael Ciaglo/Getty Images",
    "How this cheap gadget became the hottest travel accessory",
    "Bayerisches Landesamt für Denkmalpflege",
    "Archaeologists find a 3,000-year-old sword so well preserved it’s still gleaming",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "Eston Parker/ISI Photos/Getty Images",
    "bee32/iStockphoto/Getty Images/iStockphoto",
    "The truth about how often you should wash your hair",
    "The future of medicine may lie in space",
    "RunPhoto/The Image Bank RF/Getty Images",
    "Forget about the AI apocalypse. The real dangers are already here",
    "Chris Hill/Tourism Ireland",
    "Ireland will pay you $90,000 to move to a beautiful island home",
    "David Tipling/Education Images/Universal Images Group/Getty Images",
    "There are dads worse than you — in the animal kingdom",
    "Ross Kinnaird/Getty Images",
    "Phillip Faraone/Getty Images",
    "Kourtney Kardashian announces she’s pregnant at Blink-182 concert",
    "Ocean Exploration Trust / NOAA\n\n\n\n\n\n•Video",
    "Strange fish spotted smiling for cameras",
    "Kylian Mbappé says French president has no influence over his PSG future",
    "Pete Davidson charged with reckless driving after Beverly Hills car crash",
    "Frank Einar Vatne/NTB/AFP/Getty Images/FILE",
    "European gas prices are soaring again. Full tanks should avert a new energy crisis",
    "Why the Fed paused its rate hikes: It’s tired of playing a giant guessing game",
    "Anheuser-Busch is writing checks to distributors as Bud Light sales sink",
    "UPS Teamsters overwhelmingly authorize strike if no deal is reached by August 1",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "He ran out of countries to visit, so he created his own",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "After retiring at 28, ex-tennis star avoided ‘big black hole of depression’",
    "He was one of the world’s top surfers but grew up scared of the ocean",
    "Jean-Sebastien Evrard/AFP/Getty Images",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Miriam Margolyes poses nude for British Vogue",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Environment activists smear red paint on Monet artwork at Stockholm museum",
    "Lupita Nyong’o wows in breastplate cast from a mold of her own body",
    "How a 13-year-old saved her 3 siblings in a snake-infested jungle",
    "Before Trump or Viktor Orban, there was Italy’s Berlusconi",
    "What Germany’s most famous trans woman could teach us about queer joy",
    "A tail of two cities – how Parisians and New Yorkers take on rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Cyclist Gino Mäder dies at 26 after high-speed Tour de Suisse crash",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "How a 3.2-million-year-old human relative named Lucy walked",
    "Key building block of life found on ocean world orbiting Saturn",
    "Early humans left Africa and reached Asia earlier than thought, fossil discovery reveals",
    "Night owls may have unhealthy habits that lead to early death, study says",
    "Why a food addiction many Americans say they struggle with is one experts can’t agree on",
    "Patrick T. Fallon/AFP/Getty Images",
    "Amazon reinstates Alabama warehouse worker and union leader weeks after her firing",
    "Europe is leading the race to regulate AI. Here’s what you need to know",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Micron invests another $600 million in China despite partial sales ban",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’",
    "Video shows the moment after multiple British soldiers collapsed due to extreme heat"
]