[
    "Live Updates: Kyiv activates air defenses as Russia launches new assault",
    "See how Russian state media is showing latest conflict in Ukraine",
    "Key deal aimed at averting global food crisis extended. What you need to know",
    "China woos Central Asia as Ukraine war weakens Russian influence",
    "Michael Kappeler/dpa/picture alliance/AP",
    "From Ukraine war to China’s rising power: 5 reasons why this G7 matters",
    "Biden arrives in Japan for G7 and meets with prime minister",
    "Christiane Amanpour voices dissent over Trump town hall",
    "DeSantis expected to enter 2024 presidential race next week",
    "Selcuk Acar/Anadolu Agency/Getty Images",
    "Prince Harry and Meghan allege ‘near catastrophic’ car chase with paparazzi",
    "Xi Jinping says no to ‘street stall economy’ in Beijing",
    "Thai opposition parties form coalition to take on military establishment",
    "Kim Jong Un and daughter inspect new military spy satellite",
    "Analysis: India’s ruling BJP lost southern stronghold. What does it mean for Modi?",
    "Myanmar junta travel restrictions hold up vital aid to cyclone-hit communities",
    "Billionaire head of UK’s richest family dies at 87",
    "Atlantic Productions/Magellan",
    "‘Largest underwater scanning project in history’ gives never-before-seen view of Titanic",
    "BT to slash up to 55,000 jobs by 2030",
    "Will there be an RSV vaccine this winter? Our medical analyst explains",
    "Deutsche Bank will settle for $75 million with Epstein accusers",
    "Is ‘unstoppable’ Manchester City the best team in the world?",
    "Marjorie Taylor Greene and Jamaal Bowman debate Santos on Capitol steps",
    "Holger Rune beats Novak Djokovic in rainy Italian Open quarterfinal clash",
    "The German couple who moved to Italy and opened a pizza restaurant",
    "Air purification ‘tower’ trialed in one of world’s most polluted cities",
    "Xu Chang/Xinhua/Getty Images",
    "Mexican Olympians avoid auctioning medals as airline steps in to fly them to world championships",
    "From National Center for Missing & Exploited Children",
    "Richard Heathcote/Getty Images",
    "Do men shun household chores? Spain is launching an app to find out",
    "MLB pitcher accidentally hits and kills bird with throw in pregame warm-ups",
    "Minnesota man indicted over theft of ruby slippers from ‘The Wizard of Oz’",
    "These robot sisters want you to fall in love with AI",
    "Neilson Barnard/Getty Images",
    "The most glamorous looks from the Cannes red carpet so far",
    "Kelly Defina//Getty Images/FILE",
    "Nick Kyrgios to miss French Open after injury sustained during robbery, agent says",
    "13 of Japan’s most stunning castles",
    "Roseberys Fine Art Auctioneers & Valuers",
    "These vases sold for $25 at a thrift store. They were worth almost 3,000 times as much",
    "Anthony Wallace/AFP/Getty Images",
    "Gordon Ramsay videos helped this Olympian learn to live with bipolar disorder",
    "UK climber sets record for most Mount Everest summits by a non-Nepali",
    "A young football fan’s phone was stolen at a match. Then this happened",
    "The Asahi Shimbun/Getty Images",
    "Warren Buffett’s Berkshire Hathaway sells entire stake in TSMC",
    "Markets prep for a busy day with banking testimony, housing data and retail sales",
    "US Virgin Islands subpoenas Elon Musk as part of lawsuit into Jeffrey Epstein sex trafficking ring",
    "3M chief business officer fired for inappropriate conduct",
    "Biden administration to buy 3 million barrels of oil to begin replenishing emergency oil stockpile",
    "Airline reveals price of new economy class sleep pods",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Italy’s Friuli region is one of Europe’s best kept secrets",
    "They wanted a house in Italy and bought a castle",
    "Italian food: Classic dishes everyone needs to try",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "Goalkeeper scores from inside his own penalty area in wild ending to Mexican soccer match",
    "Pitch invasion mars Barcelona’s La Liga title celebration",
    "How Erling Haaland brought new dimension to Treble-chasing Manchester City",
    "Why this centuries-old schoolboy match caused division and debate in England",
    "Portrait of the lives of Faroe Islands’ unmarried men",
    "Controversial jewelry collection fetches a record-shattering $196 million",
    "See inside Chanel’s Los Angeles catwalk show",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Notable legal clouds that continue to hang over Donald Trump in 2023",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Megan Jacobs/University of Portsmouth",
    "Size of a Jurassic sea giant found due to fossil discovery, study says",
    "Human DNA can now be pulled from thin air",
    "How much you exercise may impact flu and pneumonia risk, study shows",
    "Trying to lose weight? Avoid sugar substitutes, WHO says",
    "Webb telescope spots water in rare comet",
    "Justin Sullivan/Getty Images",
    "Amazon is changing its deliveries behind the scenes to cut shipping times",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "Apparent cyberattack forces Philadelphia Inquirer office to close ahead of mayoral primary",
    "EU approves Microsoft’s deal to buy Activision Blizzard",
    "The agony and ecstasy of scoring last-minute face value Taylor Swift tickets",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Teacher feared dead after shark attack off South Australia",
    "Biden picks cancer surgeon Monica Bertagnolli to be next NIH director",
    "Robert De Niro welcomes his 7th child at 79",
    "Ten lions killed in Kenya as conflict between humans and wild animals worsens",
    "County with high rate of overdose deaths doesn’t use opioid settlement funds for addiction program",
    "Buckingham Palace releases official coronation portraits",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Americans’ debt surpasses $17 trillion for the first time",
    "Tom Hanks responds to reviews of his debut novel",
    "World’s most beautiful castles"
]