[
    "68th Separate Hunting Brigade 'Oleksy Dovbusha'/Handout/Reuters\n\n\n\n\n\n•Live Updates",
    "Ukraine loses 16 US-made armored vehicles, group says",
    "Zelensky signaled Ukraine’s counteroffensive underway. Here’s what to expect",
    "Ukrainian soldier raises flag in newly liberated village",
    "Silvio Berlusconi, Italy’s former showman leader, dies at 86",
    "A master salesman with an ‘il signore’ persona, Berlusconi understood Italy",
    "Saul Loeb/AFP/Getty Images/FILE\n\n\n\n\n\n•Live Updates",
    "Trump expected to travel to Miami today ahead of court appearance",
    "Analysis: Trump case is test for justice system he wants to dismantle",
    "Trump supporters asked what they thought of indictment",
    "JPMorgan settles with Epstein victims",
    "Australia’s intense flu season could be a signal of what’s to come in the US",
    "Section of major US highway that collapsed to be closed for months",
    "What the children stranded in Amazon jungle for 40 days ate to stay alive",
    "11-year-old British girl shot dead in France over apparent land dispute",
    "WSJ: George Soros hands control of charitable and political activities to son",
    "Bear walks onto busy Florida beach",
    "Airline defends flight attendant weight restrictions after backlash",
    "Goldman Sachs cuts oil price forecast by almost 10%",
    "China records fewest marriages in more than three decades",
    "Ex-Samsung exec charged over alleged plans to build copycat chip factory",
    "Watch: Vegas police respond to report of ‘10-foot creature’ in yard",
    "Antonello Nusca/Polaris/Newscom",
    "‘World’s smallest’ restaurant has one table. Here’s what it’s like",
    "Bear walks out of ocean onto a crowded beach",
    "Josh Edelson/AFP/Getty Images",
    "People missing out on job opportunities on Facebook because of gender, research suggests",
    "Eduardo Munoz Alvarez/VIEWpress/Getty Images",
    "Golfer mistakenly tackled by security on 18th green",
    "Charism Sayat/AFP/Getty Images",
    "Thousands evacuated in Philippines as volcano spews lava and sulfuric gas",
    "Timothy A. Clary/AFP/Getty Images",
    "The AI boom is here. Is it too late to invest?",
    "Woman crafts over 400 clay heads to demonstrate a disturbing statistic",
    "EMMANUEL DUNAND/AFP via Getty Images",
    "Omega says ex-employees responsible for $3 million fake Speedmaster watch",
    "BTS at 10: From wannabe bad-boys to clean-cut pinups",
    "Joe Murphy/NBAE/Getty Images",
    "Conor McGregor sends Miami Heat mascot to hospital",
    "Forget the influencers. Here come the ‘deinfluencers’",
    "Frédéric Le Floc'h/DPPI/Shutterstock",
    "Le Mans 24 Hours: Ferrari wins prestigious endurance race after 50-year absence",
    "CNN anchor bids farewell on his last day of show",
    "Christopher Dilts/Bloomberg/Getty Images",
    "A massive UPS strike could devastate the economy. It could be just eight weeks away",
    "The Fed meets this week. What can investors expect?",
    "Manufacturing is sputtering in the world’s largest economies",
    "Hazardous air quality leaves some workers gasping for help",
    "Silicon Valley escalates the battle over returning to the office",
    "Republic of Slowjamastan Ministry of Communications",
    "He ran out of countries to visit, so he created his own",
    "The double-decker airplane seat is back. Here’s what it looks like now",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "She got a job on a superyacht. Here’s what happened next",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Jeff Bottari/Zuffa LLC/Getty Images",
    "Nunes retains bantamweight belt, calls time on glittering career",
    "He one of the world’s top surfers but grew up scared of the ocean",
    "A photo that dispels stereotypes of Hong Kong’s lawless ‘Walled City’",
    "‘Never Have I Ever’ comes to an end. For the show’s stars, it was the ‘ride of a lifetime’",
    "Pete Davidson shows up to ‘Transformers’ premiere in a tracksuit",
    "Roman obsession with hairlessness revealed as more than 50 pairs of tweezers discovered in Britain",
    "Nostalgic photos evoke the ‘golden age’ of American arcades",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Breaking with Trump and DeSantis, Haley made case for Ukraine in CNN town hall",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "imageBROKER/Alamy Stock Photo",
    "A crocodile in Costa Rica had a virgin birth. Here’s what that means",
    "What you should know about flesh-eating bacteria on beaches",
    "Astronauts’ brains take a hit during long spaceflights",
    "Rare dinosaur named for two-faced Roman god",
    "Study: Multiple insomnia symptoms raise stroke risk in people under 50",
    "What the chaos at Twitter means for the future of social movements",
    "Apple is determined to make headsets cool",
    "‘Smartification’ is the next frontier in China’s EV race, says Xpeng president",
    "Tesla stock charges upwards on deal with GM",
    "The future of flying cars may be closer than you think",
    "Mark Zuckerberg has thoughts on Apple’s new mixed reality headset",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Courtesy Adrien Giret\n\n\n\n\n\n•Gallery",
    "Architects are planning for a flooded future",
    "An abandoned airport is becoming Europe’s biggest coastal park",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]