[
    "Paul Natkin/Archive Photos/Getty Images",
    "Tributes pour in for Tina Turner: ‘You’re simply the best’",
    "See the music and moments that made Tina Turner a legend",
    "Wagner chief warns Russians could revolt if casualties in Ukraine continue to mount",
    "Live Updates: Russia vows to respond ‘extremely harshly’ to future incursions",
    "Video shows Russian civilians taking ‘matters into their own hands’",
    "Florida Gov. Ron DeSantis files to run for president in 2024",
    "CNN Poll: Trump leads 2024 Republican primary field",
    "Opinion: DeSantis has a good plan to dethrone Trump",
    "Man with paralysis walks naturally after brain, spine implants",
    "Erdogan poised to keep leading an increasingly polarized Turkey",
    "95-year-old tasered in Australian nursing home dies",
    "India emerges as key player in global order as Australia welcomes Modi",
    "Germany conducts nationwide raids against climate activists",
    "Typhoon Mawar ‘will be remembered for decades’, weather service says",
    "Cathay Pacific fires cabin crew over alleged discrimination against passenger",
    "Pro-Ukraine protester covers herself in fake blood on the Cannes red carpet",
    "Courtesy National Park Service",
    "Yellowstone National Park euthanizes bison calf after encounter with a visitor",
    "Vinícius Jr. has red card overturned after suffering racist abuse by fans",
    "This animal was declared extinct in India over 60 years ago. It might be back",
    "This is how much Netflix is charging to share your password",
    "A father and son will go to prison for a $20 million lottery scheme",
    "These little-known towns are some of Med’s loveliest spots",
    "In a new BMW sedan, drivers can change lanes using just their eyes",
    "Dua Lipa’s new collection for Versace is a Barbie fantasy",
    "Thomas Barwick/Digital Vision/Getty Images",
    "Kristy Sparow/Getty Images",
    "Laurence Mouton/PhotoAlto/Getty Images/FILE",
    "Can a daily multivitamin slow cognitive aging? Maybe",
    "Jorgen Ree Wiig/Norwegian Directorate of Fisheries/Sea Surveillance Service",
    "Norway warns people to keep away from ‘spy’ whale for animal’s safety",
    "Johannes Simon/Getty Images",
    "Hitler’s Austrian birthplace to become human rights training center",
    "Saturn’s iconic rings are disappearing",
    "Christophe Simon/AFP/Getty Images",
    "Ukrainian influencer protests the war with fake blood at Cannes Film Festival",
    "Sword of Indian ruler slain by British sells for more than $17 million at auction",
    "Margot Robbie gave Ryan Gosling a ‘Barbie’ gift every day of filming",
    "Why a Michael Jordan text is the biggest surprise yet for sport’s new hero",
    "‘City slicker’ weather guy can’t stop gagging on farm",
    "John Coletti/The Image Bank RF/Getty Images",
    "This underrated capital is far more than just the gateway to an acclaimed archipelago",
    "Will the debt ceiling debate finish the Fed’s inflation fight?",
    "UK inflation surprises for all the wrong reasons",
    "‘Go to hell, Shell.’ Climate protests disrupt oil company’s shareholder meeting",
    "Target removing some LGBTQ merchandise following customer backlash",
    "Former Fed Chair Bernanke argues economy must slow further to bring down inflation",
    "Reinhard Hörmandinger/AFP/Getty Images",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "A Maldives destination like no other",
    "Airline reveals price of new economy class sleep pods",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Michael Steele/Getty Images",
    "Vinícius Jr. is being racially abused during LaLiga matches. Why is nobody being punished?",
    "Liverpool great in tears after final match at Anfield",
    "Brittney Griner embraces Vice President Kamala Harris",
    "Manchester City wins Premier League title as Arsenal suffers shock loss",
    "Macall Polay/HBO/Warner Bros. Discovery",
    "The mourning dress codes of ‘Succession’",
    "By recreating old photos, these children of immigrants step into their parents’ shoes",
    "Cannes 2023 is a showcase for African cinema",
    "Could these air purification towers tackle India’s pollution problem?",
    "Lego is heading back to the ’80s with a 2,651-piece model ‘Pac-Man’ arcade cabinet",
    "Kurt Cobain’s smashed-up guitar sells for almost $600,000—nearly 10 times the auction estimate",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Saber-toothed predator reveals how unstable life was during ‘the Great Dying’",
    "SpaceX mission carrying former NASA astronaut, three paying customers docks with space station",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "5 healthy habits that are easy to add to your day",
    "Stone Age humans made to-scale plans to build mysterious mega structures",
    "How the technology behind ChatGPT could make mind-reading a reality",
    "Amazon corporate workers plan walkout next week over return-to-office policies",
    "Adobe is adding an AI-powered image generator to Photoshop",
    "Neuroscientists test out brain-reading AI on CNN reporter",
    "Company that allegedly sent billions of robocalls sued by 49 attorneys general",
    "Meta sells Giphy to Shutterstock",
    "Incredible floral explosion transforms African town",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Teacher feared dead after shark attack off South Australia",
    "Biden picks cancer surgeon Monica Bertagnolli to be next NIH director",
    "Robert De Niro welcomes his 7th child at 79",
    "Ten lions killed in Kenya as conflict between humans and wild animals worsens",
    "County with high rate of overdose deaths doesn’t use opioid settlement funds for addiction program",
    "Buckingham Palace releases official coronation portraits",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Americans’ debt surpasses $17 trillion for the first time",
    "Tom Hanks responds to reviews of his debut novel",
    "World’s most beautiful castles"
]