[
    "Chaos and hundreds injured after deadly train collision in India",
    "Rupak De Chowdhuri/ReutersFILE",
    "How India’s population exploded to overtake China’s and what’s next",
    "South Korea Defense Ministry/AP\n\n\n\n\n\n•Analysis",
    "These may be the world’s best warships. And they’re not American",
    "Exclusive: Inside Ukraine’s secretive drone program",
    "Live Updates: Zelensky orders nationwide inspection of bomb shelters after Kyiv deaths",
    "Jim Watson/Pool/AFP/Getty Images",
    "Germany braces for far-left protests after activists are jailed over attacks on neo-Nazis",
    "Why China’s answer to Boeing and Airbus isn’t as ‘homegrown’ as it seems",
    "Two women stabbed to death in mall knife attack that has shocked Hong Kong",
    "This hotel opened its doors in 705 AD. You can still stay there in 2023",
    "Andrew Tate claims he’s a force for good. Others say he spreads a ‘misogynistic rape culture’",
    "Brad Pitt says in legal filing that Angelina Jolie ‘vindictively’ sold winery amid custody battle",
    "17-year-old chess sensation defeats Magnus Carlsen",
    "Iowa building collapse caught on surveillance camera",
    "Investors accuse Elon Musk of driving up Dogecoin price 36,000%, letting it crash",
    "CIA director visited China last month",
    "This is the impact Prince William’s eco-prize is having on the planet",
    "Asian drug cartels operate like ‘they can and will not be stopped’, UN report warns",
    "Finnbarr Webster/Alamy Stock Photo",
    "Why full planes and small seats could be a problem",
    "Steve Jennings/WireImage/Getty Images",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "Franck Fife/AFP/Getty Images",
    "Wang Gang/VCG/Getty Images",
    "Jewel Samad/AFP/Getty Images\n\n\n\n\n\n•Opinion",
    "The world’s biggest youth population has a chilling insight into the future of work",
    "Megalodon tooth necklace spotted in digital scan of Titanic wreck",
    "Stanley Cup Final: How to watch and all you need to know ahead of NHL’s end of season showcase",
    "Secrets of a superyacht chef cooking for the 1%",
    "Iain Masterton/Alamy Stock Photo",
    "International tipping: How to cut through the chaos and confusion",
    "Courtesy Chris Lewis and Kate Barron",
    "This man set off on a 8,700-mile solo hike six years ago. Then things took an unexpected turn",
    "Why fans love this ‘Succession’ star’s latest outfit",
    "From member berries/YouTube",
    "Summer is back, and so is this nostalgic beauty staple",
    "See the moment 14-year-old spelled winning word",
    "Robert De Niro reacts to Al Pacino becoming a father again at 83",
    "Emmanuel Dunand/AFP/Getty Images",
    "Tennis star launches profanity-laced rant at ump over toilet break",
    "How Chick-fil-A became a target for going ‘woke’",
    "In desperate bid for cash, the Treasury is auctioning one-day bills",
    "Hong Kong leads global market rally with best day in three months",
    "Lululemon stock surges after reporting sales growth",
    "Macy’s and Costco sound a warning about the economy",
    "Dare to bare: 20 of the world’s best nude beaches",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "David Beckham’s Inter Miami ‘part ways’ with head coach Phil Neville",
    "Meet ‘the most overlooked superstar in the history of baseball’",
    "How identical twins became tennis’ greatest double act",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Vera Hartmann/13 Photo/Redux",
    "The husband-and-wife forgers who fooled the art market — and made millions",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "The world’s largest architecture exhibition mounts a radical new show",
    "Chinese actor steals spotlight at Cannes in a series of show-stopping looks",
    "Cate Blanchett’s bare feet make the ultimate style statement",
    "By recreating old photos, children of immigrants step into their parents’ shoes",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Top Democrats say Biden should make this year’s ‘craziness’ the last debt limit fight ever",
    "Seth Shostak/SETI Institute",
    "Alien-like message sent to Earth in a test to prepare for the real thing",
    "Webb telescope spies massive plume erupting from Saturn’s moon Enceladus",
    "Boeing mission to send NASA astronauts to space station faces more lengthy delays",
    "Study: Sleep apnea linked to smaller brain volume",
    "The diet that can lower ‘bad’ cholesterol",
    "Eliot Blondet/Pool/Sipa/AP",
    "Elon Musk is accused of insider trading by investors in Dogecoin lawsuit",
    "How to protect yourself from getting hacked, according to a Yale professor",
    "Meta asks office workers to return to in-person work",
    "Twitter’s head of trust and safety says she has resigned",
    "World’s highest building could be surrounded by a giant ring",
    "Mandie Kotze\n\n\n\n\n\n•Gallery",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "@visualsbypreet\n\n\n\n\n\n•Gallery",
    "Photographer captures the unseen side of Dubai",
    "ICON/Bjarke Ingels Group\n\n\n\n\n\n•Gallery",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]