[
    "Live Updates: Ukraine shoots down more than a dozen cruise missiles over Kyiv",
    "Russia scales back Victory Day parade as Putin comes under mounting pressure",
    "CNN on the ground as high-tech Russian missile lands nearby",
    "‘There is trouble’: CNN reporter after Russian oligarch publicly criticizes war",
    "The victims of the Texas outlet mall shooting",
    "‘Like a combat zone:’ Witnesses share harrowing accounts of massacre",
    "Witness recounts scenes at Texas mall shooting",
    "Graphic images of mall shooting spread on Twitter",
    "Canadian diplomat expelled from China in tit–for-tat measure",
    "Vaughn Ridley/Sportsfile/Web Summit/Getty Images",
    "After 1,000 days in China detention, family renews call for release of Australian TV anchor",
    "Trump gets agitated during deposition",
    "Jamie Foxx’s family isn’t sharing his medical diagnosis. Here’s why",
    "Biden is asked why an 82-year-old is best fit for president. Hear his response",
    "Three Islamic Jihad commanders among multiple dead in Israeli strikes on Gaza",
    "Max Verstappen booed in Miami",
    "Explainer: Why has a state in India’s northeast exploded in ethnic unrest?",
    "LinkedIn to cut 716 jobs and shut its China app amid ‘challenging’ climate",
    "Jesse Allen/Robert Simmon/NASA Earth Observatory/AP",
    "Study reveals another major source of melting that could be accelerating sea level rise",
    "Judge limits Trump’s sharing of details from criminal case on social media",
    "Georgia Republican official says he was following orders from Trump lawyers",
    "Seven people remain hospitalized after fatal crash outside Texas migrant shelter",
    "Treasury Secretary Yellen calls business leaders with warning on debt limit",
    "Video shows migrant crossing through barbed wires at US border",
    "Patek Philippe owned by last Chinese emperor could fetch millions",
    "Flying taxi airport to be built ‘in next three years’",
    "Mark Von Holden/Variety/Getty Images",
    "‘They make me vomit’: Richard Dreyfuss on new Oscars diversity rules",
    "Huge US homeless camp to be cleared after neighbors sued",
    "Daniel Leal/WPA Pool/Getty Images",
    "Prince Louis, 5, conducts first royal engagement",
    "NASA/ESA/CSA/A. Pagan/A. Gáspár",
    "Webb telescope spies evidence of hidden planets",
    "Jung Yeon-je/AFP/Getty Images",
    "How this Asian capital became one of the 21st century’s most tantalizing cities",
    "Hugo Burnand/Royal Household 2023/AP",
    "Buckingham Palace releases official coronation portraits",
    "Joana Kruse/Alamy Stock Photo",
    "Weird and wonderful trains that break the rules",
    "Henrique Casinhas/SOPA Images/LightRocket/Getty Images",
    "‘You have to be prepared to die,’ says world record holder for biggest wave ever surfed",
    "‘Glee’ star responds to speculation about Taylor Swift relationship",
    "Tom Cruise pilots ‘Top Gun: Maverick’ plane during MTV Awards acceptance speech",
    "See which British royals made a cameo on American Idol",
    "Bing Guan/Bloomberg/Getty Images",
    "Where the jobs are: These are the industries that are hiring – and firing",
    "No end in sight for the writers strike as talks break off and both sides brace for long standoff",
    "Lulu who? A cult brand takes on the booming culture of ‘dupes’",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "20 of the world’s most delicious rice dishes",
    "Ima Keithel: The world’s largest women-run market",
    "Italy wants to build the world’s longest suspension bridge",
    "Two strangers met while hiking and got engaged three weeks later. Here’s what happened next",
    "Why these ‘super shoes’ are like ‘putting a chairlift up Everest’ for runners",
    "The title win which ends 33 years of heartache since the days of Diego Maradona",
    "From serving drinks to washing cars: Lewis Hamilton on what helped make him a sporting great",
    "Tee-k Tock: The ‘appalling’ slow play controversy riling golf’s biggest stars",
    "How the deaths of 97 fans are used to taunt a soccer club’s supporters with ‘vile’ chants",
    "Justin Shin/Getty Images AsiaPac/Getty Images",
    "Louis Vuitton stages its first major show in South Korea",
    "Jameela Jamil slams Met Gala for celebrating Karl Lagerfeld",
    "Remember when Prince bared his butt at the 1991 VMAs?",
    "World’s first 3D-printed mosque to be built in Dubai",
    "This Y2K pastime is becoming a big hit among South Korean youth",
    "Top secrets come spilling out",
    "A rookie officer ran toward semi-automatic gunfire. It was his job",
    "Why Biden is lying low ahead of 2024",
    "Banning TikTok isn’t just a bad idea. It’s a dangerous one",
    "Signs that we’ve finally reached a tipping point on guns",
    "The revolving door access to state secrets has to end",
    "Spencer Platt/Getty Images",
    "Fact check: Trump’s own campaign can’t find proof for his ‘mental institutions’ immigration story",
    "Biden set to discuss wrongfully detained Americans during White House Correspondents Dinner",
    "Analysis: Why 2024 could be the most boring presidential primary season ever",
    "House Republicans punt on national abortion ban amid fears of 2024 backlash",
    "Klobuchar: Biden should sit down with McCarthy but negotiate on budget, not debt",
    "Virgin Galactic prepared to launch to the edge of space after hiatus",
    "Loaf-size mission launches to improve hurricane forecasting",
    "Ancient DNA from a 25,000-year-old pendant reveals intriguing details about its wearer",
    "Buried treasure, including nearly 200 Roman coins, found in Italy",
    "My grandfather hid the emotional toll of World War II from his family for decades",
    "Gabby Jones/Bloomberg/Getty Images",
    "Despite TikTok ban threat, influencers are flocking to a new app from its parent company",
    "This is Google’s new folding phone",
    "Biden administration unveils an AI plan ahead of meeting with tech CEOs",
    "TV and film writers are fighting to save their jobs from AI. They won’t be the last",
    "Snapchat’s new AI chatbot is already raising alarms among teens and parents",
    "Photographer captures the unseen side of Dubai",
    "Abandoned airport is becoming Europe’s biggest coastal park",
    "The huge monoliths standing in Qatar’s desert",
    "‘The New Big 5’: Wildlife photography book turns the lens on animals at risk",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "Caroline Brehman/EPA-EFE/Shutterstock",
    "After months of speculation, Pharrell Williams takes job at Louis Vuitton"
]