[
    "His victory extends his 20-year dominance of the country’s political landscape",
    "Analysis: This is why Erdogan won again",
    "Erdogan rival Kilicdaroglu vows to continue struggle until there is ‘real democracy’",
    "Russia’s Putin joins chorus of world leaders congratulating Erdogan",
    "In pictures: Turkish President Recep Tayyip Erdogan",
    "Roman Pilipey/Getty Images",
    "Iran will face consequences after Kyiv targeted with Iranian drones, Ukrainian official warns",
    "Russia targets Kyiv with largest drone attack of conflict, killing one",
    "Kent Nishimura/Los Angeles Times/Getty Images",
    "Here’s what’s in the US debt ceiling deal",
    "Breaking News: McCarthy releases bill based on debt ceiling agreement",
    "Analysis: Ron DeSantis has a ‘lovability’ problem",
    "China’s answer to Boeing and Airbus, the C919, takes first commercial flight",
    "Queen’s music catalog could sell for over $1 billion, source says",
    "Lionel Messi breaks Cristiano Ronaldo record as PSG wins historic Ligue 1 title",
    "Indian official drains reservoir to retrieve phone dropped while taking selfie",
    "Biden pushes back on reporter’s question about debt ceiling deal",
    "Dutch police arrest over 1,500 people at Extinction Rebellion protest in The Hague",
    "Christophe Simon/AFP/Getty Images",
    "French film director attacks Macron during Palme d’Or acceptance speech",
    "Too few jobs, too many workers and ‘no plan B’: The time bomb hidden in India’s ‘economic miracle’",
    "Josef Newgarden wins his first Indy 500 in a crash-filled race",
    "Edward James Olmos reveals he had throat cancer",
    "At least 3 killed in shooting at motorcycle rally in New Mexico",
    "Video shows bus driver and passenger in shootout aboard moving bus",
    "Europe is trying to ditch planes for trains. Here’s how that’s going",
    "Venice authorities investigate after canal turns fluorescent green",
    "parasola.net/Alamy Stock Photo",
    "Where to go this summer: A dozen destination ideas",
    "Andrej Isakovic/AFP/Getty Images",
    "Max Verstappen wins Monaco Grand Prix with driving masterclass",
    "It’s been 25 years since Phil Hartman was killed. His comedic work still brings joy",
    "James Blair/NASA /Johnson Space Center",
    "Meet the lunar rover that will venture to the moon’s south pole",
    "Michael Reaves/Getty Images",
    "A 12th horse has died in just two months at this iconic racetrack",
    "How much would you pay for this piece of ’70s nostalgia?",
    "aapsky/iStockphoto/Getty Images",
    "A world in three islands on the Mediterranean",
    "From member berries/YouTube",
    "Summer is back, and so is this nostalgic beauty staple",
    "These women wanted a symbolic expression of self-love. So they married themselves",
    "Boston Celtics on verge of NBA history",
    "See a sunspot larger than planet Earth",
    "‘We are family’: This ballet studio in Egypt welcomes ballerinas with special needs",
    "Justin Sullivan/Getty Images",
    "Why Wall Street cares more about Nvidia than the debt ceiling",
    "World’s biggest investment fund takes on Exxon and Chevron over the climate crisis",
    "Workplace expert explains how CEOs are being dragged into culture wars",
    "JPMorgan is cutting about 1,000 First Republic Bank employees",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "A Maldives destination like no other",
    "Fayez Nureldine/AFP/Getty Images",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Liverpool great in tears after final match at Anfield",
    "Brittney Griner embraces Vice President Kamala Harris",
    "Macall Polay/HBO/Warner Bros. Discovery",
    "The mourning dress codes of ‘Succession’",
    "By recreating old photos, these children of immigrants step into their parents’ shoes",
    "Cannes 2023 is a showcase for African cinema",
    "Could these air purification towers tackle India’s pollution problem?",
    "Lego is heading back to the ’80s with a 2,651-piece model ‘Pac-Man’ arcade cabinet",
    "Kurt Cobain’s smashed-up guitar sells for almost $600,000—nearly 10 times the auction estimate",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Ancient toilets unearthed in Jerusalem reveal a debilitating disease",
    "New unprecedented images reveal what’s happening on the sun",
    "Prediabetes: The younger you are, the higher the risk of dementia",
    "The diet that can lower ‘bad’ cholesterol",
    "New York City is sinking due to its million-plus buildings, study says",
    "Patrick T. Fallon/AFP/Getty Images",
    "Ford partners with Tesla to give customers access to EV Superchargers",
    "Billionaire entrepreneur’s space tourism company pulls off high-stakes crewed test flight",
    "Microsoft leaps into the AI regulation debate, calling for a new US agency and executive order",
    "AI chip boom sends Nvidia’s stock surging after whopper of a quarter",
    "Glitches, echoes and ‘melting the servers’ crash DeSantis’ campaign launch on Twitter",
    "World’s highest building could be surrounded by a giant ring",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]