[
    "Thai voters rebuke military elite",
    "Controversial jewelry fetches $196 million",
    "Ukraine sees first success of Bakhmut offensive, senior military official says",
    "Zelensky: Ukraine needs more time, but ‘not too much,’ before counteroffensive",
    "Russia may have just lost four aircraft in one day",
    "Dramatic video shows Russian soldiers running away from attack",
    "Turkey to have momentous runoff election after Erdogan fails to win outright",
    "Analysis: Why Erdogan’s fate matters to Biden and the US",
    "Turkish lira sinks to new record low",
    "Hear what voters in Turkey think",
    "Athit Perawongmetha/Reuters",
    "Record turnout sees Thai voters rebuke military elite as opposition take decisive lead",
    "See why the ex-coup leader shows soft side ahead of election",
    "Sai Aung Main/AFP/Getty Images",
    "One of the strongest cyclones to ever hit Myanmar cuts coastal area communications",
    "Venezuelan dad made dangerous trek to US to provide for his kids",
    "European Union upgrades outlook for economy as energy prices retreat",
    "Opinion: DeSantis’ remarks on Jordan Neely’s death form a dangerous pattern",
    "Vice Media files for bankruptcy",
    "Teacher feared dead after shark attack off South Australia",
    "China sentences elderly US citizen to life in prison on spying charges",
    "Fareed Zakaria: America might as well be on another planet",
    "They left South Korea for the American Dream. Now their children are moving back",
    "Don’t use sugar substitutes for weight loss, World Health Organization advises",
    "Ex-ByteDance employee claims China had ‘supreme access’ to all data",
    "French soccer club excludes players after they refuse to participate in anti-homophobia campaign",
    "Jason Day pays tribute to late mother after ‘emotional’ PGA Tour victory",
    "Platypus released in Australian national park for the first time in 50 years",
    "This could be the world’s largest ocean restoration project",
    "Controversial jewelry collection fetches a record-shattering $196 million",
    "Eric Lafforgue/Art in All of Us/Corbis News/Getty Images",
    "Jordan Strauss/Invision/AP",
    "The Weeknd is ditching his artistic name for his birth name",
    "Hollandse Hoogte/Shutterstock",
    "Soccer match called off after fans throw fireworks onto the pitch",
    "How Xavi’s defensive revolution brought La Liga title back to FC Barcelona",
    "Travel expert explains the ‘unspoken rights’ for every plane seat",
    "Nepali Sherpa ties Mount Everest climbing record",
    "Patricia de Melo Moreira/AFP/Getty Images",
    "World’s oldest dog lives it up in his 30s",
    "Courtesy Cloud Gate Foundation",
    "Dance that comforted Taiwan during its loneliest hour returns to the stage",
    "Bob Levey/TAS23/Getty Images",
    "‘She wasn’t doing anything’: Taylor Swift defends concertgoer mid-song",
    "Doyle Brunson: ‘The Godfather of Poker’ has died aged 89",
    "Kevin Sinfield carries  former teammate Rob Burrow across marathon finish line",
    "VeselovaElena/iStockphoto/Getty Images",
    "You should make your own salad dressing",
    "Brendan Smialowski/AFP/Getty Images",
    "What happens if the debt ceiling and banking crisis collide?",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "The Fed probably won’t cut rates anytime soon. Why that’s good news for markets",
    "‘Every family should be concerned’ about debt ceiling, consumer watchdog warns",
    "Why America needs regional banks",
    "Adam Friedlander/The New York Times/Redux",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Italy’s Friuli region is one of Europe’s best kept secrets",
    "They wanted a house in Italy and bought a castle",
    "Italian food: Classic dishes everyone needs to try",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "Pitch invasion mars Barcelona’s La Liga title celebration",
    "How Erling Haaland brought new dimension to Treble-chasing Manchester City",
    "Chelsea wins Women’s FA Cup in front of world record crowd",
    "Why this centuries-old schoolboy match caused division and debate in England",
    "Man charged with assault after appearing to shove Premier League manager",
    "New York is getting a new $780 million, 25,000-seat soccer-specific stadium",
    "Lionel Messi booed by some of his own team’s fans on return from suspension",
    "Andrea Gjestvang/GOST Books",
    "Portrait of the lives of Faroe Islands’ unmarried men",
    "See inside Chanel’s Los Angeles catwalk show",
    "Remember when Prince bared his butt at the 1991 VMAs?",
    "World’s first 3D-printed mosque to be built in Dubai",
    "This Y2K pastime is becoming a big hit among South Korean youth",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Notable legal clouds that continue to hang over Donald Trump in 2023",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Oscar Sanisidro/KU Biodiversity Institute/The University of Kansas",
    "How did massive prehistoric ‘thunder beasts’ get super big, super fast?",
    "Scientists have updated the human genome to make it more equitable and inclusive",
    "How the Voyager probes keep going and going decades after launch",
    "SpaceX and startup Vast hope to put the world’s first private space station in orbit",
    "Zillennials: The newest micro-generation has a name",
    "John Shearer/TAS23/Getty Images for TAS Rights Management",
    "The agony and ecstasy of scoring last-minute face value Taylor Swift tickets",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "How Lyft’s new CEO is ‘copying’ his former boss Jeff Bezos to turn around the company",
    "Twitter’s new encrypted message feature criticized by security and privacy experts",
    "The most popular search engine in the world is about to look different",
    "Peloton is recalling 2 million bikes",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "Richard Shotwell/Invision/AP",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Dia Dipasupil/Getty Images",
    "Robert De Niro welcomes his 7th child at 79",
    "Neville Williams/Aston Villa FC/Getty Images",
    "Tom Hanks responds to reviews of his debut novel"
]