[
    "Student attractiveness site",
    "Mykola Tys/AP\n\n\n\n\n\n•Live Updates",
    "Captured Russian soldiers tell of low morale and horrors of trench warfare",
    "CNN Exclusive:\nZelensky wanted counteroffensive to start ‘much earlier’",
    "Tense moments when Russian soldiers surrendered to Ukrainian troops",
    "Drew Angerer/Getty Images\n\n\n\n\n\n•Analysis",
    "Trump’s early dominance should be a warning to America",
    "Haberman details how Trump’s social media posts have changed",
    "Japan will release radioactive water into the ocean. How worried should we be?",
    "‘It won’t be a record for long’: The planet saw its hottest day ever this week – twice",
    "Visual China Group/Getty Images",
    "CoCo Lee, iconic Hong Kong singer and ‘Mulan’ voice actress, dies at 48",
    "Indonesia pulls out of hosting World Beach Games after Israel controversy",
    "Hong Kong police arrest 4 for allegedly aiding dissidents abroad",
    "Video shows Russian jets harassing US drones in Syria",
    "Israel ended a huge military operation in Jenin. Here’s what you need to know",
    "Davide Bonaldo/SOPA Images/Shutterstock",
    "Meta officially launches Twitter rival Threads",
    "Former top TV host diagnosed with Alzheimer’s at age 61",
    "July 4 and 5 are the deadliest days for mass shootings in recent US history",
    "Analysis:\nIndia downplayed key summit, but Putin and Xi might not complain",
    "‘King of gaslighting’: Former Trump supporter says she was ‘brainwashed’",
    "Moderna inks deal to make mRNA medicines in China",
    "This village is unlike anywhere else in the world: there are no men",
    "Wakil Kohsar/AFP/Getty Images",
    "The Taliban is cutting off another lifeline for Afghan women",
    "L.E. Baskow/Las Vegas Review-Journal/AP",
    "This futuristic entertainment venue is the world’s largest spherical structure",
    "Los Angeles County Sheriff's Department",
    "Klaus Vedfelt/Digital Vision/Getty Images",
    "Meet The Spanish King, one of the oldest working models in Europe",
    "Anthony Wallace/AFP/Getty Images",
    "Goodbye child care centers, hello elderly homes for South Korea",
    "Woman records water buffalos loose in neighborhood",
    "PA Images / Alamy Stock Photo",
    "NHS at 75: The birth of free health care in Britain",
    "The saga of the three-year cruise gets a new twist",
    "Al Messerschmidt/Getty Images",
    "Blueberries have joined green beans in this year’s Dirty Dozen list",
    "Walt Disney Pictures\n\n\n\n\n\n•Opinion",
    "Indiana Jones is passing the mantle to Fleabag. Now what?",
    "David Gray/AFP/Getty Images/File",
    "Former tennis world No. 1 announces birth of son",
    "Rare deep-sea creature with engorged belly spotted by submarine",
    "Clive Brunskill/Getty Images",
    "Roger Federer hopes Rafael Nadal ‘can go out on his own terms’",
    "UPS and Teamsters’ marathon talks end without a deal to avoid a strike",
    "The Fed can’t decide how much money US households have left",
    "Riots in France have already cost businesses more than $1 billion",
    "A big change is coming to Subway restaurants today",
    "Christmas Tree Shops is closing all 70 stores",
    "Photosensia/iStockphoto/Getty Images",
    "A beautiful hidden alpine wonderland on the edge of Europe",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "She stuffed a bra with clothes before boarding a plane. Here’s why",
    "The gigantic tunnels and bridges linking Asia to Europe",
    "Clive Brunskill/Getty Images Europe/Getty Images",
    "What Roger Federer did next",
    "The ‘world’s fastest accountant’ is taking track and field by storm",
    "Mystery of North Korean player who stunned the soccer world – then disappeared",
    "Summer transfer window: The biggest moves so far as Saudi Arabia becomes major factor",
    "Ultra runner breaks record of world’s oldest 100-mile race by almost 80 minutes",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Barely visible ‘Louis Vuitton’ handbag sells for over $63,000",
    "Robot takes podium as orchestra conductor in South Korea",
    "Life in limbo: Photographer documents ‘Kafka-esque’ migrant experience",
    "How would Princess Diana have dressed today?",
    "Supermodel Naomi Campbell welcomes her second child",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Lab-grown meat is an expensive distraction from reality",
    "When ‘free speech’ becomes a bully’s free pass",
    "The myth of a colorblind France",
    "I was the most senior Islamic leader to visit Auschwitz. Here’s what I know about peace",
    "The cavalry won’t be coming to rescue you in space",
    "You might want to rethink taking melatonin as a sleep aid",
    "Jose Luis Magana/AP\n\n\n\n\n\n•Analysis",
    "‘Race neutral’ replaces affirmative action. What’s next?",
    "Takeaways from the latest controversial and contentious Supreme Court term",
    "US attorney investigating Hunter Biden defends probe in letter to House Judiciary panel",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Federal judge blocks Biden administration officials from communicating with social media companies",
    "China just played a trump card in the chip war. Are more export curbs coming?",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Meta takes aim at Twitter with new Threads app",
    "Tesla smashed it last quarter but China’s BYD did even better",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Oliver Rossi/Stone RF/Getty Images",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Art-loving Helsinki deputy mayor caught graffitiing the city",
    "At least 48 dead in road accident in western Kenya, officials say",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Migrant who died in ICE custody was held for months, despite recommendation for release, SPLC says",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean"
]