[
    "Murat Kula/Anadolu Agency/Getty Images\n\n\n\n\n\n•Live Updates",
    "CNN Exclusive:\nSending Ukraine cluster munitions a ‘difficult decision’: Biden",
    "Prigozhin’s fate remains unclear and it signals more trouble in Russia",
    "Piroschka van de Wouw/Reuters",
    "Dutch government collapses over immigration policy dispute",
    "Scientists sound the alarm: The world is blasting through climate records",
    "This week’s record-breaking global temperatures are likely highest in ‘at least 100,000 years’",
    "Yellen urges China to back global funds to fight climate change",
    "Global shipping industry climate pledge slammed as a ‘wishy washy’",
    "Idrees Mohammed/EPA-EFE/Shutterstock\n\n\n\n\n\n•Analysis",
    "Meta’s Threads upends social media in less than 48 hours",
    "Cessna jet crashes with at least six on board in California",
    "14 promises Donald Trump has made in his campaign for a second term",
    "At least 11 killed in building collapse in Brazil",
    "When a tourist in Bali gets arrested, this is the woman they call",
    "Retired Maj. Gen. explains the damage cluster munitions can do",
    "Bear attack in British Columbia hospitalizes 21-year-old tree planter",
    "Two men executed in Iran over deadly attack on Shiraz shrine",
    "The future of cruises: Bigger, longer and electric",
    "This is what happens when ChatGPT tries to create crochet patterns",
    "Nail salon robbery goes awry as customers completely ignore demands",
    "Britain’s water industry crisis: Sewage spills, huge leaks and crushing debts",
    "In world’s most pricey property market, homes for the dead can cost more than for the living",
    "She posed by an airplane as a child. Over 20 years later, she recreated the photo with a twist",
    "Francisco Seco/AP\n\n\n\n\n\n•Gallery",
    "Arnold Jerocki/Getty Images",
    "Photosensia/iStockphoto/Getty Images",
    "Bed rotting: TikTok’s latest viral trend reveals the toxic side of self-care",
    "Michelle Wie West sinks 30ft putt for magical ending to her career",
    "Debunking this myth about Baby Boomers also reveals something about Gen Z",
    "Newbie at the nude beach? Here’s what you need to know before you take your towel off",
    "Serhat Cagdas/Anadolu Agency/Getty Images",
    "Real Madrid sign 18-year-old soccer sensation dubbed ‘Turkish Messi’",
    "Research Group ATLAS from University of Sevilla",
    "Ancient regal tomb in Spain belonged to a revered female leader, archaeologists reveal",
    "Mbongeni Buthelezi: The South African artist turning plastic into portraits",
    "Emma Stone is at the center of rumors about a new ‘from the vault’ Taylor Swift song",
    "HELLE ARENSBAK/AFP via Getty Images",
    "Concert season is so weird right now",
    "Lucas Peltier/USA Today Sports/Reuters",
    "‘I didn’t know what I was doing,’ says Victor Wembanyama after Spurs debut",
    "Conan O'Brien Needs a Friend\n\n\n\n\n\n•Video",
    "‘You can’t f*cking remember that?’ Harrison Ford mocks Conan O’Brien about iconic role",
    "Qilai Shen/Bloomberg/Getty Images",
    "China fines Jack Ma’s Ant Group nearly $1 billion",
    "The US economy can’t function smoothly without UPS. That’s why a strike will hurt",
    "Some investors are shunning Wall Street’s tech frenzy",
    "China’s export curbs on raw materials are concerning, Yellen says on Beijing trip",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "She stuffed a bra with clothes before boarding a plane. Here’s why",
    "Marcelo Hernandez/Getty Images South America/Getty Images",
    "Soccer players and fans left perplexed after ball crosses the line … but no goal is awarded",
    "What Roger Federer did next",
    "The ‘world’s fastest accountant’ is taking track and field by storm",
    "Mystery of North Korean player who stunned the soccer world – then disappeared",
    "Summer transfer window: The biggest moves so far as Saudi Arabia becomes major factor",
    "Mattel; Chung Sung-Jun/Getty Images",
    "Margot Robbie isn’t breaking character with her Barbie press looks",
    "Gabriela Hearst to step down as creative director of Chloé",
    "Blue body paint and beaded jeans: The top moments from Paris Haute Couture Week",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Mikhail Tereshchenko/Sputnik/AFP/Getty Images/FILE",
    "Putin faces a challenging task that threatens his power",
    "Whatever happened to Mutually Assured Destruction?",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Trump’s enthusiasm for bringing back Michael Flynn is a revealing sign",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Anna Moneymaker/Getty Images",
    "Rep. Alexandria Ocasio-Cortez supports Biden’s reelection bid",
    "DOJ has spent over $9 million investigating Trump since special counsel was appointed",
    "Biden wants to roll back Trump’s expansion of short-term health insurance plans",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Samsung flags massive drop in quarterly profit as chip glut drags on",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "A flying car prototype just got an airworthiness certificate from the FAA",
    "Meta officially launches Twitter rival Threads. 30 million have joined already",
    "With Twitter in chaos, Mark Zuckerberg looks to pounce",
    "Levon Biss/American Museum of Natural History",
    "Extraordinary close-up images show insects as you’ve never seen them before",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Jean-Christophe Verhaegen/AFP/Getty Images",
    "These animals went extinct in the wild. Scientists brought them back",
    "The icy patience of an Arctic photographer",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Rescuers free dozens trapped on one of world’s highest cable car systems",
    "Art-loving Helsinki deputy mayor caught graffitiing the city",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise",
    "Explosion at chemical factory in China",
    "Migrant who died in ICE custody was held for months, despite recommendation for release, SPLC says",
    "Amy Schumer surprises cast of ‘Joy Ride,’ praises their film as the ‘comedy of the summer’"
]