[
    "Controversial Madonna photos",
    "Uptick in fighting reported along border between Kharkiv and Luhansk regions in eastern Ukraine",
    "Dramatic video shows Russian soldiers running away from attack",
    "Opinion: What Trump gets right on Ukraine",
    "Polls open in Turkey’s fiercely fought elections that could unseat Erdogan",
    "Explainer: Everything you need to know about Turkey’s elections",
    "Andre Malerba/Bloomberg/Getty Images",
    "Thai opposition take on kingdom’s conservative cliques as voting begins",
    "Thailand’s ‘lost generation’ youth yearn for change",
    "Anthony Devlin/Getty Images",
    "Sweden wins Eurovision after emotional show in Britain that celebrated Ukraine",
    "Bangladesh and Myanmar brace as cyclone intensifies",
    "Israel and Islamic Jihad agree to a ceasefire after days of violence",
    "A law that cancels cancel culture? This country is considering it",
    "Chinese warships sail around Japan",
    "Israel Defense Forces apologizes for death of Shireen Abu Akleh on live TV",
    "Papua New Guinea foreign minister resigns over coronation travel cost controversy",
    "US Embassy in Beirut/Twitter",
    "A massive new US embassy complex in a tiny country is raising eyebrows",
    "One of Africa’s oldest lions killed in Kenya, conservationists say",
    "Why this centuries-old schoolboy match caused division and debate in England",
    "A brilliant LeBron James leads Lakers to series win over Warriors",
    "Bobi, the world’s oldest dog, celebrates 31st birthday",
    "Road crew discovers a surprise creature in a Florida storm pipe",
    "Martin Valigursky/Adobe Stock",
    "The 23 best destinations to visit in 2023",
    "Courtesy Cloud Gate Foundation",
    "What this sold-out dance says about Taiwan’s cultural identity",
    "Justin Setterfield/Getty Images",
    "He suffered a cardiac arrest in 2021. What this 31-year-old has learned about life since",
    "Hugo Burnand/Royal Household 2023/AP",
    "New coronation day portraits of King Charles and Queen Camilla released",
    "Cosmic explosion is 100 times brighter than all the stars in the Milky Way combined",
    "Jose Mourinho is having a moment",
    "How astronauts overcome the challenges of sleeping in space",
    "Germany National Tourism Board",
    "21 of the world’s most stunning castles",
    "These Asian fusion cuisines tell an American story",
    "Catherine Ivill/Getty Images Europe/Getty Images",
    "Why Norway star ‘will be the best player on this planet’",
    "John Shearer/TAS23/Getty Images for TAS Rights Management",
    "The agony and ecstasy of scoring last-minute face value Taylor Swift tickets",
    "Fifth grader stuns internet with spirited piano performance",
    "Lobsters! Saunas! Smoothies! A complete guide to Eurovision",
    "Leonardo Munoz/VIEWpress/Corbis News/Getty Images",
    "Why current US recession warnings are unlike all the others",
    "The real reasons stores are closing in big cities",
    "JPMorgan Chase CEO Jamie Dimon says Trump doesn’t understand the debt ceiling",
    "Here’s how we know a US default would be an economic disaster",
    "Italian pasta prices are soaring. Rome is in crisis talks with producers",
    "Moritz Klingenstein/Adobe Stock",
    "Italy’s Friuli region is one of Europe’s best kept secrets",
    "Flight attendants share their air travel secrets",
    "They wanted a house in Italy and bought a castle",
    "Italian food: Classic dishes everyone needs to try",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "Glyn Kirk/AFP/Getty Images",
    "Why this centuries-old schoolboy match has been the cause of division and debate in England",
    "Why Erling Haaland will become ‘the best player on the planet’",
    "New York is getting a new $780 million, 25,000-seat soccer-specific stadium",
    "Why these ‘super shoes’ are like ‘putting a chairlift up Everest’ for runners",
    "Andrea Gjestvang/GOST Books",
    "Portrait of the lives of Faroe Islands’ unmarried men",
    "See inside Chanel’s Los Angeles catwalk show",
    "Remember when Prince bared his butt at the 1991 VMAs?",
    "World’s first 3D-printed mosque to be built in Dubai",
    "This Y2K pastime is becoming a big hit among South Korean youth",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Notable legal clouds that continue to hang over Donald Trump in 2023",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "US ambassador to Israel expected to depart post this summer, sources say",
    "Top officials meet in highest US-China engagement since spy balloon incident",
    "Oscar Sanisidro/KU Biodiversity Institute/The University of Kansas",
    "How did massive prehistoric ‘thunder beasts’ get super big, super fast?",
    "Scientists have updated the human genome to make it more equitable and inclusive",
    "How the Voyager probes keep going and going decades after launch",
    "SpaceX and startup Vast hope to put the world’s first private space station in orbit",
    "Zillennials: The newest micro-generation has a name",
    "Marlena Sloss/Bloomberg/Getty Images",
    "Elon Musk says he’s found a new CEO for Twitter",
    "AI-powered drones: Can anything stop a global AI arms race?",
    "Peloton is recalling 2 million bikes",
    "AI investor explains how this new technology could revolutionize how we watch television",
    "OpenAI CEO Sam Altman to testify before Congress",
    "A foldable phone, new tablet and lots of AI: What Google unveiled at its big developer event",
    "Graphic images of Texas mall shooting spread on Twitter, rekindling debate on how much to share",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "Richard Shotwell/Invision/AP",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Dia Dipasupil/Getty Images",
    "Robert De Niro welcomes his 7th child at 79",
    "Neville Williams/Aston Villa FC/Getty Images",
    "Tom Hanks responds to reviews of his debut novel"
]