[
    "Influencer weight loss death",
    "Inna Varenytsia/Reuters\n\n\n\n\n\n•Live Updates",
    "The humanitarian impact of the dam breach in Ukraine",
    "African leaders meet with Putin seeking ‘road to peace’",
    "Putin warns NATO over being drawn into Ukraine war, says Russia has more nuclear weapons",
    "Opinion: What should we make of Ukraine’s setbacks in its counteroffensive?",
    "John Thys/AFP/Getty Images",
    "Blinken begins high-stakes talks in China amid rising tensions",
    "What to expect from Blinken’s visit",
    "Kathleen Folbigg: Mother who served 20 years for killing her four babies pardoned",
    "Ryan Quek/Singapore Police Force",
    "‘Like something out of Black Mirror’: Police robots go on patrol at this airport in Asia",
    "‘Fruits, seeds and water’ were pivotal in keeping four children alive in the Amazon",
    "‘Extratropical cyclone’ in South Brazil leaves 11 dead",
    "Patients left to wait by Britain’s public health service turn to crowdfunding",
    "Conway makes a prediction on whether Trump will go to jail",
    "Ship carrying 120 catches fire off Philippines",
    "American tourists attacked in Germany identified as graduates from Illinois",
    "Opinion: Why I flew to Jamaica to take magic mushrooms … on camera",
    "Three arrested including 14-year-old as police foil attack on Vienna’s pride parade",
    "Romeo Beckham signs one-year contract with Premier League club Brentford",
    "Opinion: Trump, the hoarder in chief",
    "1 dead, at least 20 hurt in a shooting at a Juneteenth celebration in Illinois",
    "Golfer’s tee shot remarkably lands in ball holder of golf cart at US Open",
    "What you need to know about Black dads, from Black dads",
    "Man is accused of living with the dead body of a relative for days",
    "Bill Nye breaks down ‘extraordinary discovery’ found on moon of Saturn",
    "Andrew Redington/Getty Images",
    "Rickie Fowler’s agonizing finish sees Wyndham Clark take share of US Open lead into final round",
    "Michael Ciaglo/Getty Images",
    "How this cheap gadget became the hottest travel accessory",
    "Valeria Blanc/E+/Getty Images",
    "Michael Nagle/Bloomberg/Getty Images",
    "As America celebrates Juneteenth, it’s time to get rid of these three myths about slavery",
    "Rafael Henrique/SOPA Images/LightRocket/Getty Images",
    "How a failed Tumblr convention became one of the most important social media lessons of the 2010s",
    "bee32/iStockphoto/Getty Images/iStockphoto",
    "The truth about how often you should wash your hair",
    "Watch the flypast over Buckingham Palace for King Charles III’s birthday",
    "The demo tape that launched Prince’s legendary career is now up for auction",
    "Chris Hill/Tourism Ireland",
    "Ireland will pay you $90,000 to move to a beautiful island home",
    "David Tipling/Education Images/Universal Images Group/Getty Images",
    "There are dads worse than you — in the animal kingdom",
    "Remembering Sally Ride — 40 years after she shattered the glass ceiling on the way to space",
    "Kylian Mbappé: What next for French superstar as questions over his PSG future rumble on?",
    "A winning combination: Man who played same lottery numbers for a decade finally nets a big payday",
    "Petty Officer 2nd Diolanda Caballero\n\n\n\n\n\n•Video",
    "A dog fell 300 feet off a cliff. See what happened next",
    "Frank Einar Vatne/NTB/AFP/Getty Images/FILE",
    "European gas prices are soaring again. Full tanks should avert a new energy crisis",
    "Forget about the AI apocalypse. The real dangers are already here",
    "Why the Fed paused its rate hikes: It’s tired of playing a giant guessing game",
    "Anheuser-Busch is writing checks to distributors as Bud Light sales sink",
    "UPS Teamsters overwhelmingly authorize strike if no deal is reached by August 1",
    "Tuul & Bruno Morandi/Digital Vision/Getty Images",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Europe’s ‘crazy’ tourism summer has already started. And it’s going to get much worse",
    "He ran out of countries to visit, so he created his own",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "These women travelled across Europe with nothing but a ‘plank of wood and four wheels’",
    "After retiring at 28, ex-tennis star avoided ‘big black hole of depression’",
    "He was one of the world’s top surfers but grew up scared of the ocean",
    "Jean-Sebastien Evrard/AFP/Getty Images",
    "The only skyscraper in Paris is about to turn 50, and many Parisians still hate it",
    "Miriam Margolyes poses nude for British Vogue",
    "These joyful photographs of Scouts show a sense of belonging and freedom",
    "Environment activists smear red paint on Monet artwork at Stockholm museum",
    "Lupita Nyong’o wows in breastplate cast from a mold of her own body",
    "How a 13-year-old saved her 3 siblings in a snake-infested jungle",
    "Before Trump or Viktor Orban, there was Italy’s Berlusconi",
    "What Germany’s most famous trans woman could teach us about queer joy",
    "A tail of two cities – how Parisians and New Yorkers take on rats",
    "Steve Marcus/Reuters\n\n\n\n\n\n•KFile",
    "Trump repeatedly celebrated the inclusion of transgender women in his beauty pageant",
    "Biden says the gun safety movement has reached a ‘tipping point’",
    "Rep. Finstad staffer attacked at gunpoint after Congressional Baseball Game",
    "Cyclist Gino Mäder dies at 26 after high-speed Tour de Suisse crash",
    "Biden taps Dr. Mandy Cohen for top role as next CDC director",
    "How a 3.2-million-year-old human relative named Lucy walked",
    "Key building block of life found on ocean world orbiting Saturn",
    "Early humans left Africa and reached Asia earlier than thought, fossil discovery reveals",
    "Night owls may have unhealthy habits that lead to early death, study says",
    "Why a food addiction many Americans say they struggle with is one experts can’t agree on",
    "Patrick T. Fallon/AFP/Getty Images",
    "Amazon reinstates Alabama warehouse worker and union leader weeks after her firing",
    "Europe is leading the race to regulate AI. Here’s what you need to know",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Micron invests another $600 million in China despite partial sales ban",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Why a map in India’s new Parliament is making its neighbors nervous",
    "This woman fell on the treadmill at the gym. What happened next will stun you",
    "Children found after 40 days in Amazon survived by eating ‘cassava flour’",
    "Video shows the moment after multiple British soldiers collapsed due to extreme heat"
]