[
    "Italy tourist boat capsizes",
    "Russia ‘changes tactics’ and hits Kyiv with daytime missile attack",
    "See moment Ukrainian forces down a Russian Shahed drone",
    "Satellite photos show where Iran might be sending weapons to Russia",
    "Erdogan survived the biggest test of his political career. What’s next?",
    "Turkish lira hits new record low after Erdogan election victory",
    "Analysis: Why Erdogan won again",
    "Biden and McCarthy lean on holdouts in both parties to pass US debt ceiling deal",
    "Biden pushes back on reporter’s question about debt ceiling deal",
    "Arun Thakur/AFP/Getty Images",
    "India’s top female wrestlers detained on march as Modi inaugurates new Parliament",
    "Spanish PM calls snap elections",
    "Expert has theory about why killer whales are sinking boats",
    "Ugandan president signs one of world’s harshest anti-LGBTQ bills into law",
    "Four dead after tourist boat capsizes in Italy’s Lake Maggiore",
    "Analysis: China says it wants peace in Ukraine, but is it only on Russia’s terms?",
    "One of China’s biggest cities is so cash-strapped it’s calling in debts",
    "Video shows bus driver and passenger in shootout aboard moving bus",
    "Melbourne rocked by largest earthquake in more than 120 years",
    "Return of giant panda Ya Ya sparks outpouring of Chinese nationalism online",
    "How to pick the perfect watermelon in 3 easy steps",
    "Crowd boos after Ukrainian tennis player snubs Belarusian opponent",
    "Nearly 1.4 million people displaced in Sudan since civil war erupted: UN report",
    "Official drains 2 million liters of water from reservoir to retrieve phone",
    "Analysis: DeSantis’ ‘lovability’ problem",
    "How identical twins became tennis’ greatest double act",
    "Private jets have an image problem. Can this company solve it?",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Police call ‘urgent meeting’ after Venice canal turns fluorescent green",
    "Marvellous Durowaiye/Reuters",
    "RuslanDashinsky/iStockphoto/Getty Images",
    "Nicolas Economou/NurPhoto/Getty Images",
    "Airline stops selling emergency exit seats after man allegedly opened door during flight",
    "Golfer overcomes ball traveling in stream for seven minutes to win first title in 8 years",
    "It’s been 25 years since Phil Hartman was killed. His comedic work still brings joy",
    "Dennis Bresser/Soccrates/Getty Images",
    "Ajax player apologizes after appearing to strike a fan",
    "Mladen Antonov/AFP/Getty Images",
    "International tipping: What you need to know",
    "Angela Weiss/AFP/Getty Images",
    "Billie Eilish hits back at criticism over her more feminine fashion choices",
    "Cedric Ribeiro/Getty Images Europe/Getty Images for Art Dubai",
    "Just what is phygital art, and why is Dubai going big on it?",
    "Amr Abdallah Dalsh/Reuters",
    "Ancient tombs and large mummification workshops unearthed in Egypt",
    "From member berries/YouTube",
    "Summer is back, and so is this nostalgic beauty staple",
    "Justin Setterfield/Getty Images",
    "Mauricio Pochettino named next Chelsea head coach",
    "See a sunspot larger than planet Earth",
    "Here’s what’s open and closed on Memorial Day 2023",
    "State Farm stops home insurance sales in California, citing wildfire risks",
    "Why does Wall Street expect a rate hike in June?",
    "These little-know towns are some of the Med’s loveliest spots",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "A Maldives destination like no other",
    "Fayez Nureldine/AFP/Getty Images",
    "Cristiano Ronaldo’s ‘Sajdah’ goal celebration goes viral",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Liverpool great in tears after final match at Anfield",
    "Brittney Griner embraces Vice President Kamala Harris",
    "Cate Blanchett’s bare feet make the ultimate style statement",
    "The mourning dress codes of ‘Succession’",
    "By recreating old photos, children of immigrants step into their parents’ shoes",
    "Could these air purification towers tackle India’s pollution problem?",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Ancient toilets unearthed in Jerusalem reveal a debilitating disease",
    "New unprecedented images reveal what’s happening on the sun",
    "Prediabetes: The younger you are, the higher the risk of dementia",
    "The diet that can lower ‘bad’ cholesterol",
    "New York City is sinking due to its million-plus buildings, study says",
    "Silas Stein/picture alliance/Getty Images",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "Microsoft executive calls for faster AI regulation",
    "Dutch watchdog looking into alleged Tesla data breach",
    "Ford partners with Tesla to give customers access to EV Superchargers",
    "Twitter debuts a mid-tier data access plan, to almost immediate backlash",
    "Billionaire entrepreneur’s space tourism company pulls off high-stakes crewed test flight",
    "World’s highest building could be surrounded by a giant ring",
    "Incredible floral explosion transforms African town",
    "This city could get a 93-kilometer indoor super highway",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]