[
    "Beautiful homeless shelter",
    "Jeff Swensen/Getty Images\n\n\n\n\n\n•CNN Exclusive",
    "Live Updates: Why Trump is being charged in Miami, not Washington, DC",
    "Trump's response: See what Trump posted on Truth Social",
    "Analysis: Twice-impeached Trump faces second criminal indictment",
    "Explained: Presidential historian on why indictment is ‘a seismic moment’",
    "Iryna Rybakova/AP\n\n\n\n\n\n•Live Updates",
    "Ukraine: Eastern front still ‘epicenter’ of fighting",
    "Is a Ukrainian offensive underway south of Zaporizhzhia?",
    "See Russia’s aerial footage allegedly targeting Ukraine",
    "Key theories on what caused Ukraine’s catastrophic dam collapse",
    "James MacDonald/Bloomberg/Getty Images",
    "Smoke from Canada’s wildfires has reached Europe",
    "Before-and-after images of US landmarks inundated with smoke",
    "Atta Kenare/AFP/Getty Images",
    "Iran has a new hypersonic missile. Here’s what that means for the Middle East",
    "Man sitting next to passenger who opened plane door on flight speaks out",
    "Julian Assange loses latest attempt to appeal against extradition to the US",
    "Saudi Arabia and US announce Sudan 24-hour ceasefire",
    "OpenAI CEO calls for global cooperation to regulate AI",
    "China’s first homegrown large cruise ship undocks in Shanghai",
    "Mysterious Covid lineages in US sewers could offer clues to chronic infections",
    "Shark attack in Egypt kills Russian citizen",
    "Stringer/AFP/Getty Images\n\n\n\n\n\n•Analysis",
    "People in China are so worried about the economy they’re asking for divine intervention",
    "China to clamp down on AirDrop and Bluetooth file sharing",
    "Woman crafts over 400 clay heads to demonstrate a disturbing statistic",
    "Multi-year international study finds anti-aging properties in taurine",
    "10-year-old girl survives more than 24 hours alone in rugged mountains",
    "Why Booker Prize-winning author is mentoring this writer",
    "Republic of Slowjamastan Ministry of Communications",
    "The country where it’s illegal to wear Crocs",
    "Employees of this airline can now wear flat shoes, cornrows and eyeglasses",
    "Courtesy Nishiyama Onsen Keiunkan",
    "This hotel has been in operation since 750. CNN took a look inside",
    "This could be the most beautiful homeless shelter you have ever seen, and it’s getting results",
    "FILIPPO MONTEFORTE/AFP/Getty Images",
    "The soccer match that can be encapsulated in a single word",
    "Kevin Dietsch/Getty Images",
    "Biden and Sunak meet amid a turning point in the Russia-Ukraine war",
    "Belmont Stakes could be in jeopardy as wildfire smoke shrouds US cities",
    "This photo shows a lesser-known side of Kowloon Walled City",
    "Williams sisters invest in Rory McIlroy and Tiger Woods’ new golf competition",
    "Bryan Bedder/Getty Images for Paramount Pictures",
    "Look of the Week: Pete Davidson shows up to ‘Transformers’ premiere in a tracksuit",
    "‘Flying shark’ photo changed this man’s life",
    "Christian Vierig/Getty Images",
    "70 years on, Gucci’s horsebit loafer is still a coveted status symbol",
    "V.Creuze ROV Drassm/UNESCO",
    "Underwater archaeological expedition uncovers historical shipwrecks in the Mediterranean",
    "‘The show did break me’: Tom Holland reveals why he’s taking acting break",
    "Justin Sullivan/Getty Images",
    "Why do businesses keep raising their prices?",
    "Middle-income buyers face the most severe housing shortage",
    "The UK will scrap windfall tax on energy firms if prices keep falling",
    "It’s official. We’re in a bull market",
    "Americans’ wealth rises by $3 trillion but remains below early 2022 peak",
    "The double-decker airplane seat is back. Here’s what it looks like now",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "She got a job on a superyacht. Here’s what happened next",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Why an empty plot of sand has sold for a record $34M",
    "Aaron Hughes/World Surf League",
    "He one of the world’s top surfers but grew up scared of the ocean",
    "Novak Djokovic breaks Rafael Nadal record as he progresses to  French Open quarterfinals",
    "Lewis Hamilton lauds ‘amazing result’ for Mercedes",
    "Barcelona secures dramatic Women’s Champions League victory",
    "Terry O'Neill/iconicimagesgallery.com",
    "Why this morning-after portrait of Faye Dunaway became an iconic Hollywood moment",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "See how they turned Margot Robbie into a Barbie doll",
    "Trove of 750 looted artifacts returned to Italy from disgraced British dealer",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Breaking with Trump and DeSantis, Haley made case for Ukraine in CNN town hall",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Mark Thiessen/National Geographic",
    "Ancient species buried dead and carved symbols long before humans",
    "Webb telescope detects organic molecules in distant galaxy",
    "Nonsurgical cat contraception could help curb overpopulation, study says",
    "Study: How long you breastfeed may impact your child’s test scores later",
    "A beloved man died by suicide. Here’s what his widow wants others to know",
    "Allison Dinner/Getty Images",
    "GM wants to adopt Tesla’s charging network as ‘the standard’",
    "Analysis: There is now some public evidence that China viewed TikTok data",
    "Coinbase CEO: Win or lose, our clash with regulators is good for crypto",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Courtesy Adrien Giret\n\n\n\n\n\n•Gallery",
    "Architects are planning for a flooded future",
    "An abandoned airport is becoming Europe’s biggest coastal park",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]