[
    "Ukraine’s plea to join NATO",
    "Attack outside Chinese kindergarten",
    "UNESCO site allegedly defaced",
    "Signed ‘Gatsby’ first edition",
    "Turkey agrees to back Sweden’s NATO bid",
    "Live Updates:\nStoltenberg touts ‘historic step’ after meeting with Erdogan",
    "Hear why Biden thinks Ukraine is not ready to join NATO",
    "Analysis:\nBiden and Erdogan comments threaten to overshadow NATO summit – and help Putin",
    "Leaked details of Putin’s secret luxury train expose his ‘paranoia’",
    "Analysis:\nWhy Prigozhin’s absence is so damaging to Putin",
    "Opinion:\nIn Putin’s Russia, nothing is as it seems",
    "Video:\nWhat Russian authorities found in Prigozhin’s office",
    "She dreamed of defending Japan. Instead, her fellow soldiers sexually assaulted her",
    "Miss Netherlands contestant makes history",
    "Breaking News:\nUS Air Force suspends personnel moves and bonuses due to funding shortfall",
    "Larry Nassar, ex-USA Gymnastics doctor who sexually abused girls, stabbed 10 times in prison",
    "‘Earth is screaming at us right now’: Meteorologist says planet is being pushed to the brink",
    "Trump seemingly baffled by ‘blizzards’ at Dairy Queen campaign stop",
    "Dutch PM Mark Rutte to leave politics after government collapses",
    "Jaap Arriens/NurPhoto/Shutterstock",
    "Twitter’s future is in doubt as Threads tops 100 million users",
    "James Lewis, convicted of extortion following Tylenol deaths, has died",
    "Review:\nBlur raise their game as Britpop legends emerge as a genuine stadium band",
    "Azarenka blames ‘quite a drunk crowd’ for Wimbledon booing",
    "Iranian rapper Toomaj Salehi given six years in prison, avoiding death penalty",
    "Dramatic video shows civilians using zip line to escape raging floodwaters",
    "Tim Clayton/Corbis/Getty Images",
    "16-year-old loses at Wimbledon after controversially being docked point for throwing her racket",
    "John S Lander/LightRocket/Getty Images",
    "Canadian teen questioned for allegedly defacing UNESCO-listed temple in Japan",
    "Eshana Lena Gadanski/Adobe Stock",
    "Don’t shower during a thunderstorm. Here’s why",
    "Sanchit Khanna/Hindustan Times/Getty Images",
    "Susannah Ireland/AFP/Getty Images",
    "James Williamson/AMA/Getty Images",
    "Schirner/ullstein bild/Getty Images",
    "One of Spain’s greatest footballers dies at 88",
    "Jung Yeon-je/AFP/Getty Images",
    "Why South Korean shoppers are hoarding salt and seafood",
    "Patrick Smith/LIV Golf/Getty Images",
    "PGA board member quits over ‘serious concerns’ with Saudi deal",
    "‘This is what is holding these vehicles back’: 3 reasons we won’t see flying cars soon",
    "This river is so polluted that it now has layer of toxic foam",
    "Ricardo Ramírez Reyes/Universidad de Chile",
    "Shiniest exoplanet ever found has reflective metal clouds",
    "Matt Winkelmeyer/GA/The Hollywood Reporter/Getty Images",
    "Margot Robbie isn’t breaking character with her Barbie press looks",
    "Brad Smith/USSF/Getty Images",
    "Daughter of NBA legend shines for USWNT before team departs for Women’s World Cup",
    "The tastiest hotels around the world",
    "FJ Feng/Moss Cohen\n\n\n\n\n\n•Video",
    "Nudist explains what you should definitely not do at a nude beach",
    "Chandan Khanna/AFP/Getty Images/File",
    "Jamie Foxx spotted publicly for the first time since hospitalization",
    "Florida is now America’s inflation hotspot",
    "How the Fed’s new instant money program could lead to another regional banking crisis",
    "How much did Jack Ma’s speech cost Ant Group? About $230 billion",
    "‘Impact of pandemic is still being felt today,’ says All Nippon Airways CEO",
    "Courtesy Chutatip \"Nok\" Suntaranon and Ziv Katalan",
    "The secret side of Turkey’s Aegean coast",
    "Bedbugs: What travelers need to know this summer",
    "‘White people meals’ go viral in China",
    "The world’s biggest cruise ship is almost ready",
    "Sebastien Bozon/AFP/Getty Images",
    "Jamaica’s Shericka Jackson becomes joint-fifth fastest woman of all time",
    "Megan Rapinoe announces she will retire at the end of the season",
    "An emotional Michelle Wie West enjoys magical ending to her career",
    "Netherlands soccer great in intensive care following bleed around brain",
    "Killer jaguar and distressed elephant among award-winning environmental photos",
    "Architect Sir David Adjaye steps back from multiple projects amid sexual misconduct allegations",
    "Blue body paint and beaded jeans: The top moments from Paris Haute Couture Week",
    "Gabriela Hearst to step down as creative director of Chloé",
    "The 91-year-old male model with the face of a classic cinema star",
    "Japan’s tallest skyscraper, part of ambitious ‘urban village,’ completed in Tokyo",
    "Mikhail Tereshchenko/Sputnik/AFP/Getty Images/FILE",
    "Putin faces a challenging task that threatens his power",
    "Whatever happened to Mutually Assured Destruction?",
    "Ukrainian writer Victoria Amelina never got to finish her story. We must tell it for her",
    "Trump’s enthusiasm for bringing back Michael Flynn is a revealing sign",
    "Indiana Jones passes his mantle to the queen of millennial side-eye",
    "Tom Brenner for CNN\n\n\n\n\n\n•CNN Exclusive",
    "Biden says war with Russia must end before NATO can consider membership for Ukraine",
    "Analysis:\nWhy Trump’s Republican rivals should focus on New Hampshire, not Iowa",
    "Analysis:\nHow Michael Flynn went down the conspiracy theory rabbit hole",
    "Grace Napolitano, longtime California congresswoman, announces her retirement",
    "New study: Ancient shrimplike predator was misunderstood",
    "Forget TikTok claims: ‘Nature’s Ozempic’ is no such thing, experts say",
    "Saturn’s rings shine in new Webb telescope photo",
    "Scientists find new clue in what led to megalodon’s demise",
    "Ingenuity helicopter phones home from Mars after 63-day silence",
    "Justin Sullivan/Getty Images",
    "San Francisco real estate is in decline. Will artificial intelligence be able to save it?",
    "Mark Zuckerberg concealed his kids’ faces on Instagram. Should you?",
    "Tired of Elon Musk? Here are the Twitter alternatives you should know about",
    "Meta’s Threads upends social media in less than 48 hours",
    "China fines Jack Ma’s Ant Group nearly $1 billion",
    "Levon Biss/American Museum of Natural History",
    "Extraordinary close-up images show insects as you’ve never seen them before",
    "Ren_ Timmermans/VW Pics/UIG/Getty Images\n\n\n\n\n\n•Gallery",
    "The most delicious Turkish dishes",
    "Chris Fallows\n\n\n\n\n\n•Gallery",
    "‘Flying Shark’ photo changed this man’s life",
    "The architects from one end of the world",
    "Jean-Christophe Verhaegen/AFP/Getty Images",
    "These animals went extinct in the wild. Scientists brought them back",
    "The icy patience of an Arctic photographer",
    "David Wolff - Patrick/Redferns/Getty Images",
    "Signed ‘Great Gatsby’ first edition to be offered in auction of Charlie Watts’ book collection",
    "The 1,000-year-old citadel that rises out of the Atlantic Ocean",
    "Britain’s water industry crisis: Sewage spills, huge leaks and crushing debts",
    "Helsinki’s deputy mayor caught spray-painting graffiti in a train tunnel",
    "Study: A record-high number of 40-year-olds in the US have never been married",
    "Rabid bobcat attacks sleeping camper during youth trip at a Connecticut state park, officials say",
    "Ringo Starr says The Beatles would ‘never’ fake John Lennon’s vocals with AI on new song",
    "This could be the peak of tick season – and tick-borne diseases are on the rise"
]