[
    "Thai voters rebuke military elite",
    "Controversial jewelry fetches $196 million",
    "Two Russian commanders killed in Ukraine fighting, Russia says",
    "Russia may have just lost four aircraft in one day",
    "Dramatic video shows Russian soldiers running away from attack",
    "Erdogan heading for a runoff in Turkey’s knife-edge elections",
    "Explainer: Everything you need to know about Turkey’s elections",
    "Hear what voters in Turkey think",
    "Athit Perawongmetha/Reuters",
    "Record turnout sees Thai voters rebuke military elite as opposition take decisive lead",
    "See why the ex-coup leader shows soft side ahead of election",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Early reports of ‘extensive damage’ as Cyclone Mocha hits Myanmar’s coast",
    "Opinion: DeSantis’ remarks on Jordan Neely’s death form a dangerous pattern",
    "Vice Media files for Chapter 11 bankruptcy",
    "Teacher feared dead after shark attack off South Australia",
    "China sentences elderly US citizen to life in prison on spying charges",
    "Fareed Zakaria: America might as well be on another planet",
    "They left South Korea for the American Dream. Now their children are moving back",
    "Ex-ByteDance employee claims China had ‘supreme access’ to all data",
    "French soccer club excludes players after they refuse to participate in anti-homophobia campaign",
    "Ten lions killed in Kenya as human-wildlife conflict escalates",
    "Platypus released in Australian national park for the first time in 50 years",
    "Bobi, the world’s oldest dog, celebrates 31st birthday",
    "‘World’s largest ocean restoration project’ designed for Dubai",
    "Controversial jewelry collection fetches a record-shattering $196 million",
    "Nepali Sherpa ties Mount Everest climbing record",
    "Leon Lord/AFP/Getty Images/FILE",
    "Hollandse Hoogte/Shutterstock",
    "Top-flight Dutch soccer match suspended due to fans throwing fireworks onto pitch",
    "How Xavi’s defensive revolution brought La Liga title back to FC Barcelona",
    "Roslan Rahman/AFP/Getty Images",
    "A law that cancels cancel culture? This country is considering it",
    "Travel expert explains the ‘unspoken rights’ for every plane seat",
    "Courtesy Cloud Gate Foundation",
    "Dance that comforted Taiwan during its loneliest hour returns to the stage",
    "Martin Valigursky/Adobe Stock",
    "The 23 best destinations to visit in 2023",
    "Bob Levey/TAS23/Getty Images",
    "Taylor Swift interrupts ‘Bad Blood’ to defend concertgoer at Philadelphia tour stop",
    "VeselovaElena/iStockphoto/Getty Images",
    "You should make your own salad dressing",
    "Theo Wargo/WireImage/Getty Images",
    "Tom Brady honors exes Gisele Bündchen and Bridget Moynahan on Mother’s Day",
    "Mouth breathing might be ruining your sleep. Here’s how to fix it",
    "Chin Hei Leung/SOPA Images/LightRocket/Getty Images",
    "The real reasons stores are closing in big cities",
    "Why current US recession warnings are unlike all the others",
    "JPMorgan Chase CEO Jamie Dimon says Trump doesn’t understand the debt ceiling",
    "Here’s how we know a US default would be an economic disaster",
    "Italian pasta prices are soaring. Rome is in crisis talks with producers",
    "Adam Friedlander/The New York Times/Redux",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Italy’s Friuli region is one of Europe’s best kept secrets",
    "They wanted a house in Italy and bought a castle",
    "Italian food: Classic dishes everyone needs to try",
    "New hypersonic plane design promises Europe to Australia in under 5 hours",
    "Catherine Ivill/Getty Images Europe/Getty Images",
    "How Erling Haaland brought new dimension to Treble-chasing Manchester City",
    "Chelsea wins Women’s FA Cup in front of world record crowd",
    "Why this centuries-old schoolboy match caused division and debate in England",
    "Man charged with assault after appearing to shove Premier League manager",
    "New York is getting a new $780 million, 25,000-seat soccer-specific stadium",
    "Lionel Messi booed by some of his own team’s fans on return from suspension",
    "Andrea Gjestvang/GOST Books",
    "Portrait of the lives of Faroe Islands’ unmarried men",
    "See inside Chanel’s Los Angeles catwalk show",
    "Remember when Prince bared his butt at the 1991 VMAs?",
    "World’s first 3D-printed mosque to be built in Dubai",
    "This Y2K pastime is becoming a big hit among South Korean youth",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Notable legal clouds that continue to hang over Donald Trump in 2023",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Oscar Sanisidro/KU Biodiversity Institute/The University of Kansas",
    "How did massive prehistoric ‘thunder beasts’ get super big, super fast?",
    "Scientists have updated the human genome to make it more equitable and inclusive",
    "How the Voyager probes keep going and going decades after launch",
    "SpaceX and startup Vast hope to put the world’s first private space station in orbit",
    "Zillennials: The newest micro-generation has a name",
    "Marlena Sloss/Bloomberg/Getty Images",
    "Elon Musk says he’s found a new CEO for Twitter",
    "AI-powered drones: Can anything stop a global AI arms race?",
    "Peloton is recalling 2 million bikes",
    "AI investor explains how this new technology could revolutionize how we watch television",
    "OpenAI CEO Sam Altman to testify before Congress",
    "A foldable phone, new tablet and lots of AI: What Google unveiled at its big developer event",
    "Graphic images of Texas mall shooting spread on Twitter, rekindling debate on how much to share",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "The architect building the world’s tallest hotel",
    "Richard Shotwell/Invision/AP",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Dia Dipasupil/Getty Images",
    "Robert De Niro welcomes his 7th child at 79",
    "Neville Williams/Aston Villa FC/Getty Images",
    "Tom Hanks responds to reviews of his debut novel"
]