[
    "Ugandan female politicians",
    "Analysis: Russian raiders struggle to stick to Kyiv’s official line",
    "US intelligence indicates Ukrainians may have launched drone attack on Kremlin",
    "Wagner chief fears more battlefield losses could lead to a revolution in Russia",
    "Tina Turner, the ‘Queen of Rock and Roll,’ dies at 83",
    "In photos: Tina Turner’s iconic style",
    "These are the songs that made Tina Turner an icon",
    "Opinion: These notes will belong to Tina Turner forever",
    "DeSantis under pressure to bounce back after embarrassing campaign launch",
    "Opinion: Why DeSantis is just as dangerous as Trump – or more",
    "See how Biden reacted to DeSantis’ announcement",
    "Esther Ruth Mbabazi for CNN",
    "One dead, three wounded in stabbing and shooting attack in central Japan",
    "Germany, Europe’s biggest economy, falls into recession",
    "Target is being held hostage by an anti-LGBTQ campaign",
    "Sudanese refugees flee horrors of war. Poverty-stricken Chad struggles to help",
    "Most wanted Rwandan genocide suspect arrested after decades on the run",
    "Asylum-seekers in Ireland threatened by far-right activists",
    "Alleged fraudster, whose foot was found on beach, is dead: Australian coroner",
    "Refugee loses her son and brother",
    "Florencia Tan Jun/Getty Images Europe/Getty Images",
    "Spanish soccer’s inaction over racist abuse of Vinicius Jr. could cost it the World Cup",
    "Man with paralysis walks naturally after brain, spine implants",
    "The diet that can lower ‘bad’ cholesterol",
    "Rita Wilson says awkward moment with Tom Hanks isn’t what it looks like",
    "One of Asia’s top female entrepreneurs steps down at firm she helped found",
    "‘Jeopardy’ fans in uproar over a single letter ended nine-day winning streak",
    "This animal was declared extinct in India over 60 years ago. It might be back",
    "Vittorio Zunino Celotto/Getty Images",
    "Chinese actor steals spotlight at Cannes in a series of show-stopping looks",
    "Hotel that looks like British Houses of Parliament opens",
    "NASA rover could be the first step for life on the moon",
    "Andy Rain/EPA-EFE/Shutterstock",
    "Junior Grade Drew Lovullo/AP",
    "Thomas Barwick/Digital Vision/Getty Images",
    "Murat Kula/Anadolu Agency/Getty Images",
    "Erdogan poised to keep leading an increasingly polarized Turkey",
    "Nicolas Economou/NurPhoto/Getty Images",
    "Tennis player Mikael Ymer disqualified from match after smashing racket against umpire’s chair",
    "Amanda Gorman ‘gutted’ by school district’s decision to restrict her poem",
    "Jorgen Ree Wiig/Norwegian Directorate of Fisheries/Sea Surveillance Service",
    "Norway warns people to keep away from ‘spy’ whale for animal’s safety",
    "aapsky/iStockphoto/Getty Images",
    "A world in three islands on the Mediterranean",
    "These little-known towns are some of Med’s loveliest spots",
    "Sword of Indian ruler slain by British sells for more than $17 million at auction",
    "Nathan Congleton/NBC/Getty Images",
    "Taylor Lautner calls out criticism about how he’s aged",
    "Brian Cox says he ‘felt a little bit rejected’ by ‘Succession’ plot twist",
    "‘City slicker’ weather guy can’t stop gagging on farm",
    "Bright and Barbiecore: Dua Lipa’s new Versace collection",
    "Will the debt ceiling debate finish the Fed’s inflation fight?",
    "UK inflation surprises for all the wrong reasons",
    "‘Go to hell, Shell.’ Climate protests disrupt oil company’s shareholder meeting",
    "Target removing some LGBTQ merchandise following customer backlash",
    "Former Fed Chair Bernanke argues economy must slow further to bring down inflation",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "South Africa’s most epic hiking trails",
    "A Maldives destination like no other",
    "MSG is the most misunderstood ingredient of the century. That’s finally changing",
    "Michael Steele/Getty Images",
    "Vinícius Jr. is being racially abused during LaLiga matches. Why is nobody being punished?",
    "Liverpool great in tears after final match at Anfield",
    "Brittney Griner embraces Vice President Kamala Harris",
    "Manchester City wins Premier League title as Arsenal suffers shock loss",
    "Macall Polay/HBO/Warner Bros. Discovery",
    "The mourning dress codes of ‘Succession’",
    "By recreating old photos, these children of immigrants step into their parents’ shoes",
    "Cannes 2023 is a showcase for African cinema",
    "Could these air purification towers tackle India’s pollution problem?",
    "Lego is heading back to the ’80s with a 2,651-piece model ‘Pac-Man’ arcade cabinet",
    "Kurt Cobain’s smashed-up guitar sells for almost $600,000—nearly 10 times the auction estimate",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Opinion: Mitch McConnell’s confidence is being put to the test",
    "Biden to become first sitting US president to travel to Papua New Guinea",
    "US announces $1.2 billion aid package to Ukraine with counteroffensive looming",
    "Kseniya Ovchinnikova/Moment RF/Getty Images",
    "How teens (and adults) can handle social media safely",
    "New York City is sinking due to its million-plus buildings, study says",
    "Saber-toothed predator reveals how unstable life was during ‘the Great Dying’",
    "Stone Age humans made to-scale plans to build mysterious mega structures",
    "How the technology behind ChatGPT could make mind-reading a reality",
    "Amazon corporate workers plan walkout next week over return-to-office policies",
    "Adobe is adding an AI-powered image generator to Photoshop",
    "Neuroscientists test out brain-reading AI on CNN reporter",
    "Company that allegedly sent billions of robocalls sued by 49 attorneys general",
    "Meta sells Giphy to Shutterstock",
    "Incredible floral explosion transforms African town",
    "Photographer captures the unseen side of Dubai",
    "A 3D-printing company will build on the moon",
    "Flying taxi airport is just 3 years away",
    "This is how we’ll grow food on Mars",
    "courtesy Daniel Arsham/Everyrealm",
    "How the metaverse became real estate’s new frontier",
    "CFOTO/Future Publishing/Getty Images/File",
    "Sexual harassment debate breathes new life into China’s #MeToo movement",
    "Teacher feared dead after shark attack off South Australia",
    "Biden picks cancer surgeon Monica Bertagnolli to be next NIH director",
    "Robert De Niro welcomes his 7th child at 79",
    "Ten lions killed in Kenya as conflict between humans and wild animals worsens",
    "County with high rate of overdose deaths doesn’t use opioid settlement funds for addiction program",
    "Buckingham Palace releases official coronation portraits",
    "Scarlett Johansson is a full-fledged Disney adult despite that lawsuit",
    "Americans’ debt surpasses $17 trillion for the first time",
    "Tom Hanks responds to reviews of his debut novel",
    "World’s most beautiful castles"
]