[
    "Double-decker airplane seat",
    "New York City’s air pollution among the worst in the world",
    "The Arctic may be sea ice-free in summer by the 2030s, new study warns",
    "More than 90% of Peach State’s peaches lost this year after extreme winter weather",
    "PLANET LABS PBC/Reuters\n\n\n\n\n\n•Live Updates",
    "Fears of ecological catastrophe following collapse of Ukraine’s Nova Kakhovka dam",
    "Zelensky: This is ‘an environmental bomb of mass destruction’",
    "New video shows underwater explosion after dam breaks in Ukraine",
    "Sayantan Chakraborty/Pacific Press/LightRocket/Getty Images/FILE",
    "Brutal killings of girls show one of India’s biggest problems getting worse, advocates say",
    "India and China are kicking out each other’s journalists",
    "Eric Espada/Getty Images\n\n\n\n\n\n•Analysis",
    "Golf’s new Saudi deal presents questionable political, business and sporting realities",
    "Ozempic is taking China by storm. Drugmakers are scrambling",
    "12.9 million take China’s college entrance exam as pressures mount",
    "2 Chinese snooker players banned for life for match-fixing, 8 others suspended",
    "US received intel that Ukraine was planning attack on Nord Stream pipelines, officials say",
    "‘The Little Mermaid’ bombs in China and South Korea amid racist backlash",
    "Dramatic footage shows moment 1.8-mile bridge collapses",
    "Human remains found in 45 bags are missing call center staff, Mexico confirms",
    "Prehistoric cave paintings discovered in Spain using drones",
    "I tried Apple’s new headset. Here’s what it’s like to use",
    "GOP hardliners derail McCarthy’s agenda in retaliation over debt limit deal",
    "Analysis: DeSantis speech shows why Republicans are still at risk in 2024",
    "First man to run 100m in under 10 seconds dies",
    "Air India flight bound for San Francisco diverted to Russia over technical issue",
    "This leafy green could be your new favorite summer salad",
    "Terry O'Neill/iconicimagesgallery.com",
    "Why this iconic portrait of Faye Dunaway ‘couldn’t happen today’",
    "Why do we cry on airplanes?",
    "International desserts: 50 famous desserts around the world",
    "CFOTO/Future Publishing/Getty Images",
    "Ingo Barth/ullstein bild/Getty Images",
    "Fred Kfoury III/Icon Sportswire via Getty Images/FILE",
    "@CatalinaGarciaH/Twitter/TMX\n\n\n\n\n\n•Video",
    "Tennis star in tears as she struggles to address controversial disqualification",
    "What a ducking relief – Apple is finally fixing this autocorrect problem",
    "Elva Etienne/Moment RF/Getty Images",
    "More kids are anxious but fewer are getting the right help, study shows",
    "Dimitrios Kambouris/Getty Images\n\n\n\n\n\n•Analysis",
    "CNN chief apologizes to staff after embarrassing profile, vows to win back trust",
    "Double-decker airplane seat is back. Here’s what it looks like now",
    "Starbucks’ controversial ‘Oleato’ drinks will roll out in more US cities",
    "Courtesy AllRightsReserved",
    "Giant inflatable ‘rubber duck’ returns to Hong Kong — this time with a friend",
    "Chuck Zlotnick/Marvel Studios",
    "Harrison Ford makes his Marvel debut on set of ‘Captain America: Brave New World’",
    "Jeremy Strong ‘terrified’ the ‘Succession’ creator during that last scene",
    "Lionel Messi’s father reveals where his son wants to play next",
    "Anderson Cooper gets a surprise on live tv that makes him giggle",
    "Spencer Platt/Getty Images",
    "People are spending more on groceries. But they’re buying less",
    "Main Street traders are taking big risks. They might not pay off",
    "Case for 2023 US recession is crumbling",
    "How much should you have saved for retirement at your age? It’s complicated",
    "How ‘begpackers’ became some of Asia’s most disliked travelers",
    "She got a job on a superyacht. Here’s what happened next",
    "Dare to bare: 20 of the world’s best nude beaches",
    "Why an empty plot of sand has sold for a record $34M",
    "Tourist hot spot erects fence to deter selfie-takers",
    "Novak Djokovic breaks Rafael Nadal record as he progresses to  French Open quarterfinals",
    "Lewis Hamilton lauds ‘amazing result’ for Mercedes",
    "One game from greatness. Manchester City beats Manchester United in FA Cup",
    "Barcelona secures dramatic Women’s Champions League victory",
    "Coco Gauff defeats tennis’ rising star in the battle of the teenagers",
    "Police make 31 arrests as animal rights protesters plan to disrupt horse race",
    "Steve Jennings/WireImage/Getty Images",
    "‘Mongolian Rhapsody’? Handwritten lyrics suggest Freddie Mercury considered alternative title",
    "See how they turned Margot Robbie into a Barbie doll",
    "Trove of 750 looted artifacts returned to Italy from disgraced British dealer",
    "How the costumes of ‘American Born Chinese’ straddle fantasy and reality",
    "The world’s largest architecture exhibition mounts a radical new show",
    "We’re easing out of the pandemic. But that’s not what has this infectious disease expert worried",
    "What King Charles should do now",
    "Vladimir Putin’s anxious time",
    "My family and I barely escaped from Khartoum. Here’s what we owe those left behind.",
    "For women, it’s past time to give up the ghost of equality",
    "Why US presidential debates have lost their luster",
    "Breaking with Trump and DeSantis, Haley made case for Ukraine in CNN town hall",
    "Senate passes bill to block Biden’s student loan forgiveness program",
    "Biden administration imposes sanctions and visa restrictions in response to ongoing Sudan violence",
    "Oath Keepers member who sped to Capitol on a golf cart gets more than four years in prison",
    "Mark Thiessen/National Geographic",
    "Ancient species buried dead and carved symbols long before humans",
    "Webb telescope detects organic molecules in distant galaxy",
    "See early stars form in a galaxy 20 million light-years away",
    "Study: How long you breastfeed may impact your child’s test scores later",
    "A beloved man died by suicide. Here’s what his widow wants others to know",
    "Isaac Brekken/Variety/Penske Media/Getty Images",
    "Former NBCU exec Linda Yaccarino prepares to take over Twitter CEO role from Elon Musk",
    "Teachers are on the front lines of a battle to change how teens use social media",
    "First on CNN: US senators question Twitter’s privacy compliance under Elon Musk",
    "Courtesy Tim Laman\n\n\n\n\n\n•Gallery",
    "‘Bird Planet’ showcases birds like you’ve never seen them before",
    "Celia Kujala/Ocean Art 2022\n\n\n\n\n\n•Gallery",
    "Photographers capture stunning images of underwater life",
    "Airbus SAS 2022\n\n\n\n\n\n•Gallery",
    "The innovations making aviation greener",
    "Gregory Breton\n\n\n\n\n\n•Gallery",
    "These elusive and adorable wild cats are under threat",
    "Courtesy Adrien Giret\n\n\n\n\n\n•Gallery",
    "Architects are planning for a flooded future",
    "An abandoned airport is becoming Europe’s biggest coastal park",
    "As the West moves to electric cars, here’s where the unwanted gas guzzlers go",
    "It’s a myth that women don’t want sex as they age, study finds",
    "95-year-old woman dies after being tasered in her Australian nursing home",
    "Teacher feared dead after shark attack off South Australia",
    "What mosquitoes are most attracted to in human body odor is revealed",
    "Australian leader gives Indian Prime Minister a rock star welcome",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "The good, bad and ugly about BMI",
    "This 15-mile, $6.7B bridge is a symbol of China’s ambitions, and its problems"
]