[
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs 05.20.2023",
    "14 relaxing video games to help you destress 4 hours ago",
    "iMessage Contact Key Verification could arrive with iOS 16.6 05.20.2023",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET a day ago",
    "'Star Wars Jedi: Survivor' and the year of disappointing PC ports",
    "By I. Bonifacic, 5 hours ago",
    "With ‘Final Fantasy XVI’, the series tries a new direction",
    "Lego's new 2,650-piece Pac-Man arcade set includes a mechanical crank",
    "What we bought: I’m ashamed of how much I love Sage’s Creatista Plus",
    "Roland SH-4D review: An overdue return to great synths for the masses",
    "By T. O'Brien, 5 hours ago",
    "The best WiFi extenders in 2023",
    "By V. Palladino, an hour ago",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "The best robot vacuums for 2023",
    "By V. Palladino, 3 hours ago",
    "You can now use Amazon’s palm-reading tech to buy alcohol",
    "Meta’s open-source speech AI recognizes over 4,000 spoken languages",
    "By W. Shanklin, 3 hours ago",
    "The first all-electric Escalade joins Cadillac’s EV lineup later this year",
    "By W. Shanklin, 4 hours ago",
    "WhatsApp finally lets you fix typos in sent messages",
    "14 relaxing video games to help you destress",
    "Apple’s 2022 iPad is on sale for $399",
    "LinkedIn starts rolling out new verification and anti-scam features",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, 6 hours ago",
    "Venmo will soon have accounts for teenagers, with no-fee debit card and ATM access",
    "The Morning After: Meta could launch a Twitter competitor next month",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Sony's WH-1000XM5 ANC headphones fall back to $348 at Amazon",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]