[
    "The next Nintendo Direct will take place on June 21st 15 hours ago",
    "The best cheap Windows laptops for 2023 11 hours ago",
    "The best midrange smartphones for 2023 16 hours ago",
    "The best sleep apps and gadgets for a better night's sleep 18 hours ago",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Panasonic S5 IIX review: Power and value in one vlogging package",
    "Spotify Desktop app gets a new look and upgraded library features",
    "Rivian owners will be able to use Tesla Superchargers starting in 2024",
    "Anker's charging accessories are up to 44 percent off in Amazon sale",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "Everything you need to know about Amazon Prime Day 2023",
    "By V. Palladino, an hour ago",
    "Amazon Prime Day kicks off July 11th this year",
    "AI-generated music won’t win a Grammy anytime soon",
    "By W. Shanklin, 9 hours ago",
    "By V. Palladino, 10 hours ago",
    "US Senate is the latest to look into Amazon's warehouse safety practices",
    "By W. Shanklin, 10 hours ago",
    "Roblox now allows creators to build content for people 17 and older",
    "Apple's expanded self-repair program covers the iPhone 14 and newer MacBooks",
    "By J. Fingas, 11 hours ago",
    "The best cheap Windows laptops for 2023",
    "By V. Palladino, 11 hours ago",
    "President Biden meets with AI tech leaders in San Francisco",
    "By A. Tarantola, 12 hours ago",
    "EA's 'Immortals of Aveum' is delayed until August 22nd",
    "The best immersion blenders you can buy in 2023",
    "By S. Rutherford, 13 hours ago",
    "How do you prevent an AI-generated game from losing the plot?",
    "By A. Tarantola, 13 hours ago",
    "News publishing giant Gannett sues Google for monopolizing ad tech",
    "By W. Shanklin, 14 hours ago",
    "Cruise launches an Android app for its self-driving taxis",
    "Chrome on iOS can now show maps and create calendar items without switching apps",
    "By J. Fingas, 14 hours ago",
    "Lawmakers seek 'blue-ribbon commission' to study impacts of AI tools",
    "By A. Tarantola, 15 hours ago",
    "The next Nintendo Direct will take place on June 21st",
    "The best midrange smartphones for 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]