[
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs 05.20.2023",
    "iMessage Contact Key Verification could arrive with iOS 16.6 05.20.2023",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET 19 hours ago",
    "The Apple Watch Series 8 drops to $329 at Amazon a day ago",
    "Lego's new 2,650-piece Pac-Man arcade set includes a mechanical crank",
    "With ‘Final Fantasy XVI’, the series tries a new direction",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "By I. Bonifacic, 20 hours ago",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Sony's WH-1000XM5 ANC headphones fall back to $348 at Amazon",
    "'Star Wars Jedi: Survivor' and the year of disappointing PC ports",
    "By I. Bonifacic, 17 minutes ago",
    "What we bought: I’m ashamed how much I love Sage’s Creatista Plus",
    "By D. Cooper, 33 minutes ago",
    "LinkedIn starts rolling out new verification and anti-scam features",
    "The best sleep apps and gadgets for a better night's sleep",
    "By A. Skorheim, an hour ago",
    "Venmo will soon have accounts for teenagers, with no-fee debit card and ATM access",
    "The Morning After: Meta could launch a Twitter competitor next month",
    "Meta reportedly wants to license Magic Leap’s AR technology",
    "By I. Bonifacic, 17 hours ago",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET",
    "By I. Bonifacic, 19 hours ago",
    "Here’s a first look at ‘System Shock 2: Enhanced Edition’",
    "By I. Bonifacic, a day ago",
    "The Apple Watch Series 8 drops to $329 at Amazon",
    "Hitting the Books: How music chords hack your brain to elicit emotion",
    "By A. Tarantola, 05.21.2023",
    "HP OfficeJet printers are bricking following a recent software update",
    "By I. Bonifacic, 05.20.2023",
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs",
    "iMessage Contact Key Verification could arrive with iOS 16.6",
    "Apple rejected 1,679,694 App Store submissions in 2022",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]