[
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th a day ago",
    "Astronomers identify volcano-covered planet that could have water on its surface 19 hours ago",
    "The best Nintendo Switch OLED accessories for 2023 a day ago",
    "The best SSD for your PS5 05.16.2023",
    "'Mortal Kombat 1' reboots the series on September 19th",
    "By J. Fingas, 40 minutes ago",
    "The first episode of 'The Expanse: A Telltale Series' will arrive on July 27th",
    "BMW’s all-electric luxury boat comes with a custom Hans Zimmer soundtrack",
    "NVIDIA's $299 GeForce RTX 4060 is the cheapest 40-series card yet",
    "Technics' new flagship earbuds have larger drivers for improved sound quality",
    "Spacetop is an ‘augmented reality laptop’ for remote working on the go",
    "By S. Fielding, 4 minutes ago",
    "YouTube TV had major issues at the worst possible time last night",
    "By B. Steele, 4 minutes ago",
    "The best cheap kitchen gadgets in 2023",
    "By I. Bonifacic, an hour ago",
    "‘Gears 5’ is the first Xbox-exclusive to come to GeForce Now",
    "Google details its next steps for wiping out Chrome tracking cookies",
    "By W. Shanklin, an hour ago",
    "YouTube is bringing 30-second unskippable ads to its TV apps",
    "The Morning After: You can now call an Uber like a normal taxi",
    "Sony's 'Project Leonardo' PS5 peripheral is now the 'Access controller'",
    "By S. Fielding, 3 hours ago",
    "Take-Two hints that 'Grand Theft Auto VI' is coming in 2024",
    "Watch a trailer for 'The Creator,' another film with an AI gone rogue",
    "Twitter faces lawsuit for allegedly getting a Saudi dissident imprisoned",
    "Montana's governor signs bill banning TikTok",
    "US adults are spending less time on Twitter since Elon Musk took over",
    "Astronomers identify volcano-covered planet that could have water on its surface",
    "By I. Bonifacic, 19 hours ago",
    "You can preorder Analogue’s TurboGrafx-inspired Duo console this Friday",
    "BlizzCon returns as an in-person event later this year",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]