[
    "James Webb telescope finds water around a comet in the main asteroid belt 05.15.2023",
    "The best smartwatches for 2023 05.15.2023",
    "iPhone syncing for Windows 11 is now available for everyone 05.15.2023",
    "Apple's Mac Mini M2 falls back to an all-time low of $500 05.16.2023",
    "Beats Studio Buds + review: A little bit better in every way",
    "Theranos founder Elizabeth Holmes fails in bid to stay out of prison during appeal",
    "Valve is the latest company to be sued by Immersion over its Steam Deck rumble tech",
    "The best grills and grill accessories in 2023",
    "By B. Steele, 21 hours ago",
    "What we bought: Are touch-activated faucets smart or silly?",
    "By S. Rutherford, 2 hours ago",
    "Logitech joins the growing list of companies with self-repair programs",
    "By W. Shanklin, 13 minutes ago",
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th",
    "By J. Fingas, 28 minutes ago",
    "Five Nights At Freddy's movie teaser shows off murderous animatronics",
    "The best Nintendo Switch OLED accessories for 2023",
    "Montreal's iconic brutalist building has finally been finished inside Unreal Engine",
    "Uber will start rolling out teen accounts with safety features next week",
    "You can now call an Uber like a normal taxi",
    "By S. Fielding, 2 hours ago",
    "Sony's next PlayStation Showcase will take place on May 24th",
    "Amazon's redesigned Echo Buds are only $50",
    "Amazon's 2023 Echo Show is faster and offers improved audio",
    "By W. Shanklin, 3 hours ago",
    "Amazon unveils the $40 Echo Pop, a semi-spherical smart speaker",
    "Eero mesh WiFi routers are up to 50 percent off right now",
    "Adobe’s new AI automates PDF accessibility tags",
    "By W. Shanklin, 4 hours ago",
    "Roku launches the 'Women’s Sports Zone'",
    "By S. Fielding, 4 hours ago",
    "Google's latest AI tackles long and costly drug discovery",
    "The Morning After: Samsung is reportedly sourcing OLED TV panels from rival LG",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]