[
    "The best iPhone accessories for 2023 a day ago",
    "The best smartwatches for 2023 18 hours ago",
    "Apple's 'M3 Pro' chipset could feature 12 CPU cores 05.14.2023",
    "Apple's Mac Mini M2 falls back to an all-time low of $500 4 hours ago",
    "The Morning After: This company will give you a free TV if you're willing to watch non-stop ads",
    "James Webb telescope finds water around a comet in the main asteroid belt",
    "By J. Fingas, 16 hours ago",
    "iPhone syncing for Windows 11 is now available for everyone",
    "By W. Shanklin, 17 hours ago",
    "TCL's new 2023 TVs deliver high frame rate gaming at lower prices",
    "'Avatar: The Way of Water' is coming to Disney+ and Max on June 7th",
    "Webex meetings will use AI tools to help speech-impaired users communicate",
    "By S. Fielding, an hour ago",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "Apple's Mac Mini M2 falls back to an all-time low of $500",
    "Peacock will exclusively stream one NFL Playoff game",
    "The best immersion blenders you can buy in 2023",
    "By S. Rutherford, 15 hours ago",
    "'Layers of Fear' remake launches on PC, PS5 and Xbox June 15th",
    "The best smartwatches for 2023",
    "By V. Palladino, 18 hours ago",
    "Elon Musk loses appeal to tweet whatever he wants about Tesla",
    "By J. Fingas, 18 hours ago",
    "The IRS reportedly has a free TurboTax alternative in the works",
    "By S. Buckley, 18 hours ago",
    "Sonos is ending support for local file playback on Android",
    "Hasselblad is reportedly the latest camera maker to bail on DSLRs",
    "By W. Shanklin, 18 hours ago",
    "WhatsApp's new privacy feature locks sensitive chats and hides them from notifications",
    "The best video streaming services in 2023",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "By J. Fingas, 20 hours ago",
    "Hackers breach Philadelphia Inquirer ahead of Tuesday’s mayoral primary",
    "By W. Shanklin, 20 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]