[
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack 13 hours ago",
    "Apple’s Vision Pro headset may not come with a top strap in the box 13 hours ago",
    "Twitter hacker and crypto scammer sentenced to five years in prison 06.24.2023",
    "'Simpler Times' is the coziest game I've played in a long time",
    "Pocono Raceway’s ‘jet drier’ credited with keeping I-95’s reopening on time",
    "By W. Shanklin, 06.22.2023",
    "A Reddit transcription community will shut down over a 'lack of trust' in the platform",
    "The original 'Call of Duty: Warzone' battle royale will shut down in September",
    "The best Amazon Prime Day early access deals for 2023",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "By I. Bonifacic, 8 hours ago",
    "NASA is recycling 98 percent of astronaut pee and sweat on the ISS into drinkable water",
    "By I. Bonifacic, 11 hours ago",
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack",
    "By I. Bonifacic, 13 hours ago",
    "Apple’s Vision Pro headset may not come with a top strap in the box",
    "Hitting the Books: How hackers turned cybercrime into a commercial service",
    "By A. Tarantola, 15 hours ago",
    "'The Elder Scrolls VI' is 'likely five-plus years away,' says Xbox chief",
    "By I. Bonifacic, 06.24.2023",
    "Twitter hacker and crypto scammer sentenced to five years in prison",
    "‘Star Trek: Prodigy’ will be pulled from Paramount+ next week",
    "Apple’s second-generation AirPods Pro are back on sale for $200",
    "Russia blocks access to Google News after Wagner Group forces threaten to topple military",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Moto Razr+ review: Finally some real competition for Samsung’s Flip foldables",
    "Fossil finally gets Google Assistant on its Wear OS 3 smartwatches",
    "YouTube fan accounts will soon need a disclosure in the channel name or handle",
    "iFixit teardown reveals ASUS' ROG Ally is easier to pry open than the Steam Deck",
    "EPA creates youth council to advise the agency on climate change policy",
    "The best robot vacuums for 2023",
    "By V. Palladino, 06.23.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]