[
    "Microsoft says China installed malware in US systems in Guam 05.24.2023",
    "Meta is laying off employees for the third time in less than three months 05.24.2023",
    "Pegasus spyware found on phones of Mexican president's close ally 05.24.2023",
    "iOS 17 will reportedly turn your locked iPhone into a smart display 05.24.2023",
    "Google begins opening access to generative AI in search",
    "By W. Shanklin, 11 hours ago",
    "MoviePass relaunches nationwide with a new pricing model",
    "Virgin Galactic completes its final VSS Unity flight test before space tourism debut",
    "By J. Fingas, 12 hours ago",
    "The Arc internet browser lets you customize (or vandalize) any website",
    "By N. Ingraham, 16 hours ago",
    "The best gaming handhelds in 2023",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "By A. Tarantola, 4 hours ago",
    "Ford EV drivers will get access to 12,000 North American Tesla Superchargers next spring",
    "By A. Tarantola, 6 hours ago",
    "Twitter says startups can 'experiment' with its data for $5,000 a month",
    "By W. Shanklin, 8 hours ago",
    "Twitch is raising prices for its ad-free Turbo service",
    "TikTok is testing an AI chatbot for content discovery",
    "YouTube Stories are going away on June 26th",
    "The best passive bookshelf speakers for most people",
    "By T. O'Brien, 14 hours ago",
    "The second-gen Apple Pencil is once again on sale for $85",
    "Google Play Games for PC is now available in Europe and New Zealand",
    "By J. Fingas, 15 hours ago",
    "The best fitness trackers for 2023",
    "By V. Palladino, 15 hours ago",
    "Samsung's HW-Q900C premium soundbar launches today for $1,400",
    "Abode's entry-level Smart Home Security Kit only costs $160 but drops HomeKit support",
    "Acer’s 16-inch Predator Triton and Swift Edge laptops are aimed at gamers and creators",
    "How to screen record on an iPhone",
    "By J. Mercado, 16 hours ago",
    "ChatGPT for iOS is now available in 11 more countries",
    "By S. Fielding, 16 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]