[
    "The best iPhone accessories for 2023 2 hours ago",
    "NASA ends its Lunar Flashlight mission 5 hours ago",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election a day ago",
    "Apple’s M1 iPad Air drops to $500 at Amazon 05.13.2023",
    "Pixel users report the Google app is making their phones overheat",
    "By I. Bonifacic, 20 hours ago",
    "Apple's 'M3 Pro' chipset could feature 12 CPU cores",
    "By I. Bonifacic, 18 hours ago",
    "Hatch Restore 2 review: Better sleep behind a paywall",
    "By A. Skorheim, 2 hours ago",
    "'Hogwarts Legacy' on Switch just got hit with another massive delay",
    "YouTuber pleads guilty to intentionally crashing his plane for a wallet sponsorship",
    "By W. Shanklin, 05.12.2023",
    "Samsung Smart Monitors are up to 25 percent off right now",
    "By K. Holt, 29 minutes ago",
    "Google will pay Texas $8 million to settle claims of 'deceptive' Pixel 4 ads",
    "The best iPhone accessories for 2023",
    "By V. Palladino, 2 hours ago",
    "The Morning After: Twitter has a new CEO",
    "The Apple Watch Ultra is almost $100 off right now",
    "NASA ends its Lunar Flashlight mission",
    "By S. Fielding, 5 hours ago",
    "Apple's iPhone 14 Emergency SOS feature arrives in New Zealand and Australia",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election",
    "By I. Bonifacic, a day ago",
    "The second-generation Apple Pencil drops to a new low of $85",
    "Hitting the Books: The abrupt and ignoble downfall of Sam Bankman-Fried",
    "By A. Tarantola, 05.14.2023",
    "'Elden Ring' has sold more than 20 million copies",
    "By I. Bonifacic, 05.13.2023",
    "Apple offers a free one-month trial of MLS Season Pass to new and returning subscribers",
    "Meta fixed a Facebook bug that sent automatic friend requests to users",
    "Google faces antitrust compliance review in India following Match Group complaint",
    "Apple’s M1 iPad Air drops to $500 at Amazon",
    "Binance leaves Canada due to stricter crypto rules",
    "The US government wants to recall 67 million airbag inflators",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]