[
    "Apple  WWDC 2023 keynote: Watch it here at 1PM ET",
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service 06.04.2023",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 2 hours ago",
    "Google's Pixel 7 falls to $499 and comes with a $100 Amazon gift card 8 hours ago",
    "WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "By J. Fingas, 25 minutes ago",
    "Apple needs to prove why its mixed reality headset matters",
    "By D. Hardawar, 06.02.2023",
    "Final Cut Pro and Logic Pro for the iPad make a compelling case for a tablet-based studio",
    "Latest Webb Telescope images gives a look at stars being born in the Virgo constellation",
    "By N. Ingraham, 20 hours ago",
    "Even the cheapest Tesla Model 3 now qualifies for the full $7,500 tax credit",
    "Apple WWDC 2023: Live updates",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "Apple WWDC 2023 keynote: Watch it here at 1PM ET",
    "By K. Holt, 33 minutes ago",
    "Reddit communities are 'going dark' to protest changes that would hurt third-party apps",
    "By J. Fingas, 36 minutes ago",
    "All the big tech layoffs of 2023",
    "Apple’s third-gen AirPods have dropped back down to $149",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever",
    "Spotify is laying off 200 employees from its podcast division",
    "The best backpacking and camping gear for dads",
    "By T. O'Brien, 3 hours ago",
    "The Morning After: Amazon reportedly exploring free cell phone service for Prime subscribers",
    "Google's Pixel 7 falls to $499 and comes with a $100 Amazon gift card",
    "Hitting the Books: Why we like bigger things better",
    "By A. Tarantola, 06.04.2023",
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service",
    "By N. Ingraham, 06.04.2023",
    "Scientists claim they're the first to transmit space-based solar power to Earth",
    "Nintendo's '1-2 Switch' party game is getting a sequel",
    "Fitbit users can log in with their Google accounts starting on June 6th",
    "Microsoft is killing the standalone Cortana app for Windows in late 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]