[
    "BMW reveals three new EVs for its summer 2023 lineup 21 hours ago",
    "With ‘Final Fantasy XVI’, the series tries a new direction 05.22.2023",
    "14 relaxing video games to help you destress 05.22.2023",
    "Comcast launches $20 live TV streaming service with 60 channels an hour ago",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "By D. Hardawar, 4 hours ago",
    "The Arturia KeyLab Essential mk3 is full-featured, eco-friendly and reasonably priced",
    "By T. O'Brien, 3 hours ago",
    "Dyson says its 360 Vis Nav has 'twice the suction' of any other robot vacuum",
    "NVIDIA RTX 4060 Ti (8GB) review: Better 1080p ray tracing for $399",
    "By D. Hardawar, 6 hours ago",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Comcast launches $20 live TV streaming service with 60 channels",
    "Sony's ZV-1 II has a wide lens so you can fit your whole face in while vlogging",
    "US Surgeon General says social media can pose 'a profound risk' to teens' mental health",
    "The Backbone One PlayStation Edition controller finally arrives on Android",
    "Amazon again accused of breaking labor laws at unionized warehouse",
    "By W. Shanklin, 2 hours ago",
    "Ford will add AM radio to EVs following concerns over emergency alerts",
    "Uber will offer Waymo robotaxi rides and deliveries in Phoenix starting later this year",
    "By I. Bonifacic, 2 hours ago",
    "Chrome makes it easier to customize your browser's look",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsoft confirms 365 Copilot AI will be 'natively integrated' into Edge",
    "By A. Tarantola, 4 hours ago",
    "Windows 11 is getting better live captions and Bluetooth LE audio support",
    "By S. Buckley, 4 hours ago",
    "Bing Search is coming to ChatGPT",
    "By S. Fielding, 4 hours ago",
    "Binance reportedly mixed customer funds with company revenue at a US bank",
    "Apple strikes 'multibillion-dollar' deal with Broadcom for 5G parts",
    "Watch the Microsoft Build keynotes here, starting at 12PM ET",
    "The best E Ink tablets for 2023",
    "By V. Palladino, 4 hours ago",
    "Moog celebrates 70th anniversary with musical web app",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]