[
    "BMW reveals three new EVs for its summer 2023 lineup 05.22.2023",
    "The best iPhone cases for 2023 18 hours ago",
    "Comcast launches $20 live TV streaming service with 60 channels 19 hours ago",
    "The best sleep apps and gadgets for a better night's sleep 05.22.2023",
    "Windows 11 finally gets native RAR support",
    "Virgin Orbit gets stripped for parts as the company shuts down",
    "By S. Fielding, 2 hours ago",
    "SpaceX wants to join the FAA as defendant in environmental groups' Starship lawsuit",
    "Sony says it sold 600,000 PS VR 2 units in six weeks",
    "Amazon's Fire TV Cube falls to a new all-time low in streaming sale",
    "By S. Fielding, 4 hours ago",
    "Hasbro's augmented reality 'Twister' lets you play by yourself",
    "By S. Buckley, 9 minutes ago",
    "Tom Morello's iconic guitar rig is now a $119 plugin",
    "By T. O'Brien, 9 minutes ago",
    "AMD’s RX 7600 graphics card promises smooth 1080p gaming for lower $269 price",
    "Samsung Galaxy Watch 6 leak suggests the rotating bezel will return",
    "By S. Fielding, 23 minutes ago",
    "The Fujifilm X-S20 puts vlogging right on it its dial",
    "The Morning After: Dyson claims its next-gen robot vacuum has twice the suction of rivals",
    "The EOS R100 is Canon's cheapest R-series mirrorless camera yet",
    "Logitech's Pro X 2 gaming headset promises longer battery life",
    "Soundcloud will lay off eight percent of its staff in hopes of becoming profitable",
    "By S. Buckley, 16 hours ago",
    "Watch the Microsoft Build 2023 keynote in under 10 minutes",
    "The best iPhone cases for 2023",
    "By V. Palladino, 18 hours ago",
    "White House reveals its next steps toward 'responsible' AI development",
    "By A. Tarantola, 18 hours ago",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "By I. Bonifacic, 18 hours ago",
    "Netflix starts charging for account sharing in the US",
    "By J. Fingas, 18 hours ago",
    "Universal Music Group partners with Endel for AI-generated wellness soundscapes",
    "By W. Shanklin, 18 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]