[
    "Even the cheapest Tesla Model 3 now qualifies for the full $7,500 tax credit 06.03.2023",
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service 5 hours ago",
    "The best laptops for college students 06.02.2023",
    "Microsoft is killing the standalone Cortana app for Windows in late 2023 06.03.2023",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "VW unveils the larger ID.Buzz electric van headed to North America",
    "Apple needs to prove why its mixed reality headset matters",
    "By D. Hardawar, 06.02.2023",
    "Everyone is selling VPNs, and that's a problem for security",
    "Sonos speakers are up to 25 percent off, plus the rest of this week's best tech deals",
    "By A. Skorheim, 06.02.2023",
    "The Meta Quest 3 is a $499 mixed reality headset with full-color passthrough",
    "NVIDIA's generative AI lets gamers converse with NPCs",
    "NASA's SLS rocket is $6 billion over budget and six years behind schedule",
    "‘Diablo IV’ review: A mechanically perfect romp through a shallow world",
    "The best MacBooks for 2023: How to pick the best Apple laptop",
    "Final Cut Pro and Logic Pro for the iPad make a compelling case for a tablet-based studio",
    "By N. Ingraham, 11 minutes ago",
    "Hitting the Books: Why we like bigger things better",
    "By A. Tarantola, 3 hours ago",
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service",
    "By N. Ingraham, 5 hours ago",
    "Scientists claim they're the first to transmit space-based solar power to Earth",
    "By D. Wollman, 17 hours ago",
    "Nintendo's '1-2 Switch' party game is getting a sequel",
    "Fitbit users can log in with their Google accounts starting on June 6th",
    "Microsoft is killing the standalone Cortana app for Windows in late 2023",
    "Even the cheapest Tesla Model 3 now qualifies for the full $7,500 tax credit",
    "Twitter’s head of brand safety and ad quality has left the company",
    "By W. Shanklin, 06.02.2023",
    "Man allegedly used a Nintendo ‘Duck Hunt’ gun to rob convenience store",
    "Meta will require staff to be in the office at least three days a week",
    "The best laptops for college students",
    "The best gifts for teachers",
    "8BitDo’s Xbox-licensed arcade stick is wireless and customizable",
    "Google Nest WiFi Pro 6E router packs are up to 17 percent off on Amazon",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]