[
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs 05.20.2023",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET 15 hours ago",
    "iMessage Contact Key Verification could arrive with iOS 16.6 05.20.2023",
    "The Apple Watch Series 8 drops to $329 at Amazon 19 hours ago",
    "'BlackBerry' review: The comedy and tragedy of the innovator's dilemma",
    "By D. Hardawar, 05.19.2023",
    "Hyundai will pay $200 million after a TikTok challenge exposed a huge security flaw",
    "Disney’s pricey, immersive Star Wars hotel is shutting down",
    "NASA picks Blue Origin to build the Artemis V Moon landing system",
    "Solo Stove fire pits are up to 45 percent off, plus the rest of this week's best tech deals",
    "By A. Skorheim, 05.19.2023",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "By D. Cooper, 5 minutes ago",
    "Lego's new 2,650-piece Pac-Man arcade set includes a mechanical crank",
    "By S. Dent, 37 minutes ago",
    "Sony's WH-1000XM5 ANC headphones fall back to $348 at Amazon",
    "Meta reportedly wants to license Magic Leap’s AR technology",
    "By I. Bonifacic, 13 hours ago",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET",
    "By I. Bonifacic, 15 hours ago",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "By I. Bonifacic, 16 hours ago",
    "Here’s a first look at ‘System Shock 2: Enhanced Edition’",
    "By I. Bonifacic, 18 hours ago",
    "The Apple Watch Series 8 drops to $329 at Amazon",
    "By I. Bonifacic, 19 hours ago",
    "Hitting the Books: How music chords hack your brain to elicit emotion",
    "By A. Tarantola, 20 hours ago",
    "HP OfficeJet printers are bricking following a recent software update",
    "By I. Bonifacic, 05.20.2023",
    "Western Digital promises to release firmware update for failing SanDisk Extreme SSDs",
    "iMessage Contact Key Verification could arrive with iOS 16.6",
    "Apple rejected 1,679,694 App Store submissions in 2022",
    "Ooni pizza ovens are up to 30 percent off for Memorial Day",
    "DoorDash faces lawsuit accusing it of charging iPhone users more for delivery",
    "The tech industry's accessibility-related products and launches this week",
    "San Francisco is reportedly investigating Twitter over possible building code violations",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "‘Overwatch 2’ director explains why hero missions were canceled",
    "By W. Shanklin, 05.19.2023",
    "Disney+ and Hulu will remove a slew of titles on May 26th",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]