[
    "Twitter has reportedly refused to pay its Google Cloud contract 20 hours ago",
    "Ubisoft's open-world Star Wars game is 'Outlaws' and it's coming in 2024 19 hours ago",
    "'Cyberpunk 2077: Phantom Liberty' will take you back to Night City on September 26th 18 hours ago",
    "Xbox Series S will be available with 1TB storage in black for $349 on September 1st 18 hours ago",
    "Reddit sees more than 6,000 communities 'go dark' in protest over API changes",
    "The Morning After: Xbox Series S gets a key upgrade",
    "Meta's open-source MusicGen AI uses text to create song genre mashups",
    "By S. Dent, 43 minutes ago",
    "AT&T starts using Google's Jibe platform for RCS messages",
    "By I. Bonifacic, 14 hours ago",
    "Amazon's Kindle falls back to $80 in e-reader sale",
    "By S. Fielding, an hour ago",
    "Former Samsung executive accused of trying to copy an entire chip plant in China",
    "By S. Fielding, 14 minutes ago",
    "Microsoft's PC Game Pass is coming to NVIDIA's GeForce Now service",
    "'Persona 3 Reload' updates a PS2 classic for modern platforms in early 2024",
    "By I. Bonifacic, 17 hours ago",
    "Overwatch 2's story missions and new PvP mode will land on August 10th",
    "Watch the Summer Game Fest PC Gaming Show here at 4PM ET",
    "‘Towerborne’ is an action-RPG brawler from the makers of The Banner Saga",
    "By W. Shanklin, 17 hours ago",
    "The 'Dear Esther' studio is building an oil-rig horror game, 'Still Wakes the Deep'",
    "By J. Conditt, 18 hours ago",
    "'Clockwork Revolution' is a time-traveling RPG of steampunk anarchy",
    "By A. Tarantola, 18 hours ago",
    "'Metaphor: ReFantazio' is a fantasy RPG from the team behind 'Persona 5'",
    "By I. Bonifacic, 18 hours ago",
    "'Cities Skylines II' will arrive on PC and consoles October 24th",
    "'Cyberpunk 2077: Phantom Liberty' will take you back to Night City on September 26th",
    "Xbox Series S will be available with 1TB storage in black for $349 on September 1st",
    "By W. Shanklin, 18 hours ago",
    "‘Forza Motorsport’ finally arrives on October 10th",
    "'Like a Dragon: Infinite Wealth' will make you see Ichiban's bare butt in early 2024",
    "'Senua's Saga: Hellblade II' will arrive in 2024",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]