[
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack 20 hours ago",
    "Apple’s Vision Pro headset may not come with a top strap in the box 20 hours ago",
    "NASA is creating a ChatGPT-like assistant for astronauts",
    "Lucid will power Aston Martin's future EVs",
    "Netflix is removing its 'basic' plan in Canada",
    "By S. Fielding, 3 hours ago",
    "Twitter hacker and crypto scammer sentenced to five years in prison",
    "By I. Bonifacic, 06.24.2023",
    "Apple’s second-generation AirPods Pro are back on sale for $200",
    "The best work-from-home and office essentials for graduates",
    "By Engadget, 18 minutes ago",
    "The Morning After: NASA is recycling 98 percent of astronaut pee on the ISS into drinkable water",
    "Samsung's latest Pokémon-themed Galaxy Buds are too cute",
    "By S. Fielding, 2 hours ago",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "By I. Bonifacic, 16 hours ago",
    "NASA is recycling 98 percent of astronaut pee and sweat on the ISS into drinkable water",
    "By I. Bonifacic, 18 hours ago",
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack",
    "By I. Bonifacic, 20 hours ago",
    "Apple’s Vision Pro headset may not come with a top strap in the box",
    "Hitting the Books: How hackers turned cybercrime into a commercial service",
    "By A. Tarantola, a day ago",
    "'The Elder Scrolls VI' is 'likely five-plus years away,' says Xbox chief",
    "‘Star Trek: Prodigy’ will be pulled from Paramount+ next week",
    "Russia blocks access to Google News after Wagner Group forces threaten to topple military",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Moto Razr+ review: Finally some real competition for Samsung’s Flip foldables",
    "Fossil finally gets Google Assistant on its Wear OS 3 smartwatches",
    "A Reddit transcription community will shut down over a 'lack of trust' in the platform",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]