[
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack a day ago",
    "'The Elder Scrolls VI' is 'likely five-plus years away,' says Xbox chief 06.24.2023",
    "Virgin Galactic will start commercial spaceflight on June 29th 3 hours ago",
    "Twitter hacker and crypto scammer sentenced to five years in prison 06.24.2023",
    "The best free games for 2023",
    "Lucid will power Aston Martin's future EVs",
    "The Biden administration’s $42 billion broadband program is finally getting underway",
    "Apple’s Vision Pro headset may not come with a top strap in the box",
    "By I. Bonifacic, 06.25.2023",
    "Amazon will use small businesses to help deliver packages in the US",
    "Meta’s Quest+ subscription offers two VR titles per month",
    "By K. Holt, 43 minutes ago",
    "Urtopia's Chord e-bike is a little overkill for a city ride and that's okay",
    "Qualcomm introduces new Snapdragon 4 Gen 2 chipsets for budget-friendly phones",
    "The best smart displays you can buy",
    "Virgin Galactic will start commercial spaceflight on June 29th",
    "A 5G deadline could ground some US flights starting July 1st",
    "By S. Fielding, 4 hours ago",
    "The best work-from-home and office essentials for graduates",
    "The Morning After: NASA is recycling 98 percent of astronaut pee on the ISS into drinkable water",
    "Samsung's latest Pokémon-themed Galaxy Buds are too cute",
    "By S. Fielding, 5 hours ago",
    "Netflix is removing its 'basic' plan in Canada",
    "By S. Fielding, 7 hours ago",
    "NASA is creating a ChatGPT-like assistant for astronauts",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "By I. Bonifacic, 20 hours ago",
    "NASA is recycling 98 percent of astronaut pee and sweat on the ISS into drinkable water",
    "By I. Bonifacic, a day ago",
    "'Diablo IV' and other Blizzard games were down on Sunday due to a DDoS attack",
    "Hitting the Books: How hackers turned cybercrime into a commercial service",
    "By A. Tarantola, 06.25.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]