[
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement 05.28.2023",
    "Portugal considers banning Huawei from national 5G networks 05.28.2023",
    "The best Nintendo Switch controllers for every player level an hour ago",
    "NASA's SLS rocket is $6 billion over budget and six years behind schedule 05.29.2023",
    "The Morning After: NASA's SLS rocket is already $6 billion over budget",
    "AI presents 'risk of extinction' on par with nuclear war, industry leaders say",
    "NVIDIA's generative AI lets gamers converse with NPCs",
    "Apple’s free My Photo Stream service will shut down on July 26th",
    "By I. Bonifacic, 05.27.2023",
    "Japan will try to beam solar power from space by 2025",
    "By I. Bonifacic, 05.28.2023",
    "Sony's new WH-CH720N wireless headphones drop to $128 at Amazon",
    "By J. Fingas, 19 minutes ago",
    "The best Nintendo Switch controllers for every player level",
    "NVIDIA's G-Sync ULMB 2 aims to minimize motion blur in games",
    "ARM's latest CPUs push Android phone makers toward 64-bit only devices",
    "By J. Fingas, 21 hours ago",
    "Tesla will open its Supercharger network to other EVs in Canada",
    "WhatsApp test brings screen sharing to Android phones",
    "By S. Fielding, 05.29.2023",
    "Microsoft's Xbox Elite Series 2 controller is $35 off right now",
    "The Morning After: Japan will try to beam solar power from space by 2025",
    "NASA's SLS rocket is $6 billion over budget and six years behind schedule",
    "NVIDIA's next DGX supercomputer is all about generative AI",
    "Portugal considers banning Huawei from national 5G networks",
    "A lawyer faces sanctions after he used ChatGPT to write a brief riddled with fake citations",
    "Meta’s Quest 3 headset could feature color cameras for more lifelike pass-through video",
    "Hitting the Books: Renee Descartes had his best revelations while baked in an oven",
    "By A. Tarantola, 05.28.2023",
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]