[
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990 06.13.2023",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing 19 hours ago",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard 06.12.2023",
    "92Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros 06.12.2023",
    "Anker's new Solix home energy storage includes a modular solar battery system",
    "McDonald's just released a Grimace Game Boy Color game",
    "My quest for the perfect productivity mouse",
    "Microsoft-Activision Blizzard merger temporarily blocked by US judge",
    "The best MacBooks for 2023: How to pick the best Apple laptop",
    "The best Apple Watch accessories for 2023",
    "By V. Palladino, 18 minutes ago",
    "EU could breakup Google’s ad business over antitrust violations",
    "By S. Dent, 30 minutes ago",
    "Vodafone and Three plan to merge into the UK's largest mobile network",
    "By S. Fielding, 39 minutes ago",
    "Shark's self-emptying robot vacuum with a 30-day capacity base is 45 percent off",
    "The Morning After: OpenAI and Microsoft aren’t happy",
    "Google Home's new script editor can make smart device automations even more powerful",
    "Google's 'Katamari Damacy' easter egg lets you roll up your search results",
    "Fast-paced platformer 'Neon White' is coming to Xbox",
    "Pandemic-era hit 'Phasmophobia' is coming to consoles this August",
    "By J. Fingas, 16 hours ago",
    "Popular subreddits plan to extend API protests indefinitely",
    "By W. Shanklin, 16 hours ago",
    "The best kitchen gadgets for 2023",
    "'33 Immortals' first look: Defying a god is more fun with friends",
    "Reddit's CEO reportedly told staff that the community's API protest will blow over",
    "'Forza Motorsport' wants you to drive forever",
    "By A. Souppouris, 19 hours ago",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing",
    "By W. Shanklin, 19 hours ago",
    "Spotify has been fined $5.4 million for violating GDPR data rules",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]