[
    "Amazon is reportedly trying to offer Prime subscribers free cell phone service 06.04.2023",
    "The God of War: Ragnarok PlayStation 5 bundle is cheaper than ever 21 hours ago",
    "iOS 17 drops support for the iPhone 8 and X 15 hours ago",
    "Watch Apple’s WWDC 2023 keynote in 23 minutes",
    "By W. Shanklin, 12 hours ago",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "By D. Hardawar, 5 hours ago",
    "Apple previews new accessibility features, including a way to clone your voice",
    "By K. Malone, 17 hours ago",
    "Apple's Optic ID will let you log in to the Vision Pro headset with your eyes",
    "By J. Fingas, 16 hours ago",
    "How to order the 15-inch Apple MacBook Air",
    "By V. Palladino, 16 hours ago",
    "Amazon Fire Kids tablets are up to 50 percent off right now",
    "By S. Fielding, 37 minutes ago",
    "Meta’s Oversight Board says the company’s rules are (slowly) changing for the better",
    "Twitter's ad sales have reportedly dropped by 59 percent since last year",
    "Microsoft will pay the FTC $20 million to settle charges over collecting children's data",
    "WWDC 2023: Vision Pro, iOS 17 and everything else Apple announced today",
    "By J. Fingas, 13 hours ago",
    "Apple MacBook Air 15-inch preview: Portable power",
    "Apple Vision Pro first look: A glimpse at the spatial computing future",
    "By D. Hardawar, 15 hours ago",
    "iOS 17 drops support for the iPhone 8 and X",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "By A. Tarantola, 16 hours ago",
    "Safari gets major privacy updates and the ability to put web apps in your dock",
    "By T. O'Brien, 17 hours ago",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "By S. Rutherford, 17 hours ago",
    "Apple announces kid-friendly features to reduce eye strain",
    "FaceTime is coming to Apple TV",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "By W. Shanklin, 17 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]