[
    "With ‘Final Fantasy XVI’, the series tries a new direction 05.22.2023",
    "14 relaxing video games to help you destress a day ago",
    "Watch Axiom Space’s second private flight to the ISS with us at 5PM ET 05.21.2023",
    "The best sleep apps and gadgets for a better night's sleep 05.22.2023",
    "Dyson says its 360 Vis Nav has 'twice the suction' of any other robot vacuum",
    "The new Ableton Push is an MPE-enabled standalone music production powerhouse",
    "By T. O'Brien, 5 hours ago",
    "Adobe adds generative AI editing to Photoshop",
    "By W. Shanklin, 3 hours ago",
    "BMW reveals three new EVs for its summer 2023 lineup",
    "By W. Shanklin, 16 hours ago",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "By J. Fingas, 14 minutes ago",
    "AMD's new Ryzen and Athlon chips for Chromebooks promise big battery improvements",
    "By S. Rutherford, 33 minutes ago",
    "NVIDIA RTX 4060 Ti (8GB) review: Better 1080p ray tracing for $399",
    "By D. Hardawar, 33 minutes ago",
    "Amazon's latest Fire tablet is a $230 Android-powered 2-in-1",
    "Samsung's new Sensor OLED display can read fingerprints anywhere on the screen",
    "Skullcandy's latest cheap earbuds cost just $20",
    "The Morning After: WhatsApp finally lets you fix your message typos",
    "Netflix makes it easier to find titles you've added to your list but haven't watched yet",
    "Amazon has a big sale on Razer gaming accessories and peripherals",
    "By S. Fielding, 4 hours ago",
    "Amazon's Kindle Scribe updates include support for direct on-page writing",
    "Xbox games will hit cloud gaming service Boosteroid for the first time in June",
    "TikTok is suing Montana over statewide ban",
    "By W. Shanklin, 17 hours ago",
    "The best WiFi extenders in 2023",
    "By V. Palladino, 19 hours ago",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "The best robot vacuums for 2023",
    "By V. Palladino, 21 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]