[
    "Microsoft says China installed malware in US systems in Guam 18 hours ago",
    "Meta is laying off employees for the third time in less than three months 20 hours ago",
    "Pegasus spyware found on phones of Mexican president's close ally a day ago",
    "iOS 17 will reportedly turn your locked iPhone into a smart display 20 hours ago",
    "'Project Q' is a dedicated PS5 streaming device due later this year",
    "By I. Bonifacic, 16 hours ago",
    "'Lego 2K Drive' lets you build your dream race car, brick by brick",
    "The Arc internet browser lets you customize (or vandalize) any website",
    "By N. Ingraham, 34 minutes ago",
    "Assassin's Creed Mirage will arrive on October 12",
    "By S. Buckley, 17 hours ago",
    "By I. Bonifacic, 15 hours ago",
    "Google Play Games for PC is now available in Europe and New Zealand",
    "By J. Fingas, 6 minutes ago",
    "The best fitness trackers for 2023",
    "By V. Palladino, 19 minutes ago",
    "Samsung's HW-Q900C premium soundbar launches today for $1,400",
    "By M. Moon, 33 minutes ago",
    "Abode's entry-level Smart Home Security Kit only costs $160 but drops HomeKit support",
    "Acer’s 16-inch Predator Triton and Swift Edge laptops are aimed at gamers and creators",
    "By L. Bonk, 34 minutes ago",
    "How to screen record on iPhone",
    "By J. Mercado, an hour ago",
    "ChatGPT for iOS is now available in 11 more countries",
    "By S. Fielding, an hour ago",
    "Get three months of the Paramount+/Showtime bundle for $18",
    "The Morning After: Sony reveals its PS5 streaming handheld",
    "WhatsApp may soon introduce usernames",
    "By S. Fielding, 3 hours ago",
    "Amazon sale discounts Western Digital and SanDisk storage by up to 53 percent",
    "By S. Fielding, 4 hours ago",
    "Apple's AirTag 4-pack falls to $87",
    "New Microsoft Surface Pro X bug causes camera to stop working",
    "'Ghostrunner 2' will bring together cyberpunk ninjas and motorbikes this year",
    "First look at 'Spider-Man 2' gameplay shows Spidey in the Venom suit",
    "By N. Ingraham, 16 hours ago",
    "Bungie revives 'Marathon' as a multiplayer shooter",
    "By J. Fingas, 16 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]