[
    "Apple’s M1 iPad Air drops to $500 at Amazon 16 hours ago",
    "The Morning After: The verdict on 'Zelda: Tears of the Kingdom' 05.12.2023",
    "PlayStation VR2 is finally available at retailers 05.12.2023",
    "Anthropic says its Claude AI can now read a whole book in under a minute 05.12.2023",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Apple Silicon Macs now natively support Unreal Engine 5",
    "'Hogwarts Legacy' just got hit with another massive delay",
    "How to choose the best pizza oven in 2023",
    "How wood-scanning tech is taking the guesswork out of aging bourbon",
    "Pixel Tablet hands-on: Basically a $500 smart display with a detachable screen",
    "The Apple Watch Series 9 may finally get a new processor",
    "Google Pixel Fold hands-on: Finally, a real rival for Samsung’s foldables",
    "Jack Dorsey-backed Bluesky is having a moment",
    "Vast and SpaceX plan to launch the first commercial space station in 2025",
    "'Elden Ring' has sold more than 20 million copies",
    "By I. Bonifacic, 9 hours ago",
    "Apple offers a free one-month trial of MLS Season Pass to new and returning subscribers",
    "By I. Bonifacic, 10 hours ago",
    "Meta fixed a Facebook bug that sent automatic friend requests to users",
    "By I. Bonifacic, 11 hours ago",
    "Google faces antitrust compliance review in India following Match Group complaint",
    "By I. Bonifacic, 14 hours ago",
    "Apple’s M1 iPad Air drops to $500 at Amazon",
    "By I. Bonifacic, 16 hours ago",
    "Binance leaves Canada due to stricter crypto rules",
    "The US government wants to recall 67 million airbag inflators",
    "Korg Berlin shows off a prototype 'acoustic synthesizer'",
    "Former ByteDance exec claims company used bots to inflate TikTok engagement",
    "Nuro lays off 30 percent of staff, shifts focus to R&D",
    "By W. Shanklin, 05.12.2023",
    "YouTuber pleads guilty to intentionally crashing his plane for a wallet sponsorship",
    "The best gaming laptops for 2023",
    "By D. Hardawar, 05.12.2023",
    "‘Layers of Fear’ collection gets a terrifying demo on Steam",
    "'Hogwarts Legacy' on Switch just got hit with another massive delay",
    "How to make the most of that Instant Pot you just bought",
    "PlayStation VR2 is finally available at retailers",
    "Tesla recalls over 1.1 million cars in China over braking flaw",
    "Amazon's Fire TV Stick 4K Max drops to $35, plus the rest of this week's best tech deals",
    "By A. Skorheim, 05.12.2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]