[
    "Microsoft says China installed malware in US systems in Guam an hour ago",
    "iOS 17 will reportedly turn your locked iPhone into a smart display 4 hours ago",
    "Pegasus spyware found on phones of Mexican president's close ally 5 hours ago",
    "BMW reveals three new EVs for its summer 2023 lineup 05.22.2023",
    "The EOS R100 is Canon's cheapest R-series mirrorless camera yet",
    "Former Google CEO says AI poses an 'existential risk' that puts lives in danger",
    "Samsung's 2023 Smart Monitors arrive in June, starting at $280",
    "AMD’s RX 7600 graphics card promises smooth 1080p gaming for lower $269 price",
    "Virgin Orbit gets stripped for parts as the company shuts down",
    "By S. Fielding, 9 hours ago",
    "Assassin's Creed Mirage will arrive on October 12",
    "By S. Buckley, 7 minutes ago",
    "'Sword of the Sea' is a fantasy surfing adventure from the creators of 'Abzû'",
    "By J. Fingas, 10 minutes ago",
    "‘The Talos Principle 2’ brings mind-bending puzzles to a new generation",
    "By W. Shanklin, 12 minutes ago",
    "'Metal Gear Solid 3: Snake Eater' is being remade for modern platforms",
    "By I. Bonifacic, 16 minutes ago",
    "'Neva' is the next gorgeous-looking game from 'Gris' developer Nomada Studio",
    "By K. Holt, 16 minutes ago",
    "'Helldivers 2' is coming to PS5 and PC later this year",
    "By K. Holt, 36 minutes ago",
    "'Fairgame$' looks like Payday and The Division with a Gen-Z twist",
    "By J. Conditt, 39 minutes ago",
    "Microsoft says China installed malware in US systems in Guam",
    "Google and the European Commission will collaborate on AI ground rules",
    "By W. Shanklin, 2 hours ago",
    "Watch the PlayStation Showcase here at 4PM ET",
    "All the big tech layoffs of 2023",
    "Meta is laying off employees for the third time in less than three months",
    "iOS 17 will reportedly turn your locked iPhone into a smart display",
    "Pegasus spyware found on phones of Mexican president's close ally",
    "'League of Legends' pros could stage a walkout to protect the esport's minor leagues",
    "The best PC games for 2023",
    "The best smart home gadgets for 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]