[
    "Nintendo Switch Online gets four classic Genesis games, including Ghouls ’n Ghosts 14 hours ago",
    "Amazon's Fire HD 10 tablet is 50 percent off in early Prime Day sale a day ago",
    "‘Final Fantasy XVI’ has already sold over 3 million copies 16 hours ago",
    "Amazon's latest Echo Buds fall to a new all-time low of $35 in early Prime Day deal a day ago",
    "Kia EV9 first drive: Adding a third row to the EV market",
    "By R. Baldwin, 19 hours ago",
    "Bloober Team is done making psychological horror games",
    "By J. Conditt, 16 hours ago",
    "I consider myself a patient person, but 'The Password Game' might break me",
    "By I. Bonifacic, 15 hours ago",
    "North America’s first hydrogen-powered train debuts in Canada",
    "By W. Shanklin, 15 hours ago",
    "The best music streaming services in 2023",
    "Researchers reconstruct 3D environments from eye reflections",
    "By W. Shanklin, 12 hours ago",
    "Women’s soccer teams are coming to Football Manager in 2024",
    "'World of Warcraft Classic Hardcore' brings permadeath to Blizzard's MMO",
    "By I. Bonifacic, 13 hours ago",
    "Nintendo Switch Online gets four classic Genesis games, including Ghouls ’n Ghosts",
    "PlayStation Plus free July games include ‘CoD: Black Ops Cold War’ and ‘Alan Wake Remastered’",
    "By W. Shanklin, 14 hours ago",
    "Film director Roland Emmerich is creating a shared universe of TV, gaming and Web3 tomfoolery",
    "Venmo now supports tap to pay on Android phones",
    "By J. Fingas, 15 hours ago",
    "Vizio's redesigned TV interface helps you quickly find shows",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "‘Final Fantasy XVI’ has already sold over 3 million copies",
    "Microsoft is already offering a generative AI certification program",
    "By W. Shanklin, 16 hours ago",
    "Android TV's new Shop tab lets you buy movies from different providers",
    "By S. Fielding, 16 hours ago",
    "The best DACs for Apple Music Lossless in 2023",
    "A Samsung Galaxy S23 FE may be on the way later this year",
    "OnePlus' first foldable phone will reportedly feature a 2K screen",
    "By J. Fingas, 18 hours ago",
    "The best Xbox games for 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]