[
    "Apple’s free My Photo Stream service will shut down on July 26th 05.27.2023",
    "Japan will try to beam solar power from space by 2025 8 hours ago",
    "Portugal considers banning Huawei from national 5G networks 10 hours ago",
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement 16 hours ago",
    "Tesla leak reveals thousands of Autopilot safety complaints",
    "After a rocky start, Formula E’s Gen3 car is living up to its potential",
    "YouTube will allow unlimited simultaneous streams for NFL Sunday Ticket",
    "Neuralink receives FDA clearance to begin human trials of its brain-computer interface",
    "By A. Tarantola, 05.25.2023",
    "Samsung's Galaxy Tab S8+ falls to an all-time low in Amazon sale",
    "By S. Fielding, 05.26.2023",
    "NVIDIA's next DGX supercomputer is all about generative AI",
    "Japan will try to beam solar power from space by 2025",
    "By I. Bonifacic, 8 hours ago",
    "Portugal considers banning Huawei from national 5G networks",
    "By I. Bonifacic, 10 hours ago",
    "A lawyer faces sanctions after he used ChatGPT to write a brief riddled with fake citations",
    "By I. Bonifacic, 12 hours ago",
    "Meta’s Quest 3 headset could feature color cameras for more lifelike pass-through video",
    "By I. Bonifacic, 14 hours ago",
    "Hitting the Books: Renee Descartes had his best revelations while baked in an oven",
    "By A. Tarantola, 16 hours ago",
    "US judge grants final approval to Apple’s $50 million ‘butterfly’ keyboard settlement",
    "By I. Bonifacic, 16 hours ago",
    "Apple’s free My Photo Stream service will shut down on July 26th",
    "By I. Bonifacic, 05.27.2023",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Twitter pulls out of EU’s voluntary Code of Practice against disinformation",
    "iRobot's Roomba j7+ Combo vacuum is $300 off right now",
    "By A. Skorheim, 05.27.2023",
    "Japan's ispace says Hakuto-R crashed because it got confused by a crater rim",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Google fined $32.5 million for infringing on Sonos patent",
    "By N. Ingraham, 05.26.2023",
    "Naughty Dog says its Last of Us multiplayer game needs more time in the oven",
    "Bluesky now lets you choose your own algorithm",
    "How to watch the Summer Games Done Quick 2023 speedrun marathon",
    "The best Memorial Day tech sales we could find",
    "Swiss researchers use a wireless BCI to help a spinal injury patient walk more naturally",
    "By A. Tarantola, 05.26.2023",
    "The best DACs for Apple Music Lossless in 2023",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]