[
    "Twitter has reportedly refused to pay its Google Cloud contract a day ago",
    "1096Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference an hour ago",
    "Ubisoft's open-world Star Wars game is 'Outlaws' and it's coming in 2024 21 hours ago",
    "'Cyberpunk 2077: Phantom Liberty' will take you back to Night City on September 26th 20 hours ago",
    "Reddit sees more than 6,000 communities 'go dark' in protest over API changes",
    "The Morning After: Xbox Series S gets a key upgrade",
    "Former Samsung executive accused of trying to copy an entire chip plant in China",
    "By S. Fielding, 2 hours ago",
    "AT&T starts using Google's Jibe platform for RCS messages",
    "By I. Bonifacic, 16 hours ago",
    "Amazon's Kindle falls back to $80 in e-reader sale",
    "By S. Fielding, 3 hours ago",
    "'Alan Wake II' stands out in a sea of sequels",
    "By J. Conditt, 12 minutes ago",
    "Google, OpenAI will share AI models with the UK government",
    "By J. Fingas, 29 minutes ago",
    "'Immortals of Aveum' first look: A little more magic and this might be wonderful",
    "By J. Conditt, 42 minutes ago",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "By N. Ingraham, an hour ago",
    "Samsung’s 49-inch curved OLED gaming display is $2,200",
    "Meta's open-source MusicGen AI uses text to create song genre mashups",
    "Microsoft's PC Game Pass is coming to NVIDIA's GeForce Now service",
    "'Persona 3 Reload' updates a PS2 classic for modern platforms in early 2024",
    "By I. Bonifacic, 19 hours ago",
    "Overwatch 2's story missions and new PvP mode will land on August 10th",
    "Watch the Summer Game Fest PC Gaming Show here at 4PM ET",
    "‘Towerborne’ is an action-RPG brawler from the makers of The Banner Saga",
    "By W. Shanklin, 19 hours ago",
    "The 'Dear Esther' studio is building an oil-rig horror game, 'Still Wakes the Deep'",
    "By J. Conditt, 19 hours ago",
    "'Clockwork Revolution' is a time-traveling RPG of steampunk anarchy",
    "By A. Tarantola, 20 hours ago",
    "'Metaphor: ReFantazio' is a fantasy RPG from the team behind 'Persona 5'",
    "By I. Bonifacic, 20 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]