[
    "Amazon's Fire HD 10 tablet is 50 percent off in early Prime Day sale 8 hours ago",
    "The best smartphones you can buy right now 06.27.2023",
    "Amazon's latest Echo Buds fall to a new all-time low of $35 in early Prime Day deal 7 hours ago",
    "Nintendo says it'll be easy to transfer over to its next console 20 hours ago",
    "Kia EV9 first drive: Adding a third row to the EV market",
    "By R. Baldwin, 3 hours ago",
    "‘Final Fantasy XVI’ has already sold over 3 million copies",
    "Google is no longer building its own augmented reality glasses",
    "Shokz OpenFit delivers open-ear audio without bone conduction",
    "The best gaming handhelds in 2023",
    "Vizio's redesigned TV interface helps you quickly find shows",
    "By J. Fingas, 12 minutes ago",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "By K. Holt, 27 minutes ago",
    "Bloober Team is done making psychological horror games",
    "By J. Conditt, 42 minutes ago",
    "Microsoft is already offering a generative AI certification program",
    "By W. Shanklin, an hour ago",
    "Android TV's new Shop tab lets you buy movies from different providers",
    "By S. Fielding, an hour ago",
    "The best DACs for Apple Music Lossless in 2023",
    "A Samsung Galaxy S23 FE may be on the way later this year",
    "OnePlus' first foldable phone will reportedly feature a 2K screen",
    "The best Xbox games for 2023",
    "'Project Loki' looks like a rad mix of 'League of Legends' and 'Fortnite'",
    "By I. Bonifacic, 4 hours ago",
    "Peloton expands its gamified exercise experience to treadmills",
    "Google's Nest Learning Thermostat is $70 off right now",
    "By S. Fielding, 4 hours ago",
    "The best cheap kitchen gadgets in 2023",
    "By I. Bonifacic, 5 hours ago",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "The Morning After: TikTok is killing off its BeReal clone",
    "Amazon's latest Echo Buds fall to a new all-time low of $35 in early Prime Day deal",
    "Former Apple Arcade exclusive, 'Air Twister,' is coming to PC and consoles",
    "By S. Fielding, 8 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]