[
    "James Webb telescope finds water around a comet in the main asteroid belt 2 hours ago",
    "The best iPhone accessories for 2023 9 hours ago",
    "Apple's 'M3 Pro' chipset could feature 12 CPU cores 05.14.2023",
    "iPhone syncing for Windows 11 is now available for everyone 3 hours ago",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "Elon Musk loses appeal to tweet whatever he wants about Tesla",
    "TCL's new 2023 TVs deliver high frame rate gaming at lower prices",
    "Amazon is making a 'Lord of the Rings' MMO",
    "Hatch Restore 2 review: Better sleep behind a paywall",
    "By A. Skorheim, 10 hours ago",
    "The best immersion blenders you can buy in 2023",
    "By S. Rutherford, an hour ago",
    "James Webb telescope finds water around a comet in the main asteroid belt",
    "iPhone syncing for Windows 11 is now available for everyone",
    "By W. Shanklin, 3 hours ago",
    "'Layers of Fear' remake launches on PC, PS5 and Xbox June 15th",
    "The best smartwatches for 2023",
    "By V. Palladino, 3 hours ago",
    "The IRS reportedly has a free TurboTax alternative in the works",
    "By S. Buckley, 4 hours ago",
    "Sonos is ending support for local file playback on Android",
    "Hasselblad is reportedly the latest camera maker to bail on DSLRs",
    "By W. Shanklin, 4 hours ago",
    "WhatsApp's new privacy feature locks sensitive chats and hides them from notifications",
    "The best video streaming services in 2023",
    "'Avatar: The Way of Water' is coming to Disney+ and Max on June 7th",
    "Hackers breach Philadelphia Inquirer ahead of Tuesday’s mayoral primary",
    "By W. Shanklin, 6 hours ago",
    "The best GPS running watches for 2023",
    "By D. Wollman, 6 hours ago",
    "The EU approves Microsoft's $68.7 billion Activision Blizzard takeover",
    "Most states halt use of Google and Apple's COVID-19 exposure notification system",
    "Samsung Smart Monitors are up to 25 percent off right now",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]