[
    "James Webb telescope finds water around a comet in the main asteroid belt 05.15.2023",
    "The best smartwatches for 2023 05.15.2023",
    "iPhone syncing for Windows 11 is now available for everyone 05.15.2023",
    "Apple's Mac Mini M2 falls back to an all-time low of $500 05.16.2023",
    "Beats Studio Buds + review: A little bit better in every way",
    "Theranos founder Elizabeth Holmes fails in bid to stay out of prison during appeal",
    "Valve is the latest company to be sued by Immersion over its Steam Deck rumble tech",
    "The best grills and grill accessories in 2023",
    "By B. Steele, 19 hours ago",
    "After two years of updates, the HomePod mini is actually pretty good",
    "What we bought: Are touch-activated faucets smart or silly?",
    "By S. Rutherford, 11 minutes ago",
    "Uber will start rolling out teen accounts with safety features next week",
    "By K. Holt, 12 minutes ago",
    "You can now call an Uber like a normal taxi",
    "By S. Fielding, 12 minutes ago",
    "Sony's next PlayStation Showcase will take place on May 24th",
    "Amazon's redesigned Echo Buds are only $50",
    "Amazon's 2023 Echo Show is faster and offers improved audio",
    "By W. Shanklin, an hour ago",
    "Amazon unveils the $40 Echo Pop, a semi-spherical smart speaker",
    "Eero mesh WiFi routers are up to 50 percent off right now",
    "Adobe’s new AI automates PDF accessibility tags",
    "By W. Shanklin, 2 hours ago",
    "Roku launches the 'Women’s Sports Zone'",
    "By S. Fielding, 2 hours ago",
    "Google's latest AI tackles long and costly drug discovery",
    "The Morning After: Samsung is reportedly sourcing OLED TV panels from rival LG",
    "Tesla may reverse its stance and start advertising",
    "YouTube’s recommendations are leading kids to gun videos, report says",
    "Instagram users can finally comment on posts with GIFs",
    "By I. Bonifacic, 19 hours ago",
    "Overwatch 2's long-awaited co-op story missions will go live in August",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]