[
    "The best tablets for 2023 06.07.2023",
    "Apple's new 15-inch MacBook Air is already $49 off at Amazon 06.07.2023",
    "‘Spider-Man 2’ launches on October 20th 18 hours ago",
    "United is putting 4K displays and Bluetooth on its planes 06.08.2023",
    "Mercedes becomes the first automaker to sell Level 3 self-driving vehicles in California",
    "Apple’s pitch for the Vision Pro couldn’t be more different than the Meta Quest",
    "The DeSantis campaign used AI-generated images to attack Trump",
    "The best Android phones for 2023",
    "By S. Rutherford, an hour ago",
    "'Sonic Superstars' gives classic gameplay another modern makeover",
    "By W. Shanklin, 18 hours ago",
    "Spotify is testing an 'offline mix' that downloads recently played songs",
    "By S. Dent, 31 minutes ago",
    "The best everyday carry gear for dads",
    "By S. Rutherford, 42 minutes ago",
    "'Baby Steps' is the 3D 'QWOP' we've all been waiting for",
    "Engadget Podcast: Apple WWDC 2023 wrap-up",
    "By D. Hardawar, 2 hours ago",
    "Porsche's Mission X concept offers a glimpse at its electric super car future",
    "Amazon's Echo Show 8 is 42 percent off right now",
    "By S. Fielding, 2 hours ago",
    "The Morning After: The games industry is massive, so why is it shrinking?",
    "Meta test puts Reels on the Quest",
    "By S. Fielding, 4 hours ago",
    "Watch the Summer Game Fest keynote in under 20 minutes",
    "Logitech retires the Blue microphone brand",
    "GM EV owners will gain access to Tesla Superchargers in 2024",
    "By S. Buckley, 14 hours ago",
    "Screenshots of Instagram's answer to Twitter leak online",
    "By A. Tarantola, 17 hours ago",
    "'Helskate' mashes together Tony Hawk and Hades",
    "'Final Fantasy VII Remake: Rebirth' is delayed to early 2024",
    "Fortnite's next season features Transformers and rideable raptors",
    "‘Alto’s Adventure’ devs announce new game, and it's all about sheep herding",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]