[
    "Virgin Galactic's final VSS Unity flight test is slated for May 25th 05.17.2023",
    "Apple releases iOS 16.5 with easier access to sports news 13 hours ago",
    "YouTube TV had major issues at the worst possible time last night 17 hours ago",
    "Astronomers identify volcano-covered planet that could have water on its surface 05.17.2023",
    "Vinfast's first EV is almost ready for the world",
    "By R. Baldwin, 12 hours ago",
    "Spacetop is an ‘augmented reality laptop’ for remote working on the go",
    "By S. Fielding, 17 hours ago",
    "'Mortal Kombat 1' reboots the series on September 19th",
    "By J. Fingas, 17 hours ago",
    "ChatGPT now has an official iPhone app",
    "By W. Shanklin, 12 hours ago",
    "Heinz Remix is the sauce dispenser of our dreams",
    "By J. Fingas, 16 hours ago",
    "Twitter reportedly accuses Microsoft of violating its data use policy",
    "TikTok creators sue Montana over statewide ban of the app",
    "PlayStation Plus bug warns that games will expire in 15 minutes",
    "By W. Shanklin, 10 hours ago",
    "'Futurama' returns July 24th as a Hulu original after a 10-year hiatus",
    "Apple TV adds multiview for live sports",
    "By W. Shanklin, 11 hours ago",
    "‘Layers of Fear’ remake is launching on day one for Mac",
    "Nike and Strava partner up for curated workouts and original content",
    "Apple releases iOS 16.5 with easier access to sports news",
    "By J. Fingas, 13 hours ago",
    "The Epic Games Store starts giving users five percent credit back on purchases",
    "The best smart speakers for 2023",
    "By N. Ingraham, 14 hours ago",
    "Peloton finally gets approved repair for treadmill line after 90 injuries and one death",
    "Supreme Court rules in Twitter and YouTube's favor in terrorism liability cases",
    "Twitter Blue subscribers can now upload videos as long as two hours",
    "By W. Shanklin, 14 hours ago",
    "The Xbox web store now includes accessibility filters",
    "Google AI can now answer your questions about uncaptioned images",
    "By J. Fingas, 15 hours ago",
    "Razer's Nommo V2 Pro speakers feature spatial audio and a less painful price",
    "Apple's AirPods Pro are back on sale for $200",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]