[
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’ 17 hours ago",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data 3 hours ago",
    "Netflix's 'Squid Game' reality competition show debuts this November 06.17.2023",
    "Samsung Galaxy Z Flip 5 leak shows a bigger cover display",
    "By I. Bonifacic, 06.17.2023",
    "The Pixel 8 Pro could feature a flat display",
    "By I. Bonifacic, 18 hours ago",
    "Biden administration announces $930 million in grants to expand rural internet access",
    "By I. Bonifacic, a day ago",
    "‘Black Mirror’ finds new life in our modern hellscape",
    "By D. Hardawar, 06.17.2023",
    "Reddit’s average daily traffic fell during blackout, according to third-party data",
    "Samsung brings its self-repair program to the UK",
    "The best smart scales for 2023",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "By S. Fielding, 3 hours ago",
    "The Morning After: All the cool things Netflix showed off over the weekend",
    "The FCC is preparing to take a 'fresh look' at internet data caps",
    "Netflix shares teaser for World War II drama ‘All The Light We Cannot See’",
    "By I. Bonifacic, 17 hours ago",
    "Microsoft confirms June Outlook and OneDrive outages were caused by DDoS attacks",
    "By I. Bonifacic, 21 hours ago",
    "Hitting the Books: Why AI won't be taking our cosmology jobs",
    "By A. Tarantola, a day ago",
    "Netflix offers a peek at ‘One Piece’ and ‘Avatar: The Last Airbender’ live-action adaptations",
    "By W. Shanklin, 06.17.2023",
    "Leaked Samsung Galaxy Z Flip 5 render shows a bigger cover display",
    "Netflix’s ‘3 Body Problem’ first look confirms January 2024 premiere",
    "Netflix's 'Squid Game' reality competition show debuts this November",
    "Binance reaches deal with SEC to avoid US asset freeze",
    "Sony Bravia TV owners can soon take Zoom calls from the couch",
    "By W. Shanklin, 06.16.2023",
    "Meta will lower the Quest headset's recommended age from 13 to 10",
    "Firefly Aerospace buys the final scraps of doomed Virgin Orbit",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]