[
    "The best cheap Windows laptops for 2023 a day ago",
    "The best tablets for 2023 2 hours ago",
    "The best wireless headphones for 2023 5 hours ago",
    "The best midrange smartphones for 2023 06.20.2023",
    "Final Fantasy XVI review: A welcome dramatic turn for the series",
    "Everything you need to know about Amazon Prime Day 2023",
    "By V. Palladino, 12 hours ago",
    "Nest WiFi Pro review: Google’s WiFi 6E mesh is more approachable than the rest",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "By V. Palladino, 21 hours ago",
    "‘Metal Gear Solid: Master Collection Vol. 1’ heads to consoles and PC on October 24th",
    "By I. Bonifacic, 11 minutes ago",
    "Get a Ring Video Doorbell with an Echo Pop for $40 as an early Prime Day deal",
    "By L. Bonk, 26 minutes ago",
    "'Batman: Arkham Trilogy' comes to Switch this fall",
    "By J. Fingas, 41 minutes ago",
    "Nintendo's new WarioWare game wants you to move your whole body",
    "Qualcomm’s new chip could reduce lag for connected audio devices",
    "By W. Shanklin, an hour ago",
    "FTC sues Amazon for allegedly tricking customers into Prime subscriptions",
    "'Vampire Survivors' is getting four-player couch co-op",
    "Play as Elephant Mario in 'Super Mario Bros. Wonder' on October 20th",
    "By J. Conditt, 2 hours ago",
    "By S. Rutherford, 2 hours ago",
    "A 'Super Mario RPG' remake is coming to Nintendo Switch on November 17th",
    "'Detective Pikachu Returns' lands on Switch October 6th",
    "By J. Conditt, 3 hours ago",
    "Texas says state-funded EV charging stations need to include Tesla’s NACS connector",
    "Apple Podcasts update makes it easier to find content in your favorite genres",
    "Apple's union-busting practices violated employee rights at NYC store, judge rules",
    "By S. Fielding, 5 hours ago",
    "The best wireless headphones for 2023",
    "The Morning After: Amazon Prime Day kicks off July 11th",
    "Amazon sale drops the Kindle Paperwhite, Echo Dot and Fire tablets for kids to all-time lows",
    "Twitch replaces its mature content mode with more granular 'labels'",
    "By S. Fielding, 7 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]