[
    "The best tablets for 2023 06.07.2023",
    "Apple's new 15-inch MacBook Air is already $49 off at Amazon 06.07.2023",
    "‘Spider-Man 2’ launches on October 20th 14 hours ago",
    "The best wireless workout headphones for 2023 06.07.2023",
    "Summer Game Fest 2023 and the stagnant state of the industry",
    "By J. Conditt, 18 hours ago",
    "'Sonic Superstars' gives classic gameplay another modern makeover",
    "By W. Shanklin, 14 hours ago",
    "United is putting 4K displays and Bluetooth on its planes",
    "How to choose the best pizza oven in 2023",
    "By B. Steele, 18 hours ago",
    "The best photography gifts for dads",
    "Meta test puts Reels on the Quest",
    "By S. Fielding, 8 minutes ago",
    "Watch the Summer Game Fest keynote in under 20 minutes",
    "Logitech retires the Blue microphone brand",
    "The DeSantis campaign used AI-generated images to attack Trump",
    "GM EV owners will gain access to Tesla Superchargers in 2024",
    "By S. Buckley, 10 hours ago",
    "Screenshots of Instagram's answer to Twitter leak online",
    "By A. Tarantola, 13 hours ago",
    "'Helskate' mashes together Tony Hawk and Hades",
    "'Final Fantasy VII Remake: Rebirth' is delayed to early 2024",
    "Fortnite's next season features Transformers and rideable raptors",
    "‘Alto’s Adventure’ devs announce new game, and it's all about sheep herding",
    "Watch Devolver Digital’s Summer Game Fest stream here at 6PM ET",
    "‘Like A Dragon Gaiden’ revives Kiryu on November 9th 2023",
    "Mark Zuckerberg says generative AI is coming to ‘every single one of our products’",
    "'John Carpenter's Toxic Commando' brings a co-op apocalypse to PS5, PC and Xbox",
    "By A. Tarantola, 14 hours ago",
    "‘Spider-Man 2’ launches on October 20th",
    "'Alan Wake II' gameplay shows newcomer Saga battling a resurrected murder victim",
    "The best soundbars for 2023",
    "By B. Steele, 14 hours ago",
    "'Sand Land' is a new adventure game based on a manga by Dragon Ball creator Akira Toriyama",
    "You can play a demo of the goth Pinocchio game 'Lies of P' right now",
    "By J. Conditt, 14 hours ago",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]