[
    "Apple's 'M3 Pro' chipset could feature 12 CPU cores 14 hours ago",
    "Pixel users report the Google app is making their phones overheat 15 hours ago",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election 17 hours ago",
    "Apple’s M1 iPad Air drops to $500 at Amazon 05.13.2023",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Apple Silicon Macs now natively support Unreal Engine 5",
    "'Hogwarts Legacy' just got hit with another massive delay",
    "How to choose the best pizza oven in 2023",
    "How wood-scanning tech is taking the guesswork out of aging bourbon",
    "NASA ends its Lunar Flashlight mission",
    "By S. Fielding, 20 minutes ago",
    "Apple's iPhone 14 Emergency SOS feature arrives in New Zealand and Australia",
    "Apple's 'M3 Pro' chipset could feature 12 CPU cores",
    "By I. Bonifacic, 14 hours ago",
    "Pixel users report the Google app is making their phones overheat",
    "By I. Bonifacic, 15 hours ago",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election",
    "By I. Bonifacic, 17 hours ago",
    "The second generation Apple Pencil drops to a new low of $85",
    "By I. Bonifacic, 19 hours ago",
    "Hitting the Books: The abrupt and ignoble downfall of Sam Bankman-Fried",
    "By A. Tarantola, 20 hours ago",
    "'Elden Ring' has sold more than 20 million copies",
    "By I. Bonifacic, 05.13.2023",
    "Apple offers a free one-month trial of MLS Season Pass to new and returning subscribers",
    "Meta fixed a Facebook bug that sent automatic friend requests to users",
    "Google faces antitrust compliance review in India following Match Group complaint",
    "Apple’s M1 iPad Air drops to $500 at Amazon",
    "Binance leaves Canada due to stricter crypto rules",
    "The US government wants to recall 67 million airbag inflators",
    "Korg Berlin shows off a prototype 'acoustic synthesizer'",
    "Former ByteDance exec claims company used bots to inflate TikTok engagement",
    "Nuro lays off 30 percent of staff, shifts focus to R&D",
    "By W. Shanklin, 05.12.2023",
    "YouTuber pleads guilty to intentionally crashing his plane for a wallet sponsorship",
    "The best gaming laptops for 2023",
    "By D. Hardawar, 05.12.2023",
    "‘Layers of Fear’ collection gets a terrifying demo on Steam",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]