[
    "'Mr. Run and Jump' will be the first official cartridge for the Atari 2600 since 1990 06.13.2023",
    "The best MacBooks for 2023: How to pick the best Apple laptop 06.13.2023",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing 06.13.2023",
    "The best VR headsets for 2023 14 hours ago",
    "By J. Conditt, 17 hours ago",
    "Sennheiser SoundProtex Plus review: Concert earplugs that don't kill the vibe",
    "By B. Steele, 15 hours ago",
    "Anker's new Solix home energy storage includes a modular solar battery system",
    "My quest for the perfect productivity mouse",
    "Zwift launches dedicated game controllers for its bike-based fitness platform",
    "Fujfilm's Instax SQ40 marries retro charm with larger square film",
    "Music publishers are suing Twitter for $250 million over 'massive' copyright infringement",
    "EU officials pass draft law to regulate AI and ban facial recognition systems",
    "Steam overhauls notifications, UI elements and the in-game overlay",
    "By S. Buckley, 10 hours ago",
    "Senate bill would hold AI companies liable for harmful content",
    "By J. Fingas, 13 hours ago",
    "Capture One's photo-editing app arrives on iPhone",
    "The best VR headsets for 2023",
    "By D. Hardawar, 14 hours ago",
    "The best power banks for 2023",
    "By A. Skorheim, 15 hours ago",
    "Twitter is getting evicted from its Colorado office over unpaid rent",
    "Saturn’s moon Enceladus could support species similar to Earth",
    "By W. Shanklin, 16 hours ago",
    "Sony is testing PS5 game cloud streaming for PS Plus Premium users",
    "By J. Fingas, 16 hours ago",
    "NordPass password manager premium plans are up to 53 percent off",
    "Razer Blade 14 laptop refresh features powerful Ryzen 9 and RTX 4070 chips",
    "The best high school graduation gifts in 2023",
    "Dell XPS 15 and 17 laptops are up to $800 off",
    "UPS tentatively agrees to add air conditioning to its trucks",
    "By W. Shanklin, 17 hours ago",
    "All the big tech layoffs of 2023",
    "By J. Fingas, 17 hours ago",
    "‘Dead Cells’ is getting an animated series in 2024",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]