[
    "The best PS5 accessories for 2023 05.11.2023",
    "The Morning After: The verdict on 'Zelda: Tears of the Kingdom' 18 hours ago",
    "Anthropic says its Claude AI can now read a whole book in under a minute 18 hours ago",
    "PlayStation VR2 is finally available at retailers 13 hours ago",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Apple Silicon Macs now natively support Unreal Engine 5",
    "'Hogwarts Legacy' just got hit with another massive delay",
    "How to choose the best pizza oven in 2023",
    "By B. Steele, 17 hours ago",
    "How wood-scanning tech is taking the guesswork out of aging bourbon",
    "By B. Steele, 15 hours ago",
    "Pixel Tablet hands-on: Basically a $500 smart display with a detachable screen",
    "The Apple Watch Series 9 may finally get a new processor",
    "Google Pixel Fold hands-on: Finally, a real rival for Samsung’s foldables",
    "Jack Dorsey-backed Bluesky is having a moment",
    "Vast and SpaceX plan to launch the first commercial space station in 2025",
    "Korg Berlin shows off a prototype 'acoustic synthesizer'",
    "By T. O'Brien, 7 hours ago",
    "Former ByteDance exec claims company used bots to inflate TikTok engagement",
    "Nuro lays off 30 percent of staff, shifts focus to R&D",
    "By W. Shanklin, 9 hours ago",
    "YouTuber pleads guilty to intentionally crashing his plane for a wallet sponsorship",
    "By W. Shanklin, 10 hours ago",
    "The best gaming laptops for 2023",
    "By D. Hardawar, 10 hours ago",
    "‘Layers of Fear’ collection gets a terrifying demo on Steam",
    "'Hogwarts Legacy' on Switch just got hit with another massive delay",
    "How to make the most of that Instant Pot you just bought",
    "PlayStation VR2 is finally available at retailers",
    "Tesla recalls over 1.1 million cars in China over braking flaw",
    "By J. Fingas, 13 hours ago",
    "Amazon's Fire TV Stick 4K Max drops to $35, plus the rest of this week's best tech deals",
    "By A. Skorheim, 14 hours ago",
    "The best smart scales for 2023",
    "By D. Cooper, 15 hours ago",
    "The best gifts to upgrade your grad’s tech setup",
    "By N. Ingraham, 16 hours ago",
    "Bose's QuietComfort Earbuds II are on sale for $249 right now",
    "By J. Fingas, 16 hours ago",
    "Engadget Podcast: Pixel Fold, Google I/O and 'Zelda: Tears of the Kingdom'",
    "By D. Hardawar, 17 hours ago",
    "Anthropic says its Claude AI can now read a whole book in under a minute",
    "Best Laptops for College Students",
    "Best Live TV Streaming Services"
]