[
    "Chelsea's fourth-straight WSL title is their most impressive 🏆",
    "Every USMNT star in the Premier League - ranked",
    "McGlynn magic & Cowell chaos: U20 USMNT winners and losers",
    "GOAL's Premier League Team of the Season",
    "Luton seal Premier League return with wild penalty shootout",
    "Slovakia U20 vs United States U20",
    "USMNT U-20 ratings: Cowell goes full Nunez in 2-0 win",
    "Transfers LIVE: Man Utd refuse to pay £55m for Mount",
    "Manchester United vs Chelsea",
    "USMNT legends compare De Gea to jewelled egg after Pulisic clash 🥚",
    "Ex-USMNT boss Berhalter linked with Swansea job",
    "Real Madrid ratings: Rodrygo is on fire!",
    "Messi beats Ronaldo's European goalscoring record",
    "PSG ratings: Messi sets new record to seal Ligue 1 title!",
    "Saudi Pro League top scorers 2022-23: CR7 making moves",
    "Golden Shoe 2022-23: European football's top scorers",
    "Ligue 1 top scorers 2022-23: Who has the most goals?",
    "Tuchel 'assuming' he will stay at Bayern after sacking",
    "Seattle Sounders vs New York Red Bulls: Stream, TV channels & where to watch",
    "Galaxy vs Charlotte: Stream, TV channels & where to watch",
    "Serie A top scorers 2022-23: Golden Boot race",
    "Scottish Premiership top scorers 2022-23: Who is leading the goalscoring charts?",
    "Ronaldo, Messi, Pele & the top scorers of all time",
    "Messi's crazy goalscoring stats in full",
    "Ronaldo vs Messi: Who is the GOAT in football?",
    "Luton captain Lockyer celebrates play-off win from hospital bed",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "See allSee All Breaking News",
    "Iniesta to leave Vissel Kobe - but he's not retiring yet",
    "'We all wear 20!' - Madrid's show of solidarity with Vini Jr",
    "Van Nistelrooy leaves PSV over 'lack of support'",
    "'United 07-08 were scarier than this City team!' | Front Three",
    "Guardiola issues Man City warning ahead of two finals",
    "England star Daly equals Miedema's goal record 😱",
    "Record-breakers! Chelsea are WSL champions AGAIN 🏆",
    "Arsenal confirm Rafaelle exit 👋",
    "Kerr's WSL admission ahead of decisive final day for Chelsea",
    "England star Daly named WSL Player of the Season 🔥",
    "Four Lionesses in GOAL's WSL Team of the Season",
    "Hit or Miss: Every USWNT star to play in the WSL",
    "10 reasons why PSG's season has been so miserable",
    "Phil Jones should be remembered as more than just a meme",
    "Why Barca have to sell Raphinha - their summer depends on it",
    "10 moments which cost Liverpool UCL qualification 😬",
    "Introducing the Borussia Dortmund 2023-24 home kit",
    "All the top teams' 2023-24 football kits released so far",
    "Dortmund 2023-24 kit: New home, away & third jersey details",
    "adidas unveil Arsenal 2023-24 home kit",
    "Arsenal 2023-24 kit: New home, away & third jersey details",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "Neville: Pulisic is a nearly player",
    "USMNT star Ream confirms response to Pep transfer revelation",
    "Ryan Reynolds pays moving tribute to fan whose final wish was to meet him",
    "11 fun facts about Brenden Aaronson",
    "Getty/Wrexham AFC/SToK Cold Brew",
    "WATCH: Reynolds and Co. star as Wrexham change stadium name",
    "Inside Cristiano Ronaldo's insane career goal scoring stats",
    "Liverpool Transfers LIVE: Reds still want to sign Ruben Neves",
    "How much is the Championship play-off final worth?",
    "Barcelona Transfers LIVE: Talks over Dembele's new deal progressing",
    "Ten Hag expects Marcus Rashford to renew Man Utd contract",
    "Ancelotti on Real Madrid's succession plan for Benzema",
    "Man Utd Transfers LIVE: Frimpong price tag revealed",
    "St. Louis vs Vancouver Whitecaps: Stream, TV channels & where to watch",
    "Houston vs Austin: Stream, TV channels & where to watch",
    "Orlando City vs Atlanta United: Stream, TV channels & where to watch",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]