[
    "GOAL's World-Class Club: Women's football's elite stars",
    "Man Utd have massively overpaid for £60m Mount",
    "Ancelotti taking Brazil job in 2024 makes no sense for anyone",
    "GOAL's World-Class Club: Football's exclusive elite",
    "AC Milan submit improved £19m bid for Chelsea's Pulisic",
    "Transfers LIVE: Mbappe told to sign new deal or leave PSG",
    "Five biggest jobs for Pochettino to do at Chelsea 📥",
    "Zero to hero for Gibbs-White as England reach U21 Euros final",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "How versatile Timber will fit in to Arsenal's defence",
    "Arsenal Transfers LIVE: 'Here we go': Fabrizio Romano confirms Rice to Arsenal",
    "No Greenwood as Man Utd players return for pre-season",
    "All completed Serie A transfers in 2023-24 - listed",
    "'In the process' - Ratcliffe says INEOS still in hunt for Man Utd",
    "Make room for Messi! Inter Miami star blasts MLS trade policy",
    "Mahrez at loggerheads with City as he eyes Saudi Arabia move",
    "All completed Premier League transfers in 2023-24",
    "Chelsea tell Milan to raise Pulisic offer after second bid",
    "All completed La Liga transfers in 2023-24",
    "First images of Messi in Inter Miami kit emerge",
    "All completed Barcelona transfers so far in 2023-24 - Listed",
    "Rice 'can't wait to join Arsenal' & thinks Arteta is 'magic'",
    "WATCH: Man Utd signing Mount's first interaction with Ten Hag",
    "Spurs fuming at Kane's secret talks with Bayern boss Tuchel",
    "Messi 'just another player', says potential debut opponent",
    "See allSee All Breaking News",
    "There will be no Messi in the future - Martinez",
    "WATCH: Gerrard speaks 'Scouse Arabic' at Al-Ettifaq 😂",
    "EXCLUSIVE: England star Stanway reveals kitbag essentials",
    "EXCLUSIVE: England star Russo ready for 'new challenge' at WWC",
    "Liverpool confirm £60m Szoboszlai transfer",
    "Japan Women's World Cup 2023 squad: Who's in & who's out?",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "Switzerland Women's World Cup 2023 squad: Who's in & who's out?",
    "Norway Women's World Cup 2023 squad: Who's in & who's out?",
    "New Zealand Women's World Cup 2023 squad: Who's in & who's out?",
    "'Just in shock' - Bright reflects on England captaincy decision",
    "Time for Lionesses star Russo to step up after Arsenal move",
    "Why Man Utd can only spend £120m this summer",
    "Madrid's next manager: Who will replace Ancelotti?",
    "Can Mount live up to the history of Man Utd's iconic No.7s?",
    "Jude who?! Liverpool fans forgetting all about Bellingham",
    "How Man Utd new boy Mount will fit into Ten Hag's system",
    "Pulisic lined up to succeed Messi in MLS after 2026 World Cup",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "USMNT starlet Cowell addresses Newcastle & Bayern transfer links",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "Inter Miami launch bid to link Hazard up with Messi",
    "WATCH: Messi's new team-mate Martinez scores stunning bicycle kick",
    "El Trafico: Inside LA's intense soccer derby",
    "Messi & Busquets sent MLS warning by ex-Barca star Puig",
    "All the top teams' 2023-24 football kits released so far",
    "PSG's 10 greatest away & third kits - ranked",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Soccer cleats: latest releases in 2023",
    "PSG 2023-24 kit: New home, away & third jersey details",
    "How to buy UEFA Champions League tickets",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟"
]