[
    "A message for Berhalter - here's how to use Reyna",
    "Injury-hit USMNT star Reyna transfer listed by Dortmund",
    "How the USMNT should line up against Canada",
    "Transfers LIVE: Bayern closing in on shock Walker move",
    "Simon shines as Spain clinch Nations League crown on penalties",
    "Why Chelsea must go all out to sign £80m Caicedo",
    "Chiesa seals Nations League bronze medal for Italy",
    "Why Man Utd should steer clear of mediocre Mount",
    "USWNT captain Sauerbrunn to miss World Cup",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Barcelona Transfers LIVE: Catalans close Vitor Roque deal",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Chelsea Transfers LIVE: Gallagher to be included in Caicedo deal?",
    "Real Madrid Transfers LIVE: Joselu to be this summer's final signing",
    "Messi told to expect 'intense' MLS competition by Almada",
    "Griezmann reveals MLS 'dream' after Messi's Miami move",
    "Croatia vs Spain: Lineups & LIVE updates",
    "Liverpool Transfers LIVE: Reds yet to bid for Spanish midfielder",
    "Hazard on retirement talk: 'I've been resting for three years!'",
    "Victor Osimhen's impressive career stats in full",
    "Man Utd Transfers LIVE: Disasi Red Devils' top target for defence",
    "'I absolutely don't care' - Gavi reacts to Bellingham's Real move",
    "Barcelona closing in on €35m Vitor Roque deal",
    "Ronaldo's 'perfect attitude' hailed by Martinez",
    "See allSee All Breaking News",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "Dias was sick in Grealish’s mum’s handbag after two shots! 🤮",
    "'Stuck with me' - Toone's message to Russo after Man Utd exit",
    "Brazil Women's World Cup 2023 squad: Who's in & who's out?",
    "Argentina Women's World Cup 2023 squad: Who's in & who's out?",
    "Vietnam Women's World Cup 2023 squad: Who's in & who's out?",
    "Japan Women's World Cup 2023 squad: Who's in & who's out?",
    "BBC & ITV finally agree Women's World Cup broadcast deal",
    "China Women's World Cup 2023 squad: Who's in & who's out?",
    "5 Wonderkids in One Future Football",
    "10 midfielders Wrexham could sign this summer",
    "The candidates to be next PSG boss with Nagelsmann ruled out",
    "That's why you start Trent Alexander-Arnold 💪",
    "France ratings: Goal & assist for electric Mbappe 🔥",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Weston McKennie turns down $10,000 offer for ripped shirt",
    "Berhalter on USMNT return, his players & World Cup lessons",
    "Berhalter vows to fix relationship with 'game-changer' Reyna",
    "Berhalter 'one of the best coaches in USMNT history' - Lalas",
    "Berhalter will 'forgive and forget' Gio Reyna controversy",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Norway boss glad Haaland didn't party in 'the Grealish way'",
    "One Future Football clubs unveil 12 jaw-dropping kits for Season One",
    "Grealish sent partying warning after treble celebrations",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "Ten Hag left fuming by Man Utd takeover delay!",
    "Barcelona set to miss out on Saudi-bound Ruben Neves",
    "Alba agrees contract to be reunited with Messi in Miami",
    "Nashville SC vs St. Louis City",
    "'World class' - Mukhtar hailed by Nashville coach",
    "San Jose vs Portland: Stream, TV channels & where to watch",
    "New Premier League ball released for 2023-24 season",
    "Barcelona 2023-24 home kit inspired by women's team",
    "All the top teams' 2023-24 football kits released so far",
    "Barcelona 2023-24 kit: New home, away & third jersey details",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]