[
    "How Man Utd were convinced to pay Rashford £19.5m-per-year",
    "Tonali shows Newcastle are the anti-PSG of squad building",
    "Where Havertz will slot in at Arsenal",
    "Sergio Busquets to Inter Miami is a done deal!",
    "EXCLUSIVE: Nani on Ronaldinho, Messi in MLS & more",
    "How the USWNT should line up at the World Cup",
    "Transfers LIVE: Man Utd's third Mount bid rejected",
    "Rice should join Arsenal - but City trophies could swing EPL saga",
    "Revealed: Morgan & Rapinoe's plan to inspire USWNT to glory",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Callaghan clarifies Berhalter involvement in Gold Cup plans",
    "Man Utd see third Mount bid rejected as Chelsea demand £65m",
    "USMNT's McKennie & Dest learn fate following Mexico brawl",
    "CONCACAF GOLD CUP 2023 squads: All 16 team rosters",
    "Zendejas on McKennie's High School Musical celebration",
    "Tyler Adams hangs out with golf stars",
    "Azpilicueta is leaving Chelsea! Agreement reached with Inter",
    "Arsenal to submit £100m bid for Rice 😲",
    "Tonali 'broke down in tears' over Newcastle move",
    "WATCH: Neves gets emotional as he seals €55m Al-Hilal move",
    "Dortmund look to Chelsea for Bellingham replacement",
    "Nkunku: I haven't spoken to Chelsea boss Pochettino yet",
    "Ryan Reynolds discovers spooky Wrexham lookalike",
    "Mason Greenwood 'fed up' with Man Utd suspension",
    "Hit or Miss: USMNT stars in Eredivisie as Pepi heads to PSV",
    "See allSee All Breaking News",
    "Son aims sly dig at Ronaldo as he snubs Saudi Pro League",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Shaw answers Mount 'tapping up' question amid Man Utd talk",
    "Griezmann: Mbappe captaincy call was 'hard to stomach'",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Women's National League - Premier Division",
    "Newcastle make history as first pro team in women's third tier",
    "'It's clear I won’t be playing for England again' - Houghton",
    "Horan breaks Alex Morgan's transfer record with Lyon move",
    "USWNT star Morgan reveals slight 'surprise' at World Cup call",
    "WATCH: Superstars announce USWNT 2023 World Cup roster",
    "Canada Women's World Cup 2023 squad: Who's in & who's out?",
    "USWNT's Andonovski gives Rapinoe & Lavelle injury updates",
    "How the USMNT should line up vs Jamaica in Gold Cup opener",
    "The amazing Australia cities hosting the Women's World Cup",
    "Three Players to Watch in Each 1FF Team",
    "The must-see NZ cities hosting the Women's World Cup 🇳🇿",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "USMNT's 2023 Gold Cup roster: Who's in & who's out?",
    "Lewandowski's crazy goalscoring stats in full",
    "Manchester City vs Internazionale",
    "UCL final ref waves cards at himself in front of mirror",
    "Ronaldo, Messi, Pele & the top scorers of all time",
    "Inside Cristiano Ronaldo's insane career goal scoring stats",
    "Should Man Utd give up on Mason Mount?",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "Orlando City vs Philadelphia Union",
    "🎥 | Martinez scores Roberto Carlos-esque 35-yard screamer",
    "Portland vs Chicago: Stream, TV channels & where to watch",
    "Los Angeles vs Seattle Sounders",
    "LAFC vs Seattle Sounders: Stream, TV channels & where to watch",
    "LA Galaxy vs Sporting KC: Stream, TV channels & where to watch",
    "Colorado vs Whitecaps: Stream, TV channels & where to watch",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]