[
    "12 players Man Utd must sell to pay for a striker",
    "Why Pulisic was a Chelsea failure",
    "Pulisic heading to AC Milan in €20m transfer",
    "Hit or Miss: USMNT stars in Eredivisie as Pepi signs for PSV",
    "How Pulisic can force his way into the Milan line up",
    "Transfers LIVE: Mbappe to sign €50m-per-year Madrid contract",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "GOAL's World-Class Club: Women's football's elite stars",
    "GOAL grades the biggest transfers of the summer so far",
    "USMNT's 'Pirate of the Caribbean' Ferreira deserves Euro move",
    "World Cup favourites Germany suffer shock Zambia defeat",
    "Pochettino hints he no input in Chelsea transfers",
    "Saliba sends message to Arsenal fans following contract news",
    "Robinson not joining Man City! USMNT star signs new Fulham deal",
    "The best FPL goalkeepers for 2023-24",
    "Odegaard 'recharges' on holiday with girlfriend",
    "McCabe provides injury update ahead of World Cup",
    "'I love you' - Neymar and Vinicius Jr link up in Brazil",
    "Wrexham miss another target? Powell joins rivals Stockport",
    "What a week for Havertz! New Arsenal signing gets engaged",
    "Another blow for France! Henry to miss World Cup",
    "Flamengo didn't train Vinicius properly - Ronaldo",
    "Revealed: William Saliba's new Arsenal shirt number",
    "Dele Alli back in Everton training after Besiktas nightmare",
    "Sancho and Maguire among Man Utd players Ten Hag wants to sell",
    "See allSee All Breaking News",
    "There will be no Messi in the future - Martinez",
    "EXCLUSIVE: England's Stanway on Euros glory & inspiring a nation",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "WATCH: Gerrard speaks 'Scouse Arabic' at Al-Ettifaq 😂",
    "EXCLUSIVE: England star Stanway reveals kitbag essentials",
    "Horan and Morgan named USWNT captains ahead of World Cup",
    "Netherlands WWC 2023 squad: Who's in & who's out?",
    "Morocco Women's World Cup 2023 squad: Who's in & who's out?",
    "'I want to be known as Lauren James' 🙌",
    "Denmark Women's World Cup 2023 squad: Who's in & who's out?",
    "Australia WWC 2023 squad: Who's in & who's out?",
    "FA & Google Pixel to improve visibility in women's game",
    "Hit or Miss: USMNT stars in Serie A as Puli prepares to join Weah",
    "Why PSG have spent €60m on Sporting star Ugarte",
    "What happened to the last England U21s Euros finalists?",
    "Why Real Madrid are spending €20m+ on the 'Turkish Messi'",
    "Ancelotti taking Brazil job in 2024 makes no sense for anyone",
    "USMNT's Turner excited by Arsenal's summer transfer business",
    "‘Never-ending season’ – Why Mullin & Wrexham needed a break",
    "EXCLUSIVE: Beasley backs Pepi to shine at PSV",
    "USMNT star Pulisic forgetting about football amid Milan links",
    "Pochettino has say on Mount's move to Man Utd",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Getty Image & Instagram (kaihavertz29)",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "GOAT Beer! Messi's move celebrated with special edition lager",
    "Revealed: Toughest right-back Bale faced & why he retired",
    "LA Galaxy tickets: ticket prices, package deals, membership & season ticket information",
    "Make room for Messi! Inter Miami star blasts MLS trade policy",
    "First images of Messi in Inter Miami kit emerge",
    "All the top teams' 2023-24 football kits released so far",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "PSG's 10 greatest away & third kits - ranked",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Soccer cleats: latest releases in 2023",
    "UEFA Europa Conference League",
    "When does TNT launch in the UK?",
    "Grealish Treble party is still going! City star back in Ibiza",
    "What is a 'Group of Death' in soccer?",
    "How to buy UEFA Champions League tickets",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟"
]