[
    "Where do you want your statue, Ilkay Gundogan?!",
    "Surely De Gea can't stay as Man Utd's No.1?!",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "How the USMNT should line up in U20 World Cup quarter-final",
    "Messi's miserable farewell sums up sorry PSG career",
    "Transfers LIVE: Chelsea & Newcastle in for Messi",
    "UEFA Women's Champions League",
    "Give Guijarro her flowers! Barca star the UWCL final hero 🤩",
    "Gundogan is so clutch - City simply have to keep him",
    "Hazard & Madrid's worst signings ever - ranked 👎",
    "USMNT stars set for summer transfers",
    "GOAL's European Team of the Season",
    "Mac Allister 'close' to Liverpool move, cousin suggests",
    "Ligue 1 top scorers 2022-23: Who has the most goals?",
    "Golden Shoe 2022-23: European football's top scorers",
    "USMNT hopeful Balogun scores 21st Ligue 1 goal for Reims",
    "Hugo Lloris wants to leave Spurs this summer",
    "WATCH: Sergio Ramos scores on final PSG outing",
    "Mbappe & PSG pay tribute to Sergio Rico",
    "Colorado Rapids vs San Jose Earthquakes: Stream, TV channels & where to watch",
    "Mbappe vs Haaland: Who is the future GOAT?",
    "Liverpool Transfers LIVE: Adrian set to continue at Anfield",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "PSG all-time top scorers: Mbappe overtakes Cavani",
    "Man City Transfers LIVE: Guardiola hopes Man City star to continue at Etihad",
    "Chelsea Transfers LIVE: Blues eyeing a move for Messi!",
    "Ten Hag explains why Man Utd had to watch City lift trophy",
    "See allSee All Breaking News",
    "Benzema to stay at Real Madrid despite Saudi Arabia offer",
    "'City will beat terrible United & win the treble' | Front Three",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "What a comeback! Barca win UWCL in an absolute thriller 🤯",
    "WATCH:  Bronze mistake gifts Wolfsburg lead in UWCL final",
    "How Wolfsburg take down brilliant Barca in the UWCL final",
    "Graham Hansen: We are lucky to have Walsh at Barca 🤩",
    "'F*ck those guys!' - Inside the NWSL's biggest & best rivalry",
    "Lucy Bronze: England's greatest-ever women's footballer?",
    "GOAL's women's Team of the European Season",
    "Keep, loan or sell? Players Liverpool should allow to leave",
    "Eight reasons why it went wrong for Messi at PSG",
    "Man City could soon have more fans than Man Utd",
    "Lingard's move to Forest was a DISASTER!",
    "Keep loan or sell? Players Arsenal should allow to leave",
    "All the top teams' 2023-24 football kits released so far",
    "Introducing the AC Milan 2023-24 home kit",
    "AC Milan 2023-24 kit: New home, away & third jersey details",
    "Introducing all the 2023 Women's World Cup kits",
    "Nike unveil PSG 2023-24 home kit",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Myles Lewis-Skelly: Arsenal's latest wonderkid midfielder",
    "'Not very good' - USMNT stars blamed for Leeds relegation",
    "West Ham walk off from Dallas match over alleged racial slur",
    "Where to watch & stream CONCACAF Gold Cup",
    "Balogun gets USMNT call up for Nations League finals",
    "Messi's crazy goalscoring stats in full",
    "Gundogan talks Man City future after FA Cup final brace",
    "'One more, one more!' - Haaland sends message to Man City",
    "Real Madrid Transfers LIVE: Madrid announce the multiple departures",
    "Real Madrid agree to rip up Eden Hazard's contract",
    "St. Louis vs Houston Dynamo: Stream, TV channels & where to watch",
    "Austin vs Real Salt Lake: Stream, TV channels & where to watch",
    "Cincinnati vs Chicago: Stream, TV channels & where to watch",
    "NYRB vs Orlando City: Stream, TV channels & where to watch",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊",
    "Rice, Lampard & Ferdinand - West Ham's best academy graduates"
]