[
    "Man Utd will dodge a bullet if they miss out on Mount",
    "Where Weah will play for Juve - and what it means for USMNT",
    "How versatile Timber will fit in to Arsenal's defence",
    "Pulisic sent Champions League transfer message by USMNT boss",
    "Transfers LIVE: West Ham reject City's bid for Rice",
    "Cher Ndour: PSG are signing 'the next Pogba' 🤩",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Six midfielders who are better fits for Man Utd than Mount",
    "Ballon d'Or 2023: Messi to claim eighth Golden Ball",
    "Russo a future England captain? Striker on leading Lionesses",
    "Man Utd miss out on Rabiot as Juve star signs new deal",
    "Neymar issues last call on cruise which may put off PL suitors",
    "Revealed: Key Man Utd clauses inserted in Iqbal's Utrecht contract",
    "Spain U21 vs Ukraine U21: Where to watch the game",
    "AC Milan agree €17m deal for Loftus-Cheek",
    "Gundogan's wife thanks fans after previous Manchester complaints",
    "Koulibaly explains Al-Hilal move after one season at Chelsea",
    "Reynolds and McElhenney’s Alpine deal branded 'preposterous'",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "Where to watch Ronaldo Al-Nassr games: Stream & TV info",
    "Zaha teams up with Stormzy to buy ninth-tier Croydon Athletic",
    "Man Utd legend Neville to join Dragon's Den for 2024 series",
    "Liverpool transfer target Gravenberch sends message to Bayern",
    "Bayern Munich submit £60m Kane bid 🤯",
    "'Doing big things' – Lingard responds to Saudi transfer talk",
    "See allSee All Breaking News",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Why West Ham's stadium has become a baseball field",
    "Sergio Busquets to Inter Miami is a done deal!",
    "United States to host expanded 32-team Club World Cup",
    "England Women's World Cup squad announced",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "Wrexham reward women's team with 10 semi-pro contracts",
    "Barcelona forward Geyse wanted by Man Utd to replace Russo",
    "Home delivery almost saw Morgan miss England World Cup call",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "10 moments that prove Gundogan is a Man City legend",
    "Soccer Cities 23: The best football destinations for fans",
    "The Irish youngster Wayne Rooney has tipped for superstardom",
    "Barca switch the ideal move for world-class Gundogan",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "USMNT star Musah transfer listed as Milan eye €20m swoop",
    "USMNT star Tim Weah to seal $13.2m Juventus transfer",
    "Arsenal tell Balogun to arrange transfer after contract snub",
    "St. Kitts and Nevis vs United States",
    "USMNT's Busio on Venezia and Olympic dreams",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Explained: Nkunku's balloon celebration",
    "Man Utd live stream and TV channel broadcast info",
    "Will De Bruyne be fit for the start of 2023-24? Injury update",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Barca make Amrabat transfer call after failing to re-sign Messi",
    "Ex-USMNT boss Bradley fired by Toronto FC",
    "'I'm very excited' - Messi raring to go with Inter Miami",
    "Messi shares family pictures as Inter Miami star turns 36",
    "NYRB vs Atlanta United: Stream, TV channels & where to watch",
    "Man Utd's 10 greatest home kits - ranked",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]