[
    "Why Chelsea must go all out to sign £80m Caicedo",
    "What Berhalter's return means for the USMNT, Reyna & 2026",
    "Transfers LIVE: Man Utd to make £45m move for Pickford",
    "How the USMNT should line up against Canada",
    "Why Man Utd should steer clear of mediocre Mount",
    "Brilliant Bruno strikes again!",
    "Weston McKennie turns down $10,000 offer for ripped shirt",
    "Brazil support Vinicius with all-black kit in anti-racism campaign",
    "USWNT captain Sauerbrunn to miss World Cup",
    "'Mbappe would be AVERAGE in South America!' 😲",
    "Netherlands vs Italy: Stream, TV channels & where to watch",
    "Rashford set to become Man Utd's highest earner!",
    "Abramovich refusing to sign off on £2.3bn Ukraine donation",
    "Man City Transfers LIVE: Mahrez to stay at City",
    "Man Utd Transfers LIVE: £45m for Pickford?",
    "Chelsea Transfers LIVE: Blues to sign Jackson",
    "Real Madrid Transfers LIVE: Cancelo to Madrid?",
    "Ronaldo LIFTED into air by pitch invader",
    "San Jose vs Portland: Stream, TV channels & where to watch",
    "'Haaland ran out of steam' - Norway coach explains substitution",
    "'Little star' Garnacho can be next Di Maria, says Martinez",
    "Sporting KC vs LAFC: Stream, TV channels & where to watch",
    "Nashville vs St. Louis: Stream, TV channels & where to watch",
    "Koulibaly agrees Al-Hilal move as Chelsea talks begin",
    "DC United vs Salt Lake: Stream, TV channels & where to watch",
    "See allSee All Breaking News",
    "Martinez insists Ronaldo playing in Saudi Arabia can help Portugal",
    "Trent Alexander-Arnold reveals aim to break into England team",
    "Dias was sick in Grealish’s mum’s handbag after two shots! 🤮",
    "'PSG is my only option' - Mbappe reiterates desire to stay",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "'Stuck with me' - Toone's message to Russo after Man Utd exit",
    "Brazil Women's World Cup 2023 squad: Who's in & who's out?",
    "Argentina Women's World Cup 2023 squad: Who's in & who's out?",
    "Vietnam Women's World Cup 2023 squad: Who's in & who's out?",
    "Japan Women's World Cup 2023 squad: Who's in & who's out?",
    "BBC & ITV finally agree Women's World Cup broadcast deal",
    "China Women's World Cup 2023 squad: Who's in & who's out?",
    "That's why you start Trent Alexander-Arnold 💪",
    "France ratings: Goal & assist for electric Mbappe 🔥",
    "England ratings: Alexander-Arnold runs the show!",
    "What Pep Guardiola's assistants did next 👋",
    "Ronaldo got rid of Garcia - so why did Napoli hire him?!",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Berhalter on USMNT return, his players & World Cup lessons",
    "Berhalter vows to fix relationship with 'game-changer' Reyna",
    "Berhalter 'one of the best coaches in USMNT history' - Lalas",
    "Berhalter will 'forgive and forget' Gio Reyna controversy",
    "Berhalter officially returns as USMNT coach",
    "Inside Kylian Mbappe's insane career goal scoring stats",
    "Norway boss glad Haaland didn't party in 'the Grealish way'",
    "Grealish sent partying warning after treble celebrations",
    "Ronaldo vs Messi: Who is the GOAT in football?",
    "Should Man Utd sign Ollie Watkins?",
    "The summer transfer window is open! Which move do you want to see? 🤔",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "David Raya urges Brentford to let him join Spurs",
    "Man Utd add Aston Villa star Ollie Watkins to striker wish list",
    "Romeo Beckham signs permanent deal with Brentford",
    "New Premier League ball released for 2023-24 season",
    "Barcelona 2023-24 home kit inspired by women's team",
    "All the top teams' 2023-24 football kits released so far",
    "Barcelona 2023-24 kit: New home, away & third jersey details",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]