[
    "GOAL's Champions League Team of the Season",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Pep's greatest combined XI: Barca 2011 vs Man City 2023",
    "Messi is walking into a mess at bottom-of-the-table Miami",
    "Transfers LIVE: Kovacic agrees terms with Man City",
    "Mac Allister for just £35m is the steal of the summer!",
    "EXCLUSIVE: Alexander-Arnold talks Messi, Salah and Liverpool",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "Women's Ballon d'Or Power Rankings 📈",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "Man Utd Transfers LIVE: Newcastle to hijack Red Devils move for Serie A defender",
    "Arsenal Transfers LIVE: £92m Rice move advances as West Ham eye replacements",
    "Liverpool Transfers LIVE: Reds agree personal terms with Ligue 1 midfielder",
    "Chelsea Transfers LIVE: Blues leading Man Utd in race to sign Neymar",
    "Man City Transfers LIVE: Chelsea star agrees personal terms with Cityzens",
    "Real Madrid Transfers LIVE: Los Blancos unwilling to spend €60m+ on Chelsea forward",
    "Henry won't join PSG as Nagelsmann's assistant",
    "Kovacic agrees terms with Man City as Chelsea exit looms 👀",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "Ronaldo left out of Saudi TOTS as Man Utd flop Ighalo gets in",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Man City Blue Moon song: Lyrics, video & meaning",
    "Messi awarded GOAT status over Ronaldo, according to science",
    "WATCH: Ronaldo's eye-popping reaction to Georgina goes viral",
    "PSG approached Zidane to be manager - but got rejected again!",
    "See allSee All Breaking News",
    "Confirmed: Lionel Messi is leaving PSG 😲",
    "'City will beat terrible United & win the treble' | Front Three",
    "Mourinho gives cryptic message on Roma future amid PSG links",
    "Juventus plea bargain accepted in transfer dealings case",
    "Spalletti confirms imminent exit as Napoli approach Luis Enrique",
    "Colombia Women's World Cup 2023 squad: Who's in & who's out?",
    "England to face Canada before World Cup - but ECA row goes on",
    "When are England Women's fixtures in 2023?",
    "Philippines Women's World Cup 2023 squad: Who's in & who's out?",
    "Switzerland Women's World Cup 2023 squad: Who's in & who's out?",
    "Norway Women's World Cup 2023 squad: Who's in & who's out?",
    "Why France's best players will now play at the Women's World Cup",
    "John Stones reveals all on his 'hardest time' & new midfield role",
    "Messi, Beckham, Henry and the biggest MLS signings ever",
    "Keep, loan or sell? Players Man City should allow to leave",
    "Every Real Madrid player in the 2022-23 season - ranked",
    "Manchester City vs Internazionale",
    "Every Champions League final, ranked from worst to best",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Quiz: How well do you recall the Premier League 2022-23?",
    "Quiz: How well do you know your PL cult heroes? 🤔",
    "Reynolds & McElhenney challenged to deliver ‘top of list’ targets",
    "First look at new Wrexham shirt as huge sponsorship deal confirmed",
    "Wrexham United?! Reynolds & McElhenney explain confusion",
    "EXCLUSIVE: Josh Wynder gives lowdown on historic $1.2m Benfica move",
    "'Woah!' - Wrexham stars couldn't believe they were signing Foster 🤯",
    "What is 'The Poznan'? Football fan taunt explained",
    "Cow hearts, 'magic' milk & Haaland's diet secrets 🥩",
    "What happened to Inter's 2010 Champions League heroes?",
    "WATCH: 21 best goals of the UCL season - ranked",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Tell us: Who should Madrid sign to replace Benzema? 🤔",
    "Manchester City vs Manchester United",
    "Debate: Would any Man Utd players get in Man City's team?",
    "Getty Images/GOAL composite",
    "Man Utd consider Greenwood loan amid European interest",
    "Inter Miami: Everything you need to know",
    "Revealed: The eye-watering cost to see Messi’s Inter Miami debut",
    "Two World Cup winners! Inter Miami want Di Mara alongside Messi",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Soccer cleats: latest releases in 2023",
    "adidas launch all-new X Crazylight boot",
    "All the top teams' 2023-24 football kits released so far",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Lamine Yamal: Is Barca wonderkid really the new Messi?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca",
    "The Premier League's greatest final-day relegation battles",
    "Haaland is special - but Messi's best remains untouchable 🐐",
    "Anfield's most dramatic EPL finales - ranked 📊"
]