[
    "Where it all went wrong for Barca flop Arda Turan",
    "Pulisic's final chance: USMNT star MUST shine in Milan",
    "Turner the shootout hero as USMNT win Canada thriller",
    "Leonardo is right: PSG must sell Mbappe now!",
    "Man Utd's biggest flop signings of the Glazer era - ranked",
    "Transfers LIVE: Chelsea enquire about €80m Vlahovic",
    "EXCLUSIVE: Chelsea's Buchanan & Fleming star in Kitbag",
    "Rodman dominates to make USWNT World Cup statement",
    "Jones' assist of dreams proves USMNT newcomer is for real!",
    "Chelsea unveil 2023-24 home kit inspired by the '90s",
    "Arsenal Transfers LIVE: Arsenal enter the race for Montpellier striker",
    "Ex-Juve president Agnelli has suspension extended",
    "Chelsea wantaway Ziyech rejects revised Al-Nassr offer",
    "Pogba makes big decision on Juve future amid Saudi interest",
    "How Wrexham are preparing for Man Utd & Chelsea",
    "León vs Pachuca: Stream, TV channels & where to watch",
    "WATCH: Amad shows off skills in Man Utd rondo with Mount",
    "Inter waiting on Onana sale before improving Lukaku bid",
    "The best FPL defenders for 2022-23",
    "Al-Hilal ready mammoth €220m Bernardo Silva offer",
    "'I sh*t myself' - Mikel on hiding from Fergie after Utd snub",
    "Neymar returns to PSG amid transfer uncertainty",
    "WATCH: Kante & Benzema get warm welcome at Al-Ittihad",
    "Spain & Netherlands slammed for mocking Maori haka",
    "Second chance? Everton make big Dele call",
    "See allSee All Breaking News",
    "Spurs boss Postecoglou offers Kane update amid Bayern interest",
    "Exclusive: Mullin has barely seen any of Reynolds' films!",
    "USWNT legend Rapinoe makes shock retirement announcement",
    "Pochettino got Chelsea job after bizarre Zoom meeting",
    "EXCLUSIVE: England's Stanway on Euros glory & inspiring a nation",
    "'I always felt Trump loved me' - USWNT icon Rapinoe",
    "Alex Morgan, Sophia Smith & the race for the 2023 NWSL Golden Boot",
    "Bronze reveals Lionesses' frustration over WWC bonuses",
    "Zambia Women's World Cup 2023 squad: Who's in & who's out?",
    "Horan and Morgan named USWNT captains ahead of World Cup",
    "Netherlands WWC 2023 squad: Who's in & who's out?",
    "Why haven't Wrexham signed anyone yet this summer?",
    "Soccer Cities 23: The best football destinations for fans",
    "Milan the perfect stage for Pulisic to prove himself",
    "Who should be Chelsea's new captain? The candidates ranked",
    "USMNT star Aaronson joining Europe's most interesting club!",
    "USMNT star Matt Turner pays tribute to teenager cancer patient",
    "USMNT & Arsenal striker Balogun back on RB Leipzig's radar",
    "USMNT star Reyna emerges as a target for Monchengladbach",
    "USMNT vs Canada: Stream, TV channels & where to watch",
    "'Fantastic player' - Thiago Silva backs Pulisic's Milan move",
    "Quiz: Only a true fan can name these Liverpool legends",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "Haaland, Vini Jr, Kerr & more star in EA Sports FC 24 teaser",
    "EA Sports/Getty/GOAL composite",
    "EA Sports FC: Release date, consoles & updates",
    "Who needs Kylian Mbappe most? 🤔",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Getty/GOAL/IG-victoriabeckham",
    "Beckham whitens Messi's teeth on HUGE mural in Miami 😅",
    "Winless in 10! When will Messi’s new side Inter Miami snap run?",
    "MLS over Milan? Pulisic told he should’ve followed Messi",
    "LA Galaxy vs Philadelphia: Stream, TV channels & where to watch",
    "Los Angeles vs SJ Earthquakes: Stream, TV channels & where to watch",
    "Juventus unveil 2023-24 away kit inspired by the mountain",
    "All the top teams' 2023-24 football kits released so far",
    "Umbro unveil the all-new West Ham 2023-24 home kit",
    "Chelsea's 10 greatest home kits - ranked 🦁",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "2009 Barcelona vs 2023 Man City: Yaya Toure has his say",
    "Man Utd live stream and TV channel broadcast info",
    "Guess who's back? John Terry confirms return to Chelsea",
    "UEFA Europa Conference League",
    "When does TNT launch in the UK?",
    "Kobbie Mainoo: Man Utd's next teenage star",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid"
]