[
    "Man Utd are making a mess of the transfer window... again",
    "Big bad Bryan Reynolds makes his mark for the USMNT",
    "Ferreira on fire as USMNT score six in Gold Cup thrashing",
    "Transfers LIVE: Man Utd make Onana bid",
    "Martino reunited with Messi at Inter Miami",
    "Spurs have just made the signing of the summer so far",
    "Arsenal paying £65m for Havertz feels like a colossal waste of cash",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Why Madrid, Barca & more want 'Turkish Messi' Arda Guler",
    "Declan Rice: World-class or overhyped?",
    "Why Wrexham are no ‘little project’ for Reynolds & McElhenney",
    "Bayern preparing new and improved £86m offer for Kane",
    "Revealed: Chelsea's top target to replace Mason Mount",
    "Chelsea Transfers LIVE: Blues have €15m bid accepted for Santos wonderkid",
    "Messi's Inter Miami debut will be 2023 Leagues Cup opener",
    "Cloe Lacasse: Meet Arsenal's 'unorthodox' new signing",
    "Will Lionel Messi play in MLS All-Star game vs Arsenal?",
    "Best Streaming Services for Sports Fans in 2023",
    "Aluko says outlandish Rice claim proven right in £105m deal",
    "Callaghan hails Jesus Ferreira after Gold Cup hat-trick",
    "Man Utd consider Greenwood loan transfer",
    "It’s a scarf! Wrexham find ingenious way around towel ban",
    "FIFA world ranking latest: Argentina stay on top, England leapfrogs Belgium",
    "Cloe Lacasse joins Arsenal from Benfica",
    "‘Shamed?’ - Angry Keys blasts coverage of his marriage",
    "See allSee All Breaking News",
    "Revealed: Kovacic explains reason for Man City move",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Done deal! Al-Hilal confirm €25m signing of Koulibaly",
    "Ireland Women's World Cup 2023 squad: Who's in & who's out?",
    "Another blow for Lionesses! Bright to miss Portugal clash",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "England Women's World Cup squad announced",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "Where Havertz will slot in at Arsenal",
    "Madueke stars as England send Germany packing from U21 Euros",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Man Utd are right to make De Gea contract U-turn",
    "Hit or miss? Italians in the EPL as Tonali joins Newcastle",
    "St. Kitts and Nevis vs United States",
    "‘Super’ Mullin wins back-to-back Wrexham POTY awards",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The Everton 2023-24 home kit revealed",
    "Kovacic ranked one of the WORST Premier League midfielders",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "Where to watch & stream MLS games live",
    "WATCH: Messi makes acting debut in Los Protectores TV series",
    "Exclusive: Messi's Miami move is a 'sensation', says LAFC star",
    "The 20 best football shirts to wear this summer",
    "All the top teams' 2023-24 football kits released so far",
    "Man Utd's 10 greatest home kits - ranked",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Champions League 23/24 group stage: All you need to know",
    "Manchester City vs Internazionale",
    "Exclusive: Inter deserved to beat Man City, says Milito",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶"
]