[
    "Pep's masterpiece: How Man City won the treble",
    "Messi rejecting Barca is a blessing for Xavi's team",
    "That's why you play Rodri in a Champions League final! 🎯",
    "Transfers LIVE: Spurs want £50m Sancho",
    "Man City - and Abu Dhabi - finally realise their European destiny",
    "Anonymous Dzeko & selfish Lautaro come up short for Inter",
    "'This f*cking trophy so difficult to win' – UCL relief for Pep",
    "Ballon d'Or 2023: Did Haaland do enough to catch Messi?",
    "Anitta wears Vini Jr shirt in UCL final performance",
    "USWNT star Macario is perfect for Chelsea - despite the risks",
    "Rashford splits from childhood sweetheart & fiancée Lucia Loi",
    "Arsenal in 'good position' to win Gundogan transfer race",
    "Messi walking into a disaster zone! Inter Miami extend losing run",
    "Man City Transfers LIVE: Gundogan comments on future",
    "Israel U20 vs South Korea U20: Stream, TV channels & where to watch",
    "Smoking! Haaland channels inner Pep with cigar celebration",
    "£33,000 for a drink with Messi! Chinese fans warned of scams",
    "WATCH: Zelarayan scores outrageous goal from inside his own half",
    "St. Louis vs LA Galaxy: Stream, TV channels & where to watch",
    "Explained: Why Carson got UCL medal despite no Man City minutes",
    "‘Southgate, I'm sorry’ – Walker hints at England duty hangover",
    "Arsenal Transfers LIVE: Gunners advance towards Rice",
    "Real Madrid Transfers LIVE: Mane to cost €30m",
    "‘Messi’s gonna win games’ – Arena lauds ‘special’ Beckham deal",
    "'I'm going to Miami now!' - Aguero jokes about Messi's MLS move",
    "See allSee All Breaking News",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Benzema explains key reason behind Al-Ittihad move",
    "EXCLUSIVE: Alexander-Arnold talks Messi, Salah and Liverpool",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "England's Women's World Cup send-off friendly is confirmed ✅",
    "When are England Women's fixtures in 2023?",
    "Will Macario play for USWNT at the 2023 Women's World Cup?",
    "USWNT star Macario announced by Chelsea 🇺🇸",
    "Hit or Miss: Every USWNT star to play in the WSL",
    "Colombia Women's World Cup 2023 squad: Who's in & who's out?",
    "Mario Balotelli: The story of a unique football career",
    "Guardiola's worst Champions League overthinks - ranked",
    "Move aside Messi & Ronaldo! Haaland is the UCL's new king",
    "Six reasons why Inter can do the impossible 👀",
    "How Inter Miami will line up with Messi in the team",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Quiz: How well do you recall the Premier League 2022-23?",
    "Dest reports for USMNT duty ahead of Mexico clash",
    "Wrexham crack Times Square! Foster's new deal makes it to NYC 🗽",
    "Pulisic 'given green light' to leave Chelsea as AC Milan circle",
    "Balogun: No better way to introduce myself than vs Mexico",
    "Manchester City vs Internazionale",
    "‘Bad guy’ – Tevez explains why Messi didn’t return to Barca",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Tell us: Who should Madrid sign to replace Benzema? 🤔",
    "Manchester City vs Manchester United",
    "Debate: Would any Man Utd players get in Man City's team?",
    "Getty/GOAL/IG-marcusrashford",
    "Man City's treble parade: All you need to know",
    "Liverpool Transfers LIVE: Reds contact defender's agents",
    "Chelsea Transfers LIVE: Onana commits to Inter Milan",
    "Vancouver Whitecaps vs Cincinnati: Stream, TV channels & where to watch",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Soccer cleats: latest releases in 2023",
    "adidas launch all-new X Crazylight boot",
    "All the top teams' 2023-24 football kits released so far",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]