[
    "It's time for PSG to sell Kylian Mbappe",
    "Where next for Pulisic? USMNT star's best landing spots",
    "Soccer Cities 23: The best football destinations for fans",
    "Messi claims he WON'T play at 2026 World Cup",
    "Cowell and Slonina headline USMNT Gold Cup squad",
    "Transfers LIVE: Chelsea set to register Mbappe interest",
    "Messi in MLS: Beckham's Inter Miami revolution",
    "Winners & losers of the 2022-23 European season",
    "Can Inter Miami survive until Messi arrives?",
    "Every Man City player in the 2022-23 season - ranked",
    "Chelsea Transfers LIVE: Maignan not interested in Blues",
    "Real Madrid Transfers LIVE: Madrid to spend €200m on Mbappe",
    "How well do you know '90s Premier League shirt sponsors?",
    "CR7's girlfriend Georgina to get £86,000 a MONTH if couple split",
    "Liverpool Transfers LIVE: Reds don't want Bayern star",
    "Barcelona agree Vitor Roque deal to start summer of spending",
    "Arsenal Transfers LIVE: Rice to join for £100m",
    "Messi talks Pep and four players he felt 'most comfortable' with",
    "Chelsea dealt blow as Maignan not interested in joining Blues",
    "Man City Transfers LIVE: Mahrez declines Al Ahli offer",
    "Barcelona Transfers LIVE: Alba set to reunite with Messi",
    "Spain Women's World Cup 2023 squad: Who's in & who's out?",
    "Bayern pull out of Rice transfer race - giving Arsenal clear run",
    "Italy Women's World Cup 2023 squad: Who's in & who's out?",
    "Fati labelled a 'phenomenon' & future Ballon d'Or winner by agent",
    "See allSee All Breaking News",
    "Former Milan president Berlusconi passes away at age of 86",
    "£33,000 for a drink with Messi! Chinese fans warned of scams",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Benzema explains key reason behind Al-Ittihad move",
    "Germany Women's World Cup 2023 squad: Who's in & who's out?",
    "Putellas back just in time for Spain as WWC squad revealed",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "England's Women's World Cup send-off friendly is confirmed ✅",
    "When are England Women's fixtures in 2023?",
    "Berlusconi: Most divisive & successful football president",
    "From the Pope to prostitutes: Berlusconi's most famous quotes",
    "Messi rejecting Barca is a blessing for Xavi's team",
    "Ballon d'Or 2023: Did Haaland do enough to catch Messi?",
    "Pep's masterpiece: How Man City won the treble",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Bayern plan Premier League transfer for USMNT star Tillman",
    "'He’s like a rat’ – Mullin told how to earn Wales call-up",
    "Juventus join transfer race for USMNT star Balogun",
    "Explained: Why Brooks is not in USMNT Gold Cup squad",
    "Wrexham’s U.S. tour includes Philly homecoming for McElhenney",
    "'Hang it in the Loooouvre' – Treble party never ends for Grealish",
    "'Sh*tty feeling' - Lukaku's emotional message to Inter fans",
    "Who has qualified for Champions League 2023-24?",
    "Rain on Man City's parade! Weather dampens treble party",
    "Georgina Rodriguez Instagram/Getty/Goal",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Messi: Ballon d'Or no longer important to me",
    "Where to watch & stream MLS games live",
    "MLS manager Arena 'could live with' Messi rule exception",
    "Messi's arrival to MLS doesn't scare Carlos Vela",
    "Guardiola's next job could be in MLS with NYCFC - Twellman",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "All the top teams' 2023-24 football kits released so far",
    "adidas release limited edition Italy 125 anniversary kit",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]