[
    "Pep's masterpiece: How Man City won the treble",
    "Messi rejecting Barca is a blessing for Xavi's team",
    "That's why you play Rodri in a Champions League final! 🎯",
    "Transfers LIVE: Chelsea demand £68.4m from Man Utd for Mount",
    "Man City - and Abu Dhabi - finally realise their European destiny",
    "Debate: Haaland deserved UCL player of the season - not Rodri",
    "Guardiola is going nowhere! Man City boss to see out contract",
    "Ballon d'Or 2023: Did Haaland do enough to catch Messi?",
    "Every Women's World Cup squad - listed",
    "Rapinoe injury scare for USWNT ahead of WC roster reveal",
    "Arsenal Transfers LIVE: Chiesa to Arsenal for €60m?",
    "Real Madrid Transfers LIVE: Mane to cost €30m",
    "Man City Transfers LIVE: Guardiola to stay for 2 more years",
    "Barcelona Transfers LIVE: Newcastle to sign Barca winger?",
    "Chelsea Transfers LIVE: Meslier to Chelsea?",
    "Man Utd Transfers LIVE: Blues want €80m for Mount",
    "Man City fans share horror stories from Champions League final",
    "Chelsea loanee Ampadu suffers THIRD successive relegation",
    "Meslier confirms interest in joining Chelsea from Leeds",
    "How to unlock Wrexham star Paul Mullin's FIFA 23 TOTS card",
    "Gerrard considering management offer from Al-Ettifaq",
    "WATCH: Usain Bolt copies Rashford celebration at Soccer Aid",
    "Blow for Wrexham! Charlton agree fee for target Alfie May",
    "Pep's 'idol' Julia Roberts congratulates City on UCL win",
    "Newcastle leading Spurs in race for Maddison",
    "See allSee All Breaking News",
    "WATCH: Benzema gets deafening reception at Al-Ittihad unveiling",
    "'Being Messi can't be easy' - Xavi understands Barca snub",
    "Benzema explains key reason behind Al-Ittihad move",
    "EXCLUSIVE: Alexander-Arnold talks Messi, Salah and Liverpool",
    "'City would annihilate Man Utd's treble-winners! | Front Three",
    "South Korea Women's World Cup 2023 squad: Who's in & who's out?",
    "England's Women's World Cup send-off friendly is confirmed ✅",
    "When are England Women's fixtures in 2023?",
    "Will Macario play for USWNT at the 2023 Women's World Cup?",
    "USWNT star Macario is perfect for Chelsea - despite the risks",
    "USWNT star Macario announced by Chelsea 🇺🇸",
    "Hit or Miss: Every USWNT star to play in the WSL",
    "Anonymous Dzeko & selfish Lautaro come up short for Inter",
    "Mario Balotelli: The story of a unique football career",
    "Guardiola's worst Champions League overthinks - ranked",
    "Six reasons why Inter can do the impossible 👀",
    "Move aside Messi & Ronaldo! Haaland is the UCL's new king",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "The ultimate football shirt sponsor quiz",
    "Quiz: How well do you recall the Premier League 2022-23?",
    "‘Messi’s gonna win games’ – Arena lauds ‘special’ Beckham deal",
    "Dest reports for USMNT duty ahead of Mexico clash",
    "Wrexham crack Times Square! Foster's new deal makes it to NYC 🗽",
    "Pulisic 'given green light' to leave Chelsea as AC Milan circle",
    "Balogun: No better way to introduce myself than vs Mexico",
    "Manchester City vs Internazionale",
    "Cancelo send message to Man City following UCL win",
    "'It’s an honour for me' - Pep reveals message from Sir Alex",
    "Did Messi make a mistake joining Inter Miami? 🤔",
    "Should Neymar sign for a Premier League club?",
    "Tell us: Who should Madrid sign to replace Benzema? 🤔",
    "Manchester City vs Manchester United",
    "Debate: Would any Man Utd players get in Man City's team?",
    "Arsenal open Castagne talks after Leicester relegation",
    "Messi walking into a disaster zone! Inter Miami extend losing run",
    "WATCH: Zelarayan scores outrageous goal from inside his own half",
    "St. Louis vs LA Galaxy: Stream, TV channels & where to watch",
    "'I'm going to Miami now!' - Aguero jokes about Messi's MLS move",
    "‘Bad guy’ – Tevez explains why Messi didn’t return to Barca",
    "Introducing all the 2023 Women's World Cup kits",
    "England 2023 Women's World Cup kits available now",
    "Soccer cleats: latest releases in 2023",
    "adidas launch all-new X Crazylight boot",
    "All the top teams' 2023-24 football kits released so far",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]