[
    "The cautionary tale of ex-Chelsea star Oscar",
    "USMNT bailed out by Brandon Vazquez in opening Gold Cup game",
    "Lyon contact Chelsea for USMNT star Pulisic",
    "10 moments that prove Gundogan is a Man City legend",
    "Explained: Why Messi could take one year off Argentina duty",
    "WATCH: Turner saves USMNT by keeping out Bailey penalty",
    "Transfers LIVE: Man City agree terms with €100m Gvardiol",
    "Another hat-trick! Sophia Smith makes NWSL history 🔥",
    "Roma make contact with USMNT star McKennie",
    "Garnacho next? A history of Man Utd's iconic No.7 shirt",
    "NYRB vs Atlanta United: Stream, TV channels & where to watch",
    "Man Utd could be boosted by Martinez return for U.S. tour",
    "Man City table £77m Gvardiol bid as defender verbally agrees move",
    "Arteta hails 'versatile' Havertz as Arsenal close in on £65m deal",
    "'I am tremendously grateful' - Arteta responds to PSG reports",
    "England U21 vs Israel U21: Stream, TV channels & where to watch",
    "Switzerland U21 vs Italy U21 : Stream, TV channels & where to watch",
    "Griezmann & Ronaldo link-up on the cards at Al-Nassr",
    "Arsenal sent Balogun transfer warning by Ramsey",
    "Martino confirms Inter Miami talks on Messi's return to Newell’s",
    "WATCH: Inter Miami fan throws Messi banner after '1,200-mile' trip",
    "UK rapper Aitch appears to leak Man Utd's 2023-24 home kit",
    "Man City Transfers LIVE: Gvardiol agrees personal terms with City",
    "Rooney savagely shuts down Lingard to D.C. United talk 😳",
    "Bayern set to swoop for Mount after Man Utd step back",
    "See allSee All Breaking News",
    "Why West Ham's stadium has become a baseball field",
    "Sergio Busquets to Inter Miami is a done deal!",
    "United States to host expanded 32-team Club World Cup",
    "Kovacic undergoes Man City medical ahead of £25m move",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Women's National League - Premier Division",
    "Newcastle make history as first pro team in women's third tier",
    "'It's clear I won’t be playing for England again' - Houghton",
    "Horan breaks Alex Morgan's transfer record with Lyon move",
    "How the USWNT should line up at the World Cup",
    "Revealed: Morgan & Rapinoe's plan to inspire USWNT to glory",
    "USWNT star Morgan reveals slight 'surprise' at World Cup call",
    "WATCH: Superstars announce USWNT 2023 World Cup roster",
    "'Screwed' last time - can Matt Miazga save his USMNT career?",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Hit or Miss: USMNT stars in Eredivisie as Pepi heads to PSV",
    "Tonali shows Newcastle are the anti-PSG of squad building",
    "How the USMNT should line up vs Jamaica in Gold Cup opener",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "United States vs Jamaica: Stream, TV channels & where to watch",
    "'Like a dream' - Balogun is absolutely loving USMNT",
    "Callaghan clarifies Berhalter involvement in Gold Cup plans",
    "Man City launch three hot air balloons to show off treble success",
    "Lewandowski's crazy goalscoring stats in full",
    "Manchester City vs Internazionale",
    "UCL final ref waves cards at himself in front of mirror",
    "Ronaldo, Messi, Pele & the top scorers of all time",
    "Should Man Utd give up on Mason Mount?",
    "Are Chelsea making a huge £90m mistake?",
    "Should Man Utd sign Ollie Watkins?",
    "Front Three: 'Man Utd had the howler of the season at Liverpool!'",
    "Getty/GOAL/Twitter-@philaunion",
    "Portland Timbers vs NYCFC: Stream, TV channels & where to watch",
    "Seattle vs Orlando: Stream, TV channels & where to watch",
    "SJ Earthquakes vs St. Louis: Stream, TV channels & where to watch",
    "Rangers 2023-24 kit: New jerseys, release dates & prices",
    "Celtic 2023-24 kit: New home, away and third jersey details",
    "PUMA drop the 2023-24 EFL match ball",
    "Inter Miami 2023 kit: New jerseys, release dates & prices",
    "West Ham 2023-24 kit: New jerseys, release dates & prices",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶",
    "Adriano: The rise and fall of 'The Emperor'",
    "Ultimate Inter dream team: Ronaldo IN, Vieri OUT",
    "What happened to Inter's 2010 Champions League heroes?",
    "Volcanos, sprinklers & how Mou's Inter took down Pep's Barca"
]