[
    "Man Utd are making a mess of the transfer window... again",
    "Big bad Bryan Reynolds makes his mark for the USMNT",
    "Ferreira on fire as USMNT score six in Gold Cup thrashing",
    "Transfers LIVE: Man Utd make Onana bid",
    "Martino reunited with Messi at Inter Miami",
    "Forget Messi! Maddison is the signing of the summer so far",
    "Arsenal paying £65m for Havertz feels like a colossal waste of cash",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Why Madrid, Barca & more want 'Turkish Messi' Arda Guler",
    "Declan Rice: World-class or overhyped?",
    "Kovacic ranked one of the WORST Premier League midfielders",
    "Man Utd beaten to €50m Kim transfer by Bayern Munich",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Ireland Women's World Cup 2023 squad: Who's in & who's out?",
    "All completed Serie A transfers in 2023-24 - listed",
    "Sergio Ramos keen to return to Sevilla following PSG exit",
    "‘Felt like heart was going to explode’ - Szczesny on health scare",
    "Where to watch & stream Liga MX games live",
    "Where to watch & stream MLS games live",
    "Man Utd table Onana bid after refusing to sign off De Gea deal",
    "Man Utd Transfers LIVE: Red Devils to hold Mount talks with Chelsea to break impasse",
    "Arsenal Transfers LIVE: Gunners agree record £105m Declan Rice deal",
    "Chelsea Transfers LIVE: Blues have €15m bid accepted for Santos wonderkid",
    "Liverpool Transfers LIVE: Reds explore deal for £60m RB Leipzig star",
    "Where to watch & stream NWSL games",
    "See allSee All Breaking News",
    "Revealed: Kovacic explains reason for Man City move",
    "Modric agrees one-year contract extension with Real Madrid",
    "Done deal! Gundogan leaves Man City for Barcelona",
    "Reynolds & Milan owners to invest €200m in Alpine F1 team",
    "Done deal! Al-Hilal confirm €25m signing of Koulibaly",
    "Another blow for Lionesses! Bright to miss Portugal clash",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "England Women's World Cup squad announced",
    "Arsenal confirm Ilestedt arrival in PSG transfer deal",
    "Russo a future England captain? Striker on leading Lionesses",
    "Wrexham reward women's team with 10 semi-pro contracts",
    "Where Havertz will slot in at Arsenal",
    "Madueke stars as England send Germany packing from U21 Euros",
    "Saudi Pro League: Superstars who could join Benzema & CR7",
    "Man Utd are right to make De Gea contract U-turn",
    "Hit or miss? Italians in the EPL as Tonali joins Newcastle",
    "Arsenal & USMNT's Turner stuns MLB star in batting practice",
    "St. Kitts and Nevis vs United States",
    "St. Kitts & Nevis vs USMNT: Where to watch the game",
    "Balogun eyed for Sanchez link-up at Marseille",
    "Morgan & Kelly star in Calvin Klein photoshoot ahead of WWC",
    "Leicester interested in USMNT star Steffen",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "Which legendary Premier League manager are you?",
    "Quiz: Only a '00s fan can name these Champions League stars",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "'Madrid move will secure a Ballon d'Or for Mbappe' | Front Three",
    "Are Chelsea making a huge £90m mistake?",
    "WATCH: Messi makes acting debut in Los Protectores TV series",
    "Exclusive: Messi's Miami move is a 'sensation', says LAFC star",
    "Messi chills in the Bahamas with Antonela Roccuzzo",
    "Barca make Amrabat transfer call after failing to re-sign Messi",
    "The 20 best football shirts to wear this summer",
    "All the top teams' 2023-24 football kits released so far",
    "Man Utd's 10 greatest home kits - ranked",
    "Man Utd unveil iconic red rose 2023-24 home kit",
    "Man Utd 2023-24 kit: New home, away & third jersey details",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Champions League 23/24 group stage: All you need to know",
    "Manchester City vs Internazionale",
    "Exclusive: Inter deserved to beat Man City, says Milito",
    "Explained: Nkunku's balloon celebration",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟",
    "Ten wonderkids to watch at the U17 Euros 👶"
]