[
    "Cursed or careless? Why Pulisic failed at Chelsea",
    "GOAL's World-Class Club: Women's football's elite stars",
    "PSG are doing some of their best transfer business in years!",
    "Ancelotti taking Brazil job in 2024 makes no sense for anyone",
    "In demand! USMNT & Arsenal star Balogun wanted by five clubs",
    "AC Milan to make one last bid to sign Pulisic",
    "Transfers LIVE: Mbappe to sign €50m-per-year Madrid contract",
    "GOAL's World-Class Club: Football's exclusive elite",
    "Why Real Madrid are spending €20m+ on the 'Turkish Messi'",
    "What a signing! Man City land Dutch star Roord 🔥",
    "Real Madrid Transfers LIVE: Los Blancos beat Barcelona to sign Turkish star Guler",
    "12 players Man Utd must sell to pay for a striker",
    "Man Utd get boost in Onana pursuit as Inter open Sommer talks",
    "Saliba signs new four-year Arsenal contract",
    "Chelsea, Man Utd & PSG attempt to hijack Barca's Roque deal",
    "Who is the Women's World Cup all-time top scorer?",
    "Denmark Women's World Cup 2023 squad: Who's in & who's out?",
    "Chelsea giving up on Caicedo? Blues won't match £100m demand",
    "Arsenal Transfers LIVE: Bayer Leverkusen sign Granit Xhaka for £21.5m",
    "Aston Villa battle Dortmund to sign USMNT's McKennie",
    "Miazga wants second USMNT chance after Berhalter's return",
    "Man Utd Transfers LIVE: Red Devils increase Onana offer to €50m",
    "Australia WWC 2023 squad: Who's in & who's out?",
    "Man Utd raise Onana bid to €50m",
    "All completed Bundesliga transfers in 2023-24",
    "See allSee All Breaking News",
    "There will be no Messi in the future - Martinez",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "WATCH: Gerrard speaks 'Scouse Arabic' at Al-Ettifaq 😂",
    "EXCLUSIVE: England star Stanway reveals kitbag essentials",
    "EXCLUSIVE: England star Russo ready for 'new challenge' at WWC",
    "FA & Google Pixel to improve visibility in women's game",
    "When are England Women's fixtures in 2023?",
    "Japan Women's World Cup 2023 squad: Who's in & who's out?",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "Switzerland Women's World Cup 2023 squad: Who's in & who's out?",
    "Why Man Utd can only spend £120m this summer",
    "Zero to hero for Gibbs-White as England reach U21 Euros final",
    "Madrid's next manager: Who will replace Ancelotti?",
    "How versatile Timber will fit in to Arsenal's defence",
    "Balogun to play for Arsenal in MLS All-Star Skills Challenge",
    "Wrexham striker Mullin sets record-breaking goal target",
    "USMNT star Robinson to snub interest from Man City & Milan 👀",
    "Balogun wanted by Chelsea! Transfer question asked of Arsenal",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "How much would you pay for Harry Kane?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Would Bayern Munich be the right move for Harry Kane?",
    "LA Galaxy tickets: ticket prices, package deals, membership & season ticket information",
    "Make room for Messi! Inter Miami star blasts MLS trade policy",
    "First images of Messi in Inter Miami kit emerge",
    "Messi 'just another player', says potential debut opponent",
    "Inter Miami launch bid to link Hazard up with Messi",
    "All the top teams' 2023-24 football kits released so far",
    "PUMA unveil the new 2023-24 La Liga match ball",
    "PSG's 10 greatest away & third kits - ranked",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Soccer cleats: latest releases in 2023",
    "What is a 'Group of Death' in soccer?",
    "How to buy UEFA Champions League tickets",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟"
]