[
    "Cursed or careless? Why Pulisic failed at Chelsea",
    "GOAL's World-Class Club: Women's football's elite stars",
    "Ancelotti taking Brazil job in 2024 makes no sense for anyone",
    "Mason Mount for £60m?! Man Utd have clearly paid way too much",
    "In demand! USMNT & Arsenal star Balogun wanted by five clubs",
    "Transfers LIVE: Mbappe told to sign new deal or leave PSG",
    "GOAL's World-Class Club: Football's exclusive elite",
    "Five biggest jobs for Pochettino to do at Chelsea 📥",
    "What a signing! Man City land Dutch star Roord 🔥",
    "Zero to hero for Gibbs-White as England reach U21 Euros final",
    "Revealed: Jesus decided to leave City after Pep made him cry",
    "PSG confirm arrival of Marco Asensio on free transfer",
    "Brighton want more than £100m for Caicedo after Arsenal splurge",
    "What is Threads & which footballers are on ‘the new Twitter’?",
    "Newcastle linked with shock move for Juventus star Bonucci",
    "Balogun wanted by Chelsea! Transfer question asked of Arsenal",
    "'I love this pressure' -  Luis Enrique relishing PSG challenge",
    "When is Jake Paul’s next fight?",
    "Mount explains why he left Chelsea in £60m Man Utd transfer",
    "How to buy UEFA Europa League tickets",
    "PSG announce Skriniar's arrival on a free transfer",
    "Explained: Why Man Utd are struggling to offload Maguire",
    "Chaos at Wrexham! New shirt sells out after just two hours",
    "Dortmund end interest in re-signing Sancho from Man Utd",
    "Arsenal tickets: ticket prices, package deals, membership & season ticket information",
    "See allSee All Breaking News",
    "There will be no Messi in the future - Martinez",
    "EXCLUSIVE: England star Toone on Euros glory & Man City snub",
    "WATCH: Gerrard speaks 'Scouse Arabic' at Al-Ettifaq 😂",
    "EXCLUSIVE: England star Stanway reveals kitbag essentials",
    "EXCLUSIVE: England star Russo ready for 'new challenge' at WWC",
    "When are England Women's fixtures in 2023?",
    "Japan Women's World Cup 2023 squad: Who's in & who's out?",
    "Nigeria Women's World Cup 2023 squad: Who's in & who's out?",
    "Switzerland Women's World Cup 2023 squad: Who's in & who's out?",
    "Norway Women's World Cup 2023 squad: Who's in & who's out?",
    "New Zealand Women's World Cup 2023 squad: Who's in & who's out?",
    "'Just in shock' - Bright reflects on England captaincy decision",
    "Why Man Utd can only spend £120m this summer",
    "Madrid's next manager: Who will replace Ancelotti?",
    "How versatile Timber will fit in to Arsenal's defence",
    "Can Mount live up to the history of Man Utd's iconic No.7s?",
    "Jude who?! Liverpool fans forgetting all about Bellingham",
    "Make room for Messi! Inter Miami star blasts MLS trade policy",
    "Chelsea tell Milan to raise Pulisic offer after second bid",
    "First images of Messi in Inter Miami kit emerge",
    "Quiz: Only a true fan can name these Chelsea legends",
    "Quiz: Only a true fan can name these Man Utd legends",
    "Can you guess the Premier League club from the emojis?",
    "How well do you know '90s Premier League shirt sponsors?",
    "'From CR7 to Micky Mount!' - Did Ten Hag make wrong call?",
    "Is a UCL return a must in Poch's first season at Chelsea?",
    "Would Bayern Munich be the right move for Harry Kane?",
    "Should Man Utd give up on Mason Mount?",
    "Messi 'just another player', says potential debut opponent",
    "Inter Miami launch bid to link Hazard up with Messi",
    "Pulisic lined up to succeed Messi in MLS after 2026 World Cup",
    "Buda Mendes - FIFA/FIFA via Getty Images",
    "USMNT starlet Cowell addresses Newcastle & Bayern transfer links",
    "WATCH: Messi's new team-mate Martinez scores stunning bicycle kick",
    "All the top teams' 2023-24 football kits released so far",
    "PSG's 10 greatest away & third kits - ranked",
    "Chelsea 2023-24 kit: New home, away & third jersey details",
    "Soccer cleats: latest releases in 2023",
    "PSG 2023-24 kit: New home, away & third jersey details",
    "How to buy UEFA Champions League tickets",
    "Grealish in Sin City! Treble winner takes epic party to Vegas",
    "Kane would make Bayern UCL favourites alongside Man City",
    "Bayern star Mane breaks silence on Sane punch incident",
    "Jalen Neal: Future's bright for the USMNT's teen Gold Cup star",
    "Josh Wynder: Benfica-bound teen could be USMNT's Van Dijk",
    "Kendry Paez: Chelsea's new £17m Ecudorian wonderkid",
    "The top wonderkids on show at the U20 World Cup 🌟"
]