[
    "The Guardian - Back to home",
    "Classified documents Trump pleads not guilty to 37 federal criminal counts in Mar-a-Lago case",
    "Indictment who's who A guide to everyone mentioned in the charges",
    "Explainer Who is Aileen Cannon, the judge in Trump’s Mar-a-Lago case?",
    "Donald Trump claims ‘political persecution’ after arraignment",
    "The charges against Trump Full text of federal indictment",
    "A silent and sullen Trump goes before judge in Miami – amid din outside",
    "‘Wannabe dictator’ caption appears on Fox News",
    "Keeping cameras out of court denied the public the sight of Trump at bay",
    "Asthma sufferer, 15, testifies in landmark US climate trial",
    "US judge blocks takeover by Microsoft until further hearings",
    "Ukraine will not be offered timeline for membership at summit in July",
    "‘Hidden’ Malibu beach will open to public for first time in 40 years",
    "Writer can sue Trump for $10m in new defamation case, judge rules",
    "Two soldiers killed as fellow recruit opens fire",
    "War drove biggest rise in displaced persons in decades",
    "US House unanimously calls on Russia to release journalist",
    "Interest to resume in September and payments in October",
    "Ex-NFL star says ‘100% a miracle’ he saved son and niece from drowning",
    "Pod of 30 orcas bring killer moves to a California bay",
    "Only the world-famous cellist Yo-Yo Ma!",
    "Human trafficking surges in cyclone-hit east India",
    "The US is still playing catch-up",
    "Cormac McCarthy A life in quotes",
    "Celebrated US novelist dies aged 89",
    "Can a guaranteed income program work?",
    "‘From what my daughter says, 90% of her year do it’",
    "I can only climax in one position. Why do my lovers try to talk me out of it?",
    "Celebrating the art of Gego",
    "How British freestyle rap videos became a global phenomenon",
    "How much salt is too much salt?",
    "‘I never had any shame about being gay’",
    "Ukraine Putin denies Zelenskiy’s claims of counteroffensive success",
    "How successful has Ukraine’s counteroffensive been so far?",
    "As the ice melts, a perilous Russian threat is emerging in the Arctic",
    "What we know on day 476 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Cormac McCarthy showed us America’s violent heart",
    "Donald Trump’s arrest is ugly but it’s also democracy in action",
    "Ignoring Robert F Kennedy Jr is not an option",
    "Boris Johnson is gone, but his toxic Brexit myths will go on poisoning UK politics",
    "Therapy is great. But have some Americans had too much?",
    "Jackpot! Vegas trounce Panthers in Game 5 to claim NHL title",
    "Denver and the inevitable Jokic are a dynasty in waiting",
    "Lionel Messi’s move to Miami brings joy, disbelief, and potential pitfalls",
    "At 91, Don King still longs for the spotlight. But it is shining elsewhere",
    "‘The problem at Barcelona wasn’t me. I have a clear conscience’",
    "Rahm admits players feel sense of betrayal over deal with Saudi Arabia",
    "United star admits seeing Manchester City win treble ‘not nice’",
    "Tales of yore will tell of the plot twists in this Mbappé to Real Madrid saga",
    "Not phasing out fossil fuels is ‘death sentence’ for world’s poor, says activist",
    "Young residents bring climate change case to court for first time ever",
    "Illegal reintroductions of rare butterflies to UK ‘a risk to other species’",
    "Young people testify at historic US climate trial",
    "Company hires boy, 14, who became youngest graduate at California university",
    "Councilman faces criminal charges including embezzlement",
    "White House pushes for renewal of electronic surveillance law provision",
    "Nine injured in shooting after Nuggets win NBA title",
    "California’s Gavin Newsom backs Joe Biden on Fox News",
    "Salt Bae Burger, once dubbed city’s worst restaurant, closes",
    "Biden press chief violated Hatch Act with ‘mega Maga’ remark, says watchdog",
    "Warning over Texas beach after thousands of dead fish wash up",
    "Mall owner Westfield gives up San Francisco center as foot traffic dwindles",
    "US prices rose 4% over the last year as Fed considers pause in rate hikes",
    "Italy Prosecutors say ‘hijackers’ on cargo ship were actually asylum seekers",
    "Ukraine war drove biggest rise in displaced persons in decades",
    "Marriages drop to record low despite government push",
    "Nottingham attacks University city in shock after three die in early morning attacks",
    "Nottingham victim Barnaby Webber’s family pay tribute",
    "Amazon under fire for ramping up sellers’ fees and advertising costs",
    "UK GDP report to show if economy rebounded in April",
    "Anguish as rape survivors unable to access vital medication",
    "Rescued children pay tribute to sniffer dog still missing in jungle",
    "New Zealand and Fiji strike defence deal amid China tensions",
    "Missing Australian found dead after ‘unfortunate hiking accident’",
    "Cult death toll passes 300, with more exhumations planned",
    "How Saudi Arabia took over professional golf",
    "Listen to previous episodes",
    "Masterpieces and oddities: Cormac McCarthy’s bleak, bold and batty films",
    "Disney pushes back sequels, with fifth film now due in 2031",
    "Spider-Man artist and co-creator of Wolverine, dies at 93",
    "Mixed reactions after Elizabeth Gilbert pulls Russia-set novel",
    "Graham Norton on drag, dreams, death and desire",
    "The missile alert promised sudden death. That awful hour taught me how to live",
    "The Mont-Blanc Express from Switzerland to France",
    "My parents want to split their home into two houses, selling one to me. Is it feasible?",
    "Strawberries with passion fruit",
    "Rachel Roddy’s recipe for fried polenta with cheese",
    "Don’t underestimate the humble box grater",
    "Everyone is recreating Wes Anderson’s world. Wes Anderson isn’t happy about it",
    "Māori ancestral remains and mummified heads returned from Germany",
    "Queer influencers in the US say brands have gone quiet",
    "What is the fighting in the UK Tory party about – and how is Boris Johnson involved?",
    "Ngũgĩ wa Thiong’o: three days with a giant of African literature",
    "Why is a great painter who lived to 101 still defined by a man she left in the 1950s?",
    "Magical images of childhood",
    "Corsica protesters and an early morning hare",
    "Colombia’s Tomato Fight festival",
    "Local designers show their collections at Fiji fashion week 2023",
    "The best of Photo Basel 2023",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Hidden’ Malibu beach will open to the public for the first time in 40 years",
    "Missing Australian found dead in Canadian wilderness after ‘unfortunate hiking accident’",
    "Fox News labels Joe Biden a ‘wannabe dictator’ during Trump speech",
    "‘I’m a prisoner in my own home,’ asthma sufferer, 15, tells landmark US climate trial",
    "Trump claims ‘political persecution’ in speech after arraignment",
    "Whale of a time: pod of 30 orcas bring killer moves to a California bay"
]