[
    "The Guardian - Back to home",
    "Explainer What is the US debt ceiling?",
    "Biden and McCarthy reach ‘in principle’ deal days before US default",
    "Attorney general impeached by Republican-led House in historic vote",
    "Kyiv Russian air raid kills one in largest drone attack on capital yet – official",
    "Russia unleashes major drone attack as Kyiv prepares to celebrate birthday",
    "Opposition stirs up anti-immigrant feeling in attempt to win presidency",
    "Insurance giant halts sale of new home policies in state due to wildfires",
    "Republican governor rolls back state’s child labor law protections",
    "Vatican back in spotlight over mystery of missing girl",
    "Vice-president becomes first woman to give West Point commencement speech",
    "First domestically produced passenger jet makes maiden commercial flight",
    "Fierce beast attacking residents revealed as domestic cat with attitude",
    "Up to 70% of beaches could disappear by end of the century",
    "Wave of lawsuits against firearm makers raises hope of end to mass shootings",
    "How a Belarus dissident became an apologist for the regime",
    "Barcelona’s working-class, leftwing mayor Ada Colau fights for third term",
    "A curious choice for the Palme – but what an extraordinary Cannes",
    "Can we predict the collapse of societies?",
    "The Red Berets ride to the rescue of New York subway commuters, 1979",
    "The tragedy and beauty of Nick Drake, by those closest to him",
    "My cheating boyfriend told me he was a sex addict. Was it a disorder – or just an excuse?",
    "We’d known each other for three months and kissed once – then over the phone, I proposed",
    "'People imagine that the guilt of an affair makes the sex more exciting’",
    "Inside the world’s longest-running mermaid gathering",
    "The moment has arrived: Biden must give Ukraine all it needs to win",
    "What we know on day 459 of the invasion",
    "Former UK PM Boris Johnson tried to persuade ex-president to back Ukraine on US tour",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "If you defend free speech, you must defend it all and not silence those you disagree with",
    "Why the bimbocore aesthetic is the path to weaponising the social performance of the ageing woman",
    "Should Taylor Swift speak up now on Matty Healy’s controversies?",
    "What is a dog, then? On the unbearable death of my dog, Polly",
    "Red tape can’t be allowed to hold up the Holocaust memorial any longer",
    "Heat on brink of historic collapse as Celtics force Game 7 on White’s putback",
    "Olympic champion shatters own shot put world record at LA Grand Prix",
    "Premier League Ten things to look out for on the final day",
    "Luton promoted to Premier League after shootout win over Coventry",
    "Rolling in the deep Why players are backing off the baseline",
    "You’re alone on court. It’s like a lonely, lonely journey",
    "Bucks set to hire Raptors’ Adrian Griffin as head coach – reports",
    "Germany stun USA late to book final with Canada at worlds",
    "Messi on target as PSG clinch a record 11th Ligue 1 title",
    "Renowned US mountaineer climbs rare Everest region ‘triple crown’",
    "Recycled and reused food contact plastics are ‘vectors’ for toxins, study finds",
    "Stars could be invisible within 20 years as light pollution brightens night skies",
    "Just Stop Oil protesters invade pitch and stop play at Twickenham rugby final",
    "Cutting parking spaces 'could solve New York rat crisis and create more green spaces'",
    "Florida Ron DeSantis appears to back woman who led Amanda Gorman poem school ban",
    "Candidate’s limp start to 2024 race delights Trump but battle is not over",
    "US priest’s sentence offer for molesting child too lenient, says accuser in case",
    "Nun’s body intact four years after death draws people to monastery",
    "‘Massive’ data leak reveals thousands of alleged safety complaints – report",
    "Sailor’s death stemmed from ‘near perfect storm’ of Seal training failures",
    "Oath Keeper sentenced to eight and a half years for role in January 6",
    "Donald Jr confuses his father with DeSantis",
    "Former Maryland trash hauler graduates from Harvard Law School",
    "US to give away free lighthouses as GPS makes them unnecessary",
    "Prosecutors have evidence ex-president showed classified papers to people, report says",
    "Vast new parliament opened by Narendra Modi amid opposition boycott",
    "Ministers engaged in bitter fight to halt release of Covid secrets",
    "Man who opened plane door before landing says he wanted out ‘quickly’",
    "Trusts shared patient details with Facebook without consent",
    "Official suspended after draining reservoir to retrieve phone",
    "Rows over Eta and racism loom large as holds local elections",
    "Prominent pro-democracy Civic party votes to disband",
    "Refugees seriously injured on fence UK built to keep asylum seekers out of EU",
    "TikToker Mizzy charged with breaching criminal behaviour order",
    "Pope Francis returns to work after taking day off with fever",
    "Palme d’Or winner criticises Macron’s ‘repression’ of protests",
    "Vivid portrait of Israel in ferment",
    "‘Your earlobes are thick and chewy, like barnacle meat!’ Succession’s all-time best zingers",
    "‘Would it have landed the same way without the mad bum-rush of Trump’s presidency?’",
    "What happens if your partner doesn’t like your writing?",
    "True story of family and the civil rights struggle",
    "The tide has turned on beauty fillers, but don’t assume ‘natural’ is in",
    "‘A teacher telling me I was a “reasonably intelligent girl” drove me crazy’",
    "My life as a pub manager in badly behaved Britain",
    "Style languages combine in a Dublin home",
    "Squirrel haggis and Japanese knotweed reach UK menus as invasive species trend grows",
    "‘She asked if I’d Googled her before the date. I said of course’",
    "The rural Australians helping Afghan asylum seekers find refuge",
    "The US professor living underwater for 100 days",
    "Who was the woman who jumped to her death?",
    "The vintage radio enthusiasts prepping for disaster",
    "How Phillip Schofield’s exit unfolded – and what next for This Morning?",
    "Is Binance capable of being regulated?",
    "Fashion fixes for the week ahead",
    "Imaginary spaces rendered in fabric",
    "I’d never seen a woman riding a motorcycle in a dress",
    "10 years of its best photography",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Up to 70% of California beaches could disappear by end of the century",
    "Biden and McCarthy reach ‘in principle’ deal to raise debt ceiling days before US default",
    "Henry Kissinger turns 100 this week. He should be ashamed to be seen in public",
    "Immunologist Akiko Iwasaki: ‘We are not done with Covid, not even close’",
    "‘Caste is anti-Asian hate’: the activists fighting ‘less visible’ discrimination in the US",
    "Texas attorney general impeached by Republican-led House in historic vote",
    "Insurance giant halts sale of new home policies in California due to wildfires"
]