[
    "The Guardian - Back to home",
    "CNN Trump debacle suggests TV media set to repeat 2016 mistakes",
    "Rage as he might at sexual abuse verdict, legal woes have only just begun",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric",
    "Title 42 Restrictions have ended, but Biden’s new policy is tougher",
    "‘This was my last try’ Dismay as Title 42 ends and little changes",
    "Calm prevails after Title 42 migration restrictions lifted",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "Climate crisis deniers target scientists for vicious abuse",
    "Erdoğan’s grip on power tested as polls open",
    "Ceasefire puts an end to five days of fighting that left dozens dead",
    "Thousands evacuated as Cyclone Mocha makes landfall",
    "Imran Khan calls for countrywide ‘freedom’ protests",
    "Legal defense fund raises over $1m for accused in New York subway death",
    "Florida governor secures endorsements on visit to Iowa in preparation for likely 2024 bid",
    "Trump debacle suggests TV media set to repeat mistakes of 2016",
    "Brittney Griner plays first game since detainment in Russia",
    "The wild continent of snow, ice and, increasingly, women",
    "Russia-Ukraine war: Zelenskiy thanks Germany for support on Berlin visit",
    "Ukraine minister ‘confused’ about refusal to let Zelenskiy speak",
    "What we know on day 445 of the Russian invasion",
    "Russian troops fall back to ‘defensive positions’ near Bakhmut",
    "Why are the sexual needs of the bereaved still a taboo?",
    "Jason Sudeikis on Ted Lasso – and lessons in kindness",
    "Why label dates don’t mean what you think",
    "Why it’s never too late to make close friends",
    "The UK home secretary who made her name with hardline anti-migration stance",
    "Orvieto classico: the honeycomb Italian city",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Williams fired by Suns after second straight early playoff exit",
    "Gauff at crossroads after hitting first speed bumps",
    "Chelsea agree terms with Pochettino to become manager",
    "The series of poor decisions that sent Saints marching out of Premier League",
    "The epic LeBron-Steph rivalry delivered again. Enjoy them while you can",
    "Eagles star earns master’s degree from Oklahoma",
    "Griner plays first game since detainment in Russia",
    "Fan charged with assault after shove on Howe",
    "Sign up to the US opinion email",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "Big tech says it can boost productivity, but AI won’t solve meetings madness",
    "The culture of mistrust is bleeding into our personal lives. No wonder there’s a sex recession",
    "What a Czechoslovakian doll taught me about happiness – and its dark side",
    "More than 300,000 Syrian civilians died. Any attempt to rehabilitate Assad is utterly shameful",
    "Too tired to cook. Too easy to open a packet. It’s not our fault we eat junk",
    "When De Niro is having a child at 79, it’s time to cut older mothers some slack",
    "Simon Schama on the broken relationship between humans and nature",
    "The Arctic islands where we can see the future of global heating",
    "‘Ghost lake’ reappears after sodden winter",
    "Eurovision TV review Peace, love and gloriously diverse chaos triumph as UK hosts Eurovision",
    "Audience This year’s Eurovision is most watched final in song contest’s history, says BBC",
    "Ukraine Russian missiles strike home town of country's Eurovision entry",
    "Sweden wins song contest in Liverpool with Loreen",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "The writing partners keeping music stars grounded",
    "Homegrown review: Timothy McVeigh and the rise of the Trumpist threat",
    "The wild revolutionary politics of Eurovision",
    "Winnie & Nelson by Jonny Steinberg; The Plot to Save South Africa by Justice Malala – review",
    "I was a tiny cog in a machine of people all named vice-president of something",
    "Historic gay dating show is a queer summer treat",
    "The trouble with writing dystopian science fiction",
    "The universe moved when the Strokes were all together",
    "I only have three vices left: coffee, chocolate and salt",
    "My father is obese and I can’t stand being around him",
    "I said ‘I’d marry you tomorrow’ and that was it",
    "A therapist on how to survive grown-up kids moving back home",
    "José Pizarro’s steamed asparagus with jamón and crispy fried egg",
    "I probably jumped down from a chair more than 50 times",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "Teacher allegedly investigated for showing students film Strange World",
    "Thirteen-year-old girl punches shark to escape attack",
    "The food court building community in the city’s ‘doom loop’",
    "Latest arrests of protesters ‘feel like overreach’, experts say",
    "What is their future with top leaders jailed?",
    "How America’s fatal gun attraction turned schools into war zones",
    "Man kills girlfriend after she had an abortion in Colorado",
    "Governor ‘embarrassed’ by crowd’s behavior at Trump town hall",
    "Mother of US bride killed in crash condemns driver who ‘chose to drink’",
    "Thailand Young Thais look to Pita Limjaroenrat to bust military-royalist grip on power",
    "Election day arrives with hope of unseating junta generals from power",
    "Scientists criticise Nasa for scaling back mission to explore beyond Pluto",
    "UK politics Tory anarchy breaks out as revolt looms on Brexit laws",
    "Disciples gathered to sing the old hymns. But are they a real threat to Rishi Sunak?",
    "Revealed: richer graduates in England will pay less for degree than poorer students",
    "Congress party defeats Narendra Modi’s BJP in Karnataka state elections",
    "Single-use vapes sparking surge in fires at UK waste plants",
    "Young Thais look to Pita Limjaroenrat to bust military-royalist grip on power",
    "Cyclone Mocha threatens world’s largest refugee camp on Bangladesh border",
    "Starmer says his Labour must go further than Blair",
    "Voice synthesising is being hailed as the future of video games – but at what cost?",
    "The Mexican city torn apart by cartel kidnappings",
    "Ukraine’s 2016 Eurovision winner Jamala on why Putin fears her people, the Tatars",
    "Peckham’s charm under threat from gentrification plans",
    "Memories of meals gone by – in pictures",
    "The week around the world in 20 pictures",
    "Rare armadillos, pan bashing and a victory stamp",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "DNA evidence reveals family man in Australia was teenage killer who escaped Nebraska jail",
    "The moment I knew: I said ‘I’d marry you tomorrow’ and that was it",
    "Erdoğan’s grip on power tested as Turkey votes in pivotal election",
    "Trump rages after sexual abuse verdict but legal woes have only just begun",
    "Florida teacher allegedly investigated for showing students film Strange World",
    "This is how we do it: ‘A tired, throwaway midweek shag doesn’t interest me’",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric on crime"
]