[
    "The Guardian - Back to home",
    "Live Heavy battles on frontline after Kyiv reports first gains in counteroffensive",
    "Ukraine accuses Russia of destroying another dam",
    "Bank reaches settlement with victims of Jeffrey Epstein’s abuse",
    "Live Trump indictment: ex-US president plans defense ahead of Tuesday’s court appearance",
    "Air Ben Affleck and Matt Damon condemn use of audio in Trump campaign video",
    "Kari Lake’s vow to defend ex-president with guns 'threatens democracy'",
    "Legacy Ex-PM leaves behind a loss of faith in Italy’s political elite",
    "Scandal-ridden former Italian prime minister dies aged 86",
    "Young residents bring climate change case to court for first time ever",
    "Leopoldstadt and Kimberly Akimbo win big in historic night for non-binary actors",
    "Former first minister Nicola Sturgeon should give up party membership, says ex-leadership rival",
    "Country to provide free sun cream to tackle record skin cancer levels",
    "Nine out of 10 people are biased against women, says ‘alarming’ UN report",
    "China concerns prompt US move to rejoin agency",
    "Kim Jong-un ‘holds hands’ with Vladimir Putin as ties with Russia deepen",
    "How four siblings survived in Colombia’s perilous jungle",
    "Nobody talks about parenting with complex PTSD",
    "As the US becomes more divided, companies find they can’t appeal to everyone",
    "Can you spot the phezukomkhono? (that’s Zulu for red-chested cuckoo)",
    "When magic mushroom chocolate gets into the wrong hands",
    "US workers and passengers expect further misery as air travel rebounds",
    "Analysis Berlusconi’s death poses challenge for his party and for Meloni",
    "Media tycoon and prime minister mired in sex scandals, debt crisis and tax fraud",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "The real problem with the show’s Black fantasy",
    "Why is a great painter who lived to 101 still defined by a man she left in the 1950s?",
    "I opened the box and screamed bloody murder",
    "Share your experiences of US abortion care with us since provision was overturned",
    "UN concerned by ‘discrepancy’ in Ukraine nuclear plant water levels after dam collapse",
    "‘Masterpiece’ house is latest victim of Putin’s war on Ukrainian heritage",
    "Radio New Zealand employee put on leave amid investigation of Ukraine stories",
    "What we know on day 474 of the Russian invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Silvio Berlusconi may be gone, but Trump’s still here. The rotten populist legacy is everywhere",
    "Be angry about the wildfire pollution – but be angry at the right people",
    "When I lost my job, I learned to code. Now AI doom mongers are trying to scare me all over again",
    "Germany’s landmark match against Ukraine will promote peace and solidarity",
    "When did Love Island become more about fame than fun?",
    "What lies behind Russia’s acts of extreme violence? Freudian analysis offers an answer",
    "Jamie Jackson What next for Guardiola after Istanbul?",
    "Jonathan Wilson Guardiola enters his third age as legend",
    "Barney Ronay City claim total victory for football politics",
    "Guardiola plans to end Man City stay in two years when deal expires",
    "Culture wars come to the ballpark as MLB celebrates Pride month",
    "New clay king Djokovic moves into house Nadal built",
    "Mercury to make travel changes after ‘provocateur’ confronts Griner at airport",
    "Roland Garros win sets Swiatek on the path to greatness",
    "Vingegaard wins Criterium du Dauphine as Tour de France looms",
    "Ferrari make triumphant return at centennial race",
    "McGregor knocks out Heat mascot in bizarre promotion",
    "India and Pakistan keep close eye on tropical cyclone",
    "Illegal reintroductions of rare butterflies to UK ‘a risk to other species’",
    "EPA sued over pesticide-coated seeds’ ‘devastating impacts’ on US wildlife",
    "Greta Thunberg takes part in her last school strike for climate",
    "Republican rhetoric after indictment heightens fears of violence",
    "Syracuse incident leaves 13 people either shot, stabbed or hit by cars",
    "Ted Kaczynski died by suicide in prison – report",
    "Interstate 95 collapses after vehicle fire",
    "Travel encounters show how US treats Puerto Ricans as ‘second-class citizens’",
    "Man returns book to library – 81 years after it was taken out",
    "Justices upheld race-conscious voting protections – affirmative action could be next",
    "Connecticut man paralyzed in police ride last year awarded $45m",
    "‘Dr Deep Sea’ emerges into sunlight after 100 days living underwater",
    "Florida sunbathers shocked by ursine ocean-goer",
    "‘Actions akin to mutiny’ The Tories speaking out against Boris Johnson",
    "‘Life moves on’ Gove attempts to consign Boris Johnson to Conservatives’ past",
    "Rishi Sunak goes on offensive in row over former PM's honours list",
    "Exhumation of civil war dead from Valley of Cuelgamuros begins",
    "Police arrest British man free-climbing skyscraper",
    "Major powers' arsenals increasing, says thinktank",
    "Top US tech investor to open office in UK citing crypto-friendly approach",
    "Mother told children to leave her so they could survive",
    "Philippines’ most active volcano spews lava prompting evacuation of thousands",
    "American musician arrested in Moscow bewildered at drugs charges",
    "Crowds in Annecy honour those who risked their lives to tackle attacker",
    "What’s behind the rise in dog attacks?",
    "Listen to previous episodes",
    "Do we need to dismantle the literary canon?",
    "Synth-pop icon Johnny Jewel on David Lynch, Chromatics and near-death experiences",
    "‘The more you give it, the more it’s gonna give back’: Bethesda’s Starfield explored",
    "20th birthday brings double Metallica, occult glam and a new breed",
    "Music, books, stage and more to keep you cool in a heatwave",
    "First headline show in two decades is three hours of total joy",
    "Max Mara’s Scandi show signals shift in fashion zeitgiest",
    "What your grip says about your health – and how you can improve it",
    "Blossom the sheep was struggling to give birth – and the vet wanted my help",
    "Can duo-toned lipstick lift me out of my makeup rut?",
    "‘I don’t know how people don’t have rice cookers … it should be illegal’",
    "More than one in 10 women struggle to bond with their baby, survey shows",
    "Apple’s best consumer laptop, just bigger",
    "Is a little bit of indulgence the secret to success?",
    "Faecal transplants could play a huge role in future medicine",
    "US and China take steps towards thaw as Blinken prepares to visit Beijing, but mistrust remains",
    "Haemophilia patients struggle to access care in Nigeria",
    "Can learning about storytelling make better doctors?",
    "A Colombian tomato fight and an LA kiss",
    "Marilyn Monroe unravels in the desert",
    "Fashion fixes for the week ahead",
    "The photography of Alain Le Garsmeur",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "South Africa may seek way out of hosting Brics summit over Putin arrest",
    "Colombian plane crash: mother told children to leave her so they could survive",
    "Silvio Berlusconi, scandal-ridden former Italian prime minister, dies aged 86",
    "Ben Affleck and Matt Damon condemn use of audio from Air in Trump campaign video",
    "Kim Jong-un ‘holds hands’ with Vladimir Putin as Russia-North Korea ties deepen",
    "Novak Djokovic’s 23rd grand slam is a record – but please don’t call him the GOAT",
    "Young Montana residents bring climate change case to court for first time ever"
]