[
    "The Guardian - Back to home",
    "Trump Ex-president claims 'political persecution'",
    "Analysis No cameras denied public sight of Trump at bay",
    "Fox News Network labels Biden a ‘wannabe dictator’",
    "Anti-Trump Republicans rally against ex-US president as Mike Pence says charges are ‘very serious’",
    "Hollywood producer and chewing gum heir explore takeover of notorious spyware firm assets",
    "Russia Missile attack on Odesa kills three people working in warehouse",
    "G7  Ukraine urges clampdown after western parts found in Russian missiles",
    "Russia-Ukraine war: Kyiv reports advances in ‘extremely fierce’ counteroffensive fighting",
    "Pyrex and Instant Pot maker files for bankruptcy protection in US",
    "Pride decorations removed because of new policy, workers say",
    "EU moves closer to passing one of world’s first laws governing AI",
    "EU regulator orders company to sell part of ad-tech business",
    "Social media influencer served legal papers after allegations of rape and sexual assault",
    "Weapons supervisor was probably hungover, prosecutors say",
    "Energy company drops target to cut oil production as CEO guns for higher profits",
    "Last portrait by Austrian artist expected to fetch $82m at London auction",
    "Empty seats at US graduations reveal toll of gun violence",
    "How Russia’s wealthy profited from exit of western brands",
    "A silent and sullen Trump goes before judge – amid din outside",
    "Massive strike pits African fishers against ‘superprofitable’ EU firms",
    "The inside story of Merseybeat, the UK’s early pop explosion",
    "Ignoring Robert F Kennedy Jr is not an option",
    "Masterpieces and oddities McCarthy’s bleak, bold and batty films",
    "Obituary Acclaimed author who told grim, violent tales of stripped back life",
    "Martin Pengelly Cormac McCarthy showed us America’s violent heart",
    "‘His work will sing down the centuries’",
    "The sound ecologist capturing a disappearing world",
    "Kevin McCarthy says documents are safer in bathrooms than garages. Is he right?",
    "Why men are now shaving – and women are doing whatever they like",
    "So much of David Attenborough’s new show is just astonishing",
    "Ukraine’s failed Mala Tokmachka assault lays bare counteroffensive challenges",
    "Ukraine will not be offered timeline for membership at summit in July",
    "What we know on day 476 of the invasion",
    "Ukraine war drove biggest rise in displaced persons in decades",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Donald Trump’s arrest is ugly but it’s also democracy in action",
    "Therapy is great. But have some Americans had too much?",
    "The US debt-ceiling ‘deal’ was a giant exercise in bipartisan class warfare",
    "Boris Johnson is gone, but his toxic Brexit myths will go on poisoning UK politics",
    "We write the TV, radio and theatre shows you love. Do you want robots and AI doing that job?",
    "Cormac McCarthy showed us America’s violent heart",
    "Miami move brings joy but potential pitfalls",
    "Vegas wanted the NHL. And now the city has the Stanley Cup",
    "At 91, Don King still longs for the spotlight. But it is shining elsewhere",
    "PGA's Monahan ‘recuperating from medical situation’ after Saudi merger",
    "Fans stage ‘reverse boycott’ at plans to move team to Vegas",
    "Regis Prograis readies for New Orleans title defense",
    "The players Postecoglou should sign this summer",
    "Real Madrid complete signing of Bellingham from Dortmund",
    "Asthma sufferer, 15, testifies in landmark US climate trial",
    "EU’s biodiversity law under threat from centre-right MEPs",
    "Not phasing out fossil fuels is ‘death sentence’ for world’s poor, says activist",
    "Young residents bring climate change case to court for first time ever",
    "US judge blocks takeover of video game maker by Microsoft until further hearings",
    "Pod of 30 orcas bring killer moves to a California bay",
    "Writer can sue Trump for $10m in new defamation case, judge rules",
    "Councilman faces criminal charges including embezzlement",
    "Interest to resume in September and payments in October",
    "‘Hidden’ Malibu beach will open to public for first time in 40 years",
    "Ex-NFL star says ‘100% a miracle’ he saved son and niece from drowning",
    "White House pushes for renewal of electronic surveillance law provision",
    "Nine injured in shooting after Nuggets win NBA title",
    "Salt Bae Burger, once dubbed city’s worst restaurant, closes",
    "‘A brilliant young man’ Nottingham victim Barnaby Webber’s family pay tribute",
    "Nottingham Third victim of attacks named as Ian Coates",
    "UK attack: Grace O’Malley-Kumar’s family pay tribute to ‘truly wonderful and beautiful young lady’",
    "Rare video of platypuses fighting captured by Tasmanian farmer",
    "Report saying Boris Johnson misled UK parliament over lockdown breaches signed off",
    "Peak in global demand ‘in sight before end of decade’",
    "Coalition staves off implosion with 11th-hour heating law amendment",
    "Two soldiers killed as fellow recruit opens fire",
    "Prosecutors say ‘hijackers’ on cargo ship were actually asylum seekers",
    "At least 59 drown as refugee boat sinks",
    "US House unanimously calls on Russia to release journalist",
    "Marriages drop to record low despite government push",
    "How Saudi Arabia took over professional golf",
    "Listen to previous episodes",
    "Not even Juliette Binoche can save this stinker",
    "John Romita Sr: the Spider-Man artist was a titan of the comic-book world",
    "John Romita Sr Spider-Man artist and co-creator of Wolverine, dies at 93",
    "F1 23 review – a return to racing form",
    "Disney pushes back sequels, with fifth film now due in 2031",
    "The missile alert promised sudden death. That awful hour taught me how to live",
    "Is this the best way to de-stress in the office?",
    "10 ways to be much more confident at work",
    "How much salt is too much salt?",
    "The Mont-Blanc Express from Switzerland to France",
    "I can only climax in one position. Why do my lovers try to talk me out of it?",
    "From what my daughter says, 90% of her year do it",
    "Human trafficking surges in cyclone-hit east India",
    "Māori ancestral remains and mummified heads returned from Germany",
    "Anguish as rape survivors unable to access vital medication",
    "Covid inquiry opens with flowchart on UK’s pandemic planning",
    "A beautifully humane documentary about a dying man’s last days",
    "Christopher Makos’s best photograph",
    "Magical images of childhood",
    "Colombia’s Tomato Fight festival",
    "The best of Photo Basel 2023",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Starbucks Pride decorations removed because of new policy, US workers say",
    "Empty seats at US graduations reveal toll of gun violence: ‘We’re losing our kids’",
    "Fox News labels Joe Biden a ‘wannabe dictator’ during Trump speech",
    "Russia-Ukraine war live: Kyiv reports advances in ‘extremely fierce’ counteroffensive fighting"
]