[
    "The Guardian - Back to home",
    "Live Zelenskiy says Bakhmut ‘is not occupied’",
    "G7 Ukraine secures fresh aid as Russia hails Bakhmut ‘liberation’",
    "UK PM Ceasefire not enough without ‘durable’ peace",
    "Zelenskiy denies Russian claims to have taken Bakhmut",
    "Democrats fight to expand a ‘broken and illegitimate’ supreme court",
    "Fresh bans show Republicans trying to soften message",
    "Canadian cyclist recovering after collision with bear",
    "Police investigate possible poisoning of two Russian exiles",
    "Three people killed and two wounded in nightclub shooting",
    "Far-right minister says country ‘in charge’ on visit to Jerusalem holy site",
    "Rome climate protesters turn Trevi fountain water black",
    "Trans girl denied graduation ceremony after school’s dress-code ruling",
    "Manchester City v Chelsea: Premier League – live",
    "Republican senator Tim Scott’s vision for America",
    "Mark Zuckerberg’s metaverse vision is over. Can Apple save it?",
    "Toxins from gut damage fat cells and drive weight gain, study suggests",
    "Artemis II crew certain of moon mission success",
    "Zelenskiy says Bakhmut ‘not occupied’; Russia accuses G7 of ‘undermining global stability’",
    "Kyiv denies Wagner claim to have captured Bakhmut",
    "Zelenskiy visit sends ‘incredibly powerful message’ to Russia, says Sunak",
    "What we know on day 452 of the invasion",
    "‘I spend a lot of my work shredding people’",
    "How solar farms took over the California desert",
    "I’m consumed by a crush, but we are both married",
    "Martin Amis was Mick Jagger in literary form, I was besotted with his electrifying prose",
    "There’s no reason to say humans have more worth or moral status than animals’",
    "Jonathan Eig on his epic new biography",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Hyperfatigue is the big thing in 2023, but what we really need are 50 words for tired",
    "The west’s tightening of Russian sanctions is a sign of failure",
    "There’s no shame in waging war on old age – long live Martha Stewart",
    "Don’t celebrate the prospect of the Tories in opposition – that’s the real danger zone",
    "Depp comes up smelling of roses despite defamation trial’s catalogue of misogyny",
    "How philistine of David Starkey to limit western civilisation to whiteness",
    "When the tech boys start asking for new regulations, you know something’s up",
    "It’s easy to see white supremacy as the thinking of extremists. We know that’s not true",
    "Photo essay How City overtook Arsenal to win third straight title",
    "Player ratings Who shone the brightest for City this season?",
    "West Ham 3-1 Leeds Allardyce's side on brink after fightback win",
    "Manchester City v Chelsea – Premier League",
    "Nuggets on brink of first ever finals after Murray mauls Lakers again",
    "Boxing Taylor suffers first loss as Cameron defends titles",
    "Lomachenko loses controversial decision to Haney",
    "Ten title-race turning points How Man City overtook Arsenal",
    "Manchester City win their fifth title in six seasons",
    "Andy Murray withdraws in order to focus on Wimbledon",
    "Baffert’s National Treasure wins as another death mars day",
    "McIlroy remains in contention behind leader Koepka",
    "An immovable fixture in American life with a complex legacy",
    "Scientists look to clean up Antarctica",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Magazine journalist is Hollywood’s hot new thing",
    "How Katharine Hepburn was haunted by fear of audiences",
    "The rock’n’roll novel is back – from a female perspective",
    "An important challenge to western architectural tradition",
    "‘I’m always nervous about the word identity. I try not to use it’",
    "Could the show’s dysfunctional election fantasy become reality?",
    "Countercultural poet, singer and Cream lyricist dies aged 82",
    "Generic remake of the hit 90s comedy",
    "Harrison Ford, Phoebe Waller-Bridge and ‘peak noire’ on the Croisette",
    "‘Did I fall in with the wrong people? No, I was the wrong people’",
    "Stories from 75 years of Britain’s Caribbean food shops",
    "Why restaurant desserts are disappearing",
    "Should I worry about eating too many takeouts?",
    "Chelsea flower show embraces trend for grow-your-own veg",
    "Mother of girl who died in US border patrol custody says agents ignored her",
    "Truck driver in crash that killed seven arrested on suspicion of drunk driving",
    "Viral story of migrants displacing unhoused veterans from hotels turns out to be false",
    "Christian university fires two staff for including pronouns in emails – reports",
    "Boy who saved sister by hitting would-be kidnapper with slingshot speaks: ‘I had to’",
    "Family of teen shooter who killed three says he struggled with mental illness",
    "Vigilante fears as Republicans push for special unit to detain migrants",
    "Bureau broke own rules in January 6 and BLM intelligence search, court finds",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Legislature passes 12-week abortion ban after bitter struggle",
    "Italy begins cleanup after catastrophic floods",
    "Teacher aims to break Rockall record",
    "At least 12 people dead after crowd crush at football stadium",
    "Japan and South Korea leaders mend fences in visit to memorial",
    "Police accused of farcical error after 14 arrested at seminar on day of coronation",
    "Road safety groups hit out at Suella Braverman over speeding incident",
    "Boris Becker’s daughter wins German equivalent of Strictly Come Dancing",
    "Nursery hit with record fine after mouse droppings found",
    "As Greece goes to the polls, scandal, disaster and apathy eat into PM’s lead",
    "Social media firm to be fined £648m for mishandling user information",
    "China crackdown on business has Maoist roots",
    "A US debt default could crush small businesses. So what can we do?",
    "Could prefab be the future of Australian homes?",
    "The inside story of a €1.6m wine heist",
    "The woozy, not-dreadful experience of being a life model",
    "Bats could be key to fighting next pandemic",
    "Rocket festival and a beach protest",
    "Art that celebrates bathing",
    "Martin Amis's life in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "How solar farms took over the California desert: ‘An oasis has become a dead sea’",
    "‘The exact opposite of Donald Trump’: Republican senator Tim Scott’s vision for America",
    "‘Oh my God, what will they think?’ How Katharine Hepburn was haunted by fear of audiences",
    "New York Christian university fires two staff for including pronouns in emails – reports",
    "West Ham 3-1 Leeds: Premier League – as it happened",
    "Fresh US abortion bans show Republicans trying to soften message"
]