[
    "The Guardian - Back to home",
    "Russia’s most potent hypersonic weapon neutralized, says Kyiv",
    "Shooter roamed area with at least three guns, police say",
    "Roger Ailes’s widow says Murdochs have ‘wreaked havoc’ on network",
    "Silicon Valley Bank Former CEO tells Senate he is ‘truly sorry’",
    "Silicon Valley Bank’s former CEO criticised for lack of chief risk officer before collapse",
    "OpenAI chief calls for laws to mitigate ‘risks of increasingly powerful’ AI",
    "High-school student suspended for recording teacher using racial slur",
    "Pollution could be slashed by 80% by 2040, UN says",
    "Cannes jury president Ruben Östlund opens ‘wild’ festival",
    "Pompeii dig finds skeletal remains dating back to Vesuvius earthquake",
    "Potential antidote found for toxin in world’s most poisonous mushroom",
    "How its warehouses upended a sleepy New York neighborhood",
    "Innocent foreigners caught in El Salvador’s mass arrests",
    "EPA finally wakes up with stiff new climate rules",
    "As mask mandates end, Japan turns to tutors to relearn how to smile",
    "Ukraine claims to have retaken 20 square km of land around Bakhmut",
    "Von der Leyen steps up calls for tribunal for Russia’s ‘crime of aggression’",
    "Head of top Ukraine court held in anti-corruption investigation",
    "Zelenskiy’s Europe tour was a success, but west’s latest gifts may not be enough",
    "The fascinating true story of Anna Nicole Smith",
    "Why Siobhan Roy is Succession’s greatest character",
    "How a sleek typeface became a neighborhood omen",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "Poles divided over John Paul II abuse cover-up claims",
    "Will Tom Hanks be making films long after he’s dead?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Vice is going bankrupt, BuzzFeed News is dead. What does it mean?",
    "No one has accepted real responsibility for the East Palestine disaster",
    "Republicans aren’t fixing the migrant border plight. In fact they’re making it worse",
    "The EU should start planning now for Russia after Putin",
    "Bird flu could become the next human pandemic – and politicians aren’t paying attention",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Ja Morant, masculinity and the way of the gun",
    "Judge denies looking for signal before hitting home run against Jays",
    "76ers reportedly fire Rivers after latest playoff exit",
    "Djokovic accuses Norrie of unsporting behavior after flashpoint",
    "Arsenal striker opts to play for US instead of England",
    "Klopp urges surging Liverpool to keep heat on top four",
    "Former UFC champion signs with PFL after contentious split",
    "The travails of Arsenal, Southampton and Pickford",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Erdoğan survives, but will Turkish democracy?",
    "Listen to previous episodes",
    "The secret of Liam Neeson’s success: a monomaniacal fixation on … tea?",
    "AI songwriting is not a sin, says Neil Tennant",
    "Revisiting the era of the It Girl",
    "The pain and power of Iraqi music",
    "Joely Richardson is scarily fierce in tense thriller",
    "Turbocharge philanthropy, conga to Beethoven, ditch the ukeleles",
    "Succession star recalls his father’s life-saving act: ‘He broke all the bones in both his legs’",
    "Book has many film adaptations but only one gave Jo the ending she deserves",
    "FTX founder ‘let me see everything’ for new book, says Michael Lewis",
    "The Glasgow library that collects explosive protest art",
    "Gucci show reaffirms Seoul’s status as capital of pop culture",
    "Recipe for apricots with French toast and pistachio mascarpone",
    "How Jennifer Hosten became the first Black Miss World – and an international diplomat",
    "Go small, don’t get them wet, and fry with tomatoes and spices",
    "What can I do with bitter green peppers?",
    "My wife said her ex was a better lover than me – and we haven’t had sex since",
    "Progressive organization Justice Democrats adopts four-day work week",
    "Video shows Walgreens guard killing trans organizer Banko Brown as he left store",
    "US driver pulled over for speeding tried to switch places with dog, police say",
    "Republican who expanded voting faces primary threat from right",
    "FBI accused of failures but key report finds no deep-state plot against Trump",
    "Punishing heatwave grips region as wildfires rage in western Canada",
    "TV personality, 81, becomes oldest Sports Illustrated swimsuit cover model",
    "Trump ally sued by former associate alleging sexual assault and harassment",
    "Suspect named in baseball bat attack at Democratic congressman’s office",
    "Groundbreaking Chicana California leader dies at 74",
    "Economic crisis expected to deepen after Erdoğan tops poll",
    "Airstrikes hit Khartoum as fighting between Sudanese factions intensifies",
    "Brigitte Macron relative beaten up at family’s chocolate shop",
    "Imran Khan granted bail in more cases relating to corruption charges",
    "Dry weather and shifting winds threaten to spread Alberta wildfires",
    "Royal begins second legal case against UK Home Office over his security",
    "US Speaker at conservatism event echoes far right in attack on ‘globalists’",
    "UK watchdog denies it blocked Microsoft deal on orders of US regulator",
    "Five men found guilty over €113m Dresden jewellery heist",
    "Oxford University cuts ties with Sackler family over links with opioids",
    "Thailand election: will Move Forward be able to claim power?",
    "Could handbags be the haute couture solution to the Everglades python problem?",
    "Young people: is AI affecting your career choices?",
    "Why one-third of US college students don’t have enough to eat",
    "What is it, and what will happen if it's not raised?",
    "German cattle and a cooking world record",
    "Female photographers from the Islamic world",
    "The unique landscape of Lake Erie",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Missouri high-schooler suspended for recording teacher using racial slur",
    "Plastic pollution could be slashed by 80% by 2040, UN says",
    "New Mexico shooter roamed area with at least three guns, police say",
    "Cameron Norrie smashes ball into Novak Djokovic's legs as world No 1 turns back on net – video",
    "Russia’s most potent hypersonic weapon neutralised, says Ukraine",
    "‘They found hell’: innocent foreigners caught in El Salvador’s mass arrests",
    "Russia-Ukraine war live: Ukraine claims to have retaken 20 square km of land around Bakhmut"
]