[
    "The Guardian - Back to home",
    "At a glance What we know on day 451 of the invasion",
    "Barack Obama Ex-president among 500 banned from Russia in retaliation for US sanctions",
    "G7 summit Ukraine’s Zelenskiy arrives in Japan as he bids to boost western support for Kyiv",
    "Russia-Ukraine war: Zelenskiy arrives in Japan for G7 talks; Kyiv repels ‘massive’ drone attack",
    "Vigilante fears as Republicans push for special unit to detain migrants",
    "Scientists look to clean up Antarctica",
    "Fears looted Nazi art still hanging in Belgian and British galleries",
    "Silvio Berlusconi released from Milan hospital after six weeks",
    "Talks briefly resume as US default deadline creeps closer",
    "Ex-chief of Indigenous agency charged over murders of pair",
    "Brittney Griner shines in emotional WNBA return",
    "Bureau broke own rules in January 6 and BLM intelligence search, court finds",
    "Legislature passes 12-week abortion ban after bitter struggle",
    "At Bilderberg’s bigwig bash two things are guaranteed: Kissinger and secrecy",
    "Horses restaurant draws a crowd despite allegations against chefs",
    "London mayor says he has PTSD caused by death threats",
    "Elections in UK and US at risk from AI-driven disinformation, say experts",
    "US to back fighter jet training for pilots, official says",
    "Catch up with the must-read news and analysis",
    "Arrest order for British ICC prosecutor issued after Putin warrant",
    "Foreign minister steps up threat to block EU weapons aid for Ukraine",
    "Chris Cillizza on presidents at play",
    "'She sets a timer for sex and my job is just to enjoy what she’s doing to me’",
    "What my privileged start in life taught me about the British class system",
    "‘As a child, seeing a black Ariel would have changed my life’",
    "The inside story of a €1.6m wine heist",
    "The woozy, not-dreadful experience of being a life model",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Depp comes up smelling of roses despite defamation trial’s catalogue of misogyny",
    "It’s easy to see white supremacy as the thinking of extremists. We know that’s not true",
    "Artificial intelligence holds huge promise – and peril. Let’s choose the right path",
    "Vice and BuzzFeed were meant to be the future of news. What happened?",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "$209bn a year is what fossil fuel firms owe in climate reparations. We want that paid",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "Andy Rourke was the other melodic genius in the Smiths: spry, funky and masterful",
    "Griner shines in emotional WNBA return",
    "Liverpool Firmino admits tears will flow at Anfield farewell",
    "Tottenham v Brentford – Premier League updates",
    "Celtics fall apart late as Heat take 2-0 lead in East finals",
    "Simply the best? City have hit greatness without friction",
    "Guardian readers on Manchester City",
    "Rose blooms while Scheffler, Conners and Hovland share lead",
    "All-time NFL great running back and social activist dies aged 87",
    "Rybakina beats Ostapenko to reach Italian Open final",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "The new marine sanctuary for the super-rich LA coast",
    "From Depp to Godard, the chaotic circus rolls on",
    "Natasha Lyonne’s perfect detective show turns up the fun-o-meter until it explodes",
    "A spangled supernova of joy",
    "Free speech comedy clubs and the battle over onstage offence",
    "Rebecca F Kuang: ‘Who has the right to tell a story? It’s the wrong question to ask’",
    "Fluffy sex comedy with a dark underbelly",
    "Harrison Ford reduced to tears in Cannes over Indiana Jones’s return",
    "Cate Blanchett’s boozy nun indulges possible second coming in woozy wartime saga",
    "Cocaine Bear and the best ‘so bad they’re good’ films",
    "Jonathan Glazer adapts Martin Amis’s chilling Holocaust drama",
    "Orange and feta, tofu and shiitake: Yotam Ottolenghi’s ways with lettuce",
    "‘I banged my head on the table I was laughing so hard’",
    "The continuing rise of the waistcoat",
    "The hell of teenage shopping with your mum",
    "35 of the best restaurants",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Parents of trans children seek to block state ban on gender-affirming care",
    "Florida governor says only he can beat Biden in 2024 presidential election",
    "All-time NFL great and social activist dies aged 87",
    "Jordan Neely was ‘screaming for help’, Al Sharpton says in funeral eulogy",
    "Prosecutor signals charges in 2020 election inquiry may come end of July",
    "Hyundai and Kia settle lawsuit worth $200m over vehicle theft due to TikTok",
    "Fox News’s ‘vitriolic lies’ threaten democracy, says disinformation expert suing channel",
    "‘Taylor Swift bill’ aims to make ticket prices transparent",
    "Groom remembers bride killed in wedding night crash as ‘amazing human’",
    "Country's elite backed death squads, former paramilitary commander says",
    "Life in New Zealand’s boarding houses",
    "Primrose Hill to close gates at night after row that divided locals",
    "Couple get payout after water buffaloes fall into Essex swimming pool",
    "Drug for hot flushes will transform treatment, doctors say",
    "Imran Khan alleges ‘reign of terror’ as supporters face trial in military courts",
    "How leaving EU came back to bite UK Conservatives",
    "Villages evacuated as ‘very large’ wildfire ravages south-west",
    "Toddlers’ gut bacteria may predict future obesity, study suggests",
    "Court acquits tycoon in retrial over 2018 killing of journalist and fiancee",
    "How leaving EU came back to bite Tories",
    "Naloxone has been hailed as life-saving. Why isn’t it given to those who need it?",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "Montana TikTok users denounce ban",
    "Ukrainian punks Death Pill take fury on tour",
    "The spellbinding singer on anger, empathy and trans rights",
    "‘I liked how her expressiveness matches her bold hair’",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "‘Trump’s not a good sport’: Chris Cillizza on presidents at play",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "LA’s Horses restaurant draws a crowd despite allegations against chefs",
    "Hungary steps up threat to block EU weapons aid for Ukraine",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast",
    "LA Pride pulls out of Dodgers’ Pride Night after drag nun group is disinvited",
    "Blind date: ‘I banged my head on the table I was laughing so hard’"
]