[
    "The Guardian - Back to home",
    "Dom Phillips and Bruno Pereira  Last images found on recovered phone",
    "Alessandra Sampaio My husband was killed for exposing the Amazon’s plunder. But his work lives on",
    "Lula Dom Phillips and Bruno Pereira will not be forgotten, vows president",
    "Amazon at risk of being taken over by mafia, ex-police chief warns",
    "A year later their Indigenous allies risk death to carry on the work",
    "One year after their deaths, Bruno and Dom's work must go on",
    "Remembering Bruno Pereira and Dom Phillips – video",
    "Fears extreme heat and strong winds could worsen Nova Scotia fires",
    "Trump Ex-president regretted not declassifying retained military document in recording",
    "Distrust inside Trump legal team led to top lawyer’s departure",
    "Plastic containers still distributed across the US are a potential health disaster",
    "Upstate village’s cherished swan stolen and eaten by three teens",
    "US debt ceiling bill heads for Senate as both House sides claim victory over vote",
    "Conspiracy theorist and Democrat says he has ‘conversations with dead people’",
    "Researchers make world-first breakthrough",
    "Aide who alleged sexual harassment details payments to staffer",
    "Facebook founder completes extreme fitness challenge in 44lb vest",
    "How disinfecting an old US mineshaft saved a colony of little brown bats",
    "Apostle of bipartisanship: why US debt ceiling deal was a victory for Joe Biden",
    "Michigan’s top attorney on how he won justice for George Floyd’s family",
    "How Illinois changed the law to provide halal and kosher meals to schoolchildren",
    "Our writers pick their favourite Stephen King movies",
    "Thirteen secret signals all cat owners need to know – from a quivering tail to aeroplane ears",
    "How 2023’s most wildly entertaining TV is all about female private eyes",
    "Everyone thought we were dating. It’s rare for two men to be so close",
    "The backlash: how slavery research came under fire",
    "‘A woman urinated in a stairwell adjacent to where we were sitting’",
    "My partner is kind, affectionate and emotionally open. I want to break up with him",
    "To the class of 2023, I say three words: you poor bastards",
    "Three die in early morning attack by Russia",
    "President pleads for ‘security guarantees’ for Ukraine and Moldova",
    "US announces $300m arms package for Ukraine – with a caveat",
    "What we know on day 463 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Republicans love to make up fake crises. Here are five of the biggest",
    "Elizabeth Holmes’ big con deserved prison time – so why do I feel sorry for her?",
    "Gay and trans people deserve to live without persecution in the US. Why is that so hard?",
    "The debt ceiling fight was never about debt. It was about Republican power",
    "US and China are on a collision course that could risk conflict",
    "Acting, sexiness and late babies: why Pacino v De Niro is the daddy of all rivalries",
    "Mourinho fights the bad fight and ends up losing",
    "José Mourinho Roma manager swears at referee Taylor in car park",
    "Football Weekly Extra Seventh heaven in final for Sevilla",
    "Roma Mourinho angry with decisions and unclear on future",
    "Nuggets or Heat? Our writers share their picks",
    "French Open day five: Day shocks Keys, Ruud and Sinner in action",
    "Critics say ‘absolutely no change’ despite scandals",
    "Galtier confirms Messi will leave and defends Argentinian’s time at club",
    "Raducanu splits from coach amid injury layoff",
    "Djokovic defiant over political message",
    "Drive To Survive commentator fired over ‘inappropriate behavior’",
    "Here’s proof fishing bans leave plenty to eat, says study of Mexico marine park",
    "The farmers dealing with shortages even before historic Colorado River deal",
    "Foggy future for Arctic shipping as sea ice melts",
    "Climate change to blame for up to 17 deaths, experts say",
    "US debt ceiling explained Key takeaways from the vote",
    "US House passes bill just days before default",
    "JP Morgan CEO claims he had never heard of Jeffrey Epstein before arrest",
    "Trump accuser writes romance novel with ex-president’s niece",
    "Air force general convicted of abusive sexual contact losing ranking on retiring",
    "Failed Republican candidate charged with shootings at lawmakers’ homes",
    "Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Senator said ‘I don’t want reality’ in hearing on race and education",
    "Special counsel reportedly examining firing of cybersecurity official",
    "Actor will not face sexual assault charges in Los Angeles case",
    "Gas station owner charged with murder after teen killed",
    "Australian loses defamation case with judge finding ex-SAS soldier committed war crimes",
    "Decision will be known as ‘historic economic error’, says former US treasury secretary",
    "Nepali sherpa saves climber in rare ‘death zone’ rescue",
    "Truck driver held after spilled potatoes cause chaos on bridge",
    "Government outlaws criticism of administration before August elections",
    "Country is the world’s ‘most neglected crisis’ as focus remains on Ukraine",
    "Canadian socialite Jasmine Hartin fined over killing of police officer",
    "Non-EU workers outnumber EU ones in various UK sectors in post-Brexit shift",
    "Items found in search related to missing child not confirmed as evidence, say officials",
    "Man accused of starting hostel fire faces five murder charges",
    "Sofas, smiles – and scandal: what’s going on at ITV’s This Morning?",
    "Listen to previous episodes",
    "Elizabeth Taylor’s 20 best performances",
    "Recordings lost in New York Public Library will finally be heard",
    "‘I hated the way major labels made my music sound’",
    "Samantha Jones was the show’s best character. Here are 10 of her finest moments",
    "A raw, unapologetic act of mourning",
    "Embattled singer vows ‘I will not be cancelled’",
    "Stolen cupcakes, strange space things and a sudden holiday",
    "I’ve come to love Chișinău: my home city in Moldova deserves the spotlight",
    "Four ways to find love – without the apps",
    "‘She made me see working mothers from a different perspective’",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "How a Mexican state siphoned off millions – and a reporter risked her life to expose it",
    "The murders and war crimes at the heart of a seismic defamation battle",
    "What US job will shrink the most in the next decade?",
    "The side hustle that keeps a literary author’s career afloat",
    "Woman jailed in Tehran calls for environmentalists’ release",
    "Dollar General safety violations alarm workers",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘To the class of 2023, I say three words: you poor bastards’: the year’s best graduation speeches",
    "Republican senator says ‘I don’t want reality’ in hearing on race and education",
    "Socialite Jasmine Hartin fined after killing Belize police officer",
    "Months of distrust inside Trump legal team led to top lawyer’s departure",
    "Badly behaved theatregoers: ‘A woman urinated in a stairwell adjacent to where we were sitting’"
]