[
    "The Guardian - Back to home",
    "Barr Trump may be ‘toast’ after ‘very damning’ indictment",
    "‘I’ll never leave’ Trump vows to stay in race even if convicted",
    "Trump Campaign attacking Biden’s mental health ramps up",
    "Fears that Republicans’ rhetoric after indictment could spark violence",
    "Major powers' arsenals increasing, says thinktank",
    "How the drought is bringing a lost US canyon back to life",
    "Philippines’ most active volcano spews lava prompting evacuation of thousands",
    "Florida sunbathers shocked by ursine ocean-goer",
    "Senior Tories tell ex-PM and allies to ‘shut up and go away’",
    "Mother told children to leave her so they could survive",
    "Poor air quality returns to US north-east",
    "Ted Kaczynski died by suicide in prison – report",
    "Connecticut man paralyzed in police ride last year awarded $45m",
    "Interstate 95 collapses after vehicle fire",
    "Novak Djokovic reaches record 23 grand slam titles after final win",
    "Travel encounters show how US treats Puerto Ricans as ‘second-class citizens’",
    "DeSantis bids to outflank Trump on the right",
    "US schools face violent Pride backlash",
    "First headline show in two decades is three hours of total joy",
    "Faecal transplants could play a huge role in future medicine",
    "Analysis China’s Palestinian moment is about global standing rather than peace",
    "US and China take steps towards thaw as Blinken prepares to visit Beijing, but mistrust remains",
    "TikTok users are calling berberine ‘nature’s Ozempic’ – but is it a fad?",
    "Tony awards 2023: full list of winners",
    "‘We’re all being conned by the wellness industry’",
    "The US schools serving local veggies and edible flowers over frozen food",
    "Would you dare meet your doppelgänger?",
    "Nova Kakhovka The disastrous bursting of Ukraine’s dam – and the battle that is to come",
    "UN concerned by ‘discrepancy’ in Ukraine nuclear plant water levels after dam collapse",
    "Leaders claim to have liberated two villages in Donetsk",
    "What we know on day 474 of the Russian invasion",
    "‘War criminals: whatever you do, we’ll record it' The ‘merciless’ Ukrainian film about Mariupol",
    "Radio New Zealand employee put on leave amid investigation of Ukraine stories",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "What lies behind Russia’s acts of extreme violence? Freudian analysis offers an answer",
    "A tale of two cities: Paris proves that you don’t need skyscrapers to thrive",
    "Farewell, Boris Johnson: Britain will not miss your attempts to play Trump",
    "The Guardian view on Boris Johnson’s resignation: good riddance",
    "Boris Johnson’s legacy? He has ruined Britain’s place in the world",
    "The pill’s effects on women can be devastating. We need better information, now",
    "The Guardian view on the Arctic: threatened by Putin’s war",
    "Djokovic moves into house that Nadal built with 23rd grand slam",
    "French Open Djokovic reaches record 23 grand slam titles",
    "Reaction Djokovic insists ‘journey is not over’ after breaking record",
    "Tumaini Carayol Swiatek on the path to greatness with third win",
    "Man City’s Champions League ascent is a total victory for politics in soccer",
    "Roland Garros win sets Swiatek on the path to greatness",
    "López batters Taylor for junior welterweight title in shocker",
    "McGregor knocks out Heat mascot in bizarre promotion",
    "McIlroy chance to leave politics behind and end major drought",
    "Stephenson’s double lifts Vegas to Game 4 win and brink of title",
    "WNBA says player confronted by ‘provocateur’ at Dallas airport",
    "EPA sued over pesticide-coated seeds’ ‘devastating impacts’ on US wildlife",
    "Greta Thunberg takes part in her last school strike for climate",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Syracuse incident leaves 13 people either shot, stabbed or hit by cars",
    "Man returns book to library – 81 years after it was taken out",
    "‘Dr Deep Sea’ emerges into sunlight after 100 days living underwater",
    "Justices upheld race-conscious voting protections – affirmative action could be next",
    "Catholic ‘Pride mass’ canceled after protests",
    "Financier hands control of multibillion-dollar foundation to son",
    "Shooting leaves nine wounded after ‘targeted’ incident",
    "Reversal of social media guardrails could prove disastrous for 2024 elections",
    "Anger and anxiety as Florida governor's asylum-seeker flights return to US skies",
    "What’s happening with US loan relief and the payment pause?",
    "Children reunited with family after 40 days in jungle",
    "American musician arrested in Moscow bewildered at drugs charges",
    "Analysis Annecy footage put social media’s self-regulation to the test",
    "Crowds in Annecy honour those who risked their lives to tackle attacker",
    "Nicola Sturgeon Former SNP leader arrested in inquiry",
    "Nicola Sturgeon released without charge pending further investigation",
    "British girl, 11, shot dead in family’s garden in western France",
    "Kim Jong-un ‘holds hands’ with Vladimir Putin as ties with Russia deepen",
    "Sturgeon’s arrest draws focus away from SNP policy and back to police inquiry",
    "Pretoria may seek way out of hosting Brics summit over Putin arrest",
    "China has used country as spy base for years, US official says",
    "Furious Tories turn against former British PM after ‘bias’ outburst",
    "What’s behind the rise in dog attacks?",
    "Listen to previous episodes",
    "Harvey Weinstein tried to bully me, reveals Joseph Fiennes",
    "Spielberg’s sleek blockbuster remains a grave warning",
    "How the US supreme court keeps sunlight out",
    "Spectacular voyage through post-apocalyptic pop",
    "James Comey: ‘I’d like to take readers inside the White House’",
    "‘I don’t know how people don’t have rice cookers … it should be illegal’",
    "My sister made a racist joke. Now we have a family rift",
    "Why tennis fashion owes it all the Suzanne Lenglen",
    "Why Portuguese wines are such good value",
    "You can’t beat cargo when it comes to utility and style",
    "The people who sell images of their unlikely body parts online",
    "Mel B: ‘I’ve still got PTSD. Abuse never really leaves you’",
    "Can learning about storytelling make better doctors?",
    "Plan to return cheetahs to India under fire after six die within months",
    "How Russian is gaining ground in Poland’s capital",
    "How Boris Johnson's party turned on him – and how it could break them",
    "What’s behind John Roberts’s surprise supreme court voting rights ruling?",
    "Exiled Russians dare to dream of Putin’s fall",
    "Microfarms push back against ‘food apartheid’",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Marilyn Monroe unravels in the desert",
    "Fashion fixes for the week ahead",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US musician arrested in Moscow bewildered at drugs charges",
    "Colombian plane crash: mother told children to leave her so they could survive",
    "Fears that Republicans’ rhetoric after Trump indictment could spark violence",
    "Twice in a lifetime: would you dare meet your doppelgänger?",
    "Catholic ‘Pride mass’ in Pennsylvania canceled after protests",
    "‘A portion of paradise’: how the drought is bringing a lost US canyon back to life",
    "Rosamund Pike: ‘We’re all being conned by the wellness industry’",
    "Russia-Ukraine war at a glance: what we know on day 474 of the invasion",
    "Joni Mitchell review – first headline show in two decades is three hours of total joy"
]