[
    "The Guardian - Back to home",
    "Church has $100bn ‘clandestine hedge fund’, says whistleblower",
    "Ron DeSantis signs laws to ease 2024 run",
    "Donald Trump refuses to say whether a six-week abortion ban goes too far",
    "Ukraine strikes Russian forces before expected counteroffensive",
    "Election goes to runoff after Erdoğan takes first-round lead",
    "US professor breaks record for longest time living underwater",
    "‘Godfather of Poker’ dies aged 89",
    "US supreme court pursuing rightwing agenda via ‘shadow docket’, book says",
    "Beijing jails US citizen for life on espionage charges",
    "Mystery tremors on Baltic island puzzle scientists",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "Why Trump’s ‘vile’ attacks against Carroll after verdict could be ‘chilling for survivors’",
    "The asylum rule replacing Title 42 is strict – here’s what we know",
    "Serbians wary of president's gun pledge after mass shootings",
    "Russia-Ukraine war: Zelenskiy meets UK prime minister; France to send Kyiv military aid",
    "‘I try to explain the meaning of this Russian fascism’",
    "Ukrainian president arrives at UK PM's country residence to meet ‘my friend’ Rishi Sunak",
    "What we know on day 446 of the invasion",
    "The Daily Show’s Roy Wood Jr on Biden, DeSantis and that White House dinner",
    "Living in the Alaska rainforest with 1,000 bears",
    "Matilda’s Mara Wilson on the price of fame",
    "Shows are ending earlier than usual and that’s a great thing",
    "Why are so many young Americans adopting fake British accents?",
    "How do you feel about your smartphone use?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Will Jokić halt LeBron’s title ambitions?",
    "10 talking points from the weekend’s action",
    "‘Godfather of Poker’ dies at age of 89",
    "Alcaraz stunned by world No 135 Marozsan in Rome Open",
    "Arteta must improve Arsenal’s strength in depth",
    "Grizzlies suspend star after second apparent gun video emerges",
    "Tatum’s Game 7-record 51 points power Celtics into Eastern Conference finals",
    "Rockies pitcher Feltner fractures skull after taking 93 mph line-drive to head",
    "Sign up to the US opinion email",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Erdoğan is in the lead in Turkey’s elections – and democracy is likely to be the loser",
    "I’m a drag queen in Tennessee. The state’s anti-drag law is silly, nasty and wrong",
    "The apocalypse isn’t coming. We must resist cynicism and fear about AI",
    "The biggest ever space explosion has occurred – what do you mean you don’t care?",
    "To my friend who worries about becoming a parent: here are some things to hold on to",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "I used to hide behind my hair. But cancer gave me a buzzcut and helped me find my voice",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Is the UK in the grip of ‘greedflation’?",
    "Listen to previous episodes",
    "Sting on making Shape of My Heart",
    "Fear and loathing in Hollywood",
    "The devastating plight of LGBTQ asylum seekers",
    "The artists pushing the boundaries of AI",
    "The makers of mega-hit video game The Legend of Zelda: Tears of the Kingdom",
    "Music, film, books and more about the madness and wisdom of crowds",
    "How rap music processed trauma in war-damaged Iraq",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "Band to continue tour following death of Paul Cattermole and departure of Hannah Spearritt",
    "An intimate, uplifting star portrait",
    "Why we need a new definition of junk food",
    "The best mid-range phone gets even better",
    "Nancy Birtwhistle’s budget midweek meal",
    "The spreading agony of kidney stones",
    "I embraced being single and became an international pet-sitter",
    "Every night I would sing to Cackles the goose. Then tragedy struck",
    "Crossings reportedly decrease after Title 42 rules scrapped",
    "Philadelphia Inquirer severely disrupted by cyber-attack",
    "Vice files for bankruptcy protection amid cut-price sale to consortium",
    "Firm apologizes after refusing rental car to Puerto Rican customer",
    "Boy, 13, saves sister by hitting potential kidnapper with slingshot",
    "Republican presidential candidate downplays federal abortion ban",
    "Mem Fox book Guess What? banned in county under Ron DeSantis bill",
    "Not having cellphone allowed boy to save runaway bus from crashing",
    "Teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Rightwing US senator to give virtual speech at conservative UK conference",
    "Opposition parties start alliance talks after voters reject military rule",
    "Economy expected to grow faster than forecast, says EU",
    "Dog rescued after scaling England’s highest mountain",
    "Man fined nearly $1,000 for filling in pothole hits out at ‘injustice’",
    "Talking to babies may help shape brain structure, research finds",
    "Nurse murdered two patients so he could be ‘left in peace’",
    "Two charged after Hitler speeches played on train intercom",
    "Academic Tariq Ramadan goes on trial accused of rape",
    "Talent agency apologises over claims founder sexually abused boys",
    "Greens suffer setback in Bremen local election",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "What can we expect from Erdoğan v Kılıçdaroğlu runoff?",
    "Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "How Donald Trump was found liable for sexual abuse",
    "Leaders embrace and a stage invasion",
    "The world’s oldest dog and uphill sprinting",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run",
    "A new start after 60: I embraced being single and became an international pet-sitter",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "China’s war chest: Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "Living in the Alaska rainforest with 1,000 bears: ‘Not the easiest place to be homeless’",
    "Hertz apologizes after refusing rental car to Puerto Rican customer",
    "Italian man fined nearly €900 for filling in pothole hits out at ‘injustice’"
]