[
    "The Guardian - Back to home",
    "Explainer What’s going to happen when Trump shows up at court?",
    "Indictment who's who A guide to everyone mentioned in the charges",
    "The charges against Trump Full text of federal indictment",
    "Trump finds no new lawyers for court appearance in Mar-a-Lago case",
    "Donald Trump ‘won’t be handcuffed’ at Miami court",
    "Ex-president to appear in court on federal charges in documents case",
    "Nine injured in shooting after Nuggets win NBA title",
    "Visitors warned away from Texas beach after thousands of dead fish wash up",
    "Biden press chief violated Hatch Act with ‘mega Maga’ remark, says watchdog",
    "Business to resume as McCarthy and Republicans break impasse",
    "Romanian authorities charge TikTok influencer with more serious human trafficking charge",
    "Not phasing out fossil fuels is ‘death sentence’ for world’s poor, says activist",
    "Mixed reactions after Elizabeth Gilbert pulls Russia-set novel",
    "Manhunt for serial crocodile killer after second decapitation",
    "Salt Bae Burger, once dubbed city’s worst restaurant, closes",
    "The harm from AI is already here. What can the US do to protect us?",
    "What is all the fighting in the UK Tory party about – and how is Boris Johnson involved?",
    "Only the world-famous cellist Yo-Yo Ma!",
    "Human trafficking surges in cyclone-hit east India",
    "‘We did all the things rock’n’roll boys would be lionised for’",
    "Why Jack Grealish is having the best week of his life",
    "Queer influencers in the US say brands have gone quiet",
    "Everyone is recreating Wes Anderson’s world. Wes Anderson isn’t happy about it",
    "How much salt is too much salt?",
    "Can a guaranteed income program work?",
    "I can only climax in one position. Why do my lovers try to talk me out of it?",
    "Denver and the improbable, inevitable Jokić are an NBA dynasty in-waiting",
    "How successful has Ukraine’s counteroffensive been so far?",
    "Russia launches deadly missile attack on Kryvyi Rih, says mayor",
    "Skulls left scattered after dam breach may be from second world war",
    "Ukrainian refugee wins €500,000 on lottery scratchcard",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "America is facing a mental health crisis",
    "Sad, confused, deluded: spare a thought for the friends of Boris Johnson at this difficult time",
    "As the ice melts, a perilous Russian threat is emerging in the Arctic",
    "Whisper it, but the boom in plastic production could be about to come to a juddering halt",
    "The nutritionist made a lot of sense – until her perplexing advice about raw chicken",
    "NBA Denver and the improbable Jokic are a dynasty in-waiting",
    "Nuggets' late surge delivers first title in team's 47-year history",
    "Mbappé delivers challenge to PSG with Real Madrid ‘lies’ claim",
    "The cyclist who raced men across America … and won",
    "Former Olympic champion died in childbirth, according to autopsy",
    "Saudi golf takeover is blueprint for what they want to do everywhere else",
    "Call for Uefa to investigate Ukraine flag incident",
    "Sprinter was first to run 100m in under 10 seconds",
    "Young people testify at historic US climate trial",
    "Young residents bring climate change case to court for first time ever",
    "Illegal reintroductions of rare butterflies to UK ‘a risk to other species’",
    "India and Pakistan keep close eye on tropical cyclone",
    "Company hires boy, 14, who became youngest graduate at California university",
    "US prices rose 4% over the last year as Fed considers pause in rate hikes",
    "Ex-NFL star says ‘100% a miracle’ he saved son and niece from drowning",
    "Pat Sajak to step down as host after more than 40 years",
    "Queens of the Stone Age frontman reveals cancer treatment",
    "US halts appointments using phone app at Texas border crossing",
    "Republican official appears to have moved $1.3m from nonprofit to own law firm",
    "Police chief Keechant Sewell quits after 18 months",
    "Westfield mall firm gives up San Francisco center as Nordstrom closes",
    "Cruise robotaxi appears to hinder emergency crews after mass shooting",
    "Most early-stage breast cancer patients will be long-term survivors – study",
    "Man arrested after three people killed in Nottingham",
    "‘Incredibly rare’ tomb unearthed near London Bridge station",
    "Artificial party ‘island’ plan for French Riviera stalls over ecological concerns",
    "Media decry de facto ban on giving airtime to Imran Khan",
    "About 100 wedding guests feared dead as boat capsizes",
    "Country moves towards plugging massive methane leaks",
    "Thousands of tonnes of rock break off summit of mountain",
    "‘Dead’ woman bangs on coffin during her own wake",
    "Australian hiker, 24, missing in Canadian bear country",
    "The long shadows of Boris Johnson and Nicola Sturgeon",
    "Listen to previous episodes",
    "Graham Norton on drag, dreams, death and desire",
    "Prolific character actor dies in motorcycle crash aged 71",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Ezra Miller makes first public appearance to promote The Flash at the film’s premiere",
    "Wes Anderson says misconduct allegations won’t affect their working relationship",
    "How British freestyle rap videos became a global phenomenon",
    "Recipe for strawberries with passion fruit",
    "Rachel Roddy’s recipe for fried polenta with cheese",
    "Max Mara’s Scandi show signals shift in fashion zeitgiest",
    "Don’t underestimate the humble box grater",
    "More than one in 10 women struggle to bond with their newborn baby, survey shows",
    "Rosie Sykes’ recipes with frozen peas",
    "Ngũgĩ wa Thiong’o: three days with a giant of African literature",
    "Ex-F1 champion Nico Rosberg on his sustainable entrepreneurship",
    "Why was Nicola Sturgeon arrested and what does it mean for Scottish independence?",
    "Why is a great painter who lived to 101 still defined by a man she left in the 1950s?",
    "Israeli women fear loss of rights in legal overhaul",
    "The powerful yearning of what might be 2023’s best movie",
    "Corsica protesters and an early morning hare",
    "Colombia’s Tomato Fight festival",
    "Local designers show their collections at Fiji fashion week 2023",
    "The best of Photo Basel 2023",
    "Lupita Nyong’o’s outfit, Dylan Mulvaney’s dress, fashion and red carpet looks",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Dead’ woman bangs on coffin during her own wake in Ecuador",
    "Donald Trump indictment hearing: former US president ‘won’t be handcuffed’ at Miami court – live",
    "Treat Williams, prolific character actor, dies in motorcycle crash aged 71",
    "‘They’re caving to bullies’: queer influencers in the US say brands have gone quiet"
]