[
    "The Guardian - Back to home",
    "Indian leader As Modi visits, Indian American lawmakers face balancing act",
    "Narendra Modi Yoga in New York for Indian PM as US state visit gets under way",
    "‘India is now a linchpin' US looks to Narendra Modi’s visit to counter China",
    "Biden to welcome Indian prime minister in attempt to deepen US-India ties",
    "‘Demobilised’ Titan likely intact but out of power, says expert",
    "Full report Rescuers intensify Titan search",
    "Rescue effort Robot subs and an 8km winch",
    "Titanic sub search: more rescue equipment arrives amid fears for oxygen levels in Titan",
    "Trump documents investigation examined New Jersey club from outset",
    "Rightwing war on ‘woke capitalism’ funded by deep-pocketed industry interests",
    "Invasion of giant African land snails prompts quarantine",
    "Anger as report reveals children were forcibly sterilised",
    "More rescue equipment arrives amid fears for oxygen levels in Titan",
    "US reporter in Russian court to appeal against detention",
    "US restaurant used fake priest in ‘shameless’ wage theft scheme",
    "Gales forecast as adventurer reaches halfway point in bid for Rockall record",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Explainer What was affirmative action designed to do – and what did it achieve?",
    "These 1,572 US politicians voted to restrict abortion since Roe fell. 225 are women",
    "Guatemala readies for election amid concerns of manipulation",
    "The website that found a refreshing way to tell a community’s story",
    "Exclusive report Guards at Del Monte farm accused of killings",
    "Four more people just died. If nothing changes, they won’t be the last",
    "US violence prevention workers tell of burnout",
    "‘He cooked me pork chops for dinner – and I was sold’",
    "Why are fans throwing phones at musicians?",
    "Generation celebrated in a series of 10 portraits",
    "The tiny Cornish island where nature is thriving",
    "Kim Cattrall looks absolutely bored out of her mind",
    "How Ukraine’s national dish became a symbol of Putin’s invasion",
    "What we know on day 484 of the invasion",
    "Oligarchs’ cash could help rebuild Ukraine – but don’t let them buy their way out of sanctions",
    "Zelenskiy admits counteroffensive may be going ‘slower than desired’",
    "Allies back fast-track membership for Ukraine, says UK foreign secretary",
    "Sign up to the US opinion email",
    "The fourth leading cause of death in the US? Cumulative poverty",
    "Alito’s wrongdoing makes a supreme court ethics overhaul an imperative",
    "Seven years on, the UK and EU are still drifting apart. The public wants a change",
    "They survived and thrived in a hostile Britain. That’s why we revere the Windrush pioneers",
    "Cash dictates UFC won’t cut ties with the troubled McGregor",
    "USWNT enter World Cup loved, despised and still influential",
    "Pittsburgh Steelers Super Bowl champion dies at 46",
    "Europe’s Jokić and Giannis show America how to be a balanced superstar",
    "Spurs close on £16.4m deal for Empoli keeper Vicario",
    "Women’s Ashes Test: England v Australia, day one – live",
    "Senate asks governor of Saudi wealth fund to testify over LIV-PGA merger",
    "Gündogan to leave Man City and join Barcelona on free transfer",
    "Climate impact of shipping under growing scrutiny ahead of key meeting",
    "Half of Americans have faced ‘extreme’ conditions in the last six weeks",
    "The scientist who raised dangers of carbon dioxide in 1950s",
    "Scientist Susan Chomba on male perspective and the environment",
    "TV series' ‘Doc’ Antle convicted of wildlife trafficking in Virginia",
    "Rioter who attacked police officer Michael Fanone with stun gun jailed for 12 years",
    "E-commerce giant duped millions into enrolling in Prime, US regulator says in lawsuit",
    "Samuel Alito did not declare gifts from billionaire with case before justices",
    "Metal recycling plant owners charged for contaminating school grounds",
    "Suspect Jack Teixeira pleads not guilty to six charges",
    "School district returns Bible to libraries after reversal of parent-led ban",
    "Mystery bail guarantors to be revealed on Thursday",
    "USDA allows lab-grown meat to be sold to US consumers",
    "Americans dread restart of student loan payments",
    "Barbecue restaurant explosion kills 31 after gas leak",
    "Politicians bought Nazi artefacts, auction house director claims",
    "King Charles honours ‘immeasurable’ impact of generation",
    "Temple visits rise as jobless young people seek spiritual assistance",
    "4,000-year-old ‘Stonehenge of the Netherlands’ unearthed",
    "Minister invites opposition for talks over ‘dire’ Manipur situation",
    "Gang members locked women in cells before prison riot fire",
    "At least 35 people feared dead after dinghy sinks en route to Canary Islands",
    "Kenya to launch biggest school meals programme in Africa",
    "Britain’s mortgage timebomb",
    "Listen to previous episodes",
    "Sarah Snook to play Dorian Gray as hit Australian production heads to London’s West End",
    "Super Mario leaps back to 2D as Nintendo goes retro",
    "The Diary of Virginia Woolf review – a book for the ages",
    "The long, remarkable lives of Britain’s Windrush-era musicians",
    "TV judge Rob Rinder on empathy, shame and survival",
    "Back off, sourdough! All hail the glorious return of the sliced white loaf",
    "8 ethical music festivals in the UK and Europe",
    "Six everyday oven cooking hacks",
    "10 ways to be more body-confident",
    "Food fight! Vegans and meat-eaters come to blows – again",
    "How to join the no-wash revolution",
    "I am 25 and have never been kissed. Have I missed my chance?",
    "A toxic metal is in a US city’s air – and may be harming children’s brains",
    "Timeline of missing vessel’s voyage",
    "The people turning to birth control after the fall of Roe",
    "Actors on the toll of dying on stage night after night",
    "Pharrell Williams hits Paris catwalk with Louis Vuitton menswear debut",
    "Through the eyes of Brian Aris – in pictures",
    "Iranian women asleep on a bus … Farnaz Damnabi’s best photograph",
    "Glastonbury festival and the summer solstice",
    "Rainbow sky and cool convertibles",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Missing Titan likely intact but out of power, says expert who designed deepest-diving submersible",
    "Anger in Japan as report reveals children were forcibly sterilised",
    "Invasion of giant African land snails prompts quarantine in south Florida",
    "Glamorous review – Kim Cattrall looks absolutely bored out of her mind",
    "Thursday briefing: The latest in the hunt for the missing Titan sub",
    "Workplace sins: US restaurant used fake priest in ‘shameless’ wage theft scheme",
    "Slapped on to tables, thrown over hedges, bounced – why is everyone so horrible to dead cats?"
]