[
    "The Guardian - Back to home",
    "‘Forever chemicals’ exposure can lead to low birth weight and obesity in later life",
    "Canada’s wildfires part of our new climate reality",
    "Mike Pence Republican enters 2024 race with speech denouncing ‘reckless’ Trump",
    "US Capitol attack Bob’s Burgers actor arrested on charges of joining mob",
    "Republican hardliners’ revolt against their own speaker shuts down US House of Representatives",
    "Whistleblower warns surveillance technology is much more intrusive today",
    "Greenhouse gas emissions at all-time high, study finds",
    "Lawyers told he is target in Mar-a-Lago documents investigation",
    "Republican states send national guard troops to Texas border in show of force",
    "Four children and an adult injured in knife attack in French Alps",
    "Russian man who claimed to have been FSB officer deported",
    "House of Representatives to hold hearing on whistleblower’s claims",
    "The lives lost in India’s train disaster",
    "Can Trump’s loyal deputy become his nemesis?",
    "Is eating local produce actually better for the planet?",
    "Eight hours in witness box takes toll on Prince Harry",
    "Messi has the power to realise soccer’s potential in the US",
    "Why America’s lesbian bars must be saved",
    "The planet’s economist: has Kate Raworth found a model for sustainable living?",
    "Not only did I warm to his drawls, I became obsessed",
    "Why Rowan Atkinson is wrong about electric vehicles",
    "Cycling the 7,600km European Divide",
    "Tom Holland and Amanda Seyfried’s new drama drags on and on (and on)",
    "How the leak of the century came to be published",
    "Dam disaster Rescue operation after collapse shows Ukrainians’ resilient spirit",
    "First flood deaths reported as Ukraine criticises global aid response",
    "Zelenskiy rejects claim of Ukraine plot to destroy pipeline",
    "What we know on day 470 of the invasion",
    "Chaos on frontlines as Ukraine war threatens to come home",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Anyone who goes to a beach already has a ‘beach body’. Don’t strive for an illusion",
    "Your partner wants the truth? They can’t handle the truth! At least, according to film and TV",
    "Prince Harry is not wrong to feel injustice, but he won’t find vindication in a court of law",
    "Autocorrect can be ‘ducking’ annoying, but we’ll miss its accidental poetry when it’s gone",
    "My home is cosy and comfortable, and there’s a kettle. Why would I want a night out?",
    "Jokic is making the NBA finals a showcase of his brilliance",
    "NBA finals Jokic lifts Denver to Game 3 win over Miami",
    "Messi has the power to realize soccer’s potential in the US",
    "No winners in the Women’s World Cup broadcast fiasco",
    "Liverpool confirm Mac Allister signing from Brighton for £35m",
    "McIlroy says there must be no way back for rebels",
    "Swiatek dominates Gauff again to reach semi-finals",
    "European glory with West Ham is career high, says Moyes",
    "Major sports leagues postpone games amid air quality concerns",
    "Best Seascape stories of the past year",
    "Chemical industry used big tobacco’s tactics to conceal evidence of PFAS risks",
    "Spate of US lawsuits calls big oil to account for climate crisis",
    "UAE state oil firm able to read Cop28 climate summit emails",
    "Outrage as anti-LGBTQ+ protest at school board turns violent",
    "Media organizations push for release of sealed records of US priest accused of abusing children",
    "Mega-donor faces new subpoena threat over gifts to Clarence Thomas",
    "North Dakota governor Doug Burgum announces Republican presidential bid",
    "Self-driving car kills dog amid increasing concern over robotaxis",
    "High school student and relative killed in graduation shooting",
    "Woman accused of shooting neighbor through front door arrested",
    "Chief Chris Licht to leave cable news giant days after Atlantic profile",
    "Host peddles conspiracy theories on Twitter debut from barn",
    "Multiple witnesses subpoenaed in Florida in Mar-a-Lago case",
    "Japan court falls short of calling ban unconstitutional",
    "Dozens of Chinese warplanes enter air defence zone",
    "Less than half in Britain back gender-affirming care for teenagers",
    "Ukraine and Myanmar make 2022 most violent year in a decade for medical staff",
    "Boris and Carrie Johnson ‘hosted friend at Chequers during Covid restrictions’",
    "EU states refusing to host migrants may have to pay up to €20,000 a head",
    "Government bids farewell to horse racing to free up land for housing",
    "Media reports overhype ketamine’s use as a depression treatment, review finds",
    "UK not too small to be centre of AI regulation, says Rishi Sunak",
    "Meta ordered to offer mental health care to moderators in Kenya",
    "The destruction of the Kakhovka dam",
    "Listen to previous episodes",
    "The best films of 2023 so far",
    "Everything’s Fine by Cecilia Rabess review – assured mixed-race, mixed-politics romance",
    "Tom Holland taking year off from acting after latest role ‘did break me’",
    "Do we need a podcast from the ‘Soho grifter’?",
    "The man who thought his parents killed his sister",
    "Maggie Smith film that took 20 years to make to get premiere",
    "He moved in after a month together to care for me – then he kept being amazing",
    "My dad died in my childhood home – and now I can’t face visiting my mum there",
    "A speeding fine, a baby donkey and a tram ride",
    "10 ways to be more confident on dating apps",
    "Have you stopped washing your clothes or wash them less often?",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "Why Jess McDonald quit her job – and decided to tell all",
    "What’s really changed 10 years after the Snowden revelations?",
    "How have you been affected by the Canada wildfires and the smoke in the US?",
    "Which brands are supporting Pride in the wake of backlash?",
    "A new system recasts gun violence as a public health concern. It’s saving lives",
    "Earth Photo 2023 shortlist",
    "Smoke engulfs American north-east",
    "Flip-flop boats, ‘trashion’ and the Bag Monster: the art of discarded plastic",
    "The news from a Mozambique landfill site",
    "Lunch mates and Brazilian beauty",
    "Icons shot by Richard Avedon in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Fact check: why Rowan Atkinson is wrong about electric vehicles",
    "Chaos on frontlines as Ukraine war threatens to come home for Russia",
    "Nato members may send troops to Ukraine, warns former alliance chief",
    "Republican hardliners’ revolt against Kevin McCarthy shuts down US House of Representatives",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Canada: wildfires rage across British Columbia – video",
    "Shannen Doherty reveals breast cancer has spread to her brain",
    "‘No regrets,’ says Edward Snowden, after 10 years in exile",
    "Bob’s Burgers actor arrested on charges of joining January 6 mob"
]