[
    "The Guardian - Back to home",
    "‘Vitriolic lies’ present clear threat to US democracy, top expert warns",
    "City is sinking due to weight of its skyscrapers, research finds",
    "G7 summit Leaders prepare new Russia sanctions",
    "Ukraine US risks rift with EU allies over hesitancy to supply F-16s",
    "Russia-Ukraine war: Zelenskiy meets Arab League leaders before heading to G7",
    "TikTok Creators sue to block Montana’s ban on app",
    "‘We have terrible roads but we’re banning an app’",
    "Couple ‘demand agency hand over car chase images’",
    "G7 leaders confront spectre of nuclear conflict on visit to memorial",
    "Police detain woman for supporting comedian who joked about military",
    "French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Airline ‘sincerely apologizes’ to family over Puerto Rico passport error",
    "Gun violence is top public health concern for quarter of Americans – poll",
    "Bassist for the Smiths dies aged 59",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "The Sicilian town trying to break free of its mobster past",
    "Montreal mob-related killing sparks worry of gang war",
    "Increasingly sophisticated and deadly",
    "Dreams shattered as war scatters Ukraine documentary’s teenage stars",
    "Error overvalued US weapons aid to Ukraine by $3bn",
    "What we know on day 450 of the invasion",
    "Stark before-and-after images reveal the obliteration of city",
    "The spellbinding singer on anger, empathy and trans rights",
    "Turn off your email, get the packing right – and never, ever play Monopoly",
    "Harrison Ford 20 best performances",
    "Harrison Ford cracks the whip in taut sequel",
    "I’ve got the best memory in the world",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "Should my girlfriend stop monitoring me at the gym?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "My students are using AI to cheat. Here’s why it’s a teachable moment",
    "The US debt ceiling crisis is more proof of Republicans’ cynicism and bad faith",
    "Alzheimer’s drugs are a ray of hope. They must be accessible to all, not the wealthy few",
    "Let’s teach children about slavery properly by connecting it to our present",
    "The great British baby drought has a simple cause. And it’s not ‘cultural Marxism’",
    "It’s time to guarantee healthcare to all Americans as a human right",
    "Nuggets two wins from finals after Murray’s 23-point fourth tames Lakers",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Tom Kim Golfer's accidental mud bath on sixth goes viral",
    "LIV rebel DeChambeau muscles his way into early lead",
    "Football Do teams with nothing to play for really end up ‘on the beach’?",
    "Ten things to look out for this weekend",
    "Ligue 1’s LGBTQ+ campaign washed out by absent players and tone-deaf managers",
    "Caruana edges Bucharest while Ding narrowly avoids finishing bottom",
    "San Diego to receive 30th franchise ahead of 2025 debut",
    "Don’t stop with Doc. Time to burn the Sixers to the ground",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Weather disasters suggest climate crisis is at Europe's gates",
    "Developing country voices will be excluded at UN plastic talks, say NGOs",
    "Having trouble facing the reality of the climate crisis? Use this tried and tested method",
    "National Conservatism: a Tory fringe or the party’s future?",
    "Listen to previous episodes",
    "Caligula finally comes to Cannes",
    "Staging Mozart’s Don Giovanni",
    "Brandy Clark: Brandy Clark – country provocateur holds too much back",
    "‘When I am anxious or sad, I reach for Hilary Mantel’s Wolf Hall’",
    "The Full Monty creators on the return of their Sheffield strippers",
    "So bad you’ll want to howl at your TV screen",
    "Sean Penn paramedic drama tries to grapple the horror",
    "Estate loses US supreme court copyright fight over Prince paintings",
    "Wim Wenders: cinema today ‘makes me nauseous’",
    "A band finally at ease with themselves",
    "Readers’ favourite restaurants in Europe",
    "I may have fallen in love with a sex worker I am paying. Could it be real?",
    "‘I really wanted to be her friend but I wasn’t sure I was cool enough’",
    "‘She is a big conspiracy theorist – I came out thinking, what was that?’",
    "I’ve struggled to make friends since moving abroad – and it’s making me lonely",
    "How to start dating again after heartbreak",
    "Eight-year-old girl dies after being detained by border patrol",
    "Company cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "California city to name street after rapper",
    "City names first drag laureate as LGBTQ+ rights under attack in US",
    "Man accused of stabbing app founder Bob Lee pleads not guilty",
    "Sierra Club clashes with union over layoffs and restructuring plan",
    "Universal ‘chasing arrows’ recycling symbol could be dumped in US",
    "Congresswoman claims white supremacist label is same as N-word",
    "US supreme court reinforces immunity for Google and Twitter in win for tech behemoths",
    "CNN host rebukes network over Trump town hall",
    "Nationalists chant racist slogans on march through Jerusalem",
    "Driver forces entry into palace grounds by ramming gate",
    "Sunak talks up UK defence secretary as next Nato secretary general",
    "Younger Britons more likely to believe in eternal damnation, study finds",
    "Hundreds of dumped condoms could hold key to crude Melbourne mail mystery",
    "Tasered 95-year-old woman was approaching on walking frame with steak knife, police say",
    "First records of human kissing may date back 1,000 years earlier than estimated",
    "Stellantis demands billions in subsidies to keep planned battery plant",
    "Imran Khan and Lahore police remain in tense standoff",
    "Death toll mounts in country's worst flooding for 100 years",
    "Ex-royal bodyguard on paparazzi chases",
    "US child killings have risen rapidly – why are more states pushing for joint custody laws?",
    "G7 wrestles with how to prosecute one war and prevent another",
    "Inside the shocking downfall of Hillsong church",
    "The new marine sanctuary for the super-rich LA coast",
    "Maybe so, but new parents in Iceland are holding out for better",
    "A rare monk seal and a lurking alligator",
    "Australian fashion week and flooding in Italy",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Disney cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "Greek PM hails ‘tough but fair’ migration policy on election trail",
    "Andy Rourke, bassist for the Smiths, dies aged 59",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast",
    "Jane Fonda: French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "‘An irresistible mix of art and genitals’: Caligula finally comes to Cannes",
    "Harry and Meghan ‘demand agency hand over car chase images’",
    "‘Why do pastors keep falling?’: inside the shocking downfall of Hillsong church"
]