[
    "The Guardian - Back to home",
    "Congress Biden and McCarthy reach ‘in principle’ deal",
    "Opinion The deal isn’t perfect but it’s the only one – and it must pass",
    "Explainer What is the US debt ceiling?",
    "Details being ironed out to avert catastrophic default",
    "Experts warn of increased risk of US terror attacks by ‘lone wolf’ actors",
    "A man was told he could visit home. He was arrested at the airport",
    "'It's an honour' Italian towns claim Ron DeSantis as one of their own",
    "Republican accused of ‘catastrophic’ climate approach after campaign launch",
    "Turkey election: Recep Tayyip Erdoğan faces Kemal Kılıçdaroğlu in presidential runoff",
    "Attorney general impeached by Republican-led House in historic vote",
    "US ‘ready to fight in space if we have to’, says military official",
    "Congress ‘absolutely’ can impose ethics reform on court, senator says",
    "Alberta’s party leaders are ignoring the climate crisis while the region burns",
    "Doug Rushkoff on why tech billionaires are in escape mode",
    "Why the climate crisis is making our insects run for the hills",
    "France struggles to stub out ‘explosion’ in contraband cigarettes",
    "Vatican back in spotlight over mystery of missing girl",
    "New York resurrects popular skate park",
    "Can San Francisco once again reinvent itself?",
    "Could my wrinkles earn me money?",
    "In search of aerobics guru Richard Simmons",
    "Why stars are getting older - and what it tells us about Hollywood’s new struggle",
    "Peter Friedman on the thrill of playing Succession’s Frank",
    "How Tina Turner’s one-room school became a museum",
    "Vivid portrait of Israel in ferment",
    "Russia launches biggest drone attack yet on Kiev as city marks its founding",
    "Ukraine built more onshore turbines last year than England",
    "The moment has arrived: Biden must give Ukraine all it needs to win",
    "What we know on day 459 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The debt ceiling deal isn’t perfect but it’s the only one – and it must pass",
    "If you defend free speech, you must defend it all and not silence those you disagree with",
    "Why the bimbocore aesthetic is the path to weaponising the social performance of the ageing woman",
    "What is a dog, then? On the unbearable death of my dog, Polly",
    "Raw talent and a refusal to accept barriers made Tina Turner great",
    "Heat on brink of historic collapse as Celtics force Game 7 on White’s putback",
    "Leicester v West Ham, Leeds v Spurs and more",
    "Verstappen wins Monaco Grand Prix to extend championship lead",
    "PSG goalkeeper in intensive care after horse riding accident",
    "Pochettino signs contract to become Chelsea head coach until 2026",
    "Luton Town prepare for life in the Premier League",
    "Sabalenka beats Kostyuk, Evans, Tsitsipas, Rublev and more: French Open day one",
    "Olympic champion shatters own shot put world record at LA Grand Prix",
    "Up to 70% of beaches could disappear by end of the century",
    "Insurance giant halts sale of new home policies in state due to wildfires",
    "Recycled and reused food contact plastics are ‘vectors’ for toxins, study finds",
    "Cutting parking spaces 'could solve New York rat crisis and create more green spaces'",
    "Florida Ron DeSantis appears to back woman who led Amanda Gorman poem school ban",
    "Candidate’s limp start to 2024 race delights Trump but battle is not over",
    "Fierce beast attacking residents revealed as domestic cat with attitude",
    "Nun’s body intact four years after death draws people to monastery",
    "Republican governor rolls back state’s child labor law protections",
    "US priest’s sentence offer for molesting child too lenient, says accuser in case",
    "Wave of lawsuits against firearm makers raises hope of end to mass shootings",
    "Vice-president becomes first woman to give West Point commencement speech",
    "‘Massive’ data leak reveals thousands of alleged safety complaints – report",
    "Sailor’s death stemmed from ‘near perfect storm’ of Seal training failures",
    "Oath Keeper sentenced to eight and a half years for role in January 6",
    "Vast new parliament opened by Narendra Modi amid opposition boycott",
    "Court issues arrest warrant for man who opened plane door mid-air",
    "First domestically produced passenger jet makes maiden commercial flight",
    "Ministers engaged in bitter fight to halt release of Covid secrets",
    "Hottest day of year so far recorded as temperatures hit 24.3C",
    "Heavily pregnant woman who escaped country gives birth to ‘miracle baby’",
    "Country heads to polls amid rows over Eta and allegations of voter fraud",
    "Official suspended after draining reservoir to retrieve phone",
    "How a Belarus dissident became an apologist for the regime",
    "Trusts shared patient details with Facebook without consent",
    "A curious choice for the Palme – but what an extraordinary Cannes",
    "Cannes Palme d’Or winner criticises Macron’s ‘repression’ of protests",
    "Can we predict the collapse of societies?",
    "The tragedy and beauty of Nick Drake, by those closest to him",
    "Paul Schrader’s sluggish new crime thriller isn’t a grower",
    "The tide has turned on beauty fillers, but don’t assume ‘natural’ is in",
    "Allergies: the irritating truth",
    "We’d known each other for three months and kissed once – then over the phone, I proposed",
    "Should I worry about my snoring?",
    "'People imagine that the guilt of an affair makes the sex more exciting’",
    "The Red Berets ride to the rescue of New York subway commuters, 1979",
    "The scientist who changed space travel",
    "Inside the world’s longest-running mermaid gathering",
    "Who was the woman who jumped to her death?",
    "The rural Australians helping Afghan asylum seekers find refuge",
    "The US professor living underwater for 100 days",
    "Dancing devils and zen frogs",
    "Fashion fixes for the week ahead",
    "Imaginary spaces rendered in fabric",
    "I’d never seen a woman riding a motorcycle in a dress",
    "10 years of its best photography",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Polls open in Turkish election runoff as Erdoğan hopes to retain power",
    "DeSantis accused of ‘catastrophic’ climate approach after campaign launch",
    "Up to 70% of California beaches could disappear by end of the century",
    "Three abandoned children, two missing parents and a 40-year mystery",
    "An immigrant was told he could visit home. He was arrested at the airport",
    "Henry Kissinger turns 100 this week. He should be ashamed to be seen in public",
    "The pope and Emanuela Orlandi: Vatican back in the spotlight over mystery of missing girl",
    "US to give away free lighthouses as GPS makes them unnecessary",
    "Getting physical: in search of aerobics guru Richard Simmons"
]