[
    "The Guardian - Back to home",
    "Climate crisis deniers target scientists for vicious abuse",
    "Turkey Recep Tayyip Erdoğan hands out gifts in desperate bid to win re-election",
    "Erdoğan’s grip on power tested as polls open",
    "Title 42 Restrictions have ended, but Biden’s new policy is tougher",
    "‘This was my last try’ Dismay as Title 42 ends and little changes",
    "In pictures  Scenes from the US-Mexico border as Title 42 ends",
    "Calm prevails after Title 42 migration restrictions lifted",
    "Imran Khan ‘Pakistan’s democracy hangs by a thread,’ says former PM on return home after arrest",
    "Imran Khan calls for countrywide ‘freedom’ protests",
    "Teacher allegedly investigated for showing students film Strange World",
    "Legal defense fund raises over $1m for accused in New York subway death",
    "‘Pakistan’s democracy hangs by a thread,’ says former PM on return home after arrest",
    "Florida governor secures endorsements on visit to Iowa in preparation for likely 2024 bid",
    "Ceasefire between Israel and Islamic Jihad in Gaza area takes effect",
    "Thirteen-year-old girl punches shark to escape attack",
    "As lies and scandals deepen, the GOP responds as usual – with silence",
    "Brittney Griner plays first game since detainment in Russia",
    "The Mexican city torn apart by cartel kidnappings",
    "‘Inevitable’ India’s jewels will be returned, says author",
    "What we know on day 445 of the Russian invasion",
    "Zelenskiy and pope discuss peace in Ukraine as Russia retreats in Bakhmut",
    "Russian troops fall back to ‘defensive positions’ near Bakhmut",
    "Rage as he might at sexual abuse verdict, legal woes have only just begun",
    "Sweden wins in Liverpool with Tattoo by Loreen",
    "Orvieto classico: the honeycomb Italian city",
    "Why label dates don’t mean what you think",
    "Florida teachers besieged by draconian laws",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Williams fired by Suns after second straight early playoff exit",
    "‘I prefer me now I’m older’ Guardiola on managing pressure",
    "Chelsea agree terms with Pochettino to become manager",
    "The epic LeBron-Steph rivalry delivered again. Enjoy them while you can",
    "NBA playoffs James dominates as Lakers close out Warriors",
    "The series of poor decisions that sent Saints marching out of Premier League",
    "Southampton 0-2 Fulham Saints slump to relegation",
    "Eagles star earns master’s degree from Oklahoma",
    "Griner plays first game since detainment in Russia",
    "Gauff at crossroads after hitting first speed bumps",
    "Advantage Black Cats after Hume seals narrow first-leg win",
    "Sign up to the US opinion email",
    "More than 300,000 Syrian civilians died. Any attempt to rehabilitate Assad is utterly shameful",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "The culture of mistrust is bleeding into our personal lives. No wonder there’s a sex recession",
    "Too tired to cook. Too easy to open a packet. It’s not our fault we eat junk",
    "Trump’s rape trial was triggering. But Carroll’s victory offered a glimmer of hope",
    "By our own design: this is how we can make Britain’s parks safe for women",
    "When De Niro is having a child at 79, it’s time to cut older mothers some slack",
    "Simon Schama on the broken relationship between humans and nature",
    "The Arctic islands where we can see the future of global heating",
    "‘Ghost lake’ reappears after sodden winter",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "Homegrown review: Timothy McVeigh and the rise of the Trumpist threat",
    "Voice synthesising is being hailed as the future of video games – but at what cost?",
    "Winnie & Nelson by Jonny Steinberg; The Plot to Save South Africa by Justice Malala – review",
    "The wild revolutionary politics of Eurovision",
    "I was a tiny cog in a machine of people all named vice-president of something",
    "Historic gay dating show is a queer summer treat",
    "The trouble with writing dystopian science fiction",
    "The universe moved when the Strokes were all together",
    "Emma Cline on the follow up to her hit novel The Girls",
    "My father is obese and I can’t stand being around him",
    "I only have three vices left: coffee, chocolate and salt",
    "A therapist on how to survive grown-up kids moving back home",
    "I said ‘I’d marry you tomorrow’ and that was it",
    "José Pizarro’s steamed asparagus with jamón and crispy fried egg",
    "I probably jumped down from a chair more than 50 times",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "What is their future with top leaders jailed?",
    "The food court building community in the city’s ‘doom loop’",
    "Latest arrests of protesters ‘feel like overreach’, experts say",
    "How America’s fatal gun attraction turned schools into war zones",
    "Man kills girlfriend after she had an abortion in Colorado",
    "Governor ‘embarrassed’ by crowd’s behavior at Trump town hall",
    "Mother of US bride killed in crash condemns driver who ‘chose to drink’",
    "Republican boycott threatens key bills on abortion and gun control",
    "He was six when police attacked his Black liberation group – now he’s making a memorial",
    "Thailand Young Thais look to Pita Limjaroenrat to bust military-royalist grip on power",
    "Election day arrives with hope of unseating junta generals from power",
    "Scientists criticise Nasa for scaling back mission to explore beyond Pluto",
    "UK politics Tory anarchy breaks out as revolt looms on Brexit laws",
    "Disciples gathered to sing the old hymns. But are they a real threat to Rishi Sunak?",
    "Congress party defeats Narendra Modi’s BJP in Karnataka state elections",
    "Revealed: richer graduates in England will pay less for degree than poorer students",
    "Single-use vapes sparking surge in fires at UK waste plants",
    "Young Thais look to Pita Limjaroenrat to bust military-royalist grip on power",
    "Cyclone Mocha threatens world’s largest refugee camp on Bangladesh border",
    "Starmer says his Labour must go further than Blair",
    "Duke has no evidence he was hacked by the Mirror, court told",
    "Ukraine’s 2016 Eurovision winner Jamala on why Putin fears her people, the Tatars",
    "My week navigating the awkward teenage years of self-driving cars",
    "Peckham’s charm under threat from gentrification plans",
    "How media and mass shootings may reinforce each other",
    "Memories of meals gone by – in pictures",
    "The week around the world in 20 pictures",
    "Rare armadillos, pan bashing and a victory stamp",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Florida teacher allegedly investigated for showing students film Strange World",
    "This is how we do it: ‘A tired, throwaway midweek shag doesn’t interest me’",
    "The moment I knew: I said ‘I’d marry you tomorrow’ and that was it",
    "‘The point is intimidation’: Florida teachers besieged by draconian laws",
    "Manhood review: Josh Hawley, moraliser, neo-Confederate and Tucker Carlson of the US Senate",
    "Legal defense fund raises over $1m for accused in Jordan Neely subway death",
    "Russian missiles strike home town of Ukraine’s Eurovision entry during contest"
]