[
    "The Guardian - Back to home",
    "US Congress Important first hurdle cleared with House panel and advances for debate",
    "The deal What has to happen now to get it passed?",
    "‘An egregious act’ Debt deal imperils environment, critics say",
    "Republican hard-right vows to sink deal hours before vote expected",
    "Staffer who accused Joe Biden of sexual assault defects to Russia",
    "Exclusive Trump lawyer said to have been waved off searching office for secret records",
    "Ex-president reiterates pledge to scrap birthright citizenship",
    "Gerrymandered districts set stage for 2024 Republican wins",
    "President says he would support peace agreement with cartels",
    "Asian Americans do not have access to information, survey finds",
    "Restaurant manager died after getting trapped inside a freezer, lawsuit says",
    "Purdue can shield wealthy Sackler family from opioid lawsuits, court rules",
    "Rare white bison born in Wyoming is first in park’s 32-year history",
    "Adventurers reach Rockall in bid to live on north Atlantic islet for 60 days",
    "‘People wanted to believe the fairytale’",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "Russians wake up to war at home",
    "Philip O’Ferrall on his vision for media venture Outernet",
    "How the ‘nice’ comedy became utterly dreadful television",
    "A punchier, bolder, hotter and sweatier than ever",
    "The farmers fretting over Colorado River water even before latest cuts",
    "I lost sight of who I was. A bipolar diagnosis brought me back",
    "What US job will shrink the most in the next decade?",
    "Succession’s Jeremy Strong tried to jump into a river during final scene",
    "Manuscripts shed light on how medieval minstrels skewered society",
    "Plight of migrants as slums razed in French territory of Mayotte",
    "Russia-Ukraine war: Russian oil refinery in Krasnodar on fire; Belgorod shelled, says governor",
    "Macron to call for European ‘strategic awakening’ following invasion",
    "Who was behind the Moscow drone attacks?",
    "What we know on day 462 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The spectre of price controls is back to spook Sunak – and Thatcherite myths won’t save him",
    "Demanding Taylor Swift dump Matty Healy? Fan culture is out of control",
    "Dangerous lab leaks happen far more often than the public is aware",
    "Running out of battery: how post-Brexit Britain is failing to set up a future-focused economy",
    "Tunisia was the hope of the Arab spring. Now my father could face the death penalty for his words",
    "How bench players can tilt the NBA finals",
    "French Open day four Pegula, Tsitsipas and Svitolina in early action – live",
    "Kosovo Olympic authorities urge IOC to take action against Novak Djokovic",
    "Sid Lowe Serial winners Sevilla face 'hardest final'",
    "Roma Mourinho reveals captains' concerns over exit",
    "Abraham targets treble in possible Roma farewell",
    "Premier League season review Our predictions vs reality",
    "Test yourself with 23 questions on the 2022-23 season",
    "Hudson quits as manager as second interim hired amid search",
    "The Heat brutally ended the Celtics’ season of living dangerously",
    "Our writers pick their best and worst",
    "Inside year one of the Boehly era at Chelsea",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Five people still unaccounted for after apartment building collapse",
    "Debt ceiling deal clears first hurdle and advances for debate",
    "Republican hopeful says he will ‘destroy leftism’ in US if elected president",
    "Firefighting goats could be furloughed due to employment law",
    "Chinese pilot performed ‘aggressive maneuver’ near US plane, military says",
    "Connecticut exonerates victims of 17th-century trials",
    "California appeals court votes for parole for Manson follower",
    "Wife of 39th US president diagnosed with dementia",
    "Digital road sign hacked to display white supremacist messages",
    "Consumer watchdog says KOS protein powder contains toxic chemicals",
    "UN experts express ‘grave concern’ over detention of Jimmy Lai",
    "Outrage after teenage girl killed in Delhi street",
    "Royal fever sweeps ahead of crown prince's wedding",
    "Mountaineer Luis Stitzinger found dead near Himalayan peak",
    "EU accused of ‘staggering neglect’ after resettling just 271 Afghans",
    "Woman detained over Twitter and Snapchat posts promoting reform",
    "First spy satellite launch ends in failure, and promise to send up another",
    "Trial begins of female journalist who covered Mahsa Amini’s death",
    "UK’s trade deals with Australia and New Zealand kick in",
    "Radio broadcaster shot dead in latest killing of a journalist, say police",
    "Tracking down Ukraine’s abducted children",
    "Listen to previous episodes",
    "Jess Williamson on fate, Plains and her breakout fifth album",
    "The TV show so good it beats the Succession finale hands down",
    "The Bee Sting by Paul Murray review – a tragicomic triumph",
    "The Choice by Michael Arditti review – what the rector saw",
    "Ex-Soviet conceptual artist dies aged 98",
    "You’ll give up on Woody Harrelson’s Watergate drama after one episode",
    "How to regain your sense of self, hope and happiness",
    "Airbnb is in denial over concerns we raised about our host",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The employees working under surveillance",
    "The dating trend that is unlikely to improve your love life",
    "What’s the best cheese for melting?",
    "‘A revelation’ Succession’s Matthew Macfadyen has been a consummate shapeshifter",
    "Stop dumping your cast-offs on us, clothes traders tell EU",
    "Astronomers see 6,000-mile water vapor plume blasting from Saturn moon",
    "Risk of extinction should be ‘global priority’, say tech experts",
    "Growing debate over vape regulation",
    "Rare Italian deer make long journey to survival",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "The life of an artisanal charcoal maker",
    "Protests in Senegal and a Comic-Con dinosaur",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘One of the blasts shook our house’: Russians wake up to war at home",
    "Tara Reade, who accused Joe Biden of sexual assault, defects to Russia",
    "Good riddance, Ted Lasso: how the ‘nice’ comedy became utterly dreadful television",
    "Donald Trump reiterates pledge to scrap birthright US citizenship",
    "Ron DeSantis says he will ‘destroy leftism’ in US if elected president",
    "Thelma and Louise review – punchier, bolder, hotter and sweatier than ever",
    "Who was behind Moscow drone attacks and what do they mean for Ukraine war?",
    "Stop dumping your cast-offs on us, Ghanaian clothes traders tell EU",
    "Middle East and north Africa"
]