[
    "The Guardian - Back to home",
    "Russia General who may have known about mutiny goes missing",
    "Germany Wagner mutiny has weakened Putin, says chancellor",
    "At a glance What we know on day 491 of the invasion",
    "Presumed human remains recovered from within wreckage, US Coast Guard says",
    "Texas Record-setting heat sends hundreds to emergency rooms",
    "Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Joshua Trees win long term protection in environmental victory",
    "150 arrests as protests widen over teenager’s death",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "China on course to hit wind and solar power target five years ahead of time",
    "Teenage security guards stuck in Gulf state after World Cup",
    "Magazine reportedly lays off its last staff writers",
    "Law passed allowing abortion only when woman’s life is at risk",
    "Broadcaster reprimanded over ‘graphic’ dolphin mating scene",
    "How Wimbledon and apartheid South Africa blocked a teen’s tennis dream",
    "Why are sea lions and dolphins dying along California’s coast?",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are US retail workers being denied chairs?",
    "What we know on day 491 of the invasion",
    "EU mulls levy on frozen Russian assets to support reconstruction",
    "Ukraine defence minister expects Nato guarantee for after war",
    "Alliance ready to face threat from ‘Moscow or Minsk’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "Bowie bids farewell to an icon in legendary gig",
    "Rising seas have flooded this Lagos town three times. Can it survive?",
    "The people who taxidermy their pets",
    "Henry Cavill’s pulse-quickening last stand as an anti-heroic hunk",
    "Anger and fear as food aid suspension hits in Ethiopia",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "AFC Croydon responds to new owners Stormzy and Zaha",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Everything has turned grey – cars, clothes, kitchens, carpets. I can’t take it any more",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "The key to wedded bliss is a joint bank account? I don’t buy it",
    "South Korea has turned back time and made its people younger – sign me up",
    "Yankees pitcher throws 24th perfect game in MLB history",
    "MLB’s pace-of-play rules are showing that less is more",
    "Blackhawks tab ‘generational prospect’ Bedard with No 1 pick",
    "Jesús Ferreira scores hat-trick as USA put six past St Kitts",
    "Teenage security guards stuck in Qatar after World Cup",
    "Inter Miami hire Tata Martino as coach, confirming Messi reunion",
    "Mäder’s death prompts new Tour de France safety calls",
    "Brittney Griner’s triumphant return to the WNBA",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "Donald Trump Former president sues E Jean Carroll for defamation over rape comments",
    "Trump trial could be delayed until spring 2024",
    "Yusef Salaam declares victory in city council primary",
    "Highest-ranking trans elected official in US to run for Congress",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "Nasa aims to mine resources on moon in next decade",
    "US paramedic saves lives of two people in one family",
    "Airbnb to offer pink Malibu mansion",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Human remains found in California mountains confirmed as British actor",
    "Amazon facing ‘urgent’ crime crisis after gutting of protections, says drugs tsar",
    "Supplements may cut risk of heart attacks, trial suggests",
    "Ex-military policeman found guilty of genocide by Paris court",
    "Ambassador calls Australia ‘vindictive’ after dead possum thrown onto disputed embassy site",
    "Video of apparent neo-Nazi handing out balloons at nursery sparks outrage",
    "Man hoping to break record for living on barren rock rescued by coastguard",
    "Pilot dumps drugs over remote region when pursued by fighter jet",
    "Genetic variant identified that may increase severity of condition",
    "Police station attacked as search continues for 14 missing employees",
    "Engineer sentenced to life in prison for killing three women over job losses",
    "Guards at Del Monte pineapple farm in Kenya accused of killings",
    "Listen to previous episodes",
    "People still do not want women to succeed or be equal. While that is true, you need Virago",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Mike Figgis on Julian Sands",
    "Singer's tour postponed after she suffers ‘serious’ bacterial infection",
    "Taylor Swift, Ke Huy Quan, Paul Mescal among those invited to join the Academy",
    "What does it mean to be intersex?",
    "The married couple competing to have the biggest and best facial hair",
    "10 ways to be much more confident at parties",
    "10 famous food rules you can absolutely ignore",
    "10 of the weirdest sporting events in the UK",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Changing skin pattern while asleep may show they dream, research shows",
    "The author under attack for doubting Shakespeare",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Outcry after tourist carves name on wall at Colosseum",
    "How Kylie and Fleetwood Mac found new young fans",
    "Celebrating diversity and equality in photography",
    "Clashes rage over police shooting",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "Russian general who may have known about Wagner mutiny goes missing",
    "National Geographic reportedly lays off its last staff writers",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "Julian Sands confirmed dead after human remains identified",
    "‘We are literally erased’: what does it mean to be intersex?",
    "Rightwingers say ‘pink-haired liberals’ are killing New York pizza. Here’s what’s really happening"
]