[
    "The Guardian - Back to home",
    "Full report US supreme court strikes down affirmative action",
    "Opinion Scotus blow to affirmative action is no coincidence",
    "Affirmative action Case partly based on Holocaust denier’s work",
    "Extreme heatwaves continue to grip US as millions under heat and air quality alerts",
    "France  Boy shot dead was ‘well liked kid’ with ‘real potential’",
    "Macron holds crisis meeting as officer investigated",
    "White House issues warning to US firms interested in acquiring Israeli surveillance tech",
    "Artificial sweetener to be declared possible cancer risk by WHO, say reports",
    "Company to fly customers to edge of space at up to $450,000 per ticket",
    "Group hacks agencies in US states attacking gender-affirming care",
    "Amtrak train with nearly 200 passengers hits water truck and derails",
    "Museum faces backlash for hosting group with ‘oppressive views’",
    "Republican says as US president he would eliminate IRS and other agencies",
    "How does extreme heat affect the body and what can you do about it?",
    "Canada fires force US crews to shift strategy",
    "What’s driving anti-LGBTQ+ hate in America?",
    "MLB’s pace-of-play rules are showing that less is more",
    "Kremlin quiet on fate of Russian general with links to Wagner boss",
    "EU mulls levy on frozen Russian assets to support reconstruction",
    "Wagner mutiny has weakened Putin, says chancellor",
    "What we know on day 491 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "Get set for the Barbie-Oppenheimer smackdown",
    "Are they destroying our gut health?",
    "Bowie bids farewell to an icon in legendary gig",
    "Pet owners find new ways to process grief",
    "‘Songs tumble out like dreams – you can’t control them’",
    "This duo serves a segment that the big brands ignore",
    "Henry Cavill’s pulse-quickening last stand as an anti-heroic hunk",
    "Sign up to the US opinion email",
    "The supreme court’s blow to US affirmative action is no coincidence",
    "I am cursed to wear compression socks. Spare a thought for me this summer",
    "The failed Wagner coup shows Vladimir Putin’s regime remains stubbornly strong",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "Domingo Germán Yankee throws 24th perfect game in MLB history",
    "'Netting saves lives' Mäder’s death prompts new safety calls",
    "Full team-by-team guide and the riders to watch",
    "Jesús Ferreira scores hat-trick as USA put six past St Kitts",
    "Wimbledon Grass schedule creates surface tension",
    "Wimbledon made me and Wimbledon saved me",
    "Blackhawks tab ‘generational prospect’ Bedard with No 1 pick",
    "Teenage security guards stuck in Qatar after World Cup",
    "How Wimbledon and apartheid South Africa blocked a teen’s dream",
    "Havertz is a risk but offers Arsenal endless possibilities",
    "Rising seas have flooded this town three times. It may not survive a fourth",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Why are sea lions and dolphins dying along California’s coast?",
    "Climate crisis linked to rising domestic violence, study finds",
    "Milwaukee plant to close after 100 years and send jobs abroad",
    "State’s first-in-nation reparations taskforce to release final report",
    "US travelers face cancelled and delayed flights ahead of Fourth of July holiday",
    "Muslims vow to continue call to prayer despite rise in mosque attacks",
    "Elections official downplays cybersecurity threats despite report",
    "Presumed human remains recovered from within wreckage, US Coast Guard says",
    "Yusef Salaam declares victory in city council primary",
    "Joshua Trees win long-term protection in environmental victory",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Man gets prison time for years-long cow dung scam",
    "‘Witch-hunt’ What Johnson’s allies said about the inquiry",
    "Boris Johnson allies launched ‘unprecedented’ campaign to undermine privileges committee",
    "Broadcaster reprimanded over ‘graphic’ dolphin mating scene",
    "Many without power as deadly heat leads to strain on grid",
    "Teenage security guards stuck in Gulf state after World Cup",
    "Catholic church ‘dying painful death’ as 500,000 leave in a year",
    "Protesters gather in Helsinki over ministers’ far-right links",
    "Operations against UK leftwing groups unjustified, judge finds",
    "Ambassador calls Australia ‘vindictive’ after dead possum thrown onto disputed embassy site",
    "Alexis Tsipras to step down as Syriza leader after election rout",
    "Oversight board orders firm to take down video by Cambodian leader",
    "Guards at Del Monte pineapple farm in Kenya accused of killings",
    "Listen to previous episodes",
    "I wanted to play but my hand wouldn’t move",
    "Peter Ustinov art goes on sale",
    "Queer representation in video games has never been better – let’s not stop now",
    "Rapper charged with domestic violence",
    "Singer's tour postponed after she suffers ‘serious’ bacterial infection",
    "He made me realize I’m woke – I thought it was a negative thing",
    "People think it’s harder to make new friends after a certain age. We prove it’s possible",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "Stag do mishaps, pizza origins, and a very ugly dog",
    "The married couple competing to have the biggest and best facial hair",
    "10 ways to be much more confident at parties",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Skin disease in cetaceans off North American coast concerns scientists",
    "How Wimbledon and apartheid South Africa blocked a teen’s tennis dream",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "Mike Figgis on Julian Sands",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Celebrating diversity and equality in photography",
    "Clashes rage over police shooting",
    "Kusama and a kiss from Putin",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "‘It burns wild and free up there’: Canada fires force US crews to shift strategy",
    "National Geographic reportedly lays off its last staff writers",
    "Master Lock’s Milwaukee plant to close after 100 years and send jobs abroad",
    "Rightwingers say ‘pink-haired liberals’ are killing New York pizza. Here’s what’s really happening",
    "Aspartame sweetener to be declared possible cancer risk by WHO, say reports",
    "‘Gay furries’ group hacks agencies in US states attacking gender-affirming care"
]