[
    "The Guardian - Back to home",
    "Trump-Russia John Durham's investigation of an investigation",
    "FBI accused of failures but key report finds no deep-state plot against Trump",
    "At least three dead and multiple wounded",
    "US imports of ‘blood teak’ continue despite sanctions",
    "Tesla Musk wants hires cleared by him as he shifts focus away from Twitter",
    "Tesla chief subpoenaed over JPMorgan’s role in Epstein’s activities",
    "Suspect named in baseball bat attack at Democratic congressman’s office",
    "Punishing heatwave grips region as wildfires rage in western Canada",
    "Trump ally sued by former associate alleging sexual assault and harassment",
    "UN labour rights watchdog facing backlash over Qatar conference nomination",
    "Video shows Walgreens guard killing trans organizer Banko Brown as he left store",
    "White House releases show president's book royalties fell sharply last year",
    "Editors from around the world call for release of Hong Kong media mogul",
    "Martha Stewart, 81, becomes oldest Sports Illustrated swimsuit cover model",
    "Groundbreaking Chicana California leader dies at 74",
    "Jeremy Strong recalls his father’s life-saving act",
    "Kyiv air defences at work as Russia launches early morning strikes on Ukraine",
    "What we know on day 447 of the invasion",
    "Ukraine strikes Russian forces before expected counteroffensive",
    "UK pledges more weapons for Ukraine as president meets prime minister",
    "Manipur violence fuels calls for separate state in India",
    "Thailand election: will Move Forward be able to claim power?",
    "As mask mandates end Japan turns to tutors to relearn how to smile",
    "An egg: unfertilised, it is one giant cell",
    "The music stars protesting anti-drag laws",
    "Who is Twitter’s new CEO and can she fix its problems?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Football Daily Arsenal, the title race and charges of ‘bottling’",
    "Nick Ames Arteta must bolster his squad this summer",
    "Jonathan Wilson Leicester's maths lesson for mid-table clubs",
    "Jones keeps Reds on course to put Foxes in deep trouble",
    "Will Jokić halt LeBron’s title ambitions?",
    "Alcaraz stunned by world No 135 Marozsan in Rome Open",
    "Thomas handed pink jersey as Covid hits Giro d'Italia",
    "A’s ask for $400m in public money as move to Las Vegas nears",
    "10 talking points from the weekend’s action",
    "The story behind success for a new and different era",
    "‘Godfather of Poker’ dies at age of 89",
    "Sign up to the US opinion email",
    "The biggest ever space explosion has occurred – what do you mean you don’t care?",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Erdoğan is in the lead in Turkey’s elections – and democracy is likely to be the loser",
    "I’m a drag queen in Tennessee. The state’s anti-drag law is silly, nasty and wrong",
    "Turkey’s election results: a step towards autocracy?",
    "The apocalypse isn’t coming. We must resist cynicism and fear about AI",
    "To my friend who worries about becoming a parent: here are some things to hold on to",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Erdoğan survives, but will Turkish democracy?",
    "Listen to previous episodes",
    "AI songwriting is not a sin, says Neil Tennant",
    "Revisiting the era of the It Girl",
    "‘Quite adorable’ dog in ‘wonderful red bow’ discovered in painting",
    "Picasso ‘Quite adorable’ dog in ‘wonderful red bow’ discovered in painting",
    "Sympathetic retelling of a tragic life",
    "Actor to star in movie adaptation of hit play Prima Facie",
    "Season four, episode eight – nothing is more sadistic than the words ‘Is that even true?’",
    "Pacy plant-based apocalypse",
    "Shows are ending earlier than usual and that’s a great thing",
    "Sting on making Shape of My Heart",
    "‘I try to explain the meaning of this Russian fascism’",
    "Nancy Birtwhistle’s budget midweek meal",
    "Why are so many young Americans adopting fake British accents?",
    "Why we need a new definition of junk food",
    "The spreading agony of kidney stones",
    "Every night I would sing to Cackles the goose. Then tragedy struck",
    "The microwave gets Vogue’s seal of approval",
    "Church has $100bn ‘clandestine hedge fund’, says whistleblower",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "Ron DeSantis signs laws to ease 2024 run",
    "Republican hints at 2024 bid and revives memories of debate gaffe",
    "Philadelphia Inquirer severely disrupted by cyber-attack",
    "The asylum rule replacing Title 42 is strict – here’s what we know",
    "US supreme court pursuing rightwing agenda via ‘shadow docket’, book says",
    "Why Trump’s ‘vile’ attacks against Carroll after verdict could be ‘chilling for survivors’",
    "Vice files for bankruptcy protection amid cut-price sale to consortium",
    "Firm apologizes after refusing rental car to Puerto Rican customer",
    "Only major opposition party is barred from running in July elections",
    "Reports of women being raped in Khartoum by armed men",
    "Turkey election What can we expect from Erdoğan v Kılıçdaroğlu runoff?",
    "Election goes to runoff after Erdoğan takes first-round lead",
    "Survivors urge G7 leaders to unite against atomic weapons",
    "Images of Lukashenko released after rumours over leader’s health",
    "Beijing jails US citizen for life on espionage charges",
    "Replacing sugar with sweeteners does not affect weight control in long term, WHO says",
    "Toronto mayor’s race draws more than 100 candidates – including one dog",
    "Ex-worker at US consulate charged with espionage",
    "Mystery tremors on Baltic island puzzle scientists",
    "Piers Morgan knew journalists were using voicemails for stories, court told",
    "Living in the Alaska rainforest with 1,000 bears",
    "Readers on their vote in Turkey’s election",
    "Dog rescued after scaling England’s highest mountain",
    "Thai election may be turning point as taboo over monarchy fades",
    "The unique landscape of Lake Erie",
    "Leaders embrace and a stage invasion",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "Mormon church has $100bn ‘clandestine hedge fund’, says whistleblower",
    "Rudy Giuliani sued by former associate alleging sexual assault and harassment",
    "New Mexico shooting leaves three people dead and nine injured",
    "First UK baby with DNA from three people born after new IVF procedure"
]