[
    "The Guardian - Back to home",
    "Modi Biden to welcome leader in attempt to deepen US-India ties",
    "Modi visit Indian American lawmakers face balancing act",
    "‘India is now a linchpin’ US looks to visit to counter China",
    "India secretly works to preserve reputation after ‘flawed democracy’ rating",
    "Supreme court: affirmative action, LGBTQ+ rights and student loan rulings still outstanding",
    "‘Demobilised’ Titan likely intact but out of power, says expert",
    "Rescue effort Robot subs and an 8km winch",
    "Titanic sub search: two robot diving craft deployed as search teams ‘remain hopeful’",
    "Exclusive Trump documents investigation examined New Jersey club from outset",
    "Trump critic announces Republican run for president",
    "Dozens injured as apple-sized hailstones hit concertgoers",
    "Two people who guaranteed $500,000 bail to be revealed",
    "Rare combination of tornadoes and softball-sized hail leads to deaths",
    "Rightwing war on ‘woke capitalism’ partly driven by fossil fuel interests and allies",
    "Anger as report reveals children were forcibly sterilised",
    "Guest spends 603 nights at five-star hotel without paying",
    "Guardian Today US: Get the headlines & more in a daily email",
    "These 1,572 US politicians have helped ban abortion since Roe fell. They’re mostly men",
    "US violence prevention workers tell of burnout",
    "What was it designed to do – and what did it achieve?",
    "Windrush grandchildren discuss its legacy",
    "Women of color on being denied abortion",
    "Four more people just died. If nothing changes, they won’t be the last",
    "‘He cooked me pork chops for dinner – and I was sold’",
    "The tiny Cornish island where nature is thriving",
    "‘I think the Succession debate is: is he dead?’",
    "Why are fans throwing phones at musicians?",
    "Kim Cattrall looks absolutely bored out of her mind",
    "How Ukraine’s national dish became a symbol of Putin’s invasion",
    "Kyiv sees sharp rise in homeless people",
    "Moscow court rules US reporter accused of spying must remain in detention",
    "What we know on day 484 of the invasion",
    "Oligarchs’ cash could help rebuild Ukraine – but don’t let them buy their way out of sanctions",
    "Sign up to the US opinion email",
    "The fourth leading cause of death in the US? Cumulative poverty",
    "Alito’s wrongdoing makes a supreme court ethics overhaul an imperative",
    "It’s a Padam-ic! Kylie’s sex-positive hit is brilliantly upending the mainstream",
    "Seven years on, the UK and EU are still drifting apart. The public wants a change",
    "Windrush is part of a bigger global story – one that is giving me hope for the future",
    "Back off, sourdough! All hail the glorious return of the sliced white loaf",
    "Cash dictates UFC won’t cut ties with the troubled McGregor",
    "USWNT enter World Cup loved, despised and still influential",
    "Once in a generation Wembanyama prepares for NBA draft",
    "Bale: Messi will enjoy MLS because losing has ‘no consequence’",
    "Report: Porzingis to Celtics in deal that sends Smart to Memphis",
    "Man City will bid for Rice in push to beat Arsenal to signing",
    "Pittsburgh Steelers Super Bowl champion dies at 46",
    "Europe’s Jokić and Giannis show America how to be a balanced superstar",
    "Climate impact of shipping under growing scrutiny ahead of key meeting",
    "Half of Americans have faced ‘extreme’ conditions in the last six weeks",
    "The scientist who raised dangers of carbon dioxide in 1950s",
    "Scientist Susan Chomba on male perspective and the environment",
    "TV series' ‘Doc’ Antle convicted of wildlife trafficking in Virginia",
    "Invasion of giant African land snails prompts quarantine",
    "Special hearing to examine decisions made after trail derailment",
    "US restaurant used fake priest in ‘shameless’ wage theft scheme",
    "Rioter who attacked police officer Michael Fanone with stun gun jailed for 12 years",
    "E-commerce giant duped millions into enrolling in Prime, US regulator says in lawsuit",
    "Samuel Alito did not declare gifts from billionaire with case before justices",
    "Metal recycling plant owners charged for contaminating school grounds",
    "School district returns Bible to libraries after reversal of parent-led ban",
    "Mystery bail guarantors to be revealed on Thursday",
    "King Charles honours ‘immeasurable’ impact of Windrush generation",
    "Only 18% of leave voters think it has been a success, poll finds",
    "Central bank raises interest rates to 15% after two-year freeze",
    "Politicians bought Nazi artefacts, auction house director claims",
    "Barbecue restaurant explosion kills 31 after gas leak",
    "Gales forecast as adventurer reaches halfway point in bid for Rockall record",
    "Temple visits rise as jobless young people seek spiritual assistance",
    "4,000-year-old ‘Stonehenge of the Netherlands’ unearthed",
    "Minister invites opposition for talks over ‘dire’ Manipur situation",
    "UK interest rates rise by a half point to 5% in biggest increase in 15 years",
    "Britain’s mortgage timebomb",
    "Listen to previous episodes",
    "How Tom Cruise ruined romance",
    "Why is Juan Mata swapping football for performance art?",
    "Super Mario leaps back to 2D as Nintendo goes retro",
    "Unfinished novel by Françoise Sagan published posthumously",
    "Sarah Snook to play Dorian Gray as hit Australian production heads to London’s West End",
    "The Diary of Virginia Woolf review – a book for the ages",
    "'I just left thinking, why on earth are you a Conservative?’",
    "8 ethical music festivals in the UK and Europe",
    "Six everyday oven cooking hacks",
    "10 ways to be more body-confident",
    "Food fight! Vegans and meat-eaters come to blows – again",
    "How to join the no-wash revolution",
    "I am 25 and have never been kissed. Have I missed my chance?",
    "A toxic metal is in a US city’s air – and may be harming children’s brains",
    "Timeline of missing vessel’s voyage",
    "The people turning to birth control after the fall of Roe",
    "Actors on the toll of dying on stage night after night",
    "Pharrell Williams hits Paris catwalk with Louis Vuitton menswear debut",
    "Generation celebrated in a series of 10 portraits",
    "Through the eyes of Brian Aris – in pictures",
    "Iranian women asleep on a bus … Farnaz Damnabi’s best photograph",
    "Glastonbury festival and the summer solstice",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Titanic sub search: two robot diving craft deployed as search teams ‘remain hopeful’ – live",
    "Trump documents investigation examined New Jersey club from outset",
    "Slapped on to tables, thrown over hedges, bounced – why is everyone so horrible to dead cats?",
    "Missing Titan likely intact but out of power, says expert who designed deepest-diving submersible",
    "Guest spends 603 nights at five-star Indian hotel without paying",
    "Anger in Japan as report reveals children were forcibly sterilised",
    "Four more people just died in an e-bike fire. If nothing changes, they won’t be the last",
    "Glamorous review – Kim Cattrall looks absolutely bored out of her mind"
]