[
    "The Guardian - Back to home",
    "US Tens of millions under alerts as fire smoke drifts south",
    "‘It’s too much’ New Yorkers don masks and stay inside",
    "Canada ‘Out of control’ fires burn as poor air set to persist",
    "Outrage as anti-LGBTQ+ protest at school board turns violent",
    "Pence Former VP officially enters 2024 presidential race",
    "Historic challenge Can Trump’s deputy become his nemesis?",
    "Mike Pence: ‘Trump asked me to choose him or the constitution – I chose the constitution’",
    "Nato Members may send troops to Ukraine, warns ex-chief",
    "Russia-Ukraine war: counteroffensive not yet launched, says senior Kyiv official",
    "Star spurns Barcelona and Saudi Arabia to join Inter Miami in MLS",
    "Chief Chris Licht to leave cable news giant days after Atlantic profile",
    "Multiple witnesses subpoenaed in Florida in Mar-a-Lago case",
    "Host peddles conspiracy theories on Twitter debut from barn",
    "UN talks might avoid fossil fuel phase-out, says Cop28 official",
    "Duke tells phone-hacking trial there is ‘hard evidence’ he was targeted",
    "Scientists record first known ‘virgin birth’ in female crocodile",
    "Is eating local produce actually better for the planet?",
    "What we learned from duke’s day in court",
    "Theatre Olympics staged against a backdrop of war",
    "What are Minnesota’s new labor laws?",
    "Do we need a podcast from the ‘Soho grifter’?",
    "The man who thought his parents killed his sister",
    "How a younger generation warmed to 80s style rules",
    "How to recognize it – and feed your cravings healthily",
    "Martin McDonagh on why casting Lily Allen in The Pillowman makes it even more electrifying",
    "How the leak of the century came to be published",
    "Our writers on their favorite LGBTQ+ songs",
    "The Groundhogs’ Tony McPhee will remain a hero for the musically adventurous",
    "Rescue operation after dam collapse shows Ukrainians’ resilient spirit",
    "Fields could ‘turn into deserts’ after dam destruction",
    "Chaos on frontlines as Ukraine war threatens to come home",
    "Twice as many people see Russia as adversary or rival compared with 2021",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Anyone who goes to a beach already has a ‘beach body’. Don’t strive for an illusion",
    "Autocorrect can be ‘ducking’ annoying, but we’ll miss its accidental poetry when it’s gone",
    "The Guardian view on Prince Harry: rewriting the rules of royalty",
    "My home is cosy and comfortable, and there’s a kettle. Why would I want a night out?",
    "Messi spurns Barcelona and Saudi Arabia to join Inter Miami",
    "McIlroy says there must be no way back for rebels",
    "A journey from American MMA muscle to Russian propagandist",
    "Europa Conference League final: Fiorentina v West Ham",
    "Swiatek sweeps past Gauff to reach semi-finals",
    "Club seal initial €100m deal to buy Bellingham from Dortmund",
    "Spanish rider Raul Torras Martinez dies in crash",
    "Texas ace set for season-ending surgery after inking $185m deal",
    "Chemical industry used big tobacco’s tactics to conceal evidence of PFAS risks",
    "Spate of US lawsuits calls big oil to account for climate crisis",
    "UAE state oil firm able to read Cop28 climate summit emails",
    "Fifa misled fans over ‘carbon-neutral Qatar' tournament, regulator finds",
    "Mega-donor faces new subpoena threat over gifts to Clarence Thomas",
    "North Dakota governor Doug Burgum announces Republican presidential bid",
    "High school student and relative killed in graduation shooting",
    "Woman accused of shooting neighbor through front door arrested",
    "What you need to know about Canada wildfires and smoky US skies",
    "State confirms it was behind flights that left asylum seekers in California",
    "US urged to reveal evidence after claim that it has intact alien vehicles",
    "Ex-New Jersey governor launches 2024 bid",
    "Man executed for killing two jailers in failed escape plot",
    "Richer people pay more: dramatic change to electricity bills",
    "Ex-prime minister and health minister cleared of Covid culpability",
    "EU states refusing to host migrants may have to pay up to €20,000 a head",
    "Labour on course for landslide election victory, megapoll suggests",
    "Italian F1 commentators suspended after sexist remarks on air",
    "Pontiff has undergone intestinal surgery, says Vatican",
    "Heat health alert issued for England this weekend",
    "Oldest carved piece of wood to be found in Britain dates back 6,000 years",
    "Briton tells of harassment in French bridle path dispute",
    "Police cancel plan to grant extra days off for migrant arrests on border",
    "Five police accused of torturing migrants and homeless people",
    "How to develop artificial super-intelligence without destroying humanity",
    "Listen to previous episodes",
    "The news from a Mozambique landfill site",
    "Maggie Smith film that took 20 years to make to get premiere",
    "Subversive spirit shines through John Waters’ high-camp 80s musical",
    "The best games of 2023 so far",
    "French painter whose book about Picasso relationship became a bestseller",
    "10 ways to be more confident on dating apps",
    "Have you stopped washing your clothes or wash them less often?",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "The ultimate panacea – or wildly overhyped?",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Why it is time to embrace your quilt – without the guilt",
    "Why Jess McDonald quit her job – and decided to tell all",
    "What’s really changed 10 years after the Snowden revelations?",
    "How have you been affected by the Canada wildfires and the smoke in the US?",
    "Which brands are supporting Pride in the wake of backlash?",
    "A new system recasts gun violence as a public health concern. It’s saving lives",
    "Eight hours in witness box takes toll on Prince Harry",
    "A jubilee celebration and a grizzly bear",
    "Lunch mates and Brazilian beauty",
    "Icons shot by Richard Avedon in pictures",
    "Ukraine’s Kakhovka dam disaster",
    "Replastering Mali’s Great Mosque of Djenné",
    "Prince Harry at court and D-day ceremonies",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Multiple witnesses subpoenaed in Florida in Trump Mar-a-Lago case",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Lionel Messi spurns Barcelona and Saudi Arabia to join Inter Miami in MLS",
    "Tucker Carlson peddles conspiracy theories on Twitter debut from barn",
    "Chaos on frontlines as Ukraine war threatens to come home for Russia",
    "Mike Pence: ‘Trump asked me to choose him or the constitution - I chose the constitution’ – live",
    "Kakhovka dam flooding before and after: satellite images reveal extent of disaster in Ukraine",
    "Tina Turner to Cindy Crawford: icons shot by Richard Avedon – in pictures"
]