[
    "The Guardian - Back to home",
    "Supreme court Justices rule against fringe legal theory in key voting rights case",
    "US supreme court rejects conservative challenge to redistricting",
    "US subjects detainees to ‘cruel, inhuman and degrading’ treatment, UN says after visit",
    "President tells security staff they prevented civil war as Prigozhin lands in Belarus",
    "Heat dome Scorching temperatures in Texas expected to expand across US",
    "Current heatwave across US south made five times more likely by human-caused heating",
    "Suicide blamed on jail’s ‘negligence and misconduct’",
    "Wildfire carbon emissions hit record high in first six months of 2023",
    "US intelligence ignored warnings of violence, Senate panel finds",
    "Bedminster golf club tape casts doubt on ex-president's account of Iran document",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "Ralph Yarl speaks out on moment white man shot him for knocking on door",
    "Nuns and Native women heal polluted New York waters using kelp",
    "What happens to a people when their land disappears",
    "The organizers fighting voter suppression in the US south",
    "Republican executive blogged about ‘conversion therapy’ for extremist group",
    "UN says Russian forces have tortured and executed civilians in Ukraine",
    "Putin’s portrayal of response to uprising as a Kremlin win is proving a hard sell",
    "Leader confirms arrival of exiled Wagner chief Yevgeny Prigozhin",
    "Zelenskiy praises frontline advances ‘in all sectors’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Guardian readers’ best films of 2023 so far",
    "CIA experiments, Mormon ravers and reformed racists",
    "All you need to know about 2023’s hottest health topic, from causes to cures",
    "The Met celebrates New York public school artwork",
    "Jarvis Cocker, Colm Toíbín and more on the disturbing genius of Artangel",
    "How The Bear became America’s feelgood show of the summer",
    "How Jordan Lyles made a $50m career out of the art of losing",
    "‘People are like, Wow!’: the man trying to make condoms sexy",
    "Sign up to the US opinion email",
    "If Trump wins, he’ll turn the justice department into a vendetta machine",
    "He’s the world’s richest man. So why do we hear so little from Bernard Arnault?",
    "£3m to fix the UK’s housing crisis? Ha ha ha ha ha, your royal highness",
    "The car is king in the US – and pedestrian deaths are rising. Where is the outrage?",
    "Links to the KGB? Come on, guys. Lord Lebedev just wants to be a public servant",
    "WTA reveals ‘pathway to equal prize money’ for top-tier events",
    "Kane keen to join Bayern Munich after opening offer of $76m",
    "Alcohol ban at Paris Olympics does not apply to VIPs",
    "Survey finds 82% of female players experience pain in soccer cleats",
    "Hollywood buying into Alpine illustrates F1's strong health",
    "Rice waits for bigger Arsenal offer after Man City bid rejected",
    "Australian teenager makes history as first female to land 720",
    "2023 wildfires have released record 160m tonnes of carbon – and it's only June",
    "Swift parrot slowly losing critical habitat as Tasmania logs native forest",
    "Area the size of Switzerland was cleared from world’s most pristine rainforests in 2022",
    "The fight to save shoreline habitats from rising tides",
    "Republicans Ron DeSantis accused of ‘stupid’ move with timing of New Hampshire event",
    "Florida governor asks federal judge to dismiss Disney lawsuit against him",
    "Trump adviser suggested blowing up migrants’ boats with drones, book says",
    "Stickup man asks victim out via Facebook after robbery",
    "Kari Lake revives Obama birther conspiracy with no mention of donation to campaign",
    "Electric truck maker lauded by Trump as saving town files for bankruptcy",
    "Cleaner accidentally ruins decades of US college’s research by turning off freezer",
    "Trump valet arraignment in classified documents case delayed to July",
    "Family of veteran killed in 1973 New Orleans fire trying to recover remains",
    "Biden says US played no role in Russia’s Wagner mutiny",
    "Airport worker sucked into jet engine took his own life, authorities say",
    "Rome Outcry after tourist carves name on wall at Colosseum",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Singer cancels all tour dates to ‘adjust to impact’ of Tourette syndrome",
    "New Zealand boatshed sells for record $2m despite housing market crash",
    "Fifty tiger sharks filmed in feeding frenzy on humpback whale carcass",
    "Senior doctors vote to strike over pay",
    "Ex-UK PM breached rules over Daily Mail job, watchdog for MPs finds",
    "Kabuki actor arrested for allegedly assisting in his mother’s suicide",
    "Urgent action needed to protect ‘dying’ Kenyan domestic workers, say rights groups",
    "Olivia Chow wins election as Toronto's first Chinese-Canadian mayor",
    "Soaring number of rough sleepers in London ‘extremely alarming’",
    "What the Wagner mutiny means for Ukraine, Russia and Putin",
    "Listen to previous episodes",
    "Frederic Forrest, consummate character actor",
    "Tuppence Middleton on OCD, motherhood and playing Elizabeth Taylor",
    "Angela Bassett and Mel Brooks to receive honorary awards",
    "Watching the world change, almost overnight",
    "How Glastonbury champions south Asian music",
    "The story of Simple Minds’ classic album Empires and Dance",
    "I moved my date’s hand off my breast and he took it badly. Should I have said something instead?",
    "The surprising culinary advice of one of the world’s best chefs",
    "Aubergines with herb cream on sourdough",
    "Barbecue sides that will steal the show",
    "Yes, it’s another stupid TikTok craze",
    "The accidental pop art found in a dollar shop",
    "Facing extinction, Tuvalu considers the digital clone of a country",
    "Lebanon and Turkey step up deportations of Syrian refugees",
    "The London gig venue at the heart of the fight against gentrification",
    "The South African chef championing Zulu cuisine",
    "Bottlenose mothers use ‘baby-talk’ with their calves, recordings show",
    "Prigozhin crosses his Rubicon in echo of Caesar’s march on Rome",
    "Impersonators, wearable arms and Putin",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Inside three generations of Iranian female photography",
    "Winning and commended images",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘We could lose our status as a state’: what happens to a people when their land disappears",
    "US supreme court rejects conservative challenge to redistricting – live",
    "Electric truck maker lauded by Trump as saving Ohio town files for bankruptcy"
]