[
    "The Guardian - Back to home",
    "Turkey Polls close after record numbers vote",
    "Turkey elections: vote could end Recep Tayyip Erdoğan’s two decades in power",
    "CNN Trump debacle suggests media set to repeat 2016 mistakes",
    "Rage as he might at sexual abuse verdict, legal woes have only just begun",
    "Title 42  Calm prevails after migration restrictions lifted",
    "Title 42 Restrictions have ended, but Biden’s new policy is tougher",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "Republican presidential candidate downplays federal abortion ban",
    "Kyiv can defeat Russia by end of year with western help, Zelenskiy says",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric",
    "Boy, 13, saves sister by hitting potential kidnapper with slingshot",
    "Imran Khan accuses Pakistan’s military of ordering his arrest",
    "Climate crisis deniers target scientists for vicious abuse",
    "Newspaper apologises for hoax AI article about women’s use of fake tan",
    "Grizzlies suspend Ja Morant after second apparent gun video emerges",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "Timothy McVeigh and the rise of the Trumpist threat",
    "Trump debacle suggests TV media set to repeat mistakes of 2016",
    "Russia-Ukraine war: Zelenskiy heads to France to meet Macron after Germany visit",
    "Ukraine minister ‘confused’ about refusal to let Zelenskiy speak",
    "Russian troops fall back to ‘defensive positions’ near Bakhmut",
    "What we know on day 445 of the Russian invasion",
    "Why are the sexual needs of the bereaved still a taboo?",
    "Jason Sudeikis on Ted Lasso – and lessons in kindness",
    "‘We’ve created a system that can destroy us. That’s new’",
    "The UK home secretary who made her name with hardline anti-migration stance",
    "Ken Loach takes his last film to Cannes",
    "Why label dates don’t mean what you think",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Grizzlies suspend star after second apparent gun video emerges",
    "Gunners thrashed to leave City one win from title",
    "Rockies pitcher Feltner fractures skull after taking 93 mph line-drive to head",
    "Ajax’s match at Groningen abandoned amid smoke bombs and fan unrest",
    "Williams fired by Suns after second straight early playoff exit",
    "Gündogan’s ruthless genius is keeping the City machine in tune",
    "Gauff at crossroads after hitting first speed bumps",
    "The epic LeBron-Steph rivalry delivered again. Enjoy them while you can",
    "Sign up to the US opinion email",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "Big tech says it can boost productivity, but AI won’t solve meetings madness",
    "The culture of mistrust is bleeding into our personal lives. No wonder there’s a sex recession",
    "What a Czechoslovakian doll taught me about happiness – and its dark side",
    "More than 300,000 Syrian civilians died. Any attempt to rehabilitate Assad is utterly shameful",
    "Too tired to cook. Too easy to open a packet. It’s not our fault we eat junk",
    "When De Niro is having a child at 79, it’s time to cut older mothers some slack",
    "The wild continent of snow, ice and, increasingly, women",
    "Simon Schama on the broken relationship between humans and nature",
    "The Arctic islands where we can see the future of global heating",
    "Eurovision 2023 Sweden wins song contest in Liverpool with Loreen",
    "Eurovision TV review Peace, love and gloriously diverse chaos triumph",
    "Audience Eurovision 2023 most watched final in song contest’s history – BBC",
    "This year’s contest is most watched final in song contest’s history, says BBC",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "An intimate, uplifting star portrait",
    "The writing partners keeping music stars grounded",
    "The wild revolutionary politics of Eurovision",
    "Winnie & Nelson by Jonny Steinberg; The Plot to Save South Africa by Justice Malala – review",
    "I was a tiny cog in a machine of people all named vice-president of something",
    "Historic gay dating show is a queer summer treat",
    "The trouble with writing dystopian science fiction",
    "The universe moved when the Strokes were all together",
    "Should I worry about how long I spend sitting down?",
    "I only have three vices left: coffee, chocolate and salt",
    "Orvieto classico: the honeycomb Italian city",
    "Why it’s never too late to make close friends",
    "I really do love my kids – but being away from them is utter bliss",
    "My father is obese and I can’t stand being around him",
    "Teacher allegedly investigated for showing students film Strange World",
    "Florida governor secures endorsements on visit to Iowa in preparation for likely 2024 bid",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "Thirteen-year-old girl punches shark to escape attack",
    "Legal defense fund raises over $1m for accused in New York subway death",
    "Man kills girlfriend after she had an abortion in Colorado",
    "The food court building community in the city’s ‘doom loop’",
    "Latest arrests of protesters ‘feel like overreach’, experts say",
    "How America’s fatal gun attraction turned schools into war zones",
    "Governor ‘embarrassed’ by crowd’s behavior at Trump town hall",
    "Thousands evacuated as Cyclone Mocha makes landfall",
    "Ceasefire puts an end to five days of fighting that left dozens dead",
    "Thailand Election day arrives with hope of unseating junta",
    "Opposition parties take lead in election",
    "Could a diverse alliance end Recep Tayyip Erdoğan’s authoritarian rule?",
    "Disciples gathered to sing the old hymns. But are they a real threat to Rishi Sunak?",
    "Revealed: richer graduates in England will pay less for degree than poorer students",
    "Scientists criticise Nasa for scaling back mission to explore beyond Pluto",
    "Congress party defeats Narendra Modi’s BJP in Karnataka state elections",
    "Single-use vapes sparking surge in fires at UK waste plants",
    "Young Thais look to Pita Limjaroenrat to bust military-royalist grip on power",
    "How Donald Trump was found liable for sexual abuse",
    "Florida teachers besieged by draconian laws",
    "The Mexican city torn apart by cartel kidnappings",
    "Ukraine’s 2016 Eurovision winner Jamala on why Putin fears her people, the Tatars",
    "The world’s oldest dog and uphill sprinting",
    "Memories of meals gone by – in pictures",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "DNA evidence reveals family man in Australia was teenage killer who escaped Nebraska jail",
    "Erdoğan’s grip on power tested as Turkey votes in pivotal election",
    "Turkey elections live: vote could end Recep Tayyip Erdoğan’s two decades in power",
    "Trump rages after sexual abuse verdict but legal woes have only just begun",
    "‘I miss the sex’: Why are the sexual needs of the bereaved still a taboo?",
    "Arsenal 0-3 Brighton: Premier League – as it happened",
    "Florida teacher allegedly investigated for showing students film Strange World",
    "This is how we do it: ‘A tired, throwaway midweek shag doesn’t interest me’"
]