[
    "The Guardian - Back to home",
    "Debt default crisis McCarthy says deal is in reach",
    "Analysis Cancelled summit is self-inflicted blow to US standing",
    "Explained What will happen if debt ceiling isn't raised?",
    "Debt ceiling crisis: Biden says he is ‘confident’ US will reach deal and avoid default – live",
    "World likely to breach 1.5C climate threshold by 2027, scientists warn",
    "Anti-abortion movement How mifepristone became a target",
    "Explainer Where does the lawsuit against mifepristone stand?",
    "Conservative judges hear challenge to abortion pill access in controversial lawsuit",
    "Couple in near catastrophic car chase with paparazzi, spokesperson says",
    "Naomi Klein investigates ‘conspiracy theory culture’ that has shaken her life",
    "Man sues Trump adviser for false arrest after ‘pat’ on back led to assault charge",
    "Blow to DeSantis as Democrat wins Jacksonville mayor’s race",
    "Devastating floods claim lives and leave thousands homeless",
    "Allies attempt to undermine prosecutors endangering 2024 bid",
    "Kyiv tells China it will not accept any peace plan involving loss of land to Russia",
    "Missing girl featured in Netflix series Unsolved Mysteries found",
    "US cyclist who taunted fascist group wins plaudits",
    "The Texas Democrat fighting for gun control and abortion rights",
    "Digital scan of Titanic wreck could reveal its secrets",
    "Somaliland women smell success as frankincense business takes off",
    "What we know on day 448 of the invasion",
    "Beijing tells foreign embassies to remove ‘politicised propaganda’",
    "UK and Netherlands agree ‘international coalition’ to help Ukraine",
    "Von der Leyen steps up calls for tribunal for Russia’s ‘crime of aggression’",
    "They moved to a Buddhist retreat in rural America. Have they found happiness?",
    "Why are rightwingers melting down over Miller Lite?",
    "Steve McQueen’s moving meditation on wartime Amsterdam",
    "How Israel uses water to control the West Bank",
    "How Irish author Katriona O’Sullivan escaped her fate",
    "Inside the women’s US soccer league",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The fall of Rudy Giuliani, once the toast of New York, continues unabated",
    "I took my kids to the playground without bringing my phone – and it was a revelation",
    "I left my party lifestyle behind for a week in a nunnery – and began to see the light",
    "Vice is going bankrupt, BuzzFeed News is dead. What does it mean?",
    "No one has accepted real responsibility for the East Palestine disaster",
    "The San Antonio Spurs won the draft lottery. So did Victor Wembanyama",
    "NBA San Antonio win lottery for ‘once-in-a-millennium’ prospect",
    "Power lies with two superteams. But that’s not necessarily a bad thing",
    "Hamilton backs decision to cancel flood-hit Emilia Romagna GP",
    "Off-key Djokovic bundled out of Italian Open by Rune",
    "GZA hosts unlikely crossover in Melbourne",
    "Inter’s success built on depth and defensive resilience",
    "Nuggets’ Jokić sinks Lakers with 34-21-14 triple-double in West finals opener",
    "Geoghegan Hart crashes out of race on slippery stage",
    "Climate breakdown made southern Asia heatwave at least 2C hotter, study finds",
    "Pollution could be slashed by 80% by 2040, UN says",
    "EPA finally wakes up with stiff new climate rules",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "Has Ukraine’s spring offensive begun?",
    "Listen to previous episodes",
    "Strange Way of Life review Pedro Pascal and Ethan Hawke sizzle in Almodóvar’s queer cowboy short",
    "Anselm review Wim Wenders’ reverent 3D portrait of artist Anselm Kiefer",
    "Tiger Stripes review Coming-of-age body horror releases the monster inside",
    "Johnny Depp on comeback trail amid criticism of festival organisers",
    "Navajo cowboys impersonating John Wayne: Roswell Angier’s best photograph",
    "Stupidly entertaining sequel offers more of the same",
    "A first-ever look at the making of the Rorschach test",
    "AI’s terrible attempt to write TV",
    "Pop star beats second lawsuit over Thinking Out Loud and Let’s Get It On",
    "Judy Blume’s classic pre-teen tale retold",
    "Patricia Arquette’s comedy is so jampacked it’s exhausting",
    "The rediscovery of Soda Stereo, Argentina’s biggest band",
    "Cannes jury president Ruben Östlund opens ‘wild’ festival",
    "A brutal attack ended my dreams of being a boxer – but I found a new passion",
    "Cracking modular PC gets all-round upgrade",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "Gucci show reaffirms Seoul’s status as capital of pop culture",
    "Recipe for apricots with French toast and pistachio mascarpone",
    "How Jennifer Hosten became the first Black Miss World – and an international diplomat",
    "Law aims to stop funding of illegal Israeli settlements in West Bank",
    "School district sued for violating first amendment rights with book bans",
    "Intruder at home of Biden adviser bypassed Secret Service agents",
    "Alligator relaxes at Alabama beach",
    "Trump wins proxy battle with DeSantis over governor pick",
    "YouTube found to push content about guns to children watching games videos",
    "I will tweet what I want even if it loses me money",
    "Oldest serving senator says she ‘hasn’t been gone’ despite absence",
    "Court rules Elizabeth Holmes must go to prison while she appeals sentence",
    "Police seek assailant who severed homeless man’s hand with sword",
    "Embattled president dissolves congress in bid to avoid impeachment",
    "Comedy firm fined $2m over standup’s stray dog joke",
    "Former world leaders urge G7 to get nuclear arms control back on track",
    "Nicolas Sarkozy must wear electronic tag, appeals court rules",
    "Spanish climber, 84, injured in bid to be oldest to scale world’s 14 highest peaks",
    "Slovakia on brink of blocking legal recognition for trans people",
    "Five go on trial over alleged far-right coup plot",
    "Cash machine gangs broken up with 14 arrests",
    "Malawi’s Rastafarian children return to school after ban is lifted",
    "Nepali sherpa scales highest peak for record 27th time",
    "This 9/11 suspect and ‘torture prop’ has been there 20 years. Is he nearing a deal with the US?",
    "Quest to save family plot of land led from Guatemala to death at US border",
    "Could Guyana’s Exxon ruling scare big oil off risky exploration?",
    "Can TV drama end legal woes of Egypt’s bereaved?",
    "The primeval plants getting rarer – and harder to protect",
    "Poles divided over John Paul II abuse cover-up claims",
    "Cannes glitterati and peregrine chicks",
    "A selection of the winning images",
    "Female photographers from the Islamic world",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Prince Harry and Meghan in ‘near catastrophic car chase with paparazzi’",
    "Women drinking beer clothed: why are rightwingers melting down over Miller Lite?",
    "‘You wear Walmart khakis’: US cyclist who taunted fascist group wins plaudits",
    "Florida: blow to DeSantis as Democrat wins Jacksonville mayor’s race",
    "Trump’s allies attempt to undermine prosecutors endangering his 2024 bid",
    "Missing Illinois girl featured in Netflix series Unsolved Mysteries found",
    "Dianne Feinstein: oldest serving senator says she ‘hasn’t been gone’ despite absence"
]