[
    "The Guardian - Back to home",
    "Titanic sub search ‘Underwater noises’ picked up by Canadian plane, Coast Guard says",
    "‘How dangerous the ocean can be’ Canadian city rallies for Titan rescue",
    "First Thing Underwater noises detected by Canadian aircraft",
    "Titanic sub: no sign of vessel as search continues but ‘banging noises’ heard, says US Coast Guard",
    "China State is most dangerous to its own citizens’ civil rights, report finds",
    "China hits back as Joe Biden calls Xi Jinping a‘dictator’",
    "Church leaders never contacted victim New Orleans priest confessed to abusing",
    "Russia-Ukraine war: ‘Russia must pay for the destruction they’ve inflicted,’ says Sunak",
    "One in five women conceive naturally after having baby via fertility treatment",
    "Bolsonaro may face ban on running for office in 2026",
    "Benzene levels emitted above secondhand smoke, US study finds",
    "Judge strikes down state ban on gender-affirming care for transgender minors",
    "Britain is embracing switch to refillable water bottles, say campaigners",
    "Culinary craze of stir-fried stones rocks the internet",
    "A toxic metal is in a US city’s air – and may be harming children’s brains",
    "New electric cars won’t have it. Now rightwingers claim political sabotage",
    "US looks to Narenda Modi’s visit to counter China",
    "Americans dread restart of student loan payments",
    "Billionaires and the Titanic The allure of extreme expeditions",
    "Canadian city rallies for Titan rescue",
    "An online publisher creates a Juggernaut",
    "How to join the no-wash revolution",
    "Joanna Lumley on acting, travel – and her hatred of sex scenes",
    "10 ways to be much more body-confident",
    "Secret Invasion – the scenes between Olivia Colman and Samuel L Jackson are just glorious",
    "Glastonbury 2023 prepares to open gates",
    "France tells its 37m visitors where to go",
    "Ukraine has made west more united than ever, president tells London conference",
    "What we know on day 483 of the invasion",
    "Extra $6bn in arms for Ukraine after ‘accounting error’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The right believes the FBI is obsessed with jailing Trump. The opposite is true",
    "A bit Caribbean, a bit British. We millennials owe it to the Windrush generation to embrace both",
    "Americans are hungry to be part of unions. So why is US labor so timid?",
    "What do women really want? A mild-mannered, squishy-centred man",
    "‘A green transition that leaves no one behind’: world leaders release open letter",
    "There’s only one way to tackle Britain’s mortgage meltdown – get the banks to cough up",
    "Miami police investigating alleged assault involving Dolphins star",
    "At 43, star prepares for 24th Wimbledon after receiving wildcard",
    "Chelsea confirm Kanté will join Saudi Arabian club Al-Ittihad",
    "$60m a year Messi set to make debut on 21 July",
    "Paul discovered he had been traded in text from 14-year-old son",
    "I wasn’t shocked by the racist abuse of Vinícius",
    "French police search Games HQ in Paris",
    "Australia beat old rivals England in thrilling series opener",
    "Historical youth-led climate trial ends",
    "Country to shut down climate protest group citing public safety risks",
    "Debt relief urgent for poor countries hit by climate shocks, says IMF chief",
    "Rewetting England’s lowland peat could help meet emissions target, says study",
    "Largest study in decades upends myths",
    "Hunter Biden investigation What to know and what it means",
    "President's son to plead guilty to misdemeanor tax charges",
    "New Orleans archdiocese concealed serial child molester for years",
    "Bernie Sanders launches investigation into working conditions",
    "Republican’s non-profit paid PR firm that also represents her for-profit work",
    "Search for missing actor scaled back",
    "Three men including ex-NYPD officer convicted of harassing Chinese exile",
    "Texas lawmaker will ‘carry out’ duties in husband’s impeachment trial",
    "Ex-president to face trial in mid-August over classified documents charges",
    "Gay rights are going backwards in the US, says Elton John",
    "Forty-one women killed in Honduras prison riot",
    "Teachers at kindergarten accused of drugging children",
    "Macron and world leaders call on private finance to help reduce global poverty",
    "Iceland suspends annual hunt in move that likely spells end to controversial practice",
    "Privacy trial judge asks why ex-tabloid editor has not given evidence",
    "At least four people killed by Palestinian gunman",
    "Legendary site of dictator’s murder now open to Rome tourists",
    "Three more bodies found by authorities after shipwreck",
    "Tabloid Bild to replace range of editorial jobs with AI",
    "Dame Sally Davies apologises to Covid bereaved in emotional hearing",
    "Held v Montana: the young people fighting for the climate in court",
    "Listen to previous episodes",
    "Pharrell Williams hits Paris catwalk with Louis Vuitton menswear debut",
    "Has France treated Françoise Gilot worse than Picasso did?",
    "The eternal flame of The Wicker Man soundtrack",
    "Harry Gesner’s California creation up for sale",
    "Apple TV+ remake of sci-fi classic Metropolis cancelled",
    "The composer who wrote a concerto during 12 lots of chemo",
    "I am 25 and have never been kissed. Have I missed my chance?",
    "'I talked a man out of jumping off a bridge – and it made me confront a harsh reality'",
    "On the trail of the UK’s ancient stones",
    "How I found joy in life without children of my own",
    "The Nordic countries on a budget – send us a tip and you could win a holiday voucher",
    "Recipe for roast carrots, garlic and orzo",
    "Kenyan rape survivors find help hard to find",
    "After a cash grab and a brutal blackout, will it ever be the same?",
    "Why mosses are superheroes of the plant world",
    "How he became a weapon in Reddit’s civil war",
    "Celebrities are smoking again",
    "Summer solstice 2023 celebrations",
    "Protest in Gaza and cyclone in Brazil",
    "Beach bodies in 1970s Los Angeles",
    "Archives of the Windrush generation",
    "The human costs of Iraq’s oil",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "The new nude: collapsing bodies – in pictures",
    "Titanic sub search: underwater noises picked up by Canadian plane, US Coast Guard says",
    "Explorers Club speaks of ‘cause for hope’ in Titanic sub search – as it happened",
    "Republicans crying wolf over Hunter Biden have hurt their own cause",
    "‘Political provocation’: China hits back as Biden calls Xi ‘dictator’",
    "Who’s unhoused in California? Largest study in decades upends myths",
    "‘We all had to take our tops off’: Joanna Lumley on acting, travel – and her hatred of sex scenes",
    "Canada is on fire, and big oil is the arsonist"
]