[
    "The Guardian - Back to home",
    "Trump Indictment over classified documents unsealed",
    "'Defend our movement' Trump uses legal woes to plead for money",
    "Explainer What do the charges mean and what’s next?",
    "Three scenes that sum up the classified documents case against the former president",
    "Nuclear weapon secrets in the bathroom Five revelations from Trump’s unsealed indictment",
    "Who is the judge assigned in Trump’s Mar-a-Lago case?",
    "'Coward' Labour criticises Johnson for quitting to avoid byelection",
    "Johnson’s resignation statement What he really meant",
    "‘Party’s over, Boris’ What the UK papers say about Johnson’s resignation",
    "Tory MP joins Boris Johnson and Nadine Dorries in resigning with immediate effect",
    "Denver 108-95 Miami Hunter Felt's rolling report of Game 4",
    "Nuggets on brink of first title after Game 4 win over Heat",
    "EPA sued over pesticide-coated seeds’ ‘devastating impacts’ on US wildlife",
    "'Miracle' children found alive 40 days after Amazon jungle plane crash",
    "Greta Thunberg takes part in her last school strike for climate",
    "Shooting leaves nine wounded after ‘targeted’ incident",
    "California family finds over 1m copper pennies",
    "South Carolina woman shops passenger to police with silent message",
    "Dutch town tells nude sunbathers to put a lid on lust",
    "What’s happening with US student loan relief and the payment pause?",
    "Reversal of social media guardrails could prove disastrous for 2024 elections",
    "What’s behind John Roberts’s surprise supreme court voting rights ruling?",
    "How some US cities are trying to keep roofs over people’s heads",
    "Living my life was more important than being in movies",
    "The people who sell images of their unlikely body parts online",
    "Four ‘miracle’ child survival stories",
    "I re-read my teenage diaries hoping for a dose of nostalgia – instead I was horrified",
    "How to avoid a civil war, by the man who predicted Trump",
    "I guessed she was Canadian – she’s from Glasgow",
    "Dubai hotelier launches £10k-an-hour ‘party jet’",
    "From Gellhorn to Abramson, the women who changed US journalism",
    "Ukraine war live: Ukraine has penetrated Russian lines in some areas, says UK",
    "Exiled Russians dare to dream of Putin’s fall",
    "Mercenaries accused of stoking ‘anarchy’ on Russia’s frontlines",
    "What we know on day 472 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Impunity is Putin’s middle name. Now he must pay for his crimes",
    "It took me a long time, but I’ve finally fallen in love with being gay",
    "Trump once led chants of ‘lock her up’. Now he’s been indicted on seven counts",
    "The charges mount, but Trump’s not worried. He’s just the guy to make jail great again",
    "After the destruction of the Kakhovka dam, another threat lies on Ukraine’s horizon: Donald Trump",
    "French Open Alcaraz admits semi-final cramps were caused by nerves",
    "Iga Swiatek v Karolina Muchova: French Open women’s singles final",
    "Nuggets move to brink of team’s first title after Game 4 win over Heat",
    "Udonis Haslem is Miami's doyen of grit and keeper of the flame",
    "Jack Grealish From meh man to a main man at Manchester City",
    "Internazionale Inzaghi targets ‘writing a page of history’",
    "Manchester City’s odyssey from Dickov to the brink of immortality",
    "Taylor and López out to jump-start stalled ascents in Garden scrap",
    "Girma and Kipyegon set world records at Paris Diamond League",
    "49ers' investment arm taking over English club after relegation",
    "Soccer, golf … will the NBA and NFL be next?",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "Anger and anxiety as DeSantis’s asylum-seeker flights return to US skies",
    "A man with dwarfism says he went to police after a sexual assault. The case went nowhere",
    "Outcry as Texas to install ‘buoy barrier’ in Rio Grande to deter border crossings",
    "St Louis Catholic archdiocese to pay $1m to settle sexual abuse lawsuit",
    "Wildfire smoke brings climate crisis home to Americans",
    "Surprise US supreme court ruling could help Democrats take House",
    "12m Americans believe violence is justified to restore Trump to power",
    "Facebook owner to push ahead with plans to launch Twitter rival",
    "Hotel workers vote to authorize strike in California",
    "Mercedes-Benz beats Tesla for approval of automated driving tech",
    "Wildlife-rich rainforest being planted in Devon in UK",
    "Official investigating Chinese election ‘meddling’ resigns abruptly",
    "Smoke from Canadian blazes hits Norway and flows to southern Europe",
    "Government ‘fanning culture war’ over free speech, says UK’s first LGBTQ+ history professor",
    "Annecy attack: man handed preliminary attempted murder charges",
    "Special forces storm Turkish cargo ship after attempted hijack",
    "President and ELN guerrillas agree six-month ceasefire",
    "Nine killed in attack by al-Shabaab in Mogadishu",
    "Hero who saved hundreds of children dies aged 61",
    "Parts of volcano ‘stretched nearly to breaking point’, study finds",
    "‘I was told I’d never not be Ron Swanson’",
    "I’m just cruel. What can I tell you?",
    "One to watch: Ezra Williams",
    "A tame attempt at manufacturing outrage",
    "I’m demoralised about the landscape of fashion",
    "Tove Jansson’s unseen sketches to go on show in Paris",
    "Mel B: ‘I’ve still got PTSD. Abuse never really leaves you’",
    "David del Rosario Dávila’s best phone picture",
    "Picnic and camping recipes",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "Why dressing for dinner out is my favourite kind of look",
    "If it follows six rules, perhaps",
    "Survive the smoke-pocalypse Californians advise New Yorkers",
    "A visual guide to the Canada blazes and US smoke pollution",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Germans the best in Europe, finds poll. Italians? Not so much",
    "Why you still can’t buy wine in New York supermarkets",
    "Annecy locals try to make sense of knife attack on children",
    "Republicans turn on their own in attorney general impeachment scandal",
    "The week around the world in 20 pictures",
    "Gigantic rubber ducks and the first AI sculpture",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Three months ago, this wasn’t possible’: exiled Russians dare to dream of Putin’s fall",
    "‘Help me’: South Carolina woman shops passenger to police with silent message",
    "Donald Trump uses his legal woes to plead for money from supporters – again",
    "Russia-Ukraine war live: Kyiv reports advances as UK says Russian lines breached in some areas",
    "Nuclear weapon secrets in the bathroom: five revelations from Trump’s unsealed indictment",
    "A million good lucks: California family finds over 1m copper pennies",
    "Colombian ‘miracle’ children found alive 40 days after Amazon jungle plane crash",
    "Lawyer for Trump valet in Mar-a-Lago documents case alleges misconduct",
    "Who is Aileen Cannon, the judge assigned in Trump’s Mar-a-Lago case?"
]