[
    "The Guardian - Back to home",
    "Turkey elections 2023 Latest presidential and parliamentary results",
    "Analysis Could a diverse alliance end Erdoğan’s authoritarian rule?",
    "Vote could go to second round as Erdoğan attempts to claim victory",
    "Full story Ukrainian president to meet UK PM in London",
    "Russia-Ukraine war: Zelenskiy to meet Sunak in London",
    "Republicans Senator called ‘profoundly ignorant man’ over Mexico remarks",
    "Title 42 Restrictions have ended, but new policy is tougher",
    "Crossings reportedly decrease after Title 42 rules scrapped",
    "Republican presidential candidate downplays federal abortion ban",
    "Beijing jails US citizen for life on espionage charges",
    "Talking to babies may help shape brain structure, research finds",
    "Thailand’s Move Forward party begins talks after voters reject military rule",
    "Firm apologizes after refusing rental car to Puerto Rican customer",
    "President Lukashenko misses another event prompting speculation of illness",
    "Mem Fox book Guess What? banned in county under Ron DeSantis bill",
    "Not having cellphone allowed boy to save runaway bus from crashing",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "Serbians wary of president’s gun pledge",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "‘I try to explain the meaning of this Russian fascism’",
    "Kyiv can defeat Russia by end of year with western help, president says",
    "Throwing a Eurovision viewing party in Kyiv",
    "What we know on day 446 of the invasion",
    "Why Trump’s ‘vile’ attacks against Carroll after verdict could be ‘chilling for survivors’",
    "Why are so many young Americans adopting fake British accents?",
    "The Daily Show’s Roy Wood Jr on making the other side laugh",
    "The best mid-range phone gets even better",
    "Buffalo grieves mass shooting one year on",
    "Matilda’s Mara Wilson on the price of fame",
    "Guardian Today US: Get the headlines & more in a daily email",
    "NBA Tatum’s Game 7-record 51 points power Celtics into Eastern Conference finals",
    "Will Jokić halt LeBron’s title ambitions?",
    "Grizzlies suspend star after second apparent gun video emerges",
    "Arsenal losing the league does not have to be a collapse of character",
    "10 talking points from the weekend’s action",
    "Rockies pitcher Feltner fractures skull after taking 93 mph line-drive to head",
    "Lewandowski fires Barça to title but invoke Espanyol fans’ wrath",
    "I couldn’t handle the pressure",
    "Williams fired by Suns after second straight early playoff exit",
    "Gauff at crossroads after hitting first speed bumps",
    "Sign up to the US opinion email",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "Big tech says it can boost productivity, but AI won’t solve meetings madness",
    "To my friend who worries about becoming a parent: here are some things to hold on to",
    "Our children are gay and proudly African: a mother’s plea to a president",
    "The culture of mistrust is bleeding into our personal lives. No wonder there’s a sex recession",
    "What a Czechoslovakian doll taught me about happiness – and its dark side",
    "More than 300,000 Syrian civilians died. Any attempt to rehabilitate Assad is utterly shameful",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Is the UK in the grip of ‘greedflation’?",
    "Listen to previous episodes",
    "Fear and loathing in Hollywood",
    "US supreme court pursuing rightwing agenda via ‘shadow docket’, book says",
    "Eurovision Sweden wins song contest in Liverpool with Loreen",
    "Review Peace, love and gloriously diverse chaos triumph",
    "Audience Eurovision 2023 most watched final in song contest’s history",
    "This year’s contest is most watched final in song contest’s history, says BBC",
    "The artists pushing the boundaries of AI",
    "The devastating plight of LGBTQ asylum seekers",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "Ken Loach takes his last film to Cannes",
    "An intimate, uplifting star portrait",
    "The writing partners keeping music stars grounded",
    "The wild revolutionary politics of Eurovision",
    "Winnie & Nelson by Jonny Steinberg; The Plot to Save South Africa by Justice Malala – review",
    "I embraced being single and became an international pet-sitter",
    "Should I worry about how long I spend sitting down?",
    "Why are the sexual needs of the bereaved still a taboo?",
    "I only have three vices left: coffee, chocolate and salt",
    "Orvieto classico: the honeycomb Italian city",
    "Why it’s never too late to make close friends",
    "Boy, 13, saves sister by hitting potential kidnapper with slingshot",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric",
    "Teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Rightwing US senator to give virtual speech at conservative UK conference",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "Thirteen-year-old girl punches shark to escape attack",
    "Legal defense fund raises over $1m for accused in New York subway death",
    "Man kills girlfriend after she had an abortion in Colorado",
    "The food court building community in the city’s ‘doom loop’",
    "Imran Khan accuses Pakistan’s military of ordering his arrest",
    "Ceasefire puts an end to five days of fighting that left dozens dead",
    "Thousands evacuated as Cyclone Mocha makes landfall",
    "Newspaper apologises for hoax AI article about women’s use of fake tan",
    "Shipwreck found off Tasmanian coast brings closure to 50-year mystery",
    "Disciples gathered to sing the old hymns. But are they a real threat to Rishi Sunak?",
    "Revealed: richer graduates in England will pay less for degree than poorer students",
    "Scientists criticise Nasa for scaling back mission to explore beyond Pluto",
    "Congress party defeats Narendra Modi’s BJP in Karnataka state elections",
    "Single-use vapes sparking surge in fires at UK waste plants",
    "Tell us: how do you feel about your smartphone use?",
    "How Donald Trump was found liable for sexual abuse",
    "Florida teachers besieged by draconian laws",
    "The Mexican city torn apart by cartel kidnappings",
    "The world’s oldest dog and uphill sprinting",
    "Memories of meals gone by – in pictures",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Florida teacher defends showing Disney movie: ‘I’m just being accepting’",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "Not having cellphone allowed US boy to save runaway bus from crashing",
    "DNA evidence reveals family man in Australia was teenage killer who escaped Nebraska jail",
    "A new start after 60: I embraced being single and became an international pet-sitter",
    "China’s war chest: Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "Mem Fox book Guess What? banned in Florida county under Ron DeSantis bill"
]