[
    "The Guardian - Back to home",
    "Texas mall shooting Family and friends identify victims as investigation continues",
    "Victims Grade-school sisters and young engineer killed",
    "‘Like living in a war zone’ Guns ingrained in Texas towns like Allen",
    "‘Gun-loving’ ex-US army officer calls for gun control after witnessing mall shooting",
    "US on track to set record in 2023 for mass killings after series of shootings",
    "What’s at stake for Florida as legal tug-of-war ramps up?",
    "Governor signs bill allowing teachers to ignore students’ pronouns",
    "Russia-Ukraine war: Moscow marks Victory Day with parade after wave of strikes across Ukraine",
    "Police charge suspect with manslaughter after eight killed",
    "Apple co-founder warns AI could make it harder to spot scams",
    "US lawmakers consider getting rid of borrowing limit as crisis looms",
    "Many soft contact lenses in US made up of PFAS, research suggests",
    "Israel bombs Gaza Strip, killing three Islamic Jihad leaders and leaving nine civilians dead",
    "Game of Thrones prequel paused as strike continues",
    "JR Moehringer, ghostwriter of Spare, says they bonded over media intrusion",
    "LinkedIn to cut 716 jobs and shut down Chinese app InCareer",
    "Gang violence could end open cannabis trade in anarchist commune Christiania",
    "King ‘left squirming’ in Rwanda row with Johnson, claims former press chief",
    "Ukrainian soldiers struggle with post-traumatic stress",
    "What we know on day 440 of the invasion",
    "Russia evacuates more than 1,600 from town",
    "Cities unite on live stream for Rave UKraine events",
    "My face burned and my memory disappeared. Here is how I made it back",
    "On the trail of the Dark Avenger: the most dangerous virus writer in the world",
    "The politician touted as future of Turkish democracy",
    "Brian Tyree Henry rises above lackluster FBI drama",
    "California’s plan for its Black residents: what you need to know",
    "Will psychedelic drugs transform mental health treatment?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "‘Every part of my being believes I can run faster’",
    "Ryan Reynolds wants to expand his sports empire. Will Snoop stop him?",
    "Real Madrid v Manchester City feels like a final as two dominant teams meet",
    "Nottingham Forest 4-3 Southampton Awoniyi double boosts hosts’ survival hopes",
    "Brighton 1-5 Everton Rout eases Toffees' relegation fears",
    "Drivers slam Miami GP’s showbiz introductions as ‘distracting’",
    "Suns owner does not want Jokic banned after shove during game",
    "Women’s race sorry for food processor prize",
    "Another weekend of death at the Kentucky Derby but don’t expect change",
    "Sabalenka shines in Madrid but women players put in shade",
    "Sign up to the US opinion email",
    "AI machines aren’t ‘hallucinating’. But their makers are",
    "Could an ‘emotional support’ chatbot help me de-stress? Only one way to find out",
    "As the Ukraine war grinds on, Russia is becoming a cultural wasteland",
    "I bought an urn for $30 to put my dad’s ashes in, but had to remove the original inhabitant first",
    "Nepo babies have never been bigger. So why are the Windsors and the Roys so unhappy?",
    "Britain is changing – the idea of Tories and royals as our natural rulers is gone",
    "In new battle for the Pacific, US and China force regional states to take sides",
    "‘Mind-boggling’ methane emissions from Turkmenistan revealed",
    "Frogs croak at a higher pitch due to global heating",
    "Country records highest ever temperature of 44.1C",
    "Why ‘godfather of AI’ Geoffrey Hinton thinks humanity is at a crossroads",
    "Listen to previous episodes",
    "The strange story of Clarence and Ginni Thomas",
    "An underwater kingdom for enslaved people who died in the Atlantic",
    "Film revives memories of girl’s death as country reviews abortion rules",
    "Prequel paused as Hollywood writers’ strike continues",
    "Why Native history is American history",
    "IRA man and British soldier lock horns in Troubles revenge drama",
    "The awesome mind of rapper Billy Woods",
    "US man returns antiquities after reading Guardian report on looted relics",
    "The photographer detoxifying the nude",
    "How to cook a share-house dinner",
    "Flaps the dog gave me a nasty bite – but I kept quiet to save his life",
    "The British delicacy that doesn’t exist – but absolutely should",
    "Why color is in the eye of the beholder",
    "Mark Zuckerberg joins Tom Hardy on list of famous Brazilian jiu-jitsu fighters",
    "Ex-president is ‘nonstop’ liar who destroyed E Jean Carroll’s reputation, jury hears",
    "Winners include Hernan Diaz, New York Times and AP",
    "US truck drivers push for better working conditions",
    "Family criticizes marine veteran for not offering apology",
    "Man wrongly convicted of rape released after 29 years in prison",
    "A California town feels ignored months after flood",
    "Alarm after lawyer who aided Trump’s 2020 election lie attacks campus voting",
    "US proposes rules requiring airlines to compensate passengers for flight delays",
    "Democrat urges Justice Roberts to act over Clarence Thomas’s ‘tangled web’",
    "White House prepares for possible charges",
    "Ottawa expels Chinese diplomat for alleged intimidation of lawmaker",
    "Australian MPs urge US ambassador to end extradition bid",
    "India At least 22 dead after tourist boat overturns in Kerala state",
    "Horrific stories emerge as thousands flee ethnic violence in north-east",
    "Beijing to expel Canadian consul in tit for tat move after Ottawa expels Chinese diplomat",
    "EU urged to tighten spyware safeguards in wake of Pegasus revelations",
    "Schools in crisis as teachers and students flee ‘toxic’ political climate",
    "Simple measures could save 1 million babies a year, doctors plead",
    "Child missing in cave as country hit by heavy rain and flooding",
    "China targets foreign consulting companies in anti-spying raids",
    "Citizens march in silent protest against gun violence after last week’s shootings",
    "Saudi family urges US to intervene in teens’ possible death sentence",
    "Dust cloud discovered around one of sky’s brightest stars",
    "Who is behind a string of grisly cow deaths?",
    "Harpooning can be agonising two-hour death, Icelandic report finds",
    "The toll of caring for loved ones with dementia",
    "Big lunch, a skater-dog and Tom Cruise",
    "Yardworks urban art and graffiti festival 2023",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "First Thing: Ted Cruz faces backlash after deadly Texas mall shooting",
    "‘So improbable, it’s a novel’: the strange story of Clarence and Ginni Thomas",
    "Russia-Ukraine war live: Moscow marks Victory Day with parade after wave of strikes across Ukraine",
    "‘Gun-loving’ ex-US army officer calls for gun control after witnessing Texas mall shooting",
    "Struck by lightning, my face burned and my memory disappeared. Here is how I made it back",
    "Disney v DeSantis: what’s at stake for Florida as legal tug-of-war ramps up?",
    "From the Deep: an underwater kingdom for enslaved people who died in the Atlantic",
    "The pet I’ll never forget: Flaps the dog gave me a nasty bite – but I kept quiet to save his life"
]