[
    "The Guardian - Back to home",
    "Texas Record-setting heat sends hundreds of people to emergency rooms",
    "Climate crisis Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Renewable energy Solar helps Texas carry energy load as heatwave puts power grid to test",
    "Texas heatwave blamed for 13 deaths as scorching temperatures and smoke spread across US",
    "General who may have known about Wagner mutiny goes missing",
    "Debris returned to land after fatal implosion",
    "Yusef Salaam declares victory in city council primary",
    "Joshua Trees win long term protection in environmental victory",
    "Law passed allowing abortion only when woman’s life is at risk",
    "Singer's tour postponed after suffering ‘serious’ bacterial infection",
    "Police station attacked as search continues for 14 missing employees",
    "Taylor Swift, Ke Huy Quan, Paul Mescal among those invited to join the Academy",
    "Nasa aims to mine resources on moon in next decade",
    "Why are sea lions and dolphins dying along California’s coast?",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are US retail workers being denied chairs?",
    "Manuscript sheds new light on creation of Capote’s In Cold Blood",
    "Four children among 11 killed in missile strike on pizza restaurant",
    "Defence minister expects Nato ‘guarantee’ after war",
    "Alliance ready to face threat from ‘Moscow or Minsk’",
    "US targets mercenary force by sanctioning gold companies suspected of funding it",
    "Guardian Today US: Get the headlines & more in a daily email",
    "What does it mean to be intersex?",
    "10 ways to be much more confident at parties",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Meghan and Harry’s trainwreck podcast career",
    "AFC Croydon responds to new owners Stormzy and Zaha",
    "Mike Figgis on Julian Sands",
    "Frederic Forrest, consummate character actor",
    "The married couple competing to have the biggest and best facial hair",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Everything has turned grey – cars, clothes, kitchens, carpets. I can’t take it any more",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "The key to wedded bliss is a joint bank account? I don’t buy it",
    "South Korea has turned back time and made its people younger – sign me up",
    "Tour de France 2023 Stage-by-stage guide",
    "Mäder’s death prompts new Tour de France safety calls",
    "Brittney Griner’s triumphant return to the WNBA",
    "Declan Rice Arsenal finalize $133.3m deal after City pull out",
    "How good are Brazil and how far can they go?",
    "Tennessee State to become first HBCU to add ice hockey",
    "Gymnast returns for first meet since 2020 Tokyo Olympics",
    "Ohtani becomes sixth with two homers and 10 strikeouts since 1893",
    "Saudi leader trying to avoid ‘pariah’ status with LIV-PGA merger, says campaigner",
    "Former NFL quarterback dies in apparent drowning aged 35",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "Donald Trump Former president sues E Jean Carroll for defamation over rape comments",
    "Trump trial could be delayed until spring 2024",
    "Highest-ranking trans elected official in US to run for Congress",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "US paramedic saves lives of two people in one family",
    "Airbnb to offer pink Malibu mansion",
    "Rapper accused of antisemitic abuse by former business partner",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Human remains found in California mountains confirmed as British actor",
    "Supreme court ruling on stalking cases sparks alarm",
    "Amazon facing ‘urgent’ crime crisis after gutting of protections, says drugs tsar",
    "Man hoping to break record for living on barren rock rescued by coastguard",
    "Video of apparent neo-Nazi handing out balloons at nursery sparks outrage",
    "Ex-military policeman found guilty of genocide by Paris court",
    "Pilot dumps drugs over remote region when pursued by fighter jet",
    "Genetic variant identified that may increase severity of condition",
    "Engineer sentenced to life in prison for killing three women over job losses",
    "Rees-Mogg and Dorries likely to be named in ‘contempts of parliament’ report",
    "Beaver spotted ambling around garden in broad daylight",
    "Fury as Sweden allows Qur’an burning risks further delays to Nato bid",
    "The oil company CEO running the next UN climate change summit",
    "Listen to previous episodes",
    "Hijack review Idris Elba makes this beautifully daft plane thriller soar",
    "Idris Elba: racist backlash made speculation over James Bond ‘disgusting’",
    "Two street artists claim responsibility for hoax Banksy",
    "Twitter rips into Jeremy Corbyn’s poetry – except it’s actually by Shelley",
    "Julian Sands in A Room With a View: the soulful heart of a brilliantly romantic film",
    "Top 10 summer love stories",
    "A polar bear theatre in Rotterdam zoo",
    "10 famous food rules you can absolutely ignore",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "10 of the weirdest sporting events in the UK",
    "The surprising culinary advice of one of the world’s best chefs",
    "I moved my date’s hand off my breast and he took it badly. Should I have said something instead?",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Changing skin pattern while asleep may show they dream, research shows",
    "The author under attack for doubting Shakespeare",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Outcry after tourist carves name on wall at Colosseum",
    "How Kylie and Fleetwood Mac found new young fans",
    "Mountain basketball and an earthquake wedding",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Russian general who may have known about Wagner mutiny goes missing",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "Titan submersible debris returned to land after fatal implosion",
    "‘We are literally erased’: what does it mean to be intersex?",
    "‘It gets worse every day’: why are sea lions and dolphins dying along California’s coast?",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "Texas heatwave blamed for 13 deaths as scorching temperatures and smoke spread across US – live",
    "The End of Sex review – couple’s sexual misadventures aim to relight fading fires"
]