[
    "The Guardian - Back to home",
    "Live Trump indictment sends shockwaves through 2024 race",
    "GOP Republicans rally behind Trump after indictment",
    "Analysis Could Trump go to jail?",
    "Former president expected to surrender to Miami authorities on Tuesday after indictment",
    "12m Americans believe violence is justified to restore Trump to power",
    "Live Russia-Ukraine war live: nuclear weapons to be deployed in Belarus from July, says Putin",
    "Analysis Zelenskiy steps up criticism of International Red Cross over inaction at Kakhovka",
    "Seismic data adds to evidence that Kakhovka dam was blown up",
    "Visualized How Alabama discriminated against Black voters",
    "Surprise US supreme court ruling could help Democrats take House in 2024",
    "New York therapists see surge in eco-anxiety as smoke fills skies",
    "Real cost of ‘Cop City’ under question after state approves $67m for project",
    "US extradition ‘dangerously close’ after losing latest legal appeal",
    "Man assaulted by cleric as a child launches health program to turn ‘pain into power’",
    "Binance.US prepares to suspend US dollar deposits and withdrawals from exchange",
    "Facebook owner to push ahead with plans to launch Twitter rival",
    "Qantas allows attendants of any gender to wear flat shoes, make-up and have long hair",
    "Republicans turn on their own in attorney general impeachment scandal",
    "Four controversial doctors helping Republicans attack trans healthcare",
    "Are rent stabilizing measures making a comeback in America?",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Why you still can’t buy wine in New York supermarkets",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "Is the government ready to regulate crypto?",
    "How sex-tech firms are reinventing the vibrator",
    "The Stanford golf star toppling Tiger Woods’ records",
    "Veteran special counsel at center of Trump investigations",
    "Just as we’ve fallen in love with digi-Luke, is Mark Hamill really retiring from Star Wars?",
    "Collapse a global problem as waters may poison Black Sea, Zelenskiy says",
    "The collapse of Ukraine’s Nova Kakhovka dam",
    "What we know on day 471 of the invasion",
    "Zelenskiy steps up criticism of International Red Cross over inaction at Kakhovka dam",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The charges mount, but Trump’s not worried. He’s just the guy to make jail great again",
    "Why did the right-leaning supreme court hand Democrats a victory?",
    "The global backlash against The Little Mermaid proves why we needed a Black Ariel",
    "The dismal story of modern football can be summed up in two words: Manchester City",
    "As Russia’s armed forces fight among themselves, it’s hard to know who’s in control",
    "A beer with Mike Pence to figure out what his deal is? Possibly …",
    "Alcaraz v Djokovic – French Open 2023 semi-final",
    "Soccer, golf … will the NBA and NFL be next?",
    "Analysis Five key Inter players in Champions League final",
    "Jonathan Wilson How Inter can trouble mighty Man City",
    "Champions League final countdown and Keïta joins Werder Bremen – football",
    "Panthers take Game 3 on Verhaeghe’s overtime winner",
    "Chelsea sign US forward Macario from Lyon on three-year deal",
    "Hochul says Triple Crown race will only happen if air quality improves",
    "Caruana closes in on Stavanger win as Carlsen trails",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "Trump requests reduced damages or new trial",
    "Struggling Meta showcases new AI tools at company meeting",
    "10-year-old girl survives 24 hours in ‘rugged and remote’ Cascade mountains",
    "Republican hardliners revolt against their own speaker",
    "Californians offer advice to New Yorkers",
    "Lawyer for valet in Mar-a-Lago documents case alleges misconduct",
    "Donald Trump indicted for illegal retention of classified documents",
    "US lawyer who alerted school to priest’s sexual misconduct seeks damages",
    "Tucker Carlson lawyer hits back at claim of contract breach",
    "Dog toy cannot mimic Jack Daniel’s, US supreme court rules",
    "Macron to visit Annecy knife attack victims as two children remain critical",
    "Beijing plans new rules to regulate file sharing services like Airdrop and Bluetooth",
    "Chain sues viral food vandal for damages",
    "Rishi Sunak and Joe Biden sign ‘Atlantic declaration’ but hope of trade deal ends",
    "Hedge fund founded by Crispin Odey ‘does not recognise’ picture painted of firm",
    "Five killed in shooting at car wash near Nazareth amid wave of violence",
    "China reportedly reaches secret deal with Havana to host spy base on island",
    "Hope for Syrian cancer patients as cross-border treatment resumes in Turkey",
    "Dutch murderer extradited to US over Natalee Holloway disappearance",
    "Swiss billionaire jailed over asbestos-related deaths in Piedmont",
    "A prince’s day in court: Harry against the Mirror",
    "Listen to previous episodes",
    "A grief-stricken masterpiece",
    "Influential British blues guitarist and singer with the rock band the Groundhogs",
    "Claire Denis on rum, Africa and rethinking MeToo",
    "Here are the shows to help scratch that itch",
    "The celebs go to space show we didn’t know we needed",
    "Why dressing for dinner out is my favourite kind of look",
    "I built a house of cards 50 storeys high",
    "My friend talks nonstop about herself. How can I get her to listen to me?",
    "Readers’ favourite retreats in the UK and Europe",
    "When wedding proposals go hilariously wrong",
    "Atlantic declaration shows Sunak and Biden’s willingness to simply make do",
    "Wild horse deaths in sierra show a delicate ecosystem off balance",
    "Ozempic has won, body positivity has lost. And I want no part of it",
    "So she’ll speak here instead.",
    "I’m not a bad packer – but I’m a horrible folder",
    "French Alps city shocked by knife attack on young children in park",
    "Gigantic rubber ducks and the first AI sculpture",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Smoke engulfs American north-east",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Russia-Ukraine war live: nuclear weapons to be deployed in Belarus from July, says Putin",
    "Teenage girl who pretended to be boy for sex duped second girl, court told",
    "Lawyer for Trump valet in Mar-a-Lago documents case alleges misconduct",
    "Air pollution in US from wildfire smoke is worst in recent recorded history",
    "Seismic data adds to evidence that Ukraine’s Kakhovka dam was blown up",
    "Could Trump go to jail? Federal charges over classified docs show momentum is building"
]