[
    "The Guardian - Back to home",
    "City is sinking due to weight of its skyscrapers, research finds",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "Russia-Ukraine war: Zelenskiy meets Arab League leaders before heading to G7",
    "Couple ‘demand agency hand over car chase images’",
    "French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Iran executes three men accused over anti-government protests",
    "Police detain woman for supporting comedian who joked about military",
    "Bassist for the Smiths dies aged 59",
    "How Florida is targeting the formerly incarcerated to stop ‘voter fraud’",
    "The Sicilian town trying to break free of its mobster past",
    "G7 leaders confront spectre of nuclear conflict on visit to memorial",
    "Montreal mob-related killing sparks worry of gang war",
    "Leaders prepare new Russia sanctions",
    "US risks rift with EU allies over hesitancy to supply F-16s",
    "Dreams shattered as war scatters Ukraine documentary’s teenage stars",
    "Error overvalued US weapons aid to Ukraine by $3bn",
    "‘We have terrible roads but we’re banning an app’",
    "Turn off your email, get the packing right – and never, ever play Monopoly",
    "The spellbinding singer on anger, empathy and trans rights",
    "I’ve got the best memory in the world",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "Should my girlfriend stop monitoring me at the gym?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "My students are using AI to cheat. Here’s why it’s a teachable moment",
    "Speak now: why pop stars must do more to defend LGBTQ+ fans",
    "The US debt ceiling crisis is more proof of Republicans’ cynicism and bad faith",
    "Alzheimer’s drugs are a ray of hope. They must be accessible to all, not the wealthy few",
    "Let’s teach children about slavery properly by connecting it to our present",
    "The great British baby drought has a simple cause. And it’s not ‘cultural Marxism’",
    "Nuggets two wins from finals after Murray’s 23-point fourth tames Lakers",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Tom Kim Golfer's accidental mud bath on sixth goes viral",
    "LIV rebel DeChambeau muscles his way into early lead",
    "Football Do teams with nothing to play for really end up ‘on the beach’?",
    "Ten things to look out for this weekend",
    "Ligue 1’s LGBTQ+ campaign washed out by absent players and tone-deaf managers",
    "Caruana edges Bucharest while Ding narrowly avoids finishing bottom",
    "San Diego to receive 30th franchise ahead of 2025 debut",
    "Don’t stop with Doc. Time to burn the Sixers to the ground",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Weather disasters suggest climate crisis is at Europe's gates",
    "Developing country voices will be excluded at UN plastic talks, say NGOs",
    "Having trouble facing the reality of the climate crisis? Use this tried and tested method",
    "National Conservatism: a Tory fringe or the party’s future?",
    "Listen to previous episodes",
    "Caligula finally comes to Cannes",
    "Staging Mozart’s Don Giovanni",
    "Brandy Clark: Brandy Clark – country provocateur holds too much back",
    "‘When I am anxious or sad, I reach for Hilary Mantel’s Wolf Hall’",
    "So bad you’ll want to howl at your TV screen",
    "The Full Monty creators on the return of their Sheffield strippers",
    "Harrison Ford cracks the whip in taut sequel",
    "Sean Penn paramedic drama tries to grapple the horror",
    "Estate loses US supreme court copyright fight over Prince paintings",
    "Wim Wenders: cinema today ‘makes me nauseous’",
    "Readers’ favourite restaurants in Europe",
    "I may have fallen in love with a sex worker I am paying. Could it be real?",
    "‘I really wanted to be her friend but I wasn’t sure I was cool enough’",
    "‘She is a big conspiracy theorist – I came out thinking, what was that?’",
    "I’ve struggled to make friends since moving abroad – and it’s making me lonely",
    "How to start dating again after heartbreak",
    "Creators sue to block Montana’s ban on app",
    "Airline ‘sincerely apologizes’ to family over Puerto Rico passport error",
    "Company cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "California city to name street after rapper",
    "Gun violence is top public health concern for quarter of Americans – poll",
    "City names first drag laureate as LGBTQ+ rights under attack in US",
    "Eight-year-old girl dies after being detained by border patrol",
    "Man accused of stabbing app founder Bob Lee pleads not guilty",
    "Sierra Club clashes with union over layoffs and restructuring plan",
    "Universal ‘chasing arrows’ recycling symbol could be dumped in US",
    "Nationalists chant racist slogans on march through Jerusalem",
    "Younger Britons more likely to believe in eternal damnation, study finds",
    "UK prime minister talks up his defense secretary as next secretary general",
    "Driver forces entry into palace grounds by ramming gate",
    "Subway ad for restaurant featuring Michelangelo’s David censored over nudity",
    "Tasered 95-year-old woman was approaching on walking frame with steak knife, police say",
    "First records of human kissing may date back 1,000 years earlier than estimated",
    "Imran Khan and Lahore police remain in tense standoff",
    "Death toll mounts in country's worst flooding for 100 years",
    "Increasingly sophisticated and deadly",
    "Stark before-and-after images reveal the obliteration of city",
    "Ex-royal bodyguard on paparazzi chases",
    "US child killings have risen rapidly – why are more states pushing for joint custody laws?",
    "The new marine sanctuary for the super-rich LA coast",
    "Inside the shocking downfall of Hillsong church",
    "A rare monk seal and a lurking alligator",
    "Australian fashion week and flooding in Italy",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "Disney cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "‘An irresistible mix of art and genitals’: Caligula finally comes to Cannes",
    "Andy Rourke, bassist for the Smiths, dies aged 59",
    "Jane Fonda: French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Greek PM hails ‘tough but fair’ migration policy on election trail",
    "Harry and Meghan ‘demand agency hand over car chase images’",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast"
]