[
    "The Guardian - Back to home",
    "The Wagner uprising 24 hours that shook Russia",
    "Explained What the future might hold for Prigozhin and Wagner",
    "Moscow Calm returns to city after Wagner stand-down",
    "Rebellion reveals ‘cracks’ in Putin government",
    "Enduring fealty to Trump on display at conference after indictment",
    "Elderly survivors of the Tulsa race massacre push for justice",
    "Celebration and defiance in the face of threats",
    "Officials testing Yellowstone River water at site of rail bridge collapse",
    "Comfortable victory for New Democracy’s Mitsotakis",
    "New Jersey man flies 23m miles with lifetime United pass ‘like a sultan’",
    "Airport worker dies after being sucked into Delta jet engine",
    "Greenhouse gas emissions from global energy industry still rising – report",
    "Professor who studies honesty accused of falsifying data in studies",
    "US navy accused of cover-up over radioactive shipyard waste",
    "The new world of octopus farming",
    "Timeline Voting restrictions passed by US states since 2013",
    "Ten years of a crippled Voting Rights Act",
    "Rotterdam falls for British statue of ordinary black woman",
    "GOP-run states are eyeing abortion beyond their borders. Blue states are fighting back",
    "Twenty-four hours that shook Russia",
    "Beijing downplays Wagner rebellion as Russia’s ‘internal affairs’",
    "Lukashenko reaps rewards of Wagner-Kremlin deal – at least in the short term",
    "Russia-Ukraine war at a glance: what we know on day 488 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "The surprisingly popular world of online trainspotting",
    "Free bus rides for women spark joy for millions in Karnataka",
    "Debbie Harry is an atomic charisma bomb",
    "What does he mean to today’s architects?",
    "A look at gummy supplements",
    "Nora Ephron’s romcom is still worth falling for",
    "‘There’s a lack of trust in science – we need to show how it’s done’",
    "Sign up to the US opinion email",
    "Putin’s problems aren’t over",
    "Amid the battle of Xi Jinping and Joe Biden, a new global order struggles to take shape",
    "Mark Zuckerberg v Elon Musk: this cage ain’t big enough for the both of us",
    "Britain is used to crises now. But this widespread hopelessness is new – and frightening",
    "I don’t eat meat and my wig always ends up reeking of smoke – so why am I fascinated by barbecues?",
    "Vingegaard v Pogacar Gripping third act awaits in his year's Tour",
    "Fear casts a shadow over peloton after Mäder’s death",
    "Alcaraz wins Queen’s and declares himself a ‘favorite’ for Wimbledon",
    "Dauwalter smashes Western States record by 78 minutes",
    "Shot putter steps up after injury hits Belgium at Euro Champs",
    "Vazquez and Turner save US from defeat against Jamaica in opener",
    "The life and mysterious death of a Canadian rugby giant",
    "Angels notch MLB’s third-largest win since 1900 with 25-1 rout of Rockies",
    "Bayern Munich try to hijack Man Utd’s move for Mount",
    "Farmers on frontline as Dutch divided by war on nitrogen pollution",
    "How the weather event is affecting global heating in 2023",
    "US honeybees suffer second deadliest season on record",
    "3M pays $10.3bn to settle water pollution suit over ‘forever chemicals’",
    "Meteorologist resigns after death threats over climate crisis coverage",
    "Eight is Enough actor died of fentanyl effects, autopsy report says",
    "Teen in jail for high school shooting showing ‘disturbing behavior’",
    "Scooter, a Chinese crested, captures the title",
    "Democrats issue calls to action as US marks Roe reversal",
    "Bridge collapses causing train carrying toxic materials to fall into river",
    "Doctors urge baseball team change its name: ‘You wouldn’t have Team Asbestos’",
    "Record-breaking heatwave enters third week as thousands lose power",
    "Dispute rumbles on weeks after messy exit",
    "Delivery workers stand up to Amazon",
    "Exhibition aims to dispel myth of ‘primitive’ England in middle ages",
    "I routinely gave Netanyahu gifts, Hollywood producer tells Israeli court",
    "Disbelief and anger among shipwreck victims’ relatives as millions spent on Titan rescue effort",
    "Gay pride activists stage annual rally in defiance of ban",
    "Identification to begin of 796 bodies buried at children’s home",
    "Palestinian shot dead after opening fire on Israeli checkpoint",
    "Putin and Prigozhin avert bloodshed, but their feud is not over",
    "Billionaires ‘disappointed’ after superyachts banned from Naples port",
    "One killed and several injured in Stockholm as rollercoaster derails",
    "Canadian investigators board Polar Prince to interview crew and probe data records",
    "Bittersweet joy at the end of the yellow brick road",
    "How a place of torture has haunted us culturally over time",
    "Simon Pegg on comedy, action heroes and staying at home",
    "The real explosion that almost destroyed The Goldfinch",
    "Disney+ documentary reignites anger over cult of Stan Lee",
    "Inside a dramatic eco home in Mexico",
    "Older female models struggle for work as brands play it safe post-Covid",
    "The love of my life has died. How can I ever be free to live again?",
    "What would a person be like if nothing bad had ever happened to them?",
    "Sunscreens: 10 of the best",
    "Combine surf and turf in south-west France",
    "Attacks on LGBTQ+ Americans cast long shadow",
    "It's booming – but can the continent cope?",
    "Wagner rebellion brings fresh hope to Ukrainians",
    "The Londoner arrested for murder on the injustice that shaped his life",
    "The Ukrainian boy stranded in a basement who you helped to escape",
    "China’s north bakes in record heatwave",
    "A rearing horse, a Prigozhin selfie and an ugly dog",
    "Derrick O Boateng’s best phone picture",
    "The stars of Succession as tarot cards",
    "The week around the world in 20 pictures",
    "Festival shower kits and Tom Cruise in London",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "What does the future hold for Prigozhin and Wagner after the mutiny?",
    "Texas airport worker dies after being sucked into Delta jet engine",
    "‘A symbol of what humans shouldn’t be doing’: the new world of octopus farming",
    "Republicans’ enduring fealty to Trump on display at conference after his indictment",
    "Blondie at Glastonbury review – Debbie Harry is an atomic charisma bomb",
    "‘Putin humiliated’: what the papers said about the Wagner rebellion in Russia",
    "The surprisingly popular world of online trainspotting: ‘Some people keep it on 24 hours a day’",
    "The Guardian view on Prigozhin’s mutiny: Putin’s problems aren’t over"
]