[
    "The Guardian - Back to home",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "US debt ceiling talks hit bump as White House says ‘real differences’ remain",
    "Explainer How could F-16s make the difference for Ukraine in the war against Russia?",
    "US to back fighter jet training for pilots, official says",
    "Prosecutor signals charges in 2020 election inquiry may come end of July",
    "Lifesaving overdose drug not yet reaching those most in need, doctors say",
    "Florida governor says only he can beat Biden in 2024 presidential election",
    "Author makes first public appearance since attack, praising ‘heroes’ who saved him",
    "Thousands of supporters arrested as hundreds face trial",
    "Groom remembers bride killed in wedding night crash as ‘amazing human’",
    "City is sinking due to weight of its skyscrapers, research finds",
    "He voted for the first time in 2020. Then came the criminal charges",
    "Actor’s return to Cannes exposes French split over #MeToo",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "G7 summit Leaders prepare new Russia sanctions as Zelenskiy to attend summit in person",
    "Foreign minister steps up threat to block EU weapons aid for Ukraine",
    "Dreams shattered as war scatters Ukraine documentary’s teenage stars",
    "Ukrainian punks Death Pill take fury on tour",
    "Venice’s Architecture Biennale spotlights Africa",
    "Caligula finally comes to Cannes",
    "An education in consent for 24 hour party people",
    "The miracle and tragedy of Tasmania’s Blythe Star shipwreck",
    "Wanda Sykes, the uncancellable standup superstar",
    "The daredevil group bringing ropewalking and climbing to the theatre",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "$209bn a year is what fossil fuel firms owe in climate reparations. We want that paid",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "They’re openly saying it: Brexit has failed. But what comes next may be very dark indeed",
    "Andy Rourke was the other melodic genius in the Smiths: spry, funky and masterful",
    "Does the west really want Ukraine to win the war? If so, increase military support",
    "My students are using AI to cheat. Here’s why it’s a teachable moment",
    "Speak now: why pop stars must do more to defend LGBTQ+ fans",
    "Tom Kim Golfer's accidental mud bath on first day goes viral",
    "PGA Championship – second round updates",
    "Mage faces tough Preakness challenge as First Mission scratched by vet",
    "MLS San Diego to receive 30th franchise ahead of 2025 debut",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Taylor braced for ‘hardest fight of career’ against Cameron",
    "Arsenal bottled it? That’s just a quick, cheap narrative",
    "Ten things to look out for this weekend",
    "Nuggets two wins from finals after Murray’s 23-point fourth tames Lakers",
    "Caruana edges Bucharest while Ding narrowly avoids finishing bottom",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Weather disasters suggest climate crisis is at Europe's gates",
    "The new marine sanctuary for the super-rich LA coast",
    "National Conservatism: a Tory fringe or the party’s future?",
    "Listen to previous episodes",
    "Company cancels plans for $1bn campus in Florida amid battle with DeSantis",
    "Harrison Ford reduced to tears in Cannes over Indiana Jones’s return",
    "French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Actor says failing to resist rise in AI screenwriting is a ‘human obscenity’",
    "Is The Creator the first (or last) in a new wave of sci-fi movies about AI?",
    "Bloomsbury admits using AI-generated artwork for Sarah J Maas novel",
    "The spellbinding singer on anger, empathy and trans rights",
    "Brandy Clark: Brandy Clark – country provocateur holds too much back",
    "Peter Rabbit story originated in African folktales, expert argues",
    "The Full Monty creators on the return of their Sheffield strippers",
    "Turn off your email, get the packing right – and never, ever play Monopoly",
    "Ravneet Gill’s recipe for strawberry and custard tart",
    "Daisy Jones & the Six is a blueprint for delicious holiday style",
    "I can’t get past how empty I feel since my best friend died",
    "I’ve got the best memory in the world",
    "Should my girlfriend stop monitoring me at the gym?",
    "Creators sue to block Montana’s ban on app",
    "Couple ‘demand agency hand over car chase images’",
    "Airline ‘sincerely apologizes’ to family over Puerto Rico passport error",
    "California city to name street after rapper",
    "City names first drag laureate as LGBTQ+ rights under attack in US",
    "Gun violence is top public health concern for quarter of Americans – poll",
    "Eight-year-old girl dies after being detained by border patrol",
    "Man accused of stabbing app founder Bob Lee pleads not guilty",
    "Universal ‘chasing arrows’ recycling symbol could be dumped in US",
    "Congresswoman claims white supremacist label is same as N-word",
    "Iran executes three men accused over anti-government protests",
    "Villages evacuated as ‘very large’ wildfire ravages south-west",
    "Government under fire after video shows ‘pushback’ of asylum seekers",
    "King’s College London cuts ties over opioid crisis",
    "Bashar al-Assad tells Arab League he hopes his return marks new era of peace",
    "Former PM and wife Carrie expecting third child in ‘just a few weeks’",
    "Police detain woman for supporting comedian who joked about military",
    "UN denied access to Rohingya refugee camps after Cyclone Mocha",
    "Beijing aims to subordinate the west, claims US politician on UK visit",
    "Subway ad for restaurant featuring Michelangelo’s David censored over nudity",
    "Montana TikTok users denounce ban",
    "The Sicilian town trying to break free of its mobster past",
    "Afghan refugee who worked for UK sleeping rough in London",
    "Younger Britons more likely to believe in eternal damnation, study finds",
    "Staging Mozart’s Don Giovanni",
    "I may have fallen in love with a sex worker I am paying. Could it be real?",
    "G7 summit and water buffaloes",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "‘An irresistible mix of art and genitals’: Caligula finally comes to Cannes",
    "Hungary steps up threat to block EU weapons aid for Ukraine",
    "US debt ceiling talks hit bump as White House says ‘real differences’ remain – live",
    "US to back fighter jet training for Ukrainian pilots",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast"
]