[
    "The Guardian - Back to home",
    "Ron DeSantis signs laws to ease 2024 run",
    "Turkey election goes to runoff after Erdoğan takes first-round lead",
    "Donald Trump refuses to say whether a six-week abortion ban goes too far",
    "US professor breaks record for longest time living underwater",
    "US supreme court pursuing rightwing agenda via ‘shadow docket’, book says",
    "Beijing jails US citizen for life on espionage charges",
    "Russia-Ukraine war: Zelenskiy meets UK prime minister; France to send Kyiv military aid",
    "Philadelphia Inquirer severely disrupted by cyber-attack",
    "Firm apologizes after refusing rental car to Puerto Rican customer",
    "Man fined nearly $1,000 for filling in pothole hits out at ‘injustice’",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "Why Trump’s ‘vile’ attacks against Carroll after verdict could be ‘chilling for survivors’",
    "The asylum rule replacing Title 42 is strict – here’s what we know",
    "Serbians wary of president's gun pledge after mass shootings",
    "‘I try to explain the meaning of this Russian fascism’",
    "Ukrainian president arrives at UK PM's country residence to meet ‘my friend’ Rishi Sunak",
    "Kyiv can defeat Russia by end of year with western help, president says",
    "What we know on day 446 of the invasion",
    "Living in the Alaska rainforest with 1,000 bears",
    "The devastating plight of LGBTQ asylum seekers",
    "Why are so many young Americans adopting fake British accents?",
    "The Daily Show’s Roy Wood Jr on making the other side laugh",
    "How vanished flight MH370 is reflected in a father’s dementia",
    "Matilda’s Mara Wilson on the price of fame",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Will Jokić halt LeBron’s title ambitions?",
    "10 talking points from the weekend’s action",
    "Arsenal losing the league is not a collapse of character",
    "Tatum’s Game 7-record 51 points power Celtics into Eastern Conference finals",
    "Grizzlies suspend star after second apparent gun video emerges",
    "Rockies pitcher Feltner fractures skull after taking 93 mph line-drive to head",
    "Lewandowski fires Barça to title but invoke Espanyol fans’ wrath",
    "Emotional Day breaks five-year PGA Tour drought",
    "Sign up to the US opinion email",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Erdoğan is in the lead in Turkey’s elections – and democracy is likely to be the loser",
    "I’m a drag queen in Tennessee. The state’s anti-drag law is silly, nasty and wrong",
    "The apocalypse isn’t coming. We must resist cynicism and fear about AI",
    "To my friend who worries about becoming a parent: here are some things to hold on to",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "I used to hide behind my hair. But cancer gave me a buzzcut and helped me find my voice",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Is the UK in the grip of ‘greedflation’?",
    "Listen to previous episodes",
    "How rap music processed trauma in war-damaged Iraq",
    "Fear and loathing in Hollywood",
    "Music, film, books and more about the madness and wisdom of crowds",
    "The artists pushing the boundaries of AI",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "This year’s contest is most watched final in song contest’s history, says BBC",
    "Band to continue tour following death of Paul Cattermole and departure of Hannah Spearritt",
    "Ken Loach takes his last film to Cannes",
    "An intimate, uplifting star portrait",
    "Why we need a new definition of junk food",
    "The best mid-range phone gets even better",
    "Nancy Birtwhistle’s budget midweek meal",
    "The spreading agony of kidney stones",
    "I embraced being single and became an international pet-sitter",
    "Every night I would sing to Cackles the goose. Then tragedy struck",
    "Crossings reportedly decrease after Title 42 rules scrapped",
    "Vice files for bankruptcy protection amid cut-price sale to consortium",
    "Republican presidential candidate downplays federal abortion ban",
    "Boy, 13, saves sister by hitting potential kidnapper with slingshot",
    "Mem Fox book Guess What? banned in county under Ron DeSantis bill",
    "Not having cellphone allowed boy to save runaway bus from crashing",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric",
    "Teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Rightwing US senator to give virtual speech at conservative UK conference",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "Opposition parties start alliance talks after voters reject military rule",
    "Economy expected to grow faster than forecast, says EU",
    "Talking to babies may help shape brain structure, research finds",
    "Two charged after Hitler speeches played on train intercom",
    "Talent agency apologises over claims founder sexually abused boys",
    "President Lukashenko misses another event prompting speculation of illness",
    "Greens suffer setback in Bremen local election",
    "Imran Khan accuses Pakistan’s military of ordering his arrest",
    "Thousands evacuated as Cyclone Mocha makes landfall",
    "Newspaper apologises for hoax AI article about women’s use of fake tan",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "Tell us: how do you feel about your smartphone use?",
    "How Donald Trump was found liable for sexual abuse",
    "Leaders embrace and a stage invasion",
    "The world’s oldest dog and uphill sprinting",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run",
    "A new start after 60: I embraced being single and became an international pet-sitter",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "Turkey election results 2023: what we know so far",
    "Living in the Alaska rainforest with 1,000 bears: ‘Not the easiest place to be homeless’",
    "Florida teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Hertz apologizes after refusing rental car to Puerto Rican customer",
    "Not having cellphone allowed US boy to save runaway bus from crashing"
]