[
    "The Guardian - Back to home",
    "US immigration Migrants flown to California were ‘lied to’",
    "Newsom threatens kidnapping charges after Florida dumps migrants at church",
    "Ex-president's lawyers meet with DoJ to stave off indictment in Mar-a-Lago case",
    "Trump Critics warn of threat of ‘deep decline of rule of law’",
    "Republicans 2024 candidates criticize Trump for Kim praise",
    "Trump’s former vice-president announces White House run",
    "Wolverine spotted for the second time ever in California in the last 100 years",
    "Ukraine troops attack along front in apparent precursor to counteroffensive",
    "Lab-shepherd mix Zoey recognized for world’s longest dog tongue by Guinness",
    "Presidential candidate booed by audience on The View for defending Ron DeSantis",
    "Election of Delfina Gómez as governor of Mexico state signals decline of PRI",
    "AI should be licensed like medicines or nuclear power, Labour suggests",
    "Company unveils 15in MacBook Air, iOS 17 and revamped watchOS 10",
    "Philosopher announces US presidential campaign with People’s party",
    "Revised report on impact of lockdowns 'adds little insight'",
    "Highway threatens heart of the rainforest",
    "The truth about ‘local’ food in US supermarkets",
    "Global ‘silver tsunami’ of older patients is coming, experts warn",
    "Can sleeping apart help a relationship?",
    "The shocking story of Hollywood’s con queen",
    "The ultimate eco building – made of salt, sunflowers and recycled urine",
    "Headache for legal team as Harry skips first day of phone-hacking trial",
    "Singer ‘extremely sorry’ for cancelling gigs to rest for Glastonbury",
    "UK recorder fans warn instrument heading for extinction",
    "Why it is time to embrace your quilt – without the guilt",
    "Father of teen killed in Alabama mass shooting speaks out",
    "War brings urgency to fight for LGBT rights in Ukraine",
    "Wagner captures commander as Prigozhin feud with army escalates",
    "Has it begun in Ukraine's war with Russia?",
    "What we know on day 467 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Kim Jong-un’s new border wall could be a sign that his grip on North Korea is slipping",
    "Bruno and Dom’s legacy: defend nature’s defenders",
    "Exam season makes everyone unhappy. Why do we put up with it?",
    "Five things the US debt-ceiling deal suggests about the future",
    "For better or for worse: is the decline in marriage actually good for relationships?",
    "Spain’s snap election could kill its housing revolution before it even gets started",
    "Zlatan was more than a cocky Swede who did not follow the rules",
    "Butler hails Heat’s ‘don’t give a damn factor’ after latest comeback",
    "Postecoglou has steeliness to handle challenge of rebooting Spurs",
    "Mercedes have a long way to go but success in Spain is still significant",
    "Liverpool poised to sign Mac Allister from Brighton",
    "Woods hails Zhang as 20-year-old wins on pro debut",
    "León beat LAFC to continue Mexican dominance",
    "You have to control everything – it’s like chess … I calculate it all",
    "Microplastics found in every sample of water taken",
    "Rich countries with high greenhouse gas emissions could pay $170tn by 2050",
    "Countries must put aside national interests for climate crisis, UN says",
    "Rich nations undermining work to help poor countries, research suggests",
    "Judge delays trial in 3M lawsuit as parties eye settlement",
    "Trump-era officials under fire as nuclear fund for Bikini islanders is squandered",
    "Colossal data centers are taking over the US countryside",
    "US jets pursue light aircraft over capital before it crashes in Virginia",
    "Trump donor whose family died in plane crash lost other daughter in diving tragedy",
    "SEC sues crypto exchange and CEO Changpeng Zhao for ‘mishandling billions of dollars’",
    "Chris Licht apologizes to staff for taking spotlight with Atlantic profile",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "How a copyright dispute over FBoy Island is consuming world of reality TV",
    "Three men accused of attacking Brigitte Macron relative appear in court",
    "Police open criminal negligence case",
    "Tributes paid a year on from their deaths",
    "‘Very last warning’ for 82-year-old convicted of dealing marijuana",
    "Top court orders city to pay €50,000 to couple over nightlife noise",
    "Three-year-old boy shot by Israeli soldiers dies in hospital",
    "Airborne DNA accidentally collected by air-quality filters reveals state of species",
    "Activist who revealed Houthi sexual abuses ‘detained by Saudi Arabia’",
    "Social Democrats announce wrong leader after ‘technical error’",
    "Our critics’ guide to a summer of music, movies and culture",
    "Listen to previous episodes",
    "How M made crossover classic Pop Muzik",
    "Light bondage and heavy sleaze make for the ultimate try-hard TV",
    "The best US exhibitions and art events around the country",
    "Was Brian Cox written out of Succession too soon?",
    "Italy’s ‘new Michelangelo’ bringing sculpture into 21st century",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "De La Soul were my first music love – something my dad always understood",
    "Are cats really domesticated?",
    "My life as a pedestrian in badly behaved Britain",
    "Why Britain’s curry houses are in decline",
    "Can you use a pasta strainer instead of a hairdryer diffuser?",
    "Hongkongers defy attempts to forget Tiananmen",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "How Ghana became fast fashion’s dumping ground",
    "Seven steps to save the Amazon",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Revisiting the strange story of Natalia Grace",
    "Rising moon and raging fires",
    "The church at the end of the world – photo essay",
    "Strawberry moon and Lightsaber lessons",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Ukraine’s troops attack along front in apparent precursor to counteroffensive",
    "Wagner captures Russian commander as Prigozhin feud with army escalates",
    "Trump donor whose family died in Washington plane crash lost other daughter in diving tragedy",
    "Trump lawyers meet with DoJ to stave off indictment in Mar-a-Lago case",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "Global ‘silver tsunami’ of older cancer patients is coming, experts warn"
]