[
    "The Guardian - Back to home",
    "Full story Santos surrenders to face federal charges",
    "George Santos in custody after surrendering to federal charges related to election violations",
    "CNN town hall Trump could face questions on verdict",
    "Analysis Will the verdict affect Trump's 2024 presidential bid?",
    "Carroll Seesawing emotions before jury says it believes her",
    "Columnist ‘overwhelmed with joy’ for women in US after Trump verdict",
    "'Losing Gravity role to Sandra Bullock made me feel hopeless'",
    "A Walgreens guard killed a Black trans organizer. His community wants answers",
    "US rate beat forecasts in April but remained high at 4.9%",
    "Possible meteorite crashes into bedroom",
    "Pressure builds as North Carolina set to override ban veto",
    "US lawmakers call to modernize Osha as hundreds die on the job each day",
    "Man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Prime minister Sanna Marin files for divorce",
    "The meaning and misogyny of the Trump-Carroll case",
    "Soap can make humans more attractive to mosquitoes, study finds",
    "Devastating wildfires will only get worse, new book warns",
    "Microbes discovered that can digest plastics at low temperatures",
    "UK proscribing group as terrorist ‘will help Ukrainians sue’",
    "Ukraine will host after it defeats Russia, says 2022 winner",
    "French journalist killed in Russian rocket strike in Ukraine",
    "What we know on day 441 of the invasion",
    "Tell us Have you struggled with the US housing crisis?",
    "How finding a home became so absurdly expensive",
    "What I faced after coming out as a queer Jehovah’s witness",
    "Robert De Niro has had his seventh child aged 79. Does that explain the bagel adverts?",
    "Sound artist eavesdrops on what is thought to be world’s heaviest organism",
    "Mother’s Day brings only grief for those seeking the disappeared",
    "The lawyer whose sex trafficking case against platform could spell trouble for big tech",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Real v City: beauty and parity on the razor’s edge",
    "Alf Inge Haaland Striker's father escorted from VIP seat",
    "Barney Ronay  De Bruyne finds key as champions locked down",
    "Football Weekly City and Real Madrid trade blows at Bérnabeu",
    "UFC-backed tour leans into right-wing media ties",
    "College football champions decline Biden White House invite",
    "Evenepoel brought down by stray dog at Giro d’Italia",
    "PBGV wins best in show in historic first for breed",
    "Sixers and Nuggets move closer to Conference finals with Game 5 wins",
    "Pegula and Gauff rail at female players being silenced in Madrid",
    "Jaguars to make history with two games in London",
    "Sign up to the US opinion email",
    "E Jean Carroll won. And Trump can be now portrayed as a sexual abuser",
    "It’s official: billionaires aren’t the brainboxes they like to believe",
    "Dear CNN, giving Trump a town-hall platform is the height of irresponsibility",
    "Liable for sexual assault, yes – but Trump’s political career is far from over",
    "It’s no wonder that many in Pakistan now fear for the fate of Imran Khan",
    "Serbia acted after two mass shootings – the US has done nothing despite 200 this year",
    "Jordan Neely’s cry for help should not have been his death sentence",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "‘Mind-boggling’ methane emissions revealed",
    "Shell shareholders should oust chair, says influential adviser",
    "Italian oil firm Eni faces lawsuit alleging early knowledge of climate crisis",
    "Did distress calls go unanswered in the run-up to a fatal Channel disaster?",
    "Listen to previous episodes",
    "The idea that you need a white actor is utterly insidious",
    "Why has East German culture become so cool?",
    "American photography from 1929 to 1941 – in pictures",
    "Fighting back with the banned book reading room",
    "Country star to host Beatles, Elton John and 39 other stars on new rock album",
    "Inside Ed Sheeran’s mysterious fanbase",
    "Memoir rumour pushes mysterious untitled US book up charts",
    "Will New Zealand join? What links the Beatles to peace in Ukraine?",
    "Raucous high school reunion for the sk8er dads",
    "Can New York’s Carbone survive its own success?",
    "Poached pears, winter salad and ‘unthinkable’ pasta",
    "Hotpants and catsuits hit tinsel town",
    "Secret sex signals: love languages of long-term couples",
    "The ultimate guide to making guacamole",
    "I wrote 100 letters to my friend with cancer. It transformed our lives",
    "Donald Trump Ex-president could face questions on sexual abuse verdict in CNN town hall",
    "E Jean Carroll v Trump How the civil court case unfolded",
    "Key moments Donald Trump trial that gripped America",
    "Republican releases Trump January 6 attack ad aimed at CNN town hall",
    "US economy inches toward default amid Biden-McCarthy deadlock",
    "Photos show children illegally working in US slaughterhouse",
    "Teenager shot by neighbor as she played hide-and-seek",
    "Fast-food chain to test AI chatbot that takes your drive-thru order",
    "Enrollment in US schools hasn’t bounced back since pandemic, data shows",
    "Senator to resume duties after long absence due to illness",
    "Gunman who killed eight had ‘neo-Nazi’ ideation, say officials",
    "Ethics group calls on justice to resign over undisclosed gifts",
    "Host to revive show on Twitter after Fox News dismissal",
    "Former PM Imran Khan appears before judge amid uproar",
    "Interpol calls for help naming 22 women murdered in past 50 years",
    "Militants fire 60 rockets following Israeli airstrikes",
    "Moulin Rouge forced to drop ‘cruel’ underwater act that used snakes",
    "Village to be evacuated over Alpine rockslide fears",
    "UK man pleads guilty to hijacking accounts including of Joe Biden and Elon Musk",
    "Scotland Yard admits failing to hand over documents to Daniel Morgan inquiry",
    "Police officer kills five in shooting near Africa’s oldest synagogue",
    "EU parliament to vote on proposed ban on facial recognition in streets",
    "An existential threat and risk to health of millions, experts warn",
    "A woman expresses how it feels to survive rape",
    "The extraordinary friendship formed in the shadow of the Bataclan",
    "Some of the first humans in the Americas came from China, study finds",
    "Why Erdoğan faces real chance of losing as Turkey gets ready to vote",
    "Lithe lizards and a dog’s dinner",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Liz Cheney releases Trump January 6 attack ad aimed at CNN town hall",
    "Donald Trump could face questions on sexual abuse verdict in CNN town hall",
    "How finding a home in America became so absurdly expensive",
    "Scarlett Johansson: losing Gravity role to Sandra Bullock made me feel hopeless",
    "The west must be ready for this moment of opportunity and risk in Ukraine",
    "Pressure builds as North Carolina set to override abortion ban veto"
]