[
    "The Guardian - Back to home",
    "Trump rape trial Jury begins deliberations in civil trial",
    "Donald Trump rape trial: jury to begin deliberations in E Jean Carroll lawsuit",
    "LAPD reels after release of undercover identities",
    "Ex-fixer accuses Trump of using $500m lawsuit for witness intimidation",
    "David Miranda, campaigner and former congressman, dies aged 37",
    "‘Gun-loving’ ex-army officer urges gun control after seeing shooting",
    "Former PM Imran Khan arrested in Islamabad",
    "Zelenskiy tells EU grain restrictions ‘completely unacceptable’; Putin defends Ukraine invasion",
    "Republican who called drag shows a threat to kids quits after sex with intern",
    "Republicans take aim at Biden’s climate plan as deadline nears",
    "Author of children’s book on grief charged with murdering her husband",
    "What’s at stake for Florida as legal tug-of-war ramps up?",
    "Officials say ‘Arcturus’ could be linked to conjunctivitis",
    "Many soft lenses in US made up of PFAS, research suggests",
    "Migrants stranded in Chilean desert as Peru closes border",
    "Russian missiles downed over Kyiv as Putin makes angry speech",
    "Putin recycles old grievances on Victory Day as Russian army battered in Ukraine",
    "Ukrainian soldiers struggle with post-traumatic stress",
    "What we know on day 440 of the invasion",
    "The strange story of Clarence and Ginni Thomas",
    "Will it be the most horrifying film since Cats?",
    "My face burned and my memory disappeared. Here is how I made it back",
    "An underwater kingdom for enslaved people who died in the Atlantic",
    "Real Madrid v Manchester City feels like a final as two dominant teams meet",
    "How the ‘benefits cliff’ holds women back",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Can rapper stop actor Reynolds expanding his sports empire?",
    "Unlikely hero Walker outshoots Curry as Lakers close on series win",
    "Former NFL star goes on Burnley pub crawl for ‘research’ after investing in club",
    "WVU reviewing ‘abhorrent’ homophobic slurs by basketball coach",
    "The photo that captured an iconic Milan derby moment",
    "‘A parent at sports day tried to psych me out’",
    "Fans, an anthem and a battle for who controls public space",
    "Sign up to the US opinion email",
    "Why is Google stonewalling regulation in Brazil?",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "I bought an urn for $30 to put my dad’s ashes in, but had to remove the original inhabitant first",
    "Nepo babies have never been bigger. So why are the Windsors and the Roys so unhappy?",
    "Our obsession with sleep is doing more harm than good – and ignores the real problem",
    "Why are biographies so popular? Because humans are enthralled by the lives of others",
    "AI machines aren’t ‘hallucinating’. But their makers are",
    "As the Ukraine war grinds on, Russia is becoming a cultural wasteland",
    "‘Mind-boggling’ methane emissions from Turkmenistan revealed",
    "Italian oil firm Eni faces lawsuit alleging early knowledge of climate crisis",
    "Frogs croak at a higher pitch due to global heating",
    "Why ‘godfather of AI’ Geoffrey Hinton thinks humanity is at a crossroads",
    "Listen to previous episodes",
    "Hong Kong’s neon signs light up nostalgic drama",
    "Nintendo fans explain the hype for Tears of the Kingdom",
    "Strange depths and an arresting originality",
    "Meet Peridot, the AR pet app from the makers of Pokémon Go",
    "Bone-breaking horror of post-partum depression",
    "Film revives memories of girl’s death as country reviews abortion rules",
    "Iain Farrington on music fit for a king – and what the cameras didn’t show",
    "IRA man and British soldier lock horns in Troubles revenge drama",
    "Prequel paused as Hollywood writers’ strike continues",
    "Winners include Hernan Diaz, New York Times and AP",
    "$30 for a tiny bag of poo?! What really goes into luxury compost",
    "Tell us: did you have a ‘micro-micro wedding’?",
    "Flaps the dog gave me a nasty bite – but I kept quiet to save his life",
    "Mark Zuckerberg joins Tom Hardy on list of famous Brazilian jiu-jitsu fighters",
    "How to save money on laundry",
    "Texas mall shooting Family and friends identify victims",
    "Texas ‘Gun-loving’ ex-army officer calls for gun control",
    "Victims Grade-school sisters and young engineer killed",
    "US on track to set record in 2023 for mass killings after series of shootings",
    "Hawley slams influencer for ‘locker room talk’ – but doesn’t mention Trump",
    "Man wrongly convicted of rape released after 29 years in prison",
    "Ex-president is ‘nonstop’ liar who destroyed E Jean Carroll’s reputation, jury hears",
    "Governor signs bill allowing teachers to ignore students’ pronouns",
    "US lawmakers consider getting rid of borrowing limit as crisis looms",
    "Family criticizes marine veteran for not offering apology",
    "Police charge suspect with manslaughter after eight killed",
    "US proposes rules requiring airlines to compensate passengers for flight delays",
    "US truck drivers push for better working conditions",
    "Major UK supermarket chair accused of inappropriate behaviour by four women",
    "Israel bombs Gaza Strip, killing three Islamic Jihad leaders and nine civilians",
    "Turkish opposition hopes ideas prevail over personality",
    "Sydney jeweller accused of orchestrating $2.8m armed heist in own store",
    "Spare ghostwriter says he and duke bonded over media intrusion",
    "Bear held for killing jogger is innocent, say animal activists",
    "Autopsies reveal missing organs in cult deaths, say police",
    "French police intervene in neighbours’ frog row",
    "Simple measures could save 1 million babies a year, doctors plead",
    "Author Tsitsi Dangarembga has conviction for protest overturned",
    "On the trail of the Dark Avenger: the most dangerous virus writer in the world",
    "Apple co-founder warns AI could make it harder to spot scams",
    "Dust cloud discovered around one of sky’s brightest stars",
    "Protests, a parade and a pampered pooch",
    "Yardworks urban art and graffiti festival 2023",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Russian missiles downed over Kyiv as Putin makes angry Victory Day speech",
    "First Thing: Ted Cruz faces backlash after deadly Texas mall shooting",
    "‘So improbable, it’s a novel’: the strange story of Clarence and Ginni Thomas",
    "‘A blunder that is just epic’: LAPD reels after release of undercover identities",
    "Disney v DeSantis: what’s at stake for Florida as legal tug-of-war ramps up?",
    "Michael Cohen accuses Trump of using $500m lawsuit for witness intimidation",
    "Covid officials say new ‘Arcturus’ variant could be linked to conjunctivitis"
]