[
    "The Guardian - Back to home",
    "Talks briefly resume as US default deadline creeps closer",
    "Country's elite backed death squads, former paramilitary commander says",
    "Barack Obama Ex-president among 500 banned from Russia in retaliation for US sanctions",
    "Explainer How could F-16s make the difference for Ukraine in the war against Russia?",
    "US to back fighter jet training for pilots, official says",
    "All-time NFL great and social activist dies aged 87",
    "Jordan Neely was ‘screaming for help’, Al Sharpton says in funeral eulogy",
    "Ex-chief of Indigenous agency charged over murders of pair",
    "Fox News’s ‘vitriolic lies’ threaten democracy, says disinformation expert suing channel",
    "Bureau broke own rules in January 6 and BLM intelligence search, court finds",
    "Legislature passes 12-week abortion ban after bitter struggle",
    "Hyundai and Kia settle lawsuit worth $200m over vehicle theft due to TikTok",
    "Indigenous nation in US seeks to block billion-dollar port project",
    "LA Pride pulls out of Dodgers’ Pride Night after drag nun group is disinvited",
    "Trudeau’s wide-stance pose with Korean politician splits critics",
    "City is sinking due to weight of its skyscrapers, research finds",
    "Naloxone has been hailed as life-saving. Why isn’t it given to those who need it?",
    "At a glance Russia-Ukraine war: what we know on day 451",
    "Catch up with the must-read news and analysis",
    "Arrest order for British ICC prosecutor issued after Putin warrant",
    "Foreign minister steps up threat to block EU weapons aid for Ukraine",
    "Dreams shattered as war scatters Ukraine documentary’s teenage stars",
    "The woozy, not-dreadful experience of being a life model",
    "The continuing rise of the waistcoat",
    "Actor’s return to Cannes exposes French split over #MeToo",
    "Ravneet Gill’s recipe for strawberry and custard tart",
    "Andy Rourke's distinctive melodic style was central to the Smiths",
    "He voted for the first time in 2020. Then came the criminal charges",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "$209bn a year is what fossil fuel firms owe in climate reparations. We want that paid",
    "Negotiating with post-Trump Republicans is like dealing with a toddler’s tantrum",
    "Did Harry and Meghan exaggerate their ‘catastrophic’ chase? It’s complicated",
    "They’re openly saying it: Brexit has failed. But what comes next may be very dark indeed",
    "Andy Rourke was the other melodic genius in the Smiths: spry, funky and masterful",
    "Does the west really want Ukraine to win the war? If so, increase military support",
    "My students are using AI to cheat. Here’s why it’s a teachable moment",
    "Speak now: why pop stars must do more to defend LGBTQ+ fans",
    "In pictures Jim Brown (1936-2023)",
    "All-time NFL great running back and social activist dies aged 87",
    "PGA Championship 2023 – second round updates",
    "Day two Rose blooms despite challenging conditions",
    "Simona Halep Romanian hit with second anti-doping offense",
    "Rybakina beats Ostapenko to reach Italian Open final",
    "Simply the best? Manchester City have hit greatness without friction",
    "Premier League Ten things to look out for this weekend",
    "Tory treasurers, tribal leaders and a $500m California dream",
    "Mage faces tough Preakness challenge as First Mission scratched",
    "Taylor braced for ‘hardest fight of career’ against Cameron",
    "Arsenal bottled it? That’s just a quick, cheap narrative",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "The new marine sanctuary for the super-rich LA coast",
    "Harrison Ford reduced to tears in Cannes over Indiana Jones’s return",
    "Wanda Sykes, the uncancellable standup superstar",
    "Cate Blanchett’s boozy nun indulges possible second coming in woozy wartime saga",
    "Jonathan Glazer adapts Martin Amis’s chilling Holocaust drama",
    "An education in consent for 24 hour party people",
    "Author makes first public appearance since attack, praising ‘heroes’ who saved him",
    "French director asked to sleep with me to ‘see what my orgasms were like’ for a role",
    "Cha cha cha! Eurovision stars dominate UK Top 10 after record-breaking final",
    "Bloomsbury admits using AI-generated artwork for Sarah J Maas novel",
    "Peter Rabbit story originated in African folktales, expert argues",
    "Rishi Sunak and Akshata Murty take careful approach at G7",
    "Turn off your email, get the packing right – and never, ever play Monopoly",
    "Daisy Jones & the Six is a blueprint for delicious holiday style",
    "I can’t get past how empty I feel since my best friend died",
    "How Republicans are embracing the accused subway killer Daniel Penny",
    "Parents of trans children seek to block state ban on gender-affirming care",
    "Prosecutor signals charges in 2020 election inquiry may come end of July",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Florida governor says only he can beat Biden in 2024 presidential election",
    "‘Taylor Swift bill’ aims to make ticket prices transparent",
    "Groom remembers bride killed in wedding night crash as ‘amazing human’",
    "Airline ‘sincerely apologizes’ to family over Puerto Rico passport error",
    "Couple ‘demand agency hand over car chase images’",
    "Creators sue to block Montana’s ban on app",
    "Iran executes three men accused over anti-government protests",
    "Villages evacuated as ‘very large’ wildfire ravages south-west",
    "How leaving EU came back to bite UK Conservatives",
    "Imran Khan alleges ‘reign of terror’ as supporters face trial in military courts",
    "Toddlers’ gut bacteria may predict future obesity, study suggests",
    "Silvio Berlusconi released from Milan hospital after six weeks",
    "Bashar al-Assad tells Arab League he hopes his return marks new era of peace",
    "King’s College London cuts ties over opioid crisis",
    "Government under fire after video shows ‘pushback’ of asylum seekers",
    "Court acquits tycoon in retrial over 2018 killing of journalist and fiancee",
    "Former PM and wife Carrie expecting third child in ‘just a few weeks’",
    "Montana TikTok users denounce ban",
    "Ukrainian punks Death Pill take fury on tour",
    "The spellbinding singer on anger, empathy and trans rights",
    "The Sicilian town trying to break free of its mobster past",
    "The daredevil group bringing ropewalking and climbing to the theatre",
    "I may have fallen in love with a sex worker I am paying. Could it be real?",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York City is sinking due to weight of its skyscrapers, new research finds",
    "Russia issues arrest order for British ICC prosecutor after Putin warrant",
    "Hungary steps up threat to block EU weapons aid for Ukraine",
    "‘Six times the size of Yosemite’: the new tribal sanctuary off the super-rich California coast",
    "‘An irresistible mix of art and genitals’: Caligula finally comes to Cannes",
    "Obama among 500 banned from Russia in retaliation for US sanctions",
    "Jim Brown, all-time NFL great running back and social activist, dies aged 87"
]