[
    "The Guardian - Back to home",
    "Truck driver convicted of killing 11 in synagogue attack",
    "Minneapolis police have pattern of aggression and discrimination, DoJ inquiry finds",
    "Workers vote to strike as negotiations continue",
    "Every driver’s license holder in state exposed in colossal cyber-attack",
    "Russia-Ukraine war live: Ukraine offensive moving towards Mariupol, minister says",
    "Supreme court upholds pact with US restricting asylum claims",
    "Huge landslide misses mountain village of Brienz ‘ by a hair’",
    "Former president criticizes GOP hopefuls Nikki Haley and Tim Scott over racism stances",
    "USA win over Mexico cut short by homophobic chants on night of four red cards",
    "Producer behind Biden ‘wannabe dictator’ chyron resigns",
    "Experts’ warning over khaki-clad Patriot Front",
    "Inside the war tearing psychoanalysis apart",
    "Irish national park battles slow-motion ecological calamity",
    "Boris Johnson: the week the wheels finally came off the bandwagon",
    "‘Rural people are so angry they want to blow up the system’",
    "What does end of Spotify deal mean for the couple?",
    "The Road director John Hillcoat on Cormac McCarthy",
    "The story of a trans journalist embedded with the Taliban",
    "The Star Wars villain we’ll never get to see",
    "I’m plagued by intrusive, violent thoughts. How can I lessen their impact?",
    "Why are TV dramas giving cigarettes a comeback?",
    "I knew nothing of the pandemic until my submarine surfaced",
    "Focus of war shifting south towards Mariupol, minister says",
    "As well as fighting Russia, Ukrainians are battling corruption at home",
    "What we know on day 478 of the invasion",
    "Western firms snub ‘Russian Davos’ as its prestige evaporates",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "To save their own skins, Trump and Johnson are destroying something precious: our faith in the law",
    "If the UK is really moved by starvation in North Korea, demand an end to cruel sanctions",
    "AI is already causing unintended harm. What happens when it falls into the wrong hands?",
    "Women’s sport is entering uncharted waters – can it remain true to its roots?",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "NBA bans Memphis star for 25 games over ‘reckless’ conduct",
    "US Soccer plays it safe by reappointing Gregg Berhalter as USMNT coach",
    "USA 3-0 Mexico Homophobic chants mar night of four reds",
    "US Open Fowler and Schauffele etch names into golfing folklore",
    "US Open golf 2023 – second round updates",
    "‘I want a platform that allows cycling to have a LeBron James’",
    "My wheelchair nightmare at Champions League final",
    "Ferrari’s Le Mans success cannot mask F1 struggles",
    "Cyclist dies at age of 26 after crash at Tour de Suisse",
    "McGregor denies allegation he sexually assaulted woman at NBA finals",
    "Campaigners win right to challenge food strategy over climate crisis",
    "Fossil fuel lobbyists will have to identify themselves when registering for conference",
    "US east coast cities warned to draft air quality plans similar to those in the west",
    "Extreme rainfall and heat hits China amid Asian heatwave",
    "Activists push for referendum to put ‘Cop City’ on ballot",
    "Actor, 83, and girlfriend Noor Alfallah, 29, welcome new baby",
    "Republicans end longest walkout in state legislature’s history",
    "Trump rivals struggle for attention after classified documents indictment",
    "Three people killed and one missing after tornadoes strike town",
    "Second defamation trial brought by E Jean Carroll set for January 2024",
    "Republican hopeful Mike Pence to release book on ‘how faith makes family’",
    "Abbott decision to bus migrants to LA condemned as ‘despicable stunt’",
    "Pentagon leaks suspect indicted by federal grand jury",
    "Church hands over ‘voluminous documents’ about accused US ex-priest",
    "Police rush to identify 15 victims of deadly highway collision",
    "Country violated rights of 13-year-old girl repeatedly raped by father, UN rules",
    "Ex-UK PM tells allies not to vote against Partygate report",
    "Police appeal for witnesses to attack on American tourists",
    "'Most rightwing government ever’ to cut spending and immigration",
    "Crypto exchange to quit the Netherlands and faces investigation in France",
    "Coastguard denies claims it could have prevented boat disaster",
    "Age of consent raised from 13 to 16 in reform of sex crimes law",
    "Court halts airing of documentary on Muslim minority",
    "Boris Johnson: the damning verdict",
    "Listen to previous episodes",
    "‘My dad wanted to be a star. It’s a sign of immaturity’",
    "Sigur Rós on their nightmarish recent years",
    "Prince Harry and Meghan’s multimillion-dollar deal to end",
    "Aaron Paul on Black Mirror, AI and his love of dark roles",
    "Working with the returning Glenda Jackson",
    "‘You know what I’m striving for? The perfect performance’",
    "Should restaurants ban guests from wearing strong perfumes?",
    "Why the humble suitcase is this year’s fashion must-have",
    "Benjamina Ebuehi’s recipe for coconut and cherry ice-cream sandwiches",
    "Plain ‘white people food’ goes viral in China",
    "Get an iron, go to a gallery and try ‘cuff-stacking’",
    "We put it to the taste test",
    "One of Britain’s largest sunken forests reveals its secrets",
    "Ignored and isolated: my nightmare in a wheelchair at the Champions League final",
    "Isle of Wight fossilised remains identified as new dinosaur species",
    "Caribbean island grapples with a ‘national crisis’ of violence",
    "Nigerians feel brunt of economic shakeup",
    "Thailand in limbo as Move Forward’s electoral impetus hits political roadblocks",
    "Nikola Jokić’s magnificent indifference to NBA glory",
    "Menswear SS24 highlights from Florence",
    "Landslides and sea turtles",
    "Homes for sale with grand designs",
    "The 10th BigPicture Natural World photography competition",
    "Travelling to pastures old in the Orobie Alps",
    "Fiji celebrates World Sea Turtle Day with conservation project",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘More extreme, more violent’: experts’ warning over khaki-clad Patriot Front",
    "Inside the war tearing psychoanalysis apart: ‘The most hatred I have ever witnessed’",
    "Trump offers ‘food for everyone’ at restaurant – then leaves without paying",
    "Obama criticizes GOP hopefuls Nikki Haley and Tim Scott over racism stances",
    "‘Lunch of suffering’: plain ‘white people food’ goes viral in China",
    "Fox News producer behind Biden ‘wannabe dictator’ chyron resigns",
    "‘A portion of paradise’: how the drought is bringing a lost US canyon back to life",
    "Peru violated rights of 13-year-old girl repeatedly raped by father, UN rules"
]