[
    "The Guardian - Back to home",
    "‘I want my left eye back’ People injured by 2020’s police violence speak out",
    "US cities to pay record $80m to people injured in 2020 racial justice protests",
    "Disgust over Brazilian mobile phone slavery game",
    "Explainer What went wrong at Ron DeSantis’s campaign launch?",
    "Ron DeSantis Florida governor's 2024 launch marred by Twitter tech meltdown",
    "Minority and activist groups warn of danger from ‘dictator’ DeSantis",
    "The contentious tool US immigration uses to get your data from tech firms",
    "Wagner group boss says its forces have begun leaving Bakhmut",
    "Winnie-the-Pooh book teaches kids to ‘run, hide, fight’ in a shooting",
    "UK study of 1948 Israeli massacre of Palestinian village reveals mass grave sites",
    "House Democrats laugh off call for ‘decorum’",
    "Nvidia gains $200bn in value after it predicts AI-driven boom in chip demand",
    "United Nations official and others in Armenia hacked by NSO Group spyware",
    "New Tower of London display acknowledges ‘complex’ history of crown jewels",
    "Man who debunked Mike Lindell’s ‘blatantly bogus’ data wants his $5m",
    "Twitter glitches deal double blow to Elon Musk and Ron DeSantis",
    "The Haitians who built a community in Tijuana – but are still stranded",
    "Will America’s first ‘right to sleep outside’ actually help people?",
    "Through pain and joy, Tina Turner wrote herself into pop history again and again",
    "‘Opposite of a diva’ Tina Turner remembered by Mad Max director George Miller",
    "Take part Share your tributes and memories of Tina Turner",
    "Tina Turner Ten of her greatest songs",
    "Now’s the time to think about just how bad a DeSantis presidency would be",
    "Why men lose their friends – and how they can make more",
    "A flawed reminder of when Star Wars was still an event",
    "How former UK prime minister took full advantage of grace and favour country house",
    "Evil-hippy horror looks for chills in desert",
    "Inside the Thai clinic taking on westerners’ gaming addictions",
    "WHO members vote to move Moscow office and urge country to stop attacks on hospitals",
    "Nobel peace prize winner moved to brutal prison",
    "What we know on day 456 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The NAACP says Florida isn’t safe for Black people. Unfortunately, they’re right",
    "Robert Reich What is going on with Elon Musk and Ron DeSantis?",
    "Is it a triumph for women that Martha Stewart, 81, is a swimsuit star?",
    "What’s the use of $800m, Bryan Johnson, if you dine on baby food?",
    "A few wise words have stopped me eating like a barnyard animal",
    "Look at what hedge funds really do – and tell me capitalism is about ‘rewarding risk’",
    "Folarin Balogun chose the US over England. He may have created a 2026 contender",
    "If everybody was the same, it would be a bit boring",
    "Tkachuk completes Panthers’ stunning run to Stanley Cup final",
    "The Recap Sign up and get our email of editors' picks",
    "How Tina Turner helped changed the face of the game",
    "A’s and Nevada reach tentative deal for $1.5bn ballpark on Vegas strip",
    "Police make welfare check on NBA star after concerning Instagram post",
    "Guardiola accepts point after party",
    "Slot rules out Spurs job by committing to Feyenoord",
    "Invasion of Ukraine ‘has fuelled funding boom for clean energy’",
    "Chevron’s carbon offsets are mostly junk and some may harm, research says",
    "Shipping faces foggy future as sea ice melts",
    "Police stage nationwide raids against climate activists",
    "One in five deaths among young people tied to fentanyl",
    "Florida man finds iguana lurking in his toilet bowl",
    "China-backed hackers spying on US critical infrastructure, says Five Eyes",
    "Family accuses auction house of stealing his clothes",
    "Convicted murderer faces federal charges of money laundering and fraud",
    "US Congress members demand that payment company end ban on Palestinian business",
    "Lawmakers blame each other for standoff: 'They're not negotiating'",
    "Home studio dismantled by Fox News workers",
    "Republican bill requiring display of Ten Commandments in schools fails",
    "Rapper sentenced to six years in prison for drug trafficking",
    "Millions who fled war facing fight to reclaim their homes, says human rights group",
    "Ex-police chief arrested in South Africa over 1994 genocide",
    "Noodle vendor who parodied Salt Bae jailed for ‘anti-state propaganda’",
    "Huge fire engulfs buildings near Central Station in Sydney",
    "Economy in recession after high prices take toll, revised figures reveal",
    "Ship briefly grounded is refloated",
    "Ban weekend homework for overworked Filipino pupils, says lawmaker",
    "Families ask human rights court to free jailed opposition leaders",
    "‘A gamechanger’: new meningitis vaccine hailed as major step",
    "Paralyzed man walks using device that reconnects brain with muscles",
    "How a killing on the New York subway exposed a broken system",
    "Listen to previous episodes",
    "Arnie’s a natural comedian in this unstoppably daft crime drama",
    "Boil it, mash it, stick it in the bin",
    "Shailene Woodley sniper thriller like mid-season CSI",
    "Abba stars say they won’t appear at 50th anniversary of Waterloo win",
    "Revisiting the psychedelic creations of Moki Cherry",
    "A smart thriller about Instagrammers in mortal peril",
    "‘My guide dog could have gone up to anyone in the pub but he picked Gayle’",
    "My husband and I are separating – but he doesn’t want anyone to know",
    "Ice-cream with gherkins! Mash sandwiches! Maltesers in wine!",
    "‘She thinks there shouldn’t be private schools - but banning them would be authoritarian’",
    "Game of Thrones backdrop becomes Unesco geopark",
    "Martha Stewart on Sports Illustrated: a win for women?",
    "The strange survival of Guinness World Records",
    "Do gun violence prevention groups have a race problem?",
    "A history, from the 4th century to Gucci",
    "Dodgers re-invite drag nuns to Pride Night after cutting them",
    "How Tossa de Mar became a hot spot",
    "Activists continue fight against Poland’s strict abortion laws",
    "A road trip from Texas to LA",
    "Mexico’s Popocatépetl volcano spews ash and smoke",
    "Alpine wall art and drones in Morocco",
    "A magic moment and psychedelic rock",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "The parting gift from my dying friend was an extraordinary act of selfless compassion",
    "Tina Turner: legendary rock’n’roll singer dies aged 83",
    "Tucker Carlson home studio dismantled by Fox News workers",
    "What is going on with Elon Musk and Ron DeSantis?",
    "House Democrats laugh off Marjorie Taylor Greene’s call for ‘decorum’"
]