[
    "The Guardian - Back to home",
    "Russia-Ukraine war: counteroffensive records ‘tactical successes’ as troops advance south",
    "Man freed after nearly three decades on death row",
    "Dramatic week in Montana climate trial as youngsters tell of toll on lives",
    "Nevada crawling with thick carpet of Mormon crickets",
    "Pentagon Papers whistleblower dies aged 92",
    "Minneapolis police have pattern of aggression and discrimination, DoJ inquiry finds",
    "Kim Jong-un attends key meeting as US sends nuclear submarine to South Korea",
    "Truck driver convicted of killing 11 in synagogue attack",
    "Every driver’s license holder in state exposed in colossal cyber-attack",
    "Judge blocks implementation of ban on treatment for trans minors",
    "Paris talks to focus on funding for poor countries",
    "Experts’ warning over khaki-clad Patriot Front",
    "Boris Johnson: the week the wheels finally came off the bandwagon",
    "Why is Melbourne’s housing still so much cheaper than Sydney’s?",
    "How Hitler, Stalin and Trump show it’s easier than you think",
    "‘I may have embarrassed him by asking if he was rich’",
    "Intelligence service career informs former MI5 and MI6 man’s novel",
    "17 travel writers on the country that feels like home",
    "‘Rural people are so angry they want to blow up the system’",
    "The Star Wars villain we’ll never get to see",
    "Hope gives way to fury in Greece as hunt for survivors ends",
    "I’m plagued by intrusive, violent thoughts. How can I lessen their impact?",
    "Focus of war shifting south towards Mariupol, minister says",
    "On Ukraine’s counteroffensive frontline",
    "Catch up with the must-read news and analysis",
    "What we know on day 479 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "To save their own skins, Trump and Johnson are destroying something precious: our faith in the law",
    "If the UK is really moved by starvation in North Korea, demand an end to cruel sanctions",
    "AI is already causing unintended harm. What happens when it falls into the wrong hands?",
    "Women’s sport is entering uncharted waters – can it remain true to its roots?",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "US Soccer plays it safe by reappointing Gregg Berhalter as USMNT coach",
    "USA 3-0 Mexico Homophobic chants mar night of four reds",
    "USWNT captain to miss World Cup due to foot injury",
    "NBA bans Memphis star for 25 games over ‘reckless’ conduct",
    "As it happened US Open 2023 – hole-by-hole with our writers",
    "McIlroy finds groove on front nine to stay in the mix",
    "Golfer confirms absence from Open after surgery",
    "‘I want a platform that allows cycling to have a LeBron James’",
    "My wheelchair nightmare at Champions League final",
    "Ferrari’s Le Mans success cannot mask F1 struggles",
    "Campaigners win right to challenge food strategy over climate crisis",
    "Fossil fuel lobbyists will have to identify themselves when registering for conference",
    "US east coast cities warned to draft air quality plans similar to those in the west",
    "Extreme rainfall and heat hits China amid Asian heatwave",
    "Former president criticizes GOP hopefuls Nikki Haley and Tim Scott over racism stances",
    "US woman pleads guilty over mother’s suitcase murder",
    "Producer behind Biden ‘wannabe dictator’ chyron resigns",
    "Actor, 83, and girlfriend Noor Alfallah, 29, welcome new baby",
    "Workers vote to strike as negotiations continue",
    "Republicans end longest walkout in state legislature’s history",
    "Activists push for referendum to put ‘Cop City’ on ballot",
    "Trump rivals struggle for attention after classified documents indictment",
    "Three people killed and one missing after tornadoes strike town",
    "Second defamation trial brought by E Jean Carroll set for January 2024",
    "Supreme court upholds pact with US restricting asylum claims",
    "'Most rightwing government ever’ to cut spending and immigration",
    "Huge landslide misses mountain village of Brienz ‘by a hair’",
    "3,000-year-old sword unearthed in Germany",
    "Coastguard denies claims refugee boat capsized after tow rope attached",
    "Police rush to identify 15 victims of deadly highway collision",
    "Police appeal for witnesses to attack on American tourists",
    "Country violated rights of 13-year-old girl repeatedly raped by father, UN rules",
    "Officials fight for possession of French Revolution-era letter",
    "One Fine Morning and the best films about children parenting their parents",
    "Sleeping with the Ancestors review: slavery and the fight for Black history",
    "The telltale sign of too much browsing",
    "When We Were Sisters by Fatimah Asghar review – a poetic tale of familial grief",
    "Aaron Paul on Black Mirror, AI and his love of dark roles",
    "I’m a Virgo: this magical tale about a giant teenager is joyously bold",
    "How to turn stale bread into ‘poor man’s pesto’",
    "Researchers one step closer to growing decaffeinated beans",
    "Should restaurants ban guests from wearing strong perfumes?",
    "Why the humble suitcase is this year’s fashion must-have",
    "Benjamina Ebuehi’s recipe for coconut and cherry ice-cream sandwiches",
    "Inside the war tearing psychoanalysis apart",
    "New Zealand on alert as ‘seal silly season’ begins",
    "One of Britain’s largest sunken forests reveals its secrets",
    "Seigneur of Sark takes on Barclay dynasty",
    "Caribbean island grapples with a ‘national crisis’ of violence",
    "Isle of Wight fossilised remains identified as new dinosaur species",
    "The week around the world in 20 pictures",
    "Menswear SS24 highlights from Florence",
    "Landslides and sea turtles",
    "Homes for sale with grand designs",
    "The 10th BigPicture Natural World photography competition",
    "Travelling to pastures old in the Orobie Alps",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘I want answers’: hope gives way to fury in Greece as hunt for survivors ends",
    "Barbara Kingsolver: ‘Rural people are so angry they want to blow up the system’",
    "Trump supporters react to the Fox News banners",
    "‘It’s 21st-century warfare’: on Ukraine’s counteroffensive frontline",
    "‘More extreme, more violent’: experts’ warning over khaki-clad Patriot Front",
    "Focus of war shifting south towards Mariupol, Ukrainian minister says",
    "Inside the war tearing psychoanalysis apart: ‘The most hatred I have ever witnessed’",
    "Heather Mack: US woman pleads guilty over mother’s suitcase murder",
    "‘Almost still shines’: 3,000-year-old sword unearthed in Germany"
]