[
    "The Guardian - Back to home",
    "Ukraine Russia targets Kyiv with massive overnight airstrike",
    "Joe Biden and Kevin McCarthy to meet as debt ceiling talks enter crunch time",
    "Plastics Pollution could be slashed by 80% by 2040, UN says",
    "Environment Cop28 host UAE’s approach is ‘dangerous’, says UN’s ex-climate chief",
    "EPA finally wakes up with stiff new climate rules",
    "Video shows Walgreens guard killing trans organizer Banko Brown as he left store",
    "Progressive organization Justice Democrats adopts four-day work week",
    "FBI accused of failures but key report finds no deep-state plot against Trump",
    "Republican who expanded voting faces primary threat from right",
    "US imports of ‘blood teak’ continue despite sanctions",
    "Oxford University cuts ties with family over links with opioids",
    "Pompeii dig finds skeletal remains dating back to Vesuvius earthquake",
    "TV personality, 81, becomes oldest Sports Illustrated swimsuit cover model",
    "How Amazon warehouses upended a sleepy New York neighborhood",
    "Why one-third of US college students don’t have enough to eat",
    "Poles divided over John Paul II abuse cover-up claims",
    "Could handbags be the haute couture solution to the Everglades python problem?",
    "The EU should start planning now for Russia after Putin",
    "What we know on day 447 of the invasion",
    "Ukraine strikes Russian forces before expected counteroffensive",
    "Images of Lukashenko released after rumours over leader’s health",
    "Revisiting the era of the It Girl",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "How Jennifer Hosten became the first Black Miss World – and an international diplomat",
    "How a sleek typeface became a neighborhood omen",
    "‘They found hell’: innocent foreigners caught in El Salvador’s mass arrests",
    "The secret of Liam Neeson’s success: a monomaniacal fixation on … tea?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Ja Morant, masculinity and the way of the gun",
    "Judge denies looking for signal before hitting home run against Blue Jays",
    "Former UFC champion signs with PFL after contentious split",
    "Djokovic overcomes Norrie after Italian Open flashpoint",
    "Klopp urges surging Liverpool to keep heat on top four",
    "The travails of Arsenal, Southampton and Pickford",
    "Thomas handed pink jersey as Covid hits Giro d'Italia",
    "Marcelo Bielsa takes over as manager of Uruguay",
    "Sign up to the US opinion email",
    "Republicans aren’t fixing the migrant border plight. In fact they’re making it worse",
    "Vice is going bankrupt, BuzzFeed News is dead. What does it mean?",
    "No one has accepted real responsibility for the East Palestine disaster",
    "Bird flu could become the next human pandemic – and politicians aren’t paying attention",
    "I’m an inspiration to my sister. Unfortunately, what I’ve inspired is a standup routine",
    "The biggest ever space explosion has occurred – what do you mean you don’t care?",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Erdoğan is in the lead in Turkey’s elections – and democracy is likely to be the loser",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Erdoğan survives, but will Turkish democracy?",
    "Listen to previous episodes",
    "AI songwriting is not a sin, says Neil Tennant",
    "Succession star recalls his father’s life-saving act: ‘He broke all the bones in both his legs’",
    "Joely Richardson is scarily fierce in tense thriller",
    "Cryptocurrency exchange founder to be subject of ‘high-octane’ book by Michael Lewis",
    "‘We wrote songs about our reality: the beach, sun and love stories’",
    "Could ChatGPT really write good book blurbs?",
    "The music stars protesting anti-drag laws",
    "‘Quite adorable’ dog in ‘wonderful red bow’ discovered in painting",
    "Sympathetic retelling of a tragic life",
    "Actor to star in movie adaptation of hit play Prima Facie",
    "Recipe for apricots with French toast and pistachio mascarpone",
    "My wife said her ex was a better lover than me – and we haven’t had sex since",
    "Nancy Birtwhistle’s budget midweek meal",
    "Why are so many young Americans adopting fake British accents?",
    "Why we need a new definition of junk food",
    "The spreading agony of kidney stones",
    "At least three dead and multiple wounded",
    "Punishing heatwave grips region as wildfires rage in western Canada",
    "Trump ally sued by former associate alleging sexual assault and harassment",
    "Suspect named in baseball bat attack at Democratic congressman’s office",
    "Groundbreaking Chicana California leader dies at 74",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "FBI criticized for mass-shooting survival video",
    "Church has $100bn ‘clandestine hedge fund’, says whistleblower",
    "White House releases show president's book royalties fell sharply last year",
    "Ron DeSantis signs laws to ease 2024 run",
    "Economic crisis expected to deepen after Erdoğan tops poll",
    "Five men found guilty over €113m Dresden jewellery heist",
    "US Speaker at conservatism event echoes far right in attack on ‘globalists’",
    "Only major opposition party is barred from running in July elections",
    "UN labour rights watchdog facing backlash over Qatar conference nomination",
    "Tiananmen Square books removed from libraries in run-up to anniversary",
    "Reports of women being raped in Khartoum by armed men",
    "Editors from around the world call for release of Hong Kong media mogul",
    "Tesla chief subpoenaed over JPMorgan’s role in Epstein’s activities",
    "Election goes to runoff after Erdoğan takes first-round lead",
    "Manipur violence fuels calls for separate state in India",
    "Who is Twitter’s new CEO and can she fix its problems?",
    "Living in the Alaska rainforest with 1,000 bears",
    "Thailand election: will Move Forward be able to claim power?",
    "German cattle and a cooking world record",
    "Female photographers from the Islamic world",
    "The unique landscape of Lake Erie",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Plastic pollution could be slashed by 80% by 2040, UN says",
    "Toronto mayor’s race draws more than 100 candidates – including one dog",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run",
    "‘The height of toxicity for women’: revisiting the era of the It Girl",
    "Martha Stewart, 81, becomes oldest Sports Illustrated swimsuit cover model"
]