[
    "The Guardian - Back to home",
    "White House Driver detained after truck crashes into security barriers near residence",
    "Biden and McCarthy hold talks to no avail as default deadline looms",
    "Author files for new damages after Donald Trump’s CNN town hall remarks",
    "Wooly mammoths What's impeding America’s big shift to green energy?",
    "Global heating Crisis will push billions outside ‘human climate niche’",
    "US states agree breakthrough deal to prevent river from drying up",
    "Outcry as World Health Organization locks out Taiwan under pressure from China",
    "Governor's $13.5m police program lures officers with violent records to Florida",
    "H5N1 virus in Brazil wild birds prompts animal health emergency",
    "Company suspends diversity chief over ‘Don’t Call Me Karen’ events",
    "Body of four-year-old boy found in river day after sister found dead",
    "Ratio of sheep to humans at lowest point in 170 years",
    "Homeless families to be moved out of London hotel during Beyoncé tour",
    "Woman reunited with ring after 13 years",
    "RRR, Thor and Star Wars actor dies aged 58",
    "Erdoğan gains endorsement of third placed 'kingmaker' for runoff",
    "Unhoused man hailed as an ‘angel’ after rescuing a family from an apartment fire",
    "Papua New Guinea’s security deal with the US is a win for Washington – for now",
    "Ukraine Russia tightens grip on Bakhmut in face of counterattacks",
    "The Russian region being dragged into Putin’s war on Ukraine",
    "Anti-Putin militia claims to have overrun border village",
    "Shakhtar Donetsk condemn Barcelona for players’ Russia message",
    "‘I was a 17-year-old versus a 600lb grizzly bear. I was going to die’",
    "Out of our minds: opium’s part in imperial history",
    "Fury as Maya train nears completion in Mexico",
    "Government accused of exerting ‘ruthless’ influence at state broadcaster",
    "Refugees huddle together in Dublin camp as local tensions rise",
    "‘You don’t even know what misogyny is until you’ve been a woman running for president’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "AI will take some jobs, but mass unemployment isn’t inevitable",
    "The Greek election: the new hegemony",
    "I stripped myself of clothes and shame. Then – on stage – I started to dance",
    "Centre-left politics has been dealt a crushing blow in Greece. What can we learn from it?",
    "Why I stopped arguing about the climate emergency and tried the silent treatment instead",
    "Growing up, every girl has a pop star they idolise – for me it was Neneh Cherry",
    "Nuggets sweep aside Lakers to reach first finals in club’s 56-year history",
    "LeBron James casts doubt over NBA future after loss",
    "NFL great set to become minority owner of Las Vegas Raiders",
    "Super Bowl LX awarded to 49ers’ Levi’s Stadium in 2026",
    "Magpies seal Champions League spot with draw",
    "NBA star and Olympic hero announces retirement after 19 seasons",
    "Vinícius Júnior and why it’s time to stop talking about the football",
    "I can disagree with Charles Barkley and still love him",
    "Why rising sea levels pose existential threat to the island – extract",
    "Big polluters’ share prices fall after climate lawsuits, study finds",
    "Meet the activists trying to save the seabed",
    "After the flood, storms lie ahead in race to hit carbon zero",
    "From pollution to policing – can Sadiq Khan clean up London?",
    "Listen to previous episodes",
    "Firebrand review Jude Law’s obese and oozy Henry VIII rules supreme in Catherine Parr drama",
    "Jude Law wore bespoke blood, sweat and faeces perfume to play Henry VIII",
    "Foo Fighters roar back with new drummer",
    "Halle Bailey goes full mermaidcore in Disney’s CGI remake",
    "How Martin Amis made everyone up their game",
    "Visually striking account of Siberian wildfires leans towards abstraction",
    "Jennifer Lawrence-produced documentary on Afghan women premieres",
    "Hip-hop A&R Dante Ross on De La Soul, ODB – and punchups with P Diddy",
    "Scorsese’s magnificent period epic is an instant American classic",
    "50 years of Pacha and the Ibiza club scene",
    "Booze, bird souls and Viggo Mortensen in barmy yet rich experimental enigma",
    "A hostage negotiator reveals the secrets that can transform your life",
    "50 years of Olivia, the lesbian cruise company",
    "Timnit Gebru on her sacking by Google, AI’s dangers and big tech’s biases",
    "I spent thousands on Ruby the guinea pig’s hysterectomy – and I don’t regret a penny",
    "It’s time to get ready for Barefoot-Boy Summer",
    "What to eat when you’re in the comfort zone",
    "Trump was warned about retaining classified documents, notes reveal",
    "Man charged over killing says ‘I’m not a white supremacist’",
    "Republican senator launches 2024 presidential run",
    "Company sues Montana after app is banned in state",
    "Republican witness faces questions over whether he lied under oath to key panel",
    "NAACP says state is ‘actively hostile’ to minorities and issues travel warning",
    "Pleas entered for suspect in 2022 student killings",
    "Fake AI-generated image of explosion spreads on social media",
    "Sex offender allegedly tried to extort Bill Gates over extramarital affair",
    "FBI investigating shooting death of Native man by border patrol",
    "Democrats fight to expand a ‘broken and illegitimate’ supreme court",
    "US-Saudi brokered ceasefire begins with reports of continued fighting",
    "Police to search reservoir for Madeleine McCann, say reports",
    "Facebook owner fined $1.3bn for breach of EU data protection regulation",
    "UK special forces have operated secretly in 19 countries since 2011",
    "Three Dutch mountaineers found dead in Alps",
    "PM seeks new poll in push for absolute majority after election win",
    "App to allow users to edit messages … but only for 15 minutes",
    "Highest-denomination bill in country is now the 2,000-peso note, worth $4",
    "Cocoa planting is destroying protected forests in west Africa, study finds",
    "‘We can’t breathe! We can’t see! We can’t hear!’",
    "‘Tennis is a different sport when you become the hunted’",
    "Gauri Gill on photographing India’s forgotten people",
    "Scientists discover brain signals for chronic pain",
    "What will we eat in a post-1.5C world? – podcast",
    "Why do minorities join the far right?",
    "Why you should embrace your inner fan",
    "A Welshman’s view of Arizona",
    "Garden flautist and Thai temple tourists",
    "Art that celebrates bathing",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "DeSantis’s $13.5m police program lures officers with violent records to Florida",
    "Ray Stevenson – RRR, Thor and Star Wars actor – dies aged 58",
    "Anti-Putin militia claims to have overrun village in Russia border region of Belgorod",
    "How solar farms took over the California desert: ‘An oasis has become a dead sea’",
    "America’s big shift to green energy has a woolly mammoth problem",
    "Ireland to introduce world-first alcohol health labelling policy",
    "E Jean Carroll files for new damages after Trump’s CNN town hall remarks"
]