[
    "The Guardian - Back to home",
    "Ukraine Russia targets Kyiv with massive overnight airstrike",
    "Progressive organization Justice Democrats adopts four-day work week",
    "How Amazon warehouses upended a sleepy New York neighborhood",
    "Trump-Russia John Durham's investigation of an investigation",
    "FBI accused of failures but key report finds no deep-state plot against Trump",
    "Kentucky Republican who expanded voting faces primary threat from right",
    "Plastic pollution could be slashed by 80% by 2040, UN says",
    "US imports of ‘blood teak’ continue despite sanctions",
    "Cop28 host UAE’s approach is ‘dangerous’, says UN’s ex-climate chief",
    "Video shows Walgreens guard killing trans organizer Banko Brown as he left store",
    "Martha Stewart, 81, becomes oldest Sports Illustrated swimsuit cover model",
    "Jeremy Strong recalls his father’s life-saving act",
    "EPA finally wakes up with stiff new climate rules",
    "Why one-third of US college students don’t have enough to eat",
    "Poles divided over John Paul II abuse cover-up claims",
    "Could handbags be the haute couture solution to the Everglades python problem?",
    "Kyiv air defences at work as Russia launches early morning strikes on Ukraine",
    "What we know on day 447 of the invasion",
    "Ukraine strikes Russian forces before expected counteroffensive",
    "UK pledges more weapons for Ukraine as president meets prime minister",
    "How Jennifer Hosten became the first Black Miss World – and an international diplomat",
    "How a sleek typeface became a neighborhood omen",
    "How two Colombians were ensnared in Bukele’s gang crackdown in El Salvador",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "Manipur violence fuels calls for separate state in India",
    "As mask mandates end Japan turns to tutors to relearn how to smile",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Ja Morant, masculinity and the misguided way of the gun",
    "Klopp urges surging Liverpool to keep heat on top four",
    "The travails of Arsenal, Southampton and Pickford",
    "Shevchenko on Milan beating Inter in the 2003 semis",
    "Alcaraz stunned by world No 135 Marozsan in Rome Open",
    "Thomas handed pink jersey as Covid hits Giro d'Italia",
    "Marcelo Bielsa takes over as manager of Uruguay",
    "A’s ask for $400m in public money as move to Las Vegas nears",
    "Sign up to the US opinion email",
    "Republicans aren’t fixing the migrant border plight. In fact they’re making it worse",
    "Vice is going bankrupt, BuzzFeed News is dead. What does it mean?",
    "The biggest ever space explosion has occurred – what do you mean you don’t care?",
    "No one has accepted real responsibility for the East Palestine disaster",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "Erdoğan is in the lead in Turkey’s elections – and democracy is likely to be the loser",
    "I’m a drag queen in Tennessee. The state’s anti-drag law is silly, nasty and wrong",
    "Turkey’s election results: a step towards autocracy?",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Erdoğan survives, but will Turkish democracy?",
    "Listen to previous episodes",
    "AI songwriting is not a sin, says Neil Tennant",
    "Bossa nova pioneer Carlos Lyra at 90",
    "Could ChatGPT really write good book blurbs?",
    "Revisiting the era of the It Girl",
    "The music stars protesting anti-drag laws",
    "‘Quite adorable’ dog in ‘wonderful red bow’ discovered in painting",
    "Sympathetic retelling of a tragic life",
    "Actor to star in movie adaptation of hit play Prima Facie",
    "Season four, episode eight – nothing is more sadistic than the words ‘Is that even true?’",
    "Pacy plant-based apocalypse",
    "My wife said her ex was a better lover than me – and we haven’t had sex since",
    "Nancy Birtwhistle’s budget midweek meal",
    "Why are so many young Americans adopting fake British accents?",
    "Why we need a new definition of junk food",
    "The spreading agony of kidney stones",
    "Every night I would sing to Cackles the goose. Then tragedy struck",
    "UN labour rights watchdog facing backlash over Qatar conference nomination",
    "Punishing heatwave grips region as wildfires rage in western Canada",
    "Trump ally sued by former associate alleging sexual assault and harassment",
    "Suspect named in baseball bat attack at Democratic congressman’s office",
    "Groundbreaking Chicana California leader dies at 74",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "FBI criticized for mass-shooting survival video",
    "Church has $100bn ‘clandestine hedge fund’, says whistleblower",
    "White House releases show president's book royalties fell sharply last year",
    "Ron DeSantis signs laws to ease 2024 run",
    "Only major opposition party is barred from running in July elections",
    "Reports of women being raped in Khartoum by armed men",
    "Editors from around the world call for release of Hong Kong media mogul",
    "Tesla chief subpoenaed over JPMorgan’s role in Epstein’s activities",
    "Five men found guilty over €113m Dresden jewellery heist",
    "Election goes to runoff after Erdoğan takes first-round lead",
    "Images of Lukashenko released after rumours over leader’s health",
    "Survivors urge G7 leaders to unite against atomic weapons",
    "British men making thousands by posing as fathers in citizenship scam, reports say",
    "Beijing jails US citizen for life on espionage charges",
    "Who is Twitter’s new CEO and can she fix its problems?",
    "Living in the Alaska rainforest with 1,000 bears",
    "Thailand election: will Move Forward be able to claim power?",
    "An egg: unfertilised, it is one giant cell",
    "Female photographers from the Islamic world",
    "The unique landscape of Lake Erie",
    "Leaders embrace and a stage invasion",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Ukraine: Russia targets Kyiv with massive overnight airstrike",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "‘The height of toxicity for women’: revisiting the era of the It Girl",
    "Jeremy Strong recalls his father’s life-saving act: ‘He broke all the bones in both his legs’"
]