[
    "The Guardian - Back to home",
    "Analysis Russian bloggers fill in counteroffensive blanks as Kyiv’s troops probe frontline",
    "Ukraine Significant escalation in fighting reported in Donetsk and Zaporizhzhia",
    "Wagner group Mercenaries capture Russian commander as Prigozhin feud with army escalates",
    "Ukraine deputy defense minister says forces moving to ‘offensive actions’ in some areas",
    "Environment Microplastics found in every sample of water taken during Ocean Race",
    "3M requests trial delay to settle water contamination lawsuit",
    "Live Nikki Haley accused of ‘Maga agenda’ after supporting abortion restrictions in town hall",
    "Republicans 2024 candidates criticize Trump for praising Kim Jong-un",
    "Trump critics warn of ‘deep decline of rule of law’ if he wins second term",
    "Trump-era officials under fire as nuclear fund for Bikini islanders is squandered",
    "Colleagues to complete slain reporter’s book",
    "Prince Harry not in court for phone-hacking trial ‘due to daughter’s birthday’",
    "Activist who revealed Houthi sexual abuses ‘detained by Saudi Arabia’",
    "California blames Florida after migrants left outside Sacramento church",
    "Three-year-old boy shot by Israeli soldiers dies in hospital",
    "Genetically modifying T-cells cuts blood cancer progression by 74%, trial finds",
    "‘Very last warning’ for 82-year-old convicted of dealing marijuana",
    "Colossal data centers are taking over the US countryside",
    "How a copyright dispute over FBoy Island is consuming world of reality TV",
    "The ultimate panacea – or wildly overhyped?",
    "A woman’s 10-year fight for justice against gang-rapists",
    "The truth about ‘local’ food in US supermarkets",
    "Are cats really domesticated?",
    "Father of teen killed in Alabama mass shooting speaks out",
    "Why it is time to embrace your quilt – without the guilt",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Italy’s ‘new Michelangelo’ bringing sculpture into 21st century",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "‘People were horrified. Then David Bowie bought it’",
    "War brings urgency to fight for LGBT rights in Ukraine",
    "What we know on day 467 of the invasion",
    "Pro-Ukraine group of partisans captures Russian soldiers",
    "Two-year-old girl killed in Russian missile attack on Dnipro",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Five things the US debt-ceiling deal suggests about the future",
    "Kim Jong-un’s new border wall could be a sign that his grip on North Korea is slipping",
    "For better or for worse: is the decline in marriage actually good for relationships?",
    "Exam season makes everyone unhappy. Why do we put up with it?",
    "Spain’s snap election could kill its housing revolution before it even gets started",
    "What even is El Niño? To be honest nobody really understands or cares any more",
    "Heat’s fourth-quarter rally upsets Nuggets in Game 2",
    "French Open: Gauff in fourth-round action",
    "Liverpool poised to sign Mac Allister from Brighton",
    "Woods hails Zhang as 20-year-old wins on pro debut",
    "León beat LAFC to continue Mexican dominance",
    "Spurs agree contract with Postecoglou to make him manager",
    "You have to control everything – it’s like chess … I calculate it all",
    "Hamilton hints he will be staying with Mercedes",
    "Countries must put aside national interests for climate crisis, UN says",
    "Rich nations undermining work to help poor countries, research suggests",
    "Why we need to respect Earth’s last great wilderness",
    "Can Mediterranean holidays survive?",
    "US jets pursue light aircraft over capital before it crashes in Virginia",
    "Directors union reaches tentative deal with studios as writers strike",
    "Family confirms missing resident found deceased in building collapse",
    "Florida taxpayers pick up bill for governor's culture war lawsuits",
    "Chuck Todd to leave Meet the Press after nearly 10 years",
    "Traffic cop sues city over ‘get-out-of-jail-free’ cards for NYPD friends and family",
    "School offers yearbook reprints after objections to LGBTQ+ content",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "Migrants flown from Texas to California and left outside church were ‘lied to’",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Police open criminal negligence case",
    "Officials fear for historical artefacts threatened by fighting",
    "Airborne DNA accidentally collected by air-quality filters reveals state of species",
    "Google and Facebook urged by EU to label AI-generated content",
    "Tory MP Bob Stewart charged with two public order offences",
    "Footage released of near miss between Chinese warship and US destroyer",
    "Sleeping apart due to snoring could improve relationships – scientist",
    "Brazil police charge alleged mastermind behind murders",
    "Film required so much pink paint it contributed to worldwide shortage",
    "Our critics’ guide to a summer of music, movies and culture",
    "Listen to previous episodes",
    "Why did Winston Churchill try to seize the BBC?",
    "Was Brian Cox written out of Succession too soon?",
    "Did it inspire Bowie’s Let’s Dance? How M made a crossover classic",
    "Wild skateboarding doc heads for Turkey",
    "Studio Ghibli to release Hayao Miyazaki’s final work with no trailers or promotion",
    "The rise of perfectionism – and the harm it’s doing us all",
    "De La Soul were my first music love – something my dad always understood",
    "My life as a pedestrian in badly behaved Britain",
    "Why Britain’s curry houses are in decline",
    "Can you use a pasta strainer instead of a hairdryer diffuser?",
    "Should I worry about them?",
    "Hongkongers defy attempts to forget Tiananmen",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "How Ghana became fast fashion’s dumping ground",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Revisiting the strange story of Natalia Grace",
    "Events in Brazil and UK to celebrate lives of Dom Phillips and Bruno Pereira",
    "Rising moon and raging fires",
    "The church at the end of the world – photo essay",
    "Strawberry moon and Lightsaber lessons",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘It’s like a death pit’: how Ghana became fast fashion’s dumping ground",
    "Wagner captures Russian commander as Prigozhin feud with army escalates",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "Ben Roberts-Smith and four key witnesses were not honest or reliable, judge says in full verdict",
    "The pet I’ll never forget: I was so proud of my Sea-Monkeys – until their orgies repulsed me"
]