[
    "The Guardian - Back to home",
    "Analysis Will the verdict affect Trump's 2024 presidential bid?",
    "E Jean Carroll v Trump How the civil court case unfolded",
    "Donald Trump Key moments in trial that gripped America",
    "Jury finds ex-president sexually abused E Jean Carroll",
    "Congressman George Santos charged by federal prosecutors",
    "Photos show children illegally working in US slaughterhouse",
    "Senator to resume duties after long absence due to illness",
    "US economy inches toward default amid Biden-McCarthy deadlock",
    "Police officer kills four in shooting near Africa’s oldest synagogue",
    "Ethics group calls on justice to resign over undisclosed gifts",
    "UK man pleads guilty to hijacking accounts including of Joe Biden and Elon Musk",
    "An existential threat and risk to health of millions, experts warn",
    "Host to revive show on Twitter after Fox News dismissal",
    "Gunman who killed eight had ‘neo-Nazi’ ideation, say officials",
    "EU parliament to vote on proposed ban on facial recognition in streets",
    "Microbes discovered that can digest plastics at low temperatures",
    "Man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Air New Zealand to charge over $400 for a four hour snooze in the sky",
    "Russia UK poised to label Wagner group terrorists as France urges EU to act",
    "What we know on day 441 of the invasion",
    "Ukraine Russian missiles downed over Kyiv as Putin makes angry Victory Day speech",
    "French journalist killed in Russian rocket strike in Ukraine",
    "Putin recycles old grievances on Victory Day as Russian army battered in Ukraine",
    "Why Erdoğan faces real chance of losing as Turkey gets ready to vote",
    "‘Oh my God, Obama’s stopping by for pasta’: can New York’s Carbone survive its own success?",
    "What I faced after coming out as a queer Jehovah’s witness",
    "They’re back, and they’re as glorious as ever!",
    "American photography from 1929 to 1941 – in pictures",
    "Ditch your spade, forget fertiliser, listen to the weeds",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Embiid’s 33 points lift Sixers over Celtics in pivotal Game 5",
    "PBGV wins best in show in historic first for breed",
    "De Bruyne finds key as Madrid locked down in their super-prison",
    "Real Madrid 1-1 Man City Screamer gives City edge in semi",
    "UFC-backed tour leans into right-wing media ties",
    "Ex-Bills punter not present at time of alleged gang rape – report",
    "Pegula and Gauff rail at female players being silenced in Madrid",
    "Can rapper stop actor Reynolds expanding his sports empire?",
    "Former NFL star goes on Burnley pub crawl for ‘research’ after investing in club",
    "Sign up to the US opinion email",
    "E Jean Carroll won. And Trump can be now portrayed as a sexual abuser",
    "Dear CNN, giving Trump a town-hall platform is the height of irresponsibility",
    "The west must be ready for this moment of opportunity and risk in Ukraine",
    "It’s official: billionaires aren’t the brainboxes they like to believe",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "Why is Google stonewalling regulation in Brazil?",
    "Prog, angst and cosmic pyramids: why Daft Punk are my generation’s Pink Floyd",
    "Our obsession with sleep is doing more harm than good – and ignores the real problem",
    "‘Mind-boggling’ methane emissions revealed",
    "Shell shareholders should oust chair, says influential adviser",
    "Italian oil firm Eni faces lawsuit alleging early knowledge of climate crisis",
    "Did distress calls go unanswered in the run-up to a fatal Channel disaster?",
    "Listen to previous episodes",
    "Nintendo fans explain the hype for Tears of the Kingdom",
    "Memoir rumour pushes mysterious untitled US book up charts",
    "Will it be the most horrifying film since Cats?",
    "Fighting back with the banned book reading room",
    "Brazil’s undisputed Queen of Rock dies aged 75",
    "Meet Peridot, the AR pet app from the makers of Pokémon Go",
    "An underwater kingdom for enslaved people who died in the Atlantic",
    "Actor retires over French film sector’s ‘complacency’ towards sexual predators",
    "Tell us your favourite Eurovision song of all time",
    "I wrote 100 letters to my friend with cancer. It transformed our lives",
    "Sacked for flirting, for putting on weight, for wanting a baby … Who’d be a bridesmaid?",
    "Many soft lenses in US made up of PFAS, research suggests",
    "$30 for a tiny bag of poo?! What really goes into luxury compost",
    "Highlights from Mous Lamrabat’s photography exhibition",
    "Tell us: did you have a ‘micro-micro wedding’?",
    "Teenager shot by neighbor as she played hide-and-seek",
    "Why some California women try to avoid a raise",
    "Biden’s climate plan targeted as deadline nears",
    "$54m loss for first three months of 2023",
    "Republican who called drag shows a threat to kids quits after sex with intern",
    "LAPD reels after release of undercover identities",
    "DeSantis signs bills banning Chinese citizens from buying land",
    "Trump accused of using $500m lawsuit for witness intimidation",
    "Officials say ‘Arcturus’ could be linked to conjunctivitis",
    "Author of children’s book on grief charged with murdering her husband",
    "First UK baby with DNA from three people born after new IVF procedure",
    "‘Little evidence’ whether good or bad for relieving chronic pain",
    "Ex-Guardian columnist who played key role in Snowden story dies at 37",
    "Phone-hacking trial against Mirror due to begin",
    "Sudan’s doctors turn to social media as health infrastructure crumbles",
    "Entire Indian villages burned in ethnic violence",
    "Internet cut as violence erupts after arrest of ex-PM Imran Khan",
    "More than 400 people now confirmed dead after flooding",
    "Migrants stranded in Chilean desert as Peru closes border",
    "Keir Starmer refuses to rule out Lib Dem coalition after next election",
    "How Imran Khan became the man who divided a country",
    "US on track to set record in 2023 for mass killings after series of shootings",
    "Some of the first humans in the Americas came from China, study finds",
    "Saddle up for the Brokeback Mountain musical",
    "Protests, a parade and a pampered pooch",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "New York congressman George Santos charged by federal prosecutors",
    "‘They were little’: photos show children illegally working in US slaughterhouse",
    "Trump is now a legally defined sexual predator – will it affect his 2024 bid?",
    "Jury finds Donald Trump sexually abused columnist E Jean Carroll",
    "US ethics watchdog calls on Clarence Thomas to resign over undisclosed gifts",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "‘It massively backfired’: Republicanism in spotlight after arrests",
    "DeSantis signs bills banning Chinese citizens from buying land in Florida"
]