[
    "The Guardian - Back to home",
    "Miami ‘Food for everyone’, said Trump – but diners went hungry",
    "Westchester Trump celebrates as prosecutor closes tax inquiry",
    "Pence Radio host scolds Pence for not saying he’d pardon Trump",
    "Second defamation trial brought by E Jean Carroll set for January 2024",
    "Pentagon leaks suspect indicted by federal grand jury",
    "Abbott decision to bus migrants to LA condemned as ‘despicable stunt’",
    "Tornadoes strike town in north of the state, killing three and injuring 75",
    "People smuggling suspects arrested as search continues",
    "Russia-Ukraine war 150 children abducted from Luhansk and taken to Russia, says Ukraine",
    "‘Horrific’ highway crash leaves at least 15 dead",
    "Officials seizes enough fentanyl to kill city’s population three times over",
    "Prince Harry and Meghan’s multimillion-dollar deal to end",
    "Max Park takes astonishing 3.13 seconds to solve 3x3x3 cube",
    "Saving scheme for Caribbean migrants celebrated at Bank of England Museum",
    "Boris Johnson's parting shot speech analysed",
    "Hope fades among relatives of missing after Greek shipwreck",
    "What the papers say as committee delivers its verdict on former UK PM",
    "‘My dad wanted to be a star. It’s a sign of immaturity’",
    "Nikola Jokić’s magnificent indifference to NBA glory",
    "Thailand in limbo as Move Forward’s electoral impetus hits political roadblocks",
    "Plain ‘white people food’ goes viral in China",
    "The rise and fall of Milli Vanilli",
    "The singers lifting economies with their vocals",
    "‘Keep your reparations. It’s about access to capital, and we’re being shut out’",
    "Almost 60 years after the discovery of whale song, their haunting sounds reveal new secrets",
    "At a glance: What we know on day 478 of the invasion",
    "UN says situation at Zaporizhzhia plant is ‘serious’ but it can operate safely for ‘some time’",
    "As well as fighting Russia, Ukrainians are battling corruption at home",
    "Pilots being trained to fly F-16 jets, says Nato",
    "Western firms snub event as its prestige evaporates",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Call it the Rod Stewart manoeuvre. Who hasn’t had to dump a really appalling friend?",
    "What do you know, Boris Johnson lied. But the carnival of crazy has just begun",
    "Elizabeth Gilbert is pulling a novel set in Russia from publication. That’s unsettling",
    "The hard right and climate catastrophe are intimately linked. This is how",
    "Snarls and smears from disgraced Boris Johnson, readying his troops for civil war",
    "Extreme websites peddle conspiracies, but what about the mainstream outlets that do it too?",
    "Fowler and Schauffele hit 62s to etch names into golfing folklore",
    "McGregor denies allegation he sexually assaulted woman at NBA finals",
    "Jokić’s magnificent indifference to NBA glory",
    "Hamilton backs Verstappen to break his record",
    "A bluffer’s guide to the Ashes",
    "20 things I learned from the NBA playoffs",
    "PGA Tour’s controversial merger with LIV faces new threat",
    "Bellingham makes pitch-perfect start to epic Madrid adventure",
    "Fossil fuel lobbyists will have to identify themselves when registering for conference",
    "US east coast cities warned to draft air quality plans similar to those in the west",
    "Fears of hottest year on record as global temperatures spike",
    "Just Stop Oil protesters interrupt opera at Glyndebourne festival",
    "Nusrat Jahan Choudhury confirmed as first Muslim woman to be federal judge",
    "Church hands over ‘voluminous documents’ about accused US ex-priest",
    "Blinken visit seeks to ease fraught US relationship with China",
    "Native American tribes hail supreme court ruling",
    "Man dies in jail ahead of trial for murder of his mother on fishing trip",
    "Four indicted over ‘appalling’ theft of body parts from Harvard Medical School",
    "US midwest braces for smoky skies as Canadian wildfires rage on",
    "New game raises eyebrows in UK over similarity to Only Connect",
    "US Southern Baptist Convention upholds expulsion of churches over female pastors",
    "Actor sued by nine more women in Nevada over sexual assault allegations",
    "Up to 100 children were below deck, survivors say",
    "Benjamin Netanyahu suffers rebellion in vote linked to judicial overhaul",
    "Boris Johnson Key findings from report into lockdown partying",
    "Analysis Boris Johnson goes down fighting but runs head first into Partygate reality",
    "Ex-PM deliberately misled parliament over Partygate, damning report finds",
    "Age of consent raised from 13 to 16 in reform of sex crimes law",
    "Nigerians feel brunt of economic shakeup",
    "Over 500 dolphins killed since hunt resumed in May",
    "Double Oscar-winning actor and British politician dies aged 87",
    "Paramilitary forces blamed for assassination of West Darfur governor",
    "Police officer in hospital after swallowing extorted banknotes",
    "Sexual assault allegations against Till Lindemann to be investigated",
    "Boy killed in crash reportedly involving YouTubers filming in Lamborghini",
    "Boris Johnson: the damning verdict",
    "Listen to previous episodes",
    "Why multiplex multiverses are destined to fail",
    "The dark brilliance of Cormac McCarthy",
    "The 25 best stunts in cinema",
    "Chris Hemsworth action sequel most interested in extracting cash",
    "The quest for music’s most extreme sounds",
    "The 24-year-old with a brain tumour filming his family’s reaction",
    "Get an iron, go to a gallery and try ‘cuff-stacking’",
    "We put it to the taste test",
    "My shopping bags were too heavy. Could I embrace the obvious solution?",
    "Is it adultery if you cheat with an AI companion?",
    "'I saw a beautiful Black woman – and we shared an instant connection’",
    "‘She worried that 16- to 25-year-olds don’t have the maturity to make life-changing decisions’",
    "Bodies lie in the sand in Niger while Europe pours millions into blocking migration route",
    "Meet the Los Angeles sisters taking the design world by storm",
    "TikTok’s new trend of ‘canon events’",
    "How Turkish musicians welcomed Syrian refugees",
    "Empty seats at US graduations reveal toll of gun violence",
    "The sound ecologist capturing a disappearing world",
    "Travelling to pastures old in the Orobie Alps",
    "Fiji celebrates World Sea Turtle Day with conservation project",
    "Just Stop Oil in London and protest in Peru",
    "The 10th BigPicture Natural World photography competition",
    "Christopher Makos’s best photograph",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Trump offered ‘Food for everyone’ – but Miami restaurant patrons went hungry",
    "‘Lunch of suffering’: plain ‘white people food’ goes viral in China",
    "Native American tribes hail ‘major victory’ after supreme court ruling",
    "Trump celebrates as Westchester prosecutor closes tax investigation",
    "California seizes enough fentanyl in San Francisco to kill city’s population three times over",
    "Prince Harry and Meghan’s multimillion-dollar deal with Spotify to end",
    "‘Horrific’ Canada highway crash leaves at least 15 dead",
    "‘I need to go home’: Nikola Jokić’s magnificent indifference to NBA glory",
    "Western firms snub ‘Russian Davos’ as its prestige evaporates",
    "‘I have not seen one cent’: billions stolen in wage theft from US workers"
]