[
    "The Guardian - Back to home",
    "More than 800m trees felled in six years to meet beef demand",
    "The multinational companies that industrialised the Amazon rainforest",
    "Deforestation in Brazil’s Amazon rainforest",
    "A look at some of the corporations that dominate the Amazon",
    "‘Cop City’ protest lawyers challenge use of domestic terrorism statute",
    "Padma Lakshmi leaving show after 17 years as host and producer",
    "US debt ceiling Joe Biden hails ‘big win’ as bipartisan bill reaches his desk",
    "Mike Pence Former vice president will not face charges over classified files found at Indiana home",
    "Joe Biden to give Oval Office address on averted debt ceiling crisis",
    "Snow fly in US and Canada can detach its legs to survive, research shows",
    "Chemical giant Syngenta secretly pushed to bury a weedkiller’s link to Parkinson’s disease",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Georgia gun shop owner to close store as US reels from mass killings",
    "Head of trust and safety resigns in latest high-profile departure",
    "Mastermind of assassination of president sentenced to life by US court",
    "US air force colonel ‘misspoke’ about drone killing pilot who tried to override mission",
    "Woman finds foot-long ancient mastodon tooth on beach",
    "Florida Pride organizers on edge amid safety fears",
    "Fatigue and frayed nerves grip Kyiv as city shelters from nightly Russian raids",
    "Kevin McCarthy’s victory lap over the debt ceiling bill could end early",
    "What will happen when duke enters witness box in UK phone hacking trial",
    "Is The Idol the most shocking TV of the year?",
    "A history of Hollywood’s favourite queer character",
    "The reality of working in a college in badly behaved Britain",
    "Why Hollywood should stop splitting movies into two",
    "What became of last summer’s couples?",
    "Why were Italian and Israeli secret service agents on a boat in northern Italy?",
    "I was shot, and the bullet is still inside me",
    "My boyfriend controls me and threatens to leave when I see my friends. What can I do?",
    "Pro-Ukrainian forces ‘still fighting in Russia’s Belgorod’ despite Moscow claims",
    "Zelenskiy orders audit of Ukrainian air-raid shelters after civilian deaths",
    "What we know on day 464 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Don’t be fooled – Trump’s presidential run is gaining more and more momentum",
    "I could not, in good conscience, vote for the debt ceiling bill",
    "The hype has gone too far: why Succession’s finale was vastly overrated",
    "Not for the first time, Sunak has been hung out to dry by Johnson – how much more can he take?",
    "I’m a teacher – and this is why I’m not giving my son a smartphone yet",
    "Outclassed Miami look no match for the better team and the best player",
    "Player ratings Nicholas Levine's verdict from Denver's Game 1 win",
    "Miami 93-104 Denver Imperious Jokić shines as Nuggets cruise",
    "As it happened Read Hunter Felt's minute-by-minute report",
    "French Open Khachanov holds off Kokkinakis fightback",
    "French Open day six – Djokovic battles through, Norrie in action",
    "Champions League Marciniak to referee final after apology",
    "Manager facing touchline ban after Uefa charge for referee abuse",
    "McLaren's move for Marshall shows will to win intelligence war",
    "I’m a realist. Every game is a different story, a different film",
    "Caruana leads at Stavanger after beating Carlsen in opening round",
    "Beckham makes ‘tough decision’ as he sacks Neville at Inter Miami",
    "UK soccer must finally take a stand against antisemitism",
    "Country swelters through record temperatures, putting pressure on power grids",
    "US deal could plug Turkmenistan’s colossal methane emissions",
    "Outcry after leading climate activist arrested, accused of tax evasion",
    "Winners of $1m prize for sustainable transport announced",
    "Records shed light on his state of mind in jail in days before death",
    "Beyoncé and Jay-Z reportedly purchase most expensive home in California ever",
    "Group suing state says book ban law seeks to ‘criminalize librarians’",
    "Couple team up to save life of fellow passenger on Southwest flight",
    "Health advocates urge US regulators to ban common food coloring additive",
    "Boy, 14, from Florida lands ‘psammophile’ to take home prize",
    "US market remains strong despite high interest rates and debt ceiling fight",
    "Fort Bragg to drop its Confederate namesake to become Fort Liberty",
    "Senate votes to block loan forgiveness but Biden vows to veto bill",
    "Town hall plays it safe with Trump as network faces lawsuit",
    "Scientists discover mysterious cosmic threads in Milky Way",
    "Dozens killed in train crash in east of the country",
    "Black girl threatened after telling of unease over Of Mice and Men",
    "Michelin-starred chefs serve up $800 ‘four hands’ banquet in London",
    "Province hopes forecast rain will help contain largest wildfire on record",
    "UK institution ends BP sponsorship deal after 27 years",
    "Macron and Scholz call for fresh elections to ease Serbia tensions",
    "Ghanian author, ‘an inspiration to feminists everywhere’, dies aged 81",
    "‘Media must be more open to save democracy’, says former New York Times ombudsman",
    "Blood test for 50 types of disease could speed up patient diagnosis, study suggests",
    "Is Manchester City’s dominance of English football fair?",
    "Listen to previous episodes",
    "How the Bee Gees ruled late 70s pop",
    "British Vogue editor-in-chief promoted to new role",
    "Readers on Beyoncé’s Renaissance tour",
    "Riley Keough on movie-making, friendship and privilege",
    "The 12 clues that foreshadowed Succession’s ultimate winner",
    "Trying to get a bank spot is crazy as it’s become so popular",
    "The debt trap of payday loans",
    "How to get the quiet luxury look without the vulgar price tag",
    "Why do they eat grass? And when is it not safe for them?",
    "Becoming a father in later life",
    "Should my fiance start drying his hands instead of letting them drip dry?",
    "Japan’s footballers get their kicks in over-80s league",
    "Cop28 must deliver change of course on climate",
    "Five Sudanese writers on the country’s nightmare conflict",
    "Campaigner Brianna Craft on the struggle smaller countries face",
    "How blind women are helping detect breast cancer in India",
    "Twitter and Tesla’s interests at odds in quiet China visit",
    "Joe Biden and a sculpture in London",
    "Mostar’s Partisan Memorial Cemetery",
    "From owl chicks to hungry brown bear cubs",
    "Manhattanhenge sunset lights up sky",
    "Kiss fans, Poundland and Grenfell Tower",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "More than 800m Amazon trees felled in six years to meet beef demand",
    "‘I’m not used to seeing sex that kinky’: Is The Idol the most shocking TV of the year?",
    "US air force denies running simulation in which AI drone ‘killed’ operator",
    "Revealed: The secret push to bury a weedkiller’s link to Parkinson’s disease",
    "‘I can’t’: Georgia gun shop owner to close store as US reels from mass killings",
    "Usual lies but the big one is missing: key takeaways from the Trump-Fox town hall"
]