[
    "The Guardian - Back to home",
    "Brazil police charge alleged mastermind behind murders",
    "US jets pursue light aircraft over capital before it crashes in Virginia",
    "Full story Russia claims to have fought off ‘major Ukrainian offensive’",
    "Moscow claims to have repelled ‘major’ attack in Donetsk; Belgorod energy facility on fire",
    "Heat’s fourth-quarter rally upsets Nuggets in Game 2",
    "Rich nations undermining work to help poor countries, research suggests",
    "Nearly 80 primary schoolgirls believed poisoned",
    "Hundreds of thousands march against rightwing populist government",
    "Patients could be spared radiotherapy, US study suggests",
    "Virgin Mary apparitions ‘not always real’, says Pontiff",
    "Directors union reaches tentative deal with studios as writers strike",
    "Film required so much pink paint it contributed to worldwide shortage",
    "Revisiting the strange story of Natalia Grace",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Harry finally gets his day in court",
    "Events in Brazil and UK to celebrate lives of Dom Phillips and Bruno Pereira",
    "Amazon Jump in child deaths reveals impact of industrialisation on Indigenous peoples",
    "7 steps to save the Amazon",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "‘People were horrified. Then David Bowie bought it’",
    "The Full Monty’s Robert Carlyle on the role of a lifetime",
    "A woman’s 10-year fight for justice against gang-rapists",
    "Overwhelmed in London, I moved to Berlin to save my sanity – and savour a new life",
    "The rise of perfectionism – and the harm it’s doing us all",
    "My friends have heard some of the stories, but there’s some good ones I’ve been saving",
    "War brings urgency to fight for LGBT rights in Ukraine",
    "Pro-Ukraine group of partisans captures Russian soldiers",
    "Two-year-old girl killed in Russian missile attack on Dnipro",
    "What we know on day 467 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "For better or for worse: is the decline in marriage actually good for relationships?",
    "Fairytales have always reflected the morals of the age. It’s not a sin to rewrite them",
    "Brazil’s Javari valley is under threat. Lula’s government must protect it and its people",
    "So what if Biden trips up? On the political stage his footwork is the fanciest seen in decades",
    "Succession wasn’t about the Murdochs? Surely it’s how they’d like to see themselves",
    "I moved from the city to the suburbs – and I can’t believe my luck",
    "As it happened Hunter Felt's minute-by-minute report",
    "Spurs to appoint Postecoglou as Real Madrid eye Kane",
    "Woods hails Zhang as 20-year-old wins on pro debut",
    "Manchester United exposed at Wembley as a club stuck in the past",
    "Judge crashes through door to make potential catch of the year",
    "Emotional Ibrahimovic ends career at 41",
    "Motorcyclist killed and athlete severely injured during Hamburg race",
    "Hamilton hints he will be staying with Mercedes",
    "Why we need to respect Earth’s last great wilderness",
    "Can Mediterranean holidays survive?",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Chemical giant Syngenta secretly pushed to bury a weedkiller’s link to Parkinson’s disease",
    "Migrants flown from Texas to California and left outside church were ‘lied to’",
    "Florida taxpayers pick up bill for governor's culture war lawsuits",
    "Family confirms missing resident found deceased in building collapse",
    "Chuck Todd to leave Meet the Press after nearly 10 years",
    "Traffic cop sues city over ‘get-out-of-jail-free’ cards for NYPD friends and family",
    "School offers yearbook reprints after objections to LGBTQ+ content",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Gisele Barreto Fetterman, wife of US senator, hits out",
    "Trump-appointed judge says anti-drag law is unconstitutional",
    "Fighting escalates after breakdown in ceasefire talks",
    "Signal fault identified as cause, says minister",
    "Woman pardoned after 20 years in jail over deaths of her four children",
    "Former PM becomes a Dame as New Zealand awards her country’s highest honour",
    "Pressure builds on Johnny Kitagawa’s agency to address abuse claims",
    "Killer of three Israeli soldiers was Egyptian border police officer, says army",
    "Home search ‘proportionate and necessary’, says police chief",
    "Pill cuts risk of death by half, says study",
    "Dog breed under spotlight in UK after fatal attacks",
    "Police arrest pro-democracy activist on Tiananmen Square anniversary",
    "Our critics’ guide to a summer of music, movies and culture",
    "Listen to previous episodes",
    "A thoughtful celebration of the Dutch old master",
    "A blues fireball in full bloom",
    "Why we just can’t get her out of our heads",
    "An illustrious feelgood duet party",
    "The artists bringing creation out of Beirut’s chaos",
    "‘I work on canvases for years. It’s like making really good wines’",
    "My life as a pedestrian in badly behaved Britain",
    "Why Britain’s curry houses are in decline",
    "My husband and daughter won’t speak to each other",
    "‘If there’s wine on the table, sex is absolutely happening’",
    "Savouring the gastronomic highs of Hauts-de-France",
    "Analysis The Myanmar junta kills … and the rest of the world looks away",
    "Life and war inside rebel-held Myanmar",
    "Here’s what AI doomsday would look like",
    "The doctor treating the mental scars of Gaza’s children",
    "The truth about our electronic waste",
    "People are going homeless in this Victorian getaway spot. Could an Airbnb tax be the answer?",
    "The nightly vigil to sanctify January 6 rioters",
    "Strawberry moon and Lightsaber lessons",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Russian airstrikes in Kyiv, a shaky ceasefire in Sudan and protests in Senegal",
    "Milky Way photographer of the year 2023",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US jets pursue light aircraft over Washington DC before it crashes in Virginia",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "Russia-Ukraine war at a glance: what we know on day 467 of the invasion",
    "NBA finals Game 2: Miami Heat 111-108 Denver Nuggets – as it happened",
    "Kathleen Folbigg pardoned and released after 20 years in jail over deaths of her four children",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "Lung cancer pill cuts risk of death by half, says ‘thrilling’ study",
    "French Open: doubles pair disqualified after stray shot leaves ball girl in tears – video",
    "Six-year-old orphan or ‘con artist’ adult? Revisiting the strange story of Natalia Grace"
]