[
    "The Guardian - Back to home",
    "Bakhmut Zelenskiy denies Russian claims of taking city",
    "G7 Ukraine secures fresh aid as Russia hails Bakhmut ‘liberation’",
    "UK PM Ceasefire not enough without ‘durable’ peace",
    "Zelenskiy says Bakhmut ‘is not occupied’; Russia accuses G7 of ‘undermining global stability’",
    "Democrats fight to expand a ‘broken and illegitimate’ supreme court",
    "‘The exact opposite of Donald Trump’ Republican senator Tim Scott’s vision for America",
    "Fresh bans show Republicans trying to soften message",
    "At least 12 people dead after crowd crush at football stadium",
    "Era-defining British novelist dies aged 73",
    "Police investigate possible poisoning of two Russian exiles",
    "Japan and South Korea leaders mend fences in visit to memorial",
    "Far-right minister says country ‘in charge’ on visit to Jerusalem holy site",
    "Trans girl denied graduation ceremony after school’s dress-code ruling",
    "Canadian cyclist recovering after collision with bear",
    "Mark Zuckerberg’s metaverse vision is over. Can Apple save it?",
    "UK directors unsettle Cannes with films tackling ‘unseen’ evil",
    "Australia, India, Japan and US take thinly veiled swipe at China",
    "US rapper helps Scottish musician fund downpayment for house",
    "Kyiv denies Wagner claim to have captured Bakhmut",
    "Zelenskiy visit sends ‘incredibly powerful message’ to Russia, says Sunak",
    "What we know on day 452 of the invasion",
    "Providing Ukraine with jets a ‘colossal risk’ for west, Russia says",
    "‘I spend a lot of my work shredding people’",
    "How solar farms took over the California desert",
    "Martin Amis was Mick Jagger in literary form, I was besotted with his electrifying prose",
    "Artemis II crew certain of moon mission success",
    "Teacher aims to break Rockall record",
    "China crackdown on business has Maoist roots",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Hyperfatigue is the big thing in 2023, but what we really need are 50 words for tired",
    "There’s no shame in waging war on old age – long live Martha Stewart",
    "Depp comes up smelling of roses despite defamation trial’s catalogue of misogyny",
    "How philistine of David Starkey to limit western civilisation to whiteness",
    "When the tech boys start asking for new regulations, you know something’s up",
    "It’s easy to see white supremacy as the thinking of extremists. We know that’s not true",
    "An exhibition about milk’s complicated history has me rethinking my morning cuppa",
    "Parents may have the toughest job in the world, but they must let us go travelling",
    "Live scores Keep up with all Sunday's goals as they go in",
    "Arsenal Arteta laments lapses that finished off title hopes",
    "Jonathan Wilson Brilliant Brighton underline complex game",
    "West Ham v Leeds – Premier League",
    "Nuggets on brink of first ever finals after Murray mauls Lakers again",
    "Katie Taylor Irish star suffers first defeat as Cameron defends titles",
    "Haney wins disputed decision over Lomachenko to retain lightweight titles",
    "Ten title-race turning points How Manchester City overtook Arsenal",
    "Player ratings Who shone the brightest for City this season?",
    "Manchester City win their fifth title in six seasons",
    "Andy Murray withdraws in order to focus on Wimbledon",
    "Baffert’s National Treasure wins as another death mars day",
    "McIlroy remains in contention behind leader Koepka",
    "An immovable fixture in American life with a complex legacy",
    "Scientists look to clean up Antarctica",
    "Fossil fuel firms owe climate reparations of $209bn a year, says study",
    "Why are India’s lions increasingly swapping the jungle for the beach?",
    "More than half of the world’s lakes have shrunk in past 30 years, study finds",
    "Magazine journalist is Hollywood’s hot new thing",
    "How Katharine Hepburn was haunted by fear of audiences",
    "Jonathan Eig on his epic new biography",
    "‘I’m always nervous about the word identity. I try not to use it’",
    "An important challenge to western architectural tradition",
    "Could the show’s dysfunctional election fantasy become reality?",
    "Countercultural poet, singer and Cream lyricist dies aged 82",
    "Generic remake of the hit 90s comedy",
    "Harrison Ford, Phoebe Waller-Bridge and ‘peak noire’ on the Croisette",
    "Nobel laureate Annie Ernaux on her unapologetic career",
    "Stories from 75 years of Britain’s Caribbean food shops",
    "I’m consumed by a crush, but we are both married",
    "How India’s sari is taking over the world",
    "I dreamed up a character to cure my writer’s block. He saved my marriage too",
    "Orange and feta, tofu and shiitake: Yotam Ottolenghi’s ways with lettuce",
    "Mother of girl who died in US border patrol custody says agents ignored her",
    "Truck driver in crash that killed seven arrested on suspicion of drunk driving",
    "Viral story of migrants displacing unhoused veterans from hotels turns out to be false",
    "Christian university fires two staff for including pronouns in emails – reports",
    "Boy who saved sister by hitting would-be kidnapper with slingshot speaks: ‘I had to’",
    "Family of teen shooter who killed three says he struggled with mental illness",
    "Vigilante fears as Republicans push for special unit to detain migrants",
    "Bureau broke own rules in January 6 and BLM intelligence search, court finds",
    "Officer leaked information to Proud Boys leader, indictment alleges",
    "Legislature passes 12-week abortion ban after bitter struggle",
    "Major donor to party investigated over fraud and money laundering",
    "Italy: over 36,000 people displaced by floods as Giorgia Meloni departs G7 summit early",
    "As Greece goes to the polls, scandal, disaster and apathy eat into PM’s lead",
    "Social media firm to be fined £648m for mishandling user information",
    "Warring factions sign agreement for seven-day ceasefire",
    "Toxins from gut damage fat cells and drive weight gain, study suggests",
    "DUP urged to restore power-sharing in after Sinn Féin poll triumph",
    "Black Brazilians claim prime time as telenovelas finally reflect diversity",
    "Surge in strikes at Chinese factories after Covid rules end",
    "A US debt default could crush small businesses. So what can we do?",
    "Could prefab be the future of Australian homes?",
    "The inside story of a €1.6m wine heist",
    "The woozy, not-dreadful experience of being a life model",
    "Bats could be key to fighting next pandemic",
    "Free speech comedy clubs and the battle over onstage offence",
    "Life in New Zealand’s boarding houses",
    "Rocket festival and a beach protest",
    "Art that celebrates bathing",
    "Martin Amis's life in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "How solar farms took over the California desert: ‘An oasis has become a dead sea’",
    "‘Oh my God, what will they think?’ How Katharine Hepburn was haunted by fear of audiences",
    "‘The exact opposite of Donald Trump’: Republican senator Tim Scott’s vision for America",
    "New York Christian university fires two staff for including pronouns in emails – reports",
    "‘Trump’s not a good sport’: Chris Cillizza on presidents at play",
    "Paul Simon: Seven Psalms review – a surprise and a revelation"
]