[
    "The Guardian - Back to home",
    "'Roast and Ride' Republican primary revs up with bikers, BBQs and a Trump-shaped hole",
    "Republicans Chris Christie just wants to ‘bludgeon’ Trump, Fox News’s Hannity complains",
    "Ron DeSantis Florida governor thanks then attacks heckler who called him a fascist",
    "Florida taxpayers pick up bill for governor’s culture war lawsuits",
    "Rich nations undermining work to help poor countries, research suggests",
    "What caused the train crash?  A visual guide to what we know",
    "‘I feel so helpless’ Indians search for missing family at crash site",
    "Signal fault identified as cause, says minister",
    "Sonic boom from US fighter jets ‘pursuing light aircraft’ rattles residents",
    "Hundreds of thousands march against rightwing populist government",
    "Patients could be spared radiotherapy, US study suggests",
    "NBA finals Game 2: Miami Heat v Denver Nuggets",
    "Virgin Mary apparitions ‘not always real’, says Pontiff",
    "Aaron Judge crashes through door to make potential catch of the year",
    "Former PM becomes a Dame as New Zealand awards her country’s highest honour",
    "Directors union reaches tentative deal with studios as writers strike",
    "Revisiting the strange story of Natalia Grace",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Harry finally gets his day in court",
    "Events in Brazil and UK to celebrate lives of Dom Phillips and Bruno Pereira",
    "The Amazon village with a message for the world",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "Overwhelmed in London, I moved to Berlin to save my sanity – and savour a new life",
    "The Full Monty’s Robert Carlyle on the role of a lifetime",
    "The rise of perfectionism – and the harm it’s doing us all",
    "The battle to save Amsterdam’s old bars",
    "My friends have heard some of the stories, but there’s some good ones I’ve been saving",
    "How the largest US power firm avoided a trial for a deadly wildfire",
    "Pro-Ukraine group of partisans captures Russian soldiers",
    "Two-year-old girl killed in Russian missile attack on Dnipro",
    "‘Spymania’ grips security services amid sharp rise in treason cases",
    "What we know on day 467 of the invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "So what if Biden trips up? On the political stage his footwork is the fanciest seen in decades",
    "Fairytales have always reflected the morals of the age. It’s not a sin to rewrite them",
    "Brazil’s Javari valley is under threat. Lula’s government must protect it and its people",
    "Succession wasn’t about the Murdochs? Surely it’s how they’d like to see themselves",
    "I love electric vehicles – and was an early adopter. But increasingly I feel duped",
    "I moved from the city to the suburbs – and I can’t believe my luck",
    "Spurs to appoint Postecoglou as Real Madrid eye Kane",
    "Judge crashes through door to make potential catch of the year",
    "Manchester United exposed at Wembley as a club stuck in the past",
    "Emotional Ibrahimovic ends career at 41",
    "Motorcyclist killed and athlete severely injured during Hamburg race",
    "Hamilton hints he will be staying with Mercedes",
    "Svitolina outlasts Kasatkina to make quarter-finals",
    "Why we need to respect Earth’s last great wilderness",
    "Can Mediterranean holidays survive?",
    "Arizona limits future home-building in Phoenix area due to lack of groundwater",
    "Chemical giant Syngenta secretly pushed to bury a weedkiller’s link to Parkinson’s disease",
    "Migrants flown from Texas to California and left outside church were ‘lied to’",
    "Traffic cop sues city over ‘get-out-of-jail-free’ cards for NYPD friends and family",
    "Family confirms missing resident found deceased in building collapse",
    "Chuck Todd to leave Meet the Press after nearly 10 years",
    "Teacher Tasered by LAPD died from enlarged heart and cocaine use",
    "School offers yearbook reprints after objections to LGBTQ+ content",
    "Man eats McDonald’s three times a day for 100 days – and weight falls off",
    "Atlantic profile of CNN chief Licht details town hall disaster",
    "Gisele Barreto Fetterman, wife of US senator, hits out",
    "Trump-appointed judge says anti-drag law is unconstitutional",
    "Will ‘safe pair of hands’ Feijóo deal with far-right Vox and take power in Spain?",
    "Killer of three Israeli soldiers was Egyptian border police officer, says army",
    "Home search ‘proportionate and necessary’, says police chief",
    "Kosovan Albanians blame Belgrade for violence",
    "Pill cuts risk of death by half, says study",
    "Uganda says 54 African Union peacekeepers killed in gunfight",
    "President’s allies resign amid illegal wiretapping scandal",
    "Dog breed under spotlight in UK after fatal attacks",
    "The lone renter in ‘David and Goliath’ row with Montreal developers",
    "Police arrest pro-democracy activist on Tiananmen Square anniversary",
    "A thoughtful celebration of the Dutch old master",
    "A blues fireball in full bloom",
    "Why we just can’t get her out of our heads",
    "An illustrious feelgood duet party",
    "The artists bringing creation out of Beirut’s chaos",
    "‘I work on canvases for years. It’s like making really good wines’",
    "My life as a pedestrian in badly behaved Britain",
    "Why Britain’s curry houses are in decline",
    "My husband and daughter won’t speak to each other",
    "‘If there’s wine on the table, sex is absolutely happening’",
    "Savouring the gastronomic highs of Hauts-de-France",
    "Analysis The Myanmar junta kills … and the rest of the world looks away",
    "Life and war inside rebel-held Myanmar",
    "Here’s what AI doomsday would look like",
    "The doctor treating the mental scars of Gaza’s children",
    "The truth about our electronic waste",
    "People are going homeless in this Victorian getaway spot. Could an Airbnb tax be the answer?",
    "The nightly vigil to sanctify January 6 rioters",
    "Strawberry moon and Lightsaber lessons",
    "The everyday art of glassware",
    "‘The chicken lived for another day, at least’",
    "Russian airstrikes in Kyiv, a shaky ceasefire in Sudan and protests in Senegal",
    "Milky Way photographer of the year 2023",
    "From owl chicks to hungry brown bear cubs",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Clumps of 5,000-mile seaweed blob bring flesh-eating bacteria to Florida",
    "Sonic boom from US fighter jets ‘pursuing light aircraft’ rattles DC residents",
    "French Open: doubles pair disqualified after stray shot leaves ball girl in tears – video",
    "Lung cancer pill cuts risk of death by half, says ‘thrilling’ study",
    "Aaron Judge crashes through door to make potential MLB catch of the year",
    "Florida taxpayers pick up bill for Ron DeSantis’s culture war lawsuits"
]