[
    "The Guardian - Back to home",
    "The charges against Trump Full text of indictment",
    "Explainer What do the charges mean and what’s next?",
    "Analysis Could Trump go to prison?",
    "Indictment charging ex-president over classified documents unsealed",
    "Five revelations from Trump’s unsealed indictment",
    "‘Party’s over, Boris’ What the UK papers say about Johnson’s resignation",
    "Full report  Boris Johnson resigns as MP with immediate effect over Partygate report",
    "Analysis Johnson’s hopes for a comeback must surely now be futile ones",
    "Boris Johnson leaving in ‘disgrace’, says chair of standards committee",
    "Denver 108-95 Miami Hunter Felt's rolling report of Game 4",
    "Nuggets on brink of first title after Game 4 win over Heat",
    "'Miracle' children found alive 40 days after Amazon jungle plane crash",
    "California family finds over 1m copper pennies",
    "Government ‘fanning culture war’ over free speech, says country’s first LGBTQ+ history professor",
    "Wildlife-rich rainforest being planted in Devon in UK",
    "South Carolina woman shops passenger to police with silent message",
    "Disney’s Little Mermaid flops in China amid racist backlash over casting",
    "How some US cities are trying to keep roofs over people’s heads",
    "Annecy locals try to make sense of knife attack on children",
    "A whistleblower claims the US has alien vehicles. But where’s the proof?",
    "Republicans turn on their own in attorney general impeachment scandal",
    "Living my life was more important than being in movies",
    "Survive the smoke-pocalypse Californians advise New Yorkers",
    "A visual guide to the Canada blazes and US smoke pollution",
    "Four ‘miracle’ child survival stories",
    "Dubai hotelier launches £10k-an-hour ‘party jet’",
    "I guessed she was Canadian – she’s from Glasgow",
    "From Gellhorn to Abramson, the women who changed US journalism",
    "The only thing City miss is the Champions League – why I am here",
    "A tame attempt at manufacturing outrage",
    "Exiled Russians dare to dream of Putin’s fall",
    "Mercenaries accused of stoking ‘anarchy’ on Russia’s frontlines",
    "What we know on day 472 of the invasion",
    "What happened in the Russia-Ukraine war this week?",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Trump once led chants of ‘lock her up’. Now he’s been indicted on seven counts",
    "The charges mount, but Trump’s not worried. He’s just the guy to make jail great again",
    "Why did the right-leaning supreme court hand Democrats a victory?",
    "After the destruction of the Kakhovka dam, another threat lies on Ukraine’s horizon: Donald Trump",
    "The global backlash against The Little Mermaid proves why we needed a Black Ariel",
    "The dismal story of modern football can be summed up in two words: Manchester City",
    "Nuggets move to brink of team’s first title after Game 4 win over Heat",
    "Taylor and López out to jump-start stalled ascents in Garden scrap",
    "Women's final Muchova stands in Swiatek's path to greatness",
    "Alcaraz admits semi-final cramps were caused by nerves",
    "Jack Grealish From meh man to a main man at Manchester City",
    "Internazionale Inzaghi targets ‘writing a page of history’",
    "Manchester City’s odyssey from Dickov to the brink of immortality",
    "Girma and Kipyegon set world records at Paris Diamond League",
    "49ers' investment arm taking over English club after relegation",
    "Soccer, golf … will the NBA and NFL be next?",
    "The Stanford golf star toppling Tiger Woods’ records",
    "Alarm at rightwing push to reverse clean-energy success in Texas and beyond",
    "Climate crisis leading to more turbulence during flights, says study",
    "Protesters to march on White House",
    "Greenhouse gas emissions at all-time high, study finds",
    "Visualized How Alabama discriminated against Black voters",
    "Surprise US supreme court ruling could help Democrats take House",
    "Wildfires Millions still under air quality warnings in US",
    "Wildfire smoke brings climate crisis home to Americans",
    "Outcry as Texas to install ‘buoy barrier’ in Rio Grande to deter border crossings",
    "St Louis Catholic archdiocese to pay $1m to settle sexual abuse lawsuit",
    "12m Americans believe violence is justified to restore Trump to power",
    "Facebook owner to push ahead with plans to launch Twitter rival",
    "Hotel workers vote to authorize strike in California",
    "Republicans rally behind Trump after indictment",
    "Mercedes-Benz beats Tesla for approval of automated driving tech",
    "Trump likely to surrender to authorities on Tuesday",
    "Smoke from Canadian blazes hits Norway and flows to southern Europe",
    "Official investigating Chinese election ‘meddling’ resigns abruptly",
    "President and ELN guerrillas agree six-month ceasefire",
    "Special forces storm Turkish cargo ship after migrants attempt hijack",
    "Hero who saved hundreds of children dies aged 61",
    "Parts of volcano ‘stretched nearly to breaking point’, study finds",
    "France salutes ‘backpack hero’ who challenged knife attacker",
    "Former Italian PM back in hospital",
    "Podemos and leftist alliance Sumar agree to run jointly in snap election",
    "I’m demoralised about the landscape of fashion",
    "Just as we’ve fallen in love with digi-Luke, is Mark Hamill really retiring from Star Wars?",
    "Tove Jansson’s unseen sketches to go on show in Paris",
    "Influential British blues guitarist and singer with the rock band the Groundhogs",
    "Under-seasoned Cheetos biopic sticks to the formula",
    "Iron Maiden, Metallica and more on 20 years of Download",
    "And 19 other relationship ‘rules’ unpicked by experts",
    "Picnic and camping recipes",
    "How sex-tech firms are reinventing the vibrator",
    "Why dressing for dinner out is my favourite kind of look",
    "I built a house of cards 50 storeys high",
    "If it follows six rules, perhaps",
    "Why you still can’t buy wine in New York supermarkets",
    "Why is Sunak putting up with it?",
    "Is the government ready to regulate crypto?",
    "The week around the world in 20 pictures",
    "Gigantic rubber ducks and the first AI sculpture",
    "The photography of Alain Le Garsmeur",
    "Earth Photo 2023 shortlist",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘Three months ago, this wasn’t possible’: exiled Russians dare to dream of Putin’s fall",
    "Nuclear weapon secrets in the bathroom: five revelations from Trump’s unsealed indictment",
    "Colombian ‘miracle’ children found alive 40 days after Amazon jungle plane crash",
    "A million good lucks: California family finds over 1m copper pennies",
    "Can pornography be healthy? If it follows six rules, perhaps",
    "Return of rent control? How some US cities are trying to keep roofs over people’s heads",
    "‘Help me’: South Carolina woman shops passenger to police with silent message",
    "US urged to reveal UFO evidence after claim that it has intact alien vehicles",
    "Wagner group accused of stoking ‘anarchy’ on Russia’s frontlines"
]