[
    "The Guardian - Back to home",
    "Workers sue secretive elite club Bohemian Grove for wage theft",
    "Power companies spend millions to fight Maine’s proposed non-profit utility",
    "The gynecologists training out of state post-Roe",
    "Republicans denounce ex-president over classified documents but question DoJ’s motives",
    "Houston rapper dies at age 48",
    "Critics say popular snack founding myth is a hoax",
    "Key lawyer’s verdict on Alabama supreme court ruling",
    "Model embryo with heartbeat replicates cells in early pregnancy",
    "At least 38 people shot, including two fatally, at weekend in US",
    "US Open golf 2023: final round",
    "Blinken will seek China’s cooperation in curbing fentanyl at high-stakes visit",
    "The Google employee who helped Edward Snowden in Hong Kong",
    "Why does the beauty industry help fund anti-LGBTQ+ causes?",
    "Young Koreans rebel against culture of long hours",
    "Turkish lira falls as traders await uplift in economy",
    "The best way to raise cows sustainably? Set them free",
    "Stephen Bright’s death penalty fight",
    "Wendy Mitchell on living positively with Alzheimer’s",
    "Rebirth for ruined Orson Welles masterpiece that rivalled Citizen Kane",
    "How modern life shortens our perspectives",
    "Nicholas Blair’s images of gay joy and defiance in 80s America",
    "Decades of Decadence review: Marco Rubio joins publishing’s motley Republican crew",
    "Will Berlusconi’s party still get the votes without him?",
    "Ukrainian woman recounts five-month nightmare of torture and imprisonment",
    "Ukraine takes village on front, Russia-appointed official says",
    "Population dreams of EU membership as their leaders move closer to Putin",
    "What we know on day 480 of the Russian invasion",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Time’s up for Trump, Johnson and Berlusconi – but the damage they have caused lives on",
    "The supreme court made a surprising ruling for Native American rights",
    "Ellsberg and Trump both took classified documents. Their reasons couldn’t be more different",
    "Opinion Daniel Ellsberg was one of history’s most consequential figures",
    "Nobody I’ve been locked up with in a psychiatric hospital felt ‘proud’ of their illness",
    "The Venice Biennale may hold the answer",
    "Female novelists don’t need their own prizes. Let’s abolish them",
    "Spain hold nerve in shootout to beat Croatia in final",
    "US Open: McIlroy and Fowler battle in final round",
    "‘Diabolical’ Los Angeles venue raises familiar questions about USGA",
    "Honduras players boycott Louisiana friendly amid farcical pitch conditions",
    "Verstappen wins Canadian GP to secure Red Bull’s 100th victory",
    "WVU's Huggins resigns in wake of DUI charge and anti-gay slur",
    "Son of NFL legend died of suspected overdose, police say",
    "Prograis eyes Haney after beating ‘hometown jitters’ and Zorrilla",
    "How the wellness movement co-opted an Amazon frog toxin with deadly effects",
    "Dancing capercaillie makes a tentative comeback in Scotland",
    "Climate expert calls for urgent rethink on scale of aid for developing world",
    "Summit to focus on funding for poor countries",
    "Daniel Ellsberg, whistleblower who leaked the Pentagon Papers",
    "Family of eight-year-old girl who died in US border patrol custody ‘want justice’",
    "At least 17 injured after bus crashes into building",
    "Show's star pilot Jim Tweto dies in plane crash",
    "Social media sites failing to curb ‘cottage industry’ of fake reviews, Amazon says",
    "Liberal dismay as Muslim-led city in Michigan bans Pride flags",
    "Joe Biden rallies with union workers in Philadelphia",
    "Man freed after nearly three decades on death row",
    "Rightwing group planned $6m for anti-trans messaging in 2022 midterms",
    "Student loan provider baffled by inclusion in supreme court debt relief challenge",
    "‘We just want to know if he is alive or dead’ Migrants desperate for news of relatives",
    "‘I want answers’ Hope gives way to fury in Greece as hunt for survivors ends",
    "Pakistanis ‘were forced below deck’ say witnesses",
    "Scientists hope Euclid telescope will reveal mysteries",
    "Scotland’s ex-first minister: ‘I’ve done nothing wrong’",
    "PM warns of far right danger after PP strikes coalition deals",
    "Johnson’s legacy continues to haunt Sunak as Met ‘considering’ Partygate video",
    "Families bury their dead after school massacre",
    "New British mayor of Mallorcan town to start work with nice cup of tea",
    "EU exports of electric cars to UK put at risk by trade deal",
    "Lack of consensus on next Nato chief could lead to Stoltenberg staying on",
    "Two Americans found dead at resort died from inhaling toxic gas",
    "Judy Dench reveals secret onstage supper at Shakespeare play",
    "Who knew synth-pop could be this colossal and life-affirming?",
    "Edgy expat drama from Claire Denis",
    "Netflix study of 80s pop legends is entertaining but weirdly incurious",
    "Pretty Red Dress review – toe-tapping London tale of desire and identity",
    "Too much amorphous euphoria",
    "Our son is refusing to go to school – and we feel so isolated",
    "The return of the tasting menu",
    "Has working from home thrown the gen Zs out with the water cooler?",
    "mountain retreats in the Austrian Tirol",
    "Should I worry about my VO2 max?",
    "How to get started with investing",
    "Our visa situation made things complicated – then he proposed, hypothetically",
    "Robot surgeons provide many benefits, but how autonomous should they be?",
    "A people dreaming of EU membership as their leaders move closer to Putin",
    "What we need to ask about recent UFO revelations",
    "What does money mean if you can’t hold it in your hand?",
    "Inside the war tearing psychoanalysis apart",
    "Mermaid pitstop and Paris dive",
    "The photographer who returns to her teenage years",
    "The week around the world in 20 pictures",
    "Menswear SS24 highlights from Florence",
    "Glenn Homann’s best phone picture",
    "Landslides and sea turtles",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "‘They enjoyed this’: Ukrainian woman recounts five-month nightmare of torture and imprisonment",
    "Spain hold nerve in shootout to beat Croatia in Nations League final – as it happened",
    "Ukraine takes village on Zaporizhzhia front, Russia-appointed official says",
    "Max Verstappen takes Canadian Grand Prix to secure Red Bull’s 100th win – as it happened",
    "‘A sense of betrayal’: liberal dismay as Muslim-led US city bans Pride flags",
    "Bug swarm: Nevada crawling with thick carpet of Mormon crickets",
    "Some Republicans denounce Trump over classified documents but question DoJ’s motives"
]