[
    "The Guardian - Back to home",
    "Trump rape trial Jury begins deliberations in civil trial",
    "Donald Trump rape trial live: jury begins deliberations",
    "Ex-Guardian columnist who played key role in Snowden story dies at 37",
    "LAPD reels after release of undercover identities",
    "Josh Hawley book ridicules Andrew Tate – but is silent on Trump",
    "Zelenskiy tells EU grain restrictions ‘completely unacceptable’; Putin defends Ukraine invasion",
    "Trump accused of using $500m suit for witness intimidation",
    "‘Gun-loving’ ex-army officer urges gun control after seeing shooting",
    "‘Mind-boggling’ methane emissions from Turkmenistan revealed",
    "First UK baby with DNA from three people born after new IVF procedure",
    "Republicans take aim at Biden’s climate plan as deadline nears",
    "Republican who called drag shows a threat to kids quits after sex with intern",
    "Network lost $54m in first three months of 2023 as Dominion case takes toll",
    "DeSantis signs bills banning Chinese citizens from buying land",
    "Officials say ‘Arcturus’ could be linked to conjunctivitis",
    "First humans came to Americas from China in two migrations, study finds",
    "Russian missiles downed over Kyiv as Putin makes angry speech",
    "Putin recycles old grievances on Victory Day as Russian army battered in Ukraine",
    "Ukrainian soldiers struggle with post-traumatic stress",
    "What we know on day 440 of the invasion",
    "Will it be the most horrifying film since Cats?",
    "The strange story of Clarence and Ginni Thomas",
    "My face burned and my memory disappeared. Here is how I made it back",
    "An underwater kingdom for enslaved people who died in the Atlantic",
    "Real Madrid v Manchester City feels like a final as two dominant teams meet",
    "How the ‘benefits cliff’ holds women back",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Can rapper stop actor Reynolds expanding his sports empire?",
    "Unlikely hero Walker outshoots Curry as Lakers close on series win",
    "Pegula and Gauff rail at female players being silenced in Madrid",
    "Former NFL star goes on Burnley pub crawl for ‘research’ after investing in club",
    "WVU reviewing ‘abhorrent’ homophobic slurs by basketball coach",
    "The photo that captured an iconic Milan derby moment",
    "‘A parent at sports day tried to psych me out’",
    "Sign up to the US opinion email",
    "Why is Google stonewalling regulation in Brazil?",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "I bought an urn for $30 to put my dad’s ashes in, but had to remove the original inhabitant first",
    "Prog, angst and cosmic pyramids: why Daft Punk are my generation’s Pink Floyd",
    "Our obsession with sleep is doing more harm than good – and ignores the real problem",
    "Why are biographies so popular? Because humans are enthralled by the lives of others",
    "AI machines aren’t ‘hallucinating’. But their makers are",
    "As the Ukraine war grinds on, Russia is becoming a cultural wasteland",
    "Shell shareholders should oust chair, says influential adviser",
    "Italian oil firm Eni faces lawsuit alleging early knowledge of climate crisis",
    "Frogs croak at a higher pitch due to global heating",
    "Why ‘godfather of AI’ Geoffrey Hinton thinks humanity is at a crossroads",
    "Listen to previous episodes",
    "Hong Kong’s neon signs light up nostalgic drama",
    "Nintendo fans explain the hype for Tears of the Kingdom",
    "Strange depths and an arresting originality",
    "Meet Peridot, the AR pet app from the makers of Pokémon Go",
    "Tell us your favourite Eurovision song of all time",
    "Bone-breaking horror of post-partum depression",
    "Auction of £120m of jewels to go ahead despite Jewish groups’ concerns",
    "Film revives memories of girl’s death as country reviews abortion rules",
    "Iain Farrington on music fit for a king – and what the cameras didn’t show",
    "IRA man and British soldier lock horns in Troubles revenge drama",
    "Sacked for flirting, for putting on weight, for wanting a baby … Who’d be a bridesmaid?",
    "$30 for a tiny bag of poo?! What really goes into luxury compost",
    "Highlights from Mous Lamrabat’s photography exhibition",
    "Tell us: did you have a ‘micro-micro wedding’?",
    "Flaps the dog gave me a nasty bite – but I kept quiet to save his life",
    "US on track to set record in 2023 for mass killings after series of shootings",
    "Many soft lenses in US made up of PFAS, research suggests",
    "Roger Ailes would ‘never have put up’ with liberal attack on Fox News, ex-host says",
    "Author of children’s book on grief charged with murdering her husband",
    "Man wrongly convicted of rape released after 29 years in prison",
    "Governor signs bill allowing teachers to ignore students’ pronouns",
    "Ex-president is ‘nonstop’ liar who destroyed E Jean Carroll’s reputation, jury hears",
    "US lawmakers consider getting rid of borrowing limit as crisis looms",
    "Family criticizes marine veteran for not offering apology",
    "Police charge suspect with manslaughter after eight killed",
    "Internet cut as violence erupts after arrest of ex-PM Imran Khan",
    "More than 400 people now confirmed dead after flooding",
    "Migrants stranded in Chilean desert as Peru closes border",
    "Keir Starmer refuses to rule out Lib Dem coalition after next election",
    "We won’t be intimidated by China’s expulsion of consul, Trudeau says",
    "Major UK supermarket chair accused of inappropriate behaviour by four women",
    "Woman appeals in battle for right to freeze her eggs",
    "Turkish opposition hopes ideas prevail over personality",
    "PM uses helicopter for trip that would have taken just over an hour by train",
    "Israel bombs Gaza Strip, killing three Islamic Jihad leaders and nine civilians",
    "What’s at stake for Florida as legal tug-of-war ramps up?",
    "On the trail of the Dark Avenger: the most dangerous virus writer in the world",
    "Apple co-founder warns AI could make it harder to spot scams",
    "Protests, a parade and a pampered pooch",
    "Yardworks urban art and graffiti festival 2023",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Russian missiles downed over Kyiv as Putin makes angry Victory Day speech",
    "‘So improbable, it’s a novel’: the strange story of Clarence and Ginni Thomas",
    "Michael Cohen accuses Trump of using $500m lawsuit for witness intimidation",
    "David Miranda, campaigner and former Brazilian congressman, dies aged 37",
    "Donald Trump rape trial live: jury begins deliberations in civil lawsuit brought by E Jean Carroll",
    "‘A blunder that is just epic’: LAPD reels after release of undercover identities",
    "Disney v DeSantis: what’s at stake for Florida as legal tug-of-war ramps up?"
]