[
    "The Guardian - Back to home",
    "Key document may be fake in LGBTQ+ rights case before court",
    "Reaction A ‘willful ignorance of our reality’, critics say",
    "US supreme court rules against race-conscious admissions",
    "China As Beijing swelters, activists hope the heat will prompt climate action",
    "Extreme heat spreads as US told to expect hot and smoky summer",
    "‘There’s so much anger’ France braces for more rioting",
    "More than 400 arrested as police officer accused of shooting teen apologises",
    "US special envoy placed on leave while security clearance reviewed",
    "Ex-president says Putin is ‘somewhat weakened’ by aborted mutiny",
    "Thousands suffer heat stress on pilgrimage as temperatures reach 48C",
    "Influencer condemns Bud Light’s response to transphobia",
    "Judge rejects Trump's bid to dismiss writer’s first defamation suit",
    "Vigilante crusader against Mexico’s drug cartels killed in ambush",
    "Canada fires force US crews to shift strategy",
    "How a dictator’s son has changed the Philippines",
    "How does extreme heat affect the body and what can you do about it?",
    "MLB’s pace-of-play rules are showing that less is more",
    "What we know on day 492 of the invasion",
    "Kremlin quiet on fate of Russian general with links to Wagner boss",
    "Exiles’ hopes dashed as Lukashenko boasts of saving Putin",
    "EU mulls levy on frozen Russian assets to support reconstruction",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Get set for the Barbie-Oppenheimer smackdown",
    "Once Upon a One More Time review",
    "Digga D on rap stardom amid police restrictions",
    "Are they destroying our gut health?",
    "How much longer will the Thames Barrier protect London?",
    "Henry Cavill’s pulse-quickening last stand as an anti-heroic hunk",
    "This duo serves a segment that the big brands ignore",
    "France braces for more rioting over police shooting",
    "Sign up to the US opinion email",
    "The supreme court’s blow to US affirmative action is no coincidence",
    "‘A tragedy for us all’: Ketanji Jackson’s impassioned affirmative action dissent",
    "I am cursed to wear compression socks. Spare a thought for me this summer",
    "Biden has reminded us yet again that he’s a weak and lukewarm ally of abortion rights",
    "The failed Wagner coup shows Vladimir Putin’s regime remains stubbornly strong",
    "League suspends three players indefinitely for violating gambling policy",
    "Domingo Germán Yankee throws 24th-ever perfect game",
    "Transfer window Firmino, Jota and Brozovic all near Saudi deals",
    "Mount set to join Man Utd from Chelsea for $76m",
    "Team-by-team guide The lineups and riders to watch",
    "Cavendish insists farewell has ‘no room for sentimentality’",
    "Wimbledon made me and Wimbledon saved me",
    "Hamilton urges fans to avoid repeat of abusive scenes at Austrian GP",
    "Wozniacki comes out of retirement and will play at US Open",
    "Blackhawks tab ‘generational prospect’ Bedard with No 1 pick",
    "Rising seas have flooded this town three times. It may not survive a fourth",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Why are sea lions and dolphins dying along California’s coast?",
    "Climate crisis linked to rising domestic violence, study finds",
    "Milwaukee plant to close after 100 years and send jobs abroad",
    "Amtrak train with nearly 200 passengers hits water truck and derails",
    "Texas grand jury declines to indict rapper over deadly festival crush",
    "Christine King Farris, civil rights leader's last living sibling, dies aged 95",
    "Sheriff’s deputy acquitted for failure to act during shooting",
    "US says craft downed in February did not collect information",
    "Unhoused population reaches 75,000 amid humanitarian crisis",
    "Three charged with insider trading over ex-president's social media company merger",
    "Republican says as US president he would eliminate IRS and other agencies",
    "Group hacks agencies in US states attacking gender-affirming care",
    "‘Witch-hunt’ What Johnson’s allies said about the inquiry",
    "Boris Johnson allies launched ‘unprecedented’ campaign to undermine privileges committee",
    "Former vice-president meets with Volodymyr Zelenskiy during Ukraine visit – report",
    "Court dismisses grandmaster Hans Niemann’s $100m lawsuit against Magnus Carlsen",
    "Company to end news access in Canada after bill to pay news publishers passes",
    "Catholic church ‘dying painful death’ as 500,000 leave in a year",
    "Key witness says Met police ignored tipoff for nine years",
    "Suspect charged in hate-motivated stabbing in university gender issues class",
    "Many without power as deadly heat leads to strain on grid",
    "Artificial sweetener to be declared possible cancer risk by WHO, say reports",
    "Tourist from England suspected to have carved name on Colosseum wall",
    "The Republican race for 2024: can anyone stop Trump?",
    "Listen to previous episodes",
    "Hollywood’s fascination with fake pop songs",
    "A brilliant, bloodletting comeback",
    "Why the internet’s going wild for a ‘fish doorbell’",
    "Frothy Britney Spears musical",
    "Peter Ustinov art goes on sale",
    "He made me realize I’m woke – I thought it was a negative thing",
    "Pet owners find new ways to process grief",
    "People think it’s harder to make new friends after a certain age. We prove it’s possible",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "Stag do mishaps, pizza origins, and a very ugly dog",
    "The married couple competing to have the biggest and best facial hair",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "What’s driving anti-LGBTQ+ hate in America?",
    "What has affirmative action achieved?",
    "Elections official downplays cybersecurity threats despite report",
    "Skin disease in cetaceans off North American coast concerns scientists",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "Celebrating diversity and equality in photography",
    "Clashes rage over police shooting",
    "Kusama and a kiss from Putin",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Key document may be fake in LGBTQ+ rights case before US supreme court",
    "Key Madeleine McCann witness says Met police ignored tipoff for nine years",
    "Belarusian exiles’ hopes dashed as Lukashenko boasts of saving Putin",
    "‘It burns wild and free up there’: Canada fires force US crews to shift strategy",
    "Aspartame sweetener to be declared possible cancer risk by WHO, say reports",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "DeSantis says as US president he would eliminate IRS and other agencies",
    "Hipólito Mora, vigilante crusader against Mexico’s drug cartels, killed in ambush",
    "German Catholic church ‘dying painful death’ as 520,000 leave in a year",
    "A year of Marcos Jr: how a dictator’s son has changed the Philippines"
]