[
    "The Guardian - Back to home",
    "Russia-Ukraine war: evacuations under way near Kherson after Kyiv accuses Moscow of destroying dam",
    "Ukraine accuses Russia of blowing up Nova Kakhovka dam",
    "Everything you need to know",
    "Ukrainian dam collapse ‘no immediate risk’ to nuclear plant",
    "Harvard affirmative action challenge partly based on Holocaust denier’s work",
    "Black woman in Florida fatally shot through front door by white neighbor",
    "Family furious after coroner says death of Tasered man is ‘unexplained’",
    "Son of late CIA director cautions against growing extremism in the US",
    "California to set electricity bills based on people’s income",
    "China begins drilling one of world’s deepest holes in hunt for discoveries deep inside the Earth",
    "The Girl from Ipanema singer dies aged 83",
    "Reintroduction of endangered vulture in Spain paused over planned windfarm",
    "Arnold Schwarzenegger expresses regret over groping claims",
    "George Floyd’s uncle on the tragedy that fuels his fight against racism",
    "America is obsessed with striving. Is it time to redefine it?",
    "How my father’s dementia echoed my own alcoholism",
    "Why an independent abortion clinic is suing Planned Parenthood",
    "At 12, I was in Auschwitz. My parents and seven siblings were murdered. Here is how I built a life",
    "25 years of Sex and the City nailing life as a single woman",
    "Is the Vision Pro more than just another tech toy for the rich?",
    "The best albums of 2023 so far",
    "Typically explosive end to rock’s silliest band",
    "Judgment against Australia SAS soldier shows few have ever fallen so far",
    "Hairdressing-contest whodunnit shapes up stylishly",
    "My husband watches porn during sex. It makes me feel useless and unattractive",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Americans want to join unions. The supreme court doesn’t like that",
    "Climate risks are making California uninsurable. When will we wake up?",
    "I’m a trans teen in Missouri. Why is the state trying to take away my healthcare?",
    "What’s the Caribbean without its beaches? But the people are losing access to them",
    "Golden Knights put seven past Panthers for 2-0 lead",
    "Inter Miami would be a dubious landing spot for Messi",
    "French Open 2023 – Muchova through, Svitolina v Sabalenka in quarter-finals",
    "The brutal realities of life in MLR",
    "Tottenham confirm Postecoglou’s appointment as manager",
    "First to break 10 seconds in 100m sprint dies aged 76",
    "Zlatan was more than a cocky Swede who did not follow the rules",
    "Butler hails Heat’s ‘don’t give a damn factor’ after latest comeback",
    "Microplastics found in every sample of water taken",
    "Rich countries with high greenhouse gas emissions could pay $170tn by 2050",
    "Countries must put aside national interests for climate crisis, UN says",
    "Rich nations undermining work to help poor countries, research suggests",
    "Trump’s former vice-president announces White House run",
    "Home Depot is selling house kits for less than $50,000",
    "Ex-president's lawyers meet with DoJ to stave off indictment in Mar-a-Lago case",
    "Apple to tweak autocorrect that replaces one of the most common expletives",
    "Protesters demand that governor issue order banning all guns",
    "Newsom threatens DeSantis with kidnapping charges after migrants dumped twice in four days",
    "Colossal data centers are taking over the US countryside",
    "SEC sues company and CEO Changpeng Zhao for ‘mishandling billions of dollars’",
    "Philosopher announces US presidential campaign with People’s party",
    "Wolverine spotted for the second time ever in California in the last 100 years",
    "Pope Francis reportedly visits hospital in Rome for tests",
    "Tehran claims to have created long-range hypersonic missile",
    "Syphilis cases at highest level for 75 years last year",
    "Rightwing governor of Lazio region withdraws backing for pride parade",
    "Businessman hit with €121,000 speeding fine",
    "Election of Delfina Gómez as governor of Mexico state signals decline of PRI",
    "Half of big international firms to cut office space in next three years – survey",
    "Tributes paid a year on from their deaths",
    "What is the UK government hiding from the Covid inquiry?",
    "Listen to previous episodes",
    "Singer ‘extremely sorry’ for cancelling gigs to rest for Glastonbury",
    "The shocking story of Hollywood’s con queen",
    "The ultimate eco building – made of salt, sunflowers and recycled urine",
    "Limp, lifeless robot sequel",
    "How M made crossover classic Pop Muzik",
    "Light bondage and heavy sleaze make for the ultimate try-hard TV",
    "The ultimate panacea – or wildly overhyped?",
    "I was devastated by divorce at 70. But at 102, I know the secrets of a well-lived life",
    "Why it is time to embrace your quilt – without the guilt",
    "I was so proud of my Sea-Monkeys – until their orgies repulsed me",
    "Can sleeping apart help a relationship?",
    "De La Soul were my first music love – something my dad always understood",
    "Father of teen killed in Alabama mass shooting speaks out",
    "How Beijing has rearranged the diplomatic pieces ahead of a potential conflict",
    "UK recorder fans warn instrument heading for extinction",
    "Seven steps to save the Amazon",
    "Billionaire’s brain implant company is approved for human testing. How alarmed should we be?",
    "Prince Harry at court and D-day ceremonies",
    "50th World Environment Day",
    "Life under the Sicilian mafia",
    "The church at the end of the world – photo essay",
    "The everyday art of glassware",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "The truth about ‘local’ food in US supermarkets: ‘It’s a marketing gimmick’",
    "Kim Jong-un’s new border wall could be a sign that his grip on North Korea is slipping",
    "Son of late CIA director cautions against far-right extremism in the US",
    "Home Depot is selling tiny homes you can build yourself for less than $50,000",
    "‘Forget all the excuses’: Arnold Schwarzenegger expresses regret over groping claims"
]