[
    "The Guardian - Back to home",
    "Ukraine Russians near Bakhmut have retreated by up to 2km, official says",
    "Russia Kremlin calls Poland’s decision to rename Kaliningrad a ‘hostile act’",
    "Congressman pleads not guilty to fraud and money laundering",
    "Analysis Trump’s town hall was an utterly predictable mess of lies",
    "Factcheck Trump's biggest claims from the town hall – debunked",
    "Ex-president repeats conspiracy theories and election lies",
    "Hong Kong passes law to kick foreign lawyers off 'national security' cases",
    "Soldier who Abbott pledged to pardon gets 25 years for BLM protester’s murder",
    "Biden to host India’s prime minister for state visit despite concerns over human rights",
    "A Walgreens guard killed a Black trans organizer. His community wants answers",
    "Company launches new AI PaLM 2 in attempt to regain leadership of the pack",
    "California to pay $24m in record civil rights settlement over man’s in-custody death",
    "Time stands still at Westminster as Big Ben fails to chime",
    "Blogger and force behind Dooce.com dies aged 47",
    "Civil rights leader’s famous criticism of Malcolm X ‘just not true’, author finds",
    "FDA panel paves way for approval of first over-the-counter pill",
    "Oat milk is everywhere. Why is it still so expensive?",
    "What we know on day 442 of the invasion",
    "Nuclear plant facing ‘catastrophic’ staff shortage amid Russian evacuation",
    "Soldiers, sirens and a ‘sign of hope’ as The Terrible Revenge premieres in Lviv",
    "UK proscribing group as terrorist ‘will help Ukrainians sue’",
    "Renaissance World Tour review – a dizzying three-hour spectacular",
    "Trump’s torturous town hall backfires on CNN",
    "One woman’s wild romantic odyssey – and what it reveals about love",
    "Can generative AI save Meta from the metaverse?",
    "Dark waters: how the adventure of a lifetime turned to tragedy",
    "Taiwan rehearses a Chinese assault on its cities",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Curry and Warriors handle Lakers in Game 5 to head off elimination",
    "Dzeko and Mkhitaryan put fearless Inter in charge",
    "Dennis Rodman’s son will transfer to USC, joining Bronny James",
    "Ex-Raider faces up to 10 years in jail after pleading guilty in fatal DUI crash",
    "Real Madrid v Manchester City: beauty on razor’s edge",
    "Huggins hit with ban and $1m salary reduction for anti-gay slur",
    "Sabalenka progress faces test in Swiatek’s fortress",
    "Ferrari must embrace Leclerc’s risk-taking with F1 title gone and car a mess",
    "Sign up to the US opinion email",
    "Lloyd Green Liable for sexual assault, yes – but Trump’s political career is far from over",
    "Consequences for Trump: this beginning took bravery",
    "It’s official: billionaires aren’t the brainboxes they like to believe",
    "E Jean Carroll won. And Trump can be now portrayed as a sexual abuser",
    "Serbia acted after two mass shootings – the US has done nothing despite 200 this year",
    "Dear CNN, giving Trump a town-hall platform is the height of irresponsibility",
    "It’s no wonder that many in Pakistan now fear for the fate of Imran Khan",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "Jordan Neely’s cry for help should not have been his death sentence",
    "Devastating wildfires will only get worse, new book warns",
    "Microbes discovered that can digest plastics at low temperatures",
    "‘Mind-boggling’ methane emissions revealed",
    "The killing of Shireen Abu Akleh – and another ordinary day in the West Bank",
    "Listen to previous episodes",
    "Jodie Whittaker to narrate animated film based on Julia Donaldson’s beloved book",
    "The idea that you need a white actor is utterly insidious",
    "Fighting back with the banned book reading room",
    "Country star to host Beatles, Elton John and 39 other stars on new rock album",
    "Robert De Niro has had his seventh child aged 79. Does that explain the bagel adverts?",
    "Losing Gravity role to Sandra Bullock made me feel hopeless",
    "Inside Ed Sheeran’s mysterious fanbase",
    "Christian pop star Lauren Daigle on Trump, trolling and abortion",
    "Will New Zealand join? What links the Beatles to peace in Ukraine?",
    "Raucous high school reunion for the sk8er dads",
    "What I faced after coming out as a queer Jehovah’s witness",
    "Can New York’s Carbone survive its own success?",
    "Poached pears, winter salad and ‘unthinkable’ pasta",
    "Hotpants and catsuits hit tinsel town",
    "The ultimate guide to making guacamole",
    "I wrote 100 letters to my friend with cancer. It transformed our lives",
    "US doctors How are you navigating abortion restrictions?",
    "Pressure builds as North Carolina set to override ban veto",
    "Columnist ‘overwhelmed with joy’ for women after Trump verdict",
    "Tell us Have you struggled with the US housing crisis?",
    "Housing crunch Why we’re publishing a series on this US crisis",
    "How finding a home became so absurdly expensive",
    "The lawyer whose sex trafficking case against Instagram could spell trouble for big tech",
    "Possible meteorite crashes into bedroom",
    "US rate beat forecasts in April but remained high at 4.9%",
    "US lawmakers call to modernize Osha as hundreds die on the job each day",
    "Man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Fast-food chain to test AI chatbot that takes your drive-thru order",
    "Enrollment in US schools hasn’t bounced back since pandemic, data shows",
    "Conflict and climate disasters combine to create record rise in displaced people",
    "Friends and family call for justice on anniversary of killing",
    "Former PM Imran Khan appears before judge amid uproar",
    "Barcelona’s beaches could vanish as authorities abandon ‘enhancement’",
    "At least 21 dead as wildfires rage across Urals and Siberia",
    "Mother’s Day brings only grief for those seeking the disappeared",
    "Interpol calls for help naming 22 women murdered in past 50 years",
    "Election may not bring the geopolitical shift some are hoping for",
    "Plaid Cymru leader Adam Price steps down after damning report",
    "Prime minister Sanna Marin files for divorce",
    "Kremlin calls Poland’s decision to rename Kaliningrad a ‘hostile act’",
    "Anatomical museum reopens in London",
    "First UK baby born with DNA from three people: what happens next? – podcast",
    "The meaning and misogyny of the Trump-Carroll case",
    "Fashion boss rescues historic newsstand in Tuscany",
    "A woman expresses how it feels to survive rape",
    "Lithe lizards and a dog’s dinner",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Toe-curlingly bad television: Trump’s torturous town hall backfires on CNN",
    "Trump repeatedly lied at his CNN town hall. His biggest claims, factchecked",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Trump repeats conspiracy theories and election lies in CNN town hall",
    "Sound artist eavesdrops on what is thought to be world’s heaviest organism",
    "DeSantis signs bills banning Chinese citizens from buying land in Florida",
    "Heather Armstrong, blogger and force behind Dooce.com, dies aged 47",
    "Trump’s CNN town hall was a mess of lies – and it was utterly predictable"
]