[
    "The Guardian - Back to home",
    "The deal What has to happen now to get it passed?",
    "‘An egregious act’ Debt deal imperils environment, critics say",
    "‘Whatever it takes’ The tense journey to debt deal",
    "Important first hurdle cleared with House panel and advances for debate",
    "Macron to call for European ‘strategic awakening’",
    "Exclusive Trump lawyer said to have been waved off searching office for secret records",
    "Ex-president reiterates pledge to scrap birthright citizenship",
    "Restaurant manager died after getting trapped inside a freezer, lawsuit says",
    "First spy satellite launch ends in failure, and promise to send up another",
    "Purdue can shield wealthy Sackler family from opioid lawsuits, court rules",
    "Staffer who accused Joe Biden of sexual assault defects to Russia",
    "Woman detained over Twitter and Snapchat posts promoting reform",
    "Chinese pilot performed ‘aggressive maneuver’ near US plane, military says",
    "Rare white bison born in Wyoming is first in park’s 32-year history",
    "‘People wanted to believe the fairytale’",
    "Chipmaker’s strategic AI moves result in a tech position of power",
    "Russians wake up to war at home",
    "Philip O’Ferrall on his vision for media venture Outernet",
    "How the ‘nice’ comedy became utterly dreadful television",
    "Manuscripts shed light on how medieval minstrels skewered society",
    "The album that foretold today’s anything-goes pop",
    "The TV show so good it beats the Succession finale hands down",
    "Are you an eagle, dog, bear or reptile? The trend that is unlikely to improve your love life",
    "The employees working under surveillance",
    "Growing debate over vape regulation",
    "Russia-Ukraine war: Russian oil refinery in Krasnodar on fire; Belgorod shelled, says governor",
    "Who was behind the Moscow drone attacks?",
    "What we know on day 462 of the invasion",
    "Woman trying to reach godson detained in Russia and deported to Belarus",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Dangerous lab leaks happen far more often than the public is aware",
    "Tunisia was the hope of the Arab spring. Now my father could face the death penalty for his words",
    "Demanding Taylor Swift dump Matty Healy? Fan culture is out of control",
    "Will AI free us from drudgery – or leave us jobless and hungry?",
    "The Heat brutally ended the Celtics’ season of living dangerously",
    "Hudson quits as manager as second interim hired amid search",
    "Djokovic ‘raising tensions’ of Serbia and Kosovo after statement",
    "Our writers pick their best and worst",
    "Inside year one of the Boehly era at Chelsea",
    "Spartak's Promes prosecuted for alleged trafficking of 1,360kg of cocaine",
    "Wild sends Medvedev crashing out of French Open",
    "Vegas put six past Dallas to advance to second Stanley Cup final",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Climate change to blame for up to 17 deaths, experts say",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Five people still unaccounted for after apartment building collapse",
    "Republican hopeful says he will ‘destroy leftism’ in US if elected president",
    "Connecticut exonerates victims of 17th-century trials",
    "Firefighting goats could be furloughed due to employment law",
    "California appeals court votes for parole for Manson follower",
    "Wife of 39th US president diagnosed with dementia",
    "Digital road sign hacked to display white supremacist messages",
    "Consumer watchdog says KOS protein powder contains toxic chemicals",
    "End-of-term decisions could transform key areas of public life",
    "Black teen raises money for traumatic brain injuries weeks after shooting",
    "Trial begins of female journalist who covered Mahsa Amini’s death",
    "Radio broadcaster shot dead in latest killing of a journalist, say police",
    "South Korea’s first ever same-sex marriage bill goes to parliament",
    "Pyongyang launches ‘space vehicle’ amid military spy satellite plans",
    "No 10 accused of cover-up after denying it has Boris Johnson Covid messages",
    "Centre-right Citizens party says it will not run in general election",
    "Italian and Israeli agents among four dead after boat capsizes in Lake Maggiore",
    "Lab leak theory should not be ruled out, top Chinese scientist says",
    "Tourists turn up at London family home mistakenly listed on Booking.com",
    "'Fascist mobs’ guided by Serbia causing violence, says country’s PM",
    "Tracking down Ukraine’s abducted children",
    "Listen to previous episodes",
    "Ex-Soviet conceptual artist dies aged 98",
    "You’ll give up on Woody Harrelson’s Watergate drama after one episode",
    "Why Jeremy Strong shaved his head – and Werner Herzog jumped into a cactus patch",
    "How sculpting saved a reverend from heroin and sex work",
    "Deftly made yet derivative Stephen King horror",
    "Festival announces full lineup, adding Queens of the Stone Age, Skepta and more",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "The dating trend that is unlikely to improve your love life",
    "Backpacking in the Himalayas, I found the courage to change my life",
    "What’s the best cheese for melting?",
    "Part mafia boss, part Artful Dodger, Julian the cat scorns society’s rules",
    "Six questions to ask before buying that cardigan",
    "Working as a lifeguard in badly behaved Britain",
    "Risk of extinction should be ‘global priority’, say tech experts",
    "Astronomers see 6,000-mile water vapor plume blasting from Saturn moon",
    "Rare Italian deer make long journey to survival",
    "Latest one-of-a-kind store is ‘like an Indigenous-futurist version of Warhol’s Factory’",
    "How coffee farms in Costa Rica are mixing wildlife, agriculture and tourism",
    "The life of an artisanal charcoal maker",
    "Protests in Senegal and a Comic-Con dinosaur",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Getxophoto festival, Basque Country, Spain",
    "Fashion fixes for the week ahead",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Tara Reade, who accused Joe Biden of sexual assault, defects to Russia",
    "North Korea’s first spy satellite launch ends in failure, and promise to send up another",
    "Who was behind Moscow drone attacks and what do they mean for Ukraine war?",
    "Ron DeSantis says he will ‘destroy leftism’ in US if elected president",
    "Trump lawyer said to have been waved off searching office for secret records",
    "Five people still unaccounted for after Iowa apartment building collapse",
    "‘Ball of fluff’: rare white bison born in Wyoming is first in park’s 32-year history",
    "Large-scale drone attack hits Moscow for first time in Ukraine war",
    "Theranos founder Elizabeth Holmes turns herself in for 11-year prison term"
]