[
    "The Guardian - Back to home",
    "Airline faces lawsuit over $1bn carbon neutrality claim",
    "Trump lawyer said to have been waved off searching office for secret records",
    "Russia-Ukraine war: Kremlin blames Kyiv after multiple drones hit Moscow buildings",
    "End-of-term decisions could transform key areas of public life",
    "Lab leak theory should not be ruled out, top Chinese scientist says",
    "US debt ceiling deal: Biden and McCarthy agreement faces battle in Congress",
    "Black teen raises money for traumatic brain injuries weeks after shooting",
    "Theranos founder expected to begin 11-year sentence",
    "Man wielding fish knife attacked home of actor",
    "Nvidia becomes first chipmaker valued at more than $1tn amid AI boom",
    "What it’s like to use Narcan",
    "The downfall of Elizabeth Holmes",
    "What’s in and out of Biden and McCarthy’s deal",
    "How coffee farms in Costa Rica are mixing wildlife, agriculture and tourism",
    "The Miami Heat brutally ended the Celtics’ season of living dangerously",
    "The reverend saved from heroin and sex work by sculpting",
    "Iran’s female journalists speak out on brutal crackdown",
    "A former Boris Johnson aide has written a bonkbuster. John Crace has read it so you don't have to",
    "I have never been able to climax during sex. Is my masturbation style to blame?",
    "Can humans ever understand how animals think?",
    "‘We’re so much more than that’, say Indigenous boutique owners",
    "Large-scale drone attack hits Moscow for first time in Ukraine war",
    "One person dies in third wave of strikes on Kyiv in 24 hours",
    "What we know on day 461 of the Russian invasion",
    "The Ukrainian children taken to Russia for financial gain",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "Will AI free us from drudgery – or leave us jobless and hungry?",
    "Demanding Taylor Swift dump Matty Healy? Fan culture is out of control",
    "Dangerous lab leaks happen far more often than the public is aware",
    "Tunisia was the hope of the Arab spring. Now my father could face the death penalty for his words",
    "Our writers pick their best and worst",
    "Vegas put six past Dallas to advance to second Stanley Cup final",
    "Inside year one of the Boehly era at Chelsea",
    "Djokovic courts controversy with political message",
    "The Heat brutally ended the Celtics’ season of living dangerously",
    "French Open 2023 – Medvedev in action, Gauff and Jabeur advance",
    "Tszyu’s world title defence in balance after dog bite",
    "Wolff against any restrictions for rampant Red Bull",
    "Cop28 president’s team accused of Wikipedia ‘greenwashing’",
    "Rock ‘flour’ from Greenland can capture significant CO2 – study",
    "Drax-owned wood pellet plant in US broke air pollution rules again",
    "Experts call for ‘loss and damage’ fund for nature in developing world",
    "Political leaders push for lawmakers’ support on deal",
    "Janitors in New York file lawsuit over firings and demand backpay",
    "Consumer watchdog says KOS protein powder contains toxic chemicals",
    "State set to become first to end book bans",
    "US may restrict visas for Ugandan officials in wake of anti-LGBTQ+ laws",
    "Use of ‘invasion’ clause against immigrants is racist and dangerous, rights groups say",
    "Party split over senator’s diminishing health",
    "At least one injured after apartment building collapse",
    "Congress ‘absolutely’ can impose ethics reform, senator says",
    "Body of prison break fugitive recovered, police say",
    "Cabinet Office and Boris Johnson at war over Covid inquiry information",
    "Nato troops on guard after clashes with Serb protesters",
    "Country grants Putin and Brics leaders diplomatic immunity for summit",
    "Government under renewed pressure to end same-sex marriage ban",
    "Police put spit hood on 90-year-old woman and pointed Taser at her",
    "Protesters clash with police over partial demolition of mosque",
    "Volcano near Antarctica captured on satellite spewing lava",
    "Stateless Rohingya could soon be the ‘new Palestinians’, top UN official warns",
    "Mystery of why Grand Canal turned fluorescent green is solved",
    "Vital hedges under threat from cuts to funding, farmers say",
    "Bashar al-Assad’s dark return to the world stage",
    "Listen to previous episodes",
    "Festival announces full lineup, adding Queens of the Stone Age, Skepta and more",
    "Succession’s Matthew Macfadyen has been a consummate shapeshifter",
    "Paul Mescal’s moves will have his fanbase melting",
    "The new king of fighting games",
    "The album that foretold today’s anything-goes pop",
    "The employees working under surveillance",
    "The dating trend that is unlikely to improve your love life",
    "Backpacking in the Himalayas, I found the courage to change my life",
    "What’s the best cheese for melting?",
    "Part mafia boss, part Artful Dodger, Julian the cat scorns society’s rules",
    "Six questions to ask before buying that cardigan",
    "Working as a lifeguard in badly behaved Britain",
    "Activist Paul Boden on America’s homelessness crisis",
    "Texas farmers experiment with ancient farming styles",
    "What if nobody is bad at math?",
    "Can you really survive on nothing but coffee, tea or juice?",
    "Rumman Chowdhury on accountability in AI",
    "The life of an artisanal charcoal maker",
    "Protests in Senegal and a Comic-Con dinosaur",
    "Tom Wood’s visions of Liverpool",
    "The best red carpet looks part two",
    "Getxophoto festival, Basque Country, Spain",
    "Fashion fixes for the week ahead",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Theranos founder Elizabeth Holmes expected to begin 11-year sentence",
    "Mystery of why Venice’s Grand Canal turned fluorescent green is solved",
    "Japan PM fires son after pictures emerge of ‘inappropriate’ private party at official residence",
    "‘I never doubted you! Now, let’s have sex’ – Cleo Watson’s Whips, digested by John Crace",
    "US supreme court end-of-term decisions could transform key areas of public life",
    "Illinois set to become first state to end book bans",
    "My father had dementia and I was his caregiver. Here’s what I wish I had known"
]