[
    "The Guardian - Back to home",
    "US debt ceiling  Biden hails deal as he and McCarthy prepare to sell it to Congress",
    "Explainer Agreement to raise US debt ceiling – what’s in the deal?",
    "Opinion The deal isn’t perfect but it’s the only one – and it must pass",
    "Biden hails debt ceiling deal, prepares Congress sell",
    "Japan may take ‘destructive measures’ after Kim regime announces satellite launch dates",
    "Analysis West caught between fear and hope as Erdoğan extends 20-year rule",
    "Turkey election results Presidential vote round two",
    "Recep Tayyip Erdoğan wins presidential election",
    "Students graduate around the country, with flags, politicians and a furry friend",
    "Four bodies found after tourist boat capsized in storm",
    "US seeks to fine January 6 rioters to claw back donations they raked in",
    "Prime minister calls snap election after conservative and far-right wins in local polls",
    "Number of people prosecuted in court up 12% in five years, report shows",
    "Protesters accuse Roger Waters of antisemitism ahead of Frankfurt gig",
    "Melbourne nightclub’s use of snakes and a baby crocodile sparks probe",
    "Use of ‘invasion’ clause against immigrants is racist and dangerous, rights groups say",
    "Party split over senator’s diminishing health",
    "The spray-can vigilantes shaming Bogotá for its perilous paving slabs",
    "Activist Paul Boden on America’s homelessness crisis",
    "Can you really survive on nothing but coffee, tea or juice?",
    "What if nobody is bad at maths?",
    "Does Nagi hold the secret to repopulating Japan?",
    "Share your thoughts on the final episode",
    "The 20 best easy pasta recipes – from pistachio pesto to great baked gnocchi",
    "Julie Byrne on the death of her musical partner",
    "Backpacking in the Himalayas, I found the courage to change my life",
    "Rumman Chowdhury on accountability in AI",
    "What we know on day 460 of the Russian invasion",
    "The Ukrainian children taken to Russia for financial gain",
    "Ukraine built more onshore turbines last year than England",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "When my running app broke it was a revelation: ‘being better’ is about taking care of yourself",
    "The debt ceiling deal isn’t perfect but it’s the only one – and it must pass",
    "What is a dog, then? On the unbearable death of my dog, Polly",
    "Raw talent and a refusal to accept barriers made Tina Turner great",
    "Premier League 2022-23 season review Best signings of the season",
    "Premier League 2022-23 review Best matches of the season",
    "Premier League 2022-23 review Best goals of the season",
    "Rooney brings empathy and progress as DC United head coach",
    "Bell says he used marijuana before NFL games",
    "García needs to stop taking swipes for the good of his reputation",
    "French Open day two: Djokovic, Alcaraz and Garcia in action",
    "Newgarden’s audacious late pass clinches dramatic win",
    "Goodison roar drags Everton over the line once again",
    "Ukraine's Kostyuk calls out crowd for booing Sabalenka snub",
    "Drax-owned wood pellet plant in US broke air pollution rules again",
    "Why the climate crisis is making our insects run for the hills",
    "Alberta’s party leaders are ignoring the climate crisis while the region burns",
    "Insurance giant halts sale of new home policies in state due to wildfires",
    "Congress ‘absolutely’ can impose ethics reform, senator says",
    "Body of prison break fugitive recovered, police say",
    "'It's an honour' Italian towns claim Ron DeSantis as one of their own",
    "Republican accused of ‘catastrophic’ climate approach after campaign launch",
    "Experts warn of increased risk of US terror attacks by ‘lone wolf’ actors",
    "Cycle of deadly violence raises questions over US counter-terror role",
    "Film hooks audiences with whale of an opening weekend",
    "A man was told he could visit home. He was arrested at the airport",
    "US ‘ready to fight in space if we have to’, says military official",
    "Attorney general impeached by Republican-led House in historic vote",
    "Three people killed and five injured in shooting at biker rally",
    "World Health Assembly commits to boosting global access to rehabilitation",
    "2% tax on UK rich list families ‘could raise £22bn a year’",
    "Beijing seeks to remedy its vulnerability to food and energy embargoes",
    "How common are tremors in Victoria and could a very large one occur?",
    "Erdoğan claims victory in Turkish presidential election as count continues",
    "Police investigate source of bright green liquid in Grand Canal",
    "Vast new parliament opened by Narendra Modi amid opposition boycott",
    "Court issues arrest warrant for man who opened plane door mid-air",
    "First domestically produced passenger jet makes maiden commercial flight",
    "Detainee accuses UK agencies of complicity in his torture",
    "The Murdochs’ real-life succession drama",
    "Listen to previous episodes",
    "Rebecca F Kuang rejects idea authors should not write about other races",
    "Singer speaks out against boycotting songs because of creators’ actions",
    "Fragments of Paradise review – moving account of legendary radical Jonas Mekas",
    "SPOILER ALERT: Who triumphs in the Roys’ last ever outing?",
    "A curious choice for the Palme – but what an extraordinary Cannes",
    "Love in a Time of Hate by Florian Illies review – dissolute years of a doomed generation",
    "Guardian readers share their instant noodle serving suggestions",
    "Can hairspray protect white clothing from makeup smears?",
    "Could my wrinkles earn me money?",
    "Allergies: the irritating truth",
    "We’d known each other for three months and kissed once – then over the phone, I proposed",
    "Doug Rushkoff on why tech billionaires are in escape mode",
    "Why ‘night shine’ clouds at edge of space may be product of pollution",
    "The Iraqi families displaced by a dam – and homeless for 40 years",
    "Can San Francisco once again reinvent itself?",
    "France struggles to stub out ‘explosion’ in contraband cigarettes",
    "The scientist who changed space travel",
    "Who was the woman who jumped to her death?",
    "Getxophoto festival, Basque Country, Spain",
    "Fashion fixes for the week ahead",
    "Imaginary spaces rendered in fabric",
    "I’d never seen a woman riding a motorcycle in a dress",
    "10 years of its best photography",
    "The week around the world in 20 pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Japan may take ‘destructive measures’ after North Korea announces satellite launch dates",
    "Sergio García needs to stop taking swipes for the good of his reputation",
    "Getxophoto festival – in pictures",
    "‘I was so scared’: the Ukrainian children taken to Russia for financial gain",
    "Russia-Ukraine war at a glance: what we know on day 460 of the invasion",
    "‘I’ve never seen so much vitriol’: activist Paul Boden on America’s homelessness crisis",
    "An immigrant was told he could visit home. He was arrested at the airport",
    "‘I couldn’t outrun my grief’: Julie Byrne on the death of her musical partner",
    "A new start after 60: backpacking in the Himalayas, I found the courage to change my life"
]