[
    "The Guardian - Back to home",
    "Ron DeSantis signs laws to ease 2024 run",
    "Beijing jails US citizen for life on espionage charges",
    "Turkey elections 2023 Latest results",
    "First Thing Erdoğan faces serious challenge",
    "Votes set to go to runoff as Erdoğan attempts to claim victory",
    "Full story Ukrainian president to meet UK PM in London",
    "Russia-Ukraine war: Zelenskiy meets UK prime minister; France to send Kyiv military aid",
    "Crossings reportedly decrease after Title 42 rules scrapped",
    "Re-create UK’s Homes for Ukraine scheme for refugees, urges one of plan’s architects",
    "Talent agency apologises over claims founder sexually abused boys",
    "Talking to babies may help shape brain structure, research finds",
    "Vice files for bankruptcy protection amid cut-price sale to consortium",
    "Two charged after Hitler speeches played on train intercom",
    "Firm apologizes after refusing rental car to Puerto Rican customer",
    "A House Republican wants to prove Biden is compromised – but where’s the evidence?",
    "The asylum rule replacing Title 42 is strict – here’s what we know",
    "Beijing’s ‘great wall of steel’ faces obstacles to military supremacy",
    "Serbians wary of president’s gun pledge",
    "‘I try to explain the meaning of this Russian fascism’",
    "Kyiv can defeat Russia by end of year with western help, president says",
    "Throwing a Eurovision viewing party in Kyiv",
    "What we know on day 446 of the invasion",
    "Why Trump’s ‘vile’ attacks against Carroll after verdict could be ‘chilling for survivors’",
    "Living in the Alaska rainforest with 1,000 bears",
    "The Daily Show’s Roy Wood Jr on making the other side laugh",
    "Why are so many young Americans adopting fake British accents?",
    "The best mid-range phone gets even better",
    "Matilda’s Mara Wilson on the price of fame",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Will Jokić halt LeBron’s title ambitions?",
    "10 talking points from the weekend’s action",
    "Arsenal losing the league is not a collapse of character",
    "Tatum’s Game 7-record 51 points power Celtics into Eastern Conference finals",
    "Grizzlies suspend star after second apparent gun video emerges",
    "Rockies pitcher Feltner fractures skull after taking 93 mph line-drive to head",
    "Lewandowski fires Barça to title but invoke Espanyol fans’ wrath",
    "Emotional Day breaks five-year PGA Tour drought",
    "Sign up to the US opinion email",
    "White House timidity on the debt ceiling is infuriating. What is it afraid of?",
    "The apocalypse isn’t coming. We must resist cynicism and fear about AI",
    "What happens when leaders disregard the truth? Putin and Trump are about to find out",
    "A moment’s silence, please, for the death of Mark Zuckerberg’s metaverse",
    "To my friend who worries about becoming a parent: here are some things to hold on to",
    "I used to hide behind my hair. But cancer gave me a buzzcut and helped me find my voice",
    "Big tech says it can boost productivity, but AI won’t solve meetings madness",
    "There is nothing un-African about being gay. Museveni’s bigotry will cost lives",
    "Cyclone Mocha batters Bangladesh and Myanmar",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "The wild continent of snow, ice and, increasingly, women",
    "Climate crisis deniers target scientists for vicious abuse",
    "Is the UK in the grip of ‘greedflation’?",
    "Listen to previous episodes",
    "Music, film, books and more about the madness and wisdom of crowds",
    "US supreme court pursuing rightwing agenda via ‘shadow docket’, book says",
    "Fear and loathing in Hollywood",
    "The artists pushing the boundaries of AI",
    "The devastating plight of LGBTQ asylum seekers",
    "This year’s contest is most watched final in song contest’s history, says BBC",
    "Band to continue tour following death of Paul Cattermole and departure of Hannah Spearritt",
    "‘I kept my alcoholism secret on Mission: Impossible set’",
    "Ken Loach takes his last film to Cannes",
    "An intimate, uplifting star portrait",
    "I embraced being single and became an international pet-sitter",
    "Every night I would sing to Cackles the goose. Then tragedy struck",
    "Rachel Roddy’s recipe for spaghetti with asparagus, butter and lemon",
    "The spreading agony of kidney stones",
    "Should I worry about how long I spend sitting down?",
    "Why are the sexual needs of the bereaved still a taboo?",
    "Republican presidential candidate downplays federal abortion ban",
    "Boy, 13, saves sister by hitting potential kidnapper with slingshot",
    "Not having cellphone allowed boy to save runaway bus from crashing",
    "Mem Fox book Guess What? banned in county under Ron DeSantis bill",
    "Stark warning over Republicans’ ‘dehumanizing’ rhetoric",
    "Teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Rightwing US senator to give virtual speech at conservative UK conference",
    "Unusual early heatwave set to sweep Pacific north-west of US",
    "Thirteen-year-old girl punches shark to escape attack",
    "Legal defense fund raises over $1m for accused in New York subway death",
    "President Lukashenko misses another event prompting speculation of illness",
    "Opposition parties start alliance talks after voters reject military rule",
    "Economy expected to grow faster than forecast, says EU",
    "Imran Khan accuses Pakistan’s military of ordering his arrest",
    "Thousands evacuated as Cyclone Mocha makes landfall",
    "Newspaper apologises for hoax AI article about women’s use of fake tan",
    "Shipwreck found off Tasmanian coast brings closure to 50-year mystery",
    "Disciples gathered to sing the old hymns. But are they a real threat to Rishi Sunak?",
    "Revealed: richer graduates in England will pay less for degree than poorer students",
    "Scientists criticise Nasa for scaling back mission to explore beyond Pluto",
    "DNA reveals family man in Australia was teenage killer who escaped US jail",
    "Tell us: how do you feel about your smartphone use?",
    "How Donald Trump was found liable for sexual abuse",
    "Florida teachers besieged by draconian laws",
    "The world’s oldest dog and uphill sprinting",
    "Memories of meals gone by – in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "A new start after 60: I embraced being single and became an international pet-sitter",
    "US senator denounced as ‘profoundly ignorant man’ over remarks on Mexico",
    "Not having cellphone allowed US boy to save runaway bus from crashing",
    "Florida teacher defends showing Disney movie: ‘I’m just being accepting’",
    "Hertz apologizes after refusing rental car to Puerto Rican customer",
    "Turkey election results 2023: what we know so far",
    "DNA evidence reveals family man in Australia was teenage killer who escaped Nebraska jail",
    "‘Impossible to hold him accountable’: DeSantis signs laws to ease 2024 run"
]