[
    "The Guardian - Back to home",
    "Congressman pleads not guilty to fraud and money laundering",
    "Soldier who Abbott pledged to pardon gets 25 years for BLM protester’s murder",
    "CNN town hall Trump could face questions on verdict",
    "Columnist ‘overwhelmed with joy’ for women in US after Trump verdict",
    "Russia Kremlin calls Poland’s decision to rename Kaliningrad a ‘hostile act’",
    "Russians near Bakhmut have retreated by up to 2km, official says",
    "Ex-president could face questions on sexual abuse verdict in CNN town hall",
    "FDA panel paves way for approval of first over-the-counter pill",
    "Moulin Rouge forced to drop ‘cruel’ underwater act that used snakes",
    "Time stands still at Westminster as Big Ben fails to chime",
    "Company launches new AI PaLM 2 in attempt to regain leadership of the pack",
    "Prime minister Sanna Marin files for divorce",
    "'Losing Gravity role to Sandra Bullock made me feel hopeless'",
    "Soap can make humans more attractive to mosquitoes, study finds",
    "Civil rights leader’s famous criticism of Malcolm X ‘just not true’, author finds",
    "A Walgreens guard killed a Black trans organizer. His community wants answers",
    "What we know on day 441 of the invasion",
    "UK proscribing group as terrorist ‘will help Ukrainians sue’",
    "Ukraine will host after it defeats Russia, says 2022 winner",
    "French journalist killed in Russian rocket strike in Ukraine",
    "Christian pop star Lauren Daigle on Trump, trolling and abortion",
    "Tell us Have you struggled with the US housing crisis?",
    "How finding a home became so absurdly expensive",
    "Why has East German culture become so cool?",
    "The meaning and misogyny of the Trump-Carroll case",
    "Robert De Niro has had his seventh child aged 79. Does that explain the bagel adverts?",
    "Sound artist eavesdrops on what is thought to be world’s heaviest organism",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Milan derby The photo that captured an iconic moment",
    "Football Daily Howitzers, raised eyebrows and more in Madrid",
    "Football Weekly City and Real Madrid trade blows at Bérnabeu",
    "Milan v Internazionale – Champions League semi-final, first leg",
    "Dennis Rodman’s son will transfer to USC, joining Bronny James",
    "Huggins hit with ban and $1m salary reduction for anti-gay slur",
    "Ex-Raider faces up to 10 years in jail after pleading guilty in fatal DUI crash",
    "Sabalenka progress faces test in Swiatek’s fortress",
    "Ferrari must embrace Leclerc’s risk-taking with F1 title gone and car a mess",
    "College football champions decline Biden White House invite",
    "UFC-backed tour leans into right-wing media ties",
    "Sign up to the US opinion email",
    "Lloyd Green Liable for sexual assault, yes – but Trump’s political career is far from over",
    "Consequences for Trump: this beginning took bravery",
    "It’s official: billionaires aren’t the brainboxes they like to believe",
    "E Jean Carroll won. And Trump can be now portrayed as a sexual abuser",
    "Serbia acted after two mass shootings – the US has done nothing despite 200 this year",
    "Dear CNN, giving Trump a town-hall platform is the height of irresponsibility",
    "It’s no wonder that many in Pakistan now fear for the fate of Imran Khan",
    "Jordan Neely’s cry for help should not have been his death sentence",
    "Elizabeth Holmes is rebranding herself as a sweet, devoted mother. Will anyone buy it?",
    "Devastating wildfires will only get worse, new book warns",
    "Microbes discovered that can digest plastics at low temperatures",
    "‘Mind-boggling’ methane emissions revealed",
    "Did distress calls go unanswered in the run-up to a fatal Channel disaster?",
    "Listen to previous episodes",
    "American photography from 1929 to 1941 – in pictures",
    "The idea that you need a white actor is utterly insidious",
    "Fighting back with the banned book reading room",
    "Country star to host Beatles, Elton John and 39 other stars on new rock album",
    "Inside Ed Sheeran’s mysterious fanbase",
    "Memoir rumour pushes mysterious untitled US book up charts",
    "Will New Zealand join? What links the Beatles to peace in Ukraine?",
    "Raucous high school reunion for the sk8er dads",
    "Building a gaming PC is painstaking and humbling – I can’t wait to do it again",
    "What I faced after coming out as a queer Jehovah’s witness",
    "Can New York’s Carbone survive its own success?",
    "Poached pears, winter salad and ‘unthinkable’ pasta",
    "Hotpants and catsuits hit tinsel town",
    "Secret sex signals: love languages of long-term couples",
    "The ultimate guide to making guacamole",
    "Analysis Will the verdict affect Trump's 2024 presidential bid?",
    "E Jean Carroll v Trump How the civil court case unfolded",
    "Carroll Seesawing emotions before jury says it believes her",
    "Republican releases Trump January 6 attack ad aimed at CNN town hall",
    "Possible meteorite crashes into bedroom",
    "Biden to host India’s prime minister for state visit despite concerns over human rights",
    "US doctors How are you navigating abortion restrictions?",
    "Pressure builds as North Carolina set to override ban veto",
    "US rate beat forecasts in April but remained high at 4.9%",
    "US lawmakers call to modernize Osha as hundreds die on the job each day",
    "Photos show children illegally working in US slaughterhouse",
    "Man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Teenager shot by neighbor as she played hide-and-seek",
    "Fast-food chain to test AI chatbot that takes your drive-thru order",
    "Former PM Imran Khan appears before judge amid uproar",
    "Interpol calls for help naming 22 women murdered in past 50 years",
    "At least 21 dead as wildfires rage across Urals and Siberia",
    "Mother’s Day brings only grief for those seeking the disappeared",
    "Fighting continues in defiance of reported ceasefire",
    "Prada fashion boss rescues historic newsstand in Tuscany",
    "Election may not bring the geopolitical shift some are hoping for",
    "Village to be evacuated over Alpine rockslide fears",
    "UK man pleads guilty to hijacking accounts including of Joe Biden and Elon Musk",
    "Scotland Yard admits failing to hand over documents to Daniel Morgan inquiry",
    "Company launches Pixel Fold, Tablet and 7a Android devices",
    "The lawyer whose sex trafficking case against platform could spell trouble for big tech",
    "A woman expresses how it feels to survive rape",
    "Some of the first humans in the Americas came from China, study finds",
    "Lithe lizards and a dog’s dinner",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "US man leaves job interview, rescues baby in runaway stroller, then lands job",
    "Liz Cheney releases Trump January 6 attack ad aimed at CNN town hall",
    "Russians near Bakhmut have retreated by up to 2km, Ukrainian official says",
    "Donald Trump could face questions on sexual abuse verdict in CNN town hall",
    "US Senator Dianne Feinstein returns to duty after months-long absence – as it happened",
    "Finland’s prime minister Sanna Marin files for divorce",
    "Scarlett Johansson: losing Gravity role to Sandra Bullock made me feel hopeless",
    "Milan v Internazionale: Champions League semi-final, first leg – live"
]