[
    "The Guardian - Back to home",
    "Russia General who may have known about mutiny goes missing",
    "Germany Wagner mutiny has weakened Putin, says chancellor",
    "At a glance What we know on day 491 of the invasion",
    "Ukraine makes advances in south and east, top general says; Putin greets crowds in rare walkabout",
    "Presumed human remains recovered from within wreckage, US Coast Guard says",
    "Texas Record-setting heat sends hundreds to emergency rooms",
    "Heatwave in south and wildfire smoke in north buffet US from both sides",
    "Joshua Trees win long term protection in environmental victory",
    "Astronomers detect ‘cosmic bass note’ of gravitational waves",
    "Second night of protests over police shooting of teenager",
    "Beijing on course to hit wind and solar power target five years ahead of time",
    "Magazine reportedly lays off its last staff writers",
    "Yusef Salaam declares victory in city council primary",
    "Law passed allowing abortion only when woman’s life is at risk",
    "Broadcaster reprimanded over ‘graphic’ dolphin mating scene",
    "Why are sea lions and dolphins dying along California’s coast?",
    "A couple’s quixotic quest to save their drowning island – one rock at a time",
    "Why are US retail workers being denied chairs?",
    "Manuscript sheds new light on creation of Capote’s In Cold Blood",
    "What we know on day 491 of the invasion",
    "Four children among 11 killed in missile strike on pizza restaurant",
    "Defence minister expects Nato ‘guarantee’ after war",
    "Alliance ready to face threat from ‘Moscow or Minsk’",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Rightwingers say lefties are killing New York pizza. Here’s what’s really happening",
    "Rising seas have flooded this Lagos town three times. Can it survive?",
    "The people who taxidermy their pets",
    "Why Paul McCartney longs for the days of half hour gigs",
    "Anger and fear as food aid suspension hits in Ethiopia",
    "Three crowd-pleasing Vietnamese recipes by Tommy Pham",
    "AFC Croydon responds to new owners Stormzy and Zaha",
    "Mike Figgis on Julian Sands",
    "Sign up to the US opinion email",
    "Our primary healthcare system is a mess. We have a plan to fix it",
    "Everything has turned grey – cars, clothes, kitchens, carpets. I can’t take it any more",
    "Assisted dying is on nobody’s bucket list – but preventing it is deeply unjust",
    "The key to wedded bliss is a joint bank account? I don’t buy it",
    "South Korea has turned back time and made its people younger – sign me up",
    "Inter Miami hire Tata Martino as coach, confirming Messi reunion",
    "Tour de France 2023 Stage-by-stage guide",
    "Mäder’s death prompts new Tour de France safety calls",
    "Brittney Griner’s triumphant return to the WNBA",
    "Declan Rice Arsenal finalize $133.3m deal after City pull out",
    "How good are Brazil and how far can they go?",
    "Tennessee State to become first HBCU to add ice hockey",
    "Gymnast returns for first meet since 2020 Tokyo Olympics",
    "Ohtani becomes sixth with two homers and 10 strikeouts since 1893",
    "Saudi leader trying to avoid ‘pariah’ status with LIV-PGA merger, says campaigner",
    "Global heating making extreme rain and catastrophic flooding more likely",
    "Climate crisis linked to rising domestic violence, study finds",
    "Biden’s efforts to clear fuel in US forests are falling short",
    "So what if fossil fuel lobbyists have to declare themselves at Cop28? That won’t curb their power",
    "Donald Trump Former president sues E Jean Carroll for defamation over rape comments",
    "Trump trial could be delayed until spring 2024",
    "Highest-ranking trans elected official in US to run for Congress",
    "Man gets prison time for years-long cow dung scam",
    "Man pleads not guilty to manslaughter over chokehold death of Jordan Neely",
    "Nasa aims to mine resources on moon in next decade",
    "US paramedic saves lives of two people in one family",
    "Airbnb to offer pink Malibu mansion",
    "Company may have misled dozens of advertisers and violated its own guidelines - report",
    "Human remains found in California mountains confirmed as British actor",
    "Supreme court ruling on stalking cases sparks alarm",
    "Amazon facing ‘urgent’ crime crisis after gutting of protections, says drugs tsar",
    "Supplements may cut risk of heart attacks, trial suggests",
    "Ex-military policeman found guilty of genocide by Paris court",
    "Ambassador calls Australia ‘vindictive’ after dead possum thrown onto disputed embassy site",
    "Video of apparent neo-Nazi handing out balloons at nursery sparks outrage",
    "Man hoping to break record for living on barren rock rescued by coastguard",
    "Pilot dumps drugs over remote region when pursued by fighter jet",
    "Genetic variant identified that may increase severity of condition",
    "Police station attacked as search continues for 14 missing employees",
    "Engineer sentenced to life in prison for killing three women over job losses",
    "Guards at Del Monte pineapple farm in Kenya accused of killings",
    "Listen to previous episodes",
    "People still do not want women to succeed or be equal. While that is true, you need Virago",
    "Singer's tour postponed after she suffers ‘serious’ bacterial infection",
    "Taylor Swift, Ke Huy Quan, Paul Mescal among those invited to join the Academy",
    "What does it mean to be intersex?",
    "Meghan and Harry’s trainwreck podcast career",
    "Twitter rips into Jeremy Corbyn’s poetry – except it’s actually by Shelley",
    "The married couple competing to have the biggest and best facial hair",
    "10 ways to be much more confident at parties",
    "10 famous food rules you can absolutely ignore",
    "10 of the weirdest sporting events in the UK",
    "I was gay, disabled, alienated. With seven kind words, my life began",
    "How to make coffee granita – recipe",
    "Why is the Earth’s gravity weakest in an area of the Indian Ocean?",
    "Changing skin pattern while asleep may show they dream, research shows",
    "The author under attack for doubting Shakespeare",
    "Fresco find possibly depicts 2,000-year-old form of pizza",
    "Outcry after tourist carves name on wall at Colosseum",
    "How Kylie and Fleetwood Mac found new young fans",
    "Mountain basketball and an earthquake wedding",
    "Dancing, feasts and faith mark life on a vanishing island",
    "Muslim pilgrims gather on Mount Arafat in Saudi Arabia",
    "Andi Gáldi Vinkó’s visions of motherhood",
    "Identity in modern Britain – in pictures",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Presumed human remains recovered from within Titan wreckage, US Coast Guard says",
    "Russian general who may have known about Wagner mutiny goes missing",
    "National Geographic reportedly lays off its last staff writers",
    "Terrible ideas, tedious shows, zero talent: Meghan and Harry’s trainwreck podcast career",
    "‘We are literally erased’: what does it mean to be intersex?",
    "‘Not for employee use’: why are US retail workers being denied chairs?",
    "Julian Sands confirmed dead after human remains identified",
    "Wagner mutiny has weakened Putin, says Scholz, as Russian president makes rare public visit"
]