[
    "The Guardian - Back to home",
    "Man sues Trump adviser for false arrest after ‘pat’ on back led to assault charge",
    "Debt default crisis McCarthy says deal is in reach",
    "Democratic senators urge Biden to invoke 14th amendment to prevent debt default",
    "World likely to breach 1.5C climate threshold by 2027, scientists warn",
    "Couple in ‘near catastrophic car chase with paparazzi’",
    "Conservative judges signal support for anti-abortion plaintiffs in lawsuit",
    "Naomi Klein investigates ‘conspiracy theory culture’ that has shaken her life",
    "Blow to DeSantis as Democrat wins Jacksonville mayor’s race",
    "Devastating floods claim lives and leave thousands homeless",
    "Allies attempt to undermine prosecutors endangering 2024 bid",
    "Missing girl featured in Netflix series Unsolved Mysteries found",
    "Comedy firm fined $2m over standup’s stray dog joke",
    "US cyclist who taunted fascist group wins plaudits",
    "Man City v Real Madrid – Champions League semi-final, second leg",
    "Digital scan of Titanic wreck could reveal its secrets",
    "How drug became a target of the US anti-abortion movement",
    "What we know on day 448 of the invasion",
    "Mercenary who fought for Russia in Ukraine jailed",
    "Beijing tells foreign embassies to remove ‘politicised propaganda’",
    "UK and Netherlands agree ‘international coalition’ to help Ukraine",
    "They moved to a Buddhist retreat in rural America. Have they found happiness?",
    "Why are rightwingers melting down over Miller Lite?",
    "Steve McQueen’s moving meditation on wartime Amsterdam",
    "Pedro Pascal and Ethan Hawke sizzle in Almodóvar’s queer cowboy short",
    "How Israel uses water to control the West Bank",
    "How Irish author Katriona O’Sullivan escaped her fate",
    "Guardian Today US: Get the headlines & more in a daily email",
    "Sign up to the US opinion email",
    "The fall of Rudy Giuliani, once the toast of New York, continues unabated",
    "I took my kids to the playground without bringing my phone – and it was a revelation",
    "I left my party lifestyle behind for a week in a nunnery – and began to see the light",
    "Vice is going bankrupt, BuzzFeed News is dead. What does it mean?",
    "No one has accepted real responsibility for the East Palestine disaster",
    "The San Antonio Spurs won the draft lottery. So did Victor Wembanyama",
    "NBA San Antonio win lottery for ‘once-in-a-millennium’ prospect",
    "Power lies with two superteams. But that’s not necessarily a bad thing",
    "Off-key Djokovic bundled out of Italian Open by Rune",
    "Hamilton backs decision to cancel flood-hit Emilia Romagna GP",
    "GZA hosts unlikely crossover in Melbourne",
    "Middlesbrough v Coventry – Championship playoff semi-final, second leg",
    "Inter’s success built on depth and defensive resilience",
    "Climate breakdown made southern Asia heatwave at least 2C hotter, study finds",
    "Pollution could be slashed by 80% by 2040, UN says",
    "EPA finally wakes up with stiff new climate rules",
    "Oceans have been absorbing the world’s extra heat. But there’s a huge payback",
    "Has Ukraine’s spring offensive begun?",
    "Listen to previous episodes",
    "Monster review Hydra of modern morals and manners",
    "Anselm review Wim Wenders’ reverent 3D portrait of artist Anselm Kiefer",
    "Tiger Stripes review Coming-of-age body horror releases the monster inside",
    "Johnny Depp on comeback trail amid criticism of festival organisers",
    "Navajo cowboys impersonating John Wayne: Roswell Angier’s best photograph",
    "Stupidly entertaining sequel offers more of the same",
    "A first-ever look at the making of the Rorschach test",
    "Inside the women’s US soccer league",
    "AI’s terrible attempt to write TV",
    "Pop star beats second lawsuit over Thinking Out Loud and Let’s Get It On",
    "Judy Blume’s classic pre-teen tale retold",
    "Patricia Arquette’s comedy is so jampacked it’s exhausting",
    "The rediscovery of Soda Stereo, Argentina’s biggest band",
    "A brutal attack ended my dreams of being a boxer – but I found a new passion",
    "Cracking modular PC gets all-round upgrade",
    "The women wearing ‘subway T-shirts’ over outfits to avoid creepy stares",
    "Gucci show reaffirms Seoul’s status as capital of pop culture",
    "Recipe for apricots with French toast and pistachio mascarpone",
    "How Jennifer Hosten became the first Black Miss World – and an international diplomat",
    "The Texas Democrat fighting for gun control and abortion rights",
    "School district sued for violating first amendment rights with book bans",
    "Law aims to stop funding of illegal Israeli settlements in West Bank",
    "Alligator relaxes at Alabama beach",
    "Intruder at home of Biden adviser bypassed Secret Service agents",
    "Trump wins proxy battle with DeSantis over governor pick",
    "YouTube found to push content about guns to children watching games videos",
    "I will tweet what I want even if it loses me money",
    "Oldest serving senator says she ‘hasn’t been gone’ despite absence",
    "Court rules Elizabeth Holmes must go to prison while she appeals sentence",
    "Cancelled Quad summit is a win for China and a self-inflicted blow to the US’s Pacific standing",
    "Embattled president dissolves congress in bid to avoid impeachment",
    "Spanish climber, 84, injured in bid to be oldest to scale world’s 14 highest peaks",
    "Nicolas Sarkozy must wear electronic tag, appeals court rules",
    "Former world leaders urge G7 to get nuclear arms control back on track",
    "Quarter of million Somalis flee flooded homes",
    "Slovakia on brink of blocking legal recognition for trans people",
    "Five go on trial over alleged far-right coup plot",
    "Cash machine gangs broken up with 14 arrests",
    "Malawi’s Rastafarian children return to school after ban is lifted",
    "This 9/11 suspect and ‘torture prop’ has been there 20 years. Is he nearing a deal with the US?",
    "Somaliland women smell success as frankincense business takes off",
    "Quest to save family plot of land led from Guatemala to death at US border",
    "Could Guyana’s Exxon ruling scare big oil off risky exploration?",
    "Can TV drama end legal woes of Egypt’s bereaved?",
    "What will happen if debt ceiling isn't raised?",
    "Cannes glitterati and peregrine chicks",
    "A selection of the winning images",
    "Female photographers from the Islamic world",
    "Share stories with the Guardian securely and confidentially",
    "Most viewed Across the guardian",
    "Prince Harry and Meghan in near catastrophic car chase with paparazzi, spokesperson says",
    "‘You wear Walmart khakis’: US cyclist who taunted fascist group wins plaudits",
    "Women drinking beer clothed: why are rightwingers melting down over Miller Lite?",
    "Manchester City v Real Madrid: Champions League semi-final, second leg – live",
    "Man sues Giuliani over false arrest after ‘pat’ on back led to assault charge",
    "Missing Illinois girl featured in Netflix series Unsolved Mysteries found"
]