[
    "Delhi\nDelhi witnesses sudden change in weather, wakes up to balmy morning",
    "Mangaluru\nAir India launches second Mangaluru-Mumbai daily flight",
    "Mumbai\nNews in Frames | Maximum damage",
    "Opposition needs to present alternative to the BJP, PM face is not the issue: Sharad Pawar",
    "He will attend the meeting of Opposition parties in Patna on June 23",
    "Taiwan sends up fighters as Chinese warplanes cross strait's median line",
    "AAP ‘Maha Rally’ | Delhi CM Arvind Kejriwal says will oppose Centre’s ordinance and save democracy",
    "WorldUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Football\nManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "WorldPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil Nadu\nBuckingham Canal | A waterway once is sewage-carrier now",
    "ScienceIIT-Madras generates hydrogen from seawater using solar energy",
    "Andhra Pradesh\nA.P. forest officials release 4.32 lakh Olive Ridley turtles into sea",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Dear Deputy CM, nice thought, but an elite task force is not what Bengaluru needs’",
    "Chaos and congestion in front of Bengaluru metro stations",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Elderly woman among three killed in attack on Kuki village",
    "Reservation for Muslims is against the Constitution, says Amit Shah",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "Well-marked low-pressure area over Bay perks up monsoon flows",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]