[
    "Explained | Abaucin, the potential new antibiotic found with machine-learning",
    "How the old found sanctuary and the new blossomed in CSK",
    "75 years of peacekeeping: India’s contribution to U.N.’s peace missions",
    "‘A passenger boarding Air India must be pleasantly surprised’: CEO Wilson",
    "Punjab Cabinet expanded; two more MLAs inducted, Minister Nijjer quits",
    "Top AI CEOs, experts raise 'risk of extinction' from AI",
    "OTT shows must carry anti-tobacco warnings: Health Ministry",
    "Manipur violence | Amit Shah to visit Moreh, review security measures",
    "BJP 'threatening' people and 'misusing' government agencies: Rahul Gandhi in U.S.",
    "Wrestlers’ protest | Naresh Tikait announces mahapanchayat in Muzaffarnagar on Thursday",
    "NIA raids 16 locations linked to banned Popular Front of India in Karnataka",
    "2023-05-31T14:49:22+05:30\n-\nKochi\nBoys corner top ranks in CUSAT’s CAT for B. Tech programmes",
    "2023-05-31T14:44:55+05:30\n-\nTechnology\nFidelity fund downgrades its Twitter stake once more",
    "2023-05-31T14:24:49+05:30\n-\nTechnology\nHow to block ads in Chrome browser",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "CSK’s win over Titans showcased the best and the latest of IPL",
    "Kerala\nA woman police officer in Kerala who fought many battles for gender equality",
    "IndiaDaily Quiz | On Chief Ministers",
    "Karnataka\nFree bus travel for women in Karnataka after June 1: Transport Minister",
    "Delhi\nIn a first since 2014, Delhi experiences heatwave-free May",
    "CricketSai Sudharsan — all class and confidence",
    "Technology\nHow to block ads in Chrome browser",
    "India\nPurana Qila excavations reveal pre-Mauryan era settlement",
    "ScienceIndian scientists discover new exoplanet with mass 13 times that of Jupiter",
    "Kerala\nWatch | What was the Vaikom Satyagraha all about?",
    "The short history of a large note",
    "Using Buddhism as a tool of soft power",
    "Rethinking alliances in Andhra",
    "From Master of the Roster to Master of all Judges?",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "The BJP outreach to Saivites",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Wrestlers defer plan to immerse medals",
    "IPL 2023 Final | Chennai Super Kings beats Gujarat Titans by five wickets to win fifth title",
    "Faster, stronger: on India and its supercomputer use",
    "Heavy rain seen for Kerala, Karnataka but monsoon not in sight yet",
    "RBI sure of India’s growth, but stresses on reforms sustaining",
    "Advani called it ‘the Congressisation of the BJP’",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]