[
    "In Tamil Nadu, protecting land asset is more challenging than buying it",
    "WFI chief Brij Bhushan Singh to address U.P. BJP rally on June 11",
    "How genome sequences tracked down ancient disease ‘black death’",
    "Foucault pendulum | Earth’s rotation on display",
    "Under construction bridge collapses in Bihar’s Bhagalpur",
    "Refugee influx into Mizoram from all around and new concerns",
    "Three-member Commission of Inquiry to probe ethnic violence in Manipur",
    "First train chugs out of Odisha’s accident-hit area after 51 hours",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Railways yet to rectify coupler issue that detaches coaches from engine",
    "Opposition meet likely to be postponed",
    "2023-06-05T02:12:37+05:30\n-\nNew Articles\nZelenskyy says Russia is evading sanctions on weapons",
    "2023-06-05T01:55:00+05:30\n-\nOther Sports\nGautami Bhanot, Abhinav Shaw win mixed air rifle gold",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "Courts should be wary of incremental steps to alter status of places of worship",
    "A vote for change: On the result of the Thai parliamentary election",
    "The Generals should cede power without triggering chaos",
    "Movies\nVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "HockeyLeaders of Asia, Indian juniors now target the World",
    "Know Your English\nWhen are you planning to hit the road?",
    "Kerala\nWomen find their footing in tourism in flood-ravaged Kuttanad",
    "Kerala\nAs AI check starts, no fine for second pillion rider under age 12 in Kerala",
    "Tamil NaduAs more opt for their own private space, senior living real estate segment opens up",
    "Industry\nUnruly passenger behaviour | ‘1 incident reported for every 568 flights globally in 2022’",
    "Tamil Nadu\nThiruvavaduthurai Math | A renowned seat of Tamil language and culture",
    "Open PageThe Bangalore book crawl",
    "Environment\nHow the climb up Mount Everest has changed in 70 years",
    "Citizen activism that is missing from the wrestling ring",
    "A model lab for secular governance?",
    "Spare the rod and change the law",
    "Recasting the discourse on Muslim education",
    "The Delhi ordinance is an unabashed power-grab",
    "International trade has a carbon problem",
    "How genome sequences tracked down an ancient disease",
    "Explained | What are the friction points on the LAC?",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Pakistan hands over 200 Indian fishermen at Attari-Wagah border",
    "Government bans 14 combination drugs used to treat common ailments",
    "Govt. wants to make sedition law more draconian: Congress",
    "CAG’s 2022 report on ‘Derailments in Indian Railways’ flagged multiple shortcomings",
    "India deserves to have non-stop flights to more overseas destinations: Air India CEO",
    "What is KAVACH? Could it have prevented the Odisha train tragedy?",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Why Pali lost out and Sanskrit received more than its due",
    "Thailand Open 2023: Lakshya Sen bows out with loss against Kunlavut Vitidsarn",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]