[
    "News Analysis | Eight months on, ‘Team Kharge’ is a work in progress ahead of 2024 poll",
    "Data | With French Open win, Djoker holds all the cards now",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "A churning in Andhra Pradesh",
    "PM Modi’s U.S. visit | Activists ask Biden to publicly rebuke Modi over human rights",
    "Meitei Tribes Union files plea to defer hearing on appeal against ST status order",
    "Karnataka free rice scheme | Amit Shah promises to speak to Union Food Minister",
    "Manipur violence | Amit Shah calls all-party meeting on June 24",
    "U.S. to ease visas for skilled Indian workers as PM Modi visits",
    "West Bengal Governor returns State Election Commissioner’s joining report",
    "2023-06-22T06:31:58+05:30\n-\nWorld\nU.S. to ease visas for skilled Indian workers as PM Modi visits",
    "2023-06-22T05:21:00+05:30\n-\nWorld\nU.S. bombers land in Sweden for exercises for first time",
    "Overkill: On the Internet shutdown in Manipur",
    "The Manipur government’s decision to extend the Internet shutdowns lacks merit",
    "Heat and state: On a heatwave being only one half of the issue",
    "Poor living conditions have exacerbated the effects of heat waves",
    "Movies\nFirst look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "IndiaSylvester daCunha, creator of iconic Amul girl, dies",
    "Business\nAmazon to collect expiring ₹2,000 notes from customers",
    "Business\nIs GDP the right way to measure a nation’s progress?",
    "India\nPM Modi-led Yoga session at UN creates Guinness World Record",
    "InternetSnapchat launches nicknames inspired AR lenses in India",
    "Movies‘Lust Stories 2’ trailer: Netflix anthology looks at love, sex and social class",
    "More HIT than miss in India-Nepal ties",
    "Rethink the retention of sedition",
    "Spare a thought for psychiatric caregivers too",
    "Semiconductor fab: the unfinished agenda",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "Explained | Was India’s hot summer of 2023 the first of many to come?",
    "FeaturedPride Month | Queer cinema’s shackles in the mainstreamMoviesBhuvanesh ChandarREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "Tesla looking at significant investment in India: Elon Musk after meeting PM Modi",
    "PM Modi in U.S. | Narendra Modi arrives in New York; to lead Yoga Day at United Nations",
    "Karnataka: State industry association calls for one-day bandh on June 22",
    "India may hike reserve price of wheat in open market sale",
    "What is really behind the violence in Manipur?",
    "What place does a sceptre have in a democracy?",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]