[
    "NCP’s Delhi meeting ‘expels’ Ajit Pawar, 11 others from party",
    "Data | Why Centre’s denial of rice through OMSS hits Karnataka the most",
    "Science for All | Why does observing gravitational waves matter?",
    "Yuki Bhambri’s doubles success will inspire many Indian players, says coach M. Balachandran",
    "Kerala rains | Flood situation remains grim in upper Kuttanad, rough sea batters Alappuzha coast",
    "As envoy says G-20 summit is key event for Russia, Putin visit now a possibility",
    "State Election Commissioner responsible for corpses on the streets: West Bengal Governor",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Pleas for restoring Internet to be heard in chambers: Manipur High Court",
    "Freedom of expression being misused in Canada by anti-India elements: MEA Spokesperson",
    "Defamation case | Gujarat HC to deliver verdict on Rahul’s plea tomorrow",
    "2023-07-06T23:54:38+05:30\n-\nDelhi\nHC for closing contempt case against S. Gurumurthy",
    "Momentum softens: on S&P Global’s survey",
    "Food inflation threatens to undermine efforts to ensure price stability",
    "Limits of expansion: the controversy over the Open Market Sale Scheme",
    "Governments must focus on effective implementation of existing food security schemes",
    "Podcast\nWhy are Indian highways so unsafe? | In Focus podcast",
    "CartoonIt rained in the city",
    "Movies\nLeonardo DiCaprio, Robert De Niro’s ‘Killers of the Flower Moon’ trailer out",
    "Movies\nWatch | Amala Akkineni: Cinema is no longer about one person producing a masterpiece",
    "TelanganaPicture shot by Telangana girl makes it to Vogue Italia magazine",
    "Karnataka\nMysuru’s public bicycle sharing system Trin Trin to get new technology",
    "Economy\nIndia’s expanding middle class will bulge up to over 1 billion by 2047: PRICE study",
    "Movies\n‘Salaar: Part 1’ teaser: Prabhas is all fire in Prashanth Neel’s intense gangster drama",
    "India needs a Uniform Civil Code",
    "Internationalising the rupee without the ‘coin tossing’",
    "An inclusive social policy for migrants",
    "Green Humour by Rohan Chakravarty",
    "Gujarat’s bridges to nowhere",
    "Choose a new palette for India’s creative economy",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "Explained | The changes to the Liberalised Remittance Scheme",
    "Explained | India’s diabetes epidemic is making India’s TB epidemic worse",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ph.D not compulsory for teaching jobs in colleges, universities: UGC",
    "Diminishing returns: On India and its Shanghai Cooperation Organisation engagement",
    "Finance Minister Sitharaman calls up DGP after gang kidnaps two GST officers in Telangana",
    "AP’s new pension scheme is attractive and viable",
    "India to insist on well-defined criteria for BRICS expansion",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "World Cup Qualifier 2023 Super Six: Qualification scenarios for Zimbabwe, Scotland, Netherlands",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]