[
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "Tagore’s birth anniversary celebration overshadowed by protests at Santiniketan",
    "It depends on who is giving the rating: Centre on India’s rank in press freedom index",
    "Karnataka Assembly Elections voting live updates | Voting begins across the State",
    "Polling day dawns in Karnataka after pitched campaign by all parties",
    "Jury orders Trump to pay columnist $5M after finding him liable for sexual assault, defamation",
    "No end to the humiliations of frisking for NEET aspirants",
    "2023-05-10T03:23:00+05:30\n-\nWorld\nU.N. says Iran executes on average more than ten people per week",
    "2023-05-10T02:49:00+05:30\n-\nIndia\nGovt. to start country-wide screening for thalassemia",
    "2023-05-09T22:45:58+05:30\n-\nWorld\nActivists block Russian ambassador at Soviet memorial in Warsaw",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "Tamil NaduPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Movies\n‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "Technology\nElon Musk warns that Twitter will purge unused accounts",
    "WorldSCO FM meet | India’s bilateral tensions vs multilateral ambitions",
    "Technology\nGoogle to pay New York Times $100 million over three years in a content deal: Report",
    "Salvaging the idea and reality of Manipur",
    "Upsetting the apple cart in Himachal",
    "Not quite the Kerala story",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Govt. panel proposes ban on diesel 4-wheeler vehicles by 2027",
    "More than a story: on the film, The Kerala Story, and the demand that it be banned",
    "Former Pakistan PM Imran Khan arrested during court appearance, sparking protests",
    "India’s China strategy needs to be debated",
    "ITC Foods introduces its first millet cookies",
    "How Manipal’s Pai is growing the health and education pie",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after MI vs RCB match - Mumbai third with sixth win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]