[
    "Cyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Humans’ groundwater extraction has affected the earth’s rotation: study",
    "Kukis | Fight for land and identity",
    "Kathmandu Mayor bans Bollywood films after ‘Adipurush’ row",
    "Gita Press, Gorakhpur, awarded Gandhi Peace Prize for 2021",
    "West Bengal Governor sets up control room for panchayat poll grievances",
    "Manipur CM asks Mizoram counterpart to protect Meiteis; BJP MLAs in New Delhi to meet PM",
    "Mizoram bears burden of drug trade after unrest in Manipur",
    "Heavy overnight rains lash many parts of Chennai and neighbouring districts",
    "Indian medicines under lens in Sri Lanka over a series of adverse events",
    "2023-06-19T10:20:02+05:30\n-\nMarkets\nSensex climbs 190 points in early trade; Nifty up 55 points",
    "2023-06-19T10:10:07+05:30\n-\nMarkets\nRupee falls 6 paise to 81.96 against U.S. dollar",
    "2023-06-19T09:50:21+05:30\n-\nTechnology\nTech entrepreneur Ian Hogarth will head UK's AI taskforce",
    "2023-06-19T09:37:31+05:30\n-\nChennai\nIn Frames | Chennai rains",
    "2023-06-19T09:09:56+05:30\n-\nTamil Nadu\nTop T.N. news developments today",
    "Preparedness pays off: On Cyclone Biparjoy",
    "Massacre of innocents: On the attack on a school on the Uganda-Congo border",
    "Uganda and Congo must do more against Islamist militants",
    "Tamil Nadu\nFrom Kanniyakumari to California: Puppet artiste to perform in the U.S.",
    "Tamil NaduVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Tamil Nadu\n‘Tamil Nadu’ | On the wrong side of history and law: a fraud exposed",
    "Movies\nNoted cinematographer Navroze Contractor killed in a bike accident",
    "Technology\nExplained | How do Telegram bots function?",
    "Movies‘Adipurush’ dialogue writer says they will revise dialogues that hurt sentiments",
    "India\nUniform Civil Code | What is the Law Commission’s new move ?",
    "Society\nIndia | How queer are our public spaces?",
    "EnvironmentHumans’ groundwater extraction has affected the earth’s rotation: study",
    "Tamil Nadu\nTeacher takes students to school in autorickshaw to prevent dropouts near Vellore",
    "What Indians should be saying to the U.S. on June 21",
    "A case of propriety versus politics",
    "Emerging challenges to the Dravidian model",
    "Indian students must be taught that doing is the new learning",
    "Responsibility and the complexities of climate leadership",
    "The path to a new and imminent U.S.-Iran nuclear deal",
    "Explained | How do Telegram bots function?",
    "Explained | How can India tackle its diabetes burden?",
    "Explained | What is the India, U.S. initiative on future tech?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why the traffic is no longer an issue in Bengaluru",
    "Gruha Jyothi registration postponed to June 18",
    "Science Secretary Srivari Chandrasekhar demits office, cites personal reasons",
    "Direct tax collection in April 1-June 17 rises 12.7%",
    "RPower settles ₹925-cr debt of UP unit with funds from Varde Partners",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]