[
    "How the reification of caste will not lead to a true politics of change and justice",
    "In Tamil Nadu, protecting land asset is more challenging than buying it",
    "How genome sequences tracked down ancient disease ‘black death’",
    "Foucault pendulum | Earth’s rotation on display",
    "Move to withdraw Karnataka anti-cow slaughter Act triggers political slugfest",
    "IISc. retains top spot in India in university and research categories in NIRF ranking",
    "Amit Shah meets wrestlers at his official residence, tells them to ‘trust the investigation’",
    "The Ministry of Home Affairs has, however, denied that any such meeting took place",
    "What could have led Coromandel Express into the loop line?",
    "India, U.S. conclude roadmap for Defence Industrial Cooperation",
    "PM Modi driving Indian car looking into rearview mirror and it’s crashing: Rahul Gandhi",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "Courts should be wary of incremental steps to alter status of places of worship",
    "A vote for change: On the result of the Thai parliamentary election",
    "The Generals should cede power without triggering chaos",
    "Karnataka\nThis Bengaluru-based start-up generates water from thin air",
    "Tamil NaduAs more opt for their own private space, senior living real estate segment opens up",
    "Movies\nVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "Technology\nLinda Yaccarino to take over as Twitter CEO officially this week",
    "TechnologyHere Comes the AI: Fans rejoice in 'new' Beatles music",
    "Know Your English\nWhen are you planning to hit the road?",
    "Bengaluru\nBengalureans who embrace a reduced waste lifestyle",
    "GadgetsWatch | Samsung T7 Shield drop resistance slow-motion video",
    "Telangana\nSecunderabad station expansion | Scores of trees felled, forest permission ambiguous",
    "Citizen activism that is missing from the wrestling ring",
    "Spare the rod and change the law",
    "International trade has a carbon problem",
    "A model lab for secular governance?",
    "The Delhi ordinance is an unabashed power-grab",
    "Explained | The decade-long search for a rare Higgs boson decay",
    "Explained | How KFON aims to bridge the digital divide in Kerala",
    "Explained | Why does North Korea want spy satellites?",
    "How genome sequences tracked down an ancient disease",
    "Explained | What are the friction points on the LAC?",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Days after the horrific accident, another goods train derails in Odisha",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Odisha train accident death toll lowered to 275",
    "Under-construction bridge collapses in Bihar’s Bhagalpur; probe ordered",
    "Solar industry ‘rushing headlong’ into supply glut, cautions IEA report",
    "Air India will have to build a strong MRO, says CEO Campbell Wilson",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Odisha train tragedy raises questions about rail safety and signals system",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]