[
    "The View from India | Warm embrace, elevated ties",
    "The main chapter of how Hindutva sees the past",
    "A man of the times and ahead of it",
    "Reduced ceiling, increased anger",
    "EPFO extends deadline to apply for higher pension till July 11",
    "Opposition plans seat sharing in States where there is already alliance",
    "Rajasthan Assembly elections | Pressure building up on Gehlot to field younger politicians",
    "Militant killed in encounter in J&K’s Kulgam",
    "One security personnel was injured in the operation in Kulgam.",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "Centre will ensure execution of SoO pact with Kuki groups, says Amit Shah",
    "2023-06-27T11:30:29+05:30\n-\nKarnataka\nTop news developments in Karnataka on June 27, 2023",
    "2023-06-27T11:22:05+05:30\n-\nDelhi\nPolice arrest five in Delhi’s Pragati Maidan robbery case",
    "2023-06-27T11:04:34+05:30\n-\nMarkets\nRupee appreciates 8 paise to 81.96 against U.S. dollar",
    "2023-06-27T10:49:55+05:30\n-\nMarkets\nSensex rises by 235 points in early trade",
    "A grand revival: on India-Egypt ties",
    "India and Egypt have re-established close ties in recent years",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Valdimir Putin should bring the war to an end for stability at home",
    "Coimbatore\nKamal Haasan gifts car to Coimbatore’s first woman bus driver",
    "CricketOut of this world: ICC World Cup trophy sent to space",
    "Technology\nMeta to train 10 lakh traders with CAIT leveraging WhatsApp Business",
    "Technology\nQualcomm unveils 5G capable Snapdragon 4 Gen 2 SoC for entry segment phones",
    "MotorsportRyan Reynolds, Rob McElhenney join group buying into Alpine F1",
    "Bengaluru\nA kg of tomato to likely cost over ₹100 soon",
    "India Open Market Sales Scheme | Now, Centre Vs State on foodgrains",
    "Cricket\nHasaranga becomes first ODI spinner to take three consecutive 5-wicket hauls",
    "Manipur — this is not a time for finger-pointing",
    "Laying the foundation for a future-ready digital India",
    "Joining the hunt: India and the Artemis Accords",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A new regime: On the Emergency Use Authorisation regime in India and clinical trials",
    "Explained | Understanding the Wagner mutiny",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "Obama’s remarks about minority rights in India are surprising, says Nirmala Sitharaman",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "Shree Cement share price tanks 10% on ₹23,000-crore tax evasion report",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Asian Kabaddi Championship: Squad, fixtures & live streaming info - all you need to know",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]