[
    "Bleeding blue in Nanded | Where celebrating Ambedkar’s birthday is a crime",
    "Indian students, doing is the new learning",
    "Migrating on the Coromandel Express",
    "How Tamil Nadu is isolating, eliminating chronic ailments using door-to-door screening",
    "Altered chemistry, strategy define Opposition unity 2.0",
    "Focus on illegal immigration from Punjab after Canada’s recent deportation threat",
    "‘American chipmaker Micron mulls large investment in India’",
    "In the aftermath of cyclone Biparjoy, Gujarat grapples with destruction",
    "NCERT textbook row | 73 academics defend efforts to ‘update’ syllabus",
    "2023-06-17T10:10:26+05:30\n-\nTechnology\nTwitter to focus on video, commerce in business revamp",
    "2023-06-17T10:04:58+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "Shifting sands: On India’s external trade performance",
    "Before things get better on the trade front, they may get worse",
    "Mounting tensions: On the threat to social harmony in Uttarakhand",
    "Criminal cases should not be allowed to take a communal colour",
    "World\nU.S. eases norms on eligibility criteria for those awaiting Green Card",
    "Other StatesJoy amid Biparjoy | 707 babies born to women who were shifted to shelters",
    "Life & Style\nWatch | Turning agro-waste into cutlery and crockery",
    "Books\nA dictionary on Kambaramayanam with 22,000 words and phrases launched",
    "Movies\n‘I Love You’ movie review: Rakul Preet Singh is trapped in an inane thriller",
    "GadgetsLenovo launches new Legion Slim series for gamers and creators",
    "Railway safety — listen to the voices from below",
    "The path to a new and imminent U.S.-Iran nuclear deal",
    "Indian students must be taught that doing is the new learning",
    "Jumpstarting the next phase of U.S.-India defence ties",
    "A media war with no winners",
    "Is the Indian Railways stretched beyond its capacity?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Karnataka to scrap anti-conversion law, reverse textbook changes",
    "7.2 magnitude quake strikes near Tonga",
    "Manipur violence | Sedition case against Meitei politician after Assam Rifles complaint",
    "Culture shift: On the U.S.’s UNESCO re-entry",
    "A journey with migrants on an unreserved coach of the Coromandel Express",
    "Biparjoy refuses to blink even after landfall, stays cyclone through Friday",
    "Lifestyle beverage brand Salud raises the bar with launch of its newest gin",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "Reading charged by EFL after failure to pay players’ wages on time",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]