[
    "Pak’s SC orders release of former PM Imran Khan",
    "A British engineer who brought water and prosperity to a valley in Tamil Nadu",
    "Kerala Spotlight | Not a rosy picture on the silver screen",
    "Hakki Pikkis — bird catchers to entrepreneurs of traditional medicine",
    "Adani-Hindenburg row | Supreme Court confirms receipt of J. Sapre panel report",
    "Google is not unfolding its Pixel Fold in India",
    "Elon Musk says he has found new Twitter CEO",
    "SC stays promotion of 68 judicial officers in Gujarat",
    "SC verdict on Maharashtra crisis: All eyes on Speaker Rahul Narwekar",
    "Explained | What is the SC ruling on Sena vs. Sena?",
    "CBSE Class 12 results declared",
    "2023-05-12T16:58:56+05:30\n-\nWorld\nTurkey elections | Why Europe is watching closely",
    "2023-05-12T16:57:53+05:30\n-\nTelangana\nCPI (Maoist) member surrenders before Karimnagar police",
    "2023-05-12T16:46:40+05:30\n-\nTennis\nFrench Open announces prize money increase for 2023",
    "Morality and majority: on the Supreme Court verdict on the political imbroglio in Maharashtra",
    "Supreme Court verdict is an indictment of how regime change in Maharashtra was achieved",
    "Descent into chaos: on the state of Pakistan’s politics",
    "Pakistan politicians are falling into Army’s trap by attacking one another",
    "GadgetsDell launches Alienware m16 and x14 R2 laptops in India",
    "Movies\n‘IB 71’ movie review: Vidyut Jammwal fails to charge up this ham-fisted exercise",
    "Movies\nSonakshi Sinha and Vijay Varma on their ‘jugalbandhi’ in ‘Dahaad’",
    "Movies\n‘Raavana Kottam’ movie review: Shanthnu shines in an otherwise middling affair",
    "Tamil NaduThe making of ‘Palani panchamirtham’",
    "Movies\n‘Siruvan Samuel’ movie review: Amateurish filmmaking sabotages a hearty tale",
    "Movies\n‘Poor Things’ trailer: Willem Dafoe resurrects Emma Stone in Yorgos Lanthimos’ next feature",
    "MoviesHabitat Film Festival: A pigeon, a cat and a pond full of memories",
    "The problem with India’s multi-alignment stand",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Is the monarchy still relevant in the 21st century?",
    "No answers even months after atrocity",
    "Marriage for all, even if for a few",
    "Pokhran-II: A moment of profound epiphany",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Baby’s got three parents: explaining Mitochondrial Donation Treatment",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Snap judgement: On India’s Project Cheetah",
    "Pawar play: On the churn in politics in Maharashtra",
    "Exit polls give edge to Congress in high-stakes Karnataka battle",
    "Delhi vs Centre row: SC holds Delhi government has control over administrative services",
    "L&T may hive-off electrolyser manufacturing unit, to offer IOCL a stake: Shankar Raman",
    "South Indian Bank shortlists candidates for MD post",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]