[
    "News Analysis | Mutiny exposes chinks in Putin’s armoured regime",
    "Do dead stars crash with the light of 500 million suns?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "PM Modi, President El-Sisi sign strategic partnership pact between India and Egypt",
    "Explained | The India-U.S. deal for 31 MQ-9B drones",
    "Pakistanis deploying latest Chinese supplied cannon on LoC: officials",
    "12 killed in head-on collision between two buses in Odisha",
    "‘What’s happening in India’, PM Modi asks BJP chief Nadda after returning from foreign visit",
    "Obama’s remarks about minority rights in India are surprising: Sitharaman",
    "After meeting Amit Shah, Manipur CM says he will reach out to Kukis",
    "Tenets of unity: On the Opposition meet in Patna",
    "Opposition parties have little more than rivalry with Bharatiya Janata Party in common",
    "A new regime: On the Emergency Use Authorisation regime in India and clinical trials",
    "India must keep an eye on adverse reactions from new drugs and vaccines",
    "India\n Open Market Sales Scheme | Now, Centre Vs State on foodgrains",
    "Cricket India’s 1983 World Cup victory...40 years on",
    "Karnataka\nIn Frames | Struggle for water",
    "Movies\nWatch | Mari Selvaraj on ‘Maamannan’ and the art of immersing the audience in his world",
    "Food\nKozhikode’s Paragon named 11th most legendary restaurant in the world, says Taste Atlas",
    "Open PageAccidents in war and life",
    "Books\nPride Month 2023 | Queering the narrative",
    "India\nGita Press | God’s own publisher",
    "ArtThe artist x artisan conundrum",
    "World\nMicron Technology | Rebalancing portfolio",
    "Strike a fine balance, have a just civil code",
    "Manipur — this is not a time for finger-pointing",
    "The united States of India",
    "On the draw — June 25, 2023",
    "The divided house of JACs in Telangana",
    "Outreach to diaspora and statesmanship",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Monsoon covers Delhi, Mumbai together",
    "12 cadres of banned Manipur extremist group released after mob stops Army",
    "Russia says Wagner Group’s leader will move to Belarus after his rebellious march challenged Putin",
    "All-party meeting | President’s Rule is not an option in Manipur: Amit Shah",
    "Bridging the gap: On India and Gender Gap Report",
    "When diseases attack in deadly groups",
    "Shell India launches new start-up programme",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Hurdles star McLaughlin lethal in 400m flat, Lyles shines again in NYC",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]