[
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "Explained | Why does India not have a law to recall bad drugs from the market?",
    "DGCA orders Go First to stop selling air tickets with immediate effect",
    "Indian Air Force MiG-21 crashes in Rajasthan; three civilians killed, pilot safe",
    "Woman from Hyderabad among eight killed in Texas shooting",
    "Excise scam: Delhi Court extends Manish Sisodia's judicial custody till May 23",
    "Supreme Court calls Manipur crisis ‘humanitarian problem’",
    "More than a story: on the film, The Kerala Story, and the demand that it be banned",
    "False narratives and propaganda should be exposed and countered, but not through a ban",
    "New king, new challenges: the road ahead for King Charles III",
    "Charles III must embrace modern values while carrying on with royal traditions",
    "Tamil NaduOrphaned tribal girl fights odds for higher education",
    "Other Sports\nDaily Quiz | On chess grandmasters",
    "Karnataka Elections\nOldest legislator, at 92, is confident of support from young voters",
    "Tamil Nadu\nT.N. Class 12 results | Daughter of daily-wage labourer in Dindigul scores 600/600",
    "IndiaTalking Politics with Nistula Hebbar| What are the root causes behind violence in Manipur?",
    "Hyderabad\nFather-daughter duo appear for NEET-UG at separate exam centres in Khammam",
    "Technology\nGoogle to leverage AI features for more “snackable” and “personal” search experience",
    "ChennaiWhen time stands still",
    "Movies\nRajinikanth’s first look as Moideen Bhai in ‘Laal Salaam’ revealed",
    "Will the greenback still be green?",
    "Improve technology to detect IEDs",
    "A position paper, China’s image, and what it means",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Rahul Gandhi takes BMTC bus in Bengaluru, tells commuters about Congress promises to women",
    "NEET 2023 on May 7: What students can take to exam centre and what they can’t",
    "No curtailment of any democratic value system in India: Vice-President Dhankhar",
    "Adani probe: SEBI move is disappointing",
    "Stocks that will see action on May 8, 2023",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after RR vs SRH match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]