[
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "Caste-based survey | Patna High Court rejects Bihar plea for early hearing",
    "TN CM Stalin drops Nasar from Cabinet; T.R.B. Rajaa to be sworn-in Minister on May 11",
    "Polling day dawns in Karnataka after pitched campaign by all parties",
    "No end to the humiliations of frisking for NEET aspirants",
    "Tagore’s birth anniversary celebration overshadowed by protests at Santiniketan",
    "SC says India is ranked 161 in press freedom; govt. says it depends on who does the ranking",
    "2023-05-09T22:45:58+05:30\n-\nWorld\nActivists block Russian ambassador at Soviet memorial in Warsaw",
    "2023-05-09T22:25:20+05:30\n-\nIndia\nNo end to humiliations of frisking for NEET aspirants",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "Tamil NaduPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Movies\n‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "Technology\nElon Musk warns that Twitter will purge unused accounts",
    "WorldSCO FM meet | India’s bilateral tensions vs multilateral ambitions",
    "Technology\nGoogle to pay New York Times $100 million over three years in a content deal: Report",
    "Salvaging the idea and reality of Manipur",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Not quite the Kerala story",
    "Buddhism, India’s soft power projection tool",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Govt. panel proposes ban on diesel 4-wheeler vehicles by 2027",
    "T.N. Class 12 results | Daughter of daily-wage labourer in Dindigul scores 600/600",
    "Tanur boat accident: Aster Healthcare to cover treatment cost of injured admitted at MIMS",
    "Stones pelted on Mysuru-Chennai Vande Bharat Express near Arakkonam",
    "Indian Air Force MiG-21 crashes in Rajasthan; three civilians killed, pilot safe",
    "Coal India’s stock remains attractive despite decline in Q4 profits",
    "Per capita GDP for Bangladesh higher than India till 2022",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]