[
    "Jallikattu — continuity of a tradition from Indus Valley to Keezhadi",
    "Death traps on National Highways in Andhra Pradesh",
    "Kannada cinema’s content crisis",
    "Systematic incitement plan",
    "Car crashes into London’s Downing Street gates, one arrested: Police",
    "Foodgrains, oilseed harvests will break records, says Centre",
    "Shah to visit Manipur soon to hold talks to restore peace",
    "All-in-one policy plan to spread insurance in India",
    "China constructing model villages opposite the LAC, say sources",
    "Sengol | Evidence thin on govt’s claims about the sceptre",
    "Mayawati slams Opposition parties for skipping inauguration of new Parliament",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Science\nISRO chief hails role of Sanskrit in India becoming knowledge society since Vedic times",
    "PodcastShould States revert to the Old Pension Scheme? | The Hindu Parley Podcast",
    "Athletics\nFor Neeraj Chopra, breaching the 90m is a target, not an obsession",
    "Tamil Nadu\nWhen Roman merchants and soldiers came to Madurai to trade in pepper",
    "Science\nSci-Five | The Hindu Science quiz: On migrating birds",
    "MoviesDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "An ordinance, its constitutionality, and scrutiny",
    "Understanding history is inevitable",
    "Should States revert to the Old Pension Scheme?",
    "The fundamental value of the rupee",
    "Economics that looks at lower half of the pyramid",
    "Industrial investments: The Kerala story",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ties that bind: On India-Australia ties and the Modi visit",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Colombia-Panama border hit by 6.6-magnitude earthquake",
    "The Sengol — A historic sceptre with a deep Tamil Nadu connection",
    "Dairy war: Now, Tamil Nadu wants Amul to stop tapping Aavin milkshed area",
    "The Indian ease with translation and multilingualism",
    "Future of HEC hangs in the balance as salaries remain unpaid for over a year",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]