[
    "The View from India | The significance of Blinken’s China visit",
    "A change of name for votes",
    "A rising India, in waltz dance steps with the U.S.",
    "Manipur violence | SC refuses urgent hearing on plea seeking Army protection for Kuki tribals",
    "Explained | Decoding the expert committee report on Adani",
    "Chinese e-commerce giant Alibaba announces new CEO and Chairman in major reshuffle",
    "Senthilbalaji to undergo surgery on June 21, says T.N. Health Minister Ma. Subramanian",
    "Assam floods | 31,000 people affected in 10 districts",
    "PM Modi leaves for his first state visit to U.S.",
    "Grassroots peace: on the local body elections in West Bengal",
    "Free and fair elections to local bodies are not possible without peace",
    "Safety first: on Indian pharma products and drug safety",
    "India’s regulators must ensure quality and safety of drugs",
    "Environment\nHumans’ groundwater extraction has affected the earth’s rotation: study",
    "IndiaIndiGo announces 500 Airbus narrowbody aircraft order",
    "Authors\nAuthor Salman Rushdie awarded prestigious German prize for his literary work and resolve",
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Tamil Nadu\nFrom Kanniyakumari to California: Puppet artiste to perform in the U.S.",
    "Tamil NaduVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Gadgets\nViewSonic X2000 Projector Review | Upgrade only if you want a sleeker option",
    "Technology\nIndians prefer conversational AI in audio products: Report",
    "Tamil Nadu ‘Tamil Nadu’ | On the wrong side of history and law: a fraud exposed",
    "Movies\nNoted cinematographer Navroze Contractor killed in a bike accident",
    "Emerging challenges to the Dravidian model",
    "Refugees as assets to their new countries",
    "T.N. Minister Senthilbalaji arrest | A case of propriety versus politics",
    "Can the new Diet and Biomarker Survey trace the roots of India’s anaemia problem?",
    "Explained | Are phonons, particles of sound, quantum too?",
    "Get less oxygen, live longer? It’s true in ageing mice",
    "Explained | If Betelgeuse goes supernova, what would it look like?",
    "Explained | How do Telegram bots function?",
    "Featured‘The future is queer and as diverse as India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IndiGo announces 500 Airbus narrowbody plane order",
    "Wanted Khalistan Tiger Force chief Hardeep Singh Nijjar gunned down in Canadian city Surrey",
    "Heavy overnight rains lash many parts of Chennai and neighbouring districts",
    "Massacre of innocents: On the attack on a school on the Uganda-Congo border",
    "Direct tax collection in April 1-June 17 rises 12.7%",
    "Stocks that will see action today: June 19, 2023",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]