[
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "IT Ministry to examine claim of WhatsApp accessing mic in background",
    "NCLT grants GoFirst’s insolvency plea",
    "No end to the humiliations of frisking for NEET aspirants",
    "Karnataka Assembly Elections live updates | Voter turnout of 65.69% recorded by 5 p.m.",
    "President Biden to host PM Modi for official state visit to U.S. on June 22: White House",
    "The Kerala Story ban | SC agrees to hear filmmaker’s plea against West Bengal ban on May 12",
    "Imran Khan produced before special court; anti-corruption body seeks 14-day physical remand",
    "2023-05-10T17:56:45+05:30\n-\nWorld\nRussia ends visa regime for Georgia, restores direct flights",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "ChennaiAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "World\nDaily Quiz | On the rulers of Great Britain",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "TechnologyElon Musk announces Twitter encrypted direct messages; voice and video chat coming soon",
    "Movies\n‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "TelanganaFace mask with sensor to check for illness developed by BITS-Pilani Hyderabad researchers",
    "Salvaging the idea and reality of Manipur",
    "Upsetting the apple cart in Himachal",
    "Not quite the Kerala story",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Former AGM of Punjab National Bank, 3 others get five-year jail term for bank fraud",
    "How to download voter ID card online?",
    "Paytm Payments Bank rolls out new features on Paytm UPI",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after MI vs RCB match - Mumbai third with sixth win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]