[
    "ISRO’s Chandrayaan 3: When did it start and when will it end?",
    "Karnataka BJP | In Opposition without a leader",
    "Don’t waste the wastewater",
    "Women’s reproductive autonomy as the new catchword",
    "Give proof of security forces’ ‘complicity’, Manipur HC Bar Association urges people",
    "Foxconn withdraws from India's semiconductor JV with Vedanta",
    "West Bengal panchayat poll violence | Darkest hour just before dawn say Governor Ananda Bose",
    "Rain continues to pound North India, toll rises to 25",
    "Ahead of NATO summit, Biden engages in ‘tea diplomacy’ in U.K.",
    "Feedback on welfare schemes boosts Congress hopes in Rajasthan",
    "2023-07-11T07:26:48+05:30\n-\nAndhra Pradesh\nA.P.’s Shreeja dairy turns ten years old",
    "Second moonshot: on the Chandrayaan-3 mission on July 14",
    "Chandrayaan 3 speaks to the moon’s growing importance in scientific and political milieus",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Grassroots politics is now a high-stakes game of violence in West Bengal",
    "Technology\nTwitter rival Threads signs up 100 million users in five days",
    "Science\nDaily Quiz | On lunar missions",
    "Environment\nRibbon dance in the heart of Bengaluru",
    "GadgetsOppo Reno10 Pro+ 5G and Reno10 Pro 5G launched in India",
    "World\nSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "Environment\nIn Varanasi, turtles help clean the Ganga",
    "TechnologyExplained | What should you know about Meta’s social media app Threads?",
    "Tamil Nadu\n‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "AI’s disruptive economic impact, an India check",
    "In Opposition without a leader",
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "Consumers can heave sigh of relief as Bescom announces 25-day billing cycle for June in Bengaluru",
    "U.S. sends its top human rights official to Delhi",
    "16 killed as heavy rain triggers landslips, floods in north India",
    "Army officers say Army faces challenges in Manipur without AFSPA",
    "Decoupling possible across and within markets: Allianz’s Mohamed El-Erian",
    "IDFC-IDFC First Bank merger: Did the bank get the short end of the stick?",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]