[
    "Rain toll points to man-made disaster in Himachal Pradesh",
    "The strange story of how Anas lost his Asian Championships berth",
    "The View from India | Why the U.S. is sending cluster munitions to Ukraine",
    "Wimbledon 2023: Russian teenager Mirra Andreeva takes the tennis world by storm",
    "Trinamool is poised to sweep violence marred Bengal panchayat polls",
    "Electoral Bonds chief source of donations for political parties: Report",
    "Four more Vande Bharat routes to be launched this month amid low demand",
    "Tribe members should be part of supervisory teams: SC to Manipur",
    "Six Opposition members file dissent notes on Forest Conservation Bill",
    "Amit Shah holds ‘productive’ talks with U.S. envoy Eric Garcetti",
    "GST Council to impose 28% tax on online gaming firms",
    "2023-07-12T03:00:00+05:30\n-\nHyderabad\nConstable in Hyderabad ends life",
    "2023-07-12T02:40:00+05:30\n-\nTelangana\nManifesto has no significance in BRS, says Sharmila",
    "2023-07-12T02:25:00+05:30\n-\nTelangana\nGITAM hosts session on funding opportunities",
    "Green washing: On amendments and the Forest (Conservation) Amendment Bill, 2023",
    "Changes to conservation laws must be backed by scientific evidence",
    "In transition: On the Caribbean tour and mettle in the Indian cricket team",
    "Indian cricket has a chance to test its bench strength in the Caribbean",
    "EnvironmentOne more African cheetah, Tejas, dies in M.P.'s Kuno National Park",
    "Gadgets\nNothing launches Phone 2 with Snapdragon 8+ Gen 1 SoC",
    "Personal Finance\nRBI Floating Rate Bonds offer 8.05 per cent interest: Should you invest?",
    "Business\nHyundai introduces entry-level SUV Exter",
    "Life & StyleHow urban India is reclaiming spaces for its communities",
    "Technology\nTwitter rival Threads signs up 100 million users in five days",
    "Movies\nDhoni on producing Tamil film ‘LGM’: ‘I have a strong connection with Chennai’",
    "Demographic transition and change in women’s lives",
    "In Kerala, Congress is back to square one",
    "The unseemly politics of the Uniform Civil Code",
    "On the Draw — July 11, 2023",
    "Citizen action for clean politicians, cleaner politics",
    "Don’t waste the wastewater",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Readers Editor-Terms of Reference",
    "Bookstore & Special Publications",
    "Five Mexicans, Nepali pilot killed in helicopter crash near Mount Everest in Nepal",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "Delhi on high alert as Yamuna crosses danger mark, touches 206.24 metres",
    "Adani, GVK Power get clearance for port expansion in Queensland",
    "Focus on hydro power likely to benefit Patel Engineering",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "All you wanted to know about Instagram Threads (so far)",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]