[
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "Wrestlers accept WFI chief’s demand for a narco test under Supreme Court supervision",
    "Fresh violence in Manipur, abandoned houses torched",
    "'Vast majority' of Opposition parties to meet soon: Congress after Nitish meets Kharge",
    "No need to make a dash for ₹2,000 swaps, says RBI Governor Shaktikanta Das",
    "Shaktikanta Das says the last date is only meant to nudge people to return the notes soon",
    "PM Modi kickstarts Sydney visit, meets Australian CEOs",
    "AFSPA likely to be lifted completely from Assam by year end, says Himanta Biswa Sarma",
    "2023-05-23T08:17:07+05:30\n-\nIndia\nOTT ‘aggregators’ bloom as streaming space expands",
    "2023-05-23T07:32:00+05:30\n-\nIndia\nPM Modi kickstarts Sydney visit, meets Australian CEOs",
    "Solidarity for peace: on the Hiroshima meet of the G-7",
    "The G-7 must build a global consensus on the world’s challenges",
    "Slow withdrawal: on the RBI and the ₹2,000 note",
    "Without setting a deadline, the Reserve Bank of India could have withdrawn the notes gradually",
    "Movies\nActor Sarath Babu dies after a prolonged illness",
    "TechnologyIs OpenAI fit to flag its own product’s plagiarism?",
    "India\nData | Apathy of family and high costs hinder maternal healthcare",
    "Movies\n‘Jury Duty’ series review: All rise for television’s most sincere prank show",
    "World\nPasang Dawa summits Mt. Everest for record 27 times, ties with Kami",
    "Movies‘High Desert’ series review: Patricia Arquette anchors a chaotic dark comedy",
    "Technology\nHow to text someone on WhatsApp without saving their number on your device",
    "Personal FinanceSafe Travels! In more ways than one…",
    "Tamil Nadu\nTwo die after consuming liquor in Thanjavur, cyanide poisoning suspected",
    "It’s time to ensure safer skies",
    "Hijacking G-20’s civil society forum",
    "Controversies roil Telangana’s universities",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | What is the ‘Open Network for Digital Commerce’?",
    "Explained | Understanding a human pangenome map",
    "FeaturedFair play, fair pay: The Indian music industry and royalties Music Saumya KaliaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Capital quandary: On politics and Delhi’s administrative autonomy",
    "Judging jallikattu: On the Supreme Court verdict",
    "Under duress, BJP leader in Uttarakhand calls off daughter’s wedding with Muslim man",
    "Onset of southwest monsoon likely to be robust",
    "SBI’s u-turn: No slip, ID proof needed to swap ₹2,000 notes",
    "Gland Pharma: When it rains, it pours!",
    "CESC board to consider results today (May 22)",
    "Failed ideas of Jawaharlal Nehru",
    "Delhi University in the dock following suicide of ad hoc teacher",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]