[
    "How are Indian languages faring in the age of AI and language models?",
    "When Einstein thought he was wrong but Feynman convinced physicists otherwise",
    "The View from India | The reign of Erdogan continues",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Amit Shah appeals for 15-day peace in Manipur",
    "Go First now cancels all scheduled flights till June 4",
    "At least 10 Vaishno Devi pilgrims dead, 57 injured as bus falls down from bridge in Jammu",
    "Wrestlers defer plan to drop medals in the Ganga, serve five-day ultimatum to govt",
    "Farmer leader Naresh Tikait persuades the wrestlers to defer their protest move",
    "NCERT removes Khalistan reference from textbook",
    "Opposition parties together at national level, says Mamata",
    "2023-05-30T22:25:47+05:30\n-\nIndia\nIndia to host SCO summit virtually",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "CSK’s win over Titans showcased the best and the latest of IPL",
    "Science\nIndian scientists discover new exoplanet with mass 13 times that of Jupiter",
    "WorldElizabeth Holmes enters Texas prison to begin 11-year sentence",
    "Technology\nIndians face challenges prioritising cleaning practices: Dyson",
    "Kerala\nWatch | What was the Vaikom Satyagraha all about?",
    "MoviesMartin Scorsese meets Pope Francis, announces film about Jesus",
    "Movies\nMichelle Lee: John Wick wouldn’t fight the way he did without the stunt team",
    "Movies\nComing to Netflix: ‘Scoop’, ‘Never Have I Ever Season 4’, ‘Arnold’, ‘Bloodhounds’, and more",
    "ChennaiVummidi Bangaru Chetty family that made Sengol in 1947 felicitated at PM Modi’s residence",
    "Movies\n‘Alice, Darling’ movie review: Anna Kendrick is riveting in this tale of emotional abuse",
    "The indelible imprint of the Fifth Estate, in Karnataka",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "From Master of the Roster to Master of all Judges?",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "The BJP outreach to Saivites",
    "The Erdogan victory, a triumph for Ottoman glory",
    "Explained | The SC ruling on jallikattu",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Adani Transmission Q4 net profit jumps 85% to ₹439.60 crore",
    "Symbols and substance: on the inauguration of the new Parliament building and beyond",
    "Muslims lag behind Scheduled Castes and Scheduled Tribes in higher education",
    "Alarming turn: On the situation in Manipur",
    "Demerging hotels business is back on ITC’s table",
    "RBI sure of India’s growth, but stresses on reforms sustaining",
    "Advani called it ‘the Congressisation of the BJP’",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]