[
    "View from India | Spotlight Indo-US",
    "Same-sex marriage: Morality vs equality",
    "It’s Mission Asian Cup for the Blue Tigers as coach Stimac prepares a blueprint for the road ahead",
    "E-education platforms, their Generative AI chapter",
    "CoWIN breach didn’t have access to entire portal nor the backend database, says report",
    "Lower house of Japan’s Parliament passes bill to promote LGBTQ+ awareness",
    "19 injured in steam leak at Tata Steel’s Meramandali power plant in Odisha",
    "No update on investigation, no FIR yet into CoWIN leak from CERT-in",
    "Health Ministry reviews cyclone ‘Biparjoy’ preparedness",
    "Clean chit for former Assam CM Prafulla Kumar Mahanta in ‘secret killings’ case",
    "2023-06-13T21:24:23+05:30\n-\nEconomy\nMRF stock price surpasses ₹1 lakh mark intraday",
    "2023-06-13T21:14:39+05:30\n-\nIndustry\nIndia Mortgage chalks out new credit score",
    "The second-best: on India and the World Test Championship final",
    "India, after a hectic IPL, seemed unprepared for the WTC final",
    "Fall from grace: on the political trajectory of Boris Johnson",
    "The refusal of Boris Johnson to go quietly can damage the Tories",
    "EntertainmentSJ Suryah: ‘I still live the life of a middle-class teacher’s son‘",
    "India\nCongress leader Rahul Gandhi undertakes another truck ride, this time in U.S.",
    "Movies\nGolden Globe Awards sold, Hollywood Foreign Press group shut down",
    "Movies‘Maalai Nera Malipoo’ movie review: A slow-burn, yet stirring tale of a sex worker",
    "Art\nThe many smells of Bengaluru captured in a book",
    "Tamil NaduTiruvarur village gets a ‘Taj Mahal’ tomb as tribute to a beloved mother",
    "Art\nHow Clyde D’Mello captures the concept of time through his art",
    "Wrestlers’ protest and the shrinking space for dissent",
    "NCDs plague Keralites’ health",
    "The Telangana BJP is in a bind",
    "Governors cannot indefinitely hold back Bills",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren Singh’s presence",
    "India threatened to block Twitter, raid employees: former CEO Jack Dorsey",
    "Retail inflation cools again; down to 4.25% in May",
    "Thrissur youth wins gold at World Pro Wushu Sanda fight",
    "Specific insurance plans for surrogate mothers on the anvil",
    "Stocks to watch on June 13, 2023",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "India vs West Indies 2023 schedule announced: Full list of matches, dates, venues, fixtures",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]