[
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Explained | What is the electronic interlocking system in railways?",
    "In Jerusalem, gay pride is conservative too",
    "Tensions escalate in Uttarakhand after alleged abduction bid of a minor",
    "Centre invites protesting wrestlers for talks",
    "U.S. NSA Jake Sullivan to visit New Delhi next week ahead of PM Modi’s state visit",
    "Speculation rife about Sachin Pilot floating new party",
    "Odisha train accident | CBI gathers evidence; 83 bodies yet to be claimed",
    "2023-06-07T02:02:04+05:30\n-\nIndia\nCentre invites protesting wrestlers for talks",
    "2023-06-07T01:55:56+05:30\n-\nMumbai\nCBI arrests two former Deputy Commissioners of Customs",
    "Useful first step: on probing the ethnic violence in Manipur",
    "Issues behind violence in Manipur are knotty but truth-telling should help",
    "A climax at the summit: on the World Test Championship in London today",
    "India will have to hold its nerve in the World Test Championship final to come out on top",
    "India\nThe falling bridges of Bihar: ten bridges collapsed in last three years",
    "India\nWorld lived through a pandemic and India played a critical role: WHO scientist",
    "India\nOnly 66% districts in country free of manual scavenging: Social Justice Ministry report",
    "Internet\nHere is how you can find out if someone has blocked you on WhatsApp",
    "India\nPM Modi’s first school to be developed as an inspirational centre",
    "India\nNirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "GadgetsSamsung Galaxy F54 5G Review | Alternative to the Galaxy A series",
    "The Indian polity, a democratic diagnosis",
    "Seeing India’s energy transition through its States",
    "Denying States their own cultures",
    "A global order as technology’s much needed pole star",
    "South Asia’s climate migration is a ticking bomb",
    "Explained | Why is there trouble in Kosovo again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Under-construction bridge collapses in Bihar’s Bhagalpur; probe ordered",
    "Power bills to be dearer by ₹2.89 per unit for Bescom consumers in June",
    "UPI transaction limit set by Indian banks. See details here",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]