[
    "Data | The sharp hill-valley divide that is Manipur’s burden",
    "Uzbekistan, which once backed anti-Taliban forces, is now betting on engagement",
    "‘The man who swore to live in an ordinary house is now living in a ₹171-crore bungalow’",
    "The uprising of 1857, and Meerut’s role in the first war for India’s Independence",
    "Pak’s SC orders release of former PM Imran Khan",
    "Congress demands President’s Rule in Manipur",
    "Beyond Manipur violence: drugs and demographics in hill districts",
    "SC verdict on Maharashtra crisis: All eyes on Speaker Rahul Narwekar",
    "Speaker has no other option except to disqualify MLAs from Shinde faction, say experts",
    "SC verdicts in Delhi L-G, Maharashtra political row cases seminal and path-breaking: Congress",
    "Sena vs Sena | A series of signs that Supreme Court viewed Shinde’s route to power with skepticism",
    "2023-05-11T22:37:44+05:30\n-\nHealth\nWHO declares end to mpox public health emergency",
    "Morality and majority: on the Supreme Court verdict on the political imbroglio in Maharashtra",
    "Supreme Court verdict is an indictment of how regime change in Maharashtra was achieved",
    "Descent into chaos: on the state of Pakistan’s politics",
    "Pakistan politicians are falling into Army’s trap by attacking one another",
    "Health\nDo I still need to wear my mask?",
    "MoviesDeepika Padukone appears on cover of TIME magazine",
    "Movies\n‘Modern Love Chennai’: Trailer of Tamil anthology of love stories out",
    "Gadgets\nGoogle launches Pixel 7a with Tensor G2 chip",
    "Science\nSci-Five | The Hindu Science Quiz: On submarine volcanoes",
    "Movies\nGucci names Alia Bhatt as first global brand ambassador from India",
    "Movies\n‘Good Night’ movie review: A spectacular Manikandan in a lovely slice-of-life drama",
    "IndiaGoogle historical satellite imagery disappears for India",
    "Karnataka Elections\nVote from Home: Missed opportunity for many and a choice not picked by others",
    "The problem with India’s multi-alignment stand",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Is the monarchy still relevant in the 21st century?",
    "Marriage for all, even if for a few",
    "Pokhran-II: A moment of profound epiphany",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Exit polls give edge to Congress in high-stakes Karnataka battle",
    "Delhi vs Centre row: SC holds Delhi government has control over administrative services",
    "Over 72% turnout in peaceful Karnataka Assembly polls",
    "Former AGM of Punjab National Bank, 3 others get five-year jail term for bank fraud",
    "A ground view of the Indian Space Policy 2023",
    "Dr Reddy’s Q4 net profit soars to ₹959 crore",
    "Hyundai to announce ₹15,000-cr plus investment programme in TN",
    "Exclusion of Darwin’s theory from Class 10 textbooks indicates attempt to rationalise caste system",
    "First books, then people: How a barbarous Nazi act resonates even today",
    "KKR vs RR Toss Updates, IPL 2023: Samson wins toss, Rajasthan to bowl first",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]