[
    "Karnataka polls | Striking a balance between castes and regions a daunting task for Congress",
    "Rajasthan’s move spells some hope for gig workers",
    "Explained | How methanol poisoning kills",
    "India deserve the money, but the ICC needs to work out a better system",
    "Australia cancels Quad meeting in Sydney after Biden postponement",
    "Amid ongoing turmoil in Pakistan, U.S. Ambassador to India stresses importance of stability",
    "Severe turbulence on Delhi-Sydney Air India flight; several passengers injured",
    "Karnataka CM race: Fake circular keeps officers busy for swearing-in ceremony",
    "Global warming now more likely to breach 1.5 degrees Celsius threshold by 2027, scientists warn",
    "Planned Army withdrawal from J&K shelved 'indefinitely'",
    "Tripping trade: on India and its trade stance",
    "India must not rely on a few large markets, but opt for integration with global value chains",
    "Weaker by the year: on the elections in Turkey and Recep Tayyip Erdoğan",
    "Erdogan may still be in the lead, but the run-off is humbling",
    "Business\nWatch | All you need to know about the GoFirst crisis",
    "TechnologyApple blocked 1.7 million apps, removed 428,000 developer accounts from the App Store",
    "Technology\nThe Indian publishing industry is gearing up for AI audiobooks",
    "Science\nExplained | Why is a viable dengue vaccine not yet available",
    "MoviesPriyanka Chopra, Anne Hathaway, Zendaya light up Bulgari event in Venice",
    "World\nNepal’s Sherpa guide regains title for most climbs of Mount Everest after 27th trip",
    "MoviesNew on Amazon Prime Video this week: ‘Modern Love Chennai’, ‘Bones and All’, and more",
    "The rising tide of dictatorship",
    "The Dalit outreach of the BRS",
    "The rebooting of the Congress",
    "Evaluating DNA report as evidence",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Two leaders from BJP, who were once close aides of Siddaramaiah, blame him for quitting Congress",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "Will meet CEOs of world’s leading companies next week: PM Modi",
    "Do not create an “atmosphere of fear”, Supreme Court tells ED",
    "Centre appoints Ravneet Kaur as CCI Chairperson",
    "Meet Ravneet Kaur, the new CCI Chairperson",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after LSG vs MI: Lucknow Super Giants third with seventh win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]