[
    "Kerala Spotlight | Higher education in low spirits",
    "Spreading Hindi for more than a century in a State opposed to its imposition",
    "Telangana Spotlight | The Green Metro Line blues",
    "Andhra Pradesh Spotlight | Defenders of the creek",
    "Extend deadline for higher pension, simplify application process, employers tell EPFO",
    "Infiltration bid foiled in J&K, four terrorists killed",
    "Corporate and diaspora leaders among guests at State Dinner hosted by Bidens for PM Modi",
    "2023-06-23T15:33:05+05:30\n-\nTelangana\nEatala dubs BRS dispensation as ‘repressive regime’",
    "2023-06-23T14:36:35+05:30\n-\nInternet\nApple ID to get Passkey support with iOS17 and macOS Sonoma",
    "Unedifying row: On panchayat polls in West Bengal and security",
    "Shadow of poll violence justifies court orders for using central forces in West Bengal",
    "Spiralling violence: On the West Bank",
    "Without a freeze on Israeli settlements, violence in West Bank will continue",
    "Internet\nApple ID to get Passkey support with iOS17 and macOS Sonoma",
    "India\nDelhi Spotlight | Small hill towns, big plain aspirations",
    "Bengaluru\nDid mission decongestion in Bengaluru work?",
    "Podcast\nWill a shorter medical course solve rural doctor shortages? | The Hindu Parley Podcast",
    "GadgetsRealme 11 Pro+ 5G Review | A worthy mid-ranger facing tough competition in the segment",
    "DataData | UPI payments: relief for users, a headache for banks",
    "Hockey\nThe Mayor Radhakrishnan Stadium and its enduring love with hockey",
    "An organised counter to organised hate",
    "Can a shorter medical course solve rural doctor shortages?",
    "The challenges of reporting on an ethnic conflict",
    "A doorway to an entrepreneurial university",
    "Rethink the retention of sedition",
    "Explained | What is lab-grown meat and what did the U.S. recently approve?",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "FeaturedPride Month | Of allies like Ujjal Dosanjh SocietySandip RoyREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Barack Obama says India may ‘pull apart’ over minority rights",
    "First look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "Officials say missing Titan submersible imploded sometime this week, all 5 onboard dead",
    "Govt. likely to pay assured pensions for its employees, say officials",
    "US-India ties will be most defining of 21st century: Joe Biden",
    "PM Modi’s gift to US First Lady: ‘Made in India’ 7.5 carat Green Diamond",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]