[
    "‘We can’t control the sky’, says Zelenskyy as he asks for fighter jets on U.K. visit",
    "The View from India | Chaos in Pakistan",
    "Delving into the verdict on the Shiv Sena issue",
    "Explained | The Indian law on sexual harassment in the workplace",
    "Kerala shudders at yet another brutal lynching of migrant labourer",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Meta introduces WhatsApp Chat Lock feature",
    "Karnataka govt. formation | KPCC chief D.K. Shivakumar arrives in Delhi",
    "Mr. Shivakumar will hold talks with the party high command on May 16",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "Changes in recruitment system ended corruption, nepotism, says PM Modi",
    "2023-05-16T13:57:48+05:30\n-\nKochi\nMan assualts doctor in Kerala government hospital, arrested",
    "2023-05-16T13:47:32+05:30\n-\nBusiness\nElgi Sauer expands operations in Coimbatore",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "Science\nThe problem with improved cooking stoves",
    "TechnologyAmazon announces new ‘The Lord of the Rings’ multiplayer game",
    "Andhra Pradesh\nTTD announces specific dates for release of darshan tickets at Tirumala temple",
    "Technology\nHow do AI text-to-image generators work?",
    "Karnataka\n‘Gauri’ bags ‘Best Long Documentary Award’ at South Asian Film Festival of Montreal",
    "Karnataka\nWhen a conductor’s past experience in a hospital labour ward came in handy on a bus",
    "Telangana\n45.9° C at Kondapur in Mancherial as day temperatures hit the sky",
    "TravelFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "Delhi\nBihar politicians lap up Dhirendra Shastri, the new Baba in town",
    "Evaluating DNA report as evidence",
    "A Cabinet reshuffle in Tamil Nadu",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "Fatigue in long Covid patients found to impact their nervous system",
    "Statistical succour: On the Consumer Price Index",
    "New Congress Legislature Party asks Mallikarjun Kharge to pick next Karnataka Chief Minister",
    "SEBI proposes tighter norms for delisting debt securities",
    "Kotak vs Watsa: The battle for acquiring IDBI Bank intensifies",
    "Failed ideas of Jawaharlal Nehru",
    "Karnataka result shows India’s natural position is in the centre",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]