[
    "Two judgments and the principle of accountability",
    "Kerala: an exemplary story in palliative care",
    "‘Three capitals’ in Andhra Pradesh",
    "Explained | How methanol poisoning kills",
    "Hypertension to be tackled at primary health centres",
    "Tamil Nadu illicit liquor deaths | Murder case registered; Governor seeks report",
    "Security forces step up vigil in J&K ahead of G20 meet",
    "U.S. court allows extradition of 26/11 attack accused Tahawwur Rana to India",
    "Sameer Wankhede gets protection from arrest for five days",
    "Centre writes to States to curb trend of unnecessary hysterectomies",
    "2023-05-18T09:34:16+05:30\n-\nIndia\nRSS-backed Muslim body plans outreach programme",
    "2023-05-18T06:53:00+05:30\n-\nFood\nBrazil robusta coffee harvesting pace picking up",
    "Timely caution: On the Supreme Court’s exhortation to the Enforcement Directorate",
    "The top court has rightly cautioned probe agencies against crossing limits",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "Introspection will do India good in areas where it faces international criticism",
    "Sport\nWatch | DJ Zen plays Padayappa for MS Dhoni",
    "BusinessWhy is the rising cost of coal-fired power plants good news for India?",
    "Business\nWatch | All you need to know about the GoFirst crisis",
    "Technology\nApple blocked 1.7 million apps, removed 428,000 developer accounts from the App Store",
    "TechnologyThe Indian publishing industry is gearing up for AI audiobooks",
    "Science\nExplained | Why is a viable dengue vaccine not yet available?",
    "Movies\nPriyanka Chopra, Anne Hathaway, Zendaya light up Bulgari event in Venice",
    "WorldNepal’s Sherpa guide regains title for most climbs of Mount Everest after 27th trip",
    "A desperate Israeli leader plays the security card",
    "The Dalit outreach of the BRS",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Tussle between DKS and Siddaramaiah crosses party lines and takes caste colour within BJP ranks",
    "Congress hits back at BJP for questioning delay in deciding Karnataka CM",
    "Weaker by the year: on the elections in Turkey and Recep Tayyip Erdoğan",
    "Manoj Soni to take oath as UPSC chairman on Tuesday",
    "MEA rejects U.S. State Department report citing deteriorating religious freedom in India",
    "Sensex, Nifty open lower on weak cues amid profit booking",
    "LIC trades at 40% discount to issue price a year after listing",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after PBKS vs DC: Delhi Capitals dents Punjab Kings’ playoff chances",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]