[
    "Why the Indian museum makeover is important",
    "Li Shangfu | The General’s warning",
    "News in Frames | Maximum damage",
    "AAP ‘Maha Rally’ | Delhi CM Arvind Kejriwal says will oppose Centre’s ordinance and save democracy",
    "Ex-Scottish First Minister Nicola Sturgeon released without charge after funding probe arrest",
    "Supriya Sule asks critics to assess performance before questioning her on nepotism",
    "French Open final | Novak Djokovic wins his 23rd Grand Slam title by beating Casper Ruud",
    "Kuki members to boycott Centre’s peace committee over Manipur CM Biren’s presence",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "2023-06-12T00:00:34+05:30\n-\nIndia\nKerala-cadre IPS officer Nitin Agarwal appointed BSF DG",
    "2023-06-11T22:46:17+05:30\n-\nIndia\nFirst national conference of tribal writers held in J&K",
    "2023-06-11T22:41:29+05:30\n-\nOther States\nTMC leader accuses BJP of desecrating holy Matua land",
    "Telltale signs: On Maharashtra and a pattern of sustained polarisation",
    "Low-intensity communal violence in Maharashtra could take a dangerous turn",
    "Miles to go: On the state of the Indian economy",
    "The economy is better poised but still needs deft steering and mindful reforms",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "World\nUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Football\nManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "WorldNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil NaduBuckingham Canal | A waterway once is sewage-carrier now",
    "Science\nIIT-Madras generates hydrogen from seawater using solar energy",
    "Manipur, a rude reminder of northeast tensions",
    "The Telangana BJP is in a bind",
    "Governors cannot indefinitely hold back Bills",
    "The importance of small talk",
    "Amplify the subject of adolescent girl nutrition",
    "A pragmatic approach, for better India-Nepal ties",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Stop, look, proceed: Railway order for trains coming after signal repair",
    "Lokayukta files suo motu case over water crisis in Whitefield",
    "Pakistan's PM orders authorities to take emergency measures for Cyclone Biparjoy",
    "Varun Tej, Lavanya Tripathi engaged",
    "Moody's sees India's GDP expanding 6-6.3% in Q1, flags fiscal slippage risks",
    "Amara Raja Batteries: Why it is a good time to buy this stock",
    "New forest laws and ‘development’ push: A prelude to a ‘land grab’ in India’s north-east?",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]