[
    "World\nExplained | Why is China limiting exports of raw materials?",
    "Science\nExplained | What is Microsoft’s planned “quantum supercomputer“?",
    "ScienceModerate alcohol consumption has no health benefits",
    "Food\nWill lab-grown meat find takers in India?",
    "Amarnath yatra resumes from Jammu and Kashmir's Panjtarni, Sheshnag base camps after three days",
    "Sri Lankan President Wickremesinghe to visit India on July 21",
    "2023-07-09T15:03:55+05:30\n-\nWorld\nSri Lankan President Wickremesinghe to visit India on July 21",
    "2023-07-09T13:52:04+05:30\n-\nAndhra Pradesh\nWoman, two children, suffer burns in acid attack",
    "Technology\nThreads | A new digital town square",
    "Agri BusinessTomato-nomics —  Behind the kitchen staple’s soaring prices",
    "Photos\nIn Frames | Spiritual sojourn",
    "Society\nNikita Sonavane: justice for all",
    "Books\nOnce upon a time in Goa | Heta Pandit’s new book ‘Stories from Goan Houses’",
    "IndiaCluster munitions | Civilian killer",
    "Kerala\nSarpa app helps bring down snakebite deaths in Kerala",
    "ScienceSangam-age stud, bead unearthed in Tamil Nadu",
    "World\nExplained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is Microsoft’s planned “quantum supercomputer“?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Explained | Study shows link between domestic violence cases and climate crisis in India",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "Centre holds back-door talks with Kuki groups in New Delhi",
    "HDFC Bank-HDFC merger: What should you do with the stock of HDFC Bank now",
    "Govt asks Google, FB, Microsoft, others to remove Blue Whale links",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]