[
    "Data | The effects of more than two decades of Erdogan’s rule",
    "When bicycles were a luxury and avenue trees the norm in Bengaluru",
    "The Indian polity, a democratic diagnosis",
    "A global order as technology’s much needed pole star",
    "Manipur group to Amit Shah: Kuki outfits intensifying attacks, cannot surrender arms",
    "Centre gives clearance to Delhi Education Minister Atishi for U.K. visit",
    "Cyclone Biparjoy rapidly intensifies into severe cyclonic storm",
    "Government to hike minimum support price of agricultural products for Kharif season",
    "The Union Cabinet approved the highest increase in moong MSP at ₹8,558/quintal.",
    "CBI raids multiple locations in Bengal linked with job scam in civic bodies",
    "Top wrestlers agree to suspend protest till June 15 after five-hour meet with Sports Minister",
    "2023-06-07T18:30:43+05:30\n-\nIndia\nIndia and U.S. launch strategic trade dialogue",
    "Useful first step: on probing the ethnic violence in Manipur",
    "Issues behind violence in Manipur are knotty but truth-telling should help",
    "A climax at the summit: on the World Test Championship in London today",
    "India will have to hold its nerve in the World Test Championship final to come out on top",
    "Technology\nGoogle Pay enables Aadhaar-based authentication for UPI activation",
    "MoviesInterviewing Spider-Man: Tom Holland on his great powers, and greater responsibilities",
    "Data\nData | Most soldiers killed in action during UN missions were Indians",
    "Movies\nNew on Amazon Prime Video this week: ‘Creed III’, ‘The Lake’ Season 2, ‘Nanny’, and more",
    "Movies\n‘Adipurush’ final trailer: Prabhas, Saif Ali Khan do battle in CG spectacle",
    "IndustryIvan Menezes, India-born CEO of Diageo, passes away",
    "Movies\nPark Chan-wook sets up period thriller 'War and Revolt', his first project at Netflix",
    "Other StatesOdisha train accident | Man finds son alive in a morgue ‘under a pile of bodies’",
    "Kochi\nWhen FaceTime, WhatsApp came in handy for Kerala High Court in a land dispute case",
    "Seeing India’s energy transition through its States",
    "On the Draw — June 07, 2023",
    "South Asia’s climate migration is a ticking bomb",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Explained | What is the Kosovo-Serbia conflict all about? Why have tensions flared again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Nirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Eye on oil: on oil prices and India",
    "UPI transaction limit set by Indian banks. See details here",
    "Ambuja Cements, ACC withdraw membership from CMA",
    "NCERT drops periodic table, Pythagorean theorem, and evolution from textbooks",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]