[
    "Other Sports\nBadminton | India's Rankireddy and Shetty triumph in Indonesia Open, create history",
    "India\nEmergency dark era in country's history: PM Modi",
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "RSS appeals for peace in Manipur, says no place for violence and hatred in democratic setup",
    "Mizoram bears burden of drug trade after unrest in Manipur",
    "Contraband worth ₹78.19 crore has been seized in Mizoram since May 3",
    "Gandhi Peace Prize 2021 to be conferred on Gita Press",
    "Wrestlers protest | Sakshi Malik, Babita Phogat engage in a war of words",
    "2023-06-18T18:06:46+05:30\n-\nOther States\nHeatwave in U.P. and Bihar kill nearly 100",
    "2023-06-18T18:02:05+05:30\n-\nIndia\nGandhi Peace Prize 2021 to be conferred on Gita Press",
    "2023-06-18T17:59:20+05:30\n-\nOther States\nManipur women hit the streets for peace",
    "Society\nIndia | How queer are our public spaces?",
    "EnvironmentHumans’ groundwater extraction has affected the earth’s rotation: study",
    "Photos\nIn Frames | Sacred Spaces",
    "Tamil Nadu\nTeacher takes students to school in autorickshaw to prevent dropouts near Vellore",
    "ScienceGoogle Doodle celebrates Indian biochemist Kamala Sohonie’s 112th birthday",
    "Tamil Nadu\nV. Senthilbalaji | From villain to anti-hero",
    "TechnologyExplained | What is the India, U.S. initiative on future tech?",
    "Science\nChandrayaan-3 | ISRO’s Space Physics Laboratory gears up for big moment",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Explained | How can India tackle its diabetes burden?",
    "Explained | What is the India, U.S. initiative on future tech?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Featured‘The future is as queer and as diverse\nas India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why the traffic is no longer an issue in Bengaluru",
    "CBI books senior BSNL officials for graft; searches 25 locations",
    "Adipurush kicks off political storm; Chhattisgarh ready to ban film on public demand",
    "Guyana’s oil discovery, a game changer",
    "LIC announces relaxations for victims of cyclone Biparjoy",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "ODI World Cup Qualifiers 2023: Format, rules, squads, schedule",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]