[
    "Manipur unrest | The embers of Meitei-Kuki conflict still glow",
    "Under-reading and over-reading the Karnataka vote",
    "Ukraine’s recent round of weapons acquisition",
    "Tracking SDG progress the Bhopal way",
    "RBI to pull out ₹2,000 notes from active circulation",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "Only ambition is a united Opposition: Sharad Pawar",
    "Many top Opposition leaders to share the stage during Siddaramaiah’s swearing-in ceremony",
    "PM Modi holds meeting with Japanese counterpart Kishida",
    "NIA raids underway at four places in J&K's Pulwama",
    "How Gujarat is working to become India’s green hydrogen hub",
    "2023-05-20T11:44:22+05:30\n-\nBusiness\nIIFCL looking to launch IPO",
    "2023-05-20T11:38:20+05:30\n-\nOther States\nPakistani intruder shot dead along LoC in J-K's Poonch",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "The shifting of Kiren Rijiju from Law Ministry should end conflict with judiciary",
    "Among the elite: On India at the G-7 summit",
    "India’s presidency of G-20 gives it additional heft at G-7 summit",
    "Tamil Nadu\nTN boy braves disability, scores 437 in class X exam",
    "TechnologyThe accessibility gap on streaming in India",
    "World\nPM Modi’s Indo-Pacific tour | Will Biden’s pullout be India’s gain?",
    "Movies\n‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "Movies\nCannes 2023: Aishwarya Rai Bachchan stuns in silver Sophie Couture gown",
    "GadgetsXiaomi launches Redmi A2 and A2 Plus smartphones into entry segment",
    "Gadgets\nOptoma GT2160HDR 4K projector review | Does what it claims, and nothing more",
    "Hyderabad\nEight-year-old boy mauled to death by stray dogs in Telangana’s Kazipet",
    "Explained | What are RBI regulations on green deposits?",
    "Money is about more than just survival",
    "Can an integrated system of medicine work?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Narayana Netralaya chairman Dr. Bhujang Shetty passes away",
    "Centre reverses Supreme Court order, gives Delhi Lieutenant Governor final say on bureaucrats",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "Zee-Sony merger to close in first half of FY24: Kenichiro Yoshida",
    "Pichai sells Chennai home where Sundar grew up",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023 Points Table update after PBKS vs RR match: Rajasthan moves to fifth, keeps hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]