[
    "The View from India | Bilateral troubles at a multilateral forum",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "India, Bangladesh share deep ties; no one can undermine our bilateral relations, says Amit Shah",
    "PFI conspiracy case | NIA raids six places in Tamil Nadu; 2 people detained",
    "SC to hear plea against Kerala High Court order on ‘The Kerala Story’ release on May 15",
    "Former Pakistan PM Imran Khan arrested during court appearance: police",
    "Arab trains to carry Indian goods to Israeli port, says Foreign Minister Eli Cohen",
    "Situation improving in violence-hit Manipur; curfew relaxed in 11 districts",
    "At least 22 people killed, 31 injured as bus falls from bridge in Madhya Pradesh’s Khargone",
    "2023-05-09T16:00:27+05:30\n-\nTechnology\nElon Musk warns that Twitter will purge unused accounts",
    "The World Health Organization’s announcement gives hope, but there is a message of caution",
    "A tragedy foretold: on the boat accident in Kerala and lapses",
    "Kerala should ensure the maritime board is able to enforce regulations",
    "TechnologyElon Musk warns that Twitter will purge unused accounts",
    "World\nSCO FM meet | India’s bilateral tensions vs multilateral ambitions",
    "Entertainment\n In conversation with actor Shanthnu",
    "Technology\nGoogle to pay New York Times $100 million over three years in a content deal: Report",
    "Technology\nElon Musk warns that Twitter will purge unused accounts",
    "GadgetsSony WH-CH720N Review | Impresses on every front",
    "Tamil Nadu\nOrphaned tribal girl fights odds for higher education",
    "India’s China strategy needs to be debated",
    "The Maoists are still a threat",
    "Not quite the Kerala story",
    "Will the greenback still be green?",
    "Buddhism, India’s soft power projection tool",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Huge scam exposed in the purchase of diesel by Railways",
    "A High Court does not have power to direct changes in Scheduled Tribes list: CJI",
    "Clarify social media post on ‘sovereignty’ attributed to Sonia, EC tells Cong.",
    "Iran hangs 2 people in rare blasphemy case as executions surge",
    "Supreme Court to hear plea for SIT into Manipur clashes on May 8",
    "Paytm aims to lead AGI revolution and achieve free cashflow positive, says Vijay Shekhar Sharma",
    "Mindspace REIT unfazed by Cognizant vacating office space in India, says CEO",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023: Playoffs qualification scenarios for all teams",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]