[
    "A journey with migrants on an unreserved coach of the Coromandel Express",
    "Data | Parsing the inflation story of the past year",
    "Explained | What is transcranial magnetic stimulation?",
    "India’s Test losses: a result of stereotypes and the quest for balance",
    "Karnataka Cabinet scraps controversial anti-conversion law introduced by BJP",
    "Collective effort in jeopardy, drop our names from textbooks: Academicians to NCERT",
    "Fresh violence in Manipur; several houses set on fire in Imphal",
    "Cyclone Biparjoy | Landfall process begins, to last until midnight: IMD",
    "Madras HC allows arrested Senthilbalaji to shift to private hospital",
    "Armed drone deal with U.S. firm likely to be announced during PM’s visit",
    "2023-06-15T22:07:26+05:30\n-\nIndia\nWomen-led groups block six arterial roads in Manipur",
    "2023-06-15T21:53:07+05:30\n-\nCricket\nThilak Naidu replaces S Sharath in BCCI junior selection panel",
    "Base boost: On inflation and the consumer",
    "Inflation should not be allowed to erode the purchasing power of the poor",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "Bipartisanship has been in short supply in the Trump era, especially after the indictments",
    "Movies\n‘The Flash’ movie review: Imperfect yet scintillating spectacle to end the DCEU storyline",
    "Movies‘Extraction 2’ movie review: Chris Hemsworth ups the ante in blazing, action-fuelled sequel",
    "Movies\n‘Jee Karda’ series review: Tamannaah Bhatia anchors a glib affair",
    "Science\nSci-Five | The Hindu Science Quiz: On Inventions",
    "Movies\nGuillermo del Toro states five of his projects have been turned down in the last two months",
    "Movies\n'The Penguin' and 'Daredevil: Born Again' stop productions due to writers' strike",
    "BengaluruBMTC buses run over two labourers",
    "Technology\nOpenAI used YouTube data to train some of its models: Report",
    "The next Finance Commission will have a tough task",
    "Strengthening the Integrated Child Development Services scheme",
    "Selling hate through music",
    "Green Humour by Rohan Chakravarty",
    "Male-centric medicine is affecting women’s health",
    "The JD(S) plan for resurrection",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "UAE astronaut Al-Neyadi captures pictures of Cyclone Biparjoy from space",
    "Retaliatory strike by village guards leaves nine dead in Manipur",
    "The next step: On Manipur and the path to normalcy",
    "Byju’s leap from frying pan into the fire",
    "Thailand comes to India’s rescue with crude palm oil exports",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "What is really behind the violence in Manipur?",
    "Asia Cup 2023 dates: Matches start on August 31; Four in Pakistan, nine in Sri Lanka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]