[
    "India\nFive years after SC judgment, only 9 out of 25 High Courts livestream proceedings",
    "India\nMuseum failed to identify ‘Sengol’ because no one could translate Tamil engraving",
    "IndiaDelhi University decides to drop Iqbal from political science syllabus",
    "A new House, again in red sandstone",
    "Army Chief in Manipur, to review situation on ground",
    "ED attaches properties of Udhayanidhi Stalin Foundation",
    "2023-05-28T06:53:00+05:30\n-\nWorld\nErdogan pays homage to Islamic idol on eve of Turkey vote",
    "2023-05-28T06:13:00+05:30\n-\nWorld\nSudanese army chief asks U.N. to dismiss envoy",
    "2023-05-28T05:47:00+05:30\n-\nWorld\nRace for U.S. debt deal as talks go to the wire",
    "Movies\nJustine Triet wins Palme d'Or at Cannes for 'Anatomy of a Fall'",
    "Tamil NaduAnnadurai questioned the motive behind head of mutt giving ‘Sengol’ to Nehru",
    "India\nSengol | A symbol of virtue",
    "World\nRecep Tayyip Erdogan | Turkey’s republican monarch",
    "World\nMalaiyaha Tamils | Two hundred years of struggle",
    "Sci-TechCheetahs introduced without considering spatial ecology: study",
    "Environment\nExplained | Why are cheetah cubs dying in Kuno reserve?",
    "India\nExplained | How can citizens file Census details online?",
    "TechnologyExplained | Will AI tools help detect telecom fraud?",
    "Science\nThe South Indian filter coffee",
    "Explained | Will AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "PM calls upon CMs to work as ‘Team India’",
    "24 more Ministers join Siddaramaiah’s team",
    "Tamil Nadu schools to reopen on June 7 for classes 1 to 12",
    "Kerala’s troublemaking tusker Arikompan still comes for rice",
    "How to text someone on WhatsApp without saving their number on your device",
    "Know your minister: A look at the 24 MLAs sworn in to the Karnataka cabinet today",
    "RBI sanctions merger of Maratha Co-op Bank with Cosmos Co-op Bank",
    "Failed ideas of Jawaharlal Nehru",
    "Kerala Christians are cosying up to the BJP, but at what cost?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]