[
    "What is BBMP Restructuring Committee and how will it help the fast-growing Bengaluru?",
    "News Analysis | Eight months on, ‘Team Kharge’ is a work in progress ahead of 2024 poll",
    "Science for All | What is the chiral bose-liquid state?",
    "Rethink the retention of sedition",
    "Odisha Cabinet approves increase of outlay for Puri’s development by ₹1,000 crore",
    "BSF recovers Pakistan drone, two packets of suspected narcotics in Punajb's Fazilka",
    "In Kerala, people ready to spend up to ₹10 lakh on funerals",
    "As India seeks new LNG supplies, speculation over possibility of reviving Trump-era deal",
    "Telangana Chief Minister KCR hands over keys to six 2BHK beneficiaries",
    "2023-06-22T14:06:34+05:30\n-\nOther States\nTwo soldiers injured in fresh Manipur firing",
    "2023-06-22T13:49:51+05:30\n-\nGadgets\nVivo launches a new 4G smartphone for mid-segment buyers",
    "Overkill: On the Internet shutdown in Manipur",
    "The Manipur government’s decision to extend the Internet shutdowns lacks merit",
    "Heat and state: On a heatwave being only one half of the issue",
    "Poor living conditions have exacerbated the effects of heat waves",
    "MoviesFirst look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "Society\nNayana Motamma: why this first-time Dalit MLA switched from corporate law to politics",
    "Technology\nExplained | What is Titan, the missing Titanic tourist submersible?",
    "Bengaluru\nSustainable shopping in Bengaluru: The surging popularity of secondhand goods",
    "IndiaSylvester daCunha, creator of iconic Amul girl, dies",
    "Business\nAmazon to collect expiring ₹2,000 notes from customers",
    "Technology\nSmartphone data consumption to reach 62 GB in next five years: Report",
    "BusinessIs GDP the right way to measure a nation’s progress?",
    "India\nPM Modi-led Yoga session at UN creates Guinness World Record",
    "More HIT than miss in India-Nepal ties",
    "A churning in Andhra Pradesh",
    "Spare a thought for psychiatric caregivers too",
    "Semiconductor fab: the unfinished agenda",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "FeaturedPride Month | Queer cinema’s shackles in the mainstreamMoviesBhuvanesh ChandarREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A welcome step: on the Blinken-Xi meet in China",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "First look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "PM Modi’s gift to US First Lady: ‘Made in India’ 7.5 carat Green Diamond",
    "Wipro’s mega buyback offer opens today",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]