[
    "Karnataka polls | Striking a balance between castes and regions a daunting task for Congress",
    "Rajasthan’s move spells some hope for gig workers",
    "Explained | How methanol poisoning kills",
    "India deserve the money, but the ICC needs to work out a better system",
    "Spurious liquor deaths in T.N. | Murder case registered; Governor Ravi seeks report",
    "Security forces step up vigil in J&K ahead of G20 meet",
    "Prince Harry, wife Meghan in 'near catastrophic car chase' with paparazzi",
    "Karnataka govt formation | Siddaramaiah is likely choice of Congress high command",
    "Centre writes to States to curb trend of unnecessary hysterectomies",
    "Hypertension to be tackled at primary health centres",
    "2023-05-17T23:12:08+05:30\n-\nWorld\nFifty migrants kidnapped from Mexican bus",
    "2023-05-17T22:33:06+05:30\n-\nIndia\nL-G can destabilise MCD with power to appoint aldermen, says SC",
    "Timely caution: On the Supreme Court’s exhortation to the Enforcement Directorate",
    "The top court has rightly cautioned probe agencies against crossing limits",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "Introspection will do India good in areas where it faces international criticism",
    "Business\nWhy is the rising cost of coal-fired power plants good news for India?",
    "BusinessWatch | All you need to know about the GoFirst crisis",
    "Technology\nApple blocked 1.7 million apps, removed 428,000 developer accounts from the App Store",
    "Technology\nThe Indian publishing industry is gearing up for AI audiobooks",
    "ScienceExplained | Why is a viable dengue vaccine not yet available?",
    "Movies\nPriyanka Chopra, Anne Hathaway, Zendaya light up Bulgari event in Venice",
    "World\nNepal’s Sherpa guide regains title for most climbs of Mount Everest after 27th trip",
    "Movies\nNew on Amazon Prime Video this week: ‘Modern Love Chennai’, ‘Bones and All’, and more",
    "Two judgments and the principle of accountability",
    "‘Three capitals’ in Andhra Pradesh",
    "Kerala: an exemplary story in palliative care",
    "A desperate Israeli leader plays the security card",
    "The Dalit outreach of the BRS",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Congress hits back at BJP for questioning delay in deciding Karnataka CM",
    "MEA rejects U.S. State Department report citing deteriorating religious freedom in India",
    "Severe turbulence on Delhi-Sydney Air India flight; several passengers injured",
    "No decision yet on Karnataka CM after day of lobbying",
    "CBI arrests freelance defence journalist, former Navy officer on espionage charge",
    "Sensex, Nifty open lower on weak cues amid profit booking",
    "LIC trades at 40% discount to issue price a year after listing",
    "Karnataka result shows India’s natural position is in the centre",
    "How underprivileged women in a Delhi slum are breaking the glass ceiling",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]