[
    "The View from India | Chaos next door",
    "Delving into the verdict on the Shiv Sena issue",
    "The Workplace | Women Uninterrupted podcast - Episode 5",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Exports fell to a six-month low in April; demand outlook gloomy",
    "‘We can’t control the sky’, says Zelenskyy as he asks for fighter jets on U.K. visit",
    "Turkey presidential election will go to second round",
    "All eyes on Congress’s Karnataka decision as Opposition leaders gear up for strategy meet",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Karnataka observers give feedback to Congress president Mallikarjun Kharge",
    "Amit Shah meets Manipur CM, Meitei and Kuki leaders to restore peace in State",
    "2023-05-16T09:01:23+05:30\n-\nKerala\nTop Kerala News developments today",
    "2023-05-16T08:37:14+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-05-16T08:21:03+05:30\n-\nChennai\n22 arrested for selling IPL tickets in black market in Chennai",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "TechnologyChatGPT: your work colleague or your replacement?",
    "Travel\nFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "India\n‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Fashion\nWatch | Walkthrough of NMACC’s ‘India in Fashion’ exhibition",
    "GadgetsOppo brings a new 5G phone powered by Snapdragon SoC",
    "Environment\nThe first time climate change ‘went viral’ – 70 years ago",
    "Environment\nNYC skyscrapers turning to carbon capture to lessen climate change",
    "WorldAuschwitz museum begins emotional work of conserving 8,000 shoes of murdered children",
    "Technology\nNumber of apps installed with the term “AI Chatbot” jump; in-app revenue surge: Report",
    "Evaluating DNA report as evidence",
    "A Cabinet reshuffle in Tamil Nadu",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Fatigue in long Covid patients found to impact their nervous system",
    "Statistical succour: On the Consumer Price Index",
    "New Congress Legislature Party asks Mallikarjun Kharge to pick next Karnataka Chief Minister",
    "Chennai girl secures perfect score Class X CBSE board exams",
    "Manipur Chief Minister Biren Singh, 4 Ministers, State BJP chief meet Amit Shah, Nadda in Delhi",
    "Movers & Shakers: Stocks that will see action this week",
    "GoFirst is unlikely to restart operations after May 23, says top official",
    "Karnataka result shows India’s natural position is in the centre",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]