[
    "India\nIndian Army’s Air Defence widens wings",
    "World\n‘Unabomber’ ‘Ted’ Kaczynski found dead in U.S. prison",
    "Other StatesOdisha train tragedy survivor reunites with father at AIIMS, Bhubaneswar",
    "History & Culture\nThe great Indian museum makeover",
    "Will participate in Asian Games only if issues are resolved: Sakshi Malik",
    "India looks at devising its own standards to assess socio-economic progress",
    "Assam CM sent as peacemaker to Manipur",
    "Gujarat ATS busts terror module linked to Islamic State",
    "2023-06-11T09:17:01+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-06-11T09:03:01+05:30\n-\nKerala\nTop Kerala News developments today",
    "2023-06-11T06:20:00+05:30\n-\nWorld\nHeavy rains in northwest Pakistan leave 25 dead, 145 injured",
    "Football\nManchester City win first Champions League title",
    "WorldLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil NaduBuckingham Canal | A waterway once is sewage-carrier now",
    "Science\nIIT-Madras generates hydrogen from seawater using solar energy",
    "Andhra Pradesh\nA.P. forest officials release 4.32 lakh Olive Ridley turtles into sea",
    "ChildrenWhen the Mercury space capsule was patented...",
    "Technology\nCryptocurrency donations | Is more transparency worth the risks?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "NExT exam scheduled for 2024, says Health Ministry",
    "‘Dear Deputy CM, nice thought, but an elite task force is not what Bengaluru needs’",
    "Elderly woman among three killed in attack on Kuki village",
    "Three killed as illegal mine collapses in Dhanbad",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Well-marked low-pressure area over Bay perks up monsoon flows",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "Donald Trump in firm control of Republican Party, remains frontrunner for 2024",
    "Failed ideas of Jawaharlal Nehru",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]