[
    "India\nData logger analysis to provide crucial evidence for rail probe",
    "India\nHowrah-Chennai line has no Kavach system yet",
    "IndiaNilgiris tribes worry about Census blindspots",
    "Society\nNavigating AI ‘hallucinations’ and other such irritants in the age of chatGPT",
    "Death toll in Odisha train accident rises to 288",
    "CAG’s 2022 report on ‘Derailments in Indian Railways’ flagged multiple shortcomings",
    "Probe to examine whether the Coromandel Express derailed or switched tracks",
    "Normalcy returning in Manipur, peace efforts on: security adviser",
    "2023-06-04T04:15:00+05:30\n-\nWorld\nTexas becomes largest state to ban transgender care for minors",
    "2023-06-04T04:00:00+05:30\n-\nWorld\nU.S., Japan, S. Korea aim to share N. Korea missile warning data",
    "IndiaBrij Bhushan Sharan Singh | The controversial ‘Bahubali’",
    "Science\nFoucault pendulum | Earth’s rotation on display",
    "Tamil Nadu\nThiruvavaduthurai Math | A renowned seat of Tamil language and culture",
    "Health\nExplained | Why is India rethinking its anaemia policy?",
    "IndiaExplained | What are the friction points on the LAC?",
    "Technology\nExplained | Are safeguards needed to make AI systems safe?",
    "Tamil Nadu\nIn Tamil Nadu, protecting land asset is more challenging than buying it",
    "ChildrenThe discovery of petroleum jelly",
    "Chennai\nOn a bird quest: An anaesthetist turns avid bird photographer",
    "Explained | What are the friction points on the LAC?",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Govt. wants to make sedition law more draconian: Congress",
    "Mural in new Parliament shows Ashoka empire: Government",
    "Chennai’s most famous adopted son will live on for eternity",
    "Akhand Bharat mural in new Indian Parliament triggers row in Nepal",
    "Odisha train accident: 261 dead, 900 injured in collision",
    "Employees’ Provident Fund: How to activate UAN online",
    "Failed ideas of Jawaharlal Nehru",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]