[
    "Manipur unrest | The embers of Meitei-Kuki conflict still glow",
    "Under-reading and over-reading the Karnataka vote",
    "Ukraine’s recent round of weapons acquisition",
    "Tracking SDG progress the Bhopal way",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudis and Egypt too unlikely",
    "Centre reverses SC order, gives Delhi Lt. Governor final say on bureaucrats",
    "Only ambition is a united Opposition: Sharad Pawar",
    "PM Modi holds meeting with Japanese counterpart Kishida",
    "RBI to pull out ₹2,000 notes from active circulation",
    "Siddaramaiah swearing-in ceremony likely to turn into a show of unity of Opposition parties",
    "2023-05-20T07:51:51+05:30\n-\nIndia\nPM Modi holds meeting with Japanese counterpart Kishida",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "The shifting of Kiren Rijiju from Law Ministry should end conflict with judiciary",
    "Among the elite: On India at the G-7 summit",
    "India’s presidency of G-20 gives it additional heft at G-7 summit",
    "World\nPM Modi’s Indo-Pacific tour | Will Biden’s pullout be India’s gain?",
    "Movies‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "Movies\nCannes 2023: Aishwarya Rai Bachchan stuns in silver Sophie Couture gown",
    "Gadgets\nXiaomi launches Redmi A2 and A2 Plus smartphones into entry segment",
    "Hyderabad\nEight-year-old boy mauled to death by stray dogs in Telangana’s Kazipet",
    "Movies\nHow Hollywood finally cracked the video game adaptation",
    "Movies\nCannes 2023: India’s twin wins at the Oscars show we always dream big, says Khushbu",
    "Explained | What are RBI regulations on green deposits?",
    "Money is about more than just survival",
    "Can an integrated system of medicine work?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "PM Modi arrives in Hiroshima for G7 and Quad summits",
    "D.K. Shivakumar | ‘Rock of Kanakapura’ all set to begin new innings",
    "Clean Science & Tech net profit jumps 29.7% to ₹80.9 crore in Q4",
    "Q4 results preview: Bandhan Bank’s board to meet today to consider financial results",
    "Civil society organisations played key role in Congress victory",
    "IPL 2023 Points Table update after PBKS vs RR match: Rajasthan moves to fifth, keeps hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]