[
    "A word of advice to the Delhi police",
    "In the short term, stabilise the Line of Actual Control",
    "Explained | How KFON aims to bridge the digital divide in Kerala",
    "In Jerusalem, gay pride is conservative too",
    "After Odisha tragedy, Railways to secure signalling equipment with double locks",
    "‘Cyclonic circulation’ in Arabian Sea may cloud monsoon’s progress",
    "Wrestlers resume railway jobs; minor’s father says, ‘complaint not withdrawn’",
    "3 killed, 4 injured in fresh violence in Manipur's Imphal West district",
    "Nirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Odisha rail disaster | Negligence led to accident, says police complaint",
    "Former Vice President Mike Pence files paperwork launching 2024 Presidential bid",
    "2023-06-06T02:00:00+05:30\n-\nIndia\nRahul Gandhi owns a shopping mall of hatred, says J.P. Nadda",
    "Tragic track: on the Balasore train accident and corrective measures by the Indian Railways",
    "The Indian Railways must not lose focus on safety as it expands its services",
    "Eye on oil: on oil prices and India",
    "India must bring pump prices of petrol and diesel in line with global oil prices",
    "KeralaDepiction of naked body cannot be termed as obscene or sexually explicit, says Kerala HC",
    "Videos\nWatch | Why did this Maharashtra temple town witness communal tension?",
    "Movies\nTrailer of Anil Kapoor-Aditya Roy Kapur’s ‘The Night Manager Part 2’ out",
    "Technology\nU.S. SEC sues Binance, founder Zhao alleging securities law violations",
    "KarnatakaThis Bengaluru-based start-up generates water from thin air",
    "Tamil Nadu\nAs more opt for their own private space, senior living real estate segment opens up",
    "Technology\nLinda Yaccarino to take over as Twitter CEO officially this week",
    "MoviesVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "South Asia’s climate migration is a ticking bomb",
    "Denying States their own cultures",
    "How the reification of caste will not lead to a true politics of change and justice",
    "Explained | What is the electronic interlocking system in railways?",
    "Explained | The decade-long search for a rare Higgs boson decay",
    "Explained | Why does North Korea want spy satellites?",
    "How genome sequences tracked down an ancient disease",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Days after the horrific accident in Balasore, another goods train derails in Odisha",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Odisha train accident death toll lowered to 275",
    "Power bills to be dearer by ₹2.89 per unit for Bescom consumers in June",
    "Solar industry ‘rushing headlong’ into supply glut, cautions IEA report",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Odisha train tragedy raises questions about rail safety and signals system",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]