[
    "Where anyone can be accused of sedition",
    "Explained | What has India done to address child trafficking?",
    "The JD(S) plan for resurrection",
    "Tax law in the shadow of the higher judiciary",
    "Cyclone ‘Biparjoy’ | 21,000 shifted to safer places from Gujarat coast",
    "Tamil Nadu’s Prabanjan, A.P.’s Bora Varun top NEET (UG) with perfect scores",
    "SC commission sends notice to Zomato, Delhi Police and YouTube over ‘casteist’ advertisement",
    "Manipur violence | At least 11 killed in late night attack in Khamenlok",
    "ED arrests Tamil Nadu Minister Senthilbalaji in money-laundering case",
    "Fresh quakes jolt Jammu and Kashmir's Katra, Doda",
    "T.N. CM Stalin visits arrested Minister V. Senthilbalaji at hospital",
    "2023-06-14T11:20:26+05:30\n-\nTelangana\nDCHL promoter arrested by Enforcement Directorate",
    "2023-06-14T11:07:30+05:30\n-\nTechnology\nMeta guru says ChatGPT-style AI is out-of-date",
    "The next step: On Manipur and the path to normalcy",
    "Ethnicisation and poor governance are stumbling blocks to peace in Manipur",
    "Love all: On Djokovic’s latest feat",
    "There were few surprises in the singles events at the French Open",
    "Technology\nWill be making more products for creators, Asus executive says",
    "BooksCormac McCarthy, dark genius of American literature, dead at 89",
    "Entertainment\nSJ Suryah: ‘I still live the life of a middle-class teacher’s son‘",
    "India\nCongress leader Rahul Gandhi undertakes another truck ride, this time in U.S.",
    "MoviesGolden Globe Awards sold, Hollywood Foreign Press group shut down",
    "Movies\n‘Maalai Nera Malipoo’ movie review: A slow-burn, yet stirring tale of a sex worker",
    "Art\nThe many smells of Bengaluru captured in a book",
    "Same-sex marriage: Morality vs equality",
    "Musings on the frictions in India-Canada ties",
    "NCDs plague Keralites’ health",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "ED officials arrest Tamil Nadu Minister Senthilbalaji in money-laundering case",
    "Retail inflation cools again; down to 4.25% in May",
    "Fall from grace: on the political trajectory of Boris Johnson",
    "May retail inflation, April factory output spring positive surprise",
    "Nifty prediction today — June 13, 2023: Index set to rally",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "FIFA U20 World Cup: Team of the tournament",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]