[
    "Rajasthan’s move spells some hope for gig workers",
    "How subaltern women writers broke conventions and took on patriarchy",
    "The rebooting of the Congress",
    "The Dalit outreach of the BRS",
    "Dengue vaccine: India moves closer to getting its first indigenous vaccine",
    "Chhattisgarh liquor scam | Do not create an “atmosphere of fear”, Supreme Court tells ED",
    "SC Collegium recommends AP Chief Justice, senior advocate Vishwanathan as apex court judges",
    "No decision yet on Karnataka CM after day of lobbying",
    "Australia cancels Quad meeting in Sydney after Biden postponement",
    "Rajouri-Poonch sector an uphill challenge for security agencies",
    "MEA rejects State department report citing deteriorating religious freedom in India",
    "2023-05-17T08:56:00+05:30\n-\nOther States\nOdisha to create land bank for afforestation programme",
    "2023-05-17T06:05:12+05:30\n-\nDelhi\nSC asks about source of LG’s power to nominate MCD members",
    "2023-05-17T06:00:20+05:30\n-\nDelhi\nPM10 levels off the charts as winds raising dust sweep Delhi",
    "Tripping trade: on India and its trade stance",
    "India must not rely on a few large markets, but opt for integration with global value chains",
    "Weaker by the year: on the elections in Turkey and Recep Tayyip Erdoğan",
    "Erdogan may still be in the lead, but the run-off is humbling",
    "Chennai\nAt 42.7 degrees Celsius, Chennai sees hottest day of the summer",
    "PodcastDecoding the Karnataka election results | In Focus podcast",
    "Cricket\nM.S. Dhoni signing shirt was an ‘emotional moment’ for me, says Sunil Gavaskar",
    "India\nEU Foreign Minister says Europe should stop entry of Indian products made from Russian oil",
    "MoviesInterview with the team of ‘Modern Love: Chennai’: Trying to define love and its many hues",
    "Delhi\nRashtrapati Bhavan to be open for public viewing for six days a week from June 1",
    "Entertainment\nAlia Bhatt dazzles in black at Gucci Cruise 2024 in Seoul",
    "TechnologyMeta introduces WhatsApp Chat Lock feature",
    "Movies\nVijay Antony on ‘Pichaikkaran 2’ and listening to the audience ‘inside him’",
    "The rising tide of dictatorship",
    "A Cabinet reshuffle in Tamil Nadu",
    "Evaluating DNA report as evidence",
    "Explained | How methanol poisoning kills",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Double-decker express train derails, no one hurt",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "CMDA to shift private bus terminus from Koyambedu to city outskirts on Outer Ring Road",
    "U.S. releases religious freedom report, calls on India to condemn ‘persistent’ religious violence",
    "IOC likely to post better performance sequentially in Q4 FY23",
    "Nifty Today – May 16, 2023: Rally set to extend",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after LSG vs MI: Lucknow Super Giants third with seventh win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]