[
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "The Science Quiz | On the abyssal zone",
    "To mark a month of wrestlers’ protest, candlelight vigil at India Gate",
    "Punjab, Delhi Congress units wary of backing AAP",
    "BSF intercepts fifth Pakistani drone in four days in Punjab",
    "IPL 2023 Qualifier 1: Riding the yellow wave, Super Kings enter 10th final",
    "COVID-19 genomics body INSACOG has not put out weekly bulletin since March 27",
    "Florida Governor DeSantis to enter 2024 race in Twitter event with Musk",
    "Trinamool, CPI, AAP to skip inauguration of new Parliament building",
    "2023-05-24T00:00:23+05:30\n-\nIndia\nRahul Gandhi moves court seeking NOC for fresh passport",
    "2023-05-23T23:36:04+05:30\n-\nKolkata\nTwo killed in blaze at firecracker warehouse in West Bengal",
    "Governing after winning: On the road ahead for the Congress government in Karnataka",
    "The Congress in Karnataka must now focus on governance",
    "An unclean chit: On the SEBI investigation and Hindenburg Research’s allegations",
    "Economy\nExchange of ₹2,000 notes | Small queues, confusion on Day 1",
    "IndiaThe View From India | The importance of Modi’s Indo-Pacific Tour",
    "Movies\n‘Sirf Ek Bandaa Kaafi Hai’ movie review: Manoj Bajpayee steps up in court",
    "Gadgets\nMotorola launches Edge 40 with 144Hz refresh rate",
    "Movies\nRajinikanth emotionally recalls actor Sarath Babu’s ‘quit smoking’ advice to him",
    "GadgetsNokia launches budget smartphone C32 in India",
    "Movies\nRay Stevenson, of 'RRR' and 'Thor' movies, dies at 58",
    "Technology\nHow to get the best out of a free audio transcription service",
    "TechnologyApple Watch, Indian wearable brands lift outsourced smartwatch shipments globally",
    "Movies\nCannes 2023: Lily-Rose Depp, The Weeknd's 'The Idol' gets five-minute standing ovation",
    "Justice that also makes space for the animal world",
    "Redrawing the poll strategy in Bihar",
    "The paradox of BRICS, its new pathway",
    "It’s time to ensure safer skies",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "Explained | What is the ‘Open Network for Digital Commerce’?",
    "FeaturedFilmi-ness: Kunal Basu on writing and cinema MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Women bag top four positions in Civil Service examinations",
    "16 new Karnataka MLAs skip oath-taking at Legislative Assembly",
    "Ray Stevenson, of 'RRR' and 'Thor' movies, dies at 58",
    "Capital quandary: On politics and Delhi’s administrative autonomy",
    "Canara Bank’s CGM appointed Deputy MD at IDBI Bank",
    "Jefferies gives ‘buy’ rating on two Adani companies",
    "Failed ideas of Jawaharlal Nehru",
    "The Muslims who stayed back: Review of ‘Another India’ by Pratinav Anil",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]