[
    "Same-sex marriage: Morality vs equality",
    "It’s Mission Asian Cup for the Blue Tigers as coach Stimac prepares a blueprint for the road ahead",
    "Political Line | Cashing in on cows",
    "While Nitish headlines Opposition meet, Lalu, Tejashwi lay the groundwork",
    "Balasore train accident | 12 Opposition parties demand SC-monitored SIT",
    "Manipur violence | Assam CM meets Kuki insurgent groups with peace plan",
    "Fire breaks out at Bhopal’s Satpura Bhawan, IAF assistance sought; Congress questions timing",
    "Cyclone Biparjoy | IMD-INCOIS predicts extensive damage in Gujarat districts",
    "CoWIN vaccination data out, Centre denies breach",
    "2023-06-13T04:38:00+05:30\n-\nIndia\nCongress demands judicial inquiry into CoWIN data breach",
    "2023-06-13T04:00:00+05:30\n-\nWorld\nPakistan begins importing discounted Russian crude oil",
    "2023-06-13T03:45:00+05:30\n-\nIndia\n4,361 people infected with malaria in Tripura",
    "The second-best: on India and the World Test Championship final",
    "India, after a hectic IPL, seemed unprepared for the WTC final",
    "Fall from grace: on the political trajectory of Boris Johnson",
    "The refusal of Boris Johnson to go quietly can damage the Tories",
    "Entertainment\nSJ Surya: ‘I still live the life of a middle-class teacher’s son‘",
    "Andhra PradeshWith new changes by TTD, a record number of devotees have darshan at Tirumala",
    "Podcast\nWhat does RBI’s current monetary policy mean for India’s economy? | In Focus podcast",
    "Tamil Nadu\nNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "Science\nMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "VideosWatch | Mumbai salon offers stigma-free space for transgender community",
    "India\nLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "TechnologyExplained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Wrestlers’ protest and the shrinking space for dissent",
    "NCDs plague Keralites’ health",
    "The Telangana BJP is in a bind",
    "E-education platforms, their Generative AI chapter",
    "Governors cannot indefinitely hold back Bills",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Explained | The Hiroshima process that takes AI governance global",
    "Explained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IndiGo flight enters Pakistan airspace amid bad weather; returns safely",
    "New electricity tariffs kick in, leave consumers in shock",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "One dead, several injured in shooting at a house in Maryland",
    "Nifty prediction today – June 12, 2023: Facing a resistance",
    "Star Health founder V Jagannathan resigns from the Board",
    "Happily unhurried in Bhutan",
    "Joshimath crisis: A story of criminal neglect",
    "Intercontinental Cup 2023: Lebanon looks for a win over Mongolia in a battle of the opposites",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]