[
    "Chhattisgarh liquor scam | Do not create an “atmosphere of fear”, Supreme Court tells ED",
    "Karnataka polls | Striking a balance between castes and regions a daunting task for Congress",
    "Rajasthan’s move spells some hope for gig workers",
    "Explained | How methanol poisoning kills",
    "MEA rejects State department report citing deteriorating religious freedom in India",
    "Explained | How to lock private chats on WhatsApp",
    "Dengue vaccine: India moves closer to getting its first indigenous vaccine",
    "Australia cancels Quad meeting in Sydney after Biden postponement",
    "Karnataka govt formation live updates: Siddaramaiah or D.K. Shivakumar, who will be the new CM?",
    "Sourav Ganguly's security cover upgraded to Z category",
    "Insurance 'scam' case: CBI searches at nine locations in Jammu and Kashmir, Delhi",
    "2023-05-17T10:48:28+05:30\n-\nTechnology\nExplained | How to lock private chats on WhatsApp",
    "2023-05-17T10:35:36+05:30\n-\nFootball\nDaily Quiz | On La Liga",
    "Tripping trade: on India and its trade stance",
    "India must not rely on a few large markets, but opt for integration with global value chains",
    "Weaker by the year: on the elections in Turkey and Recep Tayyip Erdoğan",
    "Erdogan may still be in the lead, but the run-off is humbling",
    "Technology\nThe Indian publishing industry is gearing up for AI audiobooks",
    "FootballDaily Quiz | On La Liga",
    "Delhi\nBroadway-like show to mark 100 years of Ramleela committee",
    "Tamil Nadu\nResearch scholar, trampled by wild elephant on Sacon campus near Coimbatore, dies",
    "HealthHypertension a silent killer, majority are still unaware: doctors",
    "Chennai\nAt 42.7 degrees Celsius, Chennai sees hottest day of the summer",
    "Podcast\nDecoding the Karnataka election results | In Focus podcast",
    "Movies\nInterview with the team of ‘Modern Love: Chennai’: Trying to define love and its many hues",
    "The rising tide of dictatorship",
    "The Dalit outreach of the BRS",
    "The rebooting of the Congress",
    "Evaluating DNA report as evidence",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Do not create an “atmosphere of fear”, Supreme Court tells ED",
    "Double-decker express train derails, no one hurt",
    "No decision yet on Karnataka CM after day of lobbying",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "Centre appoints Ravneet Kaur as CCI Chairperson",
    "IOC likely to post better performance sequentially in Q4 FY23",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after LSG vs MI: Lucknow Super Giants third with seventh win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]