[
    "He prostrated himself before his teachers",
    "The first time climate change ‘went viral’",
    "Urban apathy or out-of-sync voter lists responsible for low turnout in Bengaluru?",
    "‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "‘We can’t control the sky’, says Zelenskyy as he asks for fighter jets on U.K. visit",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "Turkey presidential election will go to second round",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Karnataka observers give feedback to Congress president Mallikarjun Kharge",
    "Exports fell to a six-month low in April; demand outlook gloomy",
    "Amit Shah meets Manipur CM, Meitei and Kuki leaders to restore peace in State",
    "2023-05-15T22:37:19+05:30\n-\nWorld\nThailand’s voters reject military-backed parties",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "TechnologyChatGPT: your work colleague or your replacement?",
    "Travel\nFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "Fashion\nWatch | Walkthrough of NMACC’s ‘India in Fashion’ exhibition",
    "Gadgets\nOppo brings a new 5G phone powered by Snapdragon SoC",
    "EnvironmentThe first time climate change ‘went viral’ – 70 years ago",
    "Environment\nNYC skyscrapers turning to carbon capture to lessen climate change",
    "World\nAuschwitz museum begins emotional work of conserving 8,000 shoes of murdered children",
    "TechnologyNumber of apps installed with the term “AI Chatbot” jump; in-app revenue surge: Report",
    "Technology\nExplained | Gaps in Aadhaar-enabled Payment System (AePS) abused by cybercriminals",
    "Delving into the verdict on the Shiv Sena issue",
    "Evaluating DNA report as evidence",
    "A Cabinet reshuffle in Tamil Nadu",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Fatigue in long Covid patients found to impact their nervous system",
    "Statistical succour: On the Consumer Price Index",
    "New Congress Legislature Party asks Mallikarjun Kharge to pick next Karnataka Chief Minister",
    "Chennai girl secures perfect score Class X CBSE board exams",
    "Manipur Chief Minister Biren Singh, 4 Ministers, State BJP chief meet Amit Shah, Nadda in Delhi",
    "Avenue Supermarts’ Q4 PAT, revenue up y-o-y",
    "DMart share price falls 3.5% on quarterly profit miss, margin drop",
    "The politics of dog meat ban in Nagaland",
    "Mallikarjun Kharge leads from the front as Congress conquers Karnataka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]