[
    "Manipur unrest | The embers of Meitei-Kuki conflict still glow",
    "Under-reading and over-reading the Karnataka vote",
    "Fernando Alonso and Aston Martin: honeymoon period or marriage made in heaven?",
    "Tracking SDG progress the Bhopal way",
    "Prime Minister Narendra Modi raises rights of transgender persons at G7",
    "Cashless treatment facilities now available to all CGHS beneficiaries at 6 AIIMS",
    "Withdrawal of ₹2,000 notes will have no perceptible effect on economy: Panagariya",
    "Siddaramaiah sworn in as Karnataka Chief Minister, Shivakumar as Dy. CM",
    "PM Modi meets Ukranian President Zelenskyy in Hiroshima",
    "CBI files chargesheet against Congress leader Jagdish Tytler in 1984 anti-Sikh riots case",
    "Centre moves SC seeking review of judgment that held Delhi govt has control over services",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "The shifting of Kiren Rijiju from Law Ministry should end conflict with judiciary",
    "Among the elite: On India at the G-7 summit",
    "India’s presidency of G-20 gives it additional heft at G-7 summit",
    "Kerala\nKerala Souvenir Network aims to tackle Chinese invasion on souvenir market",
    "Tamil NaduTN boy braves disability, scores 437 in class X exam",
    "Kerala\nThe people and the government: the contemporary relevance of The Svadesabhimani",
    "Economy\nRBI to pull out ₹2,000 notes from active circulation",
    "Technology\nThe accessibility gap on streaming in India",
    "WorldPM Modi’s Indo-Pacific tour | Will Biden’s pullout be India’s gain?",
    "Movies\n‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "Movies\nCannes 2023: Aishwarya Rai Bachchan stuns in silver Sophie Couture gown",
    "GadgetsXiaomi launches Redmi A2 and A2 Plus smartphones into entry segment",
    "Gadgets\nOptoma GT2160HDR 4K projector review | Does what it claims, and nothing more",
    "Explained | What are RBI regulations on green deposits?",
    "Money is about more than just survival",
    "Can an integrated system of medicine work?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Narayana Netralaya chairman Dr. Bhujang Shetty passes away",
    "Centre reverses Supreme Court order, gives Delhi Lieutenant Governor final say on bureaucrats",
    "RBI to pull out ₹2,000 notes from active circulation",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "Telangana can now build a city as big as Hyderabad next to it",
    "Pichai sells Chennai home where Sundar grew up",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023 Points Table update after PBKS vs RR match: Rajasthan moves to fifth, keeps hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]