[
    "A British engineer who brought water and prosperity to a valley in Tamil Nadu",
    "Kerala Spotlight | Not a rosy picture on the silver screen",
    "Hakki Pikkis — bird catchers to entrepreneurs of traditional medicine",
    "The emergence of new-age weathermen in Andhra Pradesh",
    "Boat capsize in the Poorappuzha estuary | Tragedy at Tanur",
    "Ten Kuki MLAs from Manipur demand ‘separate administration’",
    "Cyclone Mocha to be stronger than expected",
    "Gyanvyapi mosque case: HC allows revision plea for scientific survey of Shiv Ling",
    "Elon Musk picks advertisement executive Linda Yaccarino as Twitter CEO",
    "All three key parties on the edge as vote-counting is taken up on today",
    "2023-05-13T04:45:00+05:30\n-\nWorld\nBangladesh audiences see first Indian movie in 50 years",
    "Asymmetry and power: on Delhi government and administrative services",
    "The Supreme Court ruling on services is a boost for representative government in Delhi",
    "Welcome initiative: on quality human clinical trials and using ayurveda and modern medicine",
    "Movies\n‘Air’ movie review: Ben Affleck shoots Matt Damon into MVP territory",
    "Movies‘Dahaad’ series review: Sonakshi Sinha leads a sensitive procedural",
    "Gadgets\nDell launches Alienware m16 and x14 R2 laptops in India",
    "Movies\n‘IB 71’ movie review: Vidyut Jammwal fails to charge up this ham-fisted exercise",
    "Tamil NaduWatch | Man ‘greets’ elephant in Dharmapuri, booked for provoking it",
    "Movies\n‘Raavana Kottam’ movie review: Shanthnu shines in an otherwise middling affair",
    "Tamil Nadu\nThe making of ‘Palani panchamirtham’",
    "Movies\n‘Love Again’ movie review: This Priyanka Chopra-Sam Heughan syrupy romance works in parts",
    "Welfare spending has been getting a regular pruning",
    "Diagnostic imaging of the Rajasthan Right to Health Act",
    "Marriage for all, even if for a few",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Is the monarchy still relevant in the 21st century?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Baby’s got three parents: explaining Mitochondrial Donation Treatment",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Morality and majority: on the Supreme Court verdict on the political imbroglio in Maharashtra",
    "Descent into chaos: on the state of Pakistan’s politics",
    "Post-SC verdict, all eyes on Maharashtra Speaker Narwekar",
    "SC stays promotion of 68 judicial officers in Gujarat",
    "Adani-Hindenburg row: SC may grant SEBI 3 more months to wrap up probe",
    "Results preview: Tata Motors to post mid-single-digit revenue growth in Q4 on higher volumes",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "IPL Points Table 2023 after MI vs GT: Mumbai Indians third after win vs Gujarat Titans",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]