[
    "Explained | What is transcranial magnetic stimulation?",
    "India’s Test losses: a result of stereotypes and the quest for balance",
    "Male-centric medicine is affecting women’s health",
    "Explained | What is the status of transgenic crops in India?",
    "CET 2023 result announced in Karnataka",
    "The Delhi Police filed a chargesheet before court in sexual harassment case by wrestlers",
    "Cyclone Biparjoy less than 200 km from Gujarat coast; 74,000 evacuated",
    "Why is the Law Commission revisiting Uniform Civil Code now, asks Congress",
    "Unidentified bike breaches Nitish Kumar’s security during morning walk",
    "2023-06-15T12:33:31+05:30\n-\nIndia\nPM Modi hails govt works in infrastructure sector",
    "2023-06-15T12:32:56+05:30\n-\nGadgets\nLG unveils new Gram series laptops",
    "Base boost: On inflation and the consumer",
    "Inflation should not be allowed to erode the purchasing power of the poor",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "Bipartisanship has been in short supply in the Trump era, especially after the indictments",
    "BengaluruBMTC buses run over two labourers",
    "India\nUAE astronaut Al-Neyadi captures pictures of Cyclone Biparjoy from space",
    "Bengaluru\nOnce a waste picker, Indumathi becomes community’s voice at Paris Plastic Treaty",
    "Business\nWhat does RBI pausing on rates mean for the Indian economy?",
    "ChennaiNEET topper Prabanjan felicitated in Chennai, plans to join AIIMS Delhi",
    "Chennai\nStudents who worked on ‘AzaadiSAT’ communications satellite meet Tamil Nadu Governor",
    "The next Finance Commission will have a tough task",
    "Strengthening the Integrated Child Development Services scheme",
    "Selling hate through music",
    "On the Draw — June 15, 2023",
    "The JD(S) plan for resurrection",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Student from Hyderabad murdered in London",
    "Retaliatory strike by village guards leaves nine dead in Manipur",
    "Tamil Nadu’s Prabanjan, A.P.’s Bora Varun top NEET (UG) with perfect scores",
    "Law Commission seeks fresh suggestions on Uniform Civil Code",
    "Thailand comes to India’s rescue with crude palm oil exports",
    "Byju’s leap from frying pan into the fire",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]