[
    "A British engineer who brought water and prosperity to a valley in Tamil Nadu",
    "Kerala Spotlight | Not a rosy picture on the silver screen",
    "Hakki Pikkis — bird catchers to entrepreneurs of traditional medicine",
    "The emergence of new-age weathermen in Andhra Pradesh",
    "Elon Musk says he has found new Twitter CEO",
    "Pak’s SC orders release of former PM Imran Khan",
    "Mamata’s proposal for ‘diploma doctors’ sparks row",
    "SC stays promotion of 68 judicial officers in Gujarat",
    "SC verdict on Maharashtra crisis: All eyes on Speaker Rahul Narwekar",
    "Explained | What is the SC ruling on Sena vs. Sena?",
    "CBSE Class 12 results declared",
    "2023-05-12T12:27:16+05:30\n-\nGadgets\nDell launches Alienware m16 and x14 R2 laptops in India",
    "2023-05-12T11:30:53+05:30\n-\nOther States\nSC stays promotion of 68 judicial officers in Gujarat",
    "Morality and majority: on the Supreme Court verdict on the political imbroglio in Maharashtra",
    "Supreme Court verdict is an indictment of how regime change in Maharashtra was achieved",
    "Descent into chaos: on the state of Pakistan’s politics",
    "Pakistan politicians are falling into Army’s trap by attacking one another",
    "Gadgets\nDell launches Alienware m16 and x14 R2 laptops in India",
    "Movies\nSonakshi Sinha and Vijay Varma on their ‘jugalbandhi’ in ‘Dahaad’",
    "Tamil Nadu\nThe making of ‘Palani panchamirtham’",
    "Movies\n‘Poor Things’ trailer: Willem Dafoe resurrects Emma Stone in Yorgos Lanthimos’ next feature",
    "MoviesHabitat Film Festival: A pigeon, a cat and a pond full of memories",
    "Books\nThe uprising of 1857, and Meerut’s role in the first war for India’s Independence",
    "Movies‘Siruvan Samuel’ movie review: Amateurish filmmaking sabotages a hearty tale",
    "Health\nDo I still need to wear my mask?",
    "The problem with India’s multi-alignment stand",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Is the monarchy still relevant in the 21st century?",
    "Marriage for all, even if for a few",
    "Pokhran-II: A moment of profound epiphany",
    "Explained | How are millets’ nutrient content affected by processing and polishing?",
    "Baby’s got three parents: explaining Mitochondrial Donation Treatment",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Pawar play: On the churn in politics in Maharashtra",
    "Exit polls give edge to Congress in high-stakes Karnataka battle",
    "Delhi vs Centre row: SC holds Delhi government has control over administrative services",
    "Over 72% turnout in peaceful Karnataka Assembly polls",
    "L&T may hive-off electrolyser manufacturing unit, to offer IOCL a stake: Shankar Raman",
    "Karnataka’s high voltage Assembly polls end with 66% voter turnout",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]