[
    "How are Indian languages faring in the age of AI and language models?",
    "When Einstein thought he was wrong but Feynman convinced physicists otherwise",
    "The View from India | The reign of Erdogan continues",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Delhi HC rejects Manish Sisodia’s bail plea in Excise Policy case",
    "Delhi teen murder case | Accused Sahil sent to 2-day police custody",
    "Manipur violence | Amit Shah meets civil society, women’s group in Imphal",
    "Wrestlers will not be allowed to protest at India Gate, say police sources",
    "9 years of Modi Government | PM says filled with humility and gratitude, will keep working harder",
    "Go First now cancels all scheduled flights till June 4",
    "At least 10 Vaishno Devi pilgrims dead, 57 injured as bus falls down from bridge in Jammu",
    "2023-05-30T17:55:22+05:30\n-\nMumbai\nCharge sheet filed in IIT-Bombay student's death",
    "Symbols and substance: on the inauguration of the new Parliament building and beyond",
    "Religious rituals at the opening of Parliament building defied propriety",
    "Faster, stronger: on India and its supercomputer use",
    "India must use its supercomputers beyond weather forecasts",
    "Technology\nIndians face challenges prioritising cleaning practices: Dyson",
    "Kerala\nWatch | What was the Vaikom Satyagraha all about?",
    "Movies\nMartin Scorsese meets Pope Francis, announces film about Jesus",
    "Movies\nMichelle Lee: John Wick wouldn’t fight the way he did without the stunt team",
    "MoviesComing to Netflix: ‘Scoop’, ‘Never Have I Ever Season 4’, ‘Arnold’, ‘Bloodhounds’, and more",
    "Chennai\nVummidi Bangaru Chetty family that made Sengol in 1947 felicitated at PM Modi’s residence",
    "Movies\n‘Alice, Darling’ movie review: Anna Kendrick is riveting in this tale of emotional abuse",
    "The indelible imprint of the Fifth Estate, in Karnataka",
    "From Master of the Roster to Master of all Judges?",
    "The BJP outreach to Saivites",
    "Menstrual health is a public health issue",
    "The Erdogan victory, a triumph for Ottoman glory",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "Explained | The SC ruling on jallikattu",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Recep Tayyip Erdogan wins historic Turkey runoff vote",
    "Muslims lag behind Scheduled Castes and Scheduled Tribes in higher education",
    "Demerging hotels business is back on ITC’s table",
    "CBI books BAE Systems, Rolls Royce for corruption in Hawk aircraft deal",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]