[
    "View from India | Spotlight Indo-US",
    "Same-sex marriage: Morality vs equality",
    "It’s Mission Asian Cup for the Blue Tigers as coach Stimac prepares a blueprint for the road ahead",
    "E-education platforms, their Generative AI chapter",
    "SC commission sends notice to Zomato, Delhi Police and YouTube over ‘casteist’ advertisement",
    "Field Central forces for Bengal local body polls: Calcutta High Court",
    "Uttarkashi communal tensions | Petitioners move Supreme Court for ban on mahapanchayat",
    "ED arrests Tamil Nadu Minister Senthilbalaji in money-laundering case",
    "The arrest follows an 18-hour questioning at the Minister’s home in Chennai",
    "Trump pleads not guilty to charges in U.S. classified documents case",
    "Cyclone ‘Biparjoy’ | 21,000 shifted to safer places from Gujarat coast",
    "CoWIN data leak | No CERT-in update yet; experts demand transparency",
    "2023-06-14T07:56:56+05:30\n-\nCricket\nNew Zealand's Bracewell to miss ODI World Cup due to injury",
    "2023-06-14T07:39:12+05:30\n-\nWorld\nSeveral Japan Self Defence Force personnel injured in shooting",
    "The next step: On Manipur and the path to normalcy",
    "Ethnicisation and poor governance are stumbling blocks to peace in Manipur",
    "Love all: On Djokovic’s latest feat",
    "There were few surprises in the singles events at the French Open",
    "Books\nCormac McCarthy, dark genius of American literature, dead at 89",
    "IndiaPrabanjan, Bora Varun top NEET (UG) with perfect scores",
    "Entertainment\nSJ Suryah: ‘I still live the life of a middle-class teacher’s son‘",
    "India\nCongress leader Rahul Gandhi undertakes another truck ride, this time in U.S.",
    "MoviesGolden Globe Awards sold, Hollywood Foreign Press group shut down",
    "Movies\n‘Maalai Nera Malipoo’ movie review: A slow-burn, yet stirring tale of a sex worker",
    "Art\nThe many smells of Bengaluru captured in a book",
    "Tax law in the shadow of the higher judiciary",
    "The JD(S) plan for resurrection",
    "Where anyone can be accused of sedition",
    "Musings on the frictions in India-Canada ties",
    "NCDs plague Keralites’ health",
    "Explained | What has India done to address child trafficking?",
    "Explained | The diplomatic row over the repatriation of baby Ariha from Germany",
    "Explained | Why the ‘world’s first carbon-neutral airline’ is facing a lawsuit",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Retail inflation cools again; down to 4.25% in May",
    "ED officials arrest Tamil Nadu Minister Senthilbalaji in money-laundering case",
    "Fall from grace: on the political trajectory of Boris Johnson",
    "Squash World Cup’s new avatar set to attract eyeballs",
    "May retail inflation, April factory output spring positive surprise",
    "Stock to buy today: Prestige Estates Projects (₹562.05)",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Denver Nuggets beats Miami Heat in Game 5, wins first NBA title",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]