[
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Explained | What is the electronic interlocking system in railways?",
    "In Jerusalem, gay pride is conservative too",
    "BYJU'S moves New York Supreme Court challenging acceleration of $1.2 billion Term Loan B",
    "Kalakshetra sexual harassment case | Arrested faculty member, Hari Padman, granted bail",
    "Odisha train accident | CBI begins probe, collects first-hand report",
    "Ukraine accuses Russia of destroying major dam near Kherson, warns of widespread flooding",
    "President Murmu conferred with Suriname’s highest civilian award",
    "NCB busts pan-India DarkNet-based drug cartel network",
    "2023-06-06T17:36:05+05:30\n-\nMarkets\nRupee rises 1 paisa to close at 82.62 against U.S. dollar",
    "Tragic track: on the Balasore train accident and corrective measures by the Indian Railways",
    "The Indian Railways must not lose focus on safety as it expands its services",
    "Eye on oil: on oil prices and India",
    "India must bring pump prices of petrol and diesel in line with global oil prices",
    "India\nNirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "InternetHere is how you can find out if someone has blocked you on WhatsApp",
    "Gadgets\nSamsung Galaxy F54 5G Review | Alternative to the Galaxy A series",
    "Other States\nLakhs of tourists throng to Himachal Pradesh’s hill stations",
    "Other StatesHow an ISKCON temple near Balasore train accident site is helping victims, volunteers",
    "India\nOdisha train accident | Reliance to provide free ration, jobs to affected families",
    "A word of advice to the Delhi police",
    "South Asia’s climate migration is a ticking bomb",
    "Denying States their own cultures",
    "How the reification of caste will not lead to a true politics of change and justice",
    "In the short term, stabilise the Line of Actual Control",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Explained | The decade-long search for a rare Higgs boson decay",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Under-construction bridge collapses in Bihar’s Bhagalpur; probe ordered",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "Pesky calls: Telcos to roll out platform to take consent of users in 2 months",
    "Failed ideas of Jawaharlal Nehru",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]