[
    "World\nPakistan court acquits former Prime Minister Nawaz Sharif in 37-year-old ‘bribe’ case",
    "India\nKathua rape-murder case: Arguments on framing of charges against main accused on June 26",
    "WorldNews Analysis | Mutiny exposes chinks in Putin’s armoured regime",
    "India\nExplained | Why is the U.S.-India fighter jet deal important?",
    "After meeting Amit Shah, Manipur CM says he will reach out to Kukis",
    "PM Modi, President El-Sisi sign strategic partnership pact between India and Egypt",
    "PM Modi receives the Order of the Nile, Egypt’s highest honour, and terms the visit ‘historic’",
    "Obama’s remarks about minority rights in India are surprising: Sitharaman",
    "India\n Open Market Sales Scheme | Now, Centre Vs State on foodgrains",
    "Cricket India’s 1983 World Cup victory...40 years on",
    "Karnataka\nIn Frames | Struggle for water",
    "Movies\nWatch | Mari Selvaraj on ‘Maamannan’ and the art of immersing the audience in his world",
    "Food\nKozhikode’s Paragon named 11th most legendary restaurant in the world, says Taste Atlas",
    "Open PageAccidents in war and life",
    "Books\nPride Month 2023 | Queering the narrative",
    "India\n Gita Press | God’s own publisher",
    "ArtThe artist x artisan conundrum",
    "World\nMicron Technology | Rebalancing portfolio",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Hamish G.L. Harding | The Titan submersible was the last expedition of a life-long explorer",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "Monsoon covers Delhi, Mumbai together",
    "12 cadres of banned Manipur extremist group released after mob stops Army",
    "Adani Group eyes ₹90,000-crore EBITDA in two-three years",
    "Byju's staff say morale waning amid turmoil at Indian edtech firm",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]