[
    "The View from India | The reign of Erdogan continues",
    "Death of tuberculosis patient in Kerala throws up questions on gaps in healthcare",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Political Line | Saffron designs for 2024",
    "If only someone from the crowd had shown courage: Shahbad Dairy victim’s father",
    "Union Home Minister Amit Shah visits Manipur to plan for peace measures",
    "Congress leaders in Delhi and Punjab ask party high command to not support the AAP",
    "Eight killed, 20 injured as bus falls off bridge in Jammu",
    "The bus was reported to have been carrying pilgrims to the Mata Vaishno Devi shrine",
    "Ashok Gehlot and Sachin Pilot brought together by Kharge and Rahul Gandhi",
    "Muslims lag behind Scheduled Castes and Scheduled Tribes in higher education",
    "IPL 2023 Final | Chennai Super Kings beat Gujarat Titans by five wickets to win fifth title",
    "2023-05-30T10:17:43+05:30\n-\nDelhi\nThunderstorm with rain forecast in Delhi, min temp 20.7 deg C",
    "Symbols and substance: on the inauguration of the new Parliament building and beyond",
    "Religious rituals at the opening of Parliament building defied propriety",
    "Faster, stronger: on India and its supercomputer use",
    "India must use its supercomputers beyond weather forecasts",
    "ScienceISRO’s GSLV-F12 successfully places navigation satellite NVS-01 into intended orbit",
    "Other States\nClimate of fear still lingers in Manipur",
    "Kerala\nLadakh has adventure bikers from Kerala in a thrall",
    "Telangana\nGLSV F12 mission success has Hyderabad touch",
    "Other StatesKashmir’s fading Sufiyana Mausiki, Tchakri songs attract a spotlight",
    "India\nMalala Yousafzai’s photo removed from Jharkhand school following controversy",
    "Podcast\nWhat lies behind India’s missing wombs problem? | In Focus podcast",
    "WorldNepal honours Sherpa guides, climbers to mark 70th anniversary of Mount Everest conquest",
    "Movies\nMalayalam blockbuster ‘2018’ to stream on SonyLiv",
    "The indelible imprint of the Fifth Estate, in Karnataka",
    "The BJP outreach to Saivites",
    "From Master of the Roster to Master of all Judges?",
    "Menstrual health is a public health issue",
    "The Erdogan victory, a triumph for Ottoman glory",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Sengol bent on the very first day: Stalin",
    "Unlocking secrets of the honeybee dance language",
    "An opulent House: art lines ₹200-crore interiors",
    "IPL final moved to reserved day due to persistent rains",
    "CBI books BAE Systems, Rolls Royce for corruption in Hawk aircraft deal",
    "Demerging hotels business is back on ITC’s table",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]