[
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "NCP split a reminder of succession battles in regional parties",
    "Twitter rival Threads signs up 100 million users in five days",
    "West Bengal panchayat poll violence | Darkest hour just before dawn say Governor Ananda Bose",
    "Foxconn withdraws from India's semiconductor JV with Vedanta",
    "Ahead of NATO summit, Biden engages in ‘tea diplomacy’ in U.K.",
    "Feedback on welfare schemes boosts Congress hopes in Rajasthan",
    "Rain continues to pound North India, toll rises to 25",
    "Give proof of security forces’ ‘complicity’, Manipur HC Bar Association urges people",
    "2023-07-10T23:46:46+05:30\n-\nTennis\nDjokovic reaches Wimbledon quarters as Rybakina advances",
    "2023-07-10T23:23:55+05:30\n-\nCricket\n2023 Cricket World Cup | Eden ticket rates announced",
    "2023-07-10T22:58:48+05:30\n-\nIndia\nSC protects YouTube channel editor Shajan Skaria from arrest",
    "Second moonshot: on the Chandrayaan-3 mission on July 14",
    "Chandrayaan 3 speaks to the moon’s growing importance in scientific and political milieus",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Grassroots politics is now a high-stakes game of violence in West Bengal",
    "ScienceDaily Quiz | On lunar missions",
    "Environment\nRibbon dance in the heart of Bengaluru",
    "Gadgets\nOppo Reno10 Pro+ 5G and Reno10 Pro 5G launched in India",
    "WorldSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "Environment\nIn Varanasi, turtles help clean the Ganga",
    "Technology\nExplained | What should you know about Meta’s social media app Threads?",
    "Tamil Nadu‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "Visakhapatnam\nAyurvedic education system faces neglect in Andhra Pradesh and Telangana",
    "AI’s disruptive economic impact, an India check",
    "In Opposition without a leader",
    "Don’t waste the wastewater",
    "Women’s reproductive autonomy as the new catchword",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "16 killed as heavy rain triggers landslips, floods in north India",
    "‘Rajini fatigue’ will work against actor Vijay, say political leaders in T.N.",
    "The ‘Anna Bhagya’ fiasco and thinking beyond rice",
    "Explained | Why is China limiting exports of raw materials?",
    "Financial due diligence underway at IDBI Bank",
    "Canara Bank to sign ₹3,000 crore IT transformation deal",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Lakshya Sen staves off Li Shi Feng challenge to win Canada Open title",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]