[
    "Facing the heat | Deaths and denial in U.P.’s Ballia",
    "Squaring the circle at the India-Egypt summit",
    "Refresh or reboot: the question confronting Indian Test cricket",
    "Data | Among languages mostly confined to a State, Tamil leads with 1.5 lakh Wikipedia articles",
    "PM Modi in US | A major leap forward for India-US ties?",
    "Railways alarmed over freight trains running without safety clearance",
    "As Opposition parties met in Patna, BRS was busy meeting BJP ministers for State’s development",
    "Mercenary group Wagner rebels; takes over Russian military facility",
    "Moscow has tightened security in Rostov-on-Don, which is home to the Russian military headquarters",
    "‘This is the moment’: PM Modi tells diaspora and business leaders as U.S. visit concludes",
    "Infiltration bid foiled, soldier injured in J&K's Poonch",
    "PM Modi's visit will provide impetus to India-Egypt bilateral ties: Indian envoy",
    "Warm welcome: On the Narendra Modi U.S. state visit and bilateral ties",
    "Narendra Modi’s visit further strengthened the ties between India and the United States",
    "Bridging the gap: On India and Gender Gap Report",
    "Efforts to reduce gender disparities must continue in earnest",
    "Kerala\nRetired Army soldier’s ‘priceless’ bicycle",
    "IndiaGoogle will open global fintech centre in Gujarat: CEO Sundar Pichai after meeting PM Modi",
    "Movies\nWatch | Mari Selvaraj on ‘Maamannan’ and the art of immersing the audience in his world",
    "Life & Style\nLoreKeepers, a digital archive, preserves folklore traditions in Kerala",
    "IndiaExplained | The row over awarding Gita Press the Gandhi Peace Prize",
    "India\nLalu asks Rahul to get married",
    "Movies\n‘Elemental’ movie review: Pixar’s beautiful song of ice and fire",
    "Movies‘Tiku Weds Sheru’ movie review: Nawazuddin Siddiqui is out of tricks in bittersweet romance",
    "Movies\n‘Dhoomam’ movie review: Fahadh Faasil leads an unimpactful film fogged by its message",
    "Strike a fine balance, have a just civil code",
    "Can a shorter medical course solve rural doctor shortages?",
    "Rethink the retention of sedition",
    "The challenges of reporting on an ethnic conflict",
    "A doorway to an entrepreneurial university",
    "Explained | Australia’s referendum to include an Indigenous ‘Voice’ in its Constitution",
    "Explained | The row over awarding Gita Press the Gandhi Peace Prize",
    "Explained | What is lab-grown meat and what did the U.S. recently approve?",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Spiralling violence: On the West Bank",
    "Infiltration bid foiled in J&K, four terrorists killed",
    "PM Modi’s U.S. visit yields many vital agreements",
    "Deloitte Haskins quits as Byju’s auditors on no word from promoters on delayed results",
    "US-India ties will be most defining of 21st century: Joe Biden",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Taipei Open: Prannoy through to quarters; Kashyap exits",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]