[
    "India\nData logger analysis to provide crucial evidence for rail probe",
    "India\nHowrah-Chennai line has no Kavach system yet",
    "IndiaNilgiris tribes worry about Census blindspots",
    "Society\nNavigating AI ‘hallucinations’ and other such irritants in the age of chatGPT",
    "Death toll in Odisha train accident rises to 288",
    "CAG’s 2022 report on ‘Derailments in Indian Railways’ flagged multiple shortcomings",
    "Probe to examine whether the Coromandel Express derailed or switched tracks",
    "Normalcy returning in Manipur, peace efforts on: security adviser",
    "IndiaMural in new Parliament shows Ashoka empire: Government",
    "Other States\nOdisha train accident | Citizens rush to hospitals to donate blood",
    "Data\nData | Clean energy funds rise, but mostly in China, Europe, U.S.",
    "World\nIndia-Nepal ties | The HITs and misses of PM Prachanda’s visit",
    "Life & Style\nCyrus Broacha explains why men thought of the concept of marriage",
    "Movies‘Taj: Reign of Revenge’ series review: Mughal succession drama creaks and crumbles",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Balasore train accident | Death toll increases to 261, many injured",
    "Pakistan hands over 200 Indian fishermen at Attari-Wagah border",
    "Intas gets USFDA ‘Import Alert’ but allowed to supply 24 critical drugs",
    "What is KAVACH? Could it have prevented the Odisha train tragedy?",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Thailand Open 2023: Lakshya Sen makes semifinals, Kiran George out",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]