[
    "ISRO’s Chandrayaan 3: When did it start and when will it end?",
    "The strange story of how Anas lost his Asian Championships berth",
    "The View from India | Why the U.S. is sending cluster munitions to Ukraine",
    "Feedback on welfare schemes boosts Congress hopes in Rajasthan",
    "Give proof of security forces’ ‘complicity’, Manipur HC Bar Association urges people",
    "Foxconn withdraws from India's semiconductor JV with Vedanta",
    "Delhi on high alert as Yamuna crosses danger mark, touches 206.24 meters",
    "NIA raids five places in south Kashmir in terror conspiracy case",
    "Ahead of NATO summit, Biden engages in ‘tea diplomacy’ in U.K.",
    "2023-07-11T10:33:25+05:30\n-\nMarkets\nRupee rises 21 paise in early trade",
    "2023-07-11T10:22:36+05:30\n-\nTelangana\nTop Telangana news developments today",
    "Second moonshot: on the Chandrayaan-3 mission on July 14",
    "Chandrayaan 3 speaks to the moon’s growing importance in scientific and political milieus",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Grassroots politics is now a high-stakes game of violence in West Bengal",
    "Business\nHyundai introduces entry-level SUV Exter",
    "TechnologyTwitter rival Threads signs up 100 million users in five days",
    "Science\nDaily Quiz | On lunar missions",
    "EnvironmentRibbon dance in the heart of Bengaluru",
    "Gadgets\nOppo Reno10 Pro+ 5G and Reno10 Pro 5G launched in India",
    "World\nSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "EnvironmentIn Varanasi, turtles help clean the Ganga",
    "Technology\nExplained | What should you know about Meta’s social media app Threads?",
    "AI’s disruptive economic impact, an India check",
    "In Opposition without a leader",
    "Don’t waste the wastewater",
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "Women’s reproductive autonomy as the new catchword",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "Consumers can heave sigh of relief as Bescom announces 25-day billing cycle for June in Bengaluru",
    "U.S. sends its top human rights official to Delhi",
    "Karnataka Dy. CM Shivakumar catches Indira Canteen staff fleecing customers",
    "16 killed as heavy rain triggers landslips, floods in north India",
    "Decoupling possible across and within markets: Allianz’s Mohamed El-Erian",
    "Home-spun diagnostic solutions spark interest in a ‘neglected’ segment",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]