[
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "It depends on who is giving the rating: Centre on India’s rank in press freedom index",
    "Amit Shah’s remark that Tagore composed ‘national songs’ of 2 countries kicks up row",
    "Karnataka Assembly Elections voting live updates | 8.21% voting recorded till 9 a.m.",
    "Security forces launch cordon and search op in J&K's Poonch",
    "IT Ministry to examine claim of WhatsApp accessing mic in background",
    "No end to the humiliations of frisking for NEET aspirants",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "ChennaiAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Movies\n‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra PradeshTapping the nascent market for donkey milk in Andhra Pradesh",
    "TechnologyElon Musk warns that Twitter will purge unused accounts",
    "Salvaging the idea and reality of Manipur",
    "Upsetting the apple cart in Himachal",
    "Not quite the Kerala story",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "More than a story: on the film, The Kerala Story, and the demand that it be banned",
    "Huge scam exposed in the purchase of diesel by Railways",
    "Former Pakistan PM Imran Khan arrested during court appearance, sparking protests",
    "ITC Foods introduces its first millet cookies",
    "How Manipal’s Pai is growing the health and education pie",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after MI vs RCB match - Mumbai third with sixth win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]