[
    "Jallikattu — continuity of a tradition from Indus Valley to Keezhadi",
    "Death traps on National Highways in Andhra Pradesh",
    "Kannada cinema’s content crisis",
    "Systematic incitement plan",
    "Mayawati slams Opposition parties for skipping inauguration of new Parliament",
    "Foodgrains, oilseed harvests will break records, says Centre",
    "Shah to visit Manipur soon to hold talks to restore peace",
    "All-in-one policy plan to spread insurance in India",
    "China constructing model villages opposite the LAC, say sources",
    "IT searches under way on the premises linked to T.N. Minister Senthilbalaji",
    "Sengol | Evidence thin on govt’s claims about the sceptre",
    "2023-05-26T09:32:41+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-05-26T09:16:26+05:30\n-\nIndia\nU.S. Defense Secretary Lloyd Austin to visit India next week",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Science\nISRO chief hails role of Sanskrit in India becoming knowledge society since Vedic times",
    "PodcastShould States revert to the Old Pension Scheme? | The Hindu Parley Podcast",
    "Athletics\nFor Neeraj Chopra, breaching the 90m is a target, not an obsession",
    "Tamil Nadu\nWhen Roman merchants and soldiers came to Madurai to trade in pepper",
    "Science\nSci-Five | The Hindu Science quiz: On migrating birds",
    "MoviesDheeraj Akolkar’s documentary on Norwegian actor Liv Ullman screened at Cannes",
    "Technology\nEducation sector worst hit as ransomware attacks rise in India: Report",
    "An ordinance, its constitutionality, and scrutiny",
    "Understanding history is inevitable",
    "Should States revert to the Old Pension Scheme?",
    "The fundamental value of the rupee",
    "Economics that looks at lower half of the pyramid",
    "Industrial investments: The Kerala story",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Unnecessary brinkmanship: On the U.S.’s fiscal quagmire",
    "Colombia-Panama border hit by 6.6-magnitude earthquake",
    "G-20 delegates tour Srinagar city in an attempt to see ‘changed Kashmir situation’",
    "AAP's Satyendar Jain collapses in Tihar Jail, shifted to ICU",
    "Dairy war: Now, Tamil Nadu wants Amul to stop tapping Aavin milkshed area",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]