[
    "A relentless drive for greatness has catapulted conqueror Dhoni into a common man’s hero",
    "Manoj Misra | The Defender of Yamuna",
    "Data | The effects of more than two decades of Erdogan’s rule",
    "Ashok Gehlot tries out his welfare card",
    "DRDO successfully flight-tests New Generation Ballistic Missile ‘Agni Prime’ off Odisha",
    "Kerala CM embarks on U.S., Cuba tour amidst strident Opposition criticism",
    "Knife attacker injures several people, including children, in French Alpine town",
    "Mumbai man kills live-in-partner, chops body into pieces; detained by police",
    "RBI retains FY24 GDP growth forecast at 6.5%, keeps repo rate unchanged",
    "Air India flight carrying stranded passengers, crew members from Russia lands at San Francisco",
    "End the debate: On the Law Commission’s recommendation on sedition",
    "The retention of sedition goes against the grain of current thinking",
    "Deadly billboards: On billboards and their regulation",
    "Despite frequent accidents, there is no political will to regulate billboards",
    "GadgetsRealme 11 Pro+ 5G and Realme 11 Pro 5G launched in India",
    "Videos\nWatch | Odisha train tragedy | ‘Not a mosque’ - ISKCON temple staff debunk fake news",
    "Technology\nHow an AI bot plays Minecraft by itself using GPT-4",
    "MoviesInterviewing Spider-Man: Tom Holland on his great powers, and greater responsibilities",
    "Music\nThe Gipsy Kings come to Bengaluru",
    "Music\nCuban singer Omara Portuondo proves age is just a number",
    "TechnologyWorking to address challenges, adapting to evolving market landscape, Realme CEO says",
    "Business\nThe good and not-so-great takeaways from India’s macroeconomic numbers",
    "Sedition — illogical equation of government with state",
    "Tackling the human-dog conflict",
    "Green Humour by Rohan Chakravarty",
    "Nigeria’s new President faces old problems",
    "Seeing India’s energy transition through its States",
    "Explained | The China-US race to the Moon",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Explained | What is the Kosovo-Serbia conflict all about? Why have tensions flared again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Make MVA fall and trap Eknath Shinde’: Amruta Fadnavis in Whatsapp chat",
    "23-year-old found murdered in Bengaluru flat, police searching for her friend",
    "Protest over social media message turns violent in Kolhapur city; curfew imposed",
    "Cabinet approves ₹89,000-cr revival package for BSNL",
    "Maruti rolls out Jimny starting at ₹12.74 lakh",
    "Failed ideas of Jawaharlal Nehru",
    "M. Karunanidhi: A civilisational imagination to secure plurality",
    "‘Embarrassing’, ‘feral’, ‘disrespectful’: French Open fans under fire",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]