[
    "It’s a tough road ahead for Channapatna’s toy makers",
    "Data | Why Centre’s denial of rice through OMSS hits Karnataka the most",
    "Science for All | Why does observing gravitational waves matter?",
    "Yuki Bhambri’s doubles success will inspire many Indian players, says coach M. Balachandran",
    "Madhya Pradesh CM Chouhan washes feet of urination incident victim, apologises to him",
    "Madras HC declares 2019 election of Theni MP, P. Raveendranath Kumar, null and void",
    "Chandrayaan-3 launch scheduled for July 14 at 2.35 p.m.",
    "Defamation case | Gujarat HC to deliver verdict on Rahul’s plea on July 7",
    "A stay on conviction would pave the way for Mr. Gandhi’s reinstatement as MP",
    "U.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Kerala rains | Flood situation remains grim in upper Kuttanad, rough sea batters Alappuzha coast",
    "I am still effective, whether 82 or 92, asserts Sharad Pawar",
    "2023-07-06T21:52:40+05:30\n-\nIndia\nU.S. ready to help in Manipur if asked, says Eric Garcetti",
    "Diminishing returns: On India and its Shanghai Cooperation Organisation engagement",
    "Relief, again: On the Teesta Setalvad case",
    "No one should be denied limited respite from arrest to pursue legal remedies",
    "Podcast\nWhy are Indian highways so unsafe? | In Focus podcast",
    "CartoonIt rained in the city",
    "Movies\nLeonardo DiCaprio, Robert De Niro’s ‘Killers of the Flower Moon’ trailer out",
    "Movies\nWatch | Amala Akkineni: Cinema is no longer about one person producing a masterpiece",
    "TelanganaPicture shot by Telangana girl makes it to Vogue Italia magazine",
    "Karnataka\nMysuru’s public bicycle sharing system Trin Trin to get new technology",
    "Economy\nIndia’s expanding middle class will bulge up to over 1 billion by 2047: PRICE study",
    "Movies\n‘Salaar: Part 1’ teaser: Prabhas is all fire in Prashanth Neel’s intense gangster drama",
    "Striking a blow against affirmative action in America",
    "An inclusive social policy for migrants",
    "Gujarat’s bridges to nowhere",
    "Green Humour by Rohan Chakravarty",
    "Choose a new palette for India’s creative economy",
    "Lessons from the fracas over foodgrains",
    "Explained | Iran’s induction in the Shanghai Cooperation Organisation",
    "What are the risks surrounding Zaporizhzhya, the nuclear power plant in a war zone?",
    "Explained | The U.S. student loan crisis and Joe Biden’s new cancellation plan",
    "Explained | The changes to the Liberalised Remittance Scheme",
    "Explained | India’s diabetes epidemic is making India’s TB epidemic worse",
    "FeaturedEveryone loves to hate doctorsHealthRamya KannanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Ph.D not compulsory for teaching jobs in colleges, universities: UGC",
    "Finance Minister Sitharaman calls up DGP after gang kidnaps two GST officers in Telangana",
    "AP’s new pension scheme is attractive and viable",
    "India to insist on well-defined criteria for BRICS expansion",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]