[
    "Inside Jharkhand’s single-teacher schools",
    "Controversies surrounding bike taxis refuse to die in Bengaluru",
    "Substance abuse in Kerala | On a high, at a social cost",
    "Telangana Spotlight | Not the end of the road",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "Women trapped in bomb-making ‘cottage industry’ in West Bengal‘s Khadikul",
    "As Law Minister, Kiren Rijiju took potshots at Indian judiciary",
    "PM Modi leaves for Japan in first leg of three-nation visit",
    "NCM team visits Arunachal Pradesh to study Buddhist shrine-Gurdwara row",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "2023-05-19T11:03:53+05:30\n-\nBusiness\nStock markets turn volatile after positive beginning",
    "2023-05-19T10:33:51+05:30\n-\nMarkets\nRupee falls 14 paise to 82.76 against U.S. dollar",
    "2023-05-19T10:33:30+05:30\n-\nTechnology\nQuirky things Apple does that make little sense",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "The Congress must demonstrate the success of its inclusive vision in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "India must invest in infrastructure that boosts defence against disasters",
    "Movies\nNow, a ‘Kerala story’ of a Muslim woman and her Hindu children",
    "PodcastCan an integrated system of medicine work? | The Hindu Parley Podcast",
    "Other States\nIn strife-torn Manipur, Kuki-Meitei villagers stick together near Myanmar border",
    "Delhi\nBGMI unbanned: Popular PUBG successor allowed to resume operations, developer says",
    "World\nAndy Warhol violated a photographer's copyright on image of Prince, Supreme Court rules",
    "Movies\nSeth Rogen on ‘Platonic’ and whether men and women can truly stay friends",
    "ScienceSci-Five | The Hindu Science Quiz: on stars",
    "A long-drawn test for India’s diplomatic skills",
    "Explained | What are RBI regulations on green deposits?",
    "Can an integrated system of medicine work?",
    "‘Three capitals’ in Andhra Pradesh",
    "Money is about more than just survival",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How methanol poisoning kills",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Office searched at 3 a.m.; sensitive files photocopied: Vigilance official",
    "Research scholar, trampled by wild elephant on Sacon campus near Coimbatore, dies",
    "Jallikattu upheld by SC | PETA India says exploring legal remedies",
    "Zafaryab Jilani, the Babri Masjid advocate, no more",
    "Pichai sells Chennai home where Sundar grew up",
    "Telangana Cabinet to withdraw the GO 111",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]