[
    "Other States\nAssam’s Kokrajhar district feasts on mushroom, for health and wealth",
    "Environment\nJumbo translocation | Addressing the elephant in the room",
    "IndiaA missing letter means no work for MGNREGS workers in Odisha",
    "Tennis\nIs it the beginning of a new era in women’s tennis?",
    "Wagner militia threatens to march to Moscow, pulls back hours later",
    "12 cadres of banned Manipur extremist group released after mob stops Army",
    "The cadres belonged to Kanglei Yaol Kanba Lup (KYKL), a proscribed Meitei outfit.",
    "Modi reaches Cairo; to meet with President El Sisi and the Grand Mufti",
    "India-made mRNA vaccine priced at ₹2,292, will be available as a booster dose",
    "2023-06-25T02:00:00+05:30\n-\nWorld\nNo evidence COVID-19 created in Chinese lab: U.S. intelligence",
    "2023-06-25T01:21:30+05:30\n-\nIndia\nPrime Minister Narendra Modi meets thought leaders in Egypt",
    "India\nGita Press | God’s own publisher",
    "WorldMicron Technology | Rebalancing portfolio",
    "World\nTitan submersible | Deep sea tragedy",
    "World\nExplained | Does the China-Pakistan nuclear deal flout global rules?",
    "India\nExplained | Why is the U.S.-India fighter jet deal important?",
    "Kerala\nRetired Army soldier’s ‘priceless’ bicycle",
    "Life & Style\nLoreKeepers, a digital archive, preserves folklore traditions in Kerala",
    "Movies‘Elemental’ movie review: Pixar’s beautiful song of ice and fire",
    "Movies\n‘Tiku Weds Sheru’ movie review: Nawazuddin Siddiqui is out of tricks in bittersweet romance",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Gita Press | God’s own publisher",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Google will open global fintech centre in Gujarat: CEO Sundar Pichai after meeting PM Modi",
    "Putin vows to crush ‘armed mutiny’ as rebel Wagner chief tries to oust top military brass",
    "Pistol-toting businessman keeps P.H. Road on edge for 11 hours",
    "‘This is the moment’: PM Modi tells diaspora and business leaders as U.S. visit concludes",
    "Ukraine says it advances in south, stops Russian attack in east",
    "Index Outlook: Nifty 50, Sensex: Ripe for a correction?",
    "GE-HAL deal to co-produce 99 jet engines to cost less than $1 billion",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "When can Messi play his first match for Inter Miami?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]