[
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Assailant stabs house surgeon to death in Kottarakara government taluk hospital",
    "IT Ministry to examine claim of WhatsApp accessing mic in background",
    "NCLT grants GoFirst’s insolvency plea",
    "White House announces PM Modi’s state visit to Washington DC in June",
    "“I would have been equally angry”: U.K. High Commissioner about attack on India’s London mission",
    "Pakistan anti-corruption watchdog gets 8-day remand of Imran Khan",
    "2023-05-10T21:36:49+05:30\n-\nCricket\nIPL 2023 | CSK post 167/8 against DC",
    "2023-05-10T21:20:02+05:30\n-\nOther States\nSena vs Sena: SC set to pronounce verdict on May 11",
    "2023-05-10T21:19:37+05:30\n-\nWorld\nDaily Mirror apologises to Prince Harry over unlawful action",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "Business\n Is India’s growing reliance on Russian supplies a long-term risk?",
    "IndiaICMR conducts successful trial run of blood bag delivery under iDrone initiative",
    "Chennai\nAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "World\nDaily Quiz | On the rulers of Great Britain",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Technology\nElon Musk announces Twitter encrypted direct messages; voice and video chat coming soon",
    "Movies‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "Salvaging the idea and reality of Manipur",
    "Upsetting the apple cart in Himachal",
    "Not quite the Kerala story",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Former AGM of Punjab National Bank, 3 others get five-year jail term for bank fraud",
    "How to download voter ID card online?",
    "Parminder Chopra, first woman to lead India’s largest NBFC",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after MI vs RCB match - Mumbai third with sixth win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]