[
    "Puff the magic dragon: the myth of ‘safe’ e-cigarettes",
    "The big, booming business of child-bride trafficking in Gujarat",
    "Kerala spotlight | Awaiting monsoon with hope and dread",
    "Kuttappa optimistic of his wards getting three to four Olympic quota places at the Asian Games",
    "Telangana@10 | Will Formation Day glee extend till high-stakes December polls?",
    "Wrestlers row | Permission denied for Brij Bhushan's ‘maha rally’ in Ayodhya on June 5",
    "Siddaramaiah announces five schemes to implement Congress poll promises",
    "Militant killed in Army’s anti-militancy operation in Rajouri",
    "Akhand Bharat mural in new Parliament triggers row in Nepal",
    "Want justice for wrestlers, but after due process of law: Sports Minister Anurag Thakur",
    "2023-06-02T18:24:02+05:30\n-\nEnvironment\nWatch | Meet the army of volunteers who protect the Ganga",
    "Wrestling for justice: On the protest by the wrestlers",
    "The Wrestling Federation needs an overhaul in the wake of the allegations",
    "Riding the momentum: On National Statistical Office’s economic data and the economy",
    "Fiscal and monetary measures must remain growth supportive in the coming quarters",
    "Movies\n‘Scoop’ series review: Hansal Mehta’s valentine to conscientious print journalism",
    "Movies\n‘Taj: Reign of Revenge’ series review: Mughal succession drama creaks and crumbles",
    "Technology\nWatch | The rear screen of the Mercedes Maybach S-Class",
    "Movies\n‘Pinki Elli’ Kannada movie review: A social thriller that hits strikingly close to reality",
    "ScienceExplained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Movies\n‘Pareshan’ movie review: This Thiruveer outing is more ‘pareshan’ than entertaining",
    "At the root of India’s manufacturing challenge",
    "Recasting the discourse on Muslim education",
    "Is there a clear north-south divide in Indian politics?",
    "In Bengal, court orders dominate politics",
    "Chennai’s most famous adopted son will live on for eternity",
    "Central Asian foreign policy multi-vectorism pays off",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Akhand Bharat mural in new Indian Parliament triggers row in Nepal",
    "Army condemns social media leaks on Meitei officers posted in Manipur",
    "India-Russia joint venture on Vande Bharat trains hits hurdle",
    "Elon Musk goes silent on Twitter after arriving in China",
    "GQG’s Jain bets Adani Group will thrive with or without Modi",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]