[
    "For Hindutva, only the Hindu past is relevant, says Romila Thapar",
    "Defender, drag-flicker, leader: Harmanpreet inhabits the best of all worlds",
    "Data | High burden of diabetes and BP in Kerala and West Bengal",
    "Bleeding blue in Nanded | Where celebrating Ambedkar’s birthday is a crime",
    "PM Modi’s State Visit to U.S. will have significant outcomes, says Jaishankar",
    "Kutch limping back to normalcy in cyclone Biparjoy aftermath; most roads cleared",
    "NIA takes over probe into attacks on Indian Missions in U.S., Canada",
    "At least 41 killed in rebel attack on Ugandan school near Congo border",
    "Science Secretary Srivari Chandrasekhar to ‘prematurely’ demit office",
    "ED searches premises of Atiq Ahmed’s associates",
    "2023-06-17T20:33:46+05:30\n-\nIndia\nRailways to ensure ‘zero compromise’ on safety",
    "2023-06-17T19:59:32+05:30\n-\nMumbai\nDuelling factions of Sena prepare for rivalry in Mumbai",
    "Shifting sands: On India’s external trade performance",
    "Before things get better on the trade front, they may get worse",
    "Mounting tensions: On the threat to social harmony in Uttarakhand",
    "Criminal cases should not be allowed to take a communal colour",
    "Movies\nVijay meets and honours students; speech goes viral",
    "MoviesDavid Attenborough’s ‘Our Planet II’ is a visual delight despite its sobering message",
    "Movies\n‘Black Mirror’ Season 6 review: Disturbing, disquieting, delicious",
    "World\nU.S. eases norms on eligibility criteria for those awaiting Green Card",
    "Movies\n‘Shaitan’ web series review: Blood, gore and survival",
    "TiruchirapalliNarikuravar teen from village in Perambalur district clears NEET",
    "Movies\n‘Bommai’ movie review: A fantastic SJ Suryah can’t save this mediocre story",
    "Music\nGrammys: Only 'human creators' eligible to win, recording academy says response to AI",
    "Life & StyleManga and anime characters speak Malayalam, thanks to enthusiasts in Kerala",
    "Railway safety — listen to the voices from below",
    "The path to a new and imminent U.S.-Iran nuclear deal",
    "Indian students must be taught that doing is the new learning",
    "Jumpstarting the next phase of U.S.-India defence ties",
    "A media war with no winners",
    "Is the Indian Railways stretched beyond its capacity?",
    "Explained | Are non-communicable diseases increasing in India?",
    "Explained | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Manipur violence | Sedition case against Meitei politician after Assam Rifles complaint",
    "‘Adipurush’ movie review: Prabhas falters in this black-and-white retelling of the ‘Ramayana’",
    "Karnataka to scrap anti-conversion law, reverse textbook changes",
    "7.2 magnitude quake strikes near Tonga",
    "Biparjoy refuses to blink even after landfall, stays cyclone through Friday",
    "Lifestyle beverage brand Salud raises the bar with launch of its newest gin",
    "What is really behind the violence in Manipur?",
    "SRK’s ‘beta’ to Alia Bhatt’s ‘other’: The doppelganger lives of Bollywood’s body doubles",
    "Asia Cup 2023 dates: Matches start on August 31; Four in Pakistan, nine in Sri Lanka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]