[
    "Data | Kuki-Meitei ethnic violence: The sharp hill-valley divide that is Manipur’s burden",
    "Uzbekistan, which once backed anti-Taliban forces, is now betting on engagement",
    "The uprising of 1857, and Meerut’s role in the first war for India’s Independence",
    "Deep depression over Bay of Bengal intensifies into cyclonic storm Mocha",
    "Third low-intensity explosion in Punjab’s Amritsar, 5 arrested",
    "SpiceJet says no plans to file for insolvency",
    "Delhi vs Centre row: SC holds Delhi government has control over administrative services",
    "Delhi Police registers FIR against BharatPe ex-MD Ashneer Grover for 'misappropriation of funds'",
    "2023-05-11T18:37:56+05:30\n-\nInternet\nHow Google’s AI could change the way we write emails",
    "2023-05-11T18:22:36+05:30\n-\nDelhi\nDelhi govt removes Services secretary Ashish More",
    "2023-05-11T18:05:09+05:30\n-\nHealth\nDo I still need to wear my mask?",
    "2023-05-11T17:47:06+05:30\n-\nWorld\nU.K. sending Ukraine long-range cruise missiles",
    "Pawar play: On the churn in politics in Maharashtra",
    "Maharashtra might see a fresh churn as the elections approach",
    "Snap judgement: On India’s Project Cheetah",
    "Every birth or death shouldn’t be seen as success or failure of Project Cheetah",
    "Health\nDo I still need to wear my mask?",
    "MoviesDeepika Padukone appears on cover of TIME magazine",
    "Movies\n‘Modern Love Chennai’: Trailer of Tamil anthology of love stories out",
    "Gadgets\nGoogle launches Pixel 7a with Tensor G2 chip",
    "Science\nSci-Five | The Hindu Science Quiz: On submarine volcanoes",
    "Movies\nGucci names Alia Bhatt as first global brand ambassador from India",
    "Movies\n‘Good Night’ movie review: A spectacular Manikandan in a lovely slice-of-life drama",
    "IndiaGoogle historical satellite imagery disappears for India",
    "Karnataka Elections\nVote from Home: Missed opportunity for many and a choice not picked by others",
    "A ground view of the Indian Space Policy 2023",
    "Pokhran-II: A moment of profound epiphany",
    "No answers even months after atrocity",
    "The fallout of Putin helping make NATO ‘great again’",
    "Upsetting the apple cart in Himachal",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Higher pension: EPFO directs offices to calculate dues with interest",
    "Google historical satellite imagery disappears for India",
    "Huge scam exposed in the purchase of diesel by Railways",
    "Exit polls give edge to Congress in high-stakes Karnataka battle",
    "GST: FinMin lowers e-invoicing threshold to ₹5 crore from August 1",
    "‘Union Bank aims to be third-largest PSB by 2025’",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]