[
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Data | Another tiger from Madras: The rise and rise of D. Gukesh",
    "PM’s pitch for UCC is along the same lines as Centre’s affidavit in Supreme Court",
    "Kerala has received 65% deficit rainfall so far during monsoon: IMD",
    "Go First cancels all flights until June 30",
    "Rahul to visit Manipur on June 29, 30",
    "White House, MEA decline to comment on Obama interview",
    "Elections to 10 Rajya Sabha seats on July 24",
    "Putin says Russia paid $1 bn to Wagner group over last year",
    "2023-06-27T22:30:21+05:30\n-\nIndia\nTranslocated cheetah injured in skirmish in Kuno Park",
    "2023-06-27T22:02:39+05:30\n-\nIndia\nOpposition slams Centre’s policies for tomato price rise",
    "2023-06-27T21:54:46+05:30\n-\nIndia\nCentre to sell toor dal from buffer stocks as price shoots up",
    "2023-06-27T21:54:07+05:30\n-\nIndia\nRahul Gandhi to visit violence-hit Manipur on June 29, 30",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Internet\nFlipkart to let people exchange defunct electronic items for new products",
    "MoviesTamannaah Bhatia on ‘Jailer’, ‘Jee Karda’, ‘Lust Stories 2’ and Vijay Varma",
    "Internet\nTelegram to launch Stories in July",
    "Movies\nPride Month | Lesbians through the looking glass",
    "India\nEPFO extends deadline to apply for higher pension till July 11",
    "WorldDeepavali to be school holiday in New York City",
    "Coimbatore\nKamal Haasan gifts car to Coimbatore’s first woman bus driver",
    "Technology\nWhat happens when social media firms monetise key features?",
    "Internet\nFive points to keep personal data safe in Android smartphones",
    "Tracing the arc of American ‘exception-ism’ for India",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Joining the hunt: India and the Artemis Accords",
    "Reduced ceiling, increased anger",
    "Laying the foundation for a future-ready digital India",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "A grand revival: on India-Egypt ties",
    "Tenets of unity: On the Opposition meet in Patna",
    "Explained | Understanding the Wagner mutiny",
    "NMC withdraws Graduate Medical Education Regulations, 2023",
    "Bank Nifty prediction today – June 27, 2023: Range remains valid",
    "Lulu Group to invest ₹10,000 crore in India over three years",
    "Failed ideas of Jawaharlal Nehru",
    "Memory and desire: How movie-watching changed over time",
    "India squad vs West Indies: Jaiswal, Ruturaj in Test squad; Pujara dropped; Samson in ODI team",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]