[
    "Kerala’s troublemaking tusker Arikompan still comes for rice",
    "A fountainhead of the people’s hopes and aspirations",
    "Sedition and its roots in rudeness as an offence",
    "When Roman merchants and soldiers came to Madurai to trade in pepper",
    "IPL Final 2023 | Gill gets ready to spoil Dhoni's farewell party",
    "Sengol row | Congress kept a sacred symbol as ‘walking stick’, says Amit Shah",
    "New Parliament building will make every Indian proud, says PM Modi",
    "Karnataka Cabinet expansion | 24 legislators take oath as Ministers",
    "PM Modi chairs Niti Aayog’s 8th Governing Council meet",
    "Terror conspiracy case: NIA raids multiple locations in MP's Jabalpur",
    "Only six religion options make it to next Census form",
    "2023-05-27T13:54:43+05:30\n-\nGadgets\niQOO launches Z7s 5G in India",
    "2023-05-27T13:06:29+05:30\n-\nMumbai\nShiv Sena leader stabbed to death in Thane district",
    "Mob and justice: On the Alwar lynching case verdict",
    "Alwar verdict flags need for stern steps to ensure justice in lynching cases",
    "A younger lot: On the 2023 French Open",
    "Without Nadal, there is no clear favourite at Roland-Garros",
    "India\n‘Souvenirs recorded Thiruvavaduthurai Adheenam’s handover of sceptre to Mountbatten’",
    "GadgetsVivo X90 Review | The power and performance of Pro",
    "Karnataka\nKarnataka Cabinet expansion today; 9 to become Ministers for first time",
    "Videos\nPM Modi in Australia | Do diaspora issues overshadow bilateral ties?",
    "Kerala\nTo sir, with love: from Kerala to Bhutan",
    "Movies\n‘Beau Is Afraid’ movie review: Ari Aster’s third film feels like a three-hour panic attack",
    "Understanding history is inevitable",
    "Industrial investments: The Kerala story",
    "Should States revert to the Old Pension Scheme?",
    "Economics that looks at lower half of the pyramid",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "PM Modi to launch special ₹75 coin to mark inauguration of new Parliament",
    "Astronauts launched save skylab",
    "China constructing model villages opposite the LAC, say sources",
    "Dairy war: Now, Tamil Nadu wants Amul to stop tapping Aavin milkshed area",
    "RBI imposes ₹84.50 lakh penalty on Central Bank of India",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]