[
    "Kumbh Mela at Tribeni: inventing tradition in West Bengal",
    "Chaos and congestion in front of metro stations in Bengaluru",
    "Kerala Spotlight | Project for schooling of migrant children at a crossroads",
    "Yet another blow to water-starved Rayalaseema",
    "India, France, UAE hold maiden maritime exercise in Gulf of Oman",
    "Providing piped potable water across India will avert 4,00,000 diarrhoea deaths: WHO study",
    "Tamil Nadu may go to court over Governor Ravi holding back Bills",
    "Elderly woman among three killed in attack on Kuki village; locals blame it on Meiteis",
    "Economy will grow in the range of 6.5%-7% till 2030: CEA",
    "Three killed as illegal mine collapses in Dhanbad",
    "2023-06-09T23:40:08+05:30\n-\nWorld\nU.S. court unseals Trump indictment in documents probe",
    "2023-06-09T23:11:17+05:30\n-\nOther States\nIn Haryana, BJP-JJP alliance treading on a tight rope",
    "Another low: On the latest provocation by Canadian Sikh separatist groups in Canada",
    "Canada is doing very little to address India’s concerns on Sikh extremism",
    "Economic emphasis: On India-Nepal ties",
    "The focus was on trade and development ties during the Nepali PM’s visit",
    "Videos\n9 years of Modi govt. | The successes and failures of India’s foreign policy",
    "GadgetsMotorola Edge 40 Review | Has an edge in the mid-range segment",
    "Movies\n‘Bloody Daddy’ movie review: Shahid Kapoor’s action film lacks force",
    "Movies\n‘Vimanam’ movie review: Samuthirakani shoulders a melodramatic tale",
    "Tamil Nadu\nMettur dam and the centenary of a milestone Cauvery agreement",
    "Getting railway safety back on track after Odisha",
    "The importance of small talk",
    "Do production-linked incentives for manufacturing work?",
    "Tackling the human-dog conflict",
    "Bridging the growing trust deficit in Manipur",
    "Ashok Gehlot tries out his welfare card",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "NExT exam scheduled for 2024, says Health Ministry",
    "‘Market coupling’ talk pulls down IEX stock 8.5 per cent",
    "Cabinet approves ₹89,000-cr revival package for BSNL",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "WTC Final: India avoids follow-on against Australia by crossing 270-run mark",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]