[
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Moderate alcohol consumption has no health benefits",
    "Will lab-grown meat find takers in India?",
    "Cluster munitions | Civilian killer",
    "SC Collegium reconsiders transfer of judge to M.P. HC, shifts him to Telangana",
    "Delhi riots 2020 | Court frames murder charges against six for burning a person alive",
    "R.N. Ravi unfit to be Governor, Stalin says in letter to President",
    "Objections overruled, Forest Bill goes to House unchanged",
    "16 killed as heavy rain triggers landslips, floods in North India",
    "Army officers say Manipur operations challenging",
    "West Bengal panchayat polls | Repolling in 600 booths today; death toll rises to 18",
    "2023-07-10T03:14:00+05:30\n-\nCricket\nLara expects players to come good against India",
    "Dangerously fanciful: On the judiciary, Rahul Gandhi’s conviction and the defamation case",
    "The High Court has made defamation sound like a horrific crime",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "The U.S. decision to send cluster munitions to Ukraine blurs all moral lines",
    "Tamil Nadu\n‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "Kerala\nHardly any captive elephant in Kerala has a non-Hindu name",
    "Technology\nExplained | What should you know about Meta’s social media app Threads?",
    "Society\nNikita Sonavane: justice for all",
    "Agri BusinessTomato-nomics —  Behind the kitchen staple’s soaring prices",
    "Photos\nIn Frames | Spiritual sojourn",
    "Books\nOnce upon a time in Goa | Heta Pandit’s new book ‘Stories from Goan Houses’",
    "KeralaSarpa app helps bring down snakebite deaths in Kerala",
    "The ‘Anna Bhagya’ fiasco and thinking beyond rice",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "On the draw — July 9, 2023",
    "Restoring the World Trade Organization’s crown jewel",
    "Due process clause or basic structure doctrine?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | Why is China limiting exports of raw materials?",
    "Explained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "Pro-Khalistan protest outside Indian High Commission passes off without incident",
    "Ominous signs: On attacks by pro-Khalistan elements on Indian interests",
    "Deliberations on to increase rate of permanent intake through Agnipath scheme",
    "Govt asks Google, FB, Microsoft, others to remove Blue Whale links",
    "Financial due diligence underway at IDBI Bank",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "Editor’s Note: Militarised Manipur stares at a civil war",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]