[
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Explained | What is the electronic interlocking system in railways?",
    "In Jerusalem, gay pride is conservative too",
    "Only 66% districts in country free of manual scavenging: Social Justice Ministry report",
    "NCB busts pan-India DarkNet-based drug cartel network",
    "U.S. NSA Jake Sullivan to visit New Delhi next week ahead of PM Modi’s state visit",
    "Odisha train accident | CBI gathers evidence; 83 bodies yet to be claimed",
    "2023-06-06T23:42:23+05:30\n-\nTelangana\nCongress will ensure KCR-mukth Telangana: Bhatti Vikramarka",
    "Tragic track: on the Balasore train accident and corrective measures by the Indian Railways",
    "The Indian Railways must not lose focus on safety as it expands its services",
    "Eye on oil: on oil prices and India",
    "India must bring pump prices of petrol and diesel in line with global oil prices",
    "IndiaNirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Internet\nHere is how you can find out if someone has blocked you on WhatsApp",
    "Gadgets\nSamsung Galaxy F54 5G Review | Alternative to the Galaxy A series",
    "Other States\nLakhs of tourists throng to Himachal Pradesh’s hill stations",
    "Other States\nHow an ISKCON temple near Balasore train accident site is helping victims, volunteers",
    "A word of advice to the Delhi police",
    "South Asia’s climate migration is a ticking bomb",
    "Denying States their own cultures",
    "How the reification of caste will not lead to a true politics of change and justice",
    "In the short term, stabilise the Line of Actual Control",
    "Explained | Why is there trouble in Kosovo again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Under-construction bridge collapses in Bihar’s Bhagalpur; probe ordered",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "UPI transaction limit set by Indian banks. See details here",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]