[
    "Chandrayaan 3 will aim for the Moon but look beyond it",
    "Gangs battling for control over port city leaves Ecuador broken",
    "Health Matters | Here, for the healthcare highs and lows",
    "In Kerala, Congress is back to square one",
    "Amit Shah holds ‘productive’ talks with U.S. envoy Eric Garcetti",
    "Asia Cup schedule finalised, India not going to Pakistan: BCCI secy Arun Dhumal",
    "GST Council to impose 28% tax on online gaming firms",
    "As U.S. looks to make India hub for ship repairs, India eyes major opportunity",
    "L&T and U.S. Navy sign five-year Master Ship Repair Agreement",
    "Amid tight security, 10th batch of over 7,800 pilgrims leave Jammu for Amarnath",
    "Tribe members should be part of supervisory teams: SC to Manipur",
    "China sends warplanes, navy ships towards Taiwan in forceful display",
    "2023-07-12T11:38:29+05:30\n-\nTelangana\nKey news developments from Telangana today",
    "Green washing: On amendments and the Forest (Conservation) Amendment Bill, 2023",
    "Changes to conservation laws must be backed by scientific evidence",
    "In transition: On the Caribbean tour and mettle in the Indian cricket team",
    "Indian cricket has a chance to test its bench strength in the Caribbean",
    "Food\nGoogle Doodle celebrates popular street food pani puri with intercative game",
    "ScienceAnthropocene, the new epoch marked by human impact on Earth, began in 1950s, say scientists",
    "Tamil Nadu\nVijay meets Vijay Makkal Iyakkam office-bearers to discuss future plans",
    "Movies\nSivakarthikeyan: If I don’t accept my failures, you won’t accept my victories",
    "EnvironmentOne more African cheetah, Tejas, dies in M.P.'s Kuno National Park",
    "Gadgets\nNothing launches Phone 2 with Snapdragon 8+ Gen 1 SoC",
    "Personal Finance\nRBI Floating Rate Bonds offer 8.05 per cent interest: Should you invest?",
    "BusinessHyundai introduces entry-level SUV Exter",
    "Life & Style\nHow urban India is reclaiming spaces for its communities",
    "Demographic transition and change in women’s lives",
    "The unseemly politics of the Uniform Civil Code",
    "On the Draw — July 11, 2023",
    "Citizen action for clean politicians, cleaner politics",
    "Don’t waste the wastewater",
    "Explained | What is the legal row between farmers and PepsiCo?",
    "Explained | North India’s monsoon mayhem is a confluence of factors",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Readers Editor-Terms of Reference",
    "Bookstore & Special Publications",
    "Five Mexicans, Nepali pilot killed in helicopter crash near Mount Everest in Nepal",
    "Alarm bells: on the violence in the West Bengal panchayat elections",
    "Dangerously fanciful: On the judiciary, Rahul Gandhi’s conviction and the defamation case",
    "Foxconn withdraws from India's semiconductor joint venture with Vedanta",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Decoupling possible across and within markets: Allianz’s Mohamed El-Erian",
    "Stock to buy today: Bharat Electronics (₹127.40)",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "Jumbo ties: Bhutan, Assam share a long history of joint domestication of elephants",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]