[
    "Inside Jharkhand’s single-teacher schools",
    "Controversies surrounding bike taxis refuse to die in Bengaluru",
    "In divided Turkey, Erdogan’s hold is weakened but not broken",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Women trapped in bomb-making ‘cottage industry’ in West Bengal‘s Khadikul",
    "As Law Minister, Kiren Rijiju took potshots at Indian judiciary",
    "Centre clears the appointment of two judges to the Supreme Court",
    "Congress ends uncertainty, picks Siddaramaiah as Karnataka CM",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "Hiroshima G-7 summit seeks to send out a strong message against Russia, says Japanese envoy",
    "G-20 meet | Several schools closed, mainstream politicians, minorities put on alert in Kashmir",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "The Congress must demonstrate the success of its inclusive vision in Karnataka",
    "Warming warning: On the World Meteorological Organization projections for temperature trends",
    "India must invest in infrastructure that boosts defence against disasters",
    "Podcast\nCan an integrated system of medicine work? | The Hindu Parley Podcast",
    "WorldAndy Warhol violated a photographer's copyright on image of Prince, Supreme Court rules",
    "Movies\nSeth Rogen on ‘Platonic’ and whether men and women can truly stay friends",
    "ScienceSci-Five | The Hindu Science Quiz: on stars",
    "Movies\n‘Anni Manchi Sakunamule’ movie review: All that drama over coffee",
    "KarnatakaWatch | Who are the Hakki Pikki tribes?",
    "Tamil Nadu\nStalin lays foundation for ‘Porunai Museum’ in Tirunelveli district",
    "A long-drawn test for India’s diplomatic skills",
    "Can an integrated system of medicine work?",
    "Kerala: an exemplary story in palliative care",
    "Money is about more than just survival",
    "‘Three capitals’ in Andhra Pradesh",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How methanol poisoning kills",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Office searched at 3 a.m.; sensitive files photocopied: Vigilance official",
    "Research scholar, trampled by wild elephant on Sacon campus near Coimbatore, dies",
    "Jallikattu upheld by SC | PETA India says exploring legal remedies",
    "Supreme Court upholds laws allowing Jallikattu, Kambala",
    "Sameer Wankhede gets protection from arrest for five days",
    "Pichai sells Chennai home where Sundar grew up",
    "Sensex, Nifty open higher on optimism over US debt ceiling talks",
    "Civil society organisations played key role in Congress victory",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]