[
    "The big, booming business of child-bride trafficking in Gujarat",
    "Kerala spotlight | Awaiting monsoon with hope and dread",
    "The slow descent of State-run varsities into oblivion in Andhra Pradesh",
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "Sedition law can be retained but with safeguards: Law Commission",
    "Judicial commission to probe Manipur ‘ethnic violence’, says Amit Shah",
    "Not seeking international support in our fight against the BJP, Rahul says in the U.S.",
    "Akhand Bharat mural in new Parliament triggers row in Nepal",
    "In FIR, wrestlers narrate traumatic experiences of sexual harassment by WFI chief",
    "9 Indians freed in Libya after intervention by Indian school principal",
    "GST collections rise 11.5% to cross ₹1.57 lakh crore in May",
    "2023-06-02T09:37:19+05:30\n-\nKerala\nTop Kerala news developments today",
    "2023-06-02T08:58:40+05:30\n-\nWorld\nU.S. Congress approves debt-limit suspension, averting default",
    "2023-06-02T08:56:49+05:30\n-\nTamil Nadu\nTop T.N. news developments today",
    "2023-06-02T08:23:36+05:30\n-\nIndia\nDaily Quiz | On World Milk Day",
    "Wrestling for justice: On the protest by the wrestlers",
    "The Wrestling Federation needs an overhaul in the wake of the allegations",
    "Riding the momentum: On National Statistical Office’s economic data and the economy",
    "Fiscal and monetary measures must remain growth supportive in the coming quarters",
    "Visakhapatnam\nThe slow descent of State-run varsities into oblivion in Andhra Pradesh",
    "PodcastIs there a clear north-south divide in Indian politics? | The Hindu Parley Podcast",
    "Tamil Nadu\nA Tamil Nadu village where Section 144 was in force for over a decade",
    "Science\nSci-Five | The Hindu Science quiz: On vaccines",
    "Music\nIlaiyaraaja turns 80 | What’s your Ilaiyaraaja story?",
    "GadgetsSamsung launches new range of OLED TVs",
    "Food\nWhat does it take to be an Instagram-worthy restaurant?",
    "Science\nChandrayaan-3 spacecraft reaches launch port ahead of next month’s launch",
    "IndiaDaily Quiz | On clock towers from across the world",
    "Karnataka\nDream Weaver: A visual journey into weaver birds’ struggles",
    "At the root of India’s manufacturing challenge",
    "Recasting the discourse on Muslim education",
    "Chennai’s most famous adopted son will live on for eternity",
    "Green Humour by Rohan Chakravarty",
    "Is there a clear north-south divide in Indian politics?",
    "Central Asian foreign policy multi-vectorism pays off",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Status quo in Turkey: On the new term for Recep Tayyip Erdoğan",
    "Akhand Bharat mural in new Indian Parliament triggers row in Nepal",
    "India-Russia joint venture on Vande Bharat trains hits hurdle",
    "Muslims seek 4% job quota in Meghalaya",
    "Stock to buy today: Hindustan Copper (₹113.20)",
    "Deloitte flags holes in Adani Ports deals, cites need for review",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Awards List: Orange cap, Purple cap, Emerging player, MVP, Fair Play full list of awards",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]