[
    "The View from India | Bilateral troubles at a multilateral forum",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "Shraddha Walkar murder: Delhi court frames charges against accused Aftab Poonawala",
    "Fitch pares India’s GDP growth forecast for this year to 6% from 6.2%",
    "KKR captain Nitish Rana fined ₹12 lakh for maintaining slow over-rate",
    "Situation improving in violence-hit Manipur; curfew relaxed in 11 districts",
    "At least 15 people killed, 25 injured as bus falls from bridge in Madhya Pradesh’s Khargone",
    "PFI conspiracy case | NIA raids six places in Tamil Nadu; 2 people detained",
    "SC to hear plea against Kerala High Court order on ‘The Kerala Story’ release on May 15",
    "2023-05-09T12:31:28+05:30\n-\nTechnology\nWhat to expect at Google I/O 2023",
    "The World Health Organization’s announcement gives hope, but there is a message of caution",
    "A tragedy foretold: on the boat accident in Kerala and lapses",
    "Kerala should ensure the maritime board is able to enforce regulations",
    "World\nSCO FM meet | India’s bilateral tensions vs multilateral ambitions",
    "Entertainment In conversation with actor Shanthnu",
    "Technology\nGoogle to pay New York Times $100 million over three years in a content deal: Report",
    "GadgetsSony WH-CH720N Review | Impresses on every front",
    "Tamil Nadu\nT.N. Class 12 results | Daughter of daily-wage labourer in Dindigul scores 600/600",
    "Tamil Nadu\nOrphaned tribal girl fights odds for higher education",
    "TechnologyWhat to expect at Google I/O 2023",
    "Other Sports\nDaily Quiz | On chess grandmasters",
    "India’s China strategy needs to be debated",
    "The Maoists are still a threat",
    "Not quite the Kerala story",
    "Will the greenback still be green?",
    "Buddhism, India’s soft power projection tool",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Huge scam exposed in the purchase of diesel by Railways",
    "A High Court does not have power to direct changes in Scheduled Tribes list: CJI",
    "Clarify social media post on ‘sovereignty’ attributed to Sonia, EC tells Cong.",
    "Iran hangs 2 people in rare blasphemy case as executions surge",
    "Supreme Court to hear plea for SIT into Manipur clashes on May 8",
    "Paytm aims to lead AGI revolution and achieve free cashflow positive, says Vijay Shekhar Sharma",
    "Mindspace REIT unfazed by Cognizant vacating office space in India, says CEO",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023: Playoffs qualification scenarios for all teams",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]