[
    "What is BBMP Restructuring Committee and how will it help the fast-growing Bengaluru?",
    "News Analysis | Eight months on, ‘Team Kharge’ is a work in progress ahead of 2024 poll",
    "Science for All | What is the chiral bose-liquid state?",
    "Rethink the retention of sedition",
    "PM Modi should chair all-party meeting, in Manipur, says Congress",
    "PM Modi’s U.S. visit Day 3 updates | ‘Both nations take pride in our diversity,’ says PM Modi",
    "All set for Opposition meeting in Patna on June 23",
    "GE, HAL sign MoU for manufacture of jet engines in India; U.S. Congress approval awaited",
    "2023-06-22T20:32:04+05:30\n-\nIndia\nAll set for Opposition meeting in Patna on June 23",
    "Overkill: On the Internet shutdown in Manipur",
    "The Manipur government’s decision to extend the Internet shutdowns lacks merit",
    "Heat and state: On a heatwave being only one half of the issue",
    "Poor living conditions have exacerbated the effects of heat waves",
    "DataData | UPI payments: relief for users, a headache for banks",
    "India\nDevrani sisters conferred National Florence Nightingale award",
    "Sci-TechSci-Five | The Hindu Science Quiz: On biologists",
    "Chennai\nTamil Nadu’s women cops turn sailors, complete 1000-kilometre expedition off Chennai coast",
    "HealthDaily Quiz | On Diabetes",
    "Bengaluru\nMontessori school under scanner after child hits classmate in Bengaluru",
    "More HIT than miss in India-Nepal ties",
    "Green Humour by Rohan Chakravarty",
    "Spare a thought for psychiatric caregivers too",
    "Semiconductor fab: the unfinished agenda",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "FeaturedPride Month | Queer cinema’s shackles in the mainstreamMoviesBhuvanesh ChandarREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A welcome step: on the Blinken-Xi meet in China",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "First look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "PM Modi’s gift to US First Lady: ‘Made in India’ 7.5 carat Green Diamond",
    "Wipro’s mega buyback offer opens today",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]