[
    "India\nMuseum failed to identify ‘Sengol’ because no one could translate Tamil engraving",
    "India\nDelhi University decides to drop Iqbal from political science syllabus",
    "EnvironmentIs Arikompan on its way back home?",
    "With its triangular design, India’s Parliament comes a full circle",
    "Army Chief in Manipur, to review situation on ground",
    "Army, Assam Rifles launch multiple search operations to track down armed insurgents",
    "ED attaches properties of Udhayanidhi Stalin Foundation",
    "Five years after SC judgment, only 9 out of 25 High Courts livestream proceedings",
    "India\nIn Frames | First look of new Parliament building to be inaugurated on May 28",
    "India‘Souvenirs recorded Thiruvavaduthurai Adheenam’s handover of sceptre to Mountbatten’",
    "Gadgets\nVivo X90 Review | The power and performance of Pro",
    "Videos\nPM Modi in Australia | Do diaspora issues overshadow bilateral ties?",
    "Kerala\nTo sir, with love: from Kerala to Bhutan",
    "Movies\n‘Beau Is Afraid’ movie review: Ari Aster’s third film feels like a three-hour panic attack",
    "Brass is copper and zinc, but better. How?",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Only six religion options make it to next Census form",
    "Temporary employment of Praveen Nettaru’s wife in Chief Minister Office withdrawn with others",
    "Mob and justice: On the Alwar lynching case verdict",
    "Fear of flooding forces Bengaluru techie to leave ₹1.08 crore villa and cough up rent in lakhs",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Know your minister: A look at the 24 MLAs sworn in to the Karnataka cabinet today",
    "India to push back against 'agenda-driven' global ranking firms: Sanjeev Sanyal",
    "No, Nehru did not mishandle Kashmir",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]