[
    "Other States\nHimachal explores possibility of growing cannabis",
    "Kerala\nKerala curios to take on Chinese souvenirs",
    "Other StatesNurse shortage ails U.P. health system",
    "India\nED searches 12 locations in money-laundering case against PMO ‘imposter’",
    "Quad leaders express deep concern over consequences of Ukraine war",
    "India will do its best to end the war, PM Modi tells Zelenksy",
    "BSF intercepts three Pakistani drones, seizes 2.6 kg drugs",
    "Top Sikh body extends support to protesting wrestlers",
    "2023-05-21T04:25:00+05:30\n-\nWorld\nWHO launches global network to detect infectious disease threat",
    "2023-05-21T04:19:45+05:30\n-\nWorld\nWeek-long ceasefire to begin in Sudan on May 22: U.S.",
    "2023-05-21T04:02:00+05:30\n-\nWorld\nPakistan trans activists to fight Islamic court rights rollback",
    "World\nMartin Amis, British writer of dark comedic novels, dies at 73: NYT",
    "Tamil NaduExplained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Health\nExplained | What is WHO’s advice on non-sugar sweeteners?",
    "Economy\nExplained | Will all overseas spends come under the tax net?",
    "World\nNorth-South Transport Corridor | Connecting continents",
    "TechnologyLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Movies\nAuschwitz drama 'Zone of Interest' marks director Glazer's first Cannes foray",
    "Tamil NaduTN boy braves disability, scores 437 in class X exam",
    "Kerala\nThe people and the government: the contemporary relevance of The Svadesabhimani",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | What are RBI regulations on green deposits?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "New Parliament opening | Not inviting President is an insult, says Opposition",
    "Science for All | What is the Petermann Glacier?",
    "PM Modi holds meeting with Japanese counterpart Kishida",
    "First Solar’s investment in India: To ship solar modules from October",
    "Freebies promised by Congress in Karnataka may be hard to sustain",
    "Impact of election results to go beyond electoral politics in Karnataka",
    "A spymaster speaks: Review of ‘A Life in the Shadows’ by A.S. Dulat",
    "IPL 2023 Points Table updated after KKR vs LSG: Lucknow qualifies for Playoffs with one-run win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]