[
    "In divided Turkey, Erdogan’s hold is weakened but not broken",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Kerala: an exemplary story in palliative care",
    "‘Three capitals’ in Andhra Pradesh",
    "Kiren Rijiju divested of Law portfolio, replaced by Arjun Ram Meghwal",
    "Tamil Nadu spurious liquor tragedy | CB-CID takes over probe",
    "SC stays West Bengal Govt order banning ‘The Kerala Story’, asks Centre to add a disclaimer",
    "Supreme Court upholds laws allowing Jallikattu, Kambala",
    "2023-05-18T16:28:31+05:30\n-\nScience\nEarth-sized alien planet gripped by widespread volcanism",
    "2023-05-18T16:00:00+05:30\n-\nTechnology\nWriting award-winning Indian fiction with ChatGPT",
    "Timely caution: On the Supreme Court’s exhortation to the Enforcement Directorate",
    "The top court has rightly cautioned probe agencies against crossing limits",
    "Predictable counter: On India’s reaction to U.S. reportage on religious persecution",
    "Introspection will do India good in areas where it faces international criticism",
    "Other States\n383 girls and women missing from Mumbai in 3 months, show police data",
    "KarnatakaWatch | Who are the Hakki Pikki tribes?",
    "Tamil Nadu\nRemembering John Sullivan, the man who brought tea to Udhagamandalam",
    "Internet\nGoogle to delete accounts that are inactive for over two years",
    "Movies'Spider-Man: Across the Spider-Verse' to release a day early in Indian theatres",
    "Food\nCheesy time at Hyderabad’s first cheese cafe",
    "Technology\nMicrosoft announces four new languages added to Microsoft Translator",
    "IndiaNatural disasters caused 2.5 million internal displacements in India in 2022, report says",
    "Technology\nGoogle to bring generative AI to its ad service: report",
    "Two judgments and the principle of accountability",
    "The rebooting of the Congress",
    "A desperate Israeli leader plays the security card",
    "The Dalit outreach of the BRS",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How methanol poisoning kills",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Tussle between DKS and Siddaramaiah crosses party lines and takes caste colour within BJP ranks",
    "Congress hits back at BJP for questioning delay in deciding Karnataka CM",
    "Sensex, Nifty open lower on weak cues amid profit booking",
    "LIC trades at 40% discount to issue price a year after listing",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after PBKS vs DC: Delhi Capitals dents Punjab Kings’ playoff chances",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]