[
    "When bicycles were a luxury and avenue trees the norm in Bengaluru",
    "The Indian polity, a democratic diagnosis",
    "A global order as technology’s much needed pole star",
    "Air India to send ferry flight to Russian town",
    "700 students face deportation from Canada | Punjab Minister Dhaliwal seeks Centre's intervention",
    "Sports Minister Anurag Thakur hold talks with protesting wrestlers",
    "Odisha train accident probe team member now submits a note of disagreement",
    "Manipur violence: Members of Kuki community hold protest outside Shah's residence",
    "Cyclone Biparjoy rapidly intensifies into severe cyclonic storm",
    "2023-06-07T12:27:27+05:30\n-\nIndustry\nIvan Menezes, India-born CEO of Diageo, passes away",
    "Useful first step: on probing the ethnic violence in Manipur",
    "Issues behind violence in Manipur are knotty but truth-telling should help",
    "A climax at the summit: on the World Test Championship in London today",
    "India will have to hold its nerve in the World Test Championship final to come out on top",
    "Kochi\nWhen FaceTime, WhatsApp came in handy for Kerala High Court in a land dispute case",
    "DelhiCost-effective e-bikes a hit in Delhi, but errant users pose threat to road safety",
    "Other States\nISKCON temple near Balasore train accident site turns place of refuge",
    "India\nThe falling bridges of Bihar: ten bridges collapsed in last three years",
    "IndiaWorld lived through a pandemic and India played a critical role: WHO scientist",
    "India\nOnly 66% districts in country free of manual scavenging: Social Justice Ministry report",
    "Internet\nHere is how you can find out if someone has blocked you on WhatsApp",
    "India\nPM Modi’s first school to be developed as an inspirational centre",
    "Seeing India’s energy transition through its States",
    "Denying States their own cultures",
    "South Asia’s climate migration is a ticking bomb",
    "Explained | What is the Kosovo-Serbia conflict all about? Why have tensions flared again?",
    "Explained | What will it take for an Indian city to become low carbon?",
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Explained | What is the electronic interlocking system in railways?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Nirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Eye on oil: on oil prices and India",
    "Ukraine accuses Russia of destroying major dam near Kherson, warns of widespread flooding",
    "Ambuja Cements, ACC withdraw membership from CMA",
    "UPI transaction limit set by Indian banks. See details here",
    "NCERT drops periodic table, Pythagorean theorem, and evolution from textbooks",
    "Failed ideas of Jawaharlal Nehru",
    "WTC Final 2023: Oval pitch report; India, Australia playing record; key stats",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]