[
    "He prostrated himself before his teachers",
    "The first time climate change ‘went viral’",
    "Urban apathy or out-of-sync voter lists responsible for low turnout in Bengaluru?",
    "‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "‘We can’t control the sky’, says Zelenskyy as he asks for fighter jets on U.K. visit",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "Turkey presidential election will go to second round",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Karnataka observers give feedback to Congress president Mallikarjun Kharge",
    "Exports fell to a six-month low in April; demand outlook gloomy",
    "Amit Shah meets Manipur CM, Meitei and Kuki leaders to restore peace in State",
    "2023-05-15T22:37:19+05:30\n-\nWorld\nThailand’s voters reject military-backed parties",
    "Lessons in a loss: On the 2023 Karnataka Assembly election result",
    "The Congress can learn more from the Bharatiya Janata Party’s loss than from its win",
    "Statistical succour: On the Consumer Price Index",
    "Policymakers cannot afford to drop their guard on inflation",
    "TechnologyChatGPT: your work colleague or your replacement?",
    "Travel\nFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "Fashion\nWatch | Walkthrough of NMACC’s ‘India in Fashion’ exhibition",
    "Gadgets\nOppo brings a new 5G phone powered by Snapdragon SoC",
    "EnvironmentThe first time climate change ‘went viral’ – 70 years ago",
    "Environment\nNYC skyscrapers turning to carbon capture to lessen climate change",
    "World\nAuschwitz museum begins emotional work of conserving 8,000 shoes of murdered children",
    "TechnologyNumber of apps installed with the term “AI Chatbot” jump; in-app revenue surge: Report",
    "Technology\nExplained | Gaps in Aadhaar-enabled Payment System (AePS) abused by cybercriminals",
    "Welfare spending has been getting a regular pruning",
    "This strategic-economic bloc will only tighten the leash",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Boat capsize in the Poorappuzha estuary | Tragedy at Tanur",
    "Diagnostic imaging of the Rajasthan Right to Health Act",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Karnataka DGP to be the next CBI Director, overtaking others",
    "Double-decker express train derails, no one hurt",
    "High drama at counting centre for Jayanagar constituency as BJP wins by 16 votes",
    "CMDA to shift private bus terminus from Koyambedu to city outskirts on Outer Ring Road",
    "Kotak vs Watsa: The battle for acquiring IDBI Bank intensifies",
    "Three top brokers face multiple probes including for money laundering, fraudulent trades",
    "Karnataka result shows India’s natural position is in the centre",
    "How a little-known portal got the Karnataka election results right",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]