[
    "Tamil Nadu\nThiruvavaduthurai Math | A renowned seat of Tamil language and culture",
    "India\nBrij Bhushan Sharan Singh | The controversial ‘Bahubali’",
    "IndiaHowrah-Chennai line has no Kavach system yet",
    "Society\nIn the era of unicorns, there are few takers for Sudha Murty’s brand of simplicity",
    "Odisha rail accident | Amidst discovery of more putrid bodies, death toll nears 300",
    "Odisha train accident: Teams working round the clock to restore tracks",
    "Maoist leader Katakam Sudarshan passes away in Chhattisgarh",
    "Former J&K CM Mehbooba Mufti issued passport after three years",
    "2023-06-04T15:10:05+05:30\n-\nIndia\nPeople of India are going to defeat BJP: Rahul Gandhi",
    "2023-06-04T14:53:09+05:30\n-\nEnvironment\nHow the climb up Mount Everest has changed in 70 years",
    "PhotosIn Frames | Shades of summer",
    "Society\nNavigating AI ‘hallucinations’ and other such irritants in the age of chatGPT",
    "ScienceFoucault pendulum | Earth’s rotation on display",
    "Health\nExplained | Why is India rethinking its anaemia policy?",
    "India\nExplained | What are the friction points on the LAC?",
    "TechnologyExplained | Are safeguards needed to make AI systems safe?",
    "Tamil Nadu\nIn Tamil Nadu, protecting land asset is more challenging than buying it",
    "Explained | What are the friction points on the LAC?",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Govt. wants to make sedition law more draconian: Congress",
    "Government bans 14 combination drugs used to treat common ailments",
    "Mural in new Parliament shows Ashoka empire: Government",
    "Chennai’s most famous adopted son will live on for eternity",
    "India deserves to have non-stop flights to more overseas destinations: Air India CEO",
    "What is KAVACH? Could it have prevented the Odisha train tragedy?",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "New forest laws and ‘development’ push: A prelude to a ‘land grab’ in India’s north-east?",
    "Thailand Open 2023: Lakshya Sen bows out with loss against Kunlavut Vitidsarn",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]