[
    "The View From India | The importance of Modi’s Indo-Pacific Tour",
    "Karnataka’s new, yet daunting, journey to development",
    "Pakistan’s establishment has an Imran Khan problem",
    "Panel probing Assam-Meghalaya border killings to resume examining witnesses",
    "Manipur tense but calm as fresh violence reported",
    "PM Modi meets top Australian business leaders in Sydney; invites investments in India",
    "First day of ₹2,000 note exchange: small queues seen at some branches",
    "BSF intercepts fifth Pakistani drone in four days along International Border in Punjab",
    "2023-05-23T12:20:54+05:30\n-\nMarkets\nRupee rises by 3 Paise to 82.81 against U.S. dollar",
    "2023-05-23T12:18:57+05:30\n-\nGadgets\nPoco F5 Review | A potential favourite in the mid-segment",
    "Solidarity for peace: on the Hiroshima meet of the G-7",
    "The G-7 must build a global consensus on the world’s challenges",
    "Slow withdrawal: on the RBI and the ₹2,000 note",
    "Without setting a deadline, the Reserve Bank of India could have withdrawn the notes gradually",
    "Bengaluru\nBusy with elections, Bengaluru caught unprepared for onset of monsoon",
    "IndiaEducation Ministry discontinues two Hindi awards",
    "Movies\nActor Sarath Babu dies after a prolonged illness",
    "Environment\nExplained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "Technology\nIs OpenAI fit to flag its own product’s plagiarism?",
    "GadgetsPoco F5 Review | A potential favourite in the mid-segment",
    "India\nData | Apathy of family and high costs hinder maternal healthcare",
    "Movies\n‘Jury Duty’ series review: All rise for television’s most sincere prank show",
    "WorldPasang Dawa summits Mt. Everest for record 27 times, ties with Kami",
    "Movies\n‘High Desert’ series review: Patricia Arquette anchors a chaotic dark comedy",
    "It’s time to ensure safer skies",
    "Hijacking G-20’s civil society forum",
    "Controversies roil Telangana’s universities",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "Explained | Global warming will likely soon cross 1.5º C. What will it mean for India?",
    "Explained | What is the ‘Open Network for Digital Commerce’?",
    "Explained | Understanding a human pangenome map",
    "FeaturedFair play, fair pay: The Indian music industry and royalties Music Saumya KaliaREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Capital quandary: On politics and Delhi’s administrative autonomy",
    "Judging jallikattu: On the Supreme Court verdict",
    "Under duress, BJP leader in Uttarakhand calls off daughter’s wedding with Muslim man",
    "Kuki groups to press for separation from Manipur, equal political status",
    "Canara Bank’s CGM appointed Deputy MD at IDBI Bank",
    "Jefferies gives ‘buy’ rating on two Adani companies",
    "Failed ideas of Jawaharlal Nehru",
    "1947: Madras Devadasis (Prevention of Dedication) Act passed",
    "IPL 2023 Orange Cap table update: du Plessis leads after league stage, Gill second with 680 runs",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]