[
    "India\nDelhi riots 2020 | Court frames murder charges against six for burning a person alive",
    "India\nGeneral election 2024 | Ensure sizeable number of MPs from South, Nadda tells BJP leaders",
    "Tamil NaduTamil Nadu Chief Minister Stalin complains to President Murmu about Governor Ravi",
    "Science\nExplained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Objections unheeded, Forest Bill goes to House",
    "16 killed as heavy rain triggers landslips, floods in North India",
    "Bengal panchayat polls | Repolling in 600 booths tomorrow",
    "SC Collegium accedes to Justice Sam Koshy request; transfers to Telangana",
    "2023-07-09T23:12:49+05:30\n-\nFootball\nEngland beats Spain to win dramatic Under-21 Euro final",
    "2023-07-09T23:12:29+05:30\n-\nOther States\nNo merit in land-for-jobs scam case, says Tejashwi Yadav",
    "2023-07-09T22:16:28+05:30\n-\nIndia\nObjections unheeded, Forest Bill goes to House",
    "Technology\nThreads | A new digital town square",
    "Agri BusinessTomato-nomics —  Behind the kitchen staple’s soaring prices",
    "Photos\nIn Frames | Spiritual sojourn",
    "Society\nNikita Sonavane: justice for all",
    "Books\nOnce upon a time in Goa | Heta Pandit’s new book ‘Stories from Goan Houses’",
    "WorldExplained | Why is China limiting exports of raw materials?",
    "Kerala\nSarpa app helps bring down snakebite deaths in Kerala",
    "ScienceSangam-age stud, bead unearthed in Tamil Nadu",
    "World\nExplained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | Why is China limiting exports of raw materials?",
    "Explained | The U.S. Supreme Court ban on race-based admissions",
    "Explained | What is football’s new offside rule as proposed by Arsene Wenger?",
    "FeaturedIndia’s #SilentReading movementLife & StyleSerish NanisettiREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Consumers can heave sigh of relief as Bescom announces 25-day billing cycle for June in Bengaluru",
    "Sensex tanks 505 points, Nifty closes lower at 19,330 on profit-taking after record rally",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "HDFC Bank-HDFC merger: What should you do with the stock of HDFC Bank now",
    "Canara Bank to sign ₹3,000 crore IT transformation deal",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]