[
    "Kumbh Mela at Tribeni: inventing tradition in West Bengal",
    "Chaos and congestion in front of metro stations in Bengaluru",
    "Kerala Spotlight | Project for schooling of migrant children at a crossroads",
    "Yet another blow to water-starved Rayalaseema",
    "After Kolhapur, Maharashtra’s Beed tense now after social media post on Aurangzeb",
    "Internet services partially resume in Maharashtra's Kolhapur",
    "CBI to probe if violence in Manipur was pre-planned",
    "SC finds no reason to urgently intervene in a plea against Manipur internet ‘ban’",
    "31 million more Indians became diabetic between 2019-2021, says study",
    "Sengol issue | BJP's 'fake factory' stands exposed, says Jairam Ramesh",
    "Former U.S. President Donald Trump charged in classified documents probe",
    "Another low: On the latest provocation by Canadian Sikh separatist groups in Canada",
    "Canada is doing very little to address India’s concerns on Sikh extremism",
    "Economic emphasis: On India-Nepal ties",
    "The focus was on trade and development ties during the Nepali PM’s visit",
    "Movies\n‘Bloody Daddy’ movie review: Shahid Kapoor’s action film lacks force",
    "Tamil NaduMettur dam and the centenary of a milestone Cauvery agreement",
    "Internet\nMarvel’s Spiderman 2 game finally gets a release date: Everything to know",
    "ScienceSaveetha Dental College under scanner for inflating ranking after ‘Science’ report",
    "Business\nExplained | Daily limit on UPI transactions",
    "Science\nChandrayaan-3 will be launched in mid-July: ISRO Chairman",
    "InternetRelive PSP nostalgia on your Android phone",
    "Podcast\nDo production-linked incentives for manufacturing work? | The Hindu Parley Podcast",
    "Getting railway safety back on track after Odisha",
    "The importance of small talk",
    "Do production-linked incentives for manufacturing work?",
    "Tackling the human-dog conflict",
    "Bridging the growing trust deficit in Manipur",
    "Ashok Gehlot tries out his welfare card",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "NExT exam scheduled for 2024, says Health Ministry",
    "Gitanjali Aiyar, popular Doordarshan news anchor, passes away",
    "‘Market coupling’ talk pulls down IEX stock 8.5 per cent",
    "Cabinet approves ₹89,000-cr revival package for BSNL",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "WTC Final: How many runs does India need to avoid follow-on?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]