[
    "Modi’s ‘rouble wise rupee foolish’ policy",
    "NCP split a reminder of succession battles in regional parties",
    "Design education is taking off in India",
    "New Supreme Court order puts Nepal one step closer to marriage equality",
    "SC agrees to hear bail plea of Sisodia in excise scam cases filed by CBI, ED",
    "West Bengal panchayat elections: repolling begins in 696 booths across 18 districts",
    "Indian shuttler Lakshya Sen wins Canada Open 2023",
    "Torrential rain, floods kill 22 across northern India; Army assistance sought in Punjab",
    "SC to hear on July 31 Uddhav’s plea against EC order giving Shinde party name, symbol",
    "China protests Dalai Lama meeting with visiting U.S. officials",
    "Six killed in China kindergarten attack",
    "2023-07-10T13:34:32+05:30\n-\nGadgets\nOppo Reno10 Pro+ 5G and Reno10 Pro 5G launched in India",
    "Dangerously fanciful: On the judiciary, Rahul Gandhi’s conviction and the defamation case",
    "The High Court has made defamation sound like a horrific crime",
    "Blurred lines: On the U.S.’s new move in the Ukraine war",
    "The U.S. decision to send cluster munitions to Ukraine blurs all moral lines",
    "WorldSyria revokes BBC’s media accreditation for ‘spreading fake news’",
    "Environment\nIn Varanasi, turtles help clean the Ganga",
    "Tamil Nadu\n‘Rajini fatigue’ will work against actor Vijay, say political leaders",
    "Visakhapatnam\nAyurvedic education system faces neglect in Andhra Pradesh and Telangana",
    "TechnologyComedian and authors sue Meta, OpenAI for copyright infringement",
    "KeralaHardly any captive elephant in Kerala has a non-Hindu name",
    "Technology\nExplained | What should you know about Meta’s social media app Threads?",
    "The ‘Anna Bhagya’ fiasco and thinking beyond rice",
    "Andhra Pradesh Congress | An attempt to regain a foothold",
    "On the draw — July 9, 2023",
    "Restoring the World Trade Organization’s crown jewel",
    "Due process clause or basic structure doctrine?",
    "Explained | Revised NCD guidelines skip focus on palliative care",
    "Explained | The promise and challenges of a carbon circular economy",
    "Explained | What is Microsoft’s planned ‘quantum supercomputer’?",
    "Explained | Why are India-Russia trade payments in crisis?",
    "Explained | Why is China limiting exports of raw materials?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Avadi police arrest woman in Bengaluru for cheating men on promise of marriage",
    "Taxpayers urged not to claim fraudulent returns, file revisions in case of wrong claims made",
    "Objections overruled, Forest Bill goes to House unchanged",
    "Consumers can heave sigh of relief as Bescom announces 25-day billing cycle for June in Bengaluru",
    "Financial due diligence underway at IDBI Bank",
    "Adani Transmission, Adani Green top bets for global investors",
    "Witch-hunt against Tejaswini Desai highlights dangers of being a teacher in India today",
    "What is really behind the violence in Manipur?",
    "Lakshya Sen staves off Li Shi Feng challenge to win Canada Open title",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]