[
    "India\nNo visible encroachment by China since 1962: Arunachal BJP team",
    "India\nBJP dictatorial and opportunistic, says Uddhav Thackeray",
    "IndiaBJP leader in Uttarakhand cancels daughter’s wedding with Muslim man after protests",
    "Other States\nNIA arrests banned Naxal outfit’s ‘supremo’ Dinesh Gope",
    "Kuki groups to press for separate administration in Manipur",
    "Khap announces women’s panchayat in front of new Parliament building on May 28",
    "23-year-old woman meets tragic end after car gets submerged in flooded underpass in Bengaluru",
    "Return of ₹2,000 notes to bolster bank coffers, money market liquidity, says research report",
    "2023-05-21T21:26:14+05:30\n-\nIndia\nBJP dictatorial and opportunistic, says Uddhav Thackeray",
    "India\nKarnataka Results 2023 | What it means for Congress, BJP and JD(S)",
    "ScienceHumans were using fire in Europe 50,000 years earlier than we thought",
    "Music\nFair play, fair pay: The Indian music industry and royalties",
    "Tamil Nadu\nWatch | 125th flower show in Udhagamandalam",
    "Photos\nIn Frames | Turkey at a crossroads",
    "ScienceNew technique welcomes calcium-41 to radiometric dating",
    "World\nNorth-South Transport Corridor | Connecting continents",
    "History & Culture\nThe naked philosophers: the reason some Indian ascetics renounced their robes",
    "TechnologyLinda Yaccarino | Twitter’s ‘velvet hammer’",
    "Movies\nVeteran actor Kamal Haasan to be felicitated at IIFA 2023",
    "Explained | Are Neanderthals to blame for the long and short of the human nose?",
    "Explained | Will all overseas spends come under the tax net?",
    "Explained | What is WHO’s advice on non-sugar sweeteners?",
    "Explained | How has the Supreme Court validated Tamil Nadu’s stand on jallikattu?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "China won’t attend Srinagar G-20 meet; Turkey, Saudi and Egypt too unlikely",
    "Unhappy with tussle in Congress, Jat leader Subhash Maharia rejoins BJP",
    "Science for All | What is the Petermann Glacier?",
    "Congress got Prashant Kishore protege to set narrative in Karnataka from war room in Bengaluru",
    "₹2,000 note will continue to be legal tender post-Sept 30, govt clarifies",
    "The making of Vande Bharat trains",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]