[
    "Kumbh Mela at Tribeni: inventing tradition in West Bengal",
    "Chaos and congestion in front of metro stations in Bengaluru",
    "Kerala Spotlight | Project for schooling of migrant children at a crossroads",
    "Yet another blow to water-starved Rayalaseema",
    "Monsoon sets in over Kerala after 7-day delay",
    "Man accused of dismembering live-in partner sent to police custody",
    "Not clear if Sengol was presented to Mountbatten, says Thiruvavaduthurai Adheenam head",
    "Former U.S. President Donald Trump charged in classified documents probe",
    "CBI to probe if violence in Manipur was pre-planned",
    "Trump indicted: What to know about the documents case and what's next",
    "Filed false complaint against WFI chief due to anger over match: minor wrestler’s father",
    "Another low: On the latest provocation by Canadian Sikh separatist groups in Canada",
    "Canada is doing very little to address India’s concerns on Sikh extremism",
    "Economic emphasis: On India-Nepal ties",
    "The focus was on trade and development ties during the Nepali PM’s visit",
    "Tamil Nadu\nMettur dam and the centenary of a milestone Cauvery agreement",
    "BusinessExplained | Daily limit on UPI transactions",
    "Bengaluru\nChandrayaan-3 will be launched in mid-July: ISRO Chairman",
    "Podcast\nDo production-linked incentives for manufacturing work? | The Hindu Parley Podcast",
    "EnvironmentWorld Oceans Day | What ails our oceans, and how to protect them",
    "India\n‘Soul of Steel’ Himalayan endurance challenge enters final phase",
    "Telangana\nGalwan Valley hero’s statue unveiled in Kodad in Telangana",
    "ScienceSci-Five | The Hindu Science quiz: On climatic zones",
    "Internet\nWhatsApp introduces Channels: what is it",
    "Getting railway safety back on track after Odisha",
    "The importance of small talk",
    "Do production-linked incentives for manufacturing work?",
    "Green Humour by Rohan Chakravarty",
    "Bridging the growing trust deficit in Manipur",
    "Ashok Gehlot tries out his welfare card",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Explained | Why is the U.S. SEC cracking down on crypto exchanges?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Deadly billboards: On billboards and their regulation",
    "NExT exam scheduled for 2024, says Health Ministry",
    "Lionel Messi joins Inter Miami, rejects Barcelona return",
    "NIIT completes demerger of company",
    "IPO screener: IKIO Lighting issue closes today",
    "Climate talks in Bonn ahead of COP28 inspire little optimism",
    "‘The restoration for Ishanou took a year’: Shivendra Singh Dungarpur",
    "When can Messi play his first match for Inter Miami?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]