[
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "Data | Antarctic sea ice cover hits record lows on many days of 2023",
    "The show-stoppers who made it a riveting spectacle",
    "India’s manufacturing PMI hits highest level since October 2020 in May",
    "Telangana formation day | The growth of South Central Railway",
    "IAF trainer aircraft crashes near Chamarajanagar in Karnataka; pilots eject safely",
    "According to IAF, the pilots were on a routine training sortie when the incident occurred",
    "Manufacture of 120 Vande Bharat trains by TMH-RVNL consortium runs into problems",
    "SIA raids underway at multiple locations in Kashmir in bank guard killing case",
    "2023-06-01T14:46:24+05:30\n-\nIndustry\nElon Musk reclaims position as world's richest person",
    "2023-06-01T14:31:00+05:30\n-\nIndia\nIPS officer Rajiv Singh appointed new Manipur DGP, replaces",
    "Uncertain showers: On monsoon information and the Indian farmer",
    "Farmers need to be given timely, accurate information on rainfall",
    "Status quo in Turkey: On the new term for Recep Tayyip Erdoğan",
    "Erdogan must right the wrongs of the past and offer a new inclusive beginning",
    "Food\nWhat does it take to be an Instagram-worthy restaurant?",
    "IndiaDaily Quiz | On clock towers from across the world",
    "Karnataka\nDream Weaver: A visual journey into weaver birds’ struggles",
    "Movies\nWatch | In conversation with director Sashi Kiran Tikka",
    "Life & Style\nA ‘drive experience’ for Lamborghini car owners through Chennai",
    "Kerala\nA woman police officer in Kerala who fought many battles for gender equality",
    "KarnatakaMiraculous escape from cobra",
    "Internet\nHow to post your voice as a status update on WhatsApp",
    "A parliamentary democracy or an executive democracy",
    "In Bengal, court orders dominate politics",
    "Is India missing the graphene bus?",
    "Green Humour by Rohan Chakravarty",
    "Biodiversity is us and we are biodiversity",
    "Using Buddhism as a tool of soft power",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "Adani Transmission Q4 net profit jumps 85% to ₹439.60 crore",
    "BJP launches all-out attack against Rahul Gandhi for his remark against PM Modi",
    "Wrestlers’ protest | Naresh Tikait announces mahapanchayat in Muzaffarnagar on June 1",
    "Go First urges DGCA not to cancel AOP",
    "Yes Bank unveils new brand logo",
    "1947 ‘sengol’ story just fiction based on manufactured lies: N. Ram",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]