[
    "How are Indian languages faring in the age of AI and language models?",
    "When Einstein thought he was wrong but Feynman convinced physicists otherwise",
    "The View from India | The reign of Erdogan continues",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "Shahbad Dairy murder: Sahil bought knife from Haridwar 15 days earlier",
    "Amit Shah appeals for 15-day peace in Manipur",
    "Despite Gehlot-Pilot truce, key ‘issues’ are yet to be ironed out",
    "Wrestlers defer plan to immerse medals",
    "NCERT removes Khalistan reference from textbook",
    "Opposition parties together at national level, says Mamata",
    "Universal cover: On the IRDA’s all-in-one insurance policy",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "CSK’s win over Titans showcased the best and the latest of IPL",
    "Cricket\nHow the old found sanctuary and the new blossomed under CSK umbrella",
    "CricketFitness and adaptability are the keys; how about the Dhoni Cup?",
    "Cricket\nSai Sudharsan — all class and confidence",
    "Science\nIndian scientists discover new exoplanet with mass 13 times that of Jupiter",
    "World\nElizabeth Holmes enters Texas prison to begin 11-year sentence",
    "Kerala\nWatch | What was the Vaikom Satyagraha all about?",
    "Movies\nMartin Scorsese meets Pope Francis, announces film about Jesus",
    "MoviesMichelle Lee: John Wick wouldn’t fight the way he did without the stunt team",
    "Movies\nComing to Netflix: ‘Scoop’, ‘Never Have I Ever Season 4’, ‘Arnold’, ‘Bloodhounds’, and more",
    "The short history of a large note",
    "Using Buddhism as a tool of soft power",
    "Rethinking alliances in Andhra",
    "The BJP outreach to Saivites",
    "Unboxing the ‘export turnaround’ in India’s toy story",
    "From Master of the Roster to Master of all Judges?",
    "Explained | The SC ruling on jallikattu",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "FeaturedWatch | Hansal Mehta and team on ‘Scoop’ MoviesShilajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IPL 2023 Final | Chennai Super Kings beats Gujarat Titans by five wickets to win fifth title",
    "At least 10 Vaishno Devi pilgrims dead, 57 injured as bus falls down from bridge in Jammu",
    "16-year-old stabbed to death by boyfriend in Delhi, accused arrested",
    "CAG re-elected WHO external auditor with a thumping majority",
    "FLDG guidelines expected in second round of digital lending regulations",
    "1948: Assassination of Mahatma Gandhi",
    "Advani called it ‘the Congressisation of the BJP’",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]