[
    "A ground view of the Indian Space Policy 2023",
    "The uprising of 1857, and Meerut’s role in the first war for India’s Independence",
    "Data | Most Indian women who got divorced were pushed towards it",
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Higher pension: EPFO directs offices to calculate dues with interest",
    "Pakistan anti-corruption watchdog gets 8-day remand of Imran Khan",
    "Assailant stabs house surgeon to death in Kottarakara government taluk hospital",
    "Over 72% turnout in peaceful Karnataka Assembly polls",
    "Predictably, Bengaluru’s turnout in the 28 constituencies remained dismal at an estimated 54.14%",
    "White House announces PM Modi’s state visit to Washington DC in June",
    "Third low-intensity explosion in Punjab’s Amritsar",
    "“I would have been equally angry”: U.K. High Commissioner about attack on India’s London mission",
    "2023-05-11T08:35:34+05:30\n-\nOther States\nThird low-intensity explosion in Punjab’s Amritsar",
    "2023-05-11T04:14:00+05:30\n-\nOther States\nGujarat reeling under heatwave",
    "Pawar play: On the churn in politics in Maharashtra",
    "Maharashtra might see a fresh churn as the elections approach",
    "Snap judgement: On India’s Project Cheetah",
    "Every birth or death shouldn’t be seen as success or failure of Project Cheetah",
    "Business\n Is India’s growing reliance on Russian supplies a long-term risk?",
    "IndiaICMR conducts successful trial run of blood bag delivery under iDrone initiative",
    "Chennai\nAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "World\nDaily Quiz | On the rulers of Great Britain",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Technology\nElon Musk announces Twitter encrypted direct messages; voice and video chat coming soon",
    "Movies‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "No answers even months after atrocity",
    "Pokhran-II: A moment of profound epiphany",
    "The fallout of Putin helping make NATO ‘great again’",
    "Upsetting the apple cart in Himachal",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Huge scam exposed in the purchase of diesel by Railways",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Amit Shah’s remark that Tagore composed ‘national songs’ of 2 countries kicks up row",
    "Spectre of disease pushes farmer to decimate 15-acre farm of 1,350 mango trees in Krishnagiri",
    "It depends on who is giving the rating: Centre on India’s rank in press freedom index",
    "‘Union Bank aims to be third-largest PSB by 2025’",
    "LatentView Analytics posts highest-ever full year revenue at ₹539 crore in FY23",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Real Madrid vs Manchester City LIVE Streaming info: When, where to watch Champions League?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]