[
    "All-in-one policy plan to spread insurance in India",
    "Data | One in seven Indian primary schools run by a lone teacher",
    "Twin reservoirs of Hyderabad shrivel in realty storm",
    "Systematic incitement plan in Maharashtra",
    "Karnataka Cabinet expansion | CM Siddaramaiah meets Rahul, Sonia in Delhi",
    "Sengol | Evidence thin on govt’s claims about the sceptre",
    "SC rejects plea for inauguration of new Parliament building by President Murmu",
    "PM Modi to launch special ₹75 coin to mark inauguration of new Parliament",
    "Former Delhi Minister Satyendar Jain granted interim bail on medical grounds",
    "IT searches under way on the premises linked to T.N. Minister Senthilbalaji",
    "2023-05-26T16:26:12+05:30\n-\nMarkets\nEquity markets rally for second day; Sensex jumps 1%",
    "2023-05-26T15:21:37+05:30\n-\nIndia\nNine years of Modi government | Congress asks PM nine questions",
    "Lost opportunity: On the acrimony over the inauguration of the new Parliament building",
    "The inauguration of Parliament building should have marked a fresh start",
    "After Bakhmut: On the latest phase in the Ukraine war",
    "Russia and Ukraine seem determined to continue their high cost war",
    "Technology\nYouTube is removing Stories to focus on Shorts, long-form, and lives",
    "MusicA night at the Melattur Bhagavata Mela utsavam",
    "Andhra Pradesh\nDeath traps on National Highways in Andhra Pradesh",
    "Tamil Nadu\nJallikattu — continuity of a tradition from Indus Valley to Keezhadi",
    "Music\nDaily Quiz | On life and works of American singer Tina Turner",
    "GadgetsNikon Z8 mirrorless camera launched in India",
    "Technology\nHow to send 2GB size videos, images and audio through WhatsApp",
    "Technology\nGoogle Bard Chatbot Review | Prematurity of launch clearly shows",
    "ScienceISRO chief hails role of Sanskrit in India becoming knowledge society since Vedic times",
    "Podcast\nShould States revert to the Old Pension Scheme? | The Hindu Parley Podcast",
    "An ordinance, its constitutionality, and scrutiny",
    "Understanding history is inevitable",
    "Should States revert to the Old Pension Scheme?",
    "Economics that looks at lower half of the pyramid",
    "Industrial investments: The Kerala story",
    "Explained | What is the EU’s carbon border adjustment mechanism?",
    "Explained | What has India done to curb unnecessary hysterectomies?",
    "Explained | Why do judges recuse themselves and how? A look at recent judicial recusals",
    "Explained | What is the National Medical Devices Policy, 2023?",
    "FeaturedThe resurgence of Kannada parallel cinemaMoviesVivek M.V.READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Sengol | Evidence thin on government’s claims about the sceptre",
    "Plea in Supreme Court on President not inaugurating the new Parliament building",
    "Dairy war: Now, Tamil Nadu wants Amul to stop tapping Aavin milkshed area",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]