[
    "A ground view of the Indian Space Policy 2023",
    "The uprising of 1857, and Meerut’s role in the first war for India’s Independence",
    "Data | Most Indian women who got divorced were pushed towards it",
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Exit polls give edge to Congress in high-stakes Karnataka battle",
    "Third low-intensity explosion in Punjab’s Amritsar, 5 arrested",
    "Sena vs Sena | A series of signs that Supreme Court viewed Shinde’s route to power with skepticism",
    "Deep depression over Bay of Bengal intensifies into cyclonic storm Mocha",
    "NIA conducts raids in Delhi’s Shaheen Bagh in Kerala train arson case",
    "2023-05-11T12:36:17+05:30\n-\nKolkata\nT.S. Sivagnanam sworn in as Calcutta HC Chief Justice",
    "Pawar play: On the churn in politics in Maharashtra",
    "Maharashtra might see a fresh churn as the elections approach",
    "Snap judgement: On India’s Project Cheetah",
    "Every birth or death shouldn’t be seen as success or failure of Project Cheetah",
    "Movies\nDeepika Padukone appears on cover of TIME magazine",
    "GadgetsGoogle launches Pixel 7a with Tensor G2 chip",
    "India\nGoogle historical satellite imagery disappears for India",
    "Karnataka ElectionsVote from Home: Missed opportunity for many and a choice not picked by others",
    "Movies\nDisney+ loses 4 million subscribers, content to be dropped from the streaming platform",
    "Other StatesThe struggle to keep a 124-year-old railway station in Odisha alive",
    "Cricket\nIPL 2023 | Don't make me run a lot: M.S. Dhoni",
    "Pokhran-II: A moment of profound epiphany",
    "No answers even months after atrocity",
    "The fallout of Putin helping make NATO ‘great again’",
    "Upsetting the apple cart in Himachal",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Higher pension: EPFO directs offices to calculate dues with interest",
    "Huge scam exposed in the purchase of diesel by Railways",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Over 72% turnout in peaceful Karnataka Assembly polls",
    "Google historical satellite imagery disappears for India",
    "‘Union Bank aims to be third-largest PSB by 2025’",
    "GST: FinMin lowers e-invoicing threshold to ₹5 crore from August 1",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]