[
    "World\nEx-Scottish leader Nicola Sturgeon arrested in probe over governing SNP’s finances",
    "Other States\nSupriya Sule asks critics to assess performance before questioning her on nepotism",
    "History & CultureWhy the Indian museum makeover is important",
    "Open Page\nWomen in the corner room",
    "Manipur extends Internet ban till June 15",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "AAP ‘Maha Rally’ | Delhi CM Arvind Kejriwal says will oppose Centre’s ordinance and save democracy",
    "2023-06-11T20:35:47+05:30\n-\nIndia\nGovt. to complete 3D digitisation of museums by end of 2023",
    "2023-06-11T19:52:19+05:30\n-\nWorld\n35 people missing after Ukraine flood: minister",
    "WorldUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Football\nManchester City win first Champions League title",
    "World\nLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "WorldPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil Nadu\nBuckingham Canal | A waterway once is sewage-carrier now",
    "ScienceIIT-Madras generates hydrogen from seawater using solar energy",
    "Andhra Pradesh\nA.P. forest officials release 4.32 lakh Olive Ridley turtles into sea",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Dear Deputy CM, nice thought, but an elite task force is not what Bengaluru needs’",
    "Extremely severe cyclonic storm 'Biparjoy' to cross Saurashtra-Kutch coast on June 15: IMD",
    "Chaos and congestion in front of Bengaluru metro stations",
    "Reservation for Muslims is against the Constitution, says Amit Shah",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "How TVS ILP helped Ather Energy swiftly start production at Hosur plant",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]