[
    "Odisha train accident | The trauma after a tragedy on tracks",
    "Kumbh Mela at Tribeni: inventing tradition in West Bengal",
    "Chaos and congestion in front of metro stations in Bengaluru",
    "Kerala Spotlight | Project for schooling of migrant children at a crossroads",
    "Economy on autopilot, won’t overheat for years: CEA",
    "Background checks will curb ‘love jihad’, says Uttarakhand CM",
    "Arunachal Pradesh anti-poaching camp destroyed by mob",
    "Elderly woman among three killed in attack on Kuki village",
    "Govt will regulate AI if it brings harm to users, says Union Minister",
    "Boris Johnson quits as MP after being told he will be sanctioned for misleading Parliament",
    "U.S. court unseals Trump indictment in documents probe",
    "2023-06-10T03:17:00+05:30\n-\nIndia\nChinook copters join efforts to restore path to Amarnath",
    "Unwavering focus: On the Monetary Policy Committee’s approach to policy",
    "Price stability is a public good and must remain a non-negotiable goal",
    "Complicated situation: On Donald Trump’s indictment and American politics",
    "With Donald Trump’s indictment, the U.S. polity will see further polarisation",
    "Science\nIndian, Korean researchers develop light-powered supercapacitors",
    "Videos9 years of Modi govt. | The successes and failures of India’s foreign policy",
    "Gadgets\nMotorola Edge 40 Review | Has an edge in the mid-range segment",
    "Movies\n‘Bloody Daddy’ movie review: Shahid Kapoor’s action film lacks force",
    "Movies\n‘Vimanam’ movie review: Samuthirakani shoulders a melodramatic tale",
    "Tamil NaduMettur dam and the centenary of a milestone Cauvery agreement",
    "The necessity of electricity distribution companies",
    "A pragmatic approach, for better India-Nepal ties",
    "The importance of small talk",
    "Ashok Gehlot tries out his welfare card",
    "Do production-linked incentives for manufacturing work?",
    "Bridging the growing trust deficit in Manipur",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Explained | The China-US race to the Moon",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Why is PM Modi mum on parade hailing Indira Gandhi’s assassination, asks Congress",
    "Monsoon sets in over Kerala after 7-day delay",
    "Former U.S. President Donald Trump charged in classified documents probe",
    "Not clear if Sengol was presented to Mountbatten, says Thiruvavaduthurai Adheenam head",
    "Jaishankar kicks off BJP’s outreach bid, woos Sikhs",
    "HAL board meets on June 27 to consider stock split",
    "Stock to buy today: NTPC (₹182.05)",
    "Odisha train tragedy raises questions about rail safety and signals system",
    "Singapore Open 2023: Satwik-Chirag and Jolly-Gopichand suffer first-round losses",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]