[
    "Explained | How can the woes of Delhi Metro users be solved?",
    "Explained | Why underpasses in Bengaluru see flooding in monsoon",
    "Explained | What is the electronic interlocking system in railways?",
    "In Jerusalem, gay pride is conservative too",
    "Kochi Corporation introduces suction-cum-jetting machine to unclog city drains",
    "If using fans is expensive, then sit under a tree, advises Assam Speaker",
    "After Odisha tragedy, Railways to secure signalling equipment with double locks",
    "3 killed, 4 injured in fresh violence in Manipur's Imphal West district",
    "Nirmala Lakshman appointed Chairperson of The Hindu Group Publishing Private Limited",
    "Depression over Arabian Sea likely to intensify into cyclonic storm: IMD",
    "2023-06-06T10:32:47+05:30\n-\nMarkets\nEquity markets lower in highly volatile trade",
    "2023-06-06T10:32:19+05:30\n-\nTechnology\nElon Musk says China will initiate AI regulations",
    "2023-06-06T10:13:15+05:30\n-\nMarkets\nRupee rises 7 paise to 82.56 against U.S. dollar",
    "2023-06-06T10:04:36+05:30\n-\nTechnology\nWhat it's like to try Apple's new Vision Pro headset",
    "Tragic track: on the Balasore train accident and corrective measures by the Indian Railways",
    "The Indian Railways must not lose focus on safety as it expands its services",
    "Eye on oil: on oil prices and India",
    "India must bring pump prices of petrol and diesel in line with global oil prices",
    "KeralaDepiction of naked body cannot be termed as obscene or sexually explicit, says Kerala HC",
    "Videos\nWatch | Why did this Maharashtra temple town witness communal tension?",
    "Movies\nTrailer of Anil Kapoor-Aditya Roy Kapur’s ‘The Night Manager Part 2’ out",
    "Technology\nU.S. SEC sues Binance, founder Zhao alleging securities law violations",
    "KarnatakaThis Bengaluru-based start-up generates water from thin air",
    "Tamil Nadu\nAs more opt for their own private space, senior living real estate segment opens up",
    "Technology\nLinda Yaccarino to take over as Twitter CEO officially this week",
    "MoviesVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "A word of advice to the Delhi police",
    "South Asia’s climate migration is a ticking bomb",
    "Denying States their own cultures",
    "How the reification of caste will not lead to a true politics of change and justice",
    "In the short term, stabilise the Line of Actual Control",
    "Explained | The decade-long search for a rare Higgs boson decay",
    "Explained | How KFON aims to bridge the digital divide in Kerala",
    "Explained | Why does North Korea want spy satellites?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Eyeing prime land | In Tamil Nadu, protecting land asset is more challenging than buying it",
    "Amit Shah meets wrestlers at his official residence, tells them to ‘trust the investigation’",
    "A vote for change: On the result of the Thai parliamentary election",
    "What is KAVACH? Could it have prevented the Odisha train tragedy?",
    "Mutual funds bought and sold these top stocks: Do you own any?",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Failed ideas of Jawaharlal Nehru",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]