[
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Same-sex marriage: gender may be fluid, but the idea of mother cannot be, Ministry tells SC",
    "Pakistan anti-corruption watchdog gets 8-day remand of Imran Khan",
    "Assailant stabs house surgeon to death in Kottarakara government taluk hospital",
    "Over 72% turnout in peaceful Karnataka Assembly polls",
    "Predictably, Bengaluru’s turnout in the 28 constituencies remained dismal at an estimated 54.14%",
    "White House announces PM Modi’s state visit to Washington DC in June",
    "“I would have been equally angry”: U.K. High Commissioner about attack on India’s London mission",
    "Higher pension: EPFO directs offices to calculate dues with interest",
    "2023-05-10T21:55:17+05:30\n-\nIndia\nBypolls held in one Lok Sabha, four Assembly seats",
    "Pawar play: On the churn in politics in Maharashtra",
    "Maharashtra might see a fresh churn as the elections approach",
    "Snap judgement: On India’s Project Cheetah",
    "Every birth or death shouldn’t be seen as success or failure of Project Cheetah",
    "Business\n Is India’s growing reliance on Russian supplies a long-term risk?",
    "IndiaICMR conducts successful trial run of blood bag delivery under iDrone initiative",
    "Chennai\nAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "World\nDaily Quiz | On the rulers of Great Britain",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Technology\nElon Musk announces Twitter encrypted direct messages; voice and video chat coming soon",
    "Movies‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "A ground view of the Indian Space Policy 2023",
    "No answers even months after atrocity",
    "Pokhran-II: A moment of profound epiphany",
    "The fallout of Putin helping make NATO ‘great again’",
    "Upsetting the apple cart in Himachal",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Spectre of disease pushes farmer to decimate 15-acre farm of 1,350 mango trees in Krishnagiri",
    "It depends on who is giving the rating: Centre on India’s rank in press freedom index",
    "IT Ministry to examine claim of WhatsApp accessing mic in background",
    "The Kerala Story ban | SC agrees to hear filmmaker’s plea against West Bengal ban on May 12",
    "El Niño is coming, and ocean temperatures are already at record highs",
    "SRF to set up aluminium foil manufacturing unit",
    "Editorial. Accountants rightly under PMLA lens for reporting transactions",
    "10,000 deliveries in 33 years: Tamil Nadu midwife’s remarkable service wins all-round applause",
    "The Great Land Grab in Jammu and Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]