[
    "A Cabinet reshuffle in Tamil Nadu",
    "The View from India | Chaos in Pakistan",
    "Delving into the verdict on the Shiv Sena issue",
    "Changes in recruitment system ended corruption, nepotism, says PM Modi",
    "Meta introduces WhatsApp Chat Lock feature",
    "Karnataka govt. formation | KPCC chief D.K. Shivakumar arrives at Kharge’s residence",
    "Lt. Gen. Devendra Sharma takes over as Western Command’s Chief of Staff",
    "SC requests Bombay High Court to hear NCP leader Nawab Malik's bail plea in ED case",
    "Telecom Bill should be finalised by July: Vaishnaw",
    "2023-05-16T16:49:52+05:30\n-\nWorld\nUkraine's First Lady meets with South Korea's Yoon",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "Science\nThe problem with improved cooking stoves",
    "TechnologyAmazon announces new ‘The Lord of the Rings’ multiplayer game",
    "Kerala\nKerala shudders at yet another brutal lynching of migrant labourer",
    "Andhra Pradesh\nTTD announces specific dates for release of darshan tickets at Tirumala temple",
    "Technology\nHow do AI text-to-image generators work?",
    "Karnataka‘Gauri’ bags ‘Best Long Documentary Award’ at South Asian Film Festival of Montreal",
    "Karnataka\nWhen a conductor’s past experience in a hospital labour ward came in handy on a bus",
    "TravelFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "India\n‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Evaluating DNA report as evidence",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Manoj Soni to take oath as UPSC chairman on Tuesday",
    "Fatigue in long Covid patients found to impact their nervous system",
    "SEBI proposes tighter norms for delisting debt securities",
    "Centre appoints Ravneet Kaur as CCI Chairperson",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]