[
    "The View from India | Bilateral troubles at a multilateral forum",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Explained | What did India’s first national water-body census find?",
    "ECI says seizures worth ₹375.61 made in Karnataka since the Model Code of Conduct was enforced",
    "Arab trains to carry Indian goods to Haifa, says Israeli Foreign Minister",
    "SC says India is ranked 161 in press freedom; govt. says it depends on who does the ranking",
    "No end to the humiliations of frisking for NEET aspirants",
    "TN CM Stalin drops Nasar from Cabinet; T.R.B. Rajaa to be sworn-in Minister on May 11",
    "Former Pakistan PM Imran Khan arrested during court appearance: police",
    "2023-05-09T22:45:58+05:30\n-\nWorld\nActivists block Russian ambassador at Soviet memorial in Warsaw",
    "2023-05-09T22:25:20+05:30\n-\nIndia\nNo end to the humiliations of frisking for NEET aspirants",
    "The World Health Organization’s announcement gives hope, but there is a message of caution",
    "A tragedy foretold: on the boat accident in Kerala and lapses",
    "Kerala should ensure the maritime board is able to enforce regulations",
    "Tamil NaduPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Movies\n‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "Technology\nElon Musk warns that Twitter will purge unused accounts",
    "WorldSCO FM meet | India’s bilateral tensions vs multilateral ambitions",
    "Technology\nGoogle to pay New York Times $100 million over three years in a content deal: Report",
    "India’s China strategy needs to be debated",
    "The Maoists are still a threat",
    "Not quite the Kerala story",
    "Will the greenback still be green?",
    "Buddhism, India’s soft power projection tool",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What is Bluesky and how does it affect Twitter?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Huge scam exposed in the purchase of diesel by Railways",
    "A High Court does not have power to direct changes in Scheduled Tribes list: CJI",
    "Rahul Gandhi takes BMTC bus in Bengaluru, tells commuters about Congress promises to women",
    "Spectre of disease pushes farmer to decimate 15-acre farm of 1,350 mango trees in Krishnagiri",
    "How to download voter ID card online?",
    "Union Bank of India to start wealth management vertical, says MD & CEO Manimekhalai",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL 2023: Playoffs qualification scenarios for all teams",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]