[
    "How the reification of caste will not lead to a true politics of change and justice",
    "In Tamil Nadu, protecting land asset is more challenging than buying it",
    "How genome sequences tracked down ancient disease ‘black death’",
    "Foucault pendulum | Earth’s rotation on display",
    "Move to withdraw Karnataka anti-cow slaughter Act triggers political slugfest",
    "Under construction bridge collapses in Bihar’s Bhagalpur",
    "WFI chief Brij Bhushan Singh to address U.P. BJP rally on June 11",
    "Home Minister meets wrestlers at his official residence, tells them to “trust the investigation”",
    "The Ministry of Home Affairs has denied that any such meeting took place",
    "First train chugs out of Odisha’s accident-hit area after 51 hours",
    "What could have led Coromandel Express into the loop line?",
    "2023-06-05T10:47:06+05:30\n-\nMarkets\nRupee falls 14 paise to 82.53 against U.S. dollar",
    "2023-06-05T10:41:57+05:30\n-\nFootball\nMilan's Ibrahimovic hangs up his boots at 41",
    "Creeping change: On the High Court ruling in the Gyanvapi Mosque case",
    "Courts should be wary of incremental steps to alter status of places of worship",
    "A vote for change: On the result of the Thai parliamentary election",
    "The Generals should cede power without triggering chaos",
    "Tamil Nadu\nAs more opt for their own private space, senior living real estate segment opens up",
    "MoviesVeteran actress Sulochana, who typified the Bollywood ‘mother’, passes away at 94",
    "Technology\nHere Comes the AI: Fans rejoice in 'new' Beatles music",
    "Know Your English\nWhen are you planning to hit the road?",
    "BengaluruBengalureans who embrace a reduced waste lifestyle",
    "Telangana\nSecunderabad station expansion | Scores of trees felled, forest permission ambiguous",
    "Kerala\nWomen find their footing in tourism in flood-ravaged Kuttanad",
    "KeralaAs AI check starts, no fine for second pillion rider under age 12 in Kerala",
    "Tamil Nadu\nThiruvavaduthurai Math | A renowned seat of Tamil language and culture",
    "Citizen activism that is missing from the wrestling ring",
    "A model lab for secular governance?",
    "International trade has a carbon problem",
    "Spare the rod and change the law",
    "The Delhi ordinance is an unabashed power-grab",
    "Explained | Why does North Korea want spy satellites?",
    "How genome sequences tracked down an ancient disease",
    "Explained | What are the friction points on the LAC?",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "FeaturedFamily courts | No minor matterChildrenNavamy SudhishREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Odisha train accident death toll lowered to 275",
    "Loco pilots of Coromandel Express battle pain and false narratives",
    "Odisha train accident | Data logger analysis to provide crucial evidence for rail probe",
    "Death toll in Odisha train accident rises to 288",
    "Balasore train accident | Death toll increases to 261, many injured",
    "Pesky calls: Telcos to roll out platform to take consent of users in 2 months",
    "Kavach system not operational on Kharagpur-Bhadrak-Cuttack route",
    "Oil palm plantations prove to be a disaster in Mizoram",
    "Odisha train tragedy raises questions about rail safety and signals system",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]