[
    "The big, booming business of child-bride trafficking in Gujarat",
    "Rain or shine, it is Yakshagana season all year-round now",
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "IPL 2023 | The show-stoppers who made it a riveting spectacle",
    "Judicial commission to probe Manipur ‘ethnic violence’, says Amit Shah",
    "NCERT drops periodic table chapter from Class 10 syllabus in ‘rationalisation’ process",
    "Not seeking international support in our fight against the BJP, Rahul says in the U.S.",
    "Akhand Bharat mural in new Parliament triggers row in Nepal",
    "9 Indians freed in Libya after intervention by Indian school principal",
    "GST collections rise 11.5% to cross ₹1.57 lakh crore in May",
    "Centre is sensitive to wrestlers issue: Sports Minister Anurag Thakur",
    "2023-06-02T00:17:00+05:30\n-\nKolkata\nWill fight till protesting wrestlers get justice, says Mamata",
    "Wrestling for justice: On the protest by the wrestlers",
    "The Wrestling Federation needs an overhaul in the wake of the allegations",
    "Riding the momentum: On National Statistical Office’s economic data and the economy",
    "Fiscal and monetary measures must remain growth supportive in the coming quarters",
    "Podcast\nIs there a clear north-south divide in Indian politics? | The Hindu Parley Podcast",
    "ScienceSci-Five | The Hindu Science quiz: On vaccines",
    "Music\nIlaiyaraaja turns 80 | What’s your Ilaiyaraaja story?",
    "Gadgets\nSamsung launches new range of OLED TVs",
    "Food\nWhat does it take to be an Instagram-worthy restaurant?",
    "ScienceChandrayaan-3 spacecraft reaches launch port ahead of next month’s launch",
    "India\nDaily Quiz | On clock towers from across the world",
    "Karnataka\nDream Weaver: A visual journey into weaver birds’ struggles",
    "MoviesWatch | In conversation with director Sashi Kiran Tikka",
    "At the root of India’s manufacturing challenge",
    "Recasting the discourse on Muslim education",
    "Is there a clear north-south divide in Indian politics?",
    "Green Humour by Rohan Chakravarty",
    "Chennai’s most famous adopted son will live on for eternity",
    "Central Asian foreign policy multi-vectorism pays off",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Uncertain showers: On monsoon information and the Indian farmer",
    "Manufacture of 120 Vande Bharat trains by TMH-RVNL consortium runs into problems",
    "BJP launches all-out attack against Rahul Gandhi for his remark against PM Modi",
    "16 parties confirm participation for the June 12 Opposition meet",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "Elon Musk goes silent on Twitter after arriving in China",
    "Go First urges DGCA not to cancel AOP",
    "1947 ‘sengol’ story just fiction based on manufactured lies: N. Ram",
    "What is really behind the violence in Manipur?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]