[
    "Political Line | The high command and ground realities",
    "Diagnostic imaging of the Rajasthan Right to Health Act",
    "Welfare spending has been getting a regular pruning",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Karnataka Assembly election results | JD(S) shows the worst performance in nearly two decades",
    "Karnataka election results | Rahul says victory will be repeated in other States",
    "Karnataka election results 2023 | Which regions are boosting Congress win",
    "Karnataka election results | PM Modi’s rallies had little impact outside Bengaluru",
    "Karnataka election results | BJP’s southern charge blunted",
    "Lessons from Karnataka: for the Congress, the BJP and the rest",
    "Asymmetry and power: on Delhi government and administrative services",
    "The Supreme Court ruling on services is a boost for representative government in Delhi",
    "Welcome initiative: on quality human clinical trials and using ayurveda and modern medicine",
    "Data\nData | It’s a strong rural victory for the Congress in Karnataka",
    "Karnataka\nKarnataka Assembly Elections | Key winners and losers",
    "Other States\nJob losses, easy money are both key factors of drug addiction in northern States",
    "Karnataka Elections\nLessons from Karnataka: for the Congress, the BJP and the rest",
    "WorldCyclone Mocha heads to Bangladesh, Myanmar coasts, threatening refugees",
    "Industry\nWhat to know about Twitter's new CEO Linda Yaccarino",
    "Movies\n‘Air’ movie review: Ben Affleck shoots Matt Damon into MVP territory",
    "Movies‘Dahaad’ series review: Sonakshi Sinha leads a sensitive procedural",
    "Gadgets\nDell launches Alienware m16 and x14 R2 laptops in India",
    "Boat capsize in the Poorappuzha estuary | Tragedy at Tanur",
    "On the Draw — May 13, 2023",
    "Facing the heat for an interview is a part of every journalist’s life",
    "Is the monarchy still relevant in the 21st century?",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Baby’s got three parents: explaining Mitochondrial Donation Treatment",
    "Explained | The troubles of India’s aviation industry",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Cyclone Mocha to be stronger than expected",
    "Adani-Hindenburg row | Supreme Court confirms receipt of J. Sapre panel report",
    "Chennai girl secures perfect score Class X CBSE board exams",
    "Morality and majority: on the Supreme Court verdict on the political imbroglio in Maharashtra",
    "Descent into chaos: on the state of Pakistan’s politics",
    "Adani-Hindenburg row: SC may grant SEBI 3 more months to wrap up probe",
    "Vedanta Q4 net profit down 57% on lower realisation",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023 after MI vs GT: Mumbai Indians third after win vs Gujarat Titans",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]