[
    "Explained | Artemis Accords, India-US space collaboration and how it relates to ISRO’s missions",
    "Explained | What is the dispute about sugar subsidies at WTO?",
    "Explained | Rehana Fathima case: Obscenity laws and the policing of female sexuality",
    "Data | Another tiger from Madras: The rise and rise of D. Gukesh",
    "Manipur Governor meets Shah; Kuki groups reject CM’s outreach bid",
    "Rahul to visit Manipur on June 29, 30",
    "Elections to 10 Rajya Sabha seats on July 24",
    "Centre allows Aadhaar authentication for registration for births and deaths",
    "New deadline for Aadhaar-based rural jobs scheme wages",
    "White House, MEA decline to comment on Obama interview",
    "Centre planning new Bill on stray dog issue",
    "2023-06-27T22:30:21+05:30\n-\nEnvironment\nTranslocated cheetah injured in skirmish in Kuno Park",
    "2023-06-27T22:02:39+05:30\n-\nIndia\nOpposition slams Centre’s policies for tomato price rise",
    "2023-06-27T21:54:46+05:30\n-\nIndia\nCentre to sell toor dal from buffer stocks as price shoots up",
    "2023-06-27T21:54:07+05:30\n-\nIndia\nRahul Gandhi to visit violence-hit Manipur on June 29, 30",
    "Strategic high: On India-U.S. ties and strategic cooperation",
    "India and the U.S. have entered a new era of mutual trust and cooperation",
    "Spring cleaning: On medical education in India",
    "The pause on new Graduate Medical Education Regulations is a chance to forge a consensus",
    "Internet\nFlipkart to let people exchange defunct electronic items for new products",
    "MoviesTamannaah Bhatia on ‘Jailer’, ‘Jee Karda’, ‘Lust Stories 2’ and Vijay Varma",
    "Internet\nTelegram to launch Stories in July",
    "Movies\nPride Month | Lesbians through the looking glass",
    "India\nEPFO extends deadline to apply for higher pension till July 11",
    "WorldDeepavali to be school holiday in New York City",
    "Coimbatore\nKamal Haasan gifts car to Coimbatore’s first woman bus driver",
    "Technology\nWhat happens when social media firms monetise key features?",
    "Internet\nFive points to keep personal data safe in Android smartphones",
    "Tracing the arc of American ‘exception-ism’ for India",
    "A row over rice in Karnataka",
    "A model for quality and inclusive education",
    "Reduced ceiling, increased anger",
    "Pay heed to a resurgence in militancy in Rajouri-Poonch",
    "A man of the times and ahead of it",
    "Explained | What are the reforms to immigration law for skilled workers in Germany?",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "2023 ICC ODI World Cup schedule announced; India-Pakistan clash in Ahmedabad on October 15",
    "The main chapter of how Hindutva sees the past",
    "EPFO extends deadline to apply for higher pension till July 11",
    "Out of this world: ICC World Cup trophy sent to space",
    "IISc student cheated of ₹1.3 lakh",
    "IPO screener: Retail investors make beeline for ideaForge issue",
    "Bank loans to NBFCs under RBI scanner",
    "What place does a sceptre have in a democracy?",
    "MEA-backed South Asian University suspends faculty supporting protesting students",
    "Hurdles star McLaughlin lethal in 400m flat, Lyles shines again in NYC",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]