[
    "Political Line | Cashing in on cows",
    "Manipur, a rude reminder of northeast tensions",
    "Amplify the subject of adolescent girl nutrition",
    "Three injured in fresh gunfight in violence-hit Manipur",
    "Balasore train accident | 12 Opposition parties demand SC-monitored SIT",
    "Congress asks PM Modi to break 'silence' on Manipur, allow all-party delegation to visit State",
    "Manipur | Assam CM meets Kuki insurgent groups with peace plan",
    "CoWIN data breach reports without any basis: Health Ministry",
    "Cyclone Biparjoy | IMD-INCOIS predicts extensive damage in Gujarat districts",
    "While Nitish headlines Opposition meet, Lalu, Tejashwi lay the groundwork",
    "The second-best: on India and the World Test Championship final",
    "India, after a hectic IPL, seemed unprepared for the WTC final",
    "Telltale signs: On Maharashtra and a pattern of sustained polarisation",
    "Low-intensity communal violence in Maharashtra could take a dangerous turn",
    "Entertainment\nSJ Surya: ‘I still live the life of a middle-class teacher’s son‘",
    "Andhra PradeshWith new changes by TTD, a record number of devotees have darshan at Tirumala",
    "Podcast\nWhat does RBI’s current monetary policy mean for India’s economy? | In Focus podcast",
    "Tamil Nadu\nNeolithic-era celt found in Tamil Nadu’s Poothinatham village",
    "Science\nMenhir and megalithic burial sites declared as protected monuments at Kodumanal",
    "IndiaLok Sabha Polls 2024 | Which parties are the BJP targeting to form new alliances with?",
    "Technology\nExplained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "WorldUkraine's dam collapse is both fast-moving disaster and slow-moving ecological catastrophe",
    "Wrestlers’ protest and the shrinking space for dissent",
    "E-education platforms, their Generative AI chapter",
    "Governors cannot indefinitely hold back Bills",
    "A pragmatic approach, for better India-Nepal ties",
    "The Telangana BJP is in a bind",
    "Explained | What is causing large-scale wildfires in Canada?",
    "Explained | How are universities assessed under the National Institutional Ranking Framework?",
    "Explained | The Hiroshima process that takes AI governance global",
    "Explained | Why are YouTube creator accounts with large followings targeted by hackers?",
    "Explained | Will Betelgeuse, the red giant star, blow up in your lifetime?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IndiGo flight enters Pakistan airspace amid bad weather; returns safely",
    "It’s curtains for Prarthana drive-in theatre on ECR near Chennai",
    "WTC final 2023 | Australia crushes India by 209 runs to win World Test Championship title",
    "Kohli did a great job, but Kohlism needs to be reviewed",
    "French Open final | Novak Djokovic wins his 23rd Grand Slam title by beating Casper Ruud",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "As rupee reserves grow, Russia may have to invest more in India",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "WTC 2023-2025: India full schedule, tours, matches list",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]