[
    "Anti-poverty schemes may help poor children’s brains grow normally",
    "IPL 2023 | The show-stoppers who made it a riveting spectacle",
    "Data | Antarctic sea ice cover hits record lows on many days of 2023",
    "In the era of unicorns, there are few takers for Sudha Murty’s brand of simplicity",
    "SIA raids underway at multiple locations in Kashmir in bank guard killing case",
    "India’s manufacturing PMI hits highest level since October 2020 in May",
    "IAF trainer aircraft crashes near Chamarajanagar in Karnataka; pilots eject safely",
    "According to IAF, the pilots were on a routine training sortie when the incident occurred",
    "NCERT drops chapters on periodic table, democracy, political parties from Class 10 syllabus",
    "Manufacture of 120 Vande Bharat trains by TMH-RVNL consortium runs into problems",
    "2023-06-01T18:49:42+05:30\n-\nIndia\nFranco Mulakkal resigns as Jalandhar Bishop",
    "Uncertain showers: On monsoon information and the Indian farmer",
    "Farmers need to be given timely, accurate information on rainfall",
    "Status quo in Turkey: On the new term for Recep Tayyip Erdoğan",
    "Erdogan must right the wrongs of the past and offer a new inclusive beginning",
    "Science\nSci-Five | The Hindu Science quiz: On vaccines",
    "MusicIlaiyaraaja turns 80 | What’s your Ilaiyaraaja story?",
    "Gadgets\nSamsung launches new range of OLED TVs",
    "Food\nWhat does it take to be an Instagram-worthy restaurant?",
    "Science\nChandrayaan-3 spacecraft reaches launch port ahead of next month’s launch",
    "IndiaDaily Quiz | On clock towers from across the world",
    "Karnataka\nDream Weaver: A visual journey into weaver birds’ struggles",
    "Movies\nWatch | In conversation with director Sashi Kiran Tikka",
    "Karnataka\nMiraculous escape from cobra",
    "A parliamentary democracy or an executive democracy",
    "In Bengal, court orders dominate politics",
    "Is India missing the graphene bus?",
    "Green Humour by Rohan Chakravarty",
    "Biodiversity is us and we are biodiversity",
    "Using Buddhism as a tool of soft power",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "Explained | The SC ruling on jallikattu",
    "Explained | Why do faculty shortages persist in Indian universities?",
    "A Foucault pendulum swings inside the new Parliament",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "The old and the new: On the 2023 IPL final and the CSK win",
    "BJP launches all-out attack against Rahul Gandhi for his remark against PM Modi",
    "Adani Transmission Q4 net profit jumps 85% to ₹439.60 crore",
    "Go First urges DGCA not to cancel AOP",
    "Yes Bank unveils new brand logo",
    "1947 ‘sengol’ story just fiction based on manufactured lies: N. Ram",
    "What is really behind the violence in Manipur?",
    "IPL 2023 Awards List: Orange cap, Purple cap, Emerging player, MVP, Fair Play full list of awards",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]