[
    "Friendly police in Hyderabad, a welcome overhaul",
    "Ensuring equity in education in Andhra Pradesh",
    "Kerala Spotlight | Unease on self-financing college campuses",
    "A journey with migrants on an unreserved coach of the Coromandel Express",
    "Governor Ravi rejects T.N. government’s request to shift portfolios",
    "Karnataka to scrap anti-conversion law, reverse textbook changes",
    "Encounter underway in J&K’s Kupwara",
    "South Manipur cut off as women-led vigilante groups block arterial roads",
    "80 castes to be added to Central OBC list",
    "2023-06-16T09:26:36+05:30\n-\nKerala\nTop Kerala News developments today",
    "2023-06-16T09:24:37+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "Code red: On the 22nd Law Commission and a uniform civil code",
    "The push for a uniform civil code should not become a divisive tool",
    "Culture shift: On the U.S.’s UNESCO re-entry",
    "UNESCO must get strict with nations exiting and re-entering on frivolous grounds",
    "Cricket\nHaving been a fine batter, maybe I should have never become a bowler: Ashwin",
    "CricketIndia’s Test losses: a result of stereotypes and the quest for balance",
    "Podcast\nIs the Indian Railways stretched beyond its capacity? | The Hindu Parley Podcast",
    "Movies‘The Flash’ movie review: Imperfect yet scintillating spectacle to end the DCEU storyline",
    "Movies\n‘Extraction 2’ movie review: Chris Hemsworth ups the ante in blazing, action-fuelled sequel",
    "Movies\n‘Jee Karda’ series review: Tamannaah Bhatia anchors a glib affair",
    "Reflections on Artificial Intelligence, as friend or foe",
    "A media war with no winners",
    "Is the Indian Railways stretched beyond its capacity?",
    "Green Humour by Rohan Chakravarty",
    "Jumpstarting the next phase of U.S.-India defence ties",
    "Strengthening the Integrated Child Development Services scheme",
    "Explained| Are non-communicable diseases increasing in India?",
    "EXPLAINED | How is electricity tariff calculated in Karnataka?",
    "Explained | What is transcranial magnetic stimulation?",
    "Explained | Why did the government impose a ceiling on wheat stocks?",
    "Explained | What has India done to address child trafficking?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Free bus for women sees 41.34 lakh passengers on Monday",
    "T.N. Minister Senthilbalaji remanded to judicial custody till June 28",
    "Tenuous plea: On the Trump indictment and U.S. politics",
    "Why is the Law Commission revisiting Uniform Civil Code, asks Congress",
    "Lifestyle beverage brand Salud raises the bar with launch of its newest gin",
    "Guyana’s oil discovery, a game changer",
    "Controversial arrest of Tamil Nadu Minister Senthil Balaji sparks outrage and political backlash",
    "What is really behind the violence in Manipur?",
    "Asia Cup 2023 dates: Matches start on August 31; Four in Pakistan, nine in Sri Lanka",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]