[
    "Generally, a bad ball is just a bad ball; no one plays to lose",
    "Explained | How to minimise the threat from improvised explosive devices?",
    "World Thalassemia Day: An invisible disability that is lacking acceptance",
    "With COVID-19 ‘over’, applying the lessons learnt",
    "Security forces launch cordon and search op in J&K's Poonch",
    "No end to the humiliations of frisking for NEET aspirants",
    "Amit Shah’s remark that Tagore composed ‘national songs’ of 2 countries kicks up row",
    "Karnataka Assembly Elections voting live updates | 21% voting recorded till 11 a.m.",
    "The Kerala Story ban | SC agrees to hear filmmaker’s plea against West Bengal ban on May 12",
    "IT Ministry to examine claim of WhatsApp accessing mic in background",
    "NCLT grants GoFirst’s insolvency plea",
    "2023-05-10T12:28:39+05:30\n-\nOther States\nPM Modi visits Shrinathji temple in Rajasthan",
    "2023-05-10T12:26:53+05:30\n-\nCricket\nIPL 2023 | I know my game and where my runs are: Suryakumar",
    "Green crosshairs: On the impact of the European Union’s Carbon Border Adjustment Mechanism",
    "A multi-pronged counter is warranted to tackle the European Union’s carbon tax plans",
    "Syria’s homecoming: On Arab League’s decision to readmit Syria",
    "Arab neighbours must help rebuild Syria, while keeping up pressure on Assad",
    "ChennaiAavin launches new cow milk variant; half-litre to be priced at ₹22",
    "World\nDaily Quiz | On the rulers of Great Britain",
    "Tamil Nadu\nPa. Ranjith defends ‘creative freedom’ of poet Viduthalai Sigappi",
    "Movies‘Adipurush’ trailer: Prabhas battles for righteousness in ‘Ramayana’ retelling",
    "Andhra Pradesh\nTapping the nascent market for donkey milk in Andhra Pradesh",
    "Technology\nElon Musk warns that Twitter will purge unused accounts",
    "Salvaging the idea and reality of Manipur",
    "Upsetting the apple cart in Himachal",
    "Not quite the Kerala story",
    "The ‘right to health’ goal and a role for Taiwan",
    "The Maoists are still a threat",
    "Explained | What is a transformer, the ML model that powers ChatGPT?",
    "Explained | Misleading food ads and regulations to curtail them",
    "Explained | What did India’s first national water-body census find?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "A tragedy foretold: on the boat accident in Kerala and lapses",
    "Woman from Hyderabad among eight killed in Texas shooting",
    "Huge scam exposed in the purchase of diesel by Railways",
    "Coal India’s stock remains attractive despite decline in Q4 profits",
    "How Manipal’s Pai is growing the health and education pie",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "IPL Points Table 2023: Updated standings after MI vs RCB match - Mumbai third with sixth win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]