[
    "As vigilante groups thrive, interfaith couples try to survive",
    "Puff the magic dragon: the myth of ‘safe’ e-cigarettes",
    "The big, booming business of child-bride trafficking in Gujarat",
    "Kerala spotlight | Awaiting monsoon with hope and dread",
    "India remains committed to ensure return of Ariha Shah to her parents, stresses govt",
    "Meet with wrestlers or face agitation from June 9, khap leaders warn Centre",
    "Odisha train accident live updates | Over 170 killed, 800 injured in Balasore district",
    "Mural in new Parliament shows Ashoka empire: Government",
    "PM Modi to address joint session of U.S. Congress on June 22",
    "Manipur violence | At least 98 killed, 310 injured, says State govt",
    "2023-06-03T03:47:26+05:30\n-\nIndia\nTMC demands Railway Minister's resignation over Odisha accident",
    "Reset time: On GST revenue growth",
    "The current revenue trajectory presents an opportunity to fix GST’s flaws",
    "Good and bad: On India and artificial intelligence",
    "India needs to harness the benefits of AI while avoiding adverse effects",
    "Sport\nWorld Test Championship final: Rohit Sharma’s India chases elusive glory in Oval showdown",
    "WorldIndia-Nepal ties | The HITs and misses of PM Prachanda’s visit",
    "Life & Style\nCyrus Broacha explains why men thought of the concept of marriage",
    "Movies\n‘Taj: Reign of Revenge’ series review: Mughal succession drama creaks and crumbles",
    "Comment\nChennai’s most famous adopted son will live on for eternity",
    "Movies‘Pinki Elli’ Kannada movie review: A social thriller that hits strikingly close to reality",
    "A critical juncture in Manipur",
    "International trade has a carbon problem",
    "Recasting the discourse on Muslim education",
    "Central Asian foreign policy multi-vectorism pays off",
    "Is there a clear north-south divide in Indian politics?",
    "Chennai’s most famous adopted son will live on for eternity",
    "Explained | China’s ‘secret’ police stations abroad",
    "Explained | A new ‘smart bandage’ raises the bar for treating chronic wounds",
    "Explained | How has Dhaka reacted to the U.S. threat on visas?",
    "Who’s responsible for the environmental impact of what we eat?",
    "What were FDA’s concerns over Elon Musk’s Neuralink chip?",
    "FeaturedTelangana Formation DayTelangana The Hindu BureauREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "At least 171 killed, over 800 injured in train accident in Odisha’s Balasore district",
    "Riding the momentum: On National Statistical Office’s economic data and the economy",
    "In ‘rationalisation’ move, NCERT drops periodic table chapter from Class X book",
    "5% property tax rebate period extended",
    "Stock to buy today: India Cements (₹210.80)",
    "Coal India OFS: Should you subscribe?",
    "Political implications of Ahmednagar’s renaming as Ahilya Nagar",
    "Advani called it ‘the Congressisation of the BJP’",
    "BCCI announces India ‘A’ squad for Emerging Women’s Asia Cup 2023",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]