[
    "The View from India | Chaos in Pakistan",
    "Delving into the verdict on the Shiv Sena issue",
    "Explained | The Indian law on sexual harassment in the workplace",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Kerala shudders at yet another brutal lynching of migrant labourer",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "‘We can’t control the sky’, says Zelenskyy as he asks for fighter jets on U.K. visit",
    "Karnataka govt. formation | KPCC president D.K. Shivakumar leaves for Delhi",
    "Will support Congress if it is ready to ‘sacrifice’ West Bengal, says Mamata",
    "Changes in recruitment system ended corruption, nepotism, says PM Modi",
    "2023-05-16T12:30:05+05:30\n-\nWorld\nDozens rally against Fukushima plant water release plan",
    "2023-05-16T12:28:45+05:30\n-\nOther States\nFour killed as car falls into gorge in Himachal’s Sirmaur",
    "2023-05-16T12:07:22+05:30\n-\nIndia\nLand-for-jobs scam: CBI searches at nine locations",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "Andhra Pradesh\nTTD announces specific dates for release of darshan tickets at Tirumala temple",
    "TechnologyHow do AI text-to-image generators work?",
    "Karnataka\n‘Gauri’ bags ‘Best Long Documentary Award’ at South Asian Film Festival of Montreal",
    "Karnataka\nWhen a conductor’s past experience in a hospital labour ward came in handy on a bus",
    "Telangana45.9° C at Kondapur in Mancherial as day temperatures hit the sky",
    "Travel\nFrance most sought after among Schengen states, but also sees highest visa rejections: data",
    "Delhi\nBihar politicians lap up Dhirendra Shastri, the new Baba in town",
    "India‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Fashion\nWatch | Walkthrough of NMACC’s ‘India in Fashion’ exhibition",
    "Evaluating DNA report as evidence",
    "A Cabinet reshuffle in Tamil Nadu",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Fatigue in long Covid patients found to impact their nervous system",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "Statistical succour: On the Consumer Price Index",
    "Bengaluru-Chennai expressway likely to be ready by August 2024",
    "Kotak vs Watsa: The battle for acquiring IDBI Bank intensifies",
    "TN CM Stalin inaugurates Tamil Nadu Institute of Technology",
    "Failed ideas of Jawaharlal Nehru",
    "Karnataka result shows India’s natural position is in the centre",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]