[
    "What is BBMP Restructuring Committee and how will it help the fast-growing Bengaluru?",
    "News Analysis | Eight months on, ‘Team Kharge’ is a work in progress ahead of 2024 poll",
    "Science for All | What is the chiral bose-liquid state?",
    "Rethink the retention of sedition",
    "Telangana Chief Minister KCR hands over keys to six 2BHK beneficiaries",
    "Odisha Cabinet approves increase of outlay for Puri’s development by ₹1,000 crore",
    "GE, HAL sign MoU for manufacture of jet engines in India; U.S. Congress approval awaited",
    "2023-06-22T16:30:12+05:30\n-\nMarkets\nRupee rises 5 paise to close at 81.96 against U.S. dollar",
    "2023-06-22T15:31:46+05:30\n-\nOther States\nMonsoon to likely reach Mumbai by June 24, says IMD",
    "Overkill: On the Internet shutdown in Manipur",
    "The Manipur government’s decision to extend the Internet shutdowns lacks merit",
    "Heat and state: On a heatwave being only one half of the issue",
    "Poor living conditions have exacerbated the effects of heat waves",
    "MoviesFirst look of Vijay from Lokesh Kanagaraj’s ‘Leo’ out",
    "India\nAs India seeks new LNG supplies, speculation over possibility of reviving Trump-era deal",
    "Technology\nExplained | What is Titan, the missing Titanic tourist submersible?",
    "Food\nTrèsind Studio at No.11 out of the world’s 50 best restaurants",
    "SocietyNayana Motamma: why this first-time Dalit MLA switched from corporate law to politics",
    "Bengaluru\nSustainable shopping in Bengaluru: The surging popularity of secondhand goods",
    "India\nSylvester daCunha, creator of iconic Amul girl, dies",
    "BusinessAmazon to collect expiring ₹2,000 notes from customers",
    "Technology\nSmartphone data consumption to reach 62 GB in next five years: Report",
    "More HIT than miss in India-Nepal ties",
    "Green Humour by Rohan Chakravarty",
    "Spare a thought for psychiatric caregivers too",
    "Semiconductor fab: the unfinished agenda",
    "Explained | What is Titan, the missing Titanic tourist submersible?",
    "Explained | Will the U.S. Federal Reserve resume the rate hike cycle?",
    "COP28 UAE Presidency | Why are Western lawmakers opposing Sultan Ahmed al-Jaber’s appointment?",
    "Explained | The physics of why a table-tennis ball spins the way it does",
    "Explained | What is India’s jet engine deal with the U.S. and why is it significant?",
    "FeaturedPride Month | Queer cinema’s shackles in the mainstreamMoviesBhuvanesh ChandarREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A welcome step: on the Blinken-Xi meet in China",
    "Embedded hate: violence and racial discrimination by the U.S. police",
    "Assam Rifles secures threatened supply route to Manipur’s hill districts",
    "PM Modi’s gift to US First Lady: ‘Made in India’ 7.5 carat Green Diamond",
    "Wipro’s mega buyback offer opens today",
    "What is really behind the violence in Manipur?",
    "Failed ideas of Jawaharlal Nehru",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]