[
    "The View from India | Warm embrace, elevated ties",
    "Data | Another tiger from Madras: The rise and rise of D.Gukesh",
    "The main chapter of how Hindutva sees the past",
    "Explained | Understanding the Wagner mutiny",
    "Centre will ensure execution of SoO pact with Kuki groups, says Amit Shah",
    "EPFO extends deadline to apply for higher pension till July 11",
    "Opposition plans seat sharing in States where there is already alliance",
    "Militant killed in encounter in J&K’s Kulgam",
    "One security personnel was injured in the operation in Kulgam.",
    "PM Modi flags off five Vande Bharat trains in Bhopal",
    "White House condemns harassment of journalist who asked PM Modi a question",
    "2023-06-27T12:41:00+05:30\n-\nInternet\nTelegram to launch Stories in July",
    "2023-06-27T12:12:16+05:30\n-\nIndia\nIndia logs lowest daily COVID cases since March 2020",
    "2023-06-27T11:48:11+05:30\n-\nIndia\nPM Modi flags off five Vande Bharat trains in Bhopal",
    "A grand revival: on India-Egypt ties",
    "India and Egypt have re-established close ties in recent years",
    "Rebellion in Russia: on the mutiny by Yevgeny Prigozhin of the Wagner private military company",
    "Valdimir Putin should bring the war to an end for stability at home",
    "Internet\nTelegram to launch Stories in July",
    "WorldDeepavali to be school holiday in New York City",
    "Coimbatore\nKamal Haasan gifts car to Coimbatore’s first woman bus driver",
    "Cricket\nOut of this world: ICC World Cup trophy sent to space",
    "ChennaiOne more old architectural structure in Chennai to be restored to its original state",
    "Chennai\nOf pride, overcoming prejudices and ensuring equality",
    "TechnologyMeta to train 10 lakh traders with CAIT leveraging WhatsApp Business",
    "Technology\nQualcomm unveils 5G capable Snapdragon 4 Gen 2 SoC for entry segment phones",
    "A man of the times and ahead of it",
    "Reduced ceiling, increased anger",
    "Manipur — this is not a time for finger-pointing",
    "Laying the foundation for a future-ready digital India",
    "Joining the hunt: India and the Artemis Accords",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A new regime: On the Emergency Use Authorisation regime in India and clinical trials",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away",
    "Shree Cement share price tanks 10% on ₹23,000-crore tax evasion report",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Asian Kabaddi Championship: Squad, fixtures & live streaming info - all you need to know",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]