[
    "Only ambition is a united Opposition: Sharad Pawar",
    "Inside Jharkhand’s single-teacher schools",
    "Substance abuse in Kerala | On a high, at a social cost",
    "TB testing stuck in the previous century, and waiting for change",
    "PM Modi to meet Ukraine President Zelensky on the sidelines of G7 meeting",
    "Rijiju denies portfolio shift as punishment posting",
    "Siddaramaiah swearing-in ceremony likely to turn into a show of unity of Opposition parties",
    "RBI to pull out ₹2,000 notes from active circulation",
    "Banks asked to provide deposit and/or exchange facility for these notes till September 30",
    "Centre reverses SC order, gives Delhi Lt. Governor final say on bureaucrats",
    "Tax waived on annual forex spends up to ₹7 lakh: Finance Ministry",
    "New Parliament opening | Not inviting President is an insult, says Opposition",
    "2023-05-19T22:57:32+05:30\n-\nDelhi\nSC directs DERC chairperson’s appointment in two weeks",
    "A change for the better: On the shifting of Kiren Rijiju from the Law Ministry",
    "The shifting of Kiren Rijiju from Law Ministry should end conflict with judiciary",
    "Among the elite: On India at the G-7 summit",
    "India’s presidency of G-20 gives it additional heft at G-7 summit",
    "World\nPM Modi’s Indo-Pacific tour | Will Biden’s pullout be India’s gain?",
    "Movies‘Kathal’ movie review: Sanya Malhotra chases jackfruits and jeopardy in prickly comedy",
    "Movies\nCannes 2023: Aishwarya Rai Bachchan stuns in silver Sophie Couture gown",
    "Gadgets\nXiaomi launches Redmi A2 and A2 Plus smartphones into entry segment",
    "Hyderabad\nEight-year-old boy mauled to death by stray dogs in Telangana’s Kazipet",
    "Movies\nHow Hollywood finally cracked the video game adaptation",
    "Movies\nCannes 2023: India’s twin wins at the Oscars show we always dream big, says Khushbu",
    "Under-reading and over-reading the Karnataka vote",
    "Tracking SDG progress the Bhopal way",
    "Explained | What are RBI regulations on green deposits?",
    "Money is about more than just survival",
    "Can an integrated system of medicine work?",
    "Explained | Ukraine’s recent round of weapons acquisition",
    "Explained | Why are financial regulators transitioning from LIBOR?",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Two to tango: On the Congress settling the leadership issue in Karnataka",
    "Prime Minister to inaugurate new Parliament building on May 28",
    "PM Modi arrives in Hiroshima for G7 and Quad summits",
    "The Kerala Story | SC stays Bengal ban, asks T.N. to provide security to theatres",
    "As Law Minister, Kiren Rijiju took potshots at Indian judiciary",
    "Bank Retirees’ Association requests Govt to expedite pension updation",
    "CMS Info Systems forays into ATM manufacturing with a new plant in Chennai",
    "Kerala Christians are cosying up to the BJP, but at what cost?",
    "IPL 2023: Playoffs qualification scenario for RR after Rajasthan beats Punjab to keep hopes alive",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]