[
    "Karnataka polls | Striking a balance between castes and regions a daunting task for Congress",
    "Rajasthan’s move spells some hope for gig workers",
    "Explained | How methanol poisoning kills",
    "India deserve the money, but the ICC needs to work out a better system",
    "Security forces step up vigil in J&K ahead of G20 meet",
    "Prince Harry, wife Meghan in 'near catastrophic car chase' with paparazzi",
    "India, E.U. Discuss E.U. Carbon Border Tax in Brussels",
    "Karnataka govt formation | Siddaramaiah is likely choice of Congress high command",
    "Karnataka CM race: Fake circular keeps officers busy for swearing-in ceremony",
    "Centre launches initiative to put 75 million people with hypertension, diabetes on standard care",
    "NHRC issues notices over sexual exploitation of 13 girls students in a U.P. government school",
    "2023-05-17T22:33:06+05:30\n-\nIndia\nL-G can destabilise MCD with power to appoint aldermen, says SC",
    "Tripping trade: on India and its trade stance",
    "India must not rely on a few large markets, but opt for integration with global value chains",
    "Weaker by the year: on the elections in Turkey and Recep Tayyip Erdoğan",
    "Erdogan may still be in the lead, but the run-off is humbling",
    "Business\nWhy is the rising cost of coal-fired power plants good news for India?",
    "BusinessWatch | All you need to know about the GoFirst crisis",
    "Technology\nApple blocked 1.7 million apps, removed 428,000 developer accounts from the App Store",
    "Technology\nThe Indian publishing industry is gearing up for AI audiobooks",
    "ScienceExplained | Why is a viable dengue vaccine not yet available",
    "Movies\nPriyanka Chopra, Anne Hathaway, Zendaya light up Bulgari event in Venice",
    "World\nNepal’s Sherpa guide regains title for most climbs of Mount Everest after 27th trip",
    "Movies\nNew on Amazon Prime Video this week: ‘Modern Love Chennai’, ‘Bones and All’, and more",
    "The rising tide of dictatorship",
    "The Dalit outreach of the BRS",
    "The rebooting of the Congress",
    "Evaluating DNA report as evidence",
    "Explained | Why is a viable dengue vaccine not yet available",
    "Explained | Why making agri commodity value chains sustainable is a tough task",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Tussle between DKS and Siddaramaiah crosses party lines and takes caste colour within BJP ranks",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Do not create an “atmosphere of fear”, Supreme Court tells ED",
    "Will meet CEOs of world’s leading companies next week: PM Modi",
    "Centre appoints Ravneet Kaur as CCI Chairperson",
    "Meet Ravneet Kaur, the new CCI Chairperson",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table update after LSG vs MI: Lucknow Super Giants third with seventh win",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]