[
    "Delhi\nDelhi witnesses sudden change in weather, wakes up to balmy morning",
    "Mangaluru\nAir India launches second Mangaluru-Mumbai daily flight",
    "History & Culture\nThe great Indian museum makeover",
    "Opposition needs to present alternative to the BJP, PM face is not the issue: Sharad Pawar",
    "He will attend the meeting of Opposition parties in Patna on June 23",
    "Boris Johnson's career spanned dizzying heights and tumultuous lows",
    "'As we go along we will see what can be done', says Puri on reducing petroleum prices",
    "2023-06-11T09:17:01+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "2023-06-11T09:03:01+05:30\n-\nKerala\nTop Kerala News developments today",
    "Football\nManchester City win first Champions League title",
    "WorldLi Shangfu | The General’s warning",
    "World\nNova Kakhovka | Water as a weapon",
    "World\nPita Limjaroenrat | Winds of change",
    "Environment\nExplained | What is happening to Arctic sea ice?",
    "Tamil NaduBuckingham Canal | A waterway once is sewage-carrier now",
    "Science\nIIT-Madras generates hydrogen from seawater using solar energy",
    "Andhra Pradesh\nA.P. forest officials release 4.32 lakh Olive Ridley turtles into sea",
    "ChildrenWhen the Mercury space capsule was patented...",
    "Technology\nCryptocurrency donations | Is more transparency worth the risks?",
    "Explained | What is happening to Arctic sea ice?",
    "Explained | Daily limit on UPI transactions",
    "Explained | How does a cyclone affect the monsoon’s onset?",
    "Who is Girish Chandra Murmu, CAG and trusted aide of PM Modi since Gujarat days?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "‘Dear Deputy CM, nice thought, but an elite task force is not what Bengaluru needs’",
    "Chaos and congestion in front of Bengaluru metro stations",
    "Elderly woman among three killed in attack on Kuki village",
    "Finance ministry on same page with RBI for FY24 growth forecast: CEA",
    "Three killed as illegal mine collapses in Dhanbad",
    "Well-marked low-pressure area over Bay perks up monsoon flows",
    "TCS, Infosys, and Wipro: The poor math behind some share buybacks",
    "Failed ideas of Jawaharlal Nehru",
    "What is really behind the violence in Manipur?",
    "WTC Final: What is the record for most runs scored on Day 5 to win a Test match?",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]