[
    "A Cabinet reshuffle in Tamil Nadu",
    "The View from India | Chaos in Pakistan",
    "Delving into the verdict on the Shiv Sena issue",
    "Explained | What led to the latest diplomatic row between China and Canada?",
    "Monsoon is likely to set in over Kerala with a “slight delay” on June 4",
    "SC Collegium recommends AP Chief Justice, senior advocate Vishwanathan as apex court judges",
    "Will meet CEOs of world’s leading companies next week: PM Modi",
    "Rajouri-Poonch sector an uphill task for security agencies",
    "Siddaramaiah, Shivakumar reach Mallikarjun Kharge’s residence",
    "Dengue vaccine: India moves closer to getting its first indigenous vaccine",
    "EU Foreign Minister says Europe should stop entry of Indian products made from Russian oil",
    "Safety, in the line of duty: on Kerala’s move and health-care workers",
    "Doctors must be protected while they are working with patients",
    "Death by methanol: on the hooch tragedy in Tamil Nadu",
    "There should be zero tolerance for sale of illicit liquor",
    "Movies\nInterview with the team of ‘Modern Love: Chennai’: Trying to define love and its many hues",
    "MoviesCannes Film Festival set to kick off with Johnny Depp and ‘Jeanne du Barry’",
    "Delhi\nRashtrapati Bhavan to be open for public viewing for six days a week from June 1",
    "Science\nThe problem with improved cooking stoves",
    "Entertainment\nAlia Bhatt dazzles in black at Gucci Cruise 2024 in Seoul",
    "TechnologyMeta introduces WhatsApp Chat Lock feature",
    "Movies\nVijay Antony on ‘Pichaikkaran 2’ and listening to the audience ‘inside him’",
    "Technology\nAmazon announces new ‘The Lord of the Rings’ multiplayer game",
    "Karnataka‘Gauri’ bags ‘Best Long Documentary Award’ at South Asian Film Festival of Montreal",
    "India\nICMR to help AYUSH researchers with capacity building, knowledge database",
    "Evaluating DNA report as evidence",
    "The BJP’s Karnataka defeat — a blow to its mythmaking",
    "A Court recall that impacts the rights of the accused",
    "This strategic-economic bloc will only tighten the leash",
    "Explained | How lasers are helping calcium-41 break into radiometric dating",
    "Can you spot the quantum physics around your house?",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Featured2023 Karnataka Assembly elections | Lokniti-CSDS postpoll study READ NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "TTD announces specific dates for release of darshan tickets at Tirumala temple",
    "SEBI’s affidavit triggers war of words on probe on Adani",
    "Manoj Soni to take oath as UPSC chairman on Tuesday",
    "SEBI proposes tighter norms for delisting debt securities",
    "Centre appoints Ravneet Kaur as CCI Chairperson",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "IPL 2023 Points Table: Updated standings after RR vs RCB match",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]