[
    "Unlocking secrets of the honeybee dance language",
    "Iron fortification: health risks of excessive iron intake",
    "What we lose when we work with a ‘giant AI’ like ChatGPT",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Wrestlers detained, Jantar Mantar protest site cleared",
    "An opulent House: art lines ₹200-crore interiors",
    "India sees reduction in stunting; but wasting, obesity are concerns: report",
    "Erdogan wins historic Turkey runoff vote",
    "Victory in the historic vote extends Mr. Erdogan’s 20-year rule until 2028",
    "IPL final moved to reserved day due to persistent rains",
    "40 extremists killed in encounters: Manipur Chief Minister",
    "Centre fiercely neutral in Manipur, says Assam CM",
    "2023-05-29T03:24:00+05:30\n-\nWorld\nSomalia to introduce direct universal suffrage in 2024",
    "Alarming turn: On the situation in Manipur",
    "A return to normalcy in Manipur requires concerted action by government and civil society",
    "From the margins: On the success of women candidates in 2022 Civil Services Examination",
    "Women in civil service have a challenging and exciting task before them",
    "Science\nA Foucault pendulum swings inside the new Parliament",
    "CricketIndian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement",
    "Other Sports\nMalaysia Masters badminton | Prannoy claims maiden BWF World Tour title",
    "Photos\nIn Frames | Off the hook",
    "Tamil Nadu\nAnnadurai questioned the motive behind head of mutt giving ‘Sengol’ to Nehru",
    "Open PageA display of human ingenuity",
    "Health\nGummies and fizzies for wellness? | We need to talk about nutraceuticals",
    "Data\nData | Exports and imports shrink across many nations for most items in 2023",
    "Society\nEverest: 70 years later",
    "A belligerence towards Beijing that is unsettling",
    "Menstrual health is a public health issue",
    "Kerala’s Kudumbashree programme to empower poor women is at a crossroads",
    "On the Draw — May 29, 2023",
    "At Hiroshima, Japan’s moment to reinforce partnerships",
    "A fountainhead of the people’s hopes and aspirations",
    "A Foucault pendulum swings inside the new Parliament",
    "Explained | Will facial recognition AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "A new House, again in red sandstone",
    "Kerala braces for a strong southwest monsoon",
    "Microsoft sets out grounds for Activision appeal against UK regulator",
    "Mob and justice: On the Alwar lynching case verdict",
    "Indian Bank empanelled as Clearing and Settlement Bank with ICCL",
    "To deal with carbon dioxide, befriend it",
    "Critical gaze: Review of ‘India is Broken’ by Ashoka Mody",
    "Modi & Savarkar: Ideological turns",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]