[
    "India\nICSE class 10, ISC class 12 results declared by CISCE",
    "Science\nLong COVID: a lingering problem requiring greater attention",
    "IndiaMeiteis | Clash of clans in Manipur",
    "Art\nStudio pottery in India has a strong future ahead of it: Kate Malone",
    "Powerful Cyclone Mocha makes landfall in Myanmar, at least three killed",
    "Karnataka DGP Praveen Sood appointed as CBI Director",
    "Explained | ‘The Kerala Story’: Can a work of fiction or art constitute ‘hate speech’?",
    "2023-05-14T17:35:13+05:30\n-\nDelhi\nGovernment to make ₹300 crore equity infusion in Alliance Air",
    "Photos\nIn Frames | Songs for the soul",
    "ArtRichard Orlinski: French contemporary art’s big disruptor",
    "India\nEknath Shinde | The chosen rebel",
    "Open PageThe way to be happy",
    "World\nKemal Kilicdaroglu | Erdogan’s rival",
    "ScienceParachutes for re-entry capsule of Mission Gaganyaan shipped from Agra",
    "Karnataka\nKarnataka Assembly Elections | Key winners and losers",
    "Can you spot the quantum physics around your house?",
    "Explained | India recorded maximum preterm births in 2020: findings of WHO report",
    "Explained | How are nutrients in millets affected by processing and polishing?",
    "Baby’s got three parents: explaining Mitochondrial Donation Treatment",
    "FeaturedLong COVID: a lingering problem requiring greater attentionScienceRajeev JayadevanREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Karnataka Assembly Election 2023",
    "Karnataka Assembly election results | With the defeat, BJP back to square one in south India",
    "Karnataka DGP to be the next CBI Director, overtaking others",
    "High drama at counting centre for Jayanagar constituency as BJP wins by 16 votes",
    "NCB, Indian Navy make biggest ever drug haul",
    "Chennai girl secures perfect score Class X CBSE board exams",
    "Karnataka Assembly results: Three candidates in the fray to become next Chief Minister",
    "Go First CEO to employees: Salaries for April will be paid, no haircut to be expected",
    "How a little-known portal got the Karnataka election results right",
    "Civil society organisations played key role in Congress victory",
    "Zimbabwe cricket great Heath Streak critically ill",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]