[
    "India\nKathua rape-murder case: Arguments on framing of charges against main accused on June 26",
    "World\nNews Analysis | Mutiny exposes chinks in Putin’s armoured regime",
    "Other StatesAssam floods | As situation remains grim, Amit Shah assures Centre’s help to Himanta",
    "India\nExplained | Why is the U.S.-India fighter jet deal important?",
    "Manipur CM Biren Singh meets Union Home Minister Amit Shah",
    "Egyptian President El-Sisi confers PM Narendra Modi with ‘Order of the Nile’ award",
    "Pak. court acquits former Prime Minister Nawaz Sharif in 37-year-old ‘bribe’ case",
    "2023-06-25T17:41:14+05:30\n-\nSport\nGauhati High Court stays Wrestling Federation of India elections",
    "2023-06-25T17:27:12+05:30\n-\nIndia\nManipur CM Biren Singh meets Union Home Minister Amit Shah",
    "2023-06-25T16:52:20+05:30\n-\nMumbai\nPro-PFI stickers, cracker bombs put up at houses in Navi Mumbai",
    "Cricket\nIndia’s 1983 World Cup victory...40 years on",
    "New ArticlesIn Frames | Struggle for water",
    "Movies\nWatch | Mari Selvaraj on ‘Maamannan’ and the art of immersing the audience in his world",
    "Food\nKozhikode’s Paragon named 11th most legendary restaurant in the world, says Taste Atlas",
    "Open Page\nAccidents in war and life",
    "BooksPride Month 2023 | Queering the narrative",
    "India\nGita Press | God’s own publisher",
    "Art\nThe artist x artisan conundrum",
    "WorldMicron Technology | Rebalancing portfolio",
    "Environment\nJumbo translocation | Addressing the elephant in the room",
    "Explained | India has signed the Artemis Accords. What is at stake?",
    "Titan submersible | Deep sea tragedy",
    "Explained | Does the China-Pakistan nuclear deal flout global rules?",
    "Explained | Why is the U.S.-India fighter jet deal important?",
    "Micron Technology | Rebalancing portfolio",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "Hamish G.L. Harding | The Titan submersible was the last expedition of a life-long explorer",
    "Monsoon covers Delhi, Mumbai together",
    "Hyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’",
    "12 cadres of banned Manipur extremist group released after mob stops Army",
    "Russia says Wagner Group’s leader will move to Belarus after his rebellious march challenged Putin",
    "Byju's staff say morale waning amid turmoil at Indian edtech firm",
    "Russian mercenaries halt advance on Moscow, easing power challenge to Putin",
    "What is really behind the violence in Manipur?",
    "No, Nehru did not mishandle Kashmir",
    "Sunil Chhetri becomes fourth-highest international goal scorer; closes gap to Messi, Ronaldo",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]