[
    "Political Line | When Modi goes to Atmanirbhar America",
    "Explained | The remarkable endurance of the Y chromosome, ‘master of maleness’",
    "Humans’ groundwater extraction has affected the earth’s rotation: study",
    "Kukis | Fight for land and identity",
    "Manjhi’s HAM (S) withdraws support to Nitish government",
    "ST status for Meiteis: HC notice to Centre, State on review petition filed by Meitei body",
    "ED says Senthilbalaji is feigning illness, wants him back in custody on discharge from hospital",
    "President’s Rule ‘last option’ in Manipur, government to wait and watch",
    "The BJP is in a dilemma regarding the continuance of N. Biren Singh as Manipur Chief Minister.",
    "Punjab steps in to help Karnataka with its free rice scheme",
    "Shiv Sena Foundation Day: Wars of Words and Hindutva Standoff between Shinde and Thackeray",
    "2023-06-20T00:14:52+05:30\n-\nIndustry\nHDFC divests 90% stake in HDFC Credila for ₹9,060 crore",
    "Grasssroots peace: on the local body elections in West Bengal",
    "Free and fair elections to local bodies are not possible without peace",
    "Safety first: on Indian pharma products and drug safety",
    "India’s regulators must ensure quality and safety of drugs",
    "India\nIndiGo announces 500 Airbus narrowbody aircraft order",
    "AuthorsAuthor Salman Rushdie awarded prestigious German prize for his literary work and resolve",
    "Environment\nCyclone Biparjoy was forecast very well – but can forecasts be improved?",
    "Tamil Nadu\nFrom Kanniyakumari to California: Puppet artiste to perform in the U.S.",
    "Tamil Nadu\nVillagers go the extra mile to give elderly resident a memorable 100th birthday bash",
    "Tamil Nadu ‘Tamil Nadu’ | On the wrong side of history and law: a fraud exposed",
    "Movies\nNoted cinematographer Navroze Contractor killed in a bike accident",
    "Technology\nExplained | How do Telegram bots function?",
    "Movies‘Adipurush’ dialogue writer says they will revise dialogues that hurt sentiments",
    "Technology\nElon Musk confirms Twitter video app for smart TVs",
    "A rising India, in waltz dance steps with the U.S.",
    "A change of name for votes",
    "Emerging challenges to the Dravidian model",
    "Refugees as assets to their new countries",
    "T.N. Minister Senthilbalaji arrest | A case of propriety versus politics",
    "Can the new Diet and Biomarker Survey trace the roots of India’s anaemia problem?",
    "Explained | Are phonons, particles of sound, quantum too?",
    "Get less oxygen, live longer? It’s true in ageing mice",
    "Explained | If Betelgeuse goes supernova, what would it look like?",
    "Explained | How do Telegram bots function?",
    "Featured‘The future is queer and as diverse as India is’SocietyChittajit MitraREAD NOW",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "IndiGo announces 500 Airbus narrowbody plane order",
    "Why the traffic is no longer an issue in Bengaluru",
    "Preparedness pays off: On Cyclone Biparjoy",
    "Physics Wallah partners with Xylem to strengthen southern footprint",
    "Adani initiates stake sale talks for its NBFC arm",
    "What is really behind the violence in Manipur?",
    "Why Pali lost out and Sanskrit received more than its due",
    "ODI World Cup Qualifiers 2023: Format, rules, squads, schedule",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]