[
    "Tamil Nadu\nED attaches properties of Udhayanidhi Stalin Foundation",
    "India\nFive years after SC judgment, only 9 out of 25 High Courts livestream proceedings",
    "IndiaDelhi University decides to drop Iqbal from political science syllabus",
    "A new House, again in red sandstone",
    "India facing `very complicated challenge' from China, says Jaishankar",
    "Army Chief in Manipur, to review situation on ground",
    "2023-05-28T09:46:19+05:30\n-\nIndia\nPM Modi inaugurates new Parliament building",
    "2023-05-28T09:13:39+05:30\n-\nTamil Nadu\nTop Tamil Nadu news developments today",
    "Movies\nJustine Triet wins Palme d'Or at Cannes for 'Anatomy of a Fall'",
    "TelanganaTelangana’s woollen gongadi shawls refashioned into shoes for farmers",
    "Tamil Nadu\nAnnadurai questioned the motive behind head of mutt giving ‘Sengol’ to Nehru",
    "India\nSengol | A symbol of virtue",
    "World\nRecep Tayyip Erdogan | Turkey’s republican monarch",
    "WorldMalaiyaha Tamils | Two hundred years of struggle",
    "Sci-Tech\nCheetahs introduced without considering spatial ecology: study",
    "Environment\nExplained | Why are cheetah cubs dying in Kuno reserve?",
    "IndiaExplained | How can citizens file Census details online?",
    "Technology\nExplained | Will AI tools help detect telecom fraud?",
    "Explained | Will AI tools help detect telecom fraud?",
    "Explained | How can citizens file Census details online?",
    "Explained | Why are cheetah cubs dying in Kuno reserve?",
    "Brass is copper and zinc, but better. How?",
    "Readers Editor-Terms of Reference",
    "The Hindu Centre for Politics and Public Policy",
    "Bookstore & Special Publications",
    "Karnataka Assembly Election 2023",
    "PM calls upon CMs to work as ‘Team India’",
    "24 more Ministers join Siddaramaiah’s team",
    "Only six religion options make it to next Census form",
    "Tamil Nadu schools to reopen on June 7 for classes 1 to 12",
    "Kerala’s troublemaking tusker Arikompan still comes for rice",
    "Know your minister: A look at the 24 MLAs sworn in to the Karnataka cabinet today",
    "BL Explainer: All about the raging Sengol controversy",
    "Failed ideas of Jawaharlal Nehru",
    "No, Nehru did not mishandle Kashmir",
    "Copyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved."
]