[
    "Video shows Shane Warne's 'ball of the century' as it marks 30 years",
    "Used Filmfare trophies to make door handles, don't find any value in them: Naseeruddin",
    "Real Madrid's joint-most decorated player Karim Benzema leaves club after 14 years",
    "Australia's Josh Hazlewood ruled out of World Test Championship final against India",
    "If buffaloes can be slaughtered, why not cows? K'taka Minister",
    "Hindu petitioner to withdraw from Gyanvapi cases over alleged harassment",
    "What is electronic interlocking, a change in which caused Odisha train accident?",
    "Sight of littered bodies horrifying: BSF jawan on Odisha tragedy",
    "Who are the 3 members of panel formed by govt to probe Manipur violence?",
    "Man, 8-year-old daughter who swapped seats on Coromandel Express survive",
    "Adani Group to bear school education expenses of kids orphaned in Odisha train accident",
    "Chinese warship comes close to US warship amid heightened tensions",
    "Disney to incur $1.5-bn impairment charge for removing content",
    "We grew up watching his movies in the US: Richa Moorjani on SRK",
    "Parineeti shares her father's pic from her engagement on his b'day",
    "MSD said 'Let bowler do what he wants, hit straight': Rinku Singh",
    "I don't understand how KKR released Shubman Gill: Wasim Akram",
    "If you look at Gill, all his shots are as per manual: Vengsarkar",
    "Infosys CFO Nilanjan Roy's pay rises by 28% to ₹10.6 crore in FY23",
    "Ahead of Op Blue Star anniversary, security enhanced in Punjab",
    "Unclaimed bodies create space issues in Odisha's morgues: Reports",
    "We climbed on top of train, saw death so closely: Crash survivor",
    "Libyan dictator Gaddafi's son goes on hunger strike for no trial",
    "US woman shoplifts while car with kids inside catches fire; held",
    "7 of top 10 most valued firms lose ₹65,656 crore, RIL worst hit",
    "Terms & conditions\nPrivacy Policies",
    "Contact For Any Other Query"
]