[
    "Get up to 7%* p.a. with ActivMoney: Kotak Bank",
    "Democracy is in our DNA: PM on question about rights of Muslims, minorities at press meet",
    "All onboard missing Titanic submarine declared dead as debris found",
    "Deep conspiracy behind 'Adipurush', they want to corrupt future generations: Gajendra",
    "TV actress Rachitha accuses husband of sending threatening messages, files complaint",
    "List of best Asian Universities in 2023 released, IISc Bengaluru among top 50",
    "Australia's Fox Cricket calls Ollie Robinson 'villian no. 1', Stuart Broad responds",
    "Player dislocates finger, gets it relocated during live T20 Blast match, pic goes viral",
    "Cameraman zooms into Ronaldo's face during interview, his reaction goes viral",
    "54-member Indian team for Asian Athletics Championships announced",
    "Govt warns against fraudulent shortened URLs sent via SMS, WhatsApp",
    "Which party leaders are likely to attend Opposition meet in Patna tomorrow?",
    "Minor boy beats up female classmate at B'luru montessori school",
    "Pic shows PM Modi visiting White House as a common man 30 years ago",
    "Missing Titanic submarine's rear cover, landing frame among debris found: Rescue expert",
    "Man drugs wife & films over 50 strangers raping her over 10 years in France",
    "Men can overcome: Rajeev Khandelwal on facing casting couch",
    "Was told Rajkummar & I were a great onscreen couple: Gulshan",
    "WI record 2nd ODI WC qualifier win, defeat Nepal by 101 runs",
    "Roger Federer honoured on 30th anniversary of Halle Open",
    "ONDC to help Indian e-comm to grow to 500 mn monthly users: Nilekani",
    "Armed men rob ₹27 lakh from bank in Bihar, fire at guard: Police",
    "Macron would be inappropriate guest at BRICS summit: Russia",
    "Job of taming inflation only half done: RBI Guv in MPC minutes",
    "Fortress Investment Group may acquire bankrupt Vice Media: Report",
    "Terms & conditions\nPrivacy Policies",
    "Contact For Any Other Query"
]