[
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the next cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Stock Market LIVE: Sensex, Nifty pare gains; Realty, Pharma drag; Finance shines",
    "Who is Arjun Ram Meghwal, the newly appointed law minister of India?",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Instagram down for some users, facing glitch in Stories",
    "ITC share price jumps ahead of Q4 results today. Buy, sell or hold?",
    "Bharti Airtel Q4 results: Should you buy, sell or hold?",
    "CUET UG 2023 Admit Card likely today on cuet.samarth.ac.in",
    "Arjun Ram Meghwal replaces Kiren Rijiju as Law Minister",
    "Two-wheeler electric vehicles may become expensive: Here's why",
    "Supreme Court allows Jallikattu",
    "People have ‘lost faith’ in BJP govt, Manipur MLAs tell Amit Shah",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Brewery stock jumps as market awaits better Q4 results today. Do you own?",
    "Jungkook of BTS faces death threats, calls for action by ARMY and HYBE agency",
    "Zydus Lifesciences Q4 net profit drops 25% YoY to ₹296.6 cr; declares dividend",
    "G20 collaboration crucial to realize full potential of biofuels, says petroleum secretary",
    "Top 10 Cheapest countries for 1GB of Data",
    "SonyLIV has 33.3 mn paid subscribers globally, 40,000 hours of content",
    "IT Minister says India to regulate AI tools like ChatGPT and Bard: Report",
    "How many steps should you walk each day?",
    "Goldman cuts holdings in Adani ESG funds following fraud claims"
]