[
    "Karnataka Election Result 2023: Congress claims biggest vote share in 34 years",
    "Recession? Corporate America’s earnings say it’s already arrived",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Karnataka Election LIVE: Ashok Gehlot hails Rahul Gandhi's efforts",
    "Congress wins Karnataka. Who will be the CM? Shivakumar vs Siddaramaiah",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Germany is experiencing a mass worker shortage. Can migration fix it?",
    "Cyclone Mocha LIVE: Super cyclone likely to hit Bangladesh-Myanmar coast today",
    "Karnataka Election Result 2023 Winners: Full list of victorious candidates",
    "US debt default: Talks moving along as parties discuss changes, says Joe Biden",
    "DMart Q4 results: Net profit up 8.3% to ₹505.21 cr, revenue up 21%",
    "Karnataka election results: How stock market will react after BJP's loss?",
    "Karnataka Assembly Election 2023: A look at smallest margins of victory",
    "PM Narendra Modi congratulates Congress for winning Karnataka assembly polls",
    "Karnataka election result 2023: Factors that led to Congress winning",
    "Parineeti Chopra, Raghav Chadha engaged. AAP MP tweets images. See here",
    "Indian Navy, NCB seize 2,500 kg drugs; apprehend suspected Pakistani national",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Happy Mother's Day: History, significance, and quotes to share with your moms",
    "Debt ceiling standoff: Spending on Covid gives way to new focus on deficit",
    "Joe Biden's reelection won't be easy; here's why",
    "Cyclone Mocha: Thousand evacuated from Bangladesh, Myanmar coasts as storm nears",
    "Argentina qualifies for 2024 Paris Olympics sevens in reaching Toulouse semis",
    "PM Modi-led committee holds meeting for appointment of new CBI director",
    "Karnataka win a big boost for Congress ahead of 2024 Lok Sabha polls - Explained",
    "Congress vows to fulfil 5 pre-poll guarantees at first Karnataka govt meet"
]