[
    "PNB Q4 Results: Net profit increases 4 folds to ₹1,158 crore, net NPA down 2%",
    "Tesla stops short of committing to India plant in renewed talks",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "SC panel report on Adani-Hindenburg row made public; Group's stocks rise",
    "Gyanvapi Case LIVE: SC stays HC order allowing scientific survey of ‘Shivling’",
    "IT stocks lift Sensex 300 pts, Nifty up 75 pts; Tata Motors jumps; NTPC lags",
    "GAIL India share price falls over 3% as Q4 net profit plummets 77%",
    "Cement stock hits 52-week high ahead of Q4 results today. Do you own?",
    "Mutual funds: Six best-performing large-cap schemes to invest now",
    "ED seizes funds worth ₹8.26 crore of Chinese-owned ed-tech in Bengaluru",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "ITC did not disappoint in Q4 earnings: What should investors do with this stock?",
    "IPL 2023: How RCB's massive win against SRH will change the playoffs dynamics",
    "Japan ‘seriously looking’ at joining India's UPI payments system",
    "BYJU'S refutes claims of hiding $500 million through US-based subsidiary",
    "Why you should buy a personalised health insurance plan",
    "SBI Recruitment 2023: Eligibility, vacancies and how to apply",
    "NCLT rejects IDBI Bank's insolvency plea against Zee Entertainment",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Motherson Sumi Wiring Q4 earnings: Quarterly revenues hit record high, PAT jumps 33%",
    "Protect your eyes in summer with these easy tips",
    "In a first, defence production surpasses ₹1 trillion",
    "Top gainers and losers in trade today: Adani Enterprises, NTPC ; Check list here",
    "Godrej Industries Q4FY23 Results: Net profit up 32% to ₹300 crore",
    "Gyanvapi case: SC defers HC order allowing ‘scientific survey’ of ‘Shivling’",
    "PNB revises FD rates effective from today, promising up to 8.05% to these customers",
    "Stock Market Today: Sensex, Nifty end higher led by IT, financials"
]