[
    "Karnataka Election Result 2023 Winners LIVE: Full list of winning candidates",
    "Bangalore South election results live: BJP's M Krishnappa ahead of R K Ramesh",
    "Belgaum election result 2023 Live: BJP's Abhay Patil ahead with 21,000 votes",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Will RBI extend pause in upcoming policies as April inflation eases to 4.7%?",
    "Cyclone Mocha LIVE: Cyclone Mocha same as category 1 Atlantic hurricane",
    "Gold, silver price retraces from life-time high. Buy or wait for more dip?",
    "Shiggaon Constituency Result Live: Bommai takes lead with over 59,000 votes",
    "Chikmagalur Constituency Result Live: CT Ravi trails by more than 800 votes",
    "Chittapur Constituency Result Live: Mallikarjun Kharge's son Priyank leading",
    "Kolar election results 2023 LIVE: BJP's Varthur Prakash leads by over 500 votes",
    "Hubballi-Dharwad-Central Polls LIVE: Jagadish Shettar trails, BJP leads",
    "Varuna election results live: Congress stalwart Siddaramaiah leading ahead",
    "Chamarajanagar election result LIVE: BJP's V Somanna trails by over 6,000 votes",
    "Karnataka election result 2023: JD(S) leads by 13,900 votes in Chamundeshwari",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Yamaha Motor unveils updated R3 for 2023, expected to make a comeback in India",
    "Online-Only Startups Adopt a Bold New Strategy: Opening Actual Shops",
    "Rekha Jhunjhunwala portfolio: Why this ₹300 bank stock is nosediving?",
    "Karnataka election 2023: Congress crosses majority mark",
    "Shipping ministry ranked 2nd in Data Governance Quality Index among ministries",
    "Royal Enfield files trademark for 'Interceptor Bear 650' name. What to expect",
    "The Kerala Story BO Collection Day 8: Adah Sharma's film close to ₹100 cr club",
    "Karnataka election 2023: BJP minister V Somanna trails by more than 12,000 votes",
    "Karnataka Election Result 2023: BJP, Congress winning candidates list",
    "Amazon Prime Video to stream ‘Modern Love: Chennai’ on 18 May"
]