[
    "IKIO Lighting shares make dream debut at Indian stock market. Buy, sell or hold?",
    "Wipro buyback record date today. Should you tender your shares?",
    "Cyclone Biparjoy LIVE: Cyclone weakens in Gujarat; power outage in 940 villages",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "The great Indian monsoon gamble",
    "Motilal MF’s new micro-cap index fund tests the limits",
    "Public safety as priority: Aim for a paradigm shift",
    "Companies can use a social girdle to reduce corporate p ....",
    "Stock Market LIVE: Banks lift Sensex, Nifty; Bajaj Finserv, HDFC Life shine",
    "PM Modi pens song with Grammy winner; to be launched today",
    "Vodafone Idea abandons 25,000 retail partners as cost cutting measure: Report",
    "Cyclone Biparjoy LIVE tracking: Landfall, current Location and other details",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Can Adipurush, featuring Kriti Sanon-Prabhas, drive PVR-Inox's fortunes in Q1?",
    "‘Manipur has totally failed,’ RK Ranjan Singh after mob torches his house",
    "Bengal: TMC leader ready to give 'qurbaani' as violence erupts",
    "Govt likely to get record ₹63,000 crore dividend from listed PSUs: Report",
    "Ramkrishna Forgings shares hit 52-week high on order win; check details",
    "Zara sells shirt with ‘Hindi words that make no sense’",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Telugu star Gopichand announces new film",
    "Senthil Balaji to undergo bypass surgery soon, tests underway: Kauvery Hospital",
    "Ceat's medium-term growth strategy fails to ignite investor enthusiasm",
    "Stocks to buy today: Why market experts are bullish on auto shares — explained",
    "PM Modi urges global attention to food security at G20 Agri ministers conference",
    "Netflix announces new reality show ‘Social Currency’",
    "Britannia Industries shares up 47% in last one year; is the stock still a buy?",
    "Cyclone Biparjoy: Heavy rains continue; more damages expected today in Gujarat",
    "‘India Can Become A Semiconductor Superpower…’: Vedanta-Foxconn CEO | The Sketch, A Mint Podcast"
]