[
    "Cyient DLM IPO listing: Stock lists at a premium of 52% at ₹403 on NSE",
    "RIL share hits record high after Jio Financial demerger record date announcement",
    "Share Market LIVE: Sensex tops 65,500, Nifty up 50 pts; RIL, Tata Motors jump",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Can M&M retain its SUV edge in the EV era?",
    "For technology firms, Q1 may be a quarter to forget",
    "Cost of education in India: Exploring expenses and infl ....",
    "An upbeat report works best with clarity on risks",
    "The idea of a Universal Civil Code: What Indians at lar ....",
    "Hyundai Exter SUV set to debut in India today: Where and when to watch it live",
    "China: 6 dead, 1 injured in kindergarten stabbing",
    "Rationalisation in GST rates should be implemented gradually: Vivek Johri",
    "How is the tax on EPF interest calculated?",
    "Three private equity groups in race to buy out Adani Capital",
    "Monsoon LIVE News: Himachal CM urges people to stay indoors",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Costly misinterpretation: A thumbs-up emoji leads to a ₹50 lakh fine",
    "GST Council meeting: Opposition states to pressure Centre over compensation",
    "Shah Rukh Khan’s Jawan Prevue: When and where to watch",
    "Himachal Monsoon: Rain continue to batter state; helpline numbers issued",
    "Earthquake of magnitude 4.9 hits Jammu and Kashmir",
    "Twitter ‘relocates’ users of Pakistani region to India, user",
    "Q1 results 2023: TCS, HCL Tech, Wipro, others to announce earnings this week",
    "West Bengal Panchayat Polls",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Jawan Prevue is out: Shah Rukh Khan in a never-seen-before avatar",
    "Cyient DLM share price opens at strong premium. Buy, sell or hold?",
    "Delhi Rain updates: Yamuna water level close to danger mark",
    "How to book train tickets from Gautam Adani's Trainman site",
    "Bajaj Auto shares at an all-time high; here's why",
    "Hyundai Exter SUV launch live updates: Here's where and how to watch livestream",
    "Olectra Greentech shares rally 13% to hit 52-week high on huge order win",
    "Meal on wheels: This is how you can order food on train using Instagram",
    "Global Pet Industries SME IPO: Stock lists at a premium of 6% at ₹52"
]