[
    "SC panel report on Adani-Hindenburg row made public; Group's stocks rise",
    "GAIL India share price falls over 3% as Q4 net profit plummets 77%",
    "Stock Market LIVE: Sensex, Nifty stay flat; Tata Motors, Infy gain; NTPC lags",
    "Cement stock hits 52-week high ahead of Q4 results today. Do you own?",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "The new consumption boom along India's highways",
    "Mutual funds: Six best-performing large-cap schemes to invest now",
    "Gyanvapi Mosque Case Live: SC to hear Muslim side's plea against HC order",
    "ED seizes funds worth ₹8.26 crore of Chinese-owned ed-tech in Bengaluru",
    "ITC did not disappoint in Q4 earnings: What should investors do with this stock?",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "BYJU'S refutes claims of hiding $500 million through US-based subsidiary",
    "Why you should buy a personalised health insurance plan",
    "SBI Recruitment 2023: Eligibility, vacancies and how to apply",
    "NCLT rejects IDBI Bank's insolvency plea against Zee Entertainment",
    "Black Moon to grace the night sky on May 19",
    "‘Rahul Gandhi called me’: DK Shivakumar on why he agreed to be deputy CM",
    "Gland Pharma share price locked at 20% lower circuit after weak Q4",
    "Supreme Court gets two new judges",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "MP polls: Zero electricity till 100 units, bill up to 200 units halved",
    "Italy court set to rule on Agnelli family's inheritance drama",
    "India reports 865 new covid infections in a day",
    "Gland Pharma’s miserable Q4 weighs on the stock; challenges galore"
]