[
    "ideaForge IPO: How Infosys may benefit from drone maker company's public issue?",
    "Maruti Suzuki Invicto's interior leaked. Here's what spy images suggest..",
    "Mint Explainer: New chip announcements represent baby steps",
    "Our early-adopters index examines how corporate America ....",
    "Modi’s US visit underlines India’s growing geopolitical heft",
    "The meaning of Prigozhin’s short-lived mutiny",
    "Diabetes: The ticking time bomb",
    "A strange revolt in Russia: Is this the end of Putin?",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in ....",
    "Indian markets go with the FII flow",
    "ideaForge IPO fully subscribed on day one of bidding. GMP, review, apply or not?",
    "Sensex, Nifty end flat; Adani Ent, Cipla shine; RIL, TCS drag",
    "UAE-based Lulu Group to invest ₹10,000 crore in India over 3 years",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Adani Power commissions 2nd unit of Jharkhand's thermal plant, stock up 2.85%",
    "Byju’s hasn’t paid employees' EPF money for months: Report",
    "OnePlus Nord 3 price leaked: This is how much it may cost",
    "Magson Retail and Distribution IPO fully subscribed on day 2",
    "Why ICICI Pru expert is bullish on auto, pharma, telecom sectors",
    "Essen Speciality Films IPO subscribed 6.82 times so far on day 2",
    "Why this US-based billionair turned down Titanic submersible expedition",
    "Pak billionaire's son, Suleman, carried Rubik's Cube on Titanic - here's why",
    "IdeaForge Technology IPO: Issue fully booked on Day 1; check details",
    "Infosys signs $454 million deal with Danske Bank; here's why",
    "Monsoon news LIVE: IMD issues ‘yellow alert’ for eight districts in Kerala",
    "Adani Enterprises share price",
    "MG Comet EV tobe equipped with Jio's in-car Hinglish voice assistant",
    "UBS raises IndiGo share price target, sees 33% upside; here's why",
    "EPFO launches calculator for higher EPS pension additional contribution",
    "One of five MSMEs to see increase in working capital requirement in FY22: Crisil",
    "Market wrap: Sensex ends flat, Nifty settles below 18,700",
    "Fearing China, Australia rethinks its defence strategy",
    "PM Modi to launch mission to eliminate sickle cell anaemia",
    "LinkedIn set to increase generative AI use to craft and share posts",
    "Delhi's electricity to become costlier; AAP slams Centre | Watch"
]