[
    "Will your deposit interest rates be impacted by the withdrawal of ₹2000 notes?",
    "Vedanta shares jump as dividend stock to consider interim dividend next week",
    "Karnataka oath-taking ceremony LIVE: 8 Congress MLAs to take oath as ministers",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "Sukanya Samriddhi Yojana (SSY) calculator: Your child may have 51 lakh at age 21",
    "After Mamata, Akhilesh to skip Karnataka CM Siddaramaiah swearing-in",
    "WhatsApp fined 4 million RUB in Russia for failing to remove banned content",
    "China to skip G20 meeting in Srinagar, calls Jammu and Kashmir 'disputed'",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Rishi Sunak, wife lose over ₹2000 cr in a year due to fall in Infosys shares",
    "Karnataka swearing-in ceremony on Saturday: Who's invited and who's not?",
    "Karnataka swearing-in ceremony: Date, time, venue, and how to watch live",
    "India plans action against Google after antitrust breaches",
    "Gold price rebounds as US dollar retraces from two month high. Should you buy?",
    "₹2,000 banknotes withdrawal will help curb…: Ex RBI official",
    "₹2000 currency note ban: 'That's why PM should be educated', Delhi CM",
    "PPF account: Why you should not invest in public provident fund? Top 5 reasons",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Karnataka cabinet: These 8 Congress ministers to take oath today",
    "Spend up to ₹7 lakh abroad with your cards without worrying about TCS",
    "Garena Free Fire Max redeem codes May 20, 2023: Get weapons, diamonds, more",
    "‘Sameer sahib,as a father if I can speak with you’, SRK allegedly begs Wankhede",
    "Delhi: AAP hits out at PM after Centre brings Ordinance on control of services"
]