[
    "'Naakami ke 9 saal': Congress highlights 'Parivarvaad' in BJP",
    "Go First Insolvency: Flights suspended till May 30, full refund soon",
    "Asian businesses are being dragged into the chip war",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "The rise and rise of e-sports",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Zerodha's Nikhil Kamath concerned as world may get hit by 'friendship recession'",
    "Delhi airport flight operations disrupted by inclement weather. Check list here",
    "PM Modi to Chair Niti Aayog meet today; Kejriwal along with five CMs opt-out",
    "Karnataka cabinet expansion: 24 legislators to take oath as ministers today",
    "PM Modi pays tribute to Jawaharlal Nehru on his 59th death anniversary",
    "IMF urges crisis-hit Sri Lanka to decide on debt restructuring",
    "‘US debt ceiling deal very close’: President Joe Biden",
    "IPL 2023 MI Vs GT: Shubman Gill's thunderous century glide Titans to finals",
    "Traffic Alert! Avoid these routes on new Parliament inauguration day",
    "UK to enhance science and innovation ties with India",
    "Yellen estimates debt-limit measures will run out by June 5",
    "Delhi-NCR delights in refreshing rainfall",
    "PM Modi to chair 8th NITI Aayog meeting today. Details here",
    "Goldman Sachs hikes India’s 2023 GDP forecast to 6.3%",
    "CBDT starts consultation on angel tax valuation rules",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday - May 29",
    "US lawmaker proposes bill to establish Diwali as federal holiday",
    "BCCI calls special general meeting today: Asia Cup 2023 on agenda",
    "AHSEC set to declare Assam class 12th results soon. Check date and other details",
    "Tips for staying digestively healthy this summer"
]