[
    "PM advises states to follow fiscal discipline; 11 CMs skip NITI Aayog meeting",
    "Will ₹2000 banknotes withdrawal make buying gold expensive?",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "Activist investors are needed more than ever",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Move Over, Mars. Elon Musk Turns His Attention to 2024 ....",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "How laddering, barbell can get you better returns from FDs",
    "Stocks to turn ex-dividend in trading week from May 29 to June 2: check list",
    "GDP, PMI data, auto sales, global trends to dictate Indian markets in week ahead",
    "It would have been good if 'Sengol' got due respect after Independence: PM Modi",
    "UK to hire Indian math, science, language teachers, offers ₹27 lakh salary",
    "Investing ₹10 lakh in small saving schemes? You have to show your income proof",
    "₹2,000 note exchange/ deposit: Know rules for SBI, HDFC, ICICI, other banks",
    "FPIs inflow at ₹37,317 cr in May so far in Indian stocks, highest in 9 months",
    "Aurobindo Pharma reports 12% drop in Q4 consolidated PAT to ₹506 crore",
    "Sun Pharma to buy 100% stake in Taro in all-cash deal; check details",
    "IPL 2023 GT vs CSK Final: How much prize money the winning team will get",
    "Travellers to UK face long waits as passport e-gates at airports down",
    "Athiya Shetty bins claim of her, KL Rahul visiting ‘strip club’. See Insta post",
    "New Parliament Inauguration LIVE: Adheenams handover ‘Sengol’ to PM Modi",
    "Kamal Haasan terms ‘The Kerala Story’ propagandist, says 'I am against. . .'",
    "Karnataka: With 8 Lingayats and 6 Vokkaliga, new cabinet balance caste equations",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Four Gujarat Titans players in race to win Orange and Purple Cap",
    "Should investors buy Emami shares after Q4 results? Here's what experts say",
    "PFC earns consolidated PAT of ₹4,677 crore in Q4, up by 46%; dividend declared",
    "Anurag Kashyap on selecting Sunny Leone for Kennedy, ‘needed a woman who is...’",
    "PTC India logs 8% decline in FY23 net profit at ₹507.15 crore",
    "Apple may discontinue iPhone 12 after iPhone 15 launch. Here's why",
    "Brokerages see up to 35% upside in HDFC Bank share price; here's why"
]