[
    "IdeaForge share price falls 18% as profit-booking follows bumper listing",
    "Q1 Result preview: Oil companies' earnings may improve with Crude below $80/bbl",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "The rise of cyber threats in a digital dystopia",
    "Share Market LIVE: Sensex gains 350 pts; M&M, Bajaj twins shine; UPL lags",
    "Multibagger stock that has surged 650% in three years declares 1:1 bonus shares",
    "GST Council LIVE: 50th Council meet to be held today; Here's what is expected",
    "Delhi rains: Yamuna crosses danger mark, evacuation begins, old bridge closed",
    "Q1 results preview: Here's why pharma companies are expected to show improvement",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "J&K: Supreme Court to hear petitions challenging abrogation of Article 370 today",
    "Brij Bhushan ‘sexually harassed, molested and stalked wrestlers’: Delhi Police",
    "Monsoon LIVE: Himachal's Mandi on the verge of flooding as river Beas swells",
    "New York floods leave one dead, rescue crew race into Vermont after heavy rain",
    "Senco Gold IPO allotment date today. Latest GMP, how to check status online",
    "Andhra Pradesh: 7 dead, 15 injured after bus fell into a canal",
    "Canadian teen caught scribbling at Japan's Toshodaiji Kondo temple",
    "West Bengal panchayat counting starts today. 10 points",
    "US welcomes India's role in helping achieve lasting peace in Ukraine",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "WhatsApp for iPhone gets translucent bar: Check details inside",
    "Barbie Premiere: Actors dazzle in Barbie-inspired outfits on the pink carpet",
    "ESAF Small Finance Bank refiles DRHP; cuts issue size to ₹629 crore",
    "Delhi traffic update: Vehicular movement affected at India Gate as road caves-in",
    "UPL shares touch 52-week low, down nearly 2%; here's why"
]