[
    "Top gainers and losers in trade today: BPCL, Coal India; Check full list here",
    "Bank of Baroda PAT more than doubled in Q4FY23; lender declared ₹5.5 dividend",
    "Mint Explainer: Erdogan exceeds expectations in Turkey’ ....",
    "Mint Explainer: Why do carmakers cheat?",
    "Why ‘natural’ toothpastes are on the wane",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "In Siddaramaiah vs Shivakumar race for Karnataka CM post, 2 more options pop up",
    "IOC Q4 result: Profit rises 52% to ₹10,841 cr, dividend declared",
    "Vodafone to cut 11,000 jobs; check details",
    "Stock Market Today: Sensex, Nifty fall on profit booking",
    "Shapoorji Pallonji Group looks to raise $1.6 bn, may pledge shares in Tata Sons",
    "Gold prices fall by ₹220 to ₹60,807; silver down ₹532 on global cues",
    "Jio, Airtel add 19.8 lakh subscribers, Vodafone Idea loses 20 lakh users in Feb: TRAI",
    "Finance, Auto, and Media drag Sensex below 62,000; HDFC twin lag",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "Karnataka CM decision LIVE: Siddaramaiah, DK to meet Cong high command shortly",
    "Nifty close to record high amid US debt ceiling talks. Will it hit a new peak?",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Wells Fargo to pay $1 billion in class-action lawsuit: Report",
    "IGL up 19% in 2023 but brokerages bearish on the stock; here's why",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Delhi HC orders Ashneer Grover, BharatPe against use of defamatory language",
    "Bharti Airtel Q4FY23 Results: Net profit up 89% sequentially, declares dividend",
    "European Airlines Gear Up for Testing Summer – Talking Markets",
    "Pepe coin price jump 7000% in 17 days of launch",
    "Musk's plea to end ‘Twitter sitter’ deal for Tesla post rejected by US court",
    "That Salon Visit Will Be $250— for Your Dog",
    "Nitin Gadkari receives death threat on phone, probe on"
]