[
    "RBI Monetary policy key highlights: Repo rate pause, policy stance and more..",
    "RBI Governor announces 8 additional measures across segments; check details",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Banks to enter a phase of moderation in credit growth",
    "Tracing the shifting patterns of remittance flows",
    "Aging with grace: Are senior living homes right for you?",
    "India can be an oasis of hope in a crisis-hit world",
    "RBI Monetary Policy Live: MPC decides to keep repo rate unchanged at 6.5%",
    "RBI Monetary Policy: Shrinkage in surplus liquidity between April and May",
    "Stock Market LIVE: Sensex, Nifty turn red as RBI keeps repo rate unchanged",
    "‘Out of anger, I said…, ’ wrestler's father says girl was not sexually harassed",
    "Gold rate today trades range-bound as investors await RBI MPC meeting impact",
    "Cyclone Biparjoy Live: IMD issues light to heavy rainfall alert in these states",
    "Why visa wait time for Indians is 600 days? US says ‘need to fix the delay or …’",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Ind vs Aus Day 2, WTC 2023 Final:India lacked positive mindset by…' Ravi Shastri",
    "RBI Monetary policy: GDP growth estimate for FY24 maintained at 6.50%",
    "RBI Monetary Policy: Shaktikanta Das assures to keep 'close vigil' on inflation",
    "How ₹2000 notes withdrawal helped RBI to maintain status quo on interest rate?",
    "RBI to allow non-bank companies to issue e-RUPI vouchers",
    "RBI Monetary Policy: Governor Shaktikanta Das projects 5.1% inflation for FY24",
    "RBI Monetary Policy: Sensex, Nifty trade higher as RBI maintains status quo",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "CUET PG 2023: Admit card for June 9-11 exam out on cuet.nta.nic.in",
    "‘Illegal betting apps hurt games of skill’",
    "2024 poll results hamein pata hein…: Jaishankar takes a swipe at Rahul Gandhi",
    "Anil Goel buys stake in this advertising stock. Share hits upper circuit",
    "Milestone Furniture shares hit 5% lower circuit as the firm's CA disappears",
    "Microsoft empowers U.S. Federal agencies with OpenAI's Azure Cloud",
    "9 years of PM Modi: ‘Image of India is of economic collaborator,’ S Jaishankar",
    "Early signs and symptoms of brain tumour",
    "5 stocks to watch out for when inflation cools down",
    "Arvind Kejriwal, Delhi LG smile together, inaugurate GGSIU campus | Watch"
]