[
    "GST Council to meet on July 11: Online gaming tax, ITC claim key items on agenda",
    "Foxconn ending Vedanta JV has no impact on India's semiconductor goals: Govt",
    "SBI to divest its 2% equity stake in NSDL IPO via OFS",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "India overtakes China to become most attractive emerging market for investing",
    "Fed likely to lift rates on July 26; how can it impact the market, rupee?",
    "US visa: VFS global to temporarily shut down application process on THESE dates",
    "India to surpass US to become world's 2nd largest economy by 2075: Goldman Sachs",
    "Foxconn dumps $19.5 billion Vedanta chip plan in India, a look at timeline",
    "Four Indian-origin biz leaders in 2023 Forbes' 100 richest self-made women list",
    "Monsoon LIVE News: IMD issues yellow alert for Delhi; expect heavy downpour",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "Tata Motors becomes 16th most valued automaker, beats Kia Corporation m-cap",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "Foxconn pulls out of semiconductor JV, Vedanta says other partners lined up",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Deadly Flash Floods, Storms Wreak Havoc on New York, Vermont",
    "EU Approves Data-Transfer Deal With U.S., Averting Potential Halt in Flows",
    "TCS delays onboarding of lateral recruits, THESE cities' hires impacted: Report",
    "Equity MF inflows hit 3-month high of ₹8,245 crore in June",
    "Sebi defends rules on opaque models, probe timelines before SC",
    "Balkrishna Industries investors tread with care on rough terrain",
    "The Q1 crystal ball for consumer companies",
    "How do I protect myself from a loan fraud?",
    "Secret of success. Anand Mahindra shares tips in his motivation post"
]