[
    "Three top brokers face multiple probes including for money laundering",
    "Upcoming Q4 results: From SBI to IOCL here are the Q4 earnings to watch this week",
    "Mint Explainer: How did the Congress win Karnataka?",
    "India needs special rules to deal with failed airlines",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Inflation, Q4 results, among key triggers for Dalal Street in coming week",
    "2024 Lok Sabha elections to be preluded by heated polls in THESE 5 states",
    "CISCE Class 10th and 12th results 2023 Live: Results announced,direct link",
    "EPF vs VPF vs PPF: Taxation and withdrawal rules explained",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "The No-Email Way to Plan a Party",
    "Companies Are Colluding to Cheat H-1B Visa Lottery, U.S. Says",
    "Actually, Guys, You Won’t Be Ridiculed for Wearing This",
    "Cyclone Mocha LIVE: Super cyclone hits Myanmar, Bangladesh coasts",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "Tata Group to manufacture Apple iPhone 15 and 15 Plus in India, report says",
    "Praveen Sood has been appointed as Director of the CBI for two years",
    "Orange alert for very heavy rainfall issued in these 3 states till 18 May: IMD",
    "Karnataka Results 2023: ‘Modi wave is over’: Sanjay Raut after Congress' big win",
    "UGC to launch user-friendly website, two portals on 16 May: Chairman",
    "Check out upcoming IPOs in May",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Biden pleads for Congress to take steps to curb gun violence",
    "Sebi proposes norms to regulate fractional ownership platforms offering real estate assets",
    "More 'Chinese police stations' likely in Canada, says Minister",
    "Mumbai's Coastal Road Project to be named after Sambhaji Maharaj | 5 points",
    "Honda India Power declares ₹16.50 per share dividend, Q4 PAT slides 62% YoY",
    "Wrestlers to write to BJP women MPs, seeking help, says Vinesh Phogat",
    "IBM employee on sick leave since 2008, says ₹55l salary ‘not generous enough’"
]