[
    "Windfall tax on petroleum crude, ATF, diesel retained at zero",
    "Adani Enterprises to take on IRCTC soon. Inks deal to acquire this company",
    "Mint Explainer: Why did Canada halt ties with China's a ....",
    "Sooner or later, America’s financial system could seize up",
    "Why Indian Defence Stocks are Not Overvalued Yet",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "Gold, silver price jumps as US dollar hits 5-week low. Good opportunity to buy?",
    "Sovereign Gold Bond: Scheme 2023-24 opens next week. Should you apply?",
    "Mutual Fund Investment: These ten mid-caps gave up to 45% return in one year",
    "Sensex, Nifty close to life-time high. Experts recommend these 10 stocks to buy",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Manipur news LIVE: PM Modi must go to Manipur first then to US, says Congress",
    "PNB Housing Finance to consider raising funds of ₹5,000 cr on June",
    "FPIs inflow over ₹16,400 crore in June so far, can this momentum continue?",
    "Nitin Gadkari's responds to politician's advice on joining the Congress",
    "In pics: Mercedes-Benz Vision One-Eleven Concept with Gullwing doors unleashed",
    "Mercedes-Benz unveils futuristic Vision One-Eleven Concept with Gullwing doors",
    "HDFC twins merger: RBI clarifies on HDFC Bank's commercial liabilities",
    "Cyclone Biparjoy LIVE: Amit Shah conducts aerial survey visits Mandvi hospital",
    "Adipurush: Manoj Muntashir responds to Lord Hanuman's ‘jalegi tere..’ dialogue",
    "Assam CM condemns assault on Assamese delivery agent in Karnataka",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Binance, SEC agree to allow only US employees to access customer funds: Report",
    "Indonesia Open: Satwik, Chirag overcome challenge to enter men's doubles final",
    "Jaishankar lauds PM as WHO builds global centre of traditional medicine in Guj",
    "Use technology to strengthen GST registration: FM to officials",
    "Wrestlers approaches Olympic Council of Asia for extension of Asian Games trials",
    "Shell India signs actor Shahid Kapoor as brand ambassador",
    "'Unholy nexus': TMC rules out Cong alliance in Bengal, ‘but at national level…’",
    "Health minister Mandaviya chairs meeting on flood preparedness in Assam",
    "Joe Biden mocked for ending gun control speech with ‘God save the Queen, man’",
    "This is how Japan targets Apple and Google to stoke competition in smartphone app payments"
]