[
    "RIL tests waters in consumer finance",
    "Cheap Russian oil helps India widen petro product exports",
    "A strange revolt in Russia: Is this the end of Putin?",
    "Diabetes: The ticking time bomb",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in ....",
    "Indian markets go with the FII flow",
    "Four surprising facets shaping mutual fund returns",
    "Should your retirement nest be far from the teeming crowd?",
    "India-US relations: Set for a strategic upgrade",
    "Generation AI: It is India’s time to play chief disruptor",
    "Govt, central bank in huddle over stalled real estate projects",
    "HDFC Life’s FY24 may be dull but there are bright spots ahead",
    "Accenture signs up $100 mn Gen AI projects in 4 months",
    "Bulls slash levered bets on Adani Group as US begins probe",
    "E-commerce may cross modern retail by 2030: Deloitte",
    "Russia LIVE: Biden, Zelenskiy discuss Wagner mutiny",
    "Monsoon live updates: Two killed amid heavy rain, Himachal incurs ₹78L damage",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi returns to India after his landmark visit to US, Egypt",
    "Which ITR form should I use to file returns?",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in the offing",
    "Big B’s new digital self to redefine fan connect",
    "Patna-Ranchi Vande Bharat Express: Route, timings, stoppages, other details",
    "India to remove retaliatory customs duties on eight US products",
    "Adani Enterprises share price",
    "Horoscope Today: Money astrological predictions for 26 June 2023",
    "China is helping Pakistan Army build defence infrastructure along LoC: Officials",
    "Go First secures ₹450 cr funding",
    "The quest to soften America’s labour market has a downside"
]