[
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore; declares dividend",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the next cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Stock Market LIVE: Sensex, Nifty turn flat; Realty, PSU Bank, Pharma drag",
    "Who is Arjun Ram Meghwal, the newly appointed law minister of India?",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Instagram down for some users, facing glitch in Stories",
    "ITC share price jumps ahead of Q4 results today. Buy, sell or hold?",
    "Bharti Airtel Q4 results: Should you buy, sell or hold?",
    "CUET UG 2023 Admit Card likely today on cuet.samarth.ac.in",
    "Arjun Ram Meghwal replaces Kiren Rijiju as Law Minister",
    "Two-wheeler electric vehicles may become expensive: Here's why",
    "Supreme Court allows Jallikattu",
    "People have ‘lost faith’ in BJP govt, Manipur MLAs tell Amit Shah",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "The Kerala Story: Art has to be provocative, says Harish Salve",
    "Swiggy's food delivery business turns profitable: CEO",
    "Volkswagen launches upgraded Tiguan SUV in India. Details on new features, more",
    "Global T20 Canada league to resume this year for third season",
    "What is a Credit Score and 7 Strategies to Improve it",
    "SC to hear plea challenging Allahabad HC determining age of ‘Shivling' tomorrow",
    "Brewery stock jumps as market awaits better Q4 results today. Do you own?",
    "Jungkook of BTS faces death threats, calls for action by ARMY and HYBE agency"
]