[
    "Manipur violence: Nine killed in a gunfight",
    "Explained: How the US Fed rate hike will impact the Indian stock market",
    "Stock Market LIVE: Sensex, Nifty turn flat; Airtel drags; Tata Consumer gains",
    "Cowin data breach: Assessing the risk of recurring attacks",
    "In charts: How easing costs lifted India Inc’s profits in Q4",
    "EU deforestation law may hit Indian exports worth $1.3 billion",
    "Despite low inflation print, RBI may hold firm on rate cuts",
    "Wet paint alert: Can Grasim Industries surprise Berger Paints?",
    "Why you should avoid filing tax returns before 15 June",
    "Our economic optimism needs a touch of realism",
    "Promoter’s professionalization dilemma: To be or not to be ‘pro’",
    "Cyclone Biparjoy LIVE: IMD warns of floods, power outage this week",
    "IndiGo says not aware of co-founder's stake sale plans; shares rise",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Bengaluru-Mysuru Expressway: Netizens react after NHAI hikes toll charges by 22%",
    "Tamil Nadu Minister V. Senthil Balaji arrested in money laundering case",
    "Gold Price Today: Rates rise in early trade; what should be your strategy today?",
    "Will ‘cyclone’ Biparjoy impact monsoon further? Here's what IMD scientist said",
    "‘Cruel intentions…’ CM MK Stalin slams BJP over Senthil Balaji arrest",
    "Cyclone Biparjoy: IMD issues flood warning in these areas",
    "‘Being treated like school children’: Google employees on stricter work from home policy",
    "Kotak Mahindra Bank share price in focus as board to consider raising funds",
    "CSK’s cryptic post sparks speculations on MS Dhoni’s retirement from IPL",
    "'Father’s love is unique': Vedanta boss Anil Agarwal shares 'box of memories'",
    "Cyclone Biparjoy: State of emergency declared in Pakistan's Balochistan province",
    "Bengaluru-Mysuru Expressway",
    "Adani Enterprises share price",
    "Toyota develops solid-state batteries for next-gen EVs, targets 1,000 km range",
    "First Hindu-American summit in US: All you need to know",
    "‘This one will pass as well’: What Reddit CEO has to say on the blackout",
    "Here's how to check Sonalis Consumer Products IPO allotment status",
    "Raghuram Rajan's Revelations on India's Mobile Phone Exports: Intriguing Insights | Mint Explains",
    "Half of all ₹2k notes returned | Mint Primer | Mint",
    "Why India may outperform Asian and emerging market peers? | Mint Explains | Mint",
    "AP EAPCET result announced: Here's where to check result",
    "Netflix to stream second part of documentary ‘Break Point’"
]