[
    "Capital markets regulator Sebi proposes to trim IPO listing timeline to 3 days",
    "Delhi CM to challenge Centre's ordinance on services matter in SC",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "How to exchange ₹2000 notes in a bank: A step-by-step guide",
    "SEBI proposes institutional mechanisms for AMCs to prevent market abuse, frauds",
    "PM Modi meets Ukraine President Zelenskyy, calls the war ‘an issue of humanity’",
    "Karnataka cabinet: G Parameshwara, KH Muniyappa, KJ George, MB Patil take oath",
    "Karnataka LIVE: All 5 'guarantees' given 'in principle' approval, says CM",
    "India will be happy to host Quad summit in 2024: PM Modi",
    "Big change coming from June for unclaimed deposits in bank accounts",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "SBI to PNB: Why you should buy PSU bank stocks after ₹2000 notes withdrawal?",
    "MSCI rejig: Adani shares log worst week since Feb 2023. Loses $10 billion m-cap",
    "Siddaramaiah govt gives ‘in principle’ approval to implement 5 ‘guarantees’",
    "Karnataka swearing-in ceremony: Nitish, Sharad Pawar, etc, list of invitees",
    "PM Modi meets world leaders at G7 Summit 2023",
    "Can you use ₹2000 banknotes for normal transactions?",
    "What to do if the bank refuses to exchange or accept ₹2000 notes?",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PM Modi meet French President Macron to review bilateral relations",
    "Assam issues dress code for teachers in state-run schools; bans jeans, leggings",
    "EPFO adds 13.4 lakh net members in March, showing steady growth",
    "Nilkamal recommends 200% dividend, Q4 PAT up 141% YoY",
    "Amazon Blockbuster Value Days: Deals on smartwatches, headphones, tablets, more"
]