[
    "Amazon's cloud unit to invest $12.7 billion in India by 2030, reports say",
    "ITC, SBI, GAIL to Tata Elxsi: These companies to declare Q4 results today",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Index numbers for social issues need to be impartial by design",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Go First to resume flight operations from May 27: Report",
    "Stocks to Watch: HDFC Bank, Pricol, Uno Minda, Adani Group, Jindal Stainless",
    "Global market: SGX Nifty to US dollar — key triggers for stock market today",
    "BSE Odisha 10th result 2023 LIVE: Odisha matric results to be out shortly",
    "US court approves extradition of Tahawwur Rana to India for 26/11 attack",
    "Day trading guide for today: Five buy or sell stocks for Thursday — 18th May",
    "How consistent growth can fuel high returns",
    "Former union minister Rattan Lal Kataria dies at 71",
    "Jeffrey Epstein Sexual Abuse Case: Deutsche Bank agrees to pay $75 million to se",
    "NDTV to launch 9 news channels in different languages",
    "‘Unfair to Magneto..’: Elon Musk on comparing X-Men villain with George Soros",
    "2024 Lok Sabha polls: ‘Other parties should help Congress’, says JD-U leader",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Russia, Ukraine extend grain deal amidst ongoing conflict",
    "Asus debuts 13 new gaming laptops in India. Details on price, specs and more",
    "People in Japan are learning how to smile; yes, you read that right!",
    "Does work-life balance exist in healthcare industry? Doctors say this",
    "Rupee opens flat at 82.35 against US dollar",
    "Nexus Select Trust IPO: What GMP signals as all eye set on listing date?"
]