[
    "Multibagger IPOs: 5 SME issues that listed in June are up between 125% to 190%",
    "Sebi issues rules for PE backed MFs",
    "Maharashtra News Live: 'Give NCP symbol to us', Praful Patel requests EC",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "West Bengal Election LIVE updates: Death toll rises to 22",
    "Monsoon Rain LIVE: Heavy rainfall claims four lives in Karnataka",
    "Prince Harry's return to UK: It's not about the royal family, but...",
    "Mumbai rain: IMD predicts moderate to heavy rainfall, many areas waterlogged",
    "‘US has no role': Congress leader on Eric Garcetti's comments on Manipur",
    "How does Noida stand out amid sluggish real estate market? 5 factors explained",
    "Monsoon tracker: Heavy rainfall lashes several states today. Check IMD forecast",
    "Students break down in tears at teacher's retirement in viral video | WATCH",
    "Watch: 10-year-old wows with skateboarding skills",
    "Banks submit expected credit loss impact estimates to RBI",
    "FPIs’ derivatives bets signal profit booking for now",
    "KTR hits out at ‘anti-Telangana’ PM Modi",
    "Sourav Ganguly turns 51! Dada's big achievements that made headlines",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Maharashtra Political Crisis: Sharad Pawar commences statewide tour. 10 points",
    "West Bengal's panchayat election today. 10 updates",
    "Rajasthan Temple new dress code: No entry to visitors wearing ripped jeans",
    "‘Lost 60% overnight’, investors after Reliance Retail share capital reduction",
    "‘Be careful’: Joe Biden warns China's Xi Jinping after Putin meeting",
    "Russia's rival push for the approval of UN aid to Syria from Turkey",
    "Does sunscreen increase cancer risks"
]