[
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Cyclone Biparjoy: IMD issues flood alert in THESE Gujarat districts",
    "Is the global housing slump over?",
    "Mint Explainer: Why Boris Johnson’s dramatic exit is ba ....",
    "How the new generation of weight-loss drugs work",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "Jitters behind glass and steel facades",
    "Can Rishad Premji rejuvenate Wipro?",
    "Stock Market LIVE: Sensex tops 63000, Nifty up 100 pts; Asian Paints, Titan gain",
    "Income tax alert: Pay your first instalment of advance tax by this date",
    "Murder of democracy…: BJP, Congress spat over Jack Dorsey's claim",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Tremors felt in Delhi: Earthquake of magnitude 5.7 in Jammu & Kashmir",
    "Best Bakery Case: Mumbai Court acquits two accused",
    "Twitter to be 'world's most accurate real-time info source': CEO Linda Yaccarino",
    "How to become rich: Five money lessons you should teach your child",
    "MRF becomes the first Indian stock to touch ₹1 lakh per share mark",
    "Indian auto sector registers May’s highest-ever passenger vehicles sale in 2023, SIAM data shows",
    "IMD predicts extremely heavy rains in these states today, orange alert issued",
    "Cyclone LIVE: Amit Shah chairs meeting with state disaster management ministers",
    "Govt charts new rules for Oppo, Realme, and other Chinese mobile companies",
    "Uttarakhand communal tension",
    "Punjab and Sind Bank share price",
    "HDFC Life Stock Live updates",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "US student visa interview: Appointment dates to be released soon.",
    "In pics: 10 best-selling cars in May 2023",
    "L&T bags ‘significant’ orders for hydrocarbon business",
    "AIADMK reconsidering alliance with BJP after Annamalai's remark on Jayalalithaa",
    "Ask Automotive files DRHP with SEBI for IPO launch. Details here",
    "Air India grounds two pilots for inviting female friend into cockpit",
    "IndiGo says not aware of co-founder Gangwal family's stake sale plans",
    "Xiaomi Pad 6 launches with Qualcomm processor and up to two days battery",
    "King Charles not his real father: Prince Harry opens up on romour"
]