[
    "Zest Money's Lizzie Chapman, other co-founders resign after PhonePe deal fails",
    "Govt 'stands' by 2021 Parliament reply that Sebi was investigating Adani Group",
    "NSE India Q4 results: Net profit up 31% year-on-year; declares dividend",
    "What’s happening to Whatsapp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Measuring India’s manufacturing sector remains a data challenge",
    "Govt cuts windfall tax on crude oil to zero",
    "PVR Q4 Results: Net loss at ₹333.4 cr, revenue up 113%",
    "Airtel Q4 Preview: Revenue growth modest, swift mid-term growth",
    "Go First insolvency: NCLAT to hear lessors' plea on May 22",
    "Karnataka CM decision LIVE: Congress says decision by Tuesday evening",
    "How BS Yediyurappa's exit may have cost BJP in Assembly polls in Karnataka?",
    "Microsoft gets EU approval for Activision acquisition",
    "WhatsApp will allow users to lock and hide conversations with'Chat Lock’feature",
    "Amid strong global trends, gold up by ₹370, silver soars by ₹750",
    "India's exports fall 12.7% to $34.66 billion in April",
    "PVR INOX plans to shut down 50 cinema screens in next six months. Details here",
    "Adani-Hindenburg case: SC adjourns hearing SEBI's plea for extension of probe",
    "Bank Nifty Projections: Can Nifty Bank hit the 45,000 mark soon?",
    "Top gainers, losers in trade today: Tata Motors, ITC, Cipla; Check list here",
    "Multibagger Chemical Stock",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Supreme Court to Hear Case on Trump Hotel",
    "Microsoft’s $75 Billion Activision Blizzard Deal Gets EU Approval",
    "Vice Media to Sell Itself as It Files for Bankruptcy",
    "Tube Investments net profit zooms 74%",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Former SVB CEO Greg Becker to Apologize for Bank Collapse",
    "SpaceX hires ex-NASA official Kathy Lueders for Starship program",
    "Emmanuel Macron Courts Elon Musk Amid Duel With U.S. for Battery Supremacy",
    "Royal Bengal tigress gives birth to cubs in Delhi zoo after 18 years",
    "Horoscope Today: Money astrological predictions for 16 May 2023"
]