[
    "Market wrap: Sensex, Nifty end higher; mid, smallcaps hit all-time high",
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Cyclone Biparjoy: IMD issues flood alert in THESE Gujarat districts",
    "Mint Explainer: What is Silvio Berlusconi’s legacy?",
    "Is the global housing slump over?",
    "Mint Explainer: Why Boris Johnson’s dramatic exit is ba ....",
    "How the new generation of weight-loss drugs work",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "Jitters behind glass and steel facades",
    "Income tax alert: Pay your first instalment of advance tax by this date",
    "BJP calls Dorsey's ‘govt pressure’ charge ‘white lie’, Oppn says ‘no reason'",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Tremors felt in Delhi: Earthquake of magnitude 5.7 in Jammu & Kashmir",
    "Best Bakery Case: Mumbai Court acquits two accused",
    "Sensex tops 63000, Nifty ends 100 pts higher; Asian Paints, Titan gain",
    "Twitter to be 'world's most accurate real-time info source': CEO Linda Yaccarino",
    "How to become rich: Five money lessons you should teach your child",
    "MRF becomes the first Indian stock to touch ₹1 lakh per share mark",
    "Indian auto sector registers May’s highest-ever passenger vehicles sale in 2023, SIAM data shows",
    "IMD predicts extremely heavy rains in these states today, orange alert issued",
    "Cyclone LIVE: Amit Shah chairs meeting with state disaster management ministers",
    "Govt charts new rules for Oppo, Realme, and other Chinese mobile companies",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "Gujarat braces for Cyclone Biparjoy, do's and don'ts to stay safe. Read here",
    "Jitan Manjhi's son Santosh Suman resigns from Nitish cabinet in Bihar",
    "BAM Digital Realty to set up new data center in Mumbai",
    "Juhu drowning: 3 of five boys die, one remains missing as search ops continue",
    "Redmi Buds 4 Active TWS earbuds launched in India. Check price, specifications",
    "Cell Point India IPO: GMP, price, date other details in 10 points",
    "New bank locker rules: SBI asks customers to do this. Check details",
    "These are Indians' favourite destinations abroad"
]