[
    "Bharti Airtel Q4 result: Firm announces dividend, details here",
    "Infosys bags order from bp, to manage its end-to-end application services",
    "Top gainers and losers in trade today: BPCL, Coal India; Check full list here",
    "Increasing maternity leave isn’t as progressive as it sounds",
    "Mint Explainer: Erdogan exceeds expectations in Turkey’ ....",
    "Mint Explainer: Why do carmakers cheat?",
    "Why ‘natural’ toothpastes are on the wane",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "Bharti Airtel Q4FY23 Results: Net profit up 89% sequentially, declares dividend",
    "In Siddaramaiah vs Shivakumar race for Karnataka CM post, 2 more options pop up",
    "Gold prices fall by ₹220 to ₹60,807; silver down ₹532 on global cues",
    "SC collegium recommends appointment of AP HC Chief Justice PK Mishra",
    "Vodafone to cut 11,000 jobs; check details",
    "IOC Q4 result: Profit rises 52% to ₹10,841 cr, dividend declared",
    "Bank of Baroda PAT more than doubled in Q4FY23; lender declared ₹5.5 dividend",
    "Stock Market Today: Sensex, Nifty fall on profit booking",
    "Jio, Airtel add 19.8 lakh subscribers, Vodafone Idea loses 20 lakh users in Feb: TRAI",
    "Shapoorji Pallonji Group looks to raise $1.6 bn, may pledge shares in Tata Sons",
    "Finance, Auto, and Media drag Sensex below 62,000; HDFC twin lag",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "Karnataka CM decision LIVE: DK Shivakumar meets Mallikarjun Kharge in Delhi",
    "Nifty close to record high amid US debt ceiling talks. Will it hit a new peak?",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Missed Shiba Inu? Don't Miss the Next Viral Crypto: Tradecurve",
    "JSPL Q4 result: Net profit decline by 69% to ₹462 cr, dividend declared",
    "Gene-Therapy Investors Have a Powerful Ally: Patients",
    "Projects worth ₹14,659 crore approved under PMMSY: Rupala",
    "In pics: Samsung Galaxy S23 Lime colour variant",
    "Defence ministry announces successful indigenisation of 164 key items",
    "Oil trades steady after China's economy loses steam; key factors affecting rates",
    "ChatGPT new update allows it to browse internet, provide more accurate responses",
    "NITI Aayog member bats for increasing maternity leave to 9 months"
]