[
    "HDFC Bank will participate in NSDL IPO, to divest 2% stake",
    "Rainfall wreaks havoc in N. India. Red alerts issued, schools closed. Top points",
    "Here’s how India can turbocharge e-commerce exports",
    "The global fight against inflation is far from over",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "West Bengal panchayat election: SEC announces repolling date for certain areas",
    "Macro woes, wage hikes to impact IT companies Q1 earnings; here's how",
    "Global events to watch out for this week: BoE gov Bailey's speech, US core CPI",
    "Adani raises $1.4 bn from stake sale in 3 companies; $9 bn raised in 4 years",
    "Assam CM takes jibe at Rahul Gandhi for joining farmers, says ‘Desire of Prince’",
    "Delhi schools to remain closed tomorrow due to heavy rainfall: CM Kejriwal",
    "3 stocks dominate nearly half of Warren Buffett's dividend income; who are they?",
    "BBC suspends presenter after claims of paying a teenager for explicit photos",
    "Maharashtra: Chhagan Bhujbal attacks Sharad Pawar, says rebellion in NCP took place in his family",
    "Monsoon Fury LIVE: Trains cancelled on Shimla-Kalka route amid heavy rainfall",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Historic! Transgender model crowned Miss Universe Netherlands",
    "Delhi gets highest rainfall in 40 years, downpour wreaks havoc | WATCH",
    "Monsoon Rain: Alert issued for heavy rainfall in THESE states for next two days",
    "Indian startups raise $3.8 bn in H1 of 2023, lowest half-yearly funding in 4 yrs",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "The world’s largest spherical structure is a new tourist attraction of Las Vegas",
    "Govt taps hospitals on medical devices",
    "How much does schooling cost in India and what is its inflation rate?",
    "How is the tax on EPF interest calculated?",
    "How banks could jeopardize your credit rating",
    "‘Coal gasification business to get VGF scheme in 3 months’",
    "Goyal heads for UK amid convergence in trade deal",
    "For IT cos, Q1 may be a quarter to forget"
]