[
    "Karnataka Election Result 2023: Congress claims biggest vote share in 34 years",
    "Congress wins Karnataka. Who will be the CM? Shivakumar vs Siddaramaiah",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Karnataka Election LIVE: Basavaraj Bommai resigns as CM",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Germany is experiencing a mass worker shortage. Can migration fix it?",
    "DMart Q4 results: Net profit up 8.3% to ₹505.21 cr, revenue up 21%",
    "Cyclone Mocha LIVE: Thousands flee as Cyclone Mocha heads to Bangladesh, Myanmar",
    "Karnataka Election Result 2023 Winners LIVE: Full list of victorious candidates",
    "Karnataka election results: How stock market will react after BJP's loss?",
    "Karnataka Assembly Election 2023: A look at smallest margins of victory",
    "PM Narendra Modi congratulates Congress for winning Karnataka assembly polls",
    "Karnataka election result 2023: Factors that led to Congress winning",
    "Parineeti Chopra, Raghav Chadha engaged. AAP MP tweets images. See here",
    "Indian Navy, NCB seize 2,500 kg drugs; apprehend suspected Pakistani national",
    "Real Madrid lose $440 million sponsorship battle with Abu Dhabi fund",
    "Karnataka elections result 2023: BJP MLA who imposed Hijab ban defeated by Cong",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Karnataka Election result 2023: A look at MLAs who won by a landslide margin",
    "ICSE Class 10, 12 results to be released on May 14 - When and where to check?",
    "Kolar Result: Congress' Kothur Manjunatha beats CMR Srinath",
    "Chamumdeshwari Result: JDS's GT Devegowda beats Congress' S Siddegowda",
    "India plans repatriation of Kohinoor, colonial artefacts from UK: Report",
    "Karnataka polls 2023: 'Kudos for not just..', Kamal Haasan congratulates Rahul"
]