[
    "RBI will strive to lower CPI to 4%; El Nino a challenge for food inflation: Das",
    "India's swipe on Barack Obama’s remark on Indian Muslims",
    "Byju's tells investors it will file 2022 earnings by Sept: Report",
    "Mint Explainer: How a strong El Nino would hamper India ....",
    "Why India should look to design and build its own jet engines",
    "Mint Explainer: How Saudi Arabia wrangled a seat at gol ....",
    "How ISRO’s partnership with NASA will boost India’s spa ....",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Adani Group eyes ₹90,000 crore EBITDA in next 2-3 years",
    "LIVE: US says Wagner Group rebellion in Russia ‘may not’ be over yet",
    "Over two-thirds of ₹2,000 notes returned in 1 month of withdrawal: RBI",
    "Monsoon live updates: NDRF rescues over 120 people as Assam floods",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Amid crackdown, platform seeks govt help to make 'porn normal and boring'",
    "PM Modi awarded ‘Order of the Nile’, Egypt's highest state honour: Top points",
    "Go First creditors approve ₹425 crore interim fund to revive operations",
    "IMD issues flash flood risk warning for Himachal Pradesh for next 24 hours",
    "These 4 Bajaj stocks to turn ex-dividend this week. Do you own any?",
    "Six of top-10 valued firms lose ₹1 lakh crore in Mcap; check winners, losers",
    "IPOs this week: ideaForge Tech, Cyient DLM, PKH Ventures, other. Check details",
    "NTPC issues NCDs of up to ₹12,000 cr via private placement",
    "Taylor Swift's Singapore tour prompts fans to appeal for school holiday",
    "Adani Enterprises share price",
    "India to remove retaliatory customs duties on eight US products",
    "PM Modi visits Pyramids Of Giza in Cairo",
    "Gauhati HC stays WFI polls amid wrestlers' protests - Here's why",
    "Car washed away as heavy rain lashes Panchkula in Haryana",
    "RattanIndia Power raises fresh loan of ₹1,114 crore led by Kotak Mahindra Bank",
    "Aditya Birla Launches New Guaranteed Pension Plan - ABSLI Nishchit Pension Plan",
    "In pics: BYD Dolphin entry-level hatchback"
]