[
    "Telcos likely to see modest growth in Q1 as disruptive phase is well behind",
    "Rainfall wreaks havoc in N. India. Red alerts issued, schools closed. Top points",
    "Here’s how India can turbocharge e-commerce exports",
    "The global fight against inflation is far from over",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "Himachal Pradesh: Videos that bear testimony to havoc caused by torrential rain",
    "HDFC Bank will participate in NSDL IPO, to divest 2% stake",
    "West Bengal panchayat election: SEC announces repolling date for certain areas",
    "Wall Street week ahead: Investors await inflation data, big banks’ earnings",
    "Adani raises $1.4 bn from stake sale in 3 companies; $9 bn raised in 4 years",
    "Assam CM takes jibe at Rahul Gandhi for joining farmers, says ‘Desire of Prince’",
    "Monsoon Fury LIVE: Amit Shah dials Punjab, Himachal Pradesh CM, assures help",
    "Maharashtra: Chhagan Bhujbal attacks Sharad Pawar, says rebellion in NCP took place in his family",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Macro woes, wage hikes to impact IT companies Q1 earnings; here's how",
    "Global events to watch out for this week: BoE gov Bailey's speech, US core CPI",
    "Delhi schools to remain closed tomorrow due to heavy rainfall: CM Kejriwal",
    "'I'm a wire, workers are plug, switch and light bulb': BJP's MP poll in-charge",
    "BTS Army Day: K-pop band marks 10 years of fandom with release of first book",
    "BBC suspends presenter after claims of paying a teenager for explicit photos",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Can M&M retain its SUV edge in the EV era?",
    "The world’s largest spherical structure is a new tourist attraction of Las Vegas",
    "Govt taps hospitals on medical devices",
    "How much does schooling cost in India and what is its inflation rate?"
]