[
    "India market-cap touches record high in rupee terms, at ₹292 lakh crore",
    "Stock Market LIVE: Sensex, Nifty turn flat; IndusInd, Infy drag; Nestle shines",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "Price of prestige: Exploring the allure of club members ....",
    "Overall stability is a key goal of monetary policy",
    "Indian official statistics could be revolutionized at t ....",
    "IKIO Lighting IPO: GMP signals strong debut of shares on listing date",
    "ED arrests M3M promoters, Basant and Pankaj Bansal, Hitender Rao",
    "Cyclone Biparjoy LIVE: Cyclone to make landfall today in Gujarat",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "New issue of sovereign gold bond scheme to open next week. Key things to know",
    "Google Maps gets three new features: Glanceable directions, Immersive View, more",
    "Cyclone Biparjoy in Pakistan: Here's how Pak is preparing for cyclonic storm",
    "Flipkart and PhonePe could be $100 billion businesses in India, says Walmart CFO",
    "US lawmaker calls for immediate defence ties with India",
    "Cyclone Biporjoy: High tide waves hit Gujarat, Maha as storm intensifies. Watch",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Cyclone Biparjoy: Red alert issued, rescue team on standby. 10 pts",
    "6.5 magnitude earthquake strikes northern Philippines",
    "TCS share price edges lower on dividend record date. Details here",
    "Tata Steel inks deal with Germany's SMS group to cut carbon emissions",
    "Bengaluru-Mysuru Expressway",
    "Adani Enterprises share price",
    "Adipurush Box Office collection: Day 1 may create all-time record",
    "Varun Beverages shares rally over 6% after stock split",
    "Soundtracks of web series, films strike a chord with music lovers",
    "Ahead of PM Modi's visit, Defence min to chair MQ-9 Reaper drone deal with US",
    "How AI will impact the auto sector. Everything you need to know...",
    "China cuts key interest rate in 10 months amid post-Covid recovery slowdown",
    "Most train accidents due to human error, not sabotage | Mint Primer | Mint",
    "MG's Comet: Revolutionizing India's Auto Industry? | Mint Explains | Mint",
    "‘Anybody who wants..’ Congress in Karnataka open to Adani investments"
]