[
    "Uttarakhand: Dehradun to Delhi Vande Bharat Express train flagged off by PM Modi",
    "Meta layoffs: Top executives in India terminated in latest job cuts",
    "Stock Market LIVE: Sensex down 150 pts; Adani Ent, Tata Motors lag; Airtel gains",
    "Ron DeSantis has little chance of beating Donald Trump",
    "Can India become a developed nation by 2047?",
    "Breaking down India’s diesel plan, in 5 charts",
    "Strategic response: India's standardization efforts to ....",
    "Beyond inflation: Exploring the roadmap for global econ ....",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Invest long term, invest in India: Quant founder Sandeep Tandon",
    "The Centre must not become reliant on RBI payouts",
    "ITC, Bajaj Auto, Britannia, TVS Motors, among stocks that hit 52-week high",
    "UK's new visa rule puts Indian students in jeopardy. Here's how",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "Gold price today: Yellow metal falls in futures trade; what should you do?",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "BMW unveils next-generation 5 series luxury sedan and introduces all-new i5 electric sedan",
    "DCGI asks these state labs to give ‘top priority’ to testing cough syrup samples",
    "Online ticket booking to Andaman and Nicobar islands resumes amid project row",
    "Honda Cars India to increase prices of City and Amaze sedans by this much…",
    "Your bank fixed deposit (FD) may not fetch 7-9% interest after tax",
    "Fitch puts US AAA rating on 'negative watch' as debt ceiling deadline looms",
    "Nykaa shares fall over 2% after Q4 profit declines nearly 72%",
    "LIC stock up nearly 2% post strong Q4 results",
    "Adani Enterprises share down by 2% as moved back to ASM framework",
    "GSEB SSC Gujarat Board Result",
    "Delhi-Dehradun Vande Bharat Express Train",
    "PSEB Class 10th, 12th Results 2023",
    "Update Aadhar Card Details",
    "Maharashtra HSC Result 2023 LIVE",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Sunil Gavaskar gets trolled for trying to school Naveen-ul-Haq",
    "RBI may buy $18 bn of bonds to boost liquidity, says B. Prasanna of ICICI",
    "Satyendar Jain admitted to hospital after falling in Tihar Jail bathroom",
    "ChatGPT empowers writer to pen 100+ novels, selling over 500 copies!",
    "PM Modi flags off Delhi-Dehradun Vande Bharat Express",
    "ITC shares hit fresh 52-week high; should you buy?",
    "Sony PlayStation Showcase recap: Major announcements",
    "How the US debt ceiling will impact the stock market",
    "Rocky Aur Rani Ki Prem Kahani: Check release date of Ranveer-Alia's next"
]