[
    "Cyient DLM IPO: What GMP, subscription status reflects about the public issue",
    "WHO research agency identifies Aspartame sweetener as possible Carcinogen",
    "ideaForge IPO: What GMP signals after strong response by investors?",
    "India’s low current-account deficit may not be good news",
    "India’s stock market rally should survive the coming Fe ....",
    "Talking about AI in human terms is natural—but wrong",
    "The choice between a poorer today and a hotter tomorrow",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Manipur Live: Congress slams BJP after Rahul Gandhi's convoy stopped by cops",
    "National Geographic lays off its last staff writers: Reports",
    "BPCL rights issue: Maharatna company to raise up to ₹18000 crore. Details here",
    "PKH Ventures IPO opens on June 30: Here are 10 key things to know",
    "Farooq Abdullah urges Centre ‘rethink’ implementation Uniform Civil Code",
    "Cabinet approves ₹3.7 trillion for fertilizer subsidy schemes",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Allahabad High Court slams makers of Adipurush, says if documentary on Quran…",
    "Senco Gold IPO to open on July 4, price band announced; check details",
    "Xiaomi India cuts jobs amid market slump, staff reduced to less than 1000: Report",
    "Monsoon LIVE: Heavy rains predicted in Karnataka coast for next 10 days",
    "Australia: New visa rules applicable for Indian students from July 1",
    "Why all parents must open a PPF account for kids?",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Synoptics Technologies IPO: SME issue opens tomorrow. GMP, other details?",
    "UK-India week 2023: Rishi Sunak honours 101-year-old Sikh World War II veteran",
    "This is how Apple AirTag helped family to catch thieves..",
    "UK-India Week 2023: PM Rishi Sunak welcomes leaders to celebrate. In Pics",
    "Mutual fund investment: These flexi-cap schemes beat PPF, bank FD returns",
    "Rahul Gandhi's convoy stopped by cops in Manipur, Cong leader returns to Imphal",
    "LGBTQ+ finds startups, MNCs 'safest' workplace! Thanks to GenZ, millenials",
    "McCann India secures advertising, marketing mandate for Air India"
]