[
    "Global market: Key triggers to dictate Indian stock market today — 16th May",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Measuring India’s manufacturing sector remains a data challenge",
    "Stocks to Watch: HDFC, Pfizer, Adani Group, PVR Inox, P&G Health, Vedanta",
    "Day trading guide for today: Six buy or sell stocks for Tuesday — 16th May",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — May 16",
    "Amazon India layoffs: Tech giant lays off about 500 employees: Report",
    "Karnataka CM decision LIVE: Shivakumar leaves for Delhi, says, ‘I’m going alone'",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Vande Bharat Express: This route to have less travel time, more available seats",
    "A month ahead of PM Modi visit, US criticises India over religious freedom",
    "Zest Money's Lizzie Chapman, other co-founders resign after PhonePe deal fails",
    "Go First insolvency: NCLAT to hear lessors' plea on May 22",
    "Airtel Q4 Preview: Revenue growth modest, swift mid-term growth",
    "PVR Q4 Results: Net loss at ₹333.4 cr, revenue up 113%",
    "Govt cuts windfall tax on crude oil to zero",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Delhi school gets bomb threat via e-mail",
    "Cannes 2023: These Indians will debut at the prestigious film festival",
    "National Dengue Day 2023: What is the significance?",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "‘Need more theatres…’ Kangana Ranaut on PVR INOX shutting 50 cinema screens",
    "LIC-backed multibagger stock gives 450% return in one year. Do you own?",
    "Mohammed Shami: I'm in Gujarat, I won't get the food I like",
    "Rupee opens 7 paise higher against US dollar",
    "Top 10: World's most expensive places to live in",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today"
]