[
    "PM Modi meets Ukraine President, calls the war ‘an issue of humanity’ | Watch",
    "MSCI rejig: Adani shares log worst week since Feb 2023. Loses $10 billion m-cap",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "SBI to PNB: Why you should buy PSU bank stocks after ₹2000 notes withdrawal?",
    "Karnataka swearing-in ceremony: Nitish, Sharad Pawar, etc, list of invitees",
    "Karnataka cabinet: G Parameshwara, KH Muniyappa, KJ George, MB Patil take oath",
    "Karnataka oath-taking ceremony LIVE: Siddaramaiah sworn in as Karnataka CM",
    "Big change coming from June for unclaimed deposits in bank accounts",
    "Delhi services row: Centre moves SC seeking review of May 11 Constitution",
    "PM Modi meets world leaders at G7 Summit 2023",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Portfolio allocation in Karnataka unlikely to occur over the weekend: Report",
    "Siddaramaiah takes oath as Karnataka Chief Minister today",
    "Vedanta shares jump as dividend stock to consider interim dividend next week",
    "How the scrapping of 2000-rupee note will affect Indian economy economy?",
    "Shankar Sharma reacts to ₹2000 notes withdrawal, 20% TCS",
    "₹2,000 notes withdrawal: Ex-CEA gives 5 reasons why decision is good",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — May 22",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IPL 2023: KKR vs LSG match preview, fantasy team, where to watch and more",
    "What to do if the bank refuses to exchange or accept ₹2000 notes?",
    "How to make kids financially aware?",
    "Flipkart Big Bachat Dhamaal Sale: Deals on Google Pixel 7a, iPhone 14 and more",
    "Govt to organize international conference on Indian pharma, medical devices 26-27 May",
    "5 Common myths about Whiskey",
    "MP Birla Group stock recommends 150% dividend, net income zooms 272% in Q4: Do you own?",
    "Vasa Denticity IPO opens next week. GMP, price, other details. Apply or avoid?"
]