[
    "Zerodha CEO Nithin Kamath warns against these new online frauds in India",
    "Wagner chief sends his army towards Moscow. Russia-Ukraine War LIVE",
    "ITR filing: How to claim income tax relief on advance, other salary arrears",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "What Indians get from 'Innovation Handshake' with Google, Apple, Microsoft CEOs",
    "PM Modi's US visit LIVE: PM Modi concludes US visit, says ‘a very special visit’",
    "As heatwave ends, heavy rains likely over Odisha, Jharkhand and other states",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Mumbai rains: After a long delay in monsoon, city sees showers today",
    "Who is Yevgeny Prigozhin, the Russian mercenary boss challenging Putin?",
    "Titan submersible tragedy: Unanswered questions, next steps in the investigation",
    "Titanic Submarine LIVE: OceanGate co-founder hits back at James Cameron",
    "Manipur violence: Amit Shah to chair all-party meeting today at 3 pm",
    "Australian PM Anthony Albanese relishes Indian street food at Little India",
    "Titan submersible's Pakistani victim survived harrowing flight incident",
    "Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "Growth Mutual Fund vs Dividend Mutual Fund: Which is better option for investors",
    "PM Modi announces big changes in US visa rules for Indian professionals",
    "Adani Enterprises share price",
    "Transferred money to the wrong bank account? SBI explains how to get it back",
    "The bigger-is-better approach to AI is running out of road",
    "BGMI redeem codes for June 24, 2023: Unlock exciting rewards and free gifts!",
    "Over 7.5 million ‘Baby Shark bath toys’ recalled after they injured kids: Report",
    "Garena Free Fire Max redeem codes June 24, 2023: Get weapons, diamonds, more"
]