[
    "Gold price rebounds from three-month low. Should you buy in this rally?",
    "Cyient DLM IPO: GMP, subscription status, other details. Should you apply?",
    "TCS names new head of hiring amid probe",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Zudio's fashion finesse boosts Trent's growth plans",
    "Dearth of green talent puts India Inc in a bind",
    "The cost of medical inflation: How much health cover sh ....",
    "Technology has placed women’s financial inclusion within reach",
    "Nationwide summer campaigns can plug school education gaps",
    "Share Market LIVE: Sensex tops 63k, Nifty gains 50 pt; HDFC Life, Adani Ent jump",
    "Surging India internet stocks trounce China peers, widening gap",
    "ICC World Cup 2023 schedule live updates: Announcement likely at 12 noon",
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "Monsoon news LIVE: IMD issues yellow alert in Delhi today",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Russia LIVE: Wagner chief says march on Moscow showed security problems",
    "Chinese spy balloons spotted over Asia, report",
    "Dividend stocks: Eight shares to trade ex-dividend today. Details here",
    "Ideaforge IPO: Has the order book of drone maker missed attention of investors?",
    "Deutsche Bank tells clients some of their Russian shares are missing: Report",
    "Manipur: Women activists interfering in operations, claims Indian Army",
    "PM Modi to interact with 10 lakh BJP workers in Madhya Pradesh today",
    "Vande Bharat Express on Indore-Bhopal route: Ticket price, timing, other details",
    "Adani Enterprises share price",
    "Antique Stock Broking raises target price on IndusInd Bank: do you own?",
    "BGMI redeem codes for June 27, 2023: Claim free weapons now",
    "Uttar Pradesh: Wanted criminal shot dead in an encounter",
    "Garena Free Fire Max redeem codes for June 27, 2023: Grab daily free rewards!",
    "Delhi Airport's new baggage drop facility will cut wait time. Check details here",
    "IndiGo Share Price: Nothing but Blue Skies Ahead",
    "Mukhyamantri Tirth Yatra: Delhi govt resumes free pilgrimage scheme. Details"
]