[
    "Foxconn pulls out of semiconductor JV, Vedanta says other partners lined up",
    "India overtakes China to become most attractive emerging market for investing",
    "Fed likely to lift rates on July 26; how can it impact the market, rupee?",
    "The world needs an international agency for artificial ....",
    "Mint Explainer: Why India must heed WHO’s call to restr ....",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Adani-Hindenburg case: SEBI files affidavit, seeks ‘appropriate orders’ from SC",
    "Flood alert in Delhi? CM issues evacuation orders once Yamuna touches 206-m mark",
    "Foxconn dumps $19.5 billion Vedanta chip plan in India, a look at timeline",
    "Four Indian-origin biz leaders in 2023 Forbes' 100 richest self-made women list",
    "Top gainers, losers today: RIL, Tata Steel, Titan, HCL Tech; check full list",
    "From 10% deficiency to 59% excess, what caused this monsoon mayhem?",
    "Monsoon LIVE News: Delhi on high alert as water in Yamuna river dangerous",
    "Kaka Industries IPO subscribed 19.2 times in day 1 so far",
    "Tata Motors becomes 16th most valued automaker, beats Kia Corporation m-cap",
    "Go First airline seeks investor interest as part of insolvency process",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Which is better?",
    "Mutual Funds: Small-cap fund inflows at record high of ₹5,472 crore in June",
    "Bank of Baroda to PNB: These three banking stocks hit 52-week high",
    "Sensex, Nifty end higher on gains led by RIL; mid, smallcaps underperform",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Apartment sale at 15-yr high in THESE 7 cities in Jan-Jun: JLL India",
    "Indian-origin employee wins Rs2.5 cr in largest compensation from Royal Mail, UK",
    "IMD issues red alert for Chandigarh, Mohali, Panchkula",
    "DaveAI unveils its Virtual Avatar Generative AI pipeline",
    "FII pump ₹588 crore in Indian stocks; DII buy ₹288 - July 10 trade",
    "Amazon Prime Day sale: Apple iPhone 14 to be available with ‘biggest discount’",
    "Haryana: Schools in THIS district to remain closed till 12 July due to rainfall"
]