[
    "Senco Gold IPO allotment date today. Latest GMP, how to check status online",
    "Q1 Result preview: Oil companies' earnings may improve with Crude below $80/bbl",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "The rise of cyber threats in a digital dystopia",
    "Share Market LIVE: Sensex tops 65,500; M&M, Bajaj twins shine; UPL lags",
    "Multibagger stock that has surged 650% in three years declares 1:1 bonus shares",
    "GST Council LIVE: 50th GST Council meet to be held today; Here's what is on card",
    "Delhi rains: Yamuna crosses danger mark, evacuation begins, old bridge closed",
    "Q1 results preview: Here's why pharma companies are expected to show improvement",
    "J&K: Supreme Court to hear petitions challenging abrogation of Article 370 today",
    "West Bengal panchayat counting starts today. 10 points",
    "Monsoon LIVE: Himachal's Mandi on the verge of flooding as river Beas swells",
    "US welcomes India's role in helping achieve lasting peace in Ukraine",
    "Canadian teen caught scribbling at Japan's Toshodaiji Kondo temple",
    "Life on Venus? Here's what new evidence of phosphine in clouds indicates",
    "Gift Nifty, Asian markets among other global cues for Indian stock market",
    "Stocks to Watch: Vedanta, Zee Ent, TCS, SBI, L&T, and Tata Communications",
    "Apple, Microsoft, other heavyweights fall ahead of Nasdaq 100 rebalance",
    "Day trading guide for today: Five stocks to buy or sell on Tuesday — July 11",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "CarTrade Tech shares rise over 14% on plans to buy OLX India's auto business",
    "Rupee opens 17 paise higher at 82.40 against the US dollar",
    "Old Yamuna bridge closed for rail traffic as river level crosses danger mark",
    "Emma Reyes: A Life of Art Celebrated in Google Doodle"
]