[
    "Fresh troubles at Byju's amid legal battle with US lenders, staff morale waning",
    "Central banks hint rate hike era may not end soon; should you be cautious?",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "1975 Emergency anniversary: ‘Unforgettable period’, says PM Modi",
    "Russia LIVE: Moscow residents advised to steer clear of the highway till evening",
    "This is the pharma stock investors should look at this week",
    "Monsoon live updates: Monsoon to strike Delhi and Mumbai at same time",
    "Assam flood worsens: Embankments, roads, bridges damaged, urban areas inundated",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Delhi man sets Guinness World Record by covering all metro stations in min. time",
    "In pics: NASA's MAVEN spacecraft reveals stunning views of Mars",
    "IMD issues very heavy rainfall warning in these states for next three days",
    "PM Modi's Egypt visit: A look at India-Egypt ties, relevance in current scenario",
    "IMD forecasts more showers as rain and thunderstorm hit parts of Delhi-NCR",
    "Adani Enterprises share price",
    "Karnataka medical student, 2 others, held for farming cannabis",
    "Pakistan-based gangster Haji Salim, connected to Dawood, plotting LTTE revival",
    "'King Charles extending Olive branch to Harry, Meghan, but. . .' Royal Expert",
    "‘Shame..traitor’ Russians vent anger at police after Wagner forces exit Rostov",
    "Oppn disagrees with Kejriwal's charge against Congress on central ordinance"
]