[
    "IPOs next week: HMA Agro Industries, Bizotic Commercial, others. Details here",
    "Petrol, diesel prices to go down? Here's what Union Min Hardeep Singh Puri said",
    "Titagarh Wagons to raise ₹288 cr via preferential allotment",
    "As Nifty eyes new highs, India’s valuations become a sore point",
    "Netflix Subscriptions Jump as U.S. Password-Sharing Cra ....",
    "More Startups Throw in the Towel, Unable to Raise Money ....",
    "‘It’s Not My Responsibility’ to Save the Office Economy",
    "You Scored With an Online Sports Bet. Do You Owe Taxes?",
    "India tops in digital payments, records 89.5 mn transactions, says MyGovInd",
    "Ind vs Aus Day 4 Highlights, WTC Final 2023: India needs 280 runs in 97 overs",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "India's FY23 GDP growth may be over 7.2% as final nos come in 2026: Nageswaran",
    "Only 26% Meta employees confident in Mark Zuckerberg's leadership: Survey",
    "Sharad Pawar on why Ajit was not given new responsibility in NCP: ‘He has…'",
    "ChatGPT can help IT firms increase employment, raise projects: CEA",
    "Better.com CEO Vishal Garg announces fresh round of layoffs",
    "'Wrestlers to give bigger protest call if…': Bajrang Punia issues ultimatum",
    "Peek into Donald Trump's hidden vaults, from bathroom to bedroom",
    "Cyclone Biparjoy: Biparjoy to intensify into extremely severe storm in 12 hrs",
    "Sam Altman says India's ChatGPT attempt is ‘hopeless’. Tech Mahindra CEO reacts",
    "Can India break THIS 121-year-old record to win the WTC 2023 Final?",
    "FPIs inflow over ₹9,700 crore in June so far, can this momentum continue?",
    "Adani Enterprises share price",
    "Horoscope Today: Money astrological predictions for 11 June 2023",
    "5 Oral health habits that are harming your teeth",
    "Shubman Gill's cryptic reaction to Cameron Green's controversial catch. See here",
    "Shah Rukh Khan fans creates Guinness World Record for his iconic ‘Pathaan’ step",
    "Intensifying 'Biparjoy' to become extremely severe storm in next few hours: IMD",
    "MeITY tweaks PLI for semiconductor making, approvals to require Cabinet nod",
    "‘When Kejriwal is in trouble…’: Omar Abdullah on why he won’t support Delhi CM",
    "CSBC Bihar Police Recruitment 2023: Eligibility, important dates, salaries",
    "Biden accused of taking $5 million bribe from Ukrainian firm: Report",
    "Ex-chief justices, IAS officers highlight 'human interference' in Odisha tragedy"
]