[
    "HDFC merger: RIL, TCS, ICICI Bank may see downward weight adjustment in Nifty",
    "Passenger vehicle sales rise 9.4% YoY in Q1 FY24, on the back of demand for UV",
    "Reliance Retail can submit resolution plan for Future Enterprises bankruptcy",
    "The working-from-home illusion fades",
    "A new world order seeks to prioritise security and clim ....",
    "Deficit to deluge: India’s swinging monsoon test",
    "India rises up the ranks in global m-cap race",
    "‘India can tweak treaties with key countries for quick fixes’",
    "Equity markets soar, but will the rally last?",
    "Boxed out: Inside Bollywood’s lost magic",
    "Why the PAN of some NRIs have turned inoperable",
    "Share Market LIVE: Sensex, Nifty flat; Ultratech, Infy lag; RIL, Kotak shine",
    "Utkarsh IPO: Should you subscribe to the issue? Here's what brokerages say",
    "'India is super fun': Ashneer Grover slams govt over 28% GST on online games",
    "S Jaishankar's visit to Indonesia, Thailand sets stage for enhanced cooperation",
    "TCS Q1 Results Live: IT major TCS to announce Q1FY24 earnings today",
    "Twitter is blocking links to Meta-led rival Threads. Here what you should know",
    "Is Musk vs Zuckerberg cage fight still on? Meta CEO trains with UFC champions..",
    "Mutual funds investment: Why MF investors are betting big on contra funds?",
    "Monsoon LIVE News: Yamuna records highest-ever water level at 207.55 metres",
    "Adani Enterprises share price",
    "TATA Group to be 1st Indian iPhone Maker | Mint Primer | Mint",
    "Reliance Jio in talks with foreign banks for over $1 bn loan to purchase 5G network | Mint Primer",
    "Delta Corp share price tanks over 27% in one day: Time to bet?",
    "Canadian watchdog probes Nike, gold mining company amid forced labour claims",
    "Pakistan's auto industry in crisis; Only 6,034 cars sold in June this year",
    "Relief for consumers: Tomatoes to be sold at discounted rates in Delhi-NCR",
    "A new world order seeks to prioritise security and climate change",
    "Insurer Swiss Re nominates new chairman after Sergio Ermotti resigns to lead UBS"
]