[
    "Vodafone to cut 11,000 jobs; check details",
    "Nifty close to record high amid US debt ceiling talks. Will it hit a new peak?",
    "Stock Market LIVE: HDFC twin keep Sensex, Nifty in red; PSU Bank shines",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Measuring India’s manufacturing sector remains a data challenge",
    "Jio, Airtel add 19.8 lakh subscribers, Vodafone Idea loses 20 lakh users in Feb: TRAI",
    "Amazon India layoffs: Tech giant lays off about 500 employees: Report",
    "Karnataka CM decision LIVE: Congress to reveal CM's name ‘hopefully by evening’",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "IGL up 19% in 2023 but brokerages bearish on the stock; here's why",
    "Wells Fargo to pay $1 billion in class-action lawsuit: Report",
    "HDFC, HDFC Bank stocks turn ex-dividend today; how much will investors get?",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Vande Bharat Express: This route to have less travel time, more available seats",
    "Explainer | Cong to announce Karnataka's CM today; Here's what happened so far",
    "Nexus Select Trust IPO allotment date today. How to check status online",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Elon Musk on Tesla hiring: No one can join the company until...",
    "Vi shares rise despite pulling factors; details on Vodafone Group's FY23 results",
    "Dividend stock hits 52-week high before Q4 results today. Do you own?",
    "IHCL-owned Taj to franchise Delhi airport hotel from Chalet",
    "Maruti Suzuki WagonR sale exceeds 30 lakh milestone, has highest percentage of repeat buyers",
    "Internet snags a deterrent for UPI, finds survey",
    "Pakistan cuts fuel prices by up to ₹30 per litre",
    "IPL 2023 LSG vs MI: Gujarat Titans vs Sunrisers Hyderabad preview",
    "Growing stock of unused COVID vaccines a financial risk for vaccine makers"
]