[
    "Adani-Hindenburg case: SC defers hearing SEBI's plea for extension of probe",
    "Sensex gains 300 pts, Nifty up 80; FMCG, IT Auto, Realty shine",
    "Bank Nifty touches all life-time high. Which stocks should you buy today?",
    "Ford seen laying off 1,300 workers in China, local media reports",
    "How to improve your trash talk",
    "China learns to manage decline",
    "Early shift to electric could make Royal Enfield a glob ....",
    "Mint Explainer: Thailand’s opposition thumps military-b ....",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "EU carbon tax will impact only 1.8% of Indian exports",
    "Top gainers, losers in trade today: Tata Motors, ITC, Cipla; Check list here",
    "Demat accounts rise to 11.6 crore in April",
    "Schengen visa: France saw highest number of visa rejections in 2022: Report",
    "Aryan Khan drugs case: CBI reveals KP Gosavi planned to extort ₹25 cr",
    "Punjab court summons Kharge in Bajrang Dal defamation case",
    "Kalyan Jewellers Q4 net profit falls 1.6%; declares dividend",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Ashneer Grover criticizes BharatPe boss, calling it 'game of corporate Rajnish'",
    "5 things Bill Gates wishes he knew in his early 20s",
    "SpiceXpress to get USD 100 mn from UK group, signs MoU",
    "Three top brokers face multiple probes including for money laundering",
    "Cipla share price dips 3% after Q4; key triggers to drive this pharma stock",
    "Multibagger Chemical Stock",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Colgate Palmolive Q4FY23 results: Should you hold, sell or buy?",
    "Got Chocolate Milk, Kids? Washington Might Take It Away in Schools",
    "Paytm’s Merchant Payment Leadership Helps the Company Record ₹182 cr in Revenue",
    "Congress' pre-poll guarantees in Karnataka might cost ₹62,000 crore a year",
    "Google adds new feature to its image search to curb spread of information",
    "'Shinde-Fadnavis govt won't fall': Ajit Pawar on disqualification of Sena MLAs",
    "Rusty Old Oil Tankers Fetch Big Bucks Thanks to Russia",
    "The New EV Gold-Rush: Automakers Scramble to Get Into Mining",
    "Bajrang Dal row now spreads to Madhya Pradesh post Karnataka polls",
    "AI Spending Will Cloud Chip Slowdown"
]