[
    "IndiGo to announce Q4FY23 results on May 18",
    "Two CMs for Karnataka? Congress may offer top post to Siddaramaiah, Shivakumar",
    "Karnataka Election Result 2023 Winners: Full list of victorious candidates",
    "Rekha Jhunjhunwala portfolio: Why is this ₹300 bank stock nosediving?",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "New CBI director: Karnataka DGP top contender",
    "Karnataka Election LIVE: Congress to hold meeting today",
    "Happy Mother's Day: History, significance, and quotes to share with your moms",
    "Cyclone Mocha LIVE: Super cyclone set to crash over Myanmar, Bangladesh today",
    "How Muslim vote bank consolidated in favour of Congress in Karnataka election",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "The No-Email Way to Plan a Party",
    "Companies Are Colluding to Cheat H-1B Visa Lottery, U.S. Says",
    "Actually, Guys, You Won’t Be Ridiculed for Wearing This",
    "New Twitter CEO discloses plan to build ‘Twitter 2.0’",
    "CISCE Class 10th and 12th results 2023 Live: Results to be declared today",
    "Explained: What does Karnataka election result mean for India's top leaders?",
    "Happy Mother's Day: Google Doodle celebrates the day with animal throwback pics",
    "China-Russia's growing military collab raises alarm; here’s why",
    "Happy Mother's Day: 10 ways to celebrate the special day with your mom",
    "Debt ceiling standoff: Spending on Covid gives way to new focus on deficit",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "JSW Infra announced expansion plans at NMPT; IPO proceeds to fund",
    "Clashes in Maharashtra's Akola leaves 1 dead, 10 injured; section 144 imposed",
    "Ferrari has issued a recall for 296 GTB and 296 GTS hybrid models",
    "Aryan Khan case: Sameer Wankhede says he is being punished for being patriot",
    "Haryana govt allows liquor at workplace. Know details",
    "Tejashwi Yadav's Bajrang Bali comment in focus again after Congress' wins",
    "Garena Free Fire Max redeem codes for May 14, 2023: Get daily rewards"
]