[
    "Day trading guide for today: Six buy or sell stocks for Thursday-May 25",
    "Stocks to Watch: LIC, Reliance, Nykaa, Nestle India, ITC, Hindalco",
    "Can India become a developed nation by 2047?",
    "Breaking down India’s diesel plan, in 5 charts",
    "Strategic response: India's standardization efforts to ....",
    "Beyond inflation: Exploring the roadmap for global econ ....",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Invest long term, invest in India: Quant founder Sandeep Tandon",
    "The Centre must not become reliant on RBI payouts",
    "El Niño has cast a long shadow on the Indian economy",
    "Reliance Industries softens hiring in retail, telecom, cuts duplication",
    "Fresh tax troubles brewing for FPIs",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Prime Minister Narendra Modi concludes three-nation visit",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "US debt ceiling: Here are five negotiators who are working out deal",
    "Stock Market LIVE: Sensex, Nifty expect sluggish start; SGX Nifty in red",
    "Global market: Asian shares mixed, US stocks drop on debt ceiling impasse",
    "MP Board 10th, 12th Result: Madhya Pradesh board results to be out today",
    "LIC declares 30% dividend for shareholders from net profit in FY23",
    "Govt to integrate MSME Global Mart with ONDC",
    "Growth likely at 6.5% in FY24; war on inflation continues: Das",
    "LIC earns Q4 cons PAT of ₹13,191 crore, up 447.5% YoY; declared dividend",
    "Capital Foods sale: Nestle, ITC in last lap, deal at up to ₹5k cr",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "White House 2024: Who are the Republicans aiming to be the next US President?",
    "India's 18 Vande Bharat Express trains across various routes. See full list",
    "Will MS Dhoni play IPL next year? CSK veteran sends good news",
    "Rishi Sunak govt to allow patients to book free treatment in private hospitals",
    "Delhi-Dehradun Vande Bharat Express: Timing, stops, ticket price and more"
]