[
    "Stocks to turn ex-dividend in trading week from May 29 to June 2: check list",
    "GDP, PMI data, auto sales, global trends to dictate Indian markets in week ahead",
    "Asian businesses are being dragged into the chip war",
    "Is This the Golden Age of Videogame IP?",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Investing ₹10 lakh in small saving schemes? You have to show your income proof",
    "₹2,000 note exchange/ deposit: Know rules for SBI, HDFC, ICICI, other banks",
    "FPIs inflow at ₹37,317 cr in May so far in Indian stocks, highest in 9 months",
    "Lloyd's Register withdraw certification of Indian carrier importing Russian oil",
    "Travellers to UK face long waits as passport e-gates at airports down",
    "24 Ministers sworn in, joining Siddaramaiah's Karnataka cabinet",
    "Sun Pharma to buy 100% stake in Taro in all-cash deal; check details",
    "Amazon 5G Revolution Sale: Discount on 5G smartphones from OnePlus, Xiaomi, iQoo and others",
    "'John Wick chapter 5 possible if…': What Director Chad Stahelski said",
    "Android users can download BGMI from today, playable from May 29",
    "Anushka Sharma imitates Virat Kohli's celebration, sledge him",
    "Priyank Kharge reiterates ‘RSS ban’ warning, says ‘will show power of…’",
    "Three SME IPOs to open for public subscription in the week ahead; check details",
    "PM Modi chairs 8th Niti Aayog meeting. Who is present, who is not?",
    "Complaint filed against Kejriwal, Kharge for inciteful remarks on Prez's caste",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Kareena Kapoor Khan attending F1 Grand Prix in Monaco. Read here",
    "Not Telegram, users downloaded leaked John Wick Chapter 4 full movie from Twitter",
    "Important features of new Parliament building",
    "Google Maps Street View feature expands to more cities in India",
    "Asia Cup 2023: BCCI denies claims of accepting PCB's hybrid model",
    "Apple WWDC 2023: New iOS 17 feature will turn iPhones into Smart Home devices",
    "Indian researchers stress in-depth study of 400 medicinal plants for diabetes"
]