[
    "ideaForge IPO opens today: GMP, date, review, other details. Apply or avoid?",
    "Global market: SGX Nifty flat, Asian markets mixed amid weak global cues",
    "ICICI Securities board to consider delisting on June 29",
    "A strange revolt in Russia: Is this the end of Putin?",
    "Diabetes: The ticking time bomb",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in ....",
    "Indian markets go with the FII flow",
    "Four surprising facets shaping mutual fund returns",
    "Should your retirement nest be far from the teeming crowd?",
    "India-US relations: Set for a strategic upgrade",
    "Generation AI: It is India’s time to play chief disruptor",
    "Share Market LIVE: Sensex, Nifty to start on tepid note; SGX Nifty stays flat",
    "Day trading guide: From buy or sell to dividend stocks to watch today — June 26",
    "Stocks to Watch: RIL, IndusInd Bank, Asian Paints, Infosys, Yes Bank",
    "EPFO subscribers alert: Deadline to apply for higher pension from EPF ends today",
    "Over 30 lakh users download Candy Crush in 3 hours after MS Dhoni's viral video",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Russia LIVE: Questions crop up over Putin's power after Wagner calls off mutiny",
    "Monsoon LIVE: Orange alert issued in Uttarakhand; Kedarnath Yatra postponed",
    "Mumbai rains: IMD predicts heavy downpour for next two days",
    "RIL tests waters in consumer finance",
    "North Koreans hold rallies against the US; shout slogans to destroy America",
    "Arvind Kejriwal's proclamations on Opposition unity ‘calculated move to…’",
    "‘Go for Indian Rupee if you want Asia exposure’",
    "‘Friendship between India, US can make planet more sustainable’: PM Modi",
    "Adani Enterprises share price",
    "Jammu-Kashmir: Schools shut till Class 10 in Ramban district due to heavy rain",
    "IKIO Share Price Live blog for 26 Jun 2023",
    "Maruti Share Price Live blog for 26 Jun 2023",
    "Ntpc Share Price Live blog for 26 Jun 2023",
    "M&M Share Price Live blog for 26 Jun 2023",
    "Titan Share Price Live blog for 26 Jun 2023",
    "Bajaj Finance Share Price Live blog for 26 Jun 2023",
    "Reliance Share Price Live blog for 26 Jun 2023",
    "Sunpharma Share Price Live blog for 26 Jun 2023",
    "SAT to review Zee Entertainment promoters' plea challenging Sebi order today"
]