[
    "Byju's in talks with global investors who quit board to reconsider decision",
    "UPI to account for 90% of retail digital transactions in next 5 yrs: RBI",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "Adani stocks, IndusInd, Tata Motors, Airtel, SBI among top gainers, losers today",
    "India's forex reserves rise by $2.35 billion to reach at $596 billion",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Opposition Meeting LIVE: Mallikarjun Kharge to chair next meet in Shimla",
    "Sensex, Nifty fall for 2nd straight session; investors lose nearly ₹3 lakh crore",
    "Yes Bank to raise ₹25 billion in debt: Report",
    "Apple to launch its credit card in India",
    "Maharashtra govt sets up SIT to probe ₹12,024 crore BMC corruption case",
    "BofA Securities raises target price on Paytm; do you own?",
    "Titanic Submarine LIVE: OceanGate co-founder hits back at James Cameron",
    "PM Modi US visit Live: First PM Modi interacts with military, strategic experts",
    "Nifty Bank down about a per cent in June; is the party over for bank stocks?",
    "Will US interest rate hike trigger FII selling in Indian markets?",
    "PM Modi's US visit: Empire State Building lights up in tri-colour | WATCH",
    "Adani Enterprises share price",
    "These SVB Depositors Got Burned—Now They’re Fighting Back",
    "Indians dream of more than one sexual partner? Here's what a survey says",
    "RBI withdrawal of ₹2,000 notes in circulation leads Spurs in Digital Payments",
    "Bulk deals: Bizotic Commercial, EaseMyTrip, Eros Media, others exchange hands",
    "Why the Titanic Keeps Drawing Us In",
    "Europe—and Tyremaker Pirelli—Struggle to ‘De-risk’ From China",
    "RBI expects price stability to pave way for high, sustainable inclusive growth",
    "U.S. Faces Pressure to Ease Rules for Sharing Military Technology With Allies",
    "Pakistani businessman's son, who went to Titanic expedition, was terrified",
    "Why did LG Balakrishnan & Bros shares rally over 20% this week? - Explained"
]