[
    "Stock market today: Nifty Smallcap 100 index hits fresh all-time high level",
    "Dividend stocks: HUL, three other stocks to trade ex-dividend today — June 19",
    "Why are the rich leaving India?",
    "Are Indian firms falling under debt trap again?",
    "Funding value jumps 4x on Amp Energy, Lenskart deals",
    "Ashok Leyland has to swim against the tide",
    "How car ownership is set to get cheaper",
    "Eating out: How to save money on your next dining experience",
    "A reserve currency differs from one that payments are settled in",
    "Stock Market LIVE: Sensex, Nifty turn flat; Bajaj Finserv up; Hero Moto drags",
    "Apple iPhone export from India surges to ₹10,000 crore in May",
    "PM Modi's US visit: Dates, itinerary, scheduled events and agenda",
    "Small-cap stock to consider bonus shares after giving 5500% return in five years",
    "Heatwave alert! IMD predicts sweltering heat in THESE states till June 20",
    "Raghuram Rajan doesn’t ‘care about India being a superpower’",
    "Shiv Sena split: Shinde, Thackeray to celebrate party's foundation day today",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "UK PM shares homemade barfi with Ukraine's President",
    "Watch: Trial run of Karnataka's second Vande Bharat train started",
    "BJP slams Rahul Gandhi over PSU job comment, ‘Stick to Mickey Mouse interviews’",
    "Sensex, Nifty close to life-time high. Experts recommend these 10 stocks to buy",
    "Global market: SGX Nifty flat, Asian markets trade lower",
    "Stocks to Watch: HDFC Bank, Airtel, RIL, ONGC, Tata Steel, Adani Enterprises",
    "Nifty predictions June 19: Index may open flat; resistance seen at 19,000",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Manipur violence: Army jawan injured in unprovoked firing in Imphal West",
    "Top 5 best smartphones in India under ₹20,000",
    "Rahul Gandhi 53rd birthday: Wishes pour in for the Congress leader",
    "Shark Tank's Namita Thapar shares success story of Season 1 pitcher, says THIS",
    "Sonalis Consumer Products SME IPO listing: Stock lists at a premium on BSE SME",
    "Adipurush row: Another city in Nepal bans Indian films",
    "Gurbani telecast: Punjab govt announces amendment to Gudwaras Act",
    "Five-Star Business Finance share price jumps 7% as Nomura initiates coverage",
    "Boeing projects global demand for 42,600 new commercial jets by 2042",
    "Most confusing workplace jargon in world"
]