[
    "Buy or sell: Anuj Gupta recommends five stocks to buy today — 12th June",
    "Irdai asks insurers to create ABHA IDs for policy seekers",
    "In charts: Does your state face an inflation curse?",
    "Small-, mid-caps rally may have steam left",
    "Impasse in free trade talks as Israeli concerns grow ov ....",
    "Understanding the challenges of foreign investments in ....",
    "How easy money killed the great housing dream",
    "The gift of inheritance: Should you sell the property o ....",
    "BSNL’s revival plan must be followed by reforms",
    "Ex-ante regulations can hurt the growth of India’s digi ....",
    "NaBFID planning to offer takeout loans",
    "Jana SFB to file draft IPO papers soon",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "‘Will continue to raise voice..’ says Sachin Pilot",
    "Gujarat on yellow alert; cyclone landfall expected on Thursday",
    "'We don't have any personal interest..,' Tejashwi Yadav on oppn unity efforts",
    "Gujarat: People being shifted to temporary shelters amid Cyclone Biparjoy alert",
    "These 3 Tata Group stocks to trade ex-dividend this week. Do you own any?",
    "IPOs this week: HMA Agro Industries, Bizotic Commercial, others. Details here",
    "Cyclone Biparjoy LIVE: Gujarat people being shifted to temporary shelters",
    "Adani Enterprises share price",
    "Maharashtra: Oppn demands Devendra Fandavis' resignation, pilgrims lathicharged",
    "Five key charts to watch in global commodity markets this week",
    "George Soros hands control of Open Society Foundations to his son Alex",
    "What is Espionage Act and what might it mean for Trump?",
    "Rodri named UEFA Champions League player of the season 2022-23",
    "As Fed signals rate pause, Powell will have to placate hawks"
]