[
    "Reliance Retail to reduce equity share capital, cancelling non-promoter shares",
    "SC to hear pleas of Google, CCI on July 14 related to ₹1,338-cr fine on tech giant",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Who is Neelam Gorhe? Uddhav Thackrey's close aide who joined Eknath Shinde",
    "Tata Motors shares hit record high driven by strong JLR sales",
    "SC directs SpiceJet to pay entire arbitration award of ₹380 cr to Maran",
    "Govt in talks with industry on extension of FAME scheme, says official",
    "Defamation law was misused, says Congress | LIVE",
    "Karnataka budget 2023 Live Updates: CM Siddaramaiah presents budget in assembly",
    "Maharashtra News Live: NCP has no split, claims Praful Patel",
    "Demat account additions hit 13-month high in June",
    "SEBI updates rules to ease the debt securities issuers' disclosure structure",
    "Reliance Jio Bharat, India's Cheapest 4G Phone goes on sale at ₹999! Details",
    "Gold prices slip; silver plunges ₹600; check latest rates",
    "PM Modi flags off two Vande Bharat trains | Watch",
    "Tata Motors, Titan, Powergrid, among top gainers, losers today; check full list",
    "SBI, PNB, BoB to Canara Bank: Why experts are bullish on PSU bank shares",
    "Sexual harassment charges: Delhi court summons Brij Bhushan Singh, Vinod Tomar",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Odisha accident: 3 railway officials arrested for ‘actions that led to tragedy’",
    "React Native vs. Hybrid: Unveiling the Perfect Fit for Fintech App Development?",
    "Golteum (GLTM) Gains Much Attention in The Crypto Market as The Price of Graph (GRT) Falls",
    "Stellar Price Prediction 2023: Tradecurve Sees Massive Inflows To Blow Rivals Out Of The Water",
    "How to Build Winning Option Trading Strategies as a Beginner?",
    "West Bengal Panchayat Polls: Amid violence TMC, BJP gear up for litmus test",
    "‘Not Here For Narrow Economic Objectives…’: Jaishankar Takes A Dig At China",
    "Tomato Price Crosses ₹250/Kg; McDonald’s Bans Use | Traders Install CCTV Amid Reports Of Theft!",
    "Benefits of investing in ULIP in 2023"
]