[
    "Buy or sell: Vaishali Parekh recommends buying in 3 stocks today — 28 June",
    "Day trading guide: 5 stocks to buy or sell stocks for Wednesday — June 28",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Can the Gupta siblings solve Lupin’s US puzzle?",
    "How to report foreign stocks in your income tax returns",
    "The TCS episode holds transparency lessons",
    "Focus on the millets value chain for fortified nutritio ....",
    "US court rejects Donald Trump's bid to dismiss New York fraud case",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "SP raises ₹14,300 crore via high-yield debt",
    "HDFC clarifies on tentative dates for completion of merger with HDFC Bank",
    "Wagner mutiny: Chinese investors go cautious with Russia",
    "Illegal antibiotics in seafood, meat ring alarm bells",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "ICC World Cup 2023 schedule: India to play Pakistan on Oct 15",
    "Companies look to hire AI, ChatGPT experts, may pay up to ₹1.5 crores",
    "Byju's in advanced talks to raise $1 billion to prevent investor revolt: report",
    "HDFC and HDFC Bank merger likely on 1 July",
    "'Why is tolerance of Hindus being tested?': Allahabad HC slams Adipurush makers",
    "India's current account deficit narrows sharply to $1.3 billion in Q4FY23",
    "Prosus slashes Byju's valuation to $5 billion: Report",
    "Bulk deals: HDFC Life, Sapphire Foods, others exchange hands. Check details here",
    "ICC World Cup 2023 tickets online",
    "Adani Enterprises share price",
    "Credit card tips for smart users",
    "IPV logs 160% IRR for its investors",
    "Nagaland State Lottery Sambad Results: Here's all you need to know",
    "Bajaj Triumph Speed 400, Scrambler 400 X launched. Check features, expected price here",
    "Canada wildfires release record 160 million tonnes of carbon"
]