[
    "Indian Railways cuts train ticket prices up to 25%. Details here",
    "Top 5 small-cap mutual funds of 2023",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Gold rates today at three-month low. Should you buy in this correction?",
    "This iPhone 14 Pro Max costs a whopping ₹5 crore! Why is it so expensive?",
    "West Bengal Election LIVE: Voting suspended in Dinhata, death toll rises to 11",
    "Multibagger stocks: These five bank shares gave up to 185% return in one year",
    "Monsoon Rain LIVE: Yellow alert sounded in 4 districts of Kerala",
    "Elon Musk's X Corp files lawsuit against Wachtell, Lipton and others. Here's why",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "Pakistan PM Shehbaz Sharif forms panel to decide participation in World Cup 2023",
    "China wants to contact Dalai Lama on Tibet",
    "Senco Gold IPO: What GMP, subscription status signal after closure of bidding",
    "Why are FPIs buying and DIIs selling Indian stocks? Will the trend continue?",
    "British airline leaves 19 passengers as plane was 'too heavy' to take off",
    "AccelerateBS India IPO: What GMP, subscription status reflects about SME issue",
    "‘Govt turned happy meals into sad meal' AAP's Raghav Chadha on McDonald's move",
    "Ajay Banga to visit India: Here's why it's special",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "'Na tired hu, na retired, I'm fire': Sharad Pawar quotes Vajpayee on retirement",
    "RIL fixes record date for equity shares allotment, listing of Reliance Strategic",
    "PM Modi in Telangana: Why the visit to poll-bound state is important for BJP?",
    "“Threads app is not for news and politics,” says Instagram CEO Adam Mosseri",
    "'You saved us', prevented 'bloodbath', says Sri Lanka's Speaker Abeywardena",
    "Tom Cruise surprises fans with his fluent Hindi accent | Watch",
    "China casts a shadow as NATO allies debate expanded role in Asia"
]