[
    "Exchanging ₹2,000 notes: 'No panic, no rush, just avoid...,' says RBI Governor",
    "How ₹2000 notes withdrawal helped RBI to maintain status quo on interest rate?",
    "Surging stockmarkets are powered by artificial intelligence",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Banks to enter a phase of moderation in credit growth",
    "Tracing the shifting patterns of remittance flows",
    "Aging with grace: Are senior living homes right for you?",
    "Weather update: Monsoon onsets over Kerala after a week delay, says IMD",
    "RBI Monetary Policy Live: MPC keeps repo rate unchanged at 6.5%",
    "Paytm share price surges 8%; brokerages remain upbeat about the stock",
    "Stock Market LIVE: Sensex, Nifty turn red; Grasim, Sun Pharma drag; NTPC shines",
    "'Unfair to punish students.,.' Jaishankar on Indians facing deportation risk",
    "Cyclone Biparjoy Live: ‘Very severe cyclonic storm to intensify further’, IMD",
    "Imran Khan appeals to courts to prevent second arrest",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Ind vs Aus Day 2: Former players slam India's decision to drop R Ashwin from WTC",
    "Why visa wait time for Indians is 600 days? US says ‘need to fix the delay or …’",
    "Go-First airline suspends operation till 12 June. Know details",
    "Gold rate today trades range-bound as investors await RBI MPC meeting impact",
    "‘Out of anger, I said…, ’ wrestler's father says girl was not sexually harassed",
    "RBI Monetary policy key highlights: Repo rate pause, policy stance and more..",
    "RBI Governor announces 8 additional measures across segments; check details",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "Iran wants a detente with its neighbours but not with America",
    "NIIT share price trades volatile on demerger record date. Do you own?",
    "DRDO successfully flight-tests New Generation Ballistic Missile Agni Prime",
    "Zomato could revolutionize food delivery with generative AI technology: Report",
    "India's active covid cases fall to 2687",
    "Air India's replacement flight lands safely in San Francisco",
    "‘Need Aurangzeb for polls?’ Sanjay Raut taunts CM Shinde over Kolhapur clashes"
]