[
    "FPIs inflow at ₹37,317 cr in May so far in Indian stocks, highest in 9 months",
    "Lloyd's Register withdraw certification of Indian carrier importing Russian oil",
    "Asian businesses are being dragged into the chip war",
    "Is This the Golden Age of Videogame IP?",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "The rise and rise of e-sports",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Travellers to UK face long waits as passport e-gates at airports down",
    "24 Ministers sworn in, joining Siddaramaiah's Karnataka cabinet",
    "Three SME IPOs to open for public subscription in the week ahead; check details",
    "Sun Pharma to buy 100% stake in Taro in all-cash deal; check details",
    "Amazon 5G Revolution Sale: Discount on 5G smartphones from OnePlus, Xiaomi, iQoo and others",
    "Android users can download BGMI from today, playable from May 29",
    "PM Modi chairs 8th Niti Aayog meeting. Who is present, who is not?",
    "Complaint filed against Kejriwal, Kharge for inciteful remarks on Prez's caste",
    "Manipur violence news Live: Army Chief Manoj Pande to visit violence-hit Manipur",
    "'How to maintain friendship forever?' Nikhil Kamath shares life-changing theory",
    "Shubman Gill knocks MI out of IPL 2023; Sachin Tendulkar gives him a masterclass",
    "PR Sundar says, '...is the best response' after settling Sebi advisory case",
    "How income tax rule implies on gifts given from PPF maturity amount?",
    "PM Modi to Chair Niti Aayog meet today; Kejriwal along with five CMs opt-out",
    "Niti Aayog meeting today: Why 8 opposition CMs are boycotting event. Read here",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Maruti Suzuki introduces BBA course in retail management, partners with Bengaluru college",
    "IMD issues orange alert for heavy rainfall in Delhi, and 3 other states",
    "Pharma sector needs to focus on quality and affordability: Mandaviya",
    "Army chief Gen Manoj Pande to visit Manipur today to review situation",
    "Ola Electric begins construction at its battery cell gigafactory",
    "PM Modi thanks people appreciating 9 years of his govt",
    "Priyank Kharge reiterates ‘RSS ban’ warning, says ‘will show power of…’",
    "AI Stocks Are Flying, but Don’t Call the Craze a Bubble",
    "Nepal PM Prachanda set for 4-day visit to India"
]