[
    "Upcoming Q4 results: From SBI to IOCL here are the Q4 earnings to watch this week",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Inflation, Q4 results, among key triggers for Dalal Street in coming week",
    "2024 Lok Sabha elections to be preluded by heated polls in THESE 5 states",
    "Tata Group to manufacture Apple iPhone 15 and 15 Plus in India, report says",
    "Praveen Sood has been appointed as Director of the CBI for two years",
    "CISCE Class 10th and 12th results 2023 Live: Results announced,direct link",
    "Karnataka Election LIVE: 'People are tired of PM Modi, his campaigns': Jairam",
    "EPF vs VPF vs PPF: Taxation and withdrawal rules explained",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "The No-Email Way to Plan a Party",
    "Companies Are Colluding to Cheat H-1B Visa Lottery, U.S. Says",
    "Actually, Guys, You Won’t Be Ridiculed for Wearing This",
    "Cyclone Mocha LIVE: Super cyclone hits Myanmar, Bangladesh coasts",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "Orange alert for very heavy rainfall issued in these 3 states till 18 May: IMD",
    "Check out upcoming IPOs in May",
    "Govt approves fourth 'positive indigenisation list' of sub-systems",
    "Ratan Tata-backed Upstox breaks even in fiscal year 2022-23, revenue jumps 40%",
    "IPL 2023 CSK vs KKR: Preview, where to watch, live streaming and more",
    "People are tired of PM Modi and his campaigns', says Jairam Ramesh",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Govt to make ₹300 crore equity infusion in Alliance Air, will help finances",
    "Cannes 2023: Anurag Kashyap's ‘Freddy’, 4 other films to represent India",
    "Erdogan's leadership in balance as people votes in pivotal elections"
]