[
    "Karnataka elections 2023: What happens in case there is a hung Assembly?",
    "‘Karnataka is a lesson for PM Modi…’ expert says as exit poll gives edge to Cong",
    "Will RBI extend pause in upcoming policies as April inflation eases to 4.7%?",
    "Karnataka Election Result LIVE: Counting shortly, Congress begins celebration",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Congress won't form coalition govt with JD(S) in Karnataka, says Jairam Ramesh",
    "CPI falls below RBI's upper tolerance limit for first time in 14 mnths, at 4.7%",
    "India's forex reserves rise by $7.2 bn to reach at 11-month high, nears $600 bn",
    "Kanakapura, Padmanabhanagar LIVE: Battle of heavyweights- Shivakumar vs R Ashoka",
    "Factory output rises 1.10% in March, grows by 5.1% in FY23",
    "Bangalore South election results live: Counting of votes to begin at 8 am",
    "'If we don't work': Pilot draws parallel with K'taka, mounts pressure on Cong",
    "Tata Motors Q4 results: Beats estimates, consolidated PAT rises to ₹5,408 cr",
    "Vedanta Q4 results: Net profit declines 56% to ₹2,634 crore, dividend declared",
    "Shiggaon Constituency Result Live: Will Basavraj Bommai retain his throne?",
    "Chikmagalur Constituency Result Live: Can Congress end CT Ravi's winning streak?",
    "Chittapur Constituency Result Live: Will Kharge family retain its turf?",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IPL 2023: Highlights of MI vs GT match; see pictures",
    "India's new connectivity project for Middle East to counter China's influence",
    "'Support democracy. No question of martial law' says Pakistan army amid unrest",
    "Pakistan frees 198 Indian fishermen from jail",
    "Gold, silver price retraces from life-time high. Buy or wait for more dip?",
    "From UP to Punjab, results in these constituency will decide parties' fate",
    "Imran Khan returns to Lahore's Zaman Park residence after 2 days of detention",
    "Inflation in this country has surged to 109%",
    "Karnataka election result 2023: What exit polls predicted—A recap",
    "Manipur violence: UAVs, Army helicopters being used for aerial surveillance"
]