[
    "IT firms to cut payouts as outlook weakens",
    "Telcos likely to see modest growth in Q1 as disruptive phase is well behind",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Can M&M retain its SUV edge in the EV era?",
    "For technology firms, Q1 may be a quarter to forget",
    "Cost of education in India: Exploring expenses and infl ....",
    "An upbeat report works best with clarity on risks",
    "The idea of a Universal Civil Code: What Indians at lar ....",
    "Rainfall wreaks havoc in N. India. Red alerts issued, schools closed. Top points",
    "Himachal Pradesh: Videos that bear testimony to havoc caused by torrential rain",
    "West Bengal panchayat election: SEC announces repolling date for certain areas",
    "Wall Street week ahead: Investors await inflation data, big banks’ earnings",
    "Adani raises $1.4 bn from stake sale in 3 companies; $9 bn raised in 4 years",
    "DPIIT identifies 106 firms from 30 countries under strategic investment targets",
    "Monsoon Fury LIVE: Amit Shah dials Punjab, Himachal Pradesh CM, assures help",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Won't accept 'one nation, one party' plan of BJP: Uddhav Thackeray",
    "Karnataka to launch DBT scheme tomorrow, but 22L BPL families won't get benefits",
    "Assam CM takes jibe at Rahul Gandhi for joining farmers, says ‘Desire of Prince’",
    "HDFC Bank will participate in NSDL IPO, to divest 2% stake",
    "Delhi rain update: Road at minister Atishi's house flooded, BJP takes a swipe",
    "Maharashtra: Chhagan Bhujbal attacks Sharad Pawar, says rebellion in NCP took place in his family",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "'Tamil Nadu Governor instigates communal hate': CM Stalin tells President Murmu",
    "As rains batter Punjab and Himachal Pradesh, Amit Shah assures CMs of all possible assistance",
    "BRICS summit to be 'physical' despite arrest warrant against Putin: South Africa",
    "Samajwadi Party worker hires bouncers to ‘protect’ tomatoes in Varanasi",
    "Horoscope Today: Money astrological predictions for 10 July 2023",
    "Bajaj Auto seeks RBI nod for new NBFC as Bajaj Fin diversifies",
    "Suzlon eyes long-term loans, QIP to trim debt"
]