[
    "Antony Blinken to wrap up rare visit to China, lilkely to meet Xi Jinping",
    "Classified documents case and Trump’s first appearance in Miami court",
    "More than 6 killed, dozens injured in US shootings on weekend",
    "Why are the rich leaving India?",
    "Are Indian firms falling under debt trap again?",
    "Funding value jumps 4x on Amp Energy, Lenskart deals",
    "Ashok Leyland has to swim against the tide",
    "How car ownership is set to get cheaper",
    "Eating out: How to save money on your next dining experience",
    "A reserve currency differs from one that payments are settled in",
    "India brews its own carbon levy to hit back at EU imports",
    "IPOs in coming week: Aatmaj Healthcare, HMA Agro Industries, other. Check detail",
    "Zee's Subhash Chandra, Punit Goenka diverted public money, says SEBI",
    "Cyclone Biparjoy: Heavy rainfall likely in Rajasthan",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "India's Satwiksairaj Rankireddy and Chirag Shetty wins Indonesia Open",
    "US govt in possession of alien vehicles: report",
    "Cyclone Biparjoy: Ajmer Hospital flooded after heavy rains | Watch",
    "Centre's direct tax collection up 11% to stand at ₹3.8 lakh cr in FY24 so far",
    "Govt may invite financial bids for privatising NMDC Steel",
    "Tata Steel plans ₹16,000 crore consolidated capex in FY24; check details",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Earthquake of 6.3 magnitude strikes the coast of Central Mexico",
    "Are aliens that bad at parking?",
    "US mass shooting: 2 dead, 3 injured at Washington State music festival",
    "Cong slams PM over 'silence' on clashes, Mahua Moitra bats for ‘Manipur ki baat’"
]