[
    "Share Market LIVE: Sensex, Nifty at new highs; IT, PSU Bank jump",
    "MCX share price cracks over 12%; here's why",
    "ICICI Securities shares fall over 3% as board approves delisting",
    "Why states are falling short on capital spending",
    "Data recap: Services trade, diabetes woes, and more",
    "P&G can set up plants in India for exports: India M ....",
    "Pigment of hope: Paint companies find some respite as costs ease",
    "Where have all the startup hedgehogs gone?",
    "Verified trading P&Ls are fine, but be wary of the loopholes",
    "India needs stronger statistical system for better policymaking",
    "Fiscal federalism needs a look-in by the 16th Finance Commission",
    "Will your Public Provident Fund account yield more in coming quarter?",
    "Aspartame ‘probable carcinogen’ sweetener commonly used in Diet Coke, Mars Bar",
    "Monsoon Rain: Heavy rain lashes Gujarat's Junagadh, Rajkot",
    "Satya Nadella joins the Candy Crush craze, enjoys game just like MS Dhoni",
    "Uniform Civil Code soon? Modi govt to introduce UCC during monsoon session",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "ideaForge IPO closes today: Latest GMP to subscription status. Apply or not?",
    "HDFC to vault into ranks of world’s most valuable banks after merger",
    "Manipur: Rahul Gandhi to visit violence-affected people in Moirang today",
    "French riots spread in third night of unrest. Why people are protesting?",
    "Apple shares may see another 30% upside, says Citi",
    "OceanGate promotes future trips to Titanic wreck",
    "Virgin Galactic completes first manned mission to space",
    "Monsoon Rains: Mumbai local train status to traffic snarls; Latest updates here",
    "France Protest LIVE Updates",
    "Nestle Ind share price Today",
    "Adani Enterprises share price",
    "Deadly heat wave claims at least 100 lives in Mexico",
    "After Aspartame, another artificial sweetner comes under scanner",
    "Shikhar Dhawan to lead India at Asian Games 2023",
    "Why are hotel prices rising in Ahmedabad ahead of Ind vs Pak World Cup clash?",
    "Pakistan seals $3 Billion lifeline: IMF deal offers hope for economic resurgence",
    "Startup Inflection AI secures $1.3 bn funding from Nvidia and others",
    "New roster system in Supreme Court from July 3. All you need to know",
    "IAF AFCAT 2023: Registration process to end today",
    "HDFC AMC to ABSL: Why asset management company shares are skyrocketing?",
    "Cigarette lighter policy revised: Check new rules here"
]