[
    "TCS share price edges lower on dividend record date. Details here",
    "Stock Market LIVE: Sensex, Nifty trade in red; IndusInd, Infosys drag at start",
    "ED arrests M3M promoters, Basant and Pankaj Bansal, Hitender Rao",
    "Eyes on the road: Unraveling India's crash crisis",
    "Charting the course: Seven trends shaping the media landscape",
    "Investor confidence shifts to APAC amid macroeconomic downturn",
    "Telecom sector pines for tariff call",
    "How Hindustan Unilever makes what you want",
    "Price of prestige: Exploring the allure of club members ....",
    "Overall stability is a key goal of monetary policy",
    "Indian official statistics could be revolutionized at t ....",
    "Cyclone Biparjoy LIVE: Powerful cyclone to make landfall today in Gujarat",
    "New issue of sovereign gold bond scheme to open next week. Key things to know",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "6.5 magnitude earthquake strikes northern Philippines",
    "Cyclone Biparjoy: Red alert issued, rescue teams on standby. 10 pts",
    "Cyclone Biparjoy LIVE tracking: Current Location, damage expectations and more",
    "Tata Steel inks deal with Germany's SMS group to cut carbon emissions",
    "IMF criticizes Pakistan budget, casting doubt on bailout prospects",
    "Google introduces Generative AI to enhance shopping experience and outshine Amazon",
    "Australia to block construction of new Russian embassy",
    "Cyclone Biparjoy: IMD issues red alert for Gujarat. Here's what it signifies",
    "Akasa Air eyes $75-100 million via fresh equity: Report",
    "UTI AMC stake sale: SBI, LIC, PNB, BoB look for bids, says report",
    "‘Will get chance to prove…,’ Canada to Indian students facing deportation risk",
    "Bengaluru-Mysuru Expressway",
    "Adani Enterprises share price",
    "Flipkart and PhonePe could be $100 billion businesses in India, says Walmart CFO",
    "US lawmaker calls for immediate defence ties with India",
    "Rupee opens 5 paise lower at 82.15 against US dollar",
    "Watch: Ashwin challenges third umpire’s decision; Twitter goes crazy",
    "Tesla shares end record $240 billion rally"
]