[
    "Stocks to Watch: Zee Ent, HDFC, Tata Motors, Inox Wind, Vedanta, IndiGo",
    "Global market: Asian stocks rise following Wall Street rally, SGX Nifty up",
    "Day trading guide: Buy or sell, dividend stocks to F&O ban list. Details here",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "Jitters behind glass and steel facades",
    "Can Rishad Premji rejuvenate Wipro?",
    "Inheritance: How to draft a will that cannot be easily ....",
    "Uphold ‘niti’ as well as ‘nyay’ for the cause of justic ....",
    "Key drivers have sustained the strength of our recovery",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 13th June",
    "Stock Market LIVE: Sensex, Nifty to have steady start; SGX Nifty in green",
    "Indian Govt said, ‘We will shut down Twitter if…’: Jack Dorsey",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Sebi bans Subhash Chandra, Punit Goenka from directorial, managerial roles",
    "Cyclone LIVE: Biparjoy expected to cross near Jakhau Port by June 15: IMD",
    "India looks to take UPI to Saudi, Bahrain, other Gulf countries",
    "IMD issues severe heatwave alert for these states. Check here",
    "IMD predicts extremely heavy rains in these states today, orange alert issued",
    "Real estate poised for growth as investors anticipate interest rate cut",
    "'Shocking' that many Republicans are still supporting Trump: Jill Biden",
    "Mumbai police launches 'No Honking Day' today to tackle noise pollution",
    "Why Lionel Messi was detained by Chinese Police at Beijing airport? Watch here",
    "Suresh Raina to play in Sri Lanka Premier League",
    "Adani Enterprises share price",
    "Tech Mahindra Share Price Live blog for 13 Jun 2023",
    "Indusind Bank Share Price Live blog for 13 Jun 2023",
    "Bharti Airtel Share Price Live blog for 13 Jun 2023",
    "Hindustan Unilever Share Price Live blog for 13 Jun 2023",
    "Sunpharma Share Price Live blog for 13 Jun 2023",
    "Bajaj Auto Share Price Live blog for 13 Jun 2023",
    "Divis Lab Share Price Live blog for 13 Jun 2023",
    "Adani Ports Share Price Live blog for 13 Jun 2023",
    "Ntpc Share Price Live blog for 13 Jun 2023",
    "Cipla Share Price Live blog for 13 Jun 2023"
]