[
    "Bank of Baroda shares up over 100% in last one year; is this stock still a buy?",
    "Fitch raises India's GDP forecast to 6.3% from 6% for FY24",
    "Lupin share price up 39% in last one year; can it rise more?",
    "How generative models could go wrong",
    "Is Indian aviation headed for a duopoly?",
    "Inflation is as corrosive to investing as it is to the ....",
    "Comeback on cards for distressed asset market",
    "Steady retail prices, easing crude lift margins of oil ....",
    "It’s déjà vu for cement investors as polls near",
    "Is it too late to revive BSNL?",
    "How beneficial are premium banking services for HNIs?",
    "Share Market LIVE: Sensex, Nifty turn flat; Bajaj Finance shed; HDFC twins shine",
    "Shankar Sharma portfolio: Brightcom Group share price hits lower circuit",
    "Indian banks race to deploy QR codes at merchant locations: Report",
    "PM Modi US Visit LIVE: In a rare press conference, Modi to address 2 questions",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Titanic Submarine LIVE Updates: Rescuers hunt 5 crew members as oxygen decreases",
    "Higher pension from EPF: Why EPFO needs to extend the deadline again",
    "Need to improve sovereign debt restructuring process, says Janet Yellen",
    "Apple rolls out iOS 16.5.1 update, fixes ‘critical’ security flaw on iPhones",
    "Why are sugar stocks rising today?",
    "ITR filing: How salaried individuals can file their returns without Form 16",
    "Sri Lankan Navy arrests 22 Indian fishermen",
    "SBI extends these two special fixed deposit (FD) schemes. Check details here",
    "Mark Zuckerberg vs Elon Musk",
    "Tata Motors share price Today",
    "Adani Enterprises share price",
    "Apple releases iOS 17 beta 2 to developers: Everything that’s new",
    "In pics: 2024 Range Rover Evoque revealed with a curved screen. Have a look!",
    "India reports 95 new covid cases in a day",
    "‘Send Me Location…’; Zuckerberg Accepts Musk’s Cage Fight Challenge | Details",
    "AI holds great potential in learning, skilling: Modi at G20 education ministers’ meet",
    "Incredible India campaign, smart visas critical for inbound tourism growth"
]