[
    "FPIs invest ₹21,944 cr in first week of July in Indian stocks, here's why",
    "RIL fixes record date for equity shares allotment, listing of Reliance Strategic",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "Up to 25% cut in train ticket prices by Indian Railways, including Vande Bharat",
    "Delhi High Court turns down PepsiCo's appeal against revocation of potato patent",
    "'Na tired hu, na retired, I'm fire': Sharad Pawar quotes Vajpayee on retirement",
    "West Bengal Election LIVE: Voting halted in Dinhata, Murshidabad; death toll- 12",
    "Adani buys 30% in online train ticket booking platform Trainman for ₹3.5 crore",
    "Monsoon Rain LIVE:Delhi witnesses season's first heavy spell of rain",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "Top 5 small-cap mutual funds of 2023",
    "India’s bio-economy soars to $100 bn, aim $150 bn by 2025: Jitendra Singh",
    "RVNL is awarded contract for rehabilitation and improvement project in Odisha.",
    "Kerala teenager dies of ‘brain eating amoeba’: What is it and how it spreads",
    "Apple iPhone 15 Pro to debut in striking dark blue color, leak reveal",
    "PM Modi in Telangana: Why the visit to poll-bound state is important for BJP?",
    "Gold rates today at three-month low. Should you buy in this correction?",
    "Canara Robeco MF Launch Canara Robeco Multi Cap Fund for Long-Term growth",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "RailTel awarded 39.37 cr project for enhanced security in immigration Services",
    "HCL Tech, TCS, Wipro major Q1 results to look out for in July10-14 trading week",
    "Russian fighter jets ‘harassing’ American MQ-9 drones over Syria: US",
    "India, Pak, PUBG: Husband seeks PM Modi's intervention, asks to send wife back",
    "Rohit, Kohli, Hardik, Jadeja to miss Asian Games; BCCI makes 5 announcements"
]