[
    "IndiGo makes record order for 500 Airbus A320",
    "SEBI bars IIFL Securities from taking new clients for 2 years",
    "₹2,000 note withdrawal to boost India’s GDP, says SBI Research",
    "Return of investor confidence lights up new-age compani ....",
    "Investors suspect breaches at Mojocare, order forensic audit",
    "Why are the rich leaving India?",
    "Ashok Leyland has to swim against the tide",
    "Eating out: How to save money on your next dining experience",
    "Warren Buffett's Berkshire Hathaway raises stake in 5 Japanese trading houses",
    "Mumbai Police to provide security to writer of 'Adipurush', Manoj Muntashir",
    "Bajaj twins, Tech Mahindra, Adani Enterprises among top gainers, losers today",
    "US 'does not support' Taiwan's independence: Blinken tells Xi",
    "FIIs sell ₹1,031 crore in Indian stocks on 19 June; DIIs offload ₹365 crore",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "PM Modi's US visit: Experts recommend these five defense stocks to buy today",
    "Advance, self-assessment tax data missing in prefilled income tax forms",
    "Gita Press declines ₹1 cr award amid row over Gandhi Peace Prize selection",
    "Adani Transmission to raise up to ₹8,500 cr after green light by shareholders",
    "Sensex, Nifty end lower on weak global cues; midcaps, smallcaps outperform",
    "Max Life Insurance invests ₹49.5 crore in Capital Small Finance Bank",
    "India's water scarcity led Earth's pole to drift eastwards. Study warns of . . .",
    "Explained: What is Gurbani row, why is Punjab govt amending Sikh Gurdwara Act?",
    "Adani Enterprises share price",
    "MP govt razes home of suspect after man on leash assaulted in video, invokes NSA",
    "Russia: Life of Alexei Navalny, Kremlin’s biggest foe",
    "Mumbai man kills woman in moving autorickshaw after argument, tries to end life",
    "Pakistan refugees drowning in Mediterranean highlights deeper humanitarian crisis",
    "Mandaviya to inaugurate G20 co-branded event on health & well-being of youth",
    "IRCTC Calls Out Jairam Ramesh; ‘Adani Takeover’ Remark ‘Misleading’ | Details",
    "Multibagger stock: How to be eligible for Bank of Baroda's dividend?",
    "Dhan Referral Code: ‘SHAR68’ for Big Rewards & Free Demat Account",
    "Modi govt provides 9 lakh government jobs, surpassing UPA’s record: Jitendra Singh"
]