[
    "Share Market LIVE: Sensex, Nifty set for muted start; Gift Nifty in red",
    "Q1 results 2023: TCS, HCL Tech, Wipro, others to announce earnings this week",
    "Utkarsh Small Finance Bank IPO: Key dates to price band, all you need to know",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Can M&M retain its SUV edge in the EV era?",
    "For technology firms, Q1 may be a quarter to forget",
    "Cost of education in India: Exploring expenses and infl ....",
    "An upbeat report works best with clarity on risks",
    "The idea of a Universal Civil Code: What Indians at lar ....",
    "Three private equity groups in race to buy out Gautam Adani's Adani Capital",
    "SpiceJet board to consider raising fresh capital on July 12",
    "Monsoon Fury LIVE: Due to incessant heavy rains, CM Kejriwal calls for meeting",
    "Twitter ‘relocates’ users of Pakistani region to India, user",
    "Delhi rain: CM Arvind Kejriwal calls meeting",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Cyient DLM IPO listing date today. GMP, experts signal strong debut",
    "Stocks to Watch: Cyient DLM, RIL, HDFC Bank, Adani Group, IOCL, SpiceJet",
    "Bengaluru starts clearing footpaths to ensure pedestrian safety",
    "China’s inflation rate slows to zero as deflation concerns mount",
    "HDFC Bank extends special fixed deposit (FD) scheme for senior citizens",
    "What are cluster bombs, US sending to Ukraine?",
    "Monsoon mayhem: Incessant rains cause widespread damage, flooding in North India",
    "West Bengal Panchayat Polls: Repolling in nearly 700 booths of 5 districts",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "BGMI redeem codes for July 10, 2023: Unlock exciting rewards and free gifts!",
    "Garena Free Fire Max redeem codes for July 10, 2023: Get weapons, diamonds, more",
    "Nifty predictions July 10: Index may find support at 19,300",
    "L&T Share Price Live blog for 10 Jul 2023",
    "Dr Reddy Share Price Live blog for 10 Jul 2023"
]