[
    "Australia cancels Quad meeting",
    "Bank of Baroda shares gain on strong Q4 earnings",
    "Stock Market LIVE: Sensex, Nifty turn red; IT, Metal drag; Airtel gains",
    "Vodafone Plc's carrying value of investment in Vi is Zero, plans to raise funds",
    "Unlocking India's export potential: How to overcome the slide",
    "The increasing challenge of finding a spot for your car",
    "JLR: The engine revving up Tata Motors’ profitability",
    "Bank of Baroda ends FY23 on a strong note",
    "Generative AI: Why boardrooms must embrace the next fro ....",
    "Where are India’s missing investment advisers?",
    "Let’s hold our horses on the regulation of generative AI",
    "Let’s move from rear-view to the windshield on wage data",
    "Karnataka CM race Live: Rahul Gandhi backing Siddaramaiah, claims report",
    "IMD predicts light rain, thunderstorm in these areas of Delhi-NCR today. Details",
    "Commercial flights resume operations at Leh Airport",
    "Ex-CEO of failed Silicon Valley Bank refuses to return $10 Million",
    "Mumbai rains: Citizens to now receive weather updates on their phones",
    "Rupee opens 10 paise lower against US dollar",
    "Musk scorns working from home as morally wrong practice",
    "Meta India's head of partnerships Manish Chopra resigns from position",
    "This smallcap stock to turn ex-dividend today: how much investors will earn",
    "Bank of Baroda Q4 results get a thumbs-up from brokerages",
    "Meeting SRK, Ambani: How new US Ambassador started his journey in India",
    "Bank of Baroda hikes FD interest rates. How they compare with SBI, HDFC Bank",
    "Adani-Hindenburg row: Supreme Court to hear PILs seeking probe today",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "What party control means in China",
    "World Hypertension Day: Date, history, theme, significance and symptoms",
    "Bharti Airtel share price rises after Q4 numbers: 5 reasons why",
    "Pakistan civilians to face prosecution for taking part in protests"
]