[
    "IT sector’s profit pie drops to 5-year low",
    "Govt to accelerate beneficiary schemes in pre-election blitz",
    "What to watch out for in your appraisal letter",
    "Cereal inflation: Is the worst behind us?",
    "Strategic move: Centre to incentivize MSME industrial p ....",
    "LIC’s valuation offers a silver lining",
    "Is ONDC really the UPI of e-commerce?",
    "How forex cards can make your international travel costlier now",
    "Don’t lose sight of risks in judging mutual funds",
    "India needs to fill the vacuum of its mid-sized enterpr ....",
    "Turkey election: Erdogan claims victory in historical Presidential runoff",
    "India-Japan talks on NE investments soon",
    "Teleperformance, PE firms look to acquire Everise Holdings",
    "Delhi Police files FIR against wrestler 'protest organisers'",
    "Rolls-Royce to cut thousands of jobs: Report says",
    "India should reduce Direct Tax from 40% to 25%, suggests economist. Here's why",
    "CSK vs GT Live Score, IPL 2023 Final: Rains play spoilsport, finals on 29 May",
    "Guwahati-NJP Vande Bharat Express: Route, timings, stoppages, other details",
    "Wall Street week ahead: After US debt deal, investors’ focus on jobs data",
    "Delayed SFT filing attracts penalty: I-T department",
    "Wrestlers' protest: Vinesh and Sangeeta Phogat, Sakshi Malik released | Watch",
    "From Adani Transmission to IRCTC here are corporate earnings to watch this week",
    "Rahul Gandhi gets new passport, set to travel to US tomorrow",
    "Talks on supply chain agreement under IPEF substantially concludes: Govt",
    "Manipur Violence: 40 militants killed, several arrested, says CM Biren Singh",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "Investing ₹10 Lakh in Small Saving Schemes",
    "US Debt Ceiling Crisis Affecting Gold Price",
    "IMD Yellow Alert Maharashtra",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "With little time left for admin work, Census unlikely before LS elections",
    "Horoscope Today: Money astrological predictions for 29 May 2023",
    "‘Will keep making social issue-based films’",
    "India to contest EU carbon levy, says steel secretary",
    "Quick edit: IPL brand surge",
    "Temple of democracy: Modi unveils Parliament complex"
]