[
    "HDFC, HDFC Bank stocks turn ex-dividend today; how much will investors get?",
    "Stock Market LIVE: Sensex, Nifty turn red; HDFC twin lag; Divi's, ONGC gain",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Measuring India’s manufacturing sector remains a data challenge",
    "Amazon India layoffs: Tech giant lays off about 500 employees: Report",
    "Karnataka CM decision LIVE: Kharge, Sonia Gandhi to take final call",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "IGL up 19% in 2023 but brokerages bearish on the stock; here's why",
    "Wells Fargo to pay $1 billion in class-action lawsuit: Report",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Vande Bharat Express: This route to have less travel time, more available seats",
    "Explainer | Cong to announce Karnataka's CM today; Here's what happened so far",
    "Nexus Select Trust IPO allotment date today. How to check status online",
    "Delhi school gets bomb threat via e-mail",
    "LIC-backed multibagger stock gives 450% return in one year. Do you own?",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "CJI DY Chandrachud quotes Pakistani poet while bidding farewell to Justice Shah",
    "India reports over 656 new covid cases",
    "How National Medical Register's unique ID of doctors will help in finding detail",
    "Nifty Midcap 100 index hits record high: What is driving rally in these stocks?",
    "Bharti Airtel share price dips: Q4 earnings, dividend, here are key factors",
    "WhatsApp's new feature will help you hide private conversations",
    "IPL 2023: Can Mumbai Indians qualify for the playoffs?",
    "'Market mood positive but keep valuations in mind; IT can be a good bet'",
    "Rozgar Mela: PM Modi distributes about 71,000 appointment letters"
]