[
    "Karnataka CM race Live: CM announcement likely today or tomorrow, says Surjewala",
    "Tamil Nadu announces 4% DA hike for 16 lakh govt employees, pensioners",
    "SBI Q4 preview: PAT growth trend to continue, NIM may soften; key factors here",
    "'Love marriages leading cause of most divorces in India,' says Supreme Court",
    "Air India's Delhi-Sydney flight suffers mid-air turbulence; passengers injured",
    "Newfangled coins and mercenaries may have brought about ....",
    "What’s behind BSE’s decision to relaunch derivatives?",
    "Why are bad films so enjoyable?",
    "How fast can European steelmakers decarbonise?",
    "Unlocking India's export potential: How to overcome the slide",
    "The increasing challenge of finding a spot for your car",
    "JLR: The engine revving up Tata Motors’ profitability",
    "Bank of Baroda ends FY23 on a strong note",
    "Adani-Hindenburg: SC gives SEBI extension till August 14 to complete probe",
    "Market stuck in ‘nervous nineties’! Here's why it is a 'buy on dips' market",
    "Top six small-cap mutual funds for best return on your money",
    "Ex-Apple engineer accused of stealing self-driving cars technology for China",
    "Indian Oil stock cheers Q4 results, hits fresh 52-week high. What's next?",
    "Siddaramaiah to be Karnataka CM? Supporters celebrate amid appointment reports",
    "Bommai on suspense over next K'taka CM: ‘Shows internal situation in Congress’",
    "Crayons Advertising IPO sets price band, this SME public offer to open on May 22",
    "IndiGo inducts second Boeing 777 aircraft for Mumbai-Istanbul",
    "Higher pension or bigger PF balance? Things to consider before rejigging EPS",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Renault India announces up to ₹62,000 offer on Triver, Kiger and Kwid for May",
    "Delhi LG nominating aldermen bypassing state could destabilise elected MCD: SC",
    "What Makes India-EU Trade & Tech Council Meeting A ‘Strategic Milestone’?",
    "ELSS vs SSY: Where to bet for your girl child?",
    "Lytus Technologies acquires majority stake in Sri Sai Cable and Broadband",
    "Will ensure political executive doesn't turn blind eye: SC on Manipur violence",
    "UP govt announces 4% DA hike for state employees, pensioners",
    "Investments in Indian hospitality industry to exceed $2.3 billion over 2-5 years: CBRE",
    "No Shah Rukh Khan in Don 3: If not SRK, then who?",
    "Newfangled coins and mercenaries may have brought about democracy"
]