[
    "PKH Ventures IPO opens today: GMP, price, other details. Apply or not?",
    "Stocks to Watch: ICICI Bank, ICICI Sec, BPCL, Adani Total, RIL, Airtel, ONGC",
    "SGX Nifty up, Asian markets drop amid mixed cues",
    "Why states are falling short on capital spending",
    "Data recap: Services trade, diabetes woes, and more",
    "P&G can set up plants in India for exports: India M ....",
    "Pigment of hope: Paint companies find some respite as costs ease",
    "Where have all the startup hedgehogs gone?",
    "Verified trading P&Ls are fine, but be wary of the loopholes",
    "India needs stronger statistical system for better policymaking",
    "Fiscal federalism needs a look-in by the 16th Finance Commission",
    "Share Market LIVE: Sensex, Nifty to open on steady note; SGX Nifty in green",
    "Monsoon Rains: Mumbai local train status to traffic snarls; Latest updates here",
    "PAN-Aadhaar linking deadline: Today is the last day. Ensure linkage, else…",
    "Explained: What is affirmative action, now banned in the US?",
    "‘Make in India’, visible effect on Indian economy,' says Russian President Putin",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Kasargod-Trivandrum Vande Bharat Express emerges as top performer",
    "Monsoon LIVE: Mumbai, Thane, Palghar expected to see moderate to intense rains",
    "After tomatoes, onion prices likely to shoot up by THIS month",
    "Chaos over locker agreement update: Customers still confused about new rules",
    "Manipur Live Updates: ‘Peace has to be our only priority', says Rahul Gandhi",
    "NCP, BJP had meetings ahead of oath-taking in 2019, Sharad Pawar admits",
    "Day trading guide: Stocks to buy or sell, dividend stocks to watch on June 30",
    "Trump, longtime admirer of Putin, says aborted mutiny 'somewhat weakened' Russian leader",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Monsoon in Gujarat: Heavy rain forecasted in Saurashtra, North Gujarat today",
    "Coal India Share Price Live blog for 30 Jun 2023",
    "Kotak Bank Share Price Live blog for 30 Jun 2023",
    "Nestle Ind Share Price Live blog for 30 Jun 2023",
    "Nifty predictions June 30: Can the index scale a new high today?",
    "Powergrid Share Price Live blog for 30 Jun 2023",
    "Bharti Airtel Share Price Live blog for 30 Jun 2023",
    "Suzlon Share Price Live blog for 30 Jun 2023"
]