[
    "RIL fixes record date for equity shares allotment, listing of Reliance Strategic",
    "Indian Railways cuts train ticket prices up to 25%. Details here",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "China’s Communist Party is tightening its grip in businesses",
    "Will the rupee emerge as a global currency?",
    "'Na tired hu, na retired, I'm fire': Sharad Pawar quotes Vajpayee on retirement",
    "Top 5 small-cap mutual funds of 2023",
    "Gold rates today at three-month low. Should you buy in this correction?",
    "West Bengal Election LIVE: Voting halted in Dinhata, Murshidabad",
    "PM Modi in Telangana: Why the visit to poll-bound state is important for BJP?",
    "Monsoon Rain LIVE: Yellow alert sounded in 4 districts of Kerala",
    "Delhi High Court turns down PepsiCo's appeal against revocation of potato patent",
    "Maharashtra News Live: ‘Na tired hu, na retired hu’, Sharad Pawar tells Ajit",
    "Multibagger stocks: These five bank shares gave up to 185% return in one year",
    "This iPhone 14 Pro Max costs a whopping ₹5 crore! Why is it so expensive?",
    "Elon Musk's X Corp files lawsuit against Wachtell, Lipton and others. Here's why",
    "Pakistan PM Shehbaz Sharif forms panel to decide participation in World Cup 2023",
    "'You saved us', prevented 'bloodbath', says Sri Lanka's Speaker Abeywardena",
    "Delhi: Yellow alert issued as heavy rains, water logging plague national capital",
    "China wants to contact Dalai Lama on Tibet",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Kerala teenager dies of ‘brain eating amoeba’: What is it and how it spreads",
    "ODOP retailers join forces with Groyyo to boost sales and expand reach",
    "RVNL is awarded contract for rehabilitation and improvement project in Odisha.",
    "India’s bio-economy soars to $100 bn, aim $150 bn by 2025: Jitendra Singh",
    "2023 Audi Q8 e-tron SUV teased ahead launch in India. What to expect"
]