[
    "IKIO Lighting IPO listing: Stock lists at a premium of 37.7% on NSE",
    "Cyclone Biparjoy LIVE: Cyclone weakens in Gujarat; power outage in 940 villages",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "The great Indian monsoon gamble",
    "Motilal MF’s new micro-cap index fund tests the limits",
    "Public safety as priority: Aim for a paradigm shift",
    "Companies can use a social girdle to reduce corporate p ....",
    "Gold price trades tepid despite US dollar hitting five week low. Should you buy?",
    "Stock Market LIVE: Sensex gains 250 pts; Bajaj Finserv shine; TCS lags",
    "Wipro buyback record date today. Should you tender your shares?",
    "US Congressman says India better suited for resolving Ukraine crisis, not China",
    "Ramkrishna Forgings shares hit 52-week high on order win; check details",
    "Cyclone Biparjoy batters Gujarat: 2 dead, 23 injured, power services disrupted",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Meta Platforms urges EU telecoms to seek alternatives before Big Tech subsidies",
    "Zara sells shirt with ‘Hindi words that make no sense’",
    "Nifty predictions June 16: Index may face resistance at 18,750",
    "NCERT textbook row: ‘Name withdrawal disrupting curriculum,’ say academics",
    "Five foreign terrorists killed in encounter in Jammu and Kashmir's Kupwara",
    "Which is the smallest equity market Mark Mobius invests in?",
    "Rupee rises 21 paise to open at 81.96 against US dollar",
    "IKIO Lighting IPO listing date today. GMP, experts see 'fancy' debut of shares",
    "Brij Bhushan Sharan Singh Case",
    "Adani Enterprises share price",
    "2023 Hero Xtreme 160R vs TVS Apache RTR 160 4V Comparison: Which bike to buy?",
    "Ashok Leyland shares rise 4%; should you buy? Here's what top brokerages say",
    "In pics: Cyclone Biparjoy makes landfall in Gujarat, wreaks havoc",
    "Atishi speaks at Cambridge: Entrepreneurial spirit helps in nurturing future"
]