[
    "Microsoft says early June service outages were cyberattacks",
    "Global cues, macro data among factors that may drive Sensex, Nifty this week",
    "US Green Card eligibility criteria eased by Biden administration. Check here",
    "Mint Explainer: Why did Canada halt ties with China's a ....",
    "Why Indian Defence Stocks are Not Overvalued Yet",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "5 earthquakes hit Jammu and Kashmir and Ladakh in 24 hours",
    "Uttarakhand communal tension: Section 144 lifted from Purola, shops reopened",
    "Sovereign Gold Bond: Scheme 2023-24 opens next week. Should you apply?",
    "‘India wouldn't be partitioned if…’: NSA Doval cites Subhas Chandra Bose, Gandhi",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Manipur news: State Oppn parties waiting to meet PM Modi, says Congress",
    "Adipursh gets grand opening, all set to enter ₹100 crore club amid backlash",
    "Biparjoy: Irdai directs insurers to fast-track claim settlement process",
    "Earthquakes of magnitude 4.4, 4.5 hit Ladakh and J&K",
    "Adani Enterprises to take on IRCTC soon. Inks deal to acquire this company",
    "India-US in talks for jet engine production partnership: Report",
    "₹500 missing notes: RBI dismisses reports",
    "Windfall tax on petroleum crude, ATF, diesel retained at zero",
    "Mutual Fund Investment: These ten mid-caps gave up to 45% return in one year",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Happy Father's day 2023: How to spend the day with your dad",
    "Father's Day: How fathers are prioritising their girl child education",
    "Fake currency worth ₹3 lakh seized in West Bengal's Bauria, two held",
    "Horoscope Today: Money astrological predictions for 18 June 2023"
]