[
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "Stock Market LIVE: Sensex, Nifty pare gains; Realty, Pharma drag; Finance shines",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the next cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "Who is Arjun Ram Meghwal, the newly-appointed Law Minister of India?",
    "Instagram down for some users, facing glitch in Stories",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Bharti Airtel Q4 results: Should you buy, sell or hold?",
    "Max Healthcare share price hits all-time high; should you buy or book profit?",
    "Arjun Ram Meghwal replaces Kiren Rijiju as Law Minister",
    "ITC share price jumps ahead of Q4 results today. Buy, sell or hold?",
    "Two-wheeler electric vehicles may become expensive: Here's why",
    "Supreme Court allows Jallikattu",
    "People have ‘lost faith’ in BJP govt, Manipur MLAs tell Amit Shah",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "ITC Q4 results today: Cigarettes, FMCG biz revenue, PAT; key factors here",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Ujjwal Nikam calls Tahawwur Rana's extradition ‘great victory for India’",
    "Indiabulls Real Estate to challenge NCLT order withholding merger with Embassy",
    "Retail sales up 6% in April, says survey",
    "KC Venugopal makes official announcement on Karnataka CM deal",
    "Fixed deposit rate: In revised FD regime, these banks give up to 9% return",
    "US metros experience reversal in resident decline, new estimates show",
    "Specialty Chemical Stock Down 40% in a Year. Is it Worth a Look?",
    "G-7 Summit in Japan: What to expect",
    "Apple online store goes live in Vietnam. More details inside"
]