[
    "Bank, Finance lift Sensex by 470 pts, Nifty up 140 pts; TCS, Wipro drag",
    "Cyclone Biparjoy LIVE: 2 killed in Gujarat, cyclone churns toward Rajasthan",
    "Mint Explainer: Why did Canada suddenly quit China's an ....",
    "Sooner or later, America’s financial system could seize up",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "Stocks to buy today: Why market experts are bullish on auto shares — explained",
    "How soaring gold prices fueled this Rekha Jhunjhunwala stock to life-time high?",
    "Zerodha CEO Nithin Kamath does not feel like a bull run in market; Here’s why",
    "Centre renames Nehru Memorial Museum and Library; Congress reacts",
    "AI will not destroy jobs forever: Yann LeCun, Meta scientist",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Wealthy Indians are leaving the country: 3 key reasons why",
    "'China always placed hopes in American people' Xi Jinping to Bill Gates",
    "Wipro buyback record date today. Should you tender your shares?",
    "IKIO Lighting shares make dream debut at Indian stock market. Buy, sell or hold?",
    "PM Modi pens song with Grammy winner; to be launched today",
    "Senior Tamil Nadu cop Rajesh Das sent to 3 years in jail for sexual harassment",
    "Nifty FMCG index hits all-time high for third consecutive session; here's why",
    "Mbappé backtracks, says he’ll play for PSG",
    "Vodafone Idea abandons 25,000 retail partners as cost cutting measure: Report",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "In charts: The millionaires, too, are looking for greener pastures",
    "Netizens mock Louis Vuitton handbag that is smaller than a grain of sea salt",
    "Foxconn may set up EV factory in India this year: Report",
    "Sensex, Nifty hit record closing highs; investors earn ₹2 lakh crore in a day",
    "Cyclone Biparjoy impact: Gravita's plant in Mundra affected; More details here",
    "2023 Triumph Street Triple R & RS debut in India, price starts at ₹10.17 lakh",
    "Essential travel tips to know before travelling abroad",
    "Tips to avoid food poisoning in your home",
    "Major cinema chains in Middle East bans new Spider-Man movie; here’s why"
]