[
    "‘Only a matter of time’ Jefferies' Chris Wood on Sensex hitting 1 lakh",
    "Nine years of Modi government: How income tax rules changed in this period",
    "Stock Market LIVE: Sensex tops 62k, Nifty up 100 pt; Reliance, TechM rally",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "We need just one big cluster to become an electronics hub",
    "A decade of reformist action has catalysed the emergenc ....",
    "Manipur violence: Curfew relaxed in parts of the state for 7 hours. Check what",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "New Parliament Inauguration LIVE: 25 political parties confirm their presence",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "OpenAI's ChatGPT app hits 500K downloads in just 6 days since launch",
    "India Q4 GDP data expected next week; here's what to expect",
    "Gold Price Today: Rates rise in early trade; should you buy or wait?",
    "'Jockey' maker Page Industries share price drops 10% on weak Q4 results",
    "Manipur violence news Live: Curfew relaxed in parts of the state",
    "Amid El Nino concerns, IMD to hold press conference on ‘Long Range Forecast’",
    "‘Symbol of democracy’: Rajnath urges Oppn not to ‘politicize’ new Parl launch",
    "Not a party event…: Sanjay Raut slams Centre over Parliament inauguration row",
    "Which mutual funds can get cheaper post Sebi’s TER proposals?",
    "Manipur violence: Amit Shah says those behind violence will not be spared",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Krafton revamps Battlegrounds Mobile India description on Play Store",
    "5 High Return Smallcap Stocks to Add to Your Watchlist",
    "‘Fake’: Amul debunks viral video alleging fungus in Amul lassi",
    "Elon Musk accuses Satya Nadela of violating Twitter policy",
    "ZEE5 to stream new series in collaboration with Karan Johar, Guneet Monga",
    "Adidas: India's New Kit Sponsor | Mint Primer | Mint",
    "What is the reason behind the RBI's withdrawal of ₹2,000 notes? | Mint Explains | Mint",
    "What Barbie tells you about near-shoring"
]