[
    "Sensex, Nifty end lower on hawkish RBI; investors poorer by nearly ₹2 lakh crore",
    "Tech Mahindra share price dips despite LIC raising stake in this IT stock",
    "RBI monetary policy: Your home-loan EMIs won’t increase",
    "Surging stockmarkets are powered by artificial intelligence",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Banks to enter a phase of moderation in credit growth",
    "Tracing the shifting patterns of remittance flows",
    "Ind vs Aus Day 2, WTC Live: Siraj stops run-machine Head, Australia at 367/4",
    "Exchanging ₹2,000 notes: 'No panic, no rush, just avoid...,' says RBI Governor",
    "NIIT share price trades volatile on demerger record date. Do you own?",
    "Paytm share price surges 8%; brokerages remain upbeat about the stock",
    "Sensex sheds 300 pts, Nifty down 100 pts; Realty, IT, Pharma lag",
    "'Unfair to punish students.,.' Jaishankar on Indians facing deportation risk",
    "Cyclone Biparjoy Live: ‘Very severe cyclonic storm to intensify further’, IMD",
    "Delhi's IGI Airport introduces app free 'DigiYatra' for passengers",
    "RBI Monetary Policy Live: MPC keeps repo rate unchanged at 6.5%",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Zomato share price hits 52-week high, touches IPO price of ₹76; here's why",
    "IMD issues heatwave alert for certain states, others likely to see excess rain",
    "France: Knife attacker injures 8 children, 1 adult in French Alpine town",
    "EC begins bypoll preparation in Waynad LS seat held by Rahul Gandhi",
    "Zomato could revolutionize food delivery with generative AI technology: Report",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "‘Dont expect Pakistan to understand’: Jaishankar on Akhand Bharat mural row",
    "HMA Agro IPO to open on June 20, price band fixed at ₹555-585 per share",
    "Tata Teleservices shares up 30% in two trading sessions",
    "Priyanka Gandhi to address rally in Madhya Pradesh on June 12"
]