[
    "Bangalore South election results live: BJP's M Krishnappa ahead of R K Ramesh",
    "Belgaum election result 2023 live updates: BJP's Abhay Patil takes lead",
    "Karnataka elections 2023: What happens in case there is a hung Assembly?",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Will RBI extend pause in upcoming policies as April inflation eases to 4.7%?",
    "Kanakapura, Padmanabhanagar LIVE: Battle of heavyweights- Shivakumar vs R Ashoka",
    "Gold, silver price retraces from life-time high. Buy or wait for more dip?",
    "Vedanta Q4 results: Net profit declines 56% to ₹2,634 crore, dividend declared",
    "'If we don't work': Pilot draws parallel with K'taka, mounts pressure on Cong",
    "Shiggaon Constituency Result Live: Incumbent Bommai ahead of Cong candidate",
    "Chikmagalur Constituency Result Live: BJP's CT Ravi trailing in early trends",
    "Chittapur Constituency Result Live: Mallikarjun Kharge's son Priyank leading",
    "Hubballi-Dharwad-Central Polls LIVE: Congress' Jagadish Shettar trailing",
    "Varuna election results live: Congress stalwart Siddaramaiah leading ahead",
    "Karnataka election result 2023: Can JD (S) Devegowda retain Chamundeshwari seat?",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday",
    "SRH vs LSG Dream11 fantasy team predictions",
    "Karnataka Election Result 2023 Winners List LIVE Updates",
    "India's CCI probes Google over alleged anti-competitive in-app payment fees",
    "Jalandhar by-poll: AAP leads in Jalandhar Lok Sabha constituency",
    "Garena Free Fire Max redeem codes May 13, 2023: Get weapons, diamonds, more",
    "Karnataka election result 2023: 'No one contacted me till now,' says Kumaraswamy",
    "UP civic body poll, bye-election results today; counting of votes begins",
    "US: Personal information of 237,000 govt employees beached"
]