[
    "Nykaa Q4: Net profit declines 71% to ₹2.4 cr, revenue up 34%",
    "Hindalco Industries Q4 Results: Net profit down 37% at ₹2,411 crore",
    "LIC's Adani investment value soars to near ₹45,000 crore",
    "Stock Market Today: Sensex, Nifty fall; BSE Midcap hits 52-week high",
    "SBI S&P BSE Sensex Index Fund NFO closes today. Who should invest?",
    "Humans shed genetic information everywhere they go",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "'Not Modiji's Grihapravesh': TMC MP Mahua Moitra on Parliament inauguration",
    "Mutual Funds: Confused over where to invest? Best MFs for investment",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "This US city is sinking because of the weight of its high-rise buildings",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "Fixed deposit: This FD scheme has no premature withdrawal penalty",
    "Sensex ends down, Nifty below 18300; metals, HDFC twins hit, Adani Ent tanks",
    "Liquor policy case: Searches at AAP's Sanjay Singh's aides' premises",
    "Indian banking system remains stable, says RBI Governor",
    "Apple gears up for WWDC 2023, sends media invites. Everything we know so far",
    "Netflix tightens grip on password sharing, crackdown spreads to 103 countries",
    "SpiceJet shares end six-day losing streak, up 6%; Here's why",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "The Luxury Shopping Oasis Emerging in San Francisco’s Struggling Downtown",
    "Moscow will respond to future incursions ‘extremely harshly’: Defence Minister",
    "Google Bard gets a new function, will now add images to its responses",
    "Elizabeth Warren and the FTC Are the Least of Amgen’s Problems",
    "Netflix Cracks Down on Password Sharing",
    "PM Modi to inaugurate Vande Bharat Express and Khelo India University Games on 25 May",
    "New York Times Union Agrees to Contract After Two-Year Fight",
    "Myntra launches ChatGPT-powered search feature for enhanced product discovery",
    "Differences between the new and old parliament buildings"
]