[
    "Sensex closes sub-63k, Nifty down 100 pts; Adani stocks tumble; IndusInd shines",
    "Adani Power to Adani Ports: Adani shares trade red. Market cap dips ₹52,000 cr",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Paytm share price jumps over 90% from life-time low. Is more steam left?",
    "Apple to launch its credit card in India",
    "Opposition Meeting LIVE: Oppn meet 'war cry' against 'fascist' regime: TN CM",
    "BofA Securities raises target price on Paytm; do you own?",
    "Titanic Submarine LIVE: OceanGate co-founder hits back at James Cameron",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi US visit Live: ‘Not an era of war but of dialogue, diplomacy’, says Modi",
    "Shah Rukh Khan's daughter Suhana Khan buys Alibaug farmland for ₹12.91 cr",
    "PM Modi to come back with 300 seats: Amit Shah challenges the opposition",
    "TikTok expands e-commerce reach with 'Trendy Beat' shopping section in the UK",
    "Thanks Congress for announcing ‘can't defeat PM Modi alone,’ says Smriti Irani",
    "Delhi CR Park firing: Masked men shoot at car, driver injured",
    "MoS IT speaks on announcements in tech space during PM Modi's US visit",
    "IT stocks fall after Accenture cuts earnings growth guidance",
    "Infosys shares underperform BSE IT, Sensex in last one year; should you buy it?",
    "Adani Enterprises share price",
    "Suresh Raina opens Indian restaurant in Amsterdam, says ‘I am on a mission’",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "BCCI names squad for West Indies tour, Rohit Sharma continues as captain",
    "Sensex, Nifty fall for second consecutive session; mid, smallcaps underperform",
    "Monsoon to arrive in central, northwest India in two days",
    "US Green Card changes are ‘helpful but stingy,’ expert on alternative options",
    "UPL to transfer specialty chemical biz for ₹3,572 cr to subsidiary; stock dips",
    "Boeing to invest $100m in infrastructure, pilot training programs in India",
    "Heatwave ends, very heavy rainfall predicted in THESE states till 26 June",
    "Mumbai: IMD predicts moderate rains for next few days"
]