[
    "Tata Elxsi Q4 Results: Net profit up 26% to ₹201.5 crore, declares dividend",
    "IndiGo reports record profit in March quarter on robust demand",
    "Lessons from finance’s experience with artificial intelligence",
    "Mint Explainer: What's on the cards at the G7 Summit in ....",
    "Kissinger: for the safety of Europe, get Ukraine into NATO",
    "WPI contraction doesn't guarantee that RBI's fight agai ....",
    "The world could soon breach its 1.5°C target for global warming",
    "Robert Lucas, the Nobel laureate who revolutionised mac ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Supreme Court stays West Bengal govt ban on ‘The Kerala Story’",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "ITC Q4FY23 Results: Net profit up 22.7% to ₹5,225.02 crore, declares dividend",
    "SBI Q4 net profit jumps 83% YoY to ₹16,695 crore; declares dividend",
    "Top gainers and losers in trade today: HCL Tech, Airtel, SBI; Check list here",
    "Siddaramaiah to be next Karnataka CM: How Congress stalwart made it to top?",
    "ITC Q4 results: Firm announces dividend of ₹9.5, fixes record date",
    "PNB Housing Finance Q4 Results: Net profit up 64% to ₹279 crore, NII up 27%",
    "Vedanta shares rise after announcement of dividend record date. Details here",
    "Swiggy's food delivery business turns profitable: CEO",
    "Realty, PSU Bank, FMCG, Pharma drag Sensex by 130 pts; Nifty down 50 pts",
    "Neetu Kapoor purchases apartment in Mumbai’s BKC worth ₹17 crore",
    "DK Shivakumar to be Karnataka's new Deputy CM: All you need to know",
    "Banks credit to NBFCs sees robust growth, mutual funds pare exposure: Report",
    "Reduce GST rates on two-wheelers from 28% to 18%, FADA appeals to GST council",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "EU deforestation rule could cost India up to $1.3 bn in exports every year",
    "‘The Kerala Story’ tax-free in MP, UP so that BJP can do divisive politics: Cong",
    "G7 Summit 2023: Who’s Attending, What’s On The Agenda | Everything You Need To Know",
    "Jet Airways reports net loss of ₹54 crore for Q4FY23, revenue up 12.5%",
    "RITES Q4 net profit dips 2% to ₹138 Cr, Board recommends 60% dividend",
    "India’s Electronics Mfg. Crosses $100 Bn; Next Target, $300 Bn By 2026",
    "Fresh rescue efforts as Italy counts cost of deadly floods",
    "India's Ramco Cements posts near-23% rise in Q4 profit",
    "Realme Narzo N53 with 8MP selfie camera and 5,000mAh battery launched: Details"
]