[
    "Bangalore South election results live:Will BJP's Krishnappa mark his 4th victory",
    "Karnataka Election result 2023 LIVE: Counting begins for all seats in Belgaum",
    "‘Karnataka is a lesson for PM Modi…’ expert says as exit poll gives edge to Cong",
    "Karnataka elections 2023: What happens in case there is a hung Assembly?",
    "Will RBI extend pause in upcoming policies as April inflation eases to 4.7%?",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Congress won't form coalition govt with JD(S) in Karnataka, says Jairam Ramesh",
    "Kanakapura, Padmanabhanagar LIVE: Battle of heavyweights- Shivakumar vs R Ashoka",
    "Gold, silver price retraces from life-time high. Buy or wait for more dip?",
    "Vedanta Q4 results: Net profit declines 56% to ₹2,634 crore, dividend declared",
    "'If we don't work': Pilot draws parallel with K'taka, mounts pressure on Cong",
    "Shiggaon Constituency Result Live: Incumbent Bommai takes lead in early trends",
    "Chikmagalur Constituency Result Live: BJP's CT Ravi trailing in early trends",
    "Chittapur Constituency Result Live: Will Kharge family retain its turf?",
    "Hubballi-Dharwad-Central Polls LIVE: Congress' Jagadish Shettar trailing",
    "Varuna election results live: Congress stalwart Siddaramaiah leading ahead",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Garena Free Fire Max redeem codes May 13, 2023: Get weapons, diamonds, more",
    "Karnataka election result 2023: 'No one contacted me till now,' says Kumaraswamy",
    "UP civic body poll, bye-election results today; counting of votes begins",
    "US: Personal information of 237,000 govt employees beached",
    "IPL 2023: Highlights of MI vs GT match; see pictures",
    "India's new connectivity project for Middle East to counter China's influence",
    "'Support democracy. No question of martial law' says Pakistan army amid unrest",
    "Pakistan frees 198 Indian fishermen from jail"
]