[
    "Karnataka cabinet expansion: Oath-taking ceremony commences for 24 legislators",
    "Complaint filed against Kejriwal, Kharge for inciteful remarks on Prez's caste",
    "Asian businesses are being dragged into the chip war",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "The rise and rise of e-sports",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Niti Aayog meeting today: Why 8 opposition CMs are boycotting event. Read here",
    "PM Modi to Chair Niti Aayog meet today; Kejriwal along with five CMs opt-out",
    "'How to maintain friendship forever?' Nikhil Kamath shares life-changing theory",
    "PR Sundar says, '...is the best response' after settling Sebi advisory case",
    "How income tax rule implies on gifts given from PPF maturity amount?",
    "Android users can download BGMI from today, playable from May 29",
    "Shubman Gill knocks MI out of IPL 2023; Sachin Tendulkar gives him a masterclass",
    "Karnataka cabinet expansion: 24 legislators to take oath as ministers shortly",
    "Indira Canteen is back in Karnataka; breakfast for just ₹5",
    "Bad weather conditions prompt diversion of 6 flights to Jaipur. Check list here",
    "Jefferies include Zomato, SBI Life to long-only portfolios, drops HDFC Life",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday - May 29",
    "‘Modi should return as PM in 2024’: Head Priest who'll present Sengol tomorrow",
    "Delhi airport flight operations disrupted by inclement weather. Check list here",
    "'Naakami ke 9 saal': Congress highlights 'Parivarvaad' in BJP",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "CEO of YouTube Has a Favorite Video and a Plan to Win Over Anyone Watching TV",
    "Mahindra Thar 5-door launch postponed to 2024: Details inside",
    "PM Modi, chief ministers to finalise roadmap for a developed India",
    "Smriti Irani slams Gandhi family for neglecting 'Sengol', as 'stick of Nehruji'",
    "‘Changing the history…’ Bihar CM slams PM Modi over new Parliament building"
]