[
    "Macro woes, wage hikes to impact IT companies Q1 earnings; here's how",
    "Global events to watch out for this week: BoE gov Bailey's speech, US core CPI",
    "Here’s how India can turbocharge e-commerce exports",
    "The global fight against inflation is far from over",
    "Elon Musk Is Making Mark Zuckerberg Seem Cool Again",
    "“Greedflation” is a nonsense idea",
    "India’s fortunes are tightly intertwined with Maruti’s",
    "Adani raises $1.4 bn from stake sale in 3 companies; $9 bn raised in 4 years",
    "Assam CM takes jibe at Rahul Gandhi for joining farmers, says ‘Desire of Prince’",
    "Delhi schools to remain closed tomorrow due to heavy rainfall: CM Kejriwal",
    "3 stocks dominate nearly half of Warren Buffett's dividend income; who are they?",
    "Delhi gets highest rainfall in 40 years, downpour wreaks havoc | WATCH",
    "BBC suspends presenter after claims of paying a teenager for explicit photos",
    "Maharashtra: Chhagan Bhujbal attacks Sharad Pawar, says rebellion in NCP took place in his family",
    "Monsoon Fury LIVE: Trains cancelled on Shimla-Kalka route amid heavy rainfall",
    "Monsoon Rain: Alert issued for heavy rainfall in THESE states for next two days",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "US mass shooting: Nine reported injured in shooting in Cleveland",
    "Canada, UK, Australia, US witness surge in pro-Khalistan demonstrations",
    "Discounts on Russian crude oil plunge to $4, delivery charges remain opaque",
    "FIR against Digvijaya Singh for post on ex-RSS chief in poll-bound MP",
    "Chennai vendor sells tomato at ₹20/kg for a day amid soaring price",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "Rainfall wreaks havoc in N. India. Red alerts issued, schools closed. Top points",
    "Gujarat ATS arrests BSF employee for sharing sensitive data to Pakistani agent",
    "Norms of captive power generation amended to allow more flexibility",
    "US kills ISIS leader in a drone attack in Eastern Syria",
    "Battles for Power rage on within political families",
    "Monsoon update: Schools in Noida to remain closed on 10 July, says DIO",
    "Himachal Pradesh: Schools, colleges to remain closed in on July 10, 11 amid heavy rainfall"
]