[
    "REC Q4FY23 Results: Net profit up 33% to ₹3,065.37 crore",
    "Devyani International Q4 net profit falls 20% YoY to ₹60.7 crore; stock down 4%",
    "Pricol files objection with CCI against Minda Corp over acquiring stake",
    "Karnataka CM race Live: Cong mulls as B'luru readies for swearing-in ceremony",
    "Sensex, Nifty end lower amid US debt ceiling talks",
    "Tamil Nadu announces 4% DA hike for 16 lakh govt employees, pensioners",
    "30-40 ‘terrorists’ holed up inside ex-Pak PM Imran Khan's Lahore house: Report",
    "Why Zomato will not be affected by popularity of food delivery app ONDC?",
    "Newfangled coins and mercenaries may have brought about ....",
    "What’s behind BSE’s decision to relaunch derivatives?",
    "Why are bad films so enjoyable?",
    "How fast can European steelmakers decarbonise?",
    "Unlocking India's export potential: How to overcome the slide",
    "The increasing challenge of finding a spot for your car",
    "JLR: The engine revving up Tata Motors’ profitability",
    "Bank of Baroda ends FY23 on a strong note",
    "Top six small-cap mutual funds for best return on your money",
    "'Love marriages leading cause of most divorces in India,' says Supreme Court",
    "SBI Q4 preview: PAT growth trend to continue, NIM may soften; key factors here",
    "Adani-Hindenburg: SC gives SEBI extension till August 14 to complete probe",
    "Air India's Delhi-Sydney flight suffers mid-air turbulence; passengers injured",
    "Sensex ends 370 pts lower, Nifty down 100; IT, Media, Realty, Metal drag",
    "Market stuck in ‘nervous nineties’! Here's why it is a 'buy on dips' market",
    "Ex-Apple engineer accused of stealing self-driving cars technology for China",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PVR Pictures is now PVR INOX Pictures post merger with Inox Leisure",
    "Viral: Sunder Pichai loves using Pixel Fold, but not as his primary phone | Here's Why",
    "Cabinet approves revision in nutrient-based subsidy rates for fertilizers",
    "Mukhtar Ansari acquitted in 2009 attempt to murder case",
    "LIC-backed multibagger stock announces 200% dividend, scrip trading 144% above 52-week-low",
    "Elon Musk Teases New Tesla Products While Warning About Near-Term Economic Challenges",
    "MS Dhoni, Bhuvan Bam among top celebrities violating advertising rules: ASCI",
    "Goldman Sachs slashes Adani Group stakes from its ESG funds: Report",
    "Hyundai partners with Shell India to install fast chargers at 36 dealerships"
]