[
    "PM Modi envisions new Parliament as a beacon of empowerment and dreams",
    "India bolsters cyber defenses in weeklong exercise amid growing threats",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "Activist investors are needed more than ever",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Move Over, Mars. Elon Musk Turns His Attention to 2024 ....",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "How laddering, barbell can get you better returns from FDs",
    "New Parliament inauguration LIVE: PM Modi pens emotional tweet on historic day",
    "Navigating the debt ceiling: Selling the plan and making it a law",
    "Mann Ki Baat LIVE Updates: PM Modi to address 101st episode of radio program",
    "Shah Rukh Khan faces online criticism with voice-over on new parliament building",
    "Hrithik Roshan and Alia Bhatt win the award for best actor at IIFA 2023",
    "Mahapanchayat will certainly be held today, says wrestler Bajrang Punia",
    "Messi breaks Ronaldo's record for most goals scored in Europe's top five leagues",
    "PM Modi installs 'Sengol' in new Parliament. Here are 10 key highlights.",
    "Amazon 5G Revolution Sale: Deals on affordable smartphones you should not miss!",
    "India facing `very complicated challenge' from China: Jaishankar on border issue",
    "Mahila Samman Mahapanchayat supporters from Punjab stopped at Ambala border",
    "'Compromise' debt bill will prevent ‘catastrophic default’: US President Biden",
    "Multi-faith prayers mark new parliament building inauguration ceremony| WATCH",
    "IMD issues yellow alert for several Maharashtra districts",
    "ICC Cricket World Cup schedule to be announced during WTC Final: Jay Shah",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Voting begins in Turkey presidential election runoff",
    "PM Modi during the new Parliament inauguration",
    "In Pics: Key features of the new Parliament building you should know",
    "‘An incomplete event…’: Supriya Sule on PM Modi inaugurating new Parliament",
    "New Parliament Inauguration: Here are latest developments on opening ceremony"
]