[
    "Adani Power to Adani Ports: Adani shares trade red. Market cap dips ₹52,000 cr",
    "Paytm share price jumps over 90% from life-time low. Is more steam left?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Share Market LIVE: Sensex, Nifty in red; Adani stocks tumble, IndusInd shines",
    "IT stocks fall after Accenture cuts earnings growth guidance",
    "Opposition Meeting LIVE: ‘War of ideology going on in India,’ says Rahul Gandhi",
    "Delhi CR Park firing: Masked men shoot at car, driver injured",
    "Titanic Submarine LIVE: ‘Hearts are with all five souls,' OceanGate says",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "PM Modi US visit Live: ‘Not an era of war but of dialogue, diplomacy’, says Modi",
    "TikTok expands e-commerce reach with 'Trendy Beat' shopping section in the UK",
    "Infosys shares underperform BSE IT, Sensex in last one year; should you buy it?",
    "Bribes-for-jobs scandal rocks TCS, four sacked for corruption",
    "Small-cap FMCG stock BCL Industries declares 1:10 stock split, final dividend",
    "How OceanGate's Titan submersible imploded. Explained in 5 points",
    "HMA Agro Industries Ltd IPO: GMP, subscription status as subscription ends today",
    "Orchid Pharma shares hit 52-week high, rise 5% on launching QIP to raise funds",
    "HP launches Victus 16, Omen 16, Omen Transcend 16, new gaming laptops in India. All details",
    "Adani Enterprises share price",
    "BofA Securities raises target price on Paytm; do you own?",
    "Andhra Pradesh SSC Supplementary Result 2023 results out on bse.ap.gov.in",
    "Railways signs pact with US agency to boost clean energy solutions, e-mobility",
    "Bengal Panchayat polls: ‘Why delay in complying with court orders,’ HC asks EC",
    "Shah Rukh Khan's daughter Suhana Khan buys Alibaug farmland for ₹12.91 cr",
    "Tragic end of OceanGate's tour to Titanic",
    "Apple to launch its credit card in India",
    "AdaniConneX raises $213 million for data centers in India",
    "MoS IT speaks on announcements in tech space during PM Modi's US visit"
]