[
    "Foxconn to pursue India plan without Vedanta, to apply for chip unit separately",
    "Tata Group could soon become the first Indian iPhone maker",
    "India’s only listed drone-maker is flying high",
    "Bringing GST under PMLA could lead to tax terrorism",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "GST Council LIVE: FM Sitharaman chairs 50th Council meeting in Delhi",
    "Supreme Court says Centre's 3rd tenure extension to ED director ‘illegal’",
    "TCS vs Infosys vs Wipro vs HCL Tech: Which IT stock to buy ahead of Q1 results?",
    "Share Market LIVE: Sensex, Nifty pare gains; Sun Pharma jump; Bajaj Fin, UPL lag",
    "Abrogation of Article 370: SC to hear batch of plea from 2 August",
    "Helicopter with 6 foreign tourists crashes near Mount Everest in Nepal: Report",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "Reliance Industries shares hit 52-week high; experts expect more upside",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "Should you buy gold as US dollar index hits nine week low on de-dollarisation?",
    "Tata Motors shares extend rally; becomes 16th most valued automaker in the world",
    "Rajya Sabha polls: TMC announces six new candidates",
    "Bengal Panchayat Poll Violence",
    "Adani Enterprises share price",
    "BJP MLA brandishes chair at Speaker amid ruckus in Bihar Assembly",
    "Covid-19: India reports 20 new cases",
    "New-age tech stocks may see decent revenue growth, improved EBITDA in Q1FY24",
    "Energy firm Oriana Power closes pre-IPO funding round",
    "Six people, including five Mexicans, die in helicopter crash in Nepal",
    "5 things to do when you car gets stuck in water",
    "Critical minerals market surges on soaring demand for clean energy: Report",
    "Five fundamental stocks you can bet on to give a boost to your portfolio"
]