[
    "Bullish on India, didn’t invest in Adani due to debt: Mobius",
    "Three top brokers face multiple probes including for money laundering",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "EU carbon tax will impact only 1.8% of Indian exports",
    "Can Tata Motors sustain tempo in FY24?",
    "Does India have room for a dairy behemoth?",
    "Sebi’s micro-Reit proposals may let you own a slice of ....",
    "It takes two to perform the double-engine tango",
    "Who moved our ghee? It has all but vanished from store shelves",
    "Inflation, Q4 results, among key triggers for Dalal Street in coming week",
    "2024 Lok Sabha elections to be preluded by heated polls in THESE 5 states",
    "CISCE Class 10th and 12th results 2023 Live: Results announced,direct link",
    "EPF vs VPF vs PPF: Taxation and withdrawal rules explained",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "The No-Email Way to Plan a Party",
    "Companies Are Colluding to Cheat H-1B Visa Lottery, U.S. Says",
    "Actually, Guys, You Won’t Be Ridiculed for Wearing This",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "Cyclone Mocha LIVE: Super cyclone hits Myanmar, Bangladesh coasts",
    "Karnataka Election LIVE: CLP authorises Kharge to choose next Karnataka CM",
    "'They won in just one state and…’: Assam CM takes jibe at Congress",
    "Upcoming Q4 results: From SBI to IOCL here are the Q4 earnings to watch this week",
    "Sunil Kanugolu, man behind Cong's Karnataka win, also roped in for MP polls",
    "Tata Group to manufacture Apple iPhone 15 and 15 Plus in India, report says",
    "Praveen Sood has been appointed as Director of the CBI for two years",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "NBA: Memphis Grizzlies suspends Ja Morant from team activities after alleged gun video",
    "Ja Morant suspended from team activities after alleged gun video",
    "Thais reject army-backed government, back 2 pro-democracy parties",
    "Zelenskyy to make surprise visit to Paris for talks with French President Macron",
    "Man City on brink of Premier League title after Arsenal rocked by Brighton",
    "Horoscope Today: Money astrological predictions for 15 May 2023",
    "Wall Street week ahead: Monthly retail sales, industrial production data to guide markets",
    "Govt halts plan to adopt cross-border insolvency rules",
    "Axis Trustee approaches NCLT to add more Future Retail claims"
]