[
    "Anil Agarwal-led Vedanta raises about $850 million via JPMorgan, Oaktree loan",
    "Infosys founder Narayana Murthy plans to double private firm's investments",
    "Biocon shares rise 6% on positive Q4FY23 numbers: check details",
    "Stock Market LIVE: Sensex pares losses, Nifty tests 18300; Hindalco, M&M hit",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "India should adopt a tort law to strengthen its deliver ....",
    "Why is GQG's Rajiv Jain bullish on Adani stocks- Explained?",
    "Deadlier than COVID…, WHO chief warns threat of ‘another pandemic’ emerging",
    "PM Modi invites Australian PM Anthony Albanese to watch Cricket World Cup",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Apple gears up for WWDC 2023, sends media invites. Everything we know so far",
    "It’s bankruptcy that needs a rescue in India",
    "Rupee opens 3 paise lower at 82.83 against US dollar",
    "New Covid cases in China may peak at a whopping 65 million a week!",
    "Indian drugs caused mass child deaths in Gambia: Panel",
    "Go First’s lenders consider big four auditors for resolution professional: Report",
    "Mahindra & Mahindra to sell 3.2% stake in Mahindra CIE Automotive: Report",
    "Check out the companies that will announce Q4 results today",
    "Bengaluru to face power cuts today. Check list of areas affected here",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "'Factually incorrect,’ Delhivery rejects media reports on acquisition talks with",
    "Mahindra CIE Automotive share price jumps over 8% as M&M offloads 3.2% stake",
    "SpiceJet shares end six-day losing streak, up 6%; Here's why",
    "Liquor Policy Case: Searches at AAP's Sanjay Singh's aides' premises",
    "52 dead in Karnataka during pre-monsoon rains, CM Siddaramaiah says",
    "Pakistan's Bilawal Bhutto criticises India for exploiting G20 with Kashmir meet"
]