[
    "IPOs next week: ideaForge Tech, Cyient DLM, PKH Ventures, other. Check details",
    "All flights out of Moscow sold out as rebel group barrel towards city | LIVE",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Aurobindo Pharma, CreditAccess among top midcap & smallcap gainers last week",
    "Motilal Oswal reiterates ‘buy’ on Equitas Small Finance Bank; here's why",
    "Passport Seva 2.0: Jaishankar announces new, upgraded e-passports",
    "Hinduja Group may raise stake from 17% to 26%, to invest ₹10,000 cr: Report",
    "FPIs extend buying streak in Indian equities, infuse ₹30,664 cr in June so far",
    "Amazon, Google to expand investment in India after meeting PM Modi in US",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Wagner chief mutiny against Russia: ‘Knife in the back of people’, says Putin",
    "Maruti Suzuki eVX electric vehicle spied testing. Here's what to expect",
    "Probe PM CARES, says Uddhav amid ED action in jumbo Covid facility 'scam'",
    "Aramco, TotalEnergies sign contracts for $11 billion petrochemicals facility",
    "PM Modi's Egypt visit LIVE: PM Modi lands in Cairo for first bilateral visit",
    "IdeaForge IPO to open on Monday. What GMP signals as issue opens?",
    "PM Modi lands in Cairo for 2 day state visit, received at airport by Egyptian PM",
    "Go First’s Shailendra Ajmera seeks ₹425 crore to restart operations: Report",
    "Adani Enterprises share price",
    "India, Japan to recognise AEO schemes",
    "Tata Communications, Baja Auto, others: These 30 stocks to turn ex-dividend",
    "'Didn't ask for exemption from trials, asked for time to prepare': Sakshi Malik",
    "'It's the first hour!': Netizens fume as heavy rain leaves Mumbai roads flooded",
    "Does Wagnar Group’s rebellion mean Russian defeat in Ukraine war?",
    "Ukraine allies ‘closely follow’ Russia row, Zelensky says ‘their weakness is…’",
    "Mumbai rains: Andheri Subway waterlogged, traffic diverted",
    "Manipur violence: All-party meeting concludes, blast case transferred to NIA"
]