[
    "Share Market LIVE: Sensex, Nifty turn flat; Titan jumps; Divi's, Cipla lag",
    "ideaForge IPO listing date today. Experts, GMP signal four digit debut of shares",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Small-cap funds are all the rage, but should you buy?",
    "India’s shield of privacy should reflect Article 21",
    "Define boundaries and state the fiscal costs of electio ....",
    "NSA Ajit Doval to address Khalistan issue in meeting with UK counterpart Tim Bar",
    "MS Dhoni's 42nd birthday: 5 times Dhoni showed why he is ‘Captain Cool’",
    "IPO-bound Tata Play posts a net loss of ₹105 crore: Report",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Monsoon Rain LIVE: Waterlogging in Bihar's Darbhanga district due to heavy rain",
    "Twitter threatens to sue Meta over Threads app: Report",
    "Jack Dorsey calls Threads ‘Twitter clone’",
    "How women-led startups bridge the gender funding gap in India?",
    "Day trading guide for today: Six stocks to buy or sell on Friday — July 7",
    "PM Modi to unveil two Vande Bharat Express trains today; Check details here",
    "‘Modi surname’ case: Gujarat HC to pronounce verdict on Rahul Gandhi's plea",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 7th July",
    "Stocks to Watch: RIL, SBI, IdeaForge, TCS, Dabur, Titan, Infosys",
    "Gift Nifty, Asian markets, among other global cues for Indian stock market",
    "Karnataka govt finds a solution for Bengaluru's traffic issues | Details here",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "IndiGo's Milestone: 1 Lakh Crore Market Value | Mint Primer | Mint",
    "Taliban's bizarre explanation for women's beauty salon ban puts focus on grooms",
    "Ex-boyfriend buries Indian-origin student alive in Australia",
    "6 Factos that affect your blood sugar levels",
    "Toyota Fortuner, Innova Hycross, Glanza get a price hike from July 5",
    "OTT releases this week: What to watch this weekend?",
    "Drone Destination IPO opens today. GMP, review, other details. Apply or not?",
    "Easy ways to add more veggies to your diet",
    "Rupee falls 17 paise to open at 82.68 against the US dollar",
    "Gorakhpur-Lucknow, Jodhpur-Sabarmati Vande Bharat trains: Timings, routes, stops"
]