[
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "Share Market LIVE: Sensex tops 63k, Nifty gains 50 pt; HDFC Life, Adani Ent jump",
    "TCS names new head of hiring amid probe",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Zudio's fashion finesse boosts Trent's growth plans",
    "Dearth of green talent puts India Inc in a bind",
    "The cost of medical inflation: How much health cover sh ....",
    "Technology has placed women’s financial inclusion within reach",
    "Nationwide summer campaigns can plug school education gaps",
    "Manipur: Women activists interfering in operations, claims Indian Army",
    "Monsoon news LIVE:Over 300 roads closed in Himachal Pradesh, orange alert issued",
    "Russia LIVE: Wagner fighters start pulling out of Rostov-on-Don",
    "Deutsche Bank tells clients some of their Russian shares are missing: Report",
    "Vande Bharat Express on Indore-Bhopal route: Ticket price, timing, other details",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Cyient DLM IPO opens today. GMP, price, review, other details. Should you apply?",
    "Dividend stocks: Eight shares to trade ex-dividend today. Details here",
    "ideaForge Technology IPO vs Cyient DLM IPO: Which issue should you choose?",
    "Vande Bharat Express Rani Kamlapati-Jabalpur: Timing, price, and other details",
    "Mumbai Police say influencer Sapna Gill's allegation against Prithvi Shaw false",
    "Nifty predictions June 27: Crucial support for index placed at 18,650",
    "Hindustan Aeronautics shares in focus as board to mull stock split, dividend",
    "New York road intersection co-named in honour of BR Ambedkar",
    "Adani Enterprises share price",
    "Tomato prices go up to ₹120 kg! Check rates in Delhi, Mumbai, other cities",
    "IMD issues 'orange' alert for Mumbai, heavy rainfall expected in these areas",
    "Kusha Kapila announces separation from husband Zorawar Singh Ahluwalia",
    "Rupee opens 7 paise higher at 81.97 against US dollar"
]