[
    "Max Healthcare share price hits all-time high; should you buy or book profit?",
    "Bharti Airtel Q4 results: Should you buy, sell or hold?",
    "Arjun Ram Meghwal replaces Kiren Rijiju as Law Minister",
    "Instagram down for some users, facing glitch in Stories",
    "Stock Market LIVE: Sensex gains 200 pts; Bank, Metal shine; Pharma, Realty drag",
    "Nobel laureate Robert Lucas, who revolutionised macroec ....",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the next cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Karnataka CM Announcement Live: Siddaramaiah to be CM, DK Shivakumar his deputy",
    "People have ‘lost faith’ in BJP govt, Manipur MLAs tell Amit Shah",
    "Puri-Howrah Vande Bharat Express: Fare, timings, stoppages, other details",
    "Gold rate today steady below $2000 on US dollar pullback from seven-week high",
    "Devyani International shares jump 5% despite fall in Q4 profit",
    "PM Modi to flag off Puri-Howrah Vande Bharat train, launch railway projects",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today",
    "Prime Minister Narendra Modi set to attend G-7 summit in Japan",
    "Nexus Select Trust IPO: What GMP signals as all eye set on listing date?",
    "Amazon Web Services set to invest $12.7 billion in India by 2030",
    "Mahindra 5-Door Thar, rival to Jimny, could debut this August: Report",
    "Mumbai to Goa in 7 hours! New Vande Bharat train operations likely from June",
    "Karnataka CM Announcement Live",
    "Mumbai-Goa Vande Bharat Express",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "G-7 Summit in Japan: What to expect",
    "Apple online store goes live in Vietnam. More details inside",
    "“Investments in Android and Google Play helped Indian developers create jobs,” says Google",
    "Offshore parents of FPI's to be considered ‘Legal entity’: Report",
    "Oberoi Realty's fate hinges on timely Thane projects launch",
    "India reports 906 new covid cases in a day",
    "Model Munmun Dhamecha says Sameer Wankhede framed her to get 'media attention’",
    "Delhi government seeks Centre's approval to appoint PK Singh as chief secretary",
    "Nobel laureate Robert Lucas, who revolutionised macroeconomics, dies at 85",
    "Supreme Court allows Jallikattu"
]