[
    "RBI allows SBI Funds Management to buy upto 9.99% stake in HDFC Bank",
    "Karnataka LIVE: ‘Just pranaam...’ Shivakumar on meet with Kharge, Rahul Gandhi",
    "REC Q4FY23 Results: Net profit up 33% to ₹3,065.37 crore",
    "Newfangled coins and mercenaries may have brought about ....",
    "What’s behind BSE’s decision to relaunch derivatives?",
    "Why are bad films so enjoyable?",
    "How fast can European steelmakers decarbonise?",
    "Unlocking India's export potential: How to overcome the slide",
    "The increasing challenge of finding a spot for your car",
    "JLR: The engine revving up Tata Motors’ profitability",
    "Bank of Baroda ends FY23 on a strong note",
    "Interest income from Mahila Samman Certificate will not attract TDS: Finance Ministry",
    "Hinduja Group Chairman SP Hinduja dies at 87",
    "Goldman Sachs cuts India’s 2023 CAD estimate to 1.4% of GDP on robust remittances",
    "Sensex, Nifty end lower amid US debt ceiling talks",
    "30-40 ‘terrorists’ holed up inside ex-Pak PM Imran Khan's Lahore house: Report",
    "Pricol files objection with CCI against Minda Corp over acquiring stake",
    "Devyani International Q4 net profit falls 20% YoY to ₹60.7 crore; stock down 4%",
    "Why Zomato will not be affected by popularity of food delivery app ONDC?",
    "Tamil Nadu announces 4% DA hike for 16 lakh govt employees, pensioners",
    "Top six small-cap mutual funds for best return on your money",
    "'Love marriages leading cause of most divorces in India,' says Supreme Court",
    "SBI Q4 preview: PAT growth trend to continue, NIM may soften; key factors here",
    "Adani-Hindenburg: SC gives SEBI extension till August 14 to complete probe",
    "Air India's Delhi-Sydney flight suffers mid-air turbulence; passengers injured",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "India to have 16 lakh HNIs by 2027: Knight Frank report",
    "Mandaviya released annual capacity building manual for civil servants",
    "JK Tyres Q4: Firm reports nearly three-fold inc in net profit to ₹108.4 cr",
    "Syngenta, FMC join hands to commercialise new herbicide technology for rice crop",
    "How much wealth you need to join the richest 1% globally",
    "Birla Group stock HIL declares 250% dividend, Q4 net profit plummets 91%",
    "Adani helps airlift mountaineer Anurag Maloo from Kathmandu to AIIMS, Delhi",
    "Shivakumar meets Mallikarjun Kharge amid Karnataka CM race - What was discussed?",
    "Cannes Film Festival: Johnny Depp says 'I have no further need for Hollywood'"
]