[
    "Bank of Baroda PAT more than doubled in Q4FY23; lender declared ₹5.5 dividend",
    "Vodafone to cut 11,000 jobs; check details",
    "Shapoorji Pallonji Group looks to raise $1.6 bn, may pledge shares in Tata Sons",
    "Stock Market LIVE: HDFC twin drag Sensex by 200 pts; PSU Bank shines",
    "Why ‘natural’ toothpastes are on the wane",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Jio, Airtel add 19.8 lakh subscribers, Vodafone Idea loses 20 lakh users in Feb: TRAI",
    "Karnataka CM decision LIVE: Siddaramaiah, DK to meet Cong high command shortly",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "Nifty close to record high amid US debt ceiling talks. Will it hit a new peak?",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Wells Fargo to pay $1 billion in class-action lawsuit: Report",
    "IGL up 19% in 2023 but brokerages bearish on the stock; here's why",
    "HDFC, HDFC Bank stocks turn ex-dividend today; how much will investors get?",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Delhi school gets bomb threat via e-mail",
    "LIC-backed multibagger stock gives 450% return in one year. Do you own?",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "PM Modi likely to inaugurate new Parliament building on 28 May: Report",
    "Suryoday SFB hits new 52-week high: What fuelled the stellar buyin",
    "'The Kerala Story' screening stopped due to poor performance: Tamil Nadu to SC",
    "India’s Exports Fall By 13%; Tough Days Ahead?",
    "West Bengal Class 12 result 2023 to be announced on THIS date",
    "Wipro share buyback: What should investors do?",
    "Elon Musk ‘endorses’ Indian butter chicken and naan, netizens react",
    "IOC Q4 result: Profit rises 52% to ₹10,841 cr, dividend declared",
    "Shivakumar says ‘will not backstab, blackmail’ as Cong mulls Karnataka's next CM",
    "Jio-bp launches premium diesel"
]