[
    "Day trading guide for today: Six stocks to buy or sell on Monday — July 10",
    "SpiceJet board to consider raising fresh capital on July 12",
    "Cyient DLM IPO listing date today. GMP, experts signal strong debut",
    "Stocks to Watch: Cyient DLM, RIL, HDFC Bank, Adani Group, IOCL, SpiceJet",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Can M&M retain its SUV edge in the EV era?",
    "For technology firms, Q1 may be a quarter to forget",
    "Cost of education in India: Exploring expenses and infl ....",
    "An upbeat report works best with clarity on risks",
    "The idea of a Universal Civil Code: What Indians at lar ....",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 10th July",
    "Gift Nifty, Asian markets, among other key global cues from Indian market",
    "Monsoon rain: IMD issues red, orange alert for these states today. Check updates",
    "Traitors running Maharashtra: Uddhav Thackeray",
    "Monsoon Fury LIVE: High flood alert issued in Haryana, UP, Delhi",
    "Share Market LIVE: Sensex, Nifty set for muted start; Gift Nifty in red",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Monsoon mayhem: Incessant rains cause widespread damage, flooding in North India",
    "S Jaishankar to file Rajya Sabha nomination from Gujarat's Gandhinagar today",
    "West Bengal Panchayat Polls: Repolling in nearly 700 booths of 5 districts",
    "Migrant boat from Senegal carrying 300 people missing off Spanish Canary Islands",
    "Mumbai rains: City likely to witness moderate falls today",
    "Heavy rainfall alert: Himachal Pradesh, Punjab, Delhi to witness heavy downpour",
    "Rahul Gandhi defamation case verdict LIVE",
    "Drone Destination IPO opens today",
    "Adani Enterprises share price",
    "HDFC Bank extends special fixed deposit (FD) scheme for senior citizens",
    "L&T Share Price Live blog for 10 Jul 2023",
    "Dr Reddy Share Price Live blog for 10 Jul 2023",
    "Maruti Share Price Live blog for 10 Jul 2023",
    "Adani Ports Share Price Live blog for 10 Jul 2023",
    "M&M Share Price Live blog for 10 Jul 2023",
    "Three private equity groups in race to buy out Gautam Adani's Adani Capital",
    "Top 5 Cash-Rich Midcap Stocks to Add to Your Watchlist",
    "Axis Bank Share Price Live blog for 10 Jul 2023",
    "Suzlon Share Price Live blog for 10 Jul 2023"
]