[
    "HDFC, HDFC Bank stocks turn ex-dividend today; how much will investors get?",
    "Stock Market LIVE: Sensex, Nifty turn red; HDFC twin lag; Divi's, ONGC gain",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Softer inflation grants RBI the space it needed",
    "Measuring India’s manufacturing sector remains a data challenge",
    "Amazon India layoffs: Tech giant lays off about 500 employees: Report",
    "Karnataka CM decision LIVE: Shivakumar leaves for Delhi, says, ‘I’m going alone'",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Vande Bharat Express: This route to have less travel time, more available seats",
    "Explainer | Cong to announce Karnataka's CM today; Here's what happened so far",
    "Nexus Select Trust IPO allotment date today. How to check status online",
    "Delhi school gets bomb threat via e-mail",
    "LIC-backed multibagger stock gives 450% return in one year. Do you own?",
    "Mumbai-Goa Vande Bharat Express train set to launch soon; trial begins today",
    "A month ahead of PM Modi visit, US criticises India over religious freedom",
    "‘Need more theatres…’ Kangana Ranaut on PVR INOX shutting 50 cinema screens",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IPL 2023: LSG vs MI Dream11 fantasy team predictions",
    "Gold, silver rate today trade tepid amid US debt ceiling negotiations",
    "Cannes 2023: How much do you need to pay to attend the film festival?",
    "PVR Inox share price hits new 52-week low after Q4 numbers; Should you buy?",
    "Benefits of drinking sugarcane juice in Summer",
    "Auro Impex & Chemicals IPO subscribed over 66 times: Check GMP here",
    "Garena Free Fire Max redeem codes for May 16, 2023: Get free rewards",
    "Cannes 2023: These Indians will debut at the prestigious film festival",
    "National Dengue Day 2023: What is the significance?"
]