[
    "Govt to accelerate beneficiary schemes in pre-election blitz",
    "Turkey election: Erdogan claims victory in historical Presidential runoff",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "Activist investors are needed more than ever",
    "CEO of YouTube Has a Favorite Video and a Plan to Win O ....",
    "Move Over, Mars. Elon Musk Turns His Attention to 2024 ....",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "More Airlines Are Encountering Near Collisions—and No O ....",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "How laddering, barbell can get you better returns from FDs",
    "India-Japan talks on NE investments soon",
    "Delhi Police files FIR against wrestler 'protest organisers'",
    "Rolls-Royce to cut thousands of jobs: Report says",
    "India should reduce Direct Tax from 40% to 25%, suggests economist. Here's why",
    "CSK vs GT Live Score, IPL 2023 Final: Rains play spoilsport, finals on 29 May",
    "Guwahati-NJP Vande Bharat Express: Route, timings, stoppages, other details",
    "Wall Street week ahead: After US debt deal, investors’ focus on jobs data",
    "Delayed SFT filing attracts penalty: I-T department",
    "Wrestlers' protest: Vinesh and Sangeeta Phogat, Sakshi Malik released | Watch",
    "From Adani Transmission to IRCTC here are corporate earnings to watch this week",
    "Rahul Gandhi gets new passport, set to travel to US tomorrow",
    "Talks on supply chain agreement under IPEF substantially concludes: Govt",
    "Manipur Violence: 40 militants killed, several arrested, says CM Biren Singh",
    "Mallikarjun Kharge slams govt over action on wrestlers protests",
    "'IT cell people are spreading…': Bajrang Punia shares morphed pic of wrestlers",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "Investing ₹10 Lakh in Small Saving Schemes",
    "US Debt Ceiling Crisis Affecting Gold Price",
    "IMD Yellow Alert Maharashtra",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "IT sector’s profit pie drops to 5-year low",
    "‘Need FTAs with rich nations, tax reforms’",
    "The world and even India have left Mumbai far behind",
    "Three pitfalls that social sector workers need to guard against",
    "Don’t lose sight of risks in judging mutual funds",
    "Is ONDC really the UPI moment of e-commerce?",
    "Wrestlers’ detention: Stalin takes jibe at Centre, says ‘Sengol’ has ‘bent’ the very first day",
    "Are PPF, mediclaim a must in new tax regime?"
]