[
    "Bullish on India, didn’t invest in Adani due to debt: Mobius",
    "Three top brokers face multiple probes including for money laundering",
    "Mint Explainer: How did the Congress win Karnataka?",
    "India needs special rules to deal with failed airlines",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Inflation, Q4 results, among key triggers for Dalal Street in coming week",
    "2024 Lok Sabha elections to be preluded by heated polls in THESE 5 states",
    "CISCE Class 10th and 12th results 2023 Live: Results announced,direct link",
    "EPF vs VPF vs PPF: Taxation and withdrawal rules explained",
    "The Pain of Silicon Valley Bank’s Collapse Is Being Fel ....",
    "Inside the ‘Great Race’ at BlackRock: Who Will Replace ....",
    "Help! My Political Beliefs Were Altered by a Chatbot!",
    "Could $3,200 ‘Baby Bonds’ Help End Poverty in America?",
    "Online-Only Startups Adopt a Bold New Strategy: Opening ....",
    "In Hollywood Strike, AI Is Nemesis",
    "King Charles Inherits Bulging Royal Purse Thanks to Pro ....",
    "Google Plans to Make Search More ‘Personal’ with AI Cha ....",
    "The No-Email Way to Plan a Party",
    "Companies Are Colluding to Cheat H-1B Visa Lottery, U.S. Says",
    "Actually, Guys, You Won’t Be Ridiculed for Wearing This",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "Cyclone Mocha LIVE: Super cyclone hits Myanmar, Bangladesh coasts",
    "Karnataka Election LIVE: CLP authorises Kharge to choose next Karnataka CM",
    "'They won in just one state and…’: Assam CM takes jibe at Congress",
    "Upcoming Q4 results: From SBI to IOCL here are the Q4 earnings to watch this week",
    "Sunil Kanugolu, man behind Cong's Karnataka win, also roped in for MP polls",
    "Who moved our ghee? It has all but vanished from store shelves",
    "Tata Group to manufacture Apple iPhone 15 and 15 Plus in India, report says",
    "Praveen Sood has been appointed as Director of the CBI for two years",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Horoscope Today: Money astrological predictions for 15 May 2023",
    "Wall Street week ahead: Monthly retail sales, industrial production data to guide markets",
    "Is there room for a dairy behemoth?",
    "Govt halts plan to adopt cross-border insolvency",
    "Axis Trustee approaches NCLT to add more Future Retail claims",
    "Visa delays push Indian IT firms to hire US locals",
    "‘Go wanted to jump the line in engine delivery’",
    "India to ban import of 1k defence items",
    "IPL 2023 CSK vs KKR: Rana, Singh keep Knights' hope alive for playoffs",
    "Adani revives capex plans for $1.5 billion"
]