[
    "Karnataka Election Result 2023 Winners LIVE: Full list of victorious candidates",
    "Adani Transmission board approved fund raise worth not exceeding ₹8,500 crore",
    "Bangalore South election results live: BJP's M Krishnappa wins by 50,000 votes",
    "New CBI director to be selected today: All you need to know",
    "Belgaum election result 2023 Live: Close call in vote share of Congress, BJP",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Cyclone Mocha LIVE: Bangladesh on high alert",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Shiggaon Constituency Result Live: Bommai leads with 54.95% votes, Cong trails",
    "Kolar election results 2023 LIVE: Cong' Kothur Manjunatha leads with 46K votes",
    "Varuna election results live: Congress stalwart Siddaramaiah leading, BJP trails",
    "Karnataka election result 2023: JD(S) leads by 24,270 votes in Chamundeshwari",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Data mismatches to trigger notices under automated GST scrutiny, say experts",
    "DC vs PBKS Dream11 fantasy team predictions",
    "K'taka elections 2023: BJP's Ashwathnarayan surprised to see polls results",
    "Insider Buying Alert: Examining Promoter Holding Changes in these 6 Stocks",
    "India-EU Trade & Technology Council meet to be held in Brussels on 16 May",
    "Karnataka Election Result 2023: Rahul Gandhi lauds end to ‘nafrat ki bazaar’",
    "Adani Group firms aim to raise $2.56 billion via QIPs",
    "Karnataka election result 2023: Where do the 10 key candidates stand?",
    "Karnataka Election Result: Congress' Dinesh Gundo Rao wins from Gandhi Nagar",
    "Karnataka elections 2023 results: Congress leads in 135 seats; top 10 points"
]