[
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 29th May",
    "IT sector’s profit pie drops to 5-year low",
    "What to watch out for in your appraisal letter",
    "Cereal inflation: Is the worst behind us?",
    "Strategic move: Centre to incentivize MSME industrial p ....",
    "LIC’s valuation offers a silver lining",
    "Is ONDC really the UPI of e-commerce?",
    "How forex cards can make your international travel costlier now",
    "Don’t lose sight of risks in judging mutual funds",
    "India needs to fill the vacuum of its mid-sized enterpr ....",
    "ISRO initiates countdown for launch of satellite to boost NavIC system",
    "Debt ceiling agreement: What's in, what's out of the deal to avert US default",
    "Congress chief Mallikarjun Kharge to meet Ashok Gehlot, Sachin Pilot today",
    "Why comfort is a deterrent to growing wealth",
    "Amit Shah to embark on his 3-day visit to violence-hit Manipur today",
    "CSK vs GT Live Score, IPL 2023 Final: Rains play spoilsport, finals on 29 May",
    "India should reduce Direct Tax from 40% to 25%, suggests economist. Here's why",
    "Rolls-Royce to cut thousands of jobs: Report says",
    "Delhi Police files FIR against wrestler 'protest organisers'",
    "Teleperformance, PE firms look to acquire Everise Holdings",
    "India-Japan talks on NE investments soon",
    "Turkey election: Erdogan claims victory in historical Presidential runoff",
    "Govt to accelerate beneficiary schemes in pre-election blitz",
    "Guwahati-NJP Vande Bharat Express: Route, timings, stoppages, other details",
    "Wall Street week ahead: After US debt deal, investors’ focus on jobs data",
    "New Parliament Building Inauguration",
    "Highlights PM Modi Installs 'Sengol' in new Parliament",
    "Investing ₹10 Lakh in Small Saving Schemes",
    "US Debt Ceiling Crisis Affecting Gold Price",
    "IMD Yellow Alert Maharashtra",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Stock Market LIVE: Sensex, Nifty to start on steady note; SGX Nifty in green",
    "Stocks to Watch: M&M, Reliance, ONGC, Aurobindo Pharma, Maruti Suzuki",
    "Karnataka Portfolio: Siddaramaiah keeps finance, Shivakumar gets irrigation",
    "Global market: Asian markets, US stock futures rise on US debt ceiling deal",
    "Live launch of ISRO's GSLV-F12 mission: When and where to watch",
    "US Memorial Day: What's open and closed on May 29. Full list"
]