[
    "BSE approves share buyback up to ₹374.80 crore at ₹816 per share",
    "Eicher Motors erases about ₹10,700 crore mcap in 3 sessions; what should you do?",
    "The fight over inflation in America and Europe",
    "Can Indian phonemakers ring in the China magic?",
    "China needs foreign workers. So why won’t it embrace im ....",
    "In charts: How India's fruit basket is getting exotic",
    "Amazon seller exports from India to cross $8 bn this year",
    "Banks’ margin party is drawing to a close",
    "Beyond the womb: Journeying through India's largest lab ....",
    "Why credit card users want to grab hold of Axis Magnus",
    "Share Market LIVE: Sensex tops 65,700, Nifty nears 19,500; M&M, TaMo shine",
    "Missed to link PAN card with Aadhaar? Top ten money losses that you may face",
    "Tata Nexon, Hyundai Creta, Maruti Suzuki Brezza and 7 other top SUVs",
    "Explainer: Understanding the 'ticket' for Threads on Instagram",
    "MFs vs gold vs real estate: Which is better as stock market is at record high?",
    "Has Indian stock market topped out after hitting life-time high — explained",
    "Maharashtra News Live: ‘Wont be disqualified,’ claims Ajit Pawar camp",
    "Monsoon Rain LIVE: Heavy to very heavy rains in Gujarat for next 5 days",
    "Cyient DLM IPO: Share allotment declared. What GMP (grey market premium) signals",
    "After TCS, Tata Steel fires 38 employees for breaching its ‘code of conduct’",
    "ideaForge IPO listing date advanced. GMP, experts signal strong debut of shares",
    "Meta's Threads attracts over 5 mn users in just 4 hours, Zuckerberg announces",
    "HDFC Bank's special FD for senior citizens to end tomorrow",
    "Canada: Sikhs for Justice group threatens to 'Besiege' Indian missions on Aug 15",
    "Apple releases iOS 17 Beta 3: Everything that is new",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "India's 'economic diplomacy' bolsters lending in Africa, countering China",
    "Vande Bharat passenger complains about food quality on this route; IRCTC reacts",
    "Khalistani terrorist Pannun, founder of Sikhs for Justice, dead or alive?",
    "Romania’s hot economy is attracting foreign workers",
    "California Committee passes landmark bill to prohibit caste discrimination",
    "₹80 to ₹805: Multibagger SME IPO gives 900% return to allottees in two years",
    "Wagner chief Yevgeny Prigozhin in Russia, troops still in camps: Belarus Prez"
]