[
    "Ideaforge IPO gets investors interested in primary market: Should you subscribe?",
    "Adani Stocks today: Adani Enterprises, Adani Ports among top gainers on Nifty",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Can the Gupta siblings solve Lupin’s US puzzle?",
    "How to report foreign stocks in your income tax returns",
    "The TCS episode holds transparency lessons",
    "Focus on the millets value chain for fortified nutritio ....",
    "Share Market LIVE: Nifty touches 19000, Sensex hits 64k; Adani stocks jump",
    "Sensex, Nifty hit record highs; Adani stocks, metals, banks soar",
    "Turmoil at Byju’s highlights hurdles for India startup scene",
    "ChatGPT iOS app users can now access the internet. Here's how",
    "Tata Motors trademarks 'Frest' nameplate. Is it for production-Curvv-based SUV?",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Mahindra XUV700 will now be available in 40 weeks, as waiting period reduced",
    "Watch: Heated dispute starts over Eid goat in residential society",
    "QS World University Rankings 2024: Top 30 Universities in the World",
    "Uniform Civil Code EXPLAINER | What is UCC? What does Constitution say about it",
    "Tech Mahindra's CEO takes 50% pay cut in FY 2023. This is how much he earned..",
    "Jana Small Finance Bank raises ₹560 cr from Damani, Kacholia, others: Report",
    "Why Do Tata Group Stocks Continue to Rally?",
    "Byju's crisis: ‘Not all rags to riches stories are of honest..’, Hansal Mehta",
    "Gold price rises above ₹58,100 per 10 grams; silver gains",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Nifty touches 19k: ITC, Tata Motors among top contributors to all-time high",
    "Delhi's Airport will start operations on its fourth runway next month",
    "How to bring the benefits of insurance to every doorstep",
    "Pune, Mumbai lead housing sales growth in Q2 2023",
    "Expecting maturity from society: Ex-Bengal CM's child on undergoing sex change",
    "Asia's richest billionaires",
    "UCC: Muslim law board convenes late-night meeting after PM Modi's speech",
    "What EPFO rules say when employer fails to deposit contribution in EPF account",
    "Cut prices to drive FMCG volumes, says report",
    "FIR filed against BJP IT cell chief Amit Malviya in Karnataka"
]