[
    "Vedanta announces first interim dividend for FY24; check details",
    "BPCL beats estimates in Q4 earnings, PAT zooms by 159% to ₹6,478 crore",
    "Bulk deals: Gland Pharma, Max Healthcare, others exchange hands; Check here",
    "Delhi under grip of blistering heatwave as temp touches 46 degrees Celsius",
    "The bitter truth about artificial sweeteners",
    "Securing supply: 2nd steel PLI in the works",
    "Note withdrawal is part of currency management: Das",
    "Fewer footfalls at PVR Inox mirror Bollywood’s waning fortunes",
    "Nostalgia on tap: How tech revived India’s entertainmen ....",
    "Decoding a decade and more: Here are the insights from ....",
    "Zivame data hack: Indian women customers' details up for sale, says report",
    "What are key triggers for Delhivery share price in future?",
    "BPCL Q4 result: Firm declares dividend of ₹4, check details here",
    "AFSPA to be withdrawn completely from Assam? CM Himanta Biswa Sarma's big hint",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Spot purchases from Middle East declined on Russian crude imports: IOC",
    "Congress likely to oppose bill to replace Centre's ordinance on Delhi Services",
    "WhatsApp allows users to edit messages with a 15-minute time limit",
    "BGMI returns to India, but you can not hit the ‘play button’ yet",
    "PB Fintech Q4: Firm narrows net loss to ₹9 cr, revenue up 60%",
    "We did not stop Mohun Bagan fans from entering Eden Gardens: KKR",
    "Delhi, Maharashtra petrol pumps struggle as ₹2,000 note payments surge",
    "Dhanlaxmi Bank records 63% YoY rise in Q4 PAT on sharp decline in provisions",
    "Muthoot Finance Q4 Results",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Bill Gates’ alleged affair with Russian card player Mila Antonova",
    "Senator Tim Scott launches his US presidential campaign, here's all about him",
    "Global markets update: US stocks end mixed ahead of debt ceiling talks",
    "Joe Biden gets low ratings on economy, guns, immigration in AP-NORC poll",
    "EU officials prepare quietly if Joe Biden loses next US Presidential election",
    "Security Chiefs Trim the Fat as Budgets Bite",
    "Horoscope Today: Money astrological predictions for 23 May 2023",
    "Your Company Doesn’t Want You to Take Ozempic for Weight Loss. Here’s Why.",
    "Int’l travel lags despite surge in bookings",
    "Neeraj Chopra creates history, becomes world number 1 in men's javelin rankings"
]