[
    "Karnataka Election Result 2023: Congress claims biggest vote share in 34 years",
    "Recession? Corporate America’s earnings say it’s already arrived",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Karnataka Election LIVE: Basavaraj Bommai resigns as CM",
    "Congress wins Karnataka. Who will be the CM? Shivakumar vs Siddaramaiah",
    "Tata Technologies IPO to Q4 results: Why you should buy Tata Motors shares?",
    "Germany is experiencing a mass worker shortage. Can migration fix it?",
    "Cyclone Mocha LIVE: Thousands flee as Cyclone Mocha heads to Bangladesh, Myanmar",
    "Karnataka Election Result 2023 Winners LIVE: Full list of victorious candidates",
    "US debt default: Talks moving along as parties discuss changes, says Joe Biden",
    "DMart Q4 results: Net profit up 8.3% to ₹505.21 cr, revenue up 21%",
    "Karnataka election results: How stock market will react after BJP's loss?",
    "Karnataka Assembly Election 2023: A look at smallest margins of victory",
    "PM Narendra Modi congratulates Congress for winning Karnataka assembly polls",
    "Karnataka election result 2023: Factors that led to Congress winning",
    "Parineeti Chopra, Raghav Chadha engaged. AAP MP tweets images. See here",
    "Indian Navy, NCB seize 2,500 kg drugs; apprehend suspected Pakistani national",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "‘Fed is going to be a little slower to react in cutting rates’: Elaine Stokes",
    "Germany announces $3 billion military aid package for Ukraine: Report",
    "Ron DeSanti vies with ex-US President Donald Trump to sway Iowa conservatives",
    "‘EU has major stakes in the Indo-Pacific’: EAM S Jaishankar",
    "Israel, Islamic Jihad agree Gaza truce: Report",
    "Help return Ukrainian children from Russia, Zelenskiy asks Pope Francis",
    "NBA Playoffs 2023: Nuggets become 1st team to reach this year's NBA final four",
    "Won't tolerate any further attacks on key installations: Pakistan Army chief",
    "Horoscope Today: Money astrological predictions for May 14, 2023",
    "BJP won't get 100 seats in 2024 Lok Sabha polls, says CM Mamata Banerjee"
]