[
    "Bank Nifty close to life-time high. Will it climb to a new peak?",
    "Ashneer Grover criticizes BharatPe boss, calling it 'game of corporate Rajnish'",
    "Stock Market LIVE: FMCG, IT, Auto lift Sensex above 62,500; Nifty up 100 pts",
    "Early shift to electric could make Royal Enfield a glob ....",
    "Mint Explainer: Thailand’s opposition thumps military-b ....",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "EU carbon tax will impact only 1.8% of Indian exports",
    "Can Tata Motors sustain tempo in FY24?",
    "Does India have room for a dairy behemoth?",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Punjab court summons Kharge in Bajrang Dal defamation case",
    "5 things Bill Gates wishes he knew in his early 20s",
    "Demat accounts rise to 116 million in April",
    "Schengen visa: France saw highest number of visa rejections in 2022: Report",
    "SpiceXpress to get USD 100 mn from UK group, signs MoU",
    "Three top brokers face multiple probes including for money laundering",
    "Cipla share price dips 3% after Q4; key triggers to drive this pharma stock",
    "DMart shares fall 4% after Q4 results",
    "Apple supplier Foxconn to invest $500 million in Telangana: Report",
    "Why did smallcap stock VST Tillers Tractors rise by 15% today?",
    "Tata Motors shares hit new 52-week high; 5 key triggers for the stock ahead",
    "MG Hector, Astor, Gloster now cost more than earlier. Check new prices",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Mint Explainer: Thailand’s opposition thumps military-backed parties",
    "‘Not probed Adani firms since 2016’: Sebi tells Supreme Court",
    "MG Comet EV: Bookings open",
    "Early shift to electric could make Royal Enfield a global market leader",
    "Delhi MCD to beautify city with waste-to-art sculptors. Details here",
    "Massive rule change in cricket: ICC reshapes on-field umpires’ role"
]