[
    "Sebi gets time till 14 Aug to complete Adani probe",
    "Ministry seeks ₹2.5K cr more to back exporters",
    "Power outages: Is India fated to sweat it out this summer?",
    "The metaverse is down, but might not be out",
    "Subsidy cut: A ride into uncertainty for electric two-wheelers?",
    "Goods trade hits a bad patch at the outset of FY24",
    "The last draw: Is the cigarette your last?",
    "Bullish no more: Why Samir Arora decided to exit IT aft ....",
    "Overbearing regulation has fanned hidden risks",
    "Index numbers for social issues need to be impartial by design",
    "Govt makes renewed push to boost hardware manufacturing",
    "Hot summers, hotter prices: How inflation is impacting you",
    "Wednesday trade: FIIs invest ₹149.33 cr, while DIIs sell ₹203.87 cr",
    "Vedant Fashions promoters launch offer for sale to offload 9.88% stake",
    "JK Tyres Q4: Firm reports nearly three-fold inc in net profit to ₹108.4 cr",
    "Elon Musk takes U-turn on sacked Twitter employees, says 'should rehire those…’",
    "Karnataka LIVE: ‘Just pranaam...’ Shivakumar on meet with Kharge, Rahul Gandhi",
    "Some labour-intensive sectors may get PLI scheme benefits, says DPIIT secretary",
    "RBI allows SBI Funds Management to buy upto 9.99% stake in HDFC Bank",
    "Imran Khan says police surrounded his house to possibly arrest him",
    "Prince Harry, Meghan Markle dodge multiple collisions while escaping paparazzi",
    "India defends oil exports post EU’s Russian fuel call",
    "SP, Hinduja group chairman, family patriarch, dies at 87",
    "Xi summit to deepen Central Asian ties in split-screen with G-7",
    "An Indian biryani won’t democratize e-commerce",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Domestic help of Salman’s sister held for stealing diamond earrings",
    "Roseville stabbing suspect arrested",
    "Sebi fines Rs50 lakh on 10 entities for non-genuine trades",
    "Twitter to purge inactive accounts. What to know about it",
    "In Pics| Johnny Depp to Urvashi Rautela Stars bedazzle Cannes film festival",
    "Global markets update: US stocks climb as debt default concerns ease, regional banks rally",
    "Don’t let deep-fake generation act like an AI exemplar"
]