[
    "Key triggers to watch for this week: Q4 earnings, US debt ceiling talks, etc",
    "Jewellers getting more inquiries for gold after RBI withdraws ₹2,000 notes",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "SBI says ‘identity proof, form fill-up not required' to exchange ₹2000 notes",
    "Rishi Sunak says China poses world's biggest security challenge",
    "Public sector banks' total profit crosses ₹1 lakh crore-mark in FY23",
    "PPF account: Why you should not invest in public provident fund; top 5 reasons",
    "Indian Army rescues 400 stranded tourists in north Sikkim amidst rains",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Royal Enfield to soon bring ‘uniquely differentiated electric bikes’: CEO",
    "‘Humanity over politics’: PM Modi asserts diplomacy to resolve Ukraine conflict",
    "'Employee submitting forged documents...unfit to be employed,' says Court",
    "Four Pak drones intercepted along Punjab border in 24 hours",
    "How the scrapping of 2000-rupee note will affect Indian economy economy?",
    "G7 Summit: Jeddah, sleep, and a French plane; here's how Zelenskiy reached Japan",
    "Siddaramaiah, Shivakumar should be given Nobel Peace Prize: Tamil Nadu BJP chief",
    "NCB Officials: Sameer Wankhede's 'chats' with Shah Rukh Khan violate rules",
    "Realty stock declares dividend, LIC held 2.85% stake in Q4: Do you own?",
    "National Anti-Terrorism Day",
    "How to exchange ₹2000 notes",
    "Flipkart Big Bachat Dhamaal Sale",
    "Realty stock declares dividend",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Madhya Pradesh provides free air travel to senior citizens",
    "7 Exquisite Tea Varities You Never Imagined Existed",
    "Explained: What it Right to Repair, how it help consumers and more",
    "IPL 2023: GT vs RCB preview, fantasy team, pitch report and more"
]