[
    "PVR Q4 Results: Net loss at Rs333.4 cr, revenue up 113%",
    "Bank Nifty Projections: Can Nifty Bank hit the 45,000 mark soon?",
    "Adani-Hindenburg case: SC defers hearing SEBI's plea for extension of probe",
    "India's exports fall 12.7% to $34.66 billion in April",
    "Mint Explainer: Why India won’t get a new Commercial St ....",
    "How to improve your trash talk",
    "China learns to manage decline",
    "Early shift to electric could make Royal Enfield a glob ....",
    "Mint Explainer: Thailand’s opposition thumps military-b ....",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "Amid strong global trends, gold up by ₹370, silver soars by ₹750",
    "Karnataka CM decision LIVE: Shivakumar or Siddaramaiah? Who will lead today",
    "Top gainers, losers in trade today: Tata Motors, ITC, Cipla; Check list here",
    "Sameer Wankhede's foreign visits, expensive watches under CBI scanner",
    "Demat accounts rise to 11.6 crore in April",
    "Aryan Khan drugs case: CBI reveals KP Gosavi planned to extort ₹25 cr",
    "Schengen visa: France saw highest number of visa rejections in 2022: Report",
    "Ford seen laying off 1,300 workers in China, local media reports",
    "Sensex gains 300 pts, Nifty up 80; FMCG, IT Auto, Realty shine",
    "Bank Nifty touches all life-time high. Which stocks should you buy today?",
    "Punjab court summons Kharge in Bajrang Dal defamation case",
    "Kalyan Jewellers Q4 net profit falls 1.6%; declares dividend",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Multibagger Chemical Stock",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Airtel Q4 Preview: Revenue growth modest, swift mid-term growth",
    "George Soros rubbishes report of his death, says ‘I am alive and healthy’",
    "PVR INOX plans to shut down 50 cinema screens in next six months. Details here",
    "Thunderstorms, heavy rainfall lash Kolkata, bring relief from heat | Watch",
    "Coal secy Amrit Lal Meena urges for balance between energy security and sustainable development",
    "Investing Book That Flopped 32 Years Ago Now Sells for Thousands",
    "HDFC to raise up to ₹8,000 crore via bonds; check details",
    "ESIC adds 17.31 lakh new workers in March 2023, majority in under 25 age group: labour ministry",
    "Crypto’s most influential firms often follow their own rules"
]