[
    "IKIO Lighting IPO: What GMP signals as focus shifts towards share allotment date",
    "Public provident fund: Should you extend your PPF account after maturity?",
    "Russia’s war on Ukraine is changing Europe",
    "Why Sequoia Capital is sawing off its Chinese branch",
    "Data recap: Rail crash, Apple’s headset, PMI",
    "Most train accidents due to human error, not sabotage",
    "Decade of dedication: 20% TCS staff celebrate 10th anniversary",
    "Pause by RBI, served with caution",
    "Dark truth: Meta's battle against child-sex content on Instagram",
    "How online bond platforms are leveraging Sebi-RBI regul ....",
    "Two planes collide on ground at Tokyo's Haneda airport; no injuries reported",
    "BSF shoots down another Pakistani drone carrying narcotics in Amritsar, Punjab",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Novak Djokovic predicts Alcaraz will win many French Open titles",
    "Ind vs Aus Day 4 LIVE Score, WTC Final 2023: Match to resume at 3 pm",
    "Cyclone Biparjoy: IMD issues heavy rain alert in 3 states for next 3 days",
    "Severe heatwave alert in 7 states till Monday. IMD forecast here",
    "Instagram’s own Twitter rival could be codenamed Project92; Here's how it looks",
    "Do you need to file income tax return when you don't have any tax liability?",
    "Income Tax website down. Know details",
    "How Donald Trump's indictment could impact 2024 US Presidential race",
    "Stronger El Nino dims monsoon prospects",
    "Adani Enterprises share price",
    "Deep brain stimulation can help memory consolidation",
    "Don't want anybody looking through my boxes, Trump's indictment states. 5 points",
    "Canada postpones deportation proceedings against Indian students",
    "Spotify tests 'Your Offline Mix' feature. Is it different from YouTube?",
    "NAFED plans to convert a fifth of its raw chana stocks to dal amid surplus",
    "Universal tap water coverage could save 400,000 lives, $101 bn in costs: WHO",
    "In pics: Kawasaki introduces Eliminator cruiser with a new 450 cc engine!"
]