[
    "PR Sundar says, '...is the best response' after settling Sebi advisory case",
    "Bad weather conditions prompt diversion of 6 flights to Jaipur. Check list here",
    "Asian businesses are being dragged into the chip war",
    "Could a GST cut spur two-wheelers’ sputtering sales?",
    "The rise and rise of e-sports",
    "Data recap: Summer drinks, hiring freeze",
    "Tata Motors’ Tiago, Tigor sales fuelled by EVs, CNG",
    "Nykaa's pink sale fails to lift the blues",
    "Why Nusli Wadia’s SOS couldn’t save Go First",
    "How laddering, barbell can get you better returns from FDs",
    "Jefferies include Zomato, SBI Life to long-only portfolios, drops HDFC Life",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday - May 29",
    "Android users can download BGMI from today, playable from May 29",
    "PM Modi to Chair Niti Aayog meet today; Kejriwal along with five CMs opt-out",
    "Zerodha's Nikhil Kamath concerned as world may get hit by 'friendship recession'",
    "‘Modi should return as PM in 2024’: Head Priest who'll present Sengol tomorrow",
    "Karnataka cabinet expansion: 24 legislators to take oath as ministers today",
    "Delhi airport flight operations disrupted by inclement weather. Check list here",
    "'Naakami ke 9 saal': Congress highlights 'Parivarvaad' in BJP",
    "Go First Insolvency: Flights suspended till May 30, full refund soon",
    "PM Modi pays tribute to Jawaharlal Nehru on his 59th death anniversary",
    "‘US debt ceiling deal very close’: President Joe Biden",
    "IMF urges crisis-hit Sri Lanka to decide on debt restructuring",
    "IPL 2023 MI Vs GT: Shubman Gill's thunderous century glide Titans to finals",
    "Traffic Alert! Avoid these routes on new Parliament inauguration day",
    "New Parliament Inauguration",
    "PSEB 10th Result 2023 Live",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "How income tax rule implies on gifts given from PPF maturity amount?",
    "Weather update: IMD predicts more thunderstorms and rainfall in Delhi",
    "Why your iPhone battery is draining after iOS 16.5 update",
    "Garena Free Fire Max redeem codes for May 27, 2023: Get free rewards",
    "Why did Chhattisgarh food inspector drain 21 lakh litre water from reservoir",
    "Tina Dabi receives accolades from Pakistani refugees after land allocation"
]