[
    "Congress wins Karnataka. Who will be the CM? Shivakumar vs Siddaramaiah",
    "Karnataka Election Result 2023 Winners LIVE: Full list of victorious candidates",
    "Karnataka Election LIVE: Congress, allies secure 138 seats, PM Modi lauds party",
    "Ron DeSantis’s rightward lurch hurts his presidential chances",
    "Pakistan in free fall: What does it mean for India?",
    "Data recap: Gloomy tech, aviation stress, and more",
    "Economic Offences Wing registers FIR against BharatPe e ....",
    "L&T margin: Hope versus reality",
    "The executive keeping Tesla rolling isn’t Musk",
    "Here’s how you can enjoy a 5-star hotel stay for free",
    "Bluesky has much going for it as Twitter’s decentralize ....",
    "Karnataka election results: How stock market will react after BJP's loss?",
    "Cyclone Mocha LIVE: Thousands flee as Cyclone Mocha heads to Bangladesh, Myanmar",
    "PM Narendra Modi congratulates Congress for winning Karnataka assembly polls",
    "Vietnam shoemaker for Nike, Adidas cuts almost 6,000 jobs",
    "Adani Transmission board approved fund raise worth not exceeding ₹8,500 crore",
    "New CBI director to be selected today: All you need to know",
    "West Bengal SSC scam: Calcutta HC orders cancellation of 36,000 teachers' jobs",
    "Karnataka Assembly Elections 2023: Congress crosses majority mark, to form govt",
    "CISCE Class 10th and 12th results 2023 Live: Results to be declared tomorrow",
    "Kolar election results 2023 LIVE: Congress Kothur Manjunatha beats JDS's Srinath",
    "Karnataka Election Result Live",
    "Kolar Constituency Election Results",
    "Karnataka Elections 2023 Live",
    "International Nurses Day 2023",
    "Ujjivan Small Finance Bank",
    "Nexus Select Trust REIT IPO",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Karnataka elections result 2023: BJP MLA who imposed Hijab ban defeated by Cong",
    "The Perils—and Promise—of Hot-Desking",
    "SRH crowd break into 'Kohli' chant after heated exchange with LSG",
    "This defeat is not final, says JD(S) leader Kumaraswamy as JD(S) wins 19 seats",
    "Real Madrid lose $440 million sponsorship battle with Abu Dhabi fund",
    "Karnataka Election Results 2023: Siddaramaiah bats for Rahul Gandhi as PM",
    "Karnataka Assembly Election Result 2023: BJP's Jolle Shashikala wins in Nippani",
    "Indian Navy, NCB seize 2,500 kg drugs; apprehend suspected Pakistani national",
    "IPL 2023 SRH vs LSG: Mankad, Pooran lead Giants to win against Sun",
    "Congress records massive impact on seats from which Bharat Jodo Yatra passed"
]