[
    "HDFC - HDFC Bank merger to be effective July 1, says Deepak Parekh",
    "Market Wrap: Sensex gains over 400 points, Nifty settles above 18,800",
    "Air India-Vistara merger: Not so fast, says CCI",
    "An acrimonious debate about covid’s origins will rumble on",
    "A new class of drugs for weight loss could end obesity",
    "India’s IT industry must weed out corruption in hiring",
    "Americans love American stocks. They should look overseas",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Zudio's fashion finesse boosts Trent's growth plans",
    "Tata Technologies IPO gets Sebi nod",
    "Stock market holiday: NSE, BSE to remain closed on this date not on Wednesday",
    "ICC World Cup 2023 schedule live updates: India to play Pakistan on Oct 15",
    "Gautam Adani terms Hindenburg report as ‘targeted misinformation'",
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "HDFC twins merger: What does the merger mean for depositors and borrowers?",
    "Portfolio management: Best investment options for your child. Read here",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Sensex ends above 63,400, Nifty gains 120 pts; HDFC Life, Apollo Hosp, SBI shine",
    "Monsoon news LIVE: Several parts of Rajasthan receive light to moderate rain",
    "Surging India internet stocks trounce China peers, widening gap",
    "TCS names new head of hiring amid probe",
    "Cyient DLM IPO: GMP, subscription status, other details. Should you apply?",
    "PM Modi flags off five Vande Bharat Express from Bhopal",
    "Adani Enterprises share price",
    "Govt e-marketplace records 10 times growth in procurement in last 3 years: Goyal",
    "Kia Seltos facelift spy shots appear again ahead of July 4 launch: Here’s what's revealed",
    "PM Modi tears into Opposition, says ‘enemies have now come together’: 10 points",
    "Chanda Kochhar, husband bought ₹5.3 cr flat for merely ₹11 lakh: CBI",
    "IDFC First Bank raises ₹1500 crore from tier-2 bonds. Share jumps",
    "5 exercises to improve eyesight",
    "From layoff victims to entrepreneurs: How sacked employees create startup wave?",
    "‘BJP may not be in power tomorrow,’ says West Bengal CM Mamata Banerjee"
]