[
    "Market wrap: Sensex, Nifty end higher; mid, smallcaps hit all-time high",
    "Cosmic CRF IPO to open on June 14; Check details here",
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Cyclone Biparjoy: IMD issues flood alert in THESE Gujarat districts",
    "Mint Explainer: Will ghost offices soon haunt Hyderabad?",
    "Mint Explainer: What is Silvio Berlusconi’s legacy?",
    "Is the global housing slump over?",
    "Mint Explainer: Why Boris Johnson’s dramatic exit is ba ....",
    "How the new generation of weight-loss drugs work",
    "Forces at play: Impact of El Nino, other factors on MSP",
    "Progress report: India vs Asia over the past decade, in 5 charts",
    "Tech-based small business may find home in new hubs",
    "Income tax alert: Pay your first instalment of advance tax by this date",
    "BJP calls Dorsey's ‘govt pressure’ charge ‘white lie’, Oppn says ‘no reason'",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Tremors felt in Delhi: Earthquake of magnitude 5.7 in Jammu & Kashmir",
    "Best Bakery Case: Mumbai Court acquits two accused",
    "Sensex tops 63000, Nifty ends 100 pts higher; Asian Paints, ITC, Titan gain",
    "Twitter to be 'world's most accurate real-time info source': CEO Linda Yaccarino",
    "How to become rich: Five money lessons you should teach your child",
    "MRF becomes the first Indian stock to touch ₹1 lakh per share mark",
    "Indian auto sector registers May’s highest-ever passenger vehicles sale in 2023, SIAM data shows",
    "IMD predicts extremely heavy rains in these states today, orange alert issued",
    "Cyclone LIVE: Amit Shah chairs meeting with state disaster management ministers",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "US NSA Jake Sullivan arrives in Delhi; jet engine deal likely on agenda",
    "Kotak Bank, Asian Paints, Titan among top gainers, losers today",
    "First It Was Quiet Quitting, Now Workers Are Facing Off With Their Bosses",
    "Top 10 Software Development Companies in India",
    "What if the Most Powerful Way to Live Longer Is Just Exercise?",
    "MRF touches ₹1 lakh mark. Should you buy?",
    "More than 6000 high net-worth individuals projected to leave India in 2023",
    "The Chatbot Comes to the Drive-Through. ‘It’s a Pain In the Butt.’"
]