[
    "Bank of Baroda PAT more than doubled in Q4FY23; lender declared ₹5.5 dividend",
    "Stock Market LIVE: Finance, Auto, Media drag Sensex below 62,000; HDFC twin lag",
    "Vodafone to cut 11,000 jobs; check details",
    "Shapoorji Pallonji Group looks to raise $1.6 bn, may pledge shares in Tata Sons",
    "Mint Explainer: Why do carmakers cheat?",
    "Why ‘natural’ toothpastes are on the wane",
    "What’s happening to WhatsApp, and how to stay safe",
    "Breaking down India’s April inflation data in 5 charts",
    "I-banks scoop up IIM grads as slowdown casts a cloud",
    "DMart needs to put some zing into sales",
    "A police unit's dogged hunt for paedophiles",
    "Finfluencers’ earnings: Who bears the real cost?",
    "Jio, Airtel add 19.8 lakh subscribers, Vodafone Idea loses 20 lakh users in Feb: TRAI",
    "Karnataka CM decision LIVE: Siddaramaiah, DK to meet Cong high command shortly",
    "Ahead of WWDC 2023, Apple to roll out iOS 16.6 beta: Report",
    "Nifty close to record high amid US debt ceiling talks. Will it hit a new peak?",
    "Monsoon onset over Kerala to be delayed: Skymet",
    "Manipur violence: Amit Shah assures justice, strict action against perpetrators",
    "Wells Fargo to pay $1 billion in class-action lawsuit: Report",
    "IGL up 19% in 2023 but brokerages bearish on the stock; here's why",
    "HDFC, HDFC Bank stocks turn ex-dividend today; how much will investors get?",
    "Mamata Banerjee makes a u-turn; Says ready to support Congress only if…",
    "Delhi school gets bomb threat via e-mail",
    "LIC-backed multibagger stock gives 450% return in one year. Do you own?",
    "Karnataka CM decision LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "India and EU discuss FTA progress at trade and technology council meeting",
    "Stock Market Today: Sensex, Nifty fall on profit booking",
    "Samsung may launch Galaxy Z Fold 5 and Galaxy Z Flip 5 in July: Report",
    "In Siddaramaiah vs Shivakumar race for Karnataka CM post, 2 more options pop up",
    "SBI Q4 results: PAT growth trend to continue, NIM may soften; key factors here",
    "ITC Q4 results preview: Cigarettes, FMCG biz revenue, PAT; key factors here",
    "Imran Khan, wife attend Lahore High Court hearing: What you need to know",
    "MP Board Result 2023 class 10,12 date and time. Know how to check result",
    "AU Bank shares hit life-time high after Q4 results. Experts see more upside"
]