[
    "Gift Nifty, Asian markets among other global cues for Indian stock market",
    "50th GST Council meeting: Here's what is expected to become cheaper and dearer",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "The rise of cyber threats in a digital dystopia",
    "GST Council LIVE: 50th GST Council meet to be held today; Here's what is on card",
    "Nifty predictions July 11: Index stuck in a range, need to defend 19,300 support",
    "Stocks to Watch: Vedanta, Zee Ent, TCS, SBI, L&T, and Tata Communications",
    "Buy or sell: Vaishali Parekh recommends three stocks to buy today — 11th July",
    "Day trading guide for today: Five stocks to buy or sell on Tuesday — July 11",
    "Himachal rain updates: 7 districts on red alert, flash flood warning issued",
    "NATO summit seeks agreement on Ukraine after Turkey supports Sweden's bid",
    "Twitter-killer Threads becomes the fastest app to have 100 million users",
    "Monsoon LIVE: Rail traffic over old Yamuna bridge temporarily suspended",
    "Life on Venus? Here's what new evidence of phosphine in clouds indicates",
    "Threads vs Twitter: CEO Linda Yaccarino sees largest usage day; Elon Musk reacts",
    "Wagner fighters neared Russian nuclear base during revolt",
    "GST Council to meet on July 11: Online gaming tax, ITC claim key items on agenda",
    "Transparent mice to detect and eliminate cancerous tumours. Here's how",
    "Bangkok's under-construction highway collapses on road, 1 killed",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Ghaziabad: 5 dead after school bus collides with car on Delhi-Meerut Expressway",
    "Senco Gold IPO allotment date today. Latest GMP, how to check status online",
    "Article 370 abrogation in SC: Life returned to normalcy in J&K, says centre",
    "A Bird's Eye View of Dixon Technologies Does Not Look Good",
    "Ultra Cem Co Share Price Live blog for 11 Jul 2023",
    "Hdfc Bank Share Price Live blog for 11 Jul 2023",
    "Hcl Tech Share Price Live blog for 11 Jul 2023",
    "Starlink seeks to get clearance for setting up Earth stations: Report",
    "Tech Mahindra Share Price Live blog for 11 Jul 2023",
    "Indusind Bank Share Price Live blog for 11 Jul 2023"
]