[
    "IdeaForge Technology IPO listing: Stock lists at a premium of 93% on NSE",
    "Share Market LIVE: Sensex, Nifty turn flat; Titan jumps; Divi's, Cipla lag",
    "Will the rupee emerge as a global currency?",
    "Data recap: Jio phone, tomato prices, stocks, and more",
    "Diplomatic coup: India to open first foreign IIT campus ....",
    "Rubber meets the road in premium bike market",
    "Why this MSP regime doesn't help farmers",
    "Small-cap funds are all the rage, but should you buy?",
    "India’s shield of privacy should reflect Article 21",
    "Define boundaries and state the fiscal costs of electio ....",
    "Amarnath Yatra temporarily halted due to rainfall in Kashmir",
    "Titan shares at a new 52-week high on strong Q1 business update",
    "Reddit is forcing moderators to remove NSFW label. Here's why",
    "GST fraud: Leading food delivery service among entities under scanner",
    "Maharashtra News Live: ‘I am still NCP president’, says Sharad Pawar",
    "Toyota Fortuner, Innova Hycross, Glanza get a price hike. Check new prices",
    "CM Siddaramaiah to present Karnataka budget today; here's all you need to know",
    "Adani Enterprises to Adani Total Gas: Three Adani shares trade ex-dividend today",
    "MS Dhoni's 42nd birthday: 5 times Dhoni showed why he is ‘Captain Cool’",
    "Domestic market sees strong influx of new investors in June: Report",
    "NSA Ajit Doval to address Khalistan issue in meeting with UK counterpart Tim Bar",
    "Ex-boyfriend buries Indian-origin student alive in Australia",
    "Taliban's bizarre explanation for women's beauty salon ban puts focus on grooms",
    "Cipla recalls six batches of inhalers due to container defect",
    "Monsoon Rain LIVE: Amarnath Yatra temporarily suspended due to bad weather",
    "Dalai Lama's 88th Birthday",
    "International Kissing Day 2023",
    "Adani Enterprises share price",
    "Eknath Shinde holds late-night meeting amid Maharashtra political crisis",
    "Rahul Gandhi defamation case verdict LIVE: Gujarat HC to pronounce verdict today",
    "Pentagon Rubber SME IPO lists with a premium but fails to hold gains",
    "Karnataka Budget LIVE Updates: CM Siddaramaiah to present budget at 12 noon",
    "Uttarakhand: Badrinath National Highway blocked, tourists stranded",
    "Tesla Inc. cuts battery production workforce in China: Report"
]