[
    "Google to set up its global fintech operations centre at GIFT City",
    "PM Modi's US visit LIVE: ‘India-US partnership is of conviction,’ PM Modi says",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "PM Modi meets top CEOs from US and India as Washington visit concludes",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Covid-19 origin mystery: ‘No direct evidence that it started in…’, says report",
    "Akasa Air increases pilots salary by 40%: Report",
    "Infosys cuts ties with Synergy360 as Australia probes ‘tainted contracts’ case",
    "Adani shares plunge on US probe news",
    "Exited Byju’s board, say Peak XV, Prosus, CZI",
    "PM Modi US visit highlights: ‘AI is future…..’, tweets PM Modi",
    "Apple to launch its credit card in India",
    "Yes Bank to raise ₹25 billion in debt: Report",
    "Opposition Meeting Highlights: Mallikarjun Kharge to chair next meet in Shimla",
    "India's forex reserves rise by $2.35 billion to reach at $596 billion",
    "Drone maker ideaForge raises ₹255 cr from anchor investors ahead of its IPO",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "UPI to account for 90% of retail digital transactions in next 5 yrs: RBI",
    "Adani Enterprises share price",
    "India becomes Asia's highest source of international travelers, especially US",
    "PM Modi lauds US Vice President Kamala Harris, says 'her achievements",
    "Wife tricks her husband into believing there’s alien invasion, video goes viral",
    "Earth's poles have shifted? Experts list two probable reasons. Check here"
]