[
    "'Profit beat, in-line revenue growth hint at India's earnings up-cycle trend'",
    "Govt issues allocation orders to successful bidders of 22 coal blocks",
    "Apple and the meaning of “spatial computing”",
    "How India can tackle dissenting voices in US policy circles",
    "RBI monetary policy: Your home-loan EMIs won’t increase",
    "Surging stockmarkets are powered by artificial intelligence",
    "Could synthetic fuels save the internal combustion engine?",
    "Apple Vision Pro: Can it alter the world of mixed reality?",
    "The disturbing state of train safety in India, in 4 charts",
    "Chinese FDI faces great wall in India as security fears rise",
    "Ind vs Aus Day 2, WTC Live: Match resumes post lunch, Australia at 422/7",
    "Air India to refund passengers after Delhi-San Francisco flight went to Russia",
    "‘Dont expect Pakistan to understand’: Jaishankar on Akhand Bharat mural row",
    "Eurozone in recession at start of 2023, shrunk by 0.1%, says Eurostat",
    "Exchanging ₹2,000 notes: 'No panic, no rush, just avoid...,' says RBI Governor",
    "Cyclone Biparjoy Live: ‘Very severe cyclonic storm to intensify further’, IMD",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "NTPC, Kotak Bank, Tata Teleservices among top gainers, losers today",
    "RBI Monetary Policy Live: MPC keeps repo rate unchanged at 6.5%",
    "Tech Mahindra share price dips despite LIC raising stake in this IT stock",
    "Gyanvapi Mosque row: Petitioner seeks euthanasia approval citing harassment",
    "Mercedes-Benz launches new G 400d as flagship luxury SUV in India at ₹2.5 cr!",
    "Sensex, Nifty end lower on hawkish RBI; investors poorer by over a lakh crore",
    "NIIT share price trades volatile on demerger record date. Do you own?",
    "Paytm share price surges 8%; brokerages remain upbeat about the stock",
    "Section 144 imposed in Kanpur",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "L&T Finance Holdings board recommends final dividend of ₹2, details here",
    "FIIs buying slows to ₹212 crore in Indian stocks today; DIIs sell ₹405 crore",
    "Huw van Steenis suggests how digital bank runs can be prevented",
    "‘Ye kaisa ishq jo. . .': Smriti Irani on Rahul Gandhi's ‘Mohabbat ki Dukan’",
    "Russia tightens persecution of a crucial human-rights group",
    "‘War for Talent’ at Mines Could Drive Up Cost of Energy Transition",
    "Centre takes key decisions to strengthen cooperative sector",
    "IBBI proposes revamp of voting on bids for bankrupt companies",
    "It Is Time to Admit It: Bank Regulation Doesn’t Quite Work"
]