[
    "Supreme Court gets two new judges",
    "Nexus Select Trust lists at premium: Stock surges 4% against IPO issue price",
    "Gland Pharma share price locked at 20% lower circuit after weak Q4",
    "Tata group stock dips 4% after Q4 results. Opportunity for bottom fishing?",
    "Stock Market LIVE: Sensex, Nifty in red; Titan, Asian Paints lag; TechM gains 2%",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "The new consumption boom along India's highways",
    "SBI party may cool after Q4 thrill",
    "Devyani waits for a demand seasoning",
    "Poverty in India is yet again being overstated",
    "‘Rahul Gandhi called me’: DK Shivakumar on why he agreed to be deputy CM",
    "From stock analyst to business partner, what all ChatGPT can do after its update",
    "Gyanvapi Mosque Case Live: SC to hear Muslim side's plea against HC order",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Apple iOS 16.5 released: List of changes, and new features on your iPhone",
    "TN 10th Result 2023 Live: TNDGE SSLC Class 10 results out on tnresults.nic.in",
    "JNU seeks cancellation of discussion on Manipur violence, students go ahead",
    "Undervalued Gems: 3 Penny Stocks Hitting 52-Week Lows. Time to Take a look?",
    "Yadav calls out international community over ambiguity in climate finance",
    "‘Cattle class to Salman films': Sudha Murty’s anecdotes at The Kapil Sharma Show",
    "Elon Musk announces ‘Upload 2-hour videos’ feature on Twitter. Here's how it works?",
    "From AIF framework to Uniform total expense ratio: Sebi proposes four key revamp",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Nexus Select Trust share price jumps after positive listing. Buy, hold or exit?",
    "Mumbai to Navi Mumbai in 20 minutes: India's longest sea bridge to be ready soon",
    "It’s time the West committed to Ukraine for the long haul, says Fabrice Pothier",
    "Luxury buses in Himachal Pradesh to face annual tax of ₹9 lakh"
]