[
    "PVR Q4 Results: Net loss at Rs333.4 cr, revenue up 113%",
    "Bank Nifty Projections: Can Nifty Bank hit the 45,000 mark soon?",
    "Adani-Hindenburg case: SC defers hearing SEBI's plea for extension of probe",
    "India's exports fall 12.7% to $34.66 billion in April",
    "Mint Explainer: Why India won’t get a new Commercial St ....",
    "How to improve your trash talk",
    "China learns to manage decline",
    "Early shift to electric could make Royal Enfield a glob ....",
    "Mint Explainer: Thailand’s opposition thumps military-b ....",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "Amid strong global trends, gold up by ₹370, silver soars by ₹750",
    "Karnataka CM decision LIVE: Shivakumar or Siddaramaiah? Who will lead today",
    "Top gainers, losers in trade today: Tata Motors, ITC, Cipla; Check list here",
    "Sameer Wankhede's foreign visits, expensive watches under CBI scanner",
    "Demat accounts rise to 11.6 crore in April",
    "Aryan Khan drugs case: CBI reveals KP Gosavi planned to extort ₹25 cr",
    "Schengen visa: France saw highest number of visa rejections in 2022: Report",
    "Ford seen laying off 1,300 workers in China, local media reports",
    "Sensex gains 300 pts, Nifty up 80; FMCG, IT Auto, Realty shine",
    "Bank Nifty touches all life-time high. Which stocks should you buy today?",
    "Punjab court summons Kharge in Bajrang Dal defamation case",
    "Kalyan Jewellers Q4 net profit falls 1.6%; declares dividend",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Multibagger Chemical Stock",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Ericsson upgrades Vodafone Idea's charging platform",
    "Biden Admin. In Panic Ahead Of Debt Ceiling Deadline | Will The U.S. Default?",
    "‘Cong won 135 seats in Karnataka under my presidency’: DK Shivakumar",
    "India-EU trade and technology council to hold first ministerial meet on Tuesday",
    "Google invests $1 mn in IIT Madras' new Centre for Responsible AI",
    "Pfizer Q4FY23 Results: Net profit up 3.1%, declares dividend",
    "Nitin Gadkari 'won't put up posters or banners' in next election",
    "Vedanta appoints Sonal Shrivastava as CFO, stock up",
    "NSE launches WTI crude oil, natural gas futures"
]