[
    "Gold price today: Bullion rates rise on MCX ahead of inflation data; What should",
    "Bad news for Infosys employees: IT major defers salary hikes",
    "Share Market LIVE: Sensex, Nifty in green; GST decision drags Delta Corp, Nazara",
    "Delta Corp, Nazara Tech shares crack up to 14% on GST shock",
    "The working-from-home illusion fades",
    "Deficit to deluge: India’s swinging monsoon test",
    "India rises up the ranks in global m-cap race",
    "‘India can tweak treaties with key countries for quick fixes’",
    "Equity markets soar, but will the rally last?",
    "Boxed out: Inside Bollywood’s lost magic",
    "Why the PAN of some NRIs have turned inoperable",
    "Adani stock probe: Get to the nub of the matter",
    "Thailand's Burger King adds ‘real cheese burger’ to its menu; here's what it is",
    "Bharti Airtel buys 20.6% stake in Lavelle Networks, total stake to be 45.6%",
    "Best and worst countries for expats in 2023: Where does India stand?",
    "Shark Tank India sees over ₹100 crore investments in both seasons: Redseer",
    "Happiest Minds launches ₹400 crore QIP",
    "Asia Cup 2023: BCCI's Arun Dhumal reveals venue for India-Pakistan clash",
    "‘Some serve political interests’: Kapil Sibal after Amit Shah's ED chief remark",
    "Innova Crysta, Alcazar, Hector Plus, Scorpio-N among vehicles set to attract 22%",
    "Watch: Rishi Sunak, Anthony Albanese engage in cricket banter at NATO summit",
    "Senco IPO: What GMP signifies after share allotment",
    "TCS Q1 Results Live: IT major TCS to announce Q1FY24 earnings today",
    "US holds title for world's most powerful military, Where does India stand?",
    "ISKON bans Amogh Lila Das for critisicing Vivekananda for ‘eating fish’",
    "Adani Enterprises share price",
    "Reliance Retail can submit resolution plan for Future Enterprises bankruptcy",
    "Mega e-auction for plots in ten cities of Uttar Pradesh. Details here",
    "'India is super fun': Ashneer Grover slams govt over 28% GST on online games",
    "Nothing Phone (2) vs Nothing Phone (1) comparison: Know what's new and upgraded",
    "Delhi riots 2020: SC adjourns hearing for July 24 in Umar Khalid's bail plea",
    "Utkarsh IPO: Should you subscribe to the issue? Here's what brokerages say",
    "ISRO to launch Chandrayaan-3 on Friday. All you need to know"
]