[
    "Oil India posts 10% rise in Q4 standalone PAT to ₹1,788 cr, dividend declared",
    "Nykaa Q4: Net profit declines 71% to ₹2.4 cr, revenue up 34%",
    "Top gainers, losers today: Adani stocks, HDFC twins, Sun Pharma; check list here",
    "Facebook owner Meta starts final round of layoffs",
    "Humans shed genetic information everywhere they go",
    "Decoding the dilemma behind escalating cooking oil imports",
    "How healthy is your favourite fruit drink?",
    "How Beijing tried to derail a G20 youth meeting in Lada ....",
    "Shree Cement: Breaking ground with volumes",
    "Get, set, bet: Inside the high-stakes battle against ga ....",
    "Meet India's credit card nerds earning free foreign tri ....",
    "The withdrawal of ₹2,000 notes is short of a rational ....",
    "India's 2022-23 GDP growth may breach estimated 7 pc: RBI Governor",
    "LIC's Adani investment value soars to near ₹45,000 crore",
    "UK visa: International students not allowed to bring family anymore",
    "Adhir Ranjan defends 'Pagla Modi' remark over scrapping of ₹2000 notes",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "SBI S&P BSE Sensex Index Fund NFO closes today. Who should invest?",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "HDFC AMC gets SEBI's final approval for change in control due to merger",
    "SAD to attend inauguration ceremony on 28 May, says ‘matter of pride…’",
    "Mutual Funds: Confused over where to invest? Best MFs for investment",
    "Who is Sai Varshith Kandula, Indian-origin man charged for threatening Joe Biden",
    "Hyundai Exter SUV teased; set to feature small electric sunroof",
    "Google Bard gets a new function, will now add images to its responses",
    "Narayana Murthy Investments",
    "Simple One launched Electric Scooter",
    "PM Narendra Modi Australia Live",
    "Bengaluru Power Cuts Today",
    "John Wick 4 OTT Release Date",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "FDI flows plummets 16% in FY23 to USD 71 billion",
    "Horoscope Today: Money astrological predictions for 24 May 2023",
    "EU, Sundar Pichai agree to develop voluntary AI pact ahead of new AI rules",
    "Debt-limit talks stall as time runs short to avert us default",
    "ED raids 25 locations in probe against foreign registered online gaming websites",
    "Infollion Research Services SME IPO to open on 29 May 2023: Key points to note",
    "Gujarat Pipavav Port Q4: Net profit up 30% at ₹97.3 cr, revenue up 7%",
    "University of Western Australia Launches Global MBA Programme"
]