[
    "Zee Ent reports net loss of ₹196 cr in Q4, revenue down 9%; key highlights",
    "DGCA asks Go First to submit revival plan in 30 days",
    "What would humans do in a world of super-AI?",
    "Mint Explainer: Are hybrid vehicles actually greener than EVs?",
    "Activist investors are needed more than ever",
    "Can India become a developed nation by 2047?",
    "Ron DeSantis has little chance of beating Donald Trump",
    "Breaking down India’s diesel plan, in 4 charts",
    "Strategic response: India's standardization efforts to ....",
    "Dispelling the finfluencer myth: Be wary of misleading advice",
    "Ola Electric eyes IPO by 2023-end; appoints Goldman Sachs, Kotak as advisors",
    "SoftBank likely to invest about $100 million each in Indian startups: Report",
    "German economy shrinks by 0.3% in Q1 of FY 2023, country enters recession",
    "Phoenix Mills Q4 earnings: Net profit zooms 140% YoY, Board declares 250% dividend",
    "Auto sector moves in fast lane amid strong growth outlook",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "Bharat Dynamics Q4: Net profit declines 42% to ₹152 crore, dividend declared",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Armed man with rifle, knife leaves 3 dead in Japan; police launch manhunt",
    "‘Immensely proud’: Jay Kotak as his fiancée, Aditi Arya, graduates from Yale",
    "Amazon postpones issuing offer letters to campus hires in India",
    "Satyendar Jain on oxygen support, shifted to LNJP hospital: AAP",
    "Rupee ends 7 paise lower at 82.75 against US dollar",
    "Top gainers, losers May 25: Bajaj Auto, ITC, Tata Motors among most active stocs",
    "Cheetah Jwala's two more cubs succumb to extreme heat, 3 days after 1st one died",
    "GSEB SSC Gujarat Board Result",
    "Delhi-Dehradun Vande Bharat Express Train",
    "PSEB Class 10th, 12th Results 2023",
    "Update Aadhar Card Details",
    "Maharashtra HSC Result 2023 LIVE",
    "New Parliament Inauguration LIVE",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Best Cryptocurrencies 2023: Polygon (MATIC), Solana (SOL), Tradecurve (TCRV)",
    "Inside Disney and Comcast’s Fight Over the Future of Hulu",
    "America’s Math Coach Is Teaching Fifth-Graders to Outsmart AI",
    "FPI’s Bet On Auto Sector; Stock Prices Soar | Should You Buy?",
    "SSPL invests ₹200 crore in washing machine unit",
    "Reliance Retail, Jio best positioned player in $150 billion e-commerce market",
    "Nokia C32 with a claimed life of three days launched: Price and other details",
    "Minister Puri hails SAF-powered flight, says a huge towards self reliance, decarbonization",
    "Defence minister advocates technological self-reliance, R&D innovation",
    "Small cap stock with high promoters shareholding declares ₹27 per share dividend: Do you own?"
]