[
    "From 5% to 28% GST rates, here are key highlights of 50th GST council meeting",
    "Full list of items to be costlier and cheaper after 50th GST Council meet",
    "US judge greenlights $69 billion Microsoft-Activision deal, FTC may appeal",
    "The fight over working from home goes global",
    "India’s only listed drone-maker is flying high",
    "What are the chances of an AI apocalypse?",
    "Mint Explainer: Sweden set to join NATO after Turkey backs off",
    "Bringing GST under PMLA could lead to tax terrorism",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Nuclear startup Oklo to go public in US via Sam Altman's SPAC",
    "Amit Shah slams ‘delusional’ critics cheering SC verdict on ED chief's tenure",
    "Indiabulls HF, Delta Corp, 6 others placed under F&O ban on NSE for July 12",
    "Retail inflation likely rose to 4.6% in June; stay within RBI's target in 2023",
    "GST Council reduces tax on food served in cinema halls to 5%; check details",
    "Donald Trump says he would have stopped Ukraine war with his ‘personality’",
    "Another cheetah at Kuno National Park dies, 7th in 3 months",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "Preeti Aghalayam to become first woman director of IIT, set to lead IIT Zanzibar",
    "FIIs on 10-day winning streak, infuse ₹1,197 crore in Indian stocks today",
    "Govt issues inspection order against Shree Cement; stock edges lower",
    "GST Council clears 28% tax on online gaming on full face value amount",
    "Sun Pharma, Maruti, Cyient DLM, Bajaj Finance among top gainers, losers today",
    "SC verdict on extension of tenure of ED Director a 'slap' on govt's face: Cong",
    "Bengal Panchayat Poll Violence",
    "Adani Enterprises share price",
    "Discord, the Teen-Favored Chat Service, Is Finally Adding Parental Oversight",
    "Taylor Swift Proves Too Big for Ticketmaster, Again",
    "ISRO undertakes 24-hour launch rehearsal for Chandrayaan-3 mission",
    "Bosses Push Back on WFH Die-Hards: ‘They Will Need to Show Up’",
    "After no Powerball jackpot winners on Monday, prize money jumps to $725 million",
    "Japan Accuses Australia of Betrayal in Fight Over Natural-Gas Exports",
    "Adani Enterprises raises ₹1,250 crore via allotment of NCDs; check details",
    "Netweb Technologies to launch IPO on 17 July; 10 key highlights here",
    "Equity markets soar, but will the rally last?",
    "Life insurance sector needs to maintain growth momentum"
]