[
    "Air India-Vistara merger: Not so fast, says CCI",
    "Tata Technologies IPO gets Sebi nod",
    "Stock market holiday: NSE, BSE to remain closed on this date not on Wednesday",
    "ICC World Cup 2023 schedule live updates: India to play Pakistan on Oct 15",
    "Gautam Adani terms Hindenburg report as ‘targeted misinformation'",
    "India’s IT industry must weed out corruption in hiring",
    "Americans love American stocks. They should look overseas",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "Zudio's fashion finesse boosts Trent's growth plans",
    "Dearth of green talent puts India Inc in a bind",
    "The cost of medical inflation: How much health cover sh ....",
    "Share Market LIVE: Sensex tops 63k; HDFC Life, Airtel shine; IndusInd, Cipla lag",
    "ideaForge IPO: GMP, subscription status, review. Apply or not?",
    "Portfolio management: Best investment options for your child. Read here",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Monsoon news LIVE: Several parts of Rajasthan receive light to moderate rain",
    "Surging India internet stocks trounce China peers, widening gap",
    "TCS names new head of hiring amid probe",
    "Cyient DLM IPO: GMP, subscription status, other details. Should you apply?",
    "PM Modi flags off five Vande Bharat Express from Bhopal",
    "Russia LIVE: Wagner chief's criminal charges still in place",
    "Adani Enterprises share price",
    "Everyone in South Korea Is About to Get One or Two Years Younger",
    "Adani Enterprises sets record date for 120% dividend payment. Details here",
    "Being Happy With Your Paycheck Isn’t Just About How Big It Is",
    "Too busy to cook? Try these breakfast options",
    "PM Modi says ‘opposition instigating people in the name of Uniform Civil Code’",
    "Covid-19: India reports single-day rise of 33 cases, lowest since March 2020",
    "Samsung Galaxy M34 5G to launch in India on July 7: What we know so far",
    "ICC 2023 ODI Cricket World Cup full schedule: India vs Pakistan on 15 October",
    "Sequoia Made a Fortune Investing in the U.S. and China. Then It Had to Pick One.",
    "An entertaining history of humanist thought"
]