[
    "Punjab govt hikes VAT on Petrol, diesel. Check latest price",
    "Stock market triggers: US Fed policy, macro data, others may drive Sensex, Nifty",
    "Here is why United Spirits and Apollo Tyres look attractive",
    "As Nifty eyes new highs, India’s valuations become a sore point",
    "Netflix Subscriptions Jump as U.S. Password-Sharing Cra ....",
    "More Startups Throw in the Towel, Unable to Raise Money ....",
    "‘It’s Not My Responsibility’ to Save the Office Economy",
    "You Scored With an Online Sports Bet. Do You Owe Taxes?",
    "IPOs next week: HMA Agro Industries, Bizotic Commercial, others. Details here",
    "Leave polarisation to BJP: DK Shivakumar on controversy around RSS founder",
    "Mumbai rains soon? Here's what IMD says",
    "Ind vs Aus Day 4 Highlights, WTC Final 2023: India needs 280 runs in 97 overs",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Karnataka CM Siddaramaiah will be a bus conductor today",
    "9-year-old killed by police during car theft",
    "PM Modi to inaugurate first-ever National Training Conclave in Delhi today",
    "Google Doodle celebrates Father's Day",
    "Shubman Gill's cryptic reaction to Cameron Green's controversial catch. See here",
    "Watch: Ranbir Kapoor’s Animal movie pre-teaser is here",
    "Adipurush set to release this week, advance bookings to start from this date",
    "Delhi Police asks for photos, audio video proof of two women wrestlers: Report",
    "Cyclone Biparjoy likely to make landfall between Kutch and Karachi on 15 June",
    "Adani Enterprises share price",
    "Cyclone Biparjoy likely to make landfall between Kutch, Karachi on 15 June: IMD",
    "Honda now offers up to 10 years of warranty for THESE bike models",
    "Curfew imposed in Maharashtra's Amalner after clash between 2 groups",
    "Chinese warplanes cross Strait's median line today; Taiwan swings into action",
    "What is in store for realty sector after the RBI repo rate pause?",
    "Earthquake of 5.0 magnitude hits South Africa's Johannesburg; video surfaces",
    "Lalu Prasad Yadav turns 75: Here's a look at his political career",
    "These are govt-approved tools you can use to remove malware from phone and computer",
    "What happens if the WTC Final is drawn?"
]