[
    "'Love marriages leading cause of most divorces in India,' says Supreme Court",
    "Air India's Delhi-Sydney flight suffers mid-air turbulence; passengers injured",
    "Stock Market LIVE: Sensex sheds 500 pts, Nifty down 100; all sectors in red",
    "Why are bad films so enjoyable?",
    "How fast can European steelmakers decarbonise?",
    "Unlocking India's export potential: How to overcome the slide",
    "The increasing challenge of finding a spot for your car",
    "JLR: The engine revving up Tata Motors’ profitability",
    "Bank of Baroda ends FY23 on a strong note",
    "Generative AI: Why boardrooms must embrace the next fro ....",
    "Where are India’s missing investment advisers?",
    "Adani-Hindenburg: SC gives SEBI extension till August 14 to complete probe",
    "Market stuck in ‘nervous nineties’! Here's why it is a 'buy on dips' market",
    "Top six small-cap mutual funds for best return on your money",
    "Ex-Apple engineer accused of stealing self-driving cars technology for China",
    "Indian Oil stock cheers Q4 results, hits fresh 52-week high. What's next?",
    "Siddaramaiah to be Karnataka CM? Supporters celebrate amid appointment reports",
    "Bommai on suspense over next K'taka CM: ‘Shows internal situation in Congress’",
    "Crayons Advertising IPO sets price band, this SME public offer to open on May 22",
    "IndiGo inducts second Boeing 777 aircraft for Mumbai-Istanbul",
    "Higher pension or bigger PF balance? Things to consider before rejigging EPS",
    "The Kerala Story becomes 2nd highest grossing Hindi film of 2023",
    "“Microsoft is not in control of OpenAI,” says CEO Satya Nadella. Here's what happened",
    "Adani Total Gas Share Price",
    "Investment Gurus Portfolios",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Johnny Depp, 'Jeanne Du Barry' receive 7 min standing ovation at Cannes | Watch",
    "23 lakh policyholders to earn hefty bonus at HDFC Life; key detail here",
    "Jubilant FoodWorks Q4 net profit drops 59% YoY; announces dividend"
]