[
    "Foxconn to pursue India plan without Vedanta, to apply for chip unit separately",
    "Tata Group could soon become the first Indian iPhone maker",
    "Bringing GST under PMLA could lead to tax terrorism",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "GST Council LIVE: FM Sitharaman chairs 50th Council meeting in Delhi",
    "TCS vs Infosys vs Wipro vs HCL Tech: Which IT stock to buy ahead of Q1 results?",
    "Share Market LIVE: Sensex up 400 pts; Sun Pharma, Maruti jump; UPL lags",
    "Abrogation of Article 370: SC to hear batch of plea from 2 August",
    "Helicopter with 6 foreign tourists crashes near Mount Everest in Nepal: Report",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "Reliance Industries shares hit 52-week high; experts expect more upside",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "Should you buy gold as US dollar index hits nine week low on de-dollarisation?",
    "Tata Motors shares extend rally; becomes 16th most valued automaker in the world",
    "Rajya Sabha polls: TMC announces six new candidates",
    "Bengal Panchayat Poll Violence",
    "Adani Enterprises share price",
    "Suzlon bags 47.6MW wind energy project from KP Group in Gujarat",
    "Suniel Shetty invests in new healthcare venture",
    "Who are the major shareholders in NSDL? Check the list here",
    "‘Gamers not to be taxed as gamblers,’ EPWA on 28% GST proposal on online games",
    "Oppo expects to sell 83 pc more Reno 10 series than previous version, seeks to tap festive season",
    "Taliban says Meta's Threads ‘cannot replace’ Twitter; lists two reasons",
    "You can buy Apple iPhone 13 at ₹20,999 on Flipkart ahead of Amazon Prime Day sale"
]