[
    "IndiGo places world's largest aviation order, how it is different from Air India",
    "Abrdn to sell entire 10.2% stake in HDFC AMC",
    "Cough syrup linked to death of 12 kids in Cameroon likely made in India. Know mo",
    "Return of investor confidence lights up new-age compani ....",
    "Investors suspect breaches at Mojocare, order forensic audit",
    "Why are the rich leaving India?",
    "Ashok Leyland has to swim against the tide",
    "Eating out: How to save money on your next dining experience",
    "US 'does not support' Taiwan's independence: Blinken tells Xi",
    "₹2,000 note withdrawal to boost India’s GDP, says SBI Research",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Advance, self-assessment tax data missing in prefilled income tax forms",
    "Tata Power eyes more state discom takeovers; plans to double capex in FY24",
    "Great Indian Jugaad! Man climbs berths to reach toilet in packed train | Watch",
    "‘Changed Lord Hanuman to angry bird...’: Bhupesh Baghel's swipe on Adipurush row",
    "SEBI bars IIFL Securities from taking new clients for 2 years",
    "IndiGo buys 500 planes from Airbus, the largest order in aviation history",
    "MP govt razes houses of suspects after video of 'man-on-lease' goes viral",
    "PM Modi's US visit: Experts recommend these five defense stocks to buy today",
    "Warren Buffett's Berkshire Hathaway raises stake in 5 Japanese trading houses",
    "Gita Press declines ₹1 cr award amid row over Gandhi Peace Prize selection",
    "FIIs sell ₹1,031 crore in Indian stocks on 19 June; DIIs offload ₹365 crore",
    "Adani Enterprises share price",
    "Brazil school shooting leaves one dead, another critically injured",
    "Norwegian fund commits equity, guarantees for Enel Green Power’s wind plant",
    "Improving rural income is top priority: Sitharaman to NABARD",
    "Ashes: Ollie Robinson 'doesn't care' about using bad words for Usman Khawaja",
    "Who is IPS officer Ravi Sinha? All you need to know about new RAW chief",
    "India Planning To Impose A Carbon Tax On EU Imports | Report",
    "Zerodha's CEO Nithin Kamath take on boosting startup investments in India"
]