[
    "Stock Market LIVE: Sensex, Nifty near all-time high; Bajaj Finserv shines",
    "Nifty predictions June 19: Index may open flat; resistance seen at 19,000",
    "Why are the rich leaving India?",
    "Are Indian firms falling under debt trap again?",
    "Funding value jumps 4x on Amp Energy, Lenskart deals",
    "Ashok Leyland has to swim against the tide",
    "How car ownership is set to get cheaper",
    "Eating out: How to save money on your next dining experience",
    "A reserve currency differs from one that payments are settled in",
    "Stocks to Watch: HDFC Bank, Airtel, RIL, ONGC, Tata Steel, Adani Enterprises",
    "PM Modi's US visit: Dates, itinerary, scheduled events and agenda",
    "Global market: SGX Nifty flat, Asian markets trade lower",
    "Shiv Sena split: Shinde, Thackeray to celebrate party's foundation day today",
    "Sensex, Nifty close to life-time high. Experts recommend these 10 stocks to buy",
    "Heatwave alert! IMD predicts sweltering heat in THESE states till June 20",
    "BJP slams Rahul Gandhi over PSU job comment, ‘Stick to Mickey Mouse interviews’",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "UK PM shares homemade barfi with Ukraine's President",
    "Rupee opens flat at 81.93 against the US dollar",
    "Delhi-Dehradun Vande Bharat Express stone pelted, 7th incident in a year",
    "Dividend stocks: HUL, three other stocks to trade ex-dividend today — June 19",
    "‘Manipur in grip of violence, but…’ Uddhav Thackeray slams PM Modi's US visit",
    "Watch: Girl straightens hair on Delhi Metro train; memes galore",
    "Health startup Mojocare lays off about 170 employees: Report",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Apple iPhone export from India surges to ₹10,000 crore in May",
    "Raghuram Rajan doesn’t ‘care about India being a superpower’",
    "Ravi Shankar raises big question ahead of opposition meet: Who will be PM face?",
    "Apple iPhone 15, iPhone 15 might feature Dynamic Island, 48MP camera and more",
    "BGMI redeem codes for June 19, 2023: Unlock exciting rewards and free gifts!"
]