[
    "Bank Nifty Projections: Can Nifty Bank hit the 45,000 mark soon?",
    "Adani-Hindenburg case: SC defers hearing SEBI's plea for extension of probe",
    "India's exports fall 12.7% to $34.66 billion in April",
    "Mint Explainer: Why India won’t get a new Commercial St ....",
    "How to improve your trash talk",
    "China learns to manage decline",
    "Early shift to electric could make Royal Enfield a glob ....",
    "Mint Explainer: Thailand’s opposition thumps military-b ....",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "Amid strong global trends, gold up by ₹370, silver soars by ₹750",
    "Karnataka CM decision LIVE: Shivakumar or Siddaramaiah? Who will lead today",
    "Top gainers, losers in trade today: Tata Motors, ITC, Cipla; Check list here",
    "Demat accounts rise to 11.6 crore in April",
    "Aryan Khan drugs case: CBI reveals KP Gosavi planned to extort ₹25 cr",
    "Schengen visa: France saw highest number of visa rejections in 2022: Report",
    "Ford seen laying off 1,300 workers in China, local media reports",
    "Sensex gains 300 pts, Nifty up 80; FMCG, IT Auto, Realty shine",
    "Bank Nifty touches all life-time high. Which stocks should you buy today?",
    "Punjab court summons Kharge in Bajrang Dal defamation case",
    "Kalyan Jewellers Q4 net profit falls 1.6%; declares dividend",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Ashneer Grover criticizes BharatPe boss, calling it 'game of corporate Rajnish'",
    "5 things Bill Gates wishes he knew in his early 20s",
    "Multibagger Chemical Stock",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Sameer Wankhede's foreign visits, expensive watches under CBI scanner",
    "Generative AI at the centre for contact centres' transformation, say experts",
    "Mint Explainer: Why India won’t get a new Commercial Street or Connaught Place",
    "NSE launches WTI Crude Oil, Natural Gas futures contracts",
    "The secret to achieving big-picture success with modern business PC",
    "America’s Snacking Binge Shows No Sign of Slowing",
    "MNRE announces major reforms to promote domestic production of solar photovoltaic modules"
]