[
    "Jerome Powell signals a June pause, says Fed can afford to watch data",
    "Phasing out ₹2000 denomination notes: five things you need to know",
    "Why India needs more UPI apps",
    "Why startup valuations are tumbling",
    "Mint Explainer: Why wasn't DK Shivakumar made CM of Karnataka?",
    "“Omit needless words!” But not all of them",
    "Tax on foreign card spends: A bolt from the blue",
    "It’s time the West committed to Ukraine for the long ha ....",
    "The week that was: When exports fell and inflation cooled",
    "A dozen insurance permits up for grabs",
    "Centre issues ordinance to negate SC order on control of services in Delhi",
    "Centre exempts tax at source on credit, debit card purchases upto ₹700,000",
    "RBI withdraws ₹2000 note from circulation, to remain legal tender",
    "What happens to your ₹2000 note now? Read RBI's 15-point explainer here",
    "Karnataka swearing-in ceremony on Saturday: Who's invited and who's not?",
    "India's forex reserves edge towards $600 billion, hit near 1-year high",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Kashmir gears up for G20 summit",
    "Adani-Hindenburg Case: What does SC-appointed panel report say? Key takeaways",
    "Tesla revives import duty talks with India",
    "Bulk Deals Today: HCC, Vishwaraj, others exchange hands: check buyers, sellers",
    "BSE, NSE remove NDTV from ASM framework from Monday",
    "IndiGo announces 3% bonus to crew post Q4 results: Report",
    "Zomato announces three top-level appointments",
    "China’s Shein to have no equity investment in its tie up with Reliance Retail",
    "Glenmark Pharma reports net loss of ₹428 crore in Q4 on weak domestic sales",
    "Battlegrounds Mobile India",
    "WBBSE Madhyamik 10th Result",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "US debt ceiling: Republicans, White House face 'real differences'",
    "Instagram mulls plan to release text-based app to compete with Twitter",
    "Japan’s digital minister says keen to join UPI network",
    "Airlines carry record 12.9 million passengers in April: DGCA",
    "Siemens sells geared motor biz to parent for ₹2,200 cr",
    "‘Shein deal will not need FDI approval’",
    "Can’t seek immunity just because contract is in President’s name: SC",
    "Zetwerk raises $100mn from Avenir",
    "Mandaviya invites global trade to invest in India’s petrochemical",
    "RBI dividend hits ₹87,416 cr, 82% above budget estimate"
]