[
    "Oil prices surge as Saudi Arabia announces voluntary output cut",
    "Govt asks airlines to self-monitor airfares on select routes",
    "Apple Store goes down ahead of WWDC23: Virtual reality ....",
    "Apple WWDC 2023 live updates: How to watch, what to exp ....",
    "Apple WWDC 2023: New iOS 17 feature that no one is talking about",
    "WWDC 2023: Apple set for record high ahead of mixed-rea ....",
    "Apple WWDC 2023: When and where to watch the event online?",
    "Apple WWDC 2023: Gadgets up for launch today",
    "Apple likely to unveil long-rumored headset at develope ....",
    "Apple Summer Camp for Indian kids",
    "WWDC 2023: Here’s your chance to buy Apple iPhone 14 Pl ....",
    "WWDC 2023: Apple may issue health warnings to some of i ....",
    "Apple WWDC 2023: XR Headset, iOS 17 and everything to b ....",
    "Apple WWDC 2023: WatchOS 10 to likely get software upgr ....",
    "Apple WWDC 2023: iOS 17 Beta VS stable version. Which o ....",
    "Apple tests new high-end Macs with M2 Max and unveiling ....",
    "WWDC 2023: Apple's next India store to open in Borivali, Mumbai",
    "Apple might announce “several” Macs at WWDC 2023 event ....",
    "WWDC 2023: Apple introduces a 25 songs music playlist, ....",
    "Apple AR/VR headset details appear online days ahead of ....",
    "Apple makes This big reveal ahead of WWDC 2023, says ‘c ....",
    "Ahead of WWDC 2023, Apple Music Classical app rolled ou ....",
    "Apple WWDC 2023 Swift Student Challenge: 20 year-old de ....",
    "Apple showcases annual “AR experience” Easter egg, ahea ....",
    "Apple to host WWDC 2023 on June 5: All we know so far",
    "Apple WWDC 2023: New iOS 17 feature will turn iPhones i ....",
    "WWDC 2023: Apple might launch trade-in program for new ....",
    "Grab Apple iPhone 12 at just ₹53,999 ahead of Apple WWDC 2023",
    "Apple gears up for WWDC 2023, sends media invites. Ever ....",
    "Apple WWDC 2023: List of iPhones that may support iOS 17",
    "WWDC 2023: Apple may add a smart display-like iPhone lo ....",
    "Apple WWDC 2023: WatchOS expected to arrive with iOS li ....",
    "Apple set to host WWDC 2023 on June 5. Here’s what to expect",
    "WWDC 2023: Expected announcements from Apple's develope ....",
    "Apple WWDC 2023: Is the company working on its ChatGPT- ....",
    "Apple rolls out first iOS 16.6, iPadOS 16.6 beta to dev ....",
    "Apple iOS 17 preview: New accessibility features reveal ....",
    "At WWDC 2023, get ready for Tim Cook's riskiest move at Apple",
    "SBI Card board's approves raising funds up to ₹3,000 cr via NCDs",
    "Spotify announces layoff of 200 employees in podcast division",
    "Can the Indian economy sustain its momentum?",
    "Nvidia is not the only firm cashing in on the AI gold rush",
    "Risks to cereal inflation: Is rice the new wheat?",
    "Who is keeping coal alive?",
    "The FY23 growth story decoded in five charts",
    "RBI may continue pause on rate hike",
    "Two-wheelers kick into high gear",
    "Prathap Reddy and a plan to secure his legacy",
    "M&M, Axis Bank, Tata Motors among top gainers, losers today; check list here",
    "Odisha train accident: CAG audit report had flagged dip in track renewal funds",
    "Wrestlers' protest: Sakshi, Bajrang; rubbish reports of their withdrawal",
    "Apple WWDC 2023 live updates: How to watch, what to expect and all we know so far",
    "WTC Final 2023: 'It's better to stay a bit underdone', says Pat Cummins",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "IMD issues heatwave alert for eastern India",
    "Odisha train crash LIVE: State to bear transportation cost of bodies",
    "Aakash IPO: Byju's to make its test preparatory arm public in 2024",
    "How to tweak your stock portfolio ahead of RBI MPC meeting — explained",
    "Nifty Auto Index touches new 52-week high, Tata Motors, M&M zoom; check details",
    "World Environment Day 2023",
    "Odisha train accident LIVE",
    "Sonalis Consumer Products IPO",
    "Adani Enterprises share price",
    "HDFC Bank suspends official after video of him abusing colleagues went viral",
    "APL Apollo Tubes is top pick for brokerage Motilal Oswal, here's why",
    "SME IPO listing: Hemant Surgical stock rises 100% on debut; should you buy?",
    "Revamping Urban Living: The Community Benefits of Automated Parking Systems",
    "Over 17,000 companies set up in May",
    "Woman's nude body shouldn't always be deemed ‘sexual or obscene’: Kerala HC",
    "Kuki militant camp set ablaze after attacks on deserted homes and gunfight",
    "Centre extends deadline for OALP Round-VIII bids, boosting investor participation in E&P sector",
    "Planning to buy a Honda car? Company is giving June offers on THESE models",
    "Angel One Referral Code ANIJA for Rs.1000 Rewards & Free Demat Account"
]