[
    "Tata Group could soon become the first Indian iPhone maker",
    "Tata Motors shares extend rally; becomes 16th most valued automaker in the world",
    "Bringing GST under PMLA could lead to tax terrorism",
    "Should India limit junk food ads after WHO red flag?",
    "El Nino, India, and the risk of food shortage",
    "The Q1 crystal ball for consumer companies",
    "Regulatory framework for large startups soon",
    "How GCCs stole the thunder from IT firms",
    "Technical analysis: Take it or skip it?",
    "The wider supply risks from China's slump",
    "Share Market LIVE: Sensex up 400 pts; Maruti, HUL shine; RIL at 52-week high",
    "Should you buy gold as US dollar index hits nine week low on de-dollarisation?",
    "Abrogation of Article 370: SC to hear batch of plea from 2 August",
    "GST Council LIVE: FM Sitharaman chairs 50th Council meeting in Delhi",
    "Bengal Panchayat poll violence: Governor says ‘stern action against…’",
    "Monsoon LIVE News: Delhi on high alert as Yamuna crosses danger mark",
    "Schengen visa rejection costed Indians almost ₹90 crore in 2022",
    "Delhi rains: Yamuna crosses danger mark, evacuation begins, old bridge closed",
    "Scientist finds metal pieces in Pacific Ocean that may belong to alien spaceship",
    "Vedanta share price drops almost 3%; here's why Foxconn decided to exit the JV",
    "IdeaForge share price falls 18% as profit-booking follows bumper listing",
    "Barbie Premiere: Actors dazzle in Barbie-inspired outfits on the pink carpet",
    "Andhra Pradesh: 7 dead, 15 injured after bus fell into a canal",
    "Rajya Sabha polls: TMC announces six new candidates",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "Utkarsh Small Finance Bank IPO opens tomorrow: 10 key things to know",
    "EB-5 visa tax hike postponement offers reprieve to Indians",
    "Reliance Industries shares hit 52-week high; experts expect more upside",
    "Mazagon Dock Shipbuilder shares locked at 10% upper circuit; hit record high",
    "Himachal monsoon mayhem: 30 dead, over 500 tourist stranded; alert issued",
    "India’s road network grows 59% in last 9 years | Mint Primer | Mint",
    "Ranbir Kapoor-starrer ‘Animal’ to now release on 1 December",
    "India registers remarkable reduction in poverty; 415 million exit in 15 years"
]