[
    "Ashneer Grover criticizes BharatPe boss, calling it 'game of corporate Rajnish'",
    "Tata Motors Q4 results strong: Should you buy, sell or hold the stock?",
    "Stock Market LIVE: Realty, IT, Auto lift Sensex by 350 pts; Nifty up 100 pts",
    "India will need a foolproof case to tax Netflix",
    "US debt ceiling: Is there a global crisis brewing?",
    "What parties will need to look at after Karnataka",
    "EU carbon tax will impact only 1.8% of Indian exports",
    "Can Tata Motors sustain tempo in FY24?",
    "Does India have room for a dairy behemoth?",
    "Sebi’s micro-Reit proposals may let you own a slice of ....",
    "It takes two to perform the double-engine tango",
    "Kharge summoned over Cong's polls promise to ban Bajrang Dal",
    "5 things Bill Gates wishes he knew in his early 20s",
    "SpiceXpress to get USD 100 mn from UK group, signs MoU",
    "Three top brokers face multiple probes including for money laundering",
    "Cipla share price dips 3% after Q4; key triggers to drive this pharma stock",
    "DMart shares fall 4% after Q4 results",
    "Apple supplier Foxconn to invest $500 million in Telangana: Report",
    "Why did smallcap stock VST Tillers Tractors rise by 15% today?",
    "Tata Motors shares hit new 52-week high; 5 key triggers for the stock ahead",
    "MG Hector, Astor, Gloster now cost more than earlier. Check new prices",
    "Infosys rewards employees by allotting shares under two schemes; check details",
    "‘UCC will be implemented in India’: Assam CM. What does it mean",
    "Who moved our ghee? It has all but vanished from store shelves",
    "Sonata Software Q4 results",
    "Karnataka Election Result 2023",
    "Ujjivan Small Finance Bank",
    "Karnataka Election Winners List",
    "HDFC Life Insurance Company",
    "Indian Oil Corp Share Price",
    "Bay of Bengal epicentre of cyclone formation; here's why",
    "BMW Motorrad teases new R12 nineT motorcycle as successor to R nineT model",
    "Stocks to buy: Analysts say buy these 9 stocks for short term; do you own any?",
    "India wholesale inflation turns negative at -0.92% for April",
    "Warner Studios to release superhero film ‘The Flash’ on 16 June",
    "DMart ends FY23 on a sour note. What is troubling the retailer?"
]