[
    "Prosus slashes Byju's valuation to $5 billion: Report",
    "Bulk deals: HDFC Life, Sapphire Foods, others exchange hands. Check details here",
    "Supertech Chairman RK Arora arrested in money laundering case",
    "This economist was ridiculed for her views on inflation ....",
    "An acrimonious debate about covid’s origins will rumble on",
    "A new class of drugs for weight loss could end obesity",
    "India’s IT industry must weed out corruption in hiring",
    "Americans love American stocks. They should look overseas",
    "Unleashing potential: India's birth as the world's chip hub",
    "The flip side of mega Indian airline orders, in 5 charts",
    "PE investors get power-hungry",
    "HDFC clarifies on tentative dates for completion of merger with HDFC Bank",
    "Byju's in advanced talks to raise $1 billion to prevent investor revolt: report",
    "Companies look to hire AI, ChatGPT experts, may pay up to ₹1.5 crores",
    "Go First cancellations continue, flights now scrapped till June 30",
    "ICC World Cup 2023 schedule: India to play Pakistan on Oct 15",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "India's current account deficit narrows sharply to $1.3 billion in Q4FY23",
    "Adani Group to review capital market strategy after market stablize: CFO",
    "SEBI notifies ways to achieve minimum public unitholding of 25% in REITs, InvITs",
    "FIIs invest ₹2,024 crore in Indian stocks on 27 June; DIIs sold ₹1,991 crore",
    "'Why is tolerance of Hindus being tested?': Allahabad HC slams Adipurush makers",
    "Indian-origin satellite expert appointed as UN Outer Space Affairs director",
    "HDFC twins merger: What does the merger mean for depositors and borrowers?",
    "India will be among fastest growing economy in Asia-Pacific: S&P Global Ratings",
    "ICC World Cup 2023 tickets online",
    "Adani Enterprises share price",
    "Focus on the millets value chain for fortified nutritional security",
    "Can the Gupta siblings solve Lupin’s US puzzle?",
    "SBI to acquire 20 pc stake of SBI Caps in SBI Pension",
    "Govt reworks highway targets for FY24",
    "Pragati Maidan case: Over 1500 detained, 270 vehicles seized during night patrol",
    "Cooling crude shrinks CAD in March quarter to $1.3 bn",
    "Wipro's ₹12,000 crore buyback will close on June 30 instead of June 29",
    "Adani’s Godda plant for power supply to Bangladesh becomes fully operational",
    "Near-term concerns limit upside for city gas distribution cos"
]