[
    "SEBI bars IIFL Securities from taking new clients for 2 years",
    "₹2,000 note withdrawal to boost India’s GDP, says SBI Research",
    "Adani Transmission to raise up to ₹8,500 cr after green light by shareholders",
    "Return of investor confidence lights up new-age compani ....",
    "Investors suspect breaches at Mojocare, order forensic audit",
    "Why are the rich leaving India?",
    "Ashok Leyland has to swim against the tide",
    "Eating out: How to save money on your next dining experience",
    "Warren Buffett's Berkshire Hathaway raises stake in 5 Japanese trading houses",
    "Mumbai Police to provide security to writer of 'Adipurush', Manoj Muntashir",
    "Bajaj twins, Tech Mahindra, Adani Enterprises among top gainers, losers today",
    "US 'does not support' Taiwan's independence: Blinken tells Xi",
    "FIIs sell ₹1,031 crore in Indian stocks on 19 June; DIIs offload ₹365 crore",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "PM Modi's US visit: Experts recommend these five defense stocks to buy today",
    "Advance, self-assessment tax data missing in prefilled income tax forms",
    "Gita Press declines ₹1 cr award amid row over Gandhi Peace Prize selection",
    "Sensex, Nifty end lower on weak global cues; midcaps, smallcaps outperform",
    "Max Life Insurance invests ₹49.5 crore in Capital Small Finance Bank",
    "India's water scarcity led Earth's pole to drift eastwards. Study warns of . . .",
    "Explained: What is Gurbani row, why is Punjab govt amending Sikh Gurdwara Act?",
    "US student visa appointments begin in July, check how to book slots",
    "Adani Enterprises share price",
    "Centre bars states from bidding for food grains, despite opposition. Here's why",
    "Ola Electric CEO announces new product launch, to debut next month",
    "Adityaram Group Introduces Adityaram Palace City: A Luxurious Retreat in Chennai",
    "Karnataka’s Gruha Jyothi scheme launch marred by tech glitches: Report",
    "Adipurush row: Netizens say dialogues 'copied' from Iskcon preachings",
    "ChatGPT and the Art of Affiliate Marketing: Expert Tips for Maximizing Conversions",
    "Raghuram Rajan Doesn’t ‘Care About India Being A Superpower…’; Slammed By Netizens | In Focus",
    "How AI can improve data and marketing strategies",
    "Recognising the Real Desh Chaalaks, Mahindra Logistics Empowers the Drivers of India’s Economy"
]