[
    "HDFC twins merger: RBI clarifies on HDFC Bank's commercial liabilities",
    "Mutual fund tweaks you should make as stock market gains. Explained in five ways",
    "Six banks offer up to 7% interest rates on savings accounts. Full list here",
    "Mint Explainer: Why did Canada halt ties with China's a ....",
    "Sooner or later, America’s financial system could seize up",
    "How Beyonce boosted Sweden’s inflation",
    "AI is not yet killing jobs",
    "Data recap: Power cuts, MSP hike, data breach, and more",
    "AIFs jittery over Sebi move to ban priority distribution",
    "Agrochemicals businesses stare at China, demand issues",
    "The US Fed’s bittersweet pill for stock markets",
    "Adipurush: Manoj Muntashir responds to Lord Hanuman's ‘jalegi tere..’ dialogue",
    "Amit Shah to visit Gujarat to take stock of the areas affected by cyclone",
    "Mutual funds vs real estate: Which one is better for long-term investors",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "How to make the perfect Father's Day Pizza? ChatGPT answers",
    "Manipur news: Two injured as security forces, mobs clash in Imphal",
    "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday",
    "Meta owned Facebook and Instagram now back after outage: Report",
    "Daniel Ellsberg, who leaked Pentagon Papers, dies at 92",
    "Adipurush box office collection expected to be ₹60 crore on Day 2",
    "Amazon Prime Video to stream Kangana Ranaut’s new production on 23 June",
    "Bharati Airtel evaluating offshore bond issue; likely to raise up to $1 billion",
    "Huawei protests EU's phase-out guideline targeting vendor status",
    "Delhi Metro warns against making reels in coaches: ‘Open your camera, Na Na Na!’",
    "IKIO Lighting share price l",
    "Adani Enterprises share price",
    "Sikkim flood havoc: More than 2,000 tourists stranded",
    "Next Covid Shots in the U.S. Will Target Omicron Offshoot XBB.1.5",
    "Watch: PM Modi fan from USA flaunts 'NMODI' on car's license plate",
    "Adipurush Day 1 collection: Prabhas, Kriti Sanon starrer mints about ₹90 crore",
    "ITR filing 2023: List of banks for tax payments available at e-pay tax service",
    "Kickstarting VC-Backed Firms' IPOs Will Take More Than One Blockbuster Debut",
    "Polish LGBTQ march seeks to show strength as election looms",
    "These Pandemic-Era Habits Just Won’t Die",
    "Why Financial literacy is important for growth of your money"
]