[
    "BPCL rights issue: Maharatna company to raise up to ₹18000 crore. Details here",
    "WHO research agency identifies Aspartame sweetener as possible Carcinogen",
    "PKH Ventures IPO opens on June 30: Here are 10 key things to know",
    "India’s low current-account deficit may not be good news",
    "India’s stock market rally should survive the coming Fe ....",
    "Talking about AI in human terms is natural—but wrong",
    "The choice between a poorer today and a hotter tomorrow",
    "Time-of-Day tariff: How it will affect you",
    "Decoding the problem of currency denomination, in 6 charts",
    "Regulatory force: Tech titans bow to CCI whip",
    "AC companies may face the heat in June quarter",
    "Farooq Abdullah urges Centre ‘rethink’ implementation Uniform Civil Code",
    "Senco Gold IPO to open on July 4, price band announced; check details",
    "Xiaomi India cuts jobs amid market slump, staff reduced to less than 1000: Report",
    "Monsoon LIVE: MP likely to witness heavy to very heavy rains in next 2 days",
    "G20 panel to discuss ‘financing cities of tomorrow’ at ....",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Allahabad High Court slams makers of Adipurush, says if documentary on Quran…",
    "Why all parents must open a PPF account for kids?",
    "Cabinet approves ₹3.7 trillion for fertilizer subsidy schemes",
    "IAF's joy over F-414 engine deal, raises concerns about Chinese jet engines",
    "Eid-al-Adha 2023: Lucknow Imam appeals not to do 'Qurbani' in public places",
    "JP Nadda to address public meeting in Rajasthan today",
    "World Bank President Ajay Banga named in US Great Immigrants list of 2023",
    "ideaForge IPO versus Cyient DLM IPO: Which issue should you choose?",
    "Adani Enterprises Stock News",
    "Adani Enterprises share price",
    "Australia: New visa rules applicable for Indian students from July 1",
    "ideaForge IPO: What GMP signals after strong response by investors?",
    "Ukraine sees disarray in Moscow as Russian mercenaries withdraw",
    "Monsoon likely to cover entire India in next two days: IMD",
    "5 Tips to manage sweating in your hands and feet",
    "BMW M 1000 RR, M 1000 RR Competition debut in India. Here's price, features",
    "China's state banks sell dollars to support yuan: Report",
    "LIC Mutual Fund: Company expects big business from this segment of India",
    "DM central banks still hawkish, but EMs set to lead global rate cutting cycle",
    "Dabur’s healthcare portfolio may provide the much-needed boost in FY24"
]