[
    "'CA disappeared': Listed furniture maker explains why it didn't declare earnings",
    "Weak global demand, high interest rate to limit India's FY24 growth to 6%: OECD",
    "Former CEO Rajesh Gopinathan of TCS takes home ₹30 crore in FY23",
    "Generative AI could radically alter the practice of law",
    "As MTNL dies, its expertise must live on",
    "Exposing the dark side: The story behind the ban on 14 FDC drugs",
    "Growth pangs: Why are India's goods exports plateauing?",
    "Companies must act to check toxic behaviour in office",
    "Silver lining: Falling costs benefit steel makers",
    "Will the HDFC merger live up to its promise?",
    "How Bajaj Finserv plans to sell mutual funds to its 100 ....",
    "Twist in Odisha train accident probe; Railways engineer makes revealing claims",
    "LIC hikes stake in Tech Mahindra to 9%",
    "Wrestlers suspend protest against WFI chief till June 15 after meeting minister",
    "Lionel Messi to join MLS club Inter Miami: Report",
    "Cyclone Biparjoy Live: Monsoon to hit Kerala in next 48 hrs, says IMD",
    "Ind vs Aus Live Score, WTC 2023 Final: Smith, Head dominate Day 1; Aus at 327/3",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "Explained: Why China and Turkey won't attend the G20 me ....",
    "G20 working group to discuss debt distress, global fina ....",
    "G20 meeting in Srinagar: Security tightened across Jamm ....",
    "China to skip G20 meeting in Srinagar, calls Jammu and ....",
    "G20 meet in Srinagar next week, traffic police issues advisory",
    "J&K residents receive calls to come out on streets ....",
    "G20 Trade and Investment Working Group second meeting i ....",
    "China opposes G20 meeting in Kashmir, Turkey also likely to skip",
    "Mumbai gears up to host 2nd G20 disaster risk reduction ....",
    "G20 collaboration crucial to realize full potential of ....",
    "India’s G20 presidency offers opportunity for offshore ....",
    "Bank of Maharashtra raises ₹1,000 cr via QIP, LIC gets biggest allocation",
    "Tata Elxsi partners with ISRO to develop crew recovery models for Gaganyaan",
    "IDFC First Bank sever down? Users complain of mobile app, netbanking outage",
    "Gangster Sanjeev Jeeva, accused in BJP leader murder case, shot outside court",
    "Mother, injured son among 3 killed after ambulance set on fire in Manipur",
    "No non-competes signed, will open a US office: Peak XV's Shailendra Singh",
    "Sonalis Consumer Products IPO: Issue over subscribed on Day 1; check details",
    "Galaxy Unpacked 2023 event",
    "Patna-Ranchi Vande Bharat Express",
    "Adani Enterprises share price",
    "India can be an oasis of hope in a crisis-hit world",
    "As a startup employee, how should I invest for retirement?",
    "Steel ministry may go to FM for duty cover",
    "India, US commence strategic trade talks",
    "NEET UG result 2023 likely to be declared next week. Details here",
    "Don’t violate FDC ban, chemists warned",
    "Chinese FDI faces great wall in India as security fears rise",
    "Bulk deals on June 7: Suzlon Energy, others exchange hands; check buyers, seller",
    "Haze from wildfires pose risk of asthma, other health issues in US northeast",
    "JSW to foray into EV space, MG on list of possible acquisitions, says Sajjan Jindal"
]