[
    "PM Modi meets top CEOs from US and India as Washington visit concludes",
    "Byju's in talks with global investors who quit board to reconsider decision",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "UPI to account for 90% of retail digital transactions in next 5 yrs: RBI",
    "Not aware of subpoena to investors, says Adani Group amid US regulators probe",
    "Drone maker ideaForge raises ₹255 cr from anchor investors ahead of its IPO",
    "India's forex reserves rise by $2.35 billion to reach at $596 billion",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Opposition Meeting Highlights: Mallikarjun Kharge to chair next meet in Shimla",
    "Yes Bank to raise ₹25 billion in debt: Report",
    "Apple to launch its credit card in India",
    "PM Modi US visit Live: Prime Minister Modi's visit is truly historic, says Blair",
    "RBI withdrawal of ₹2,000 notes in circulation leads Spurs in Digital Payments",
    "Adani stocks, IndusInd, Tata Motors, Airtel, SBI among top gainers, losers today",
    "Nifty Bank down about a per cent in June; is the party over for bank stocks?",
    "Will US interest rate hike trigger FII selling in Indian markets?",
    "PM Modi's US visit: Empire State Building lights up in tri-colour | WATCH",
    "Govt introduces 2 changes as it amends Electricity Rules 2020",
    "Adani Enterprises share price",
    "Adani shares plunge on US probe news",
    "Horoscope Today: Money astrological predictions for 24 June 2023",
    "Behind the Musk-Zuckerberg ‘Cage Match’ Is a Yearslong Billionaire Feud",
    "Lagos Free Zone woos Indian manufacturers",
    "A Crypto Side Door: Buying a ‘Digital Residency’ in Palau for $248",
    "Children in cities losing height edge over rural kids",
    "U.S. Drones to Help India Track Chinese Troops on Disputed Border",
    "Byju's Crisis: GV Ravishankar, Russel Dreisenstock officially step down",
    "An IPO for a Painting? This $55 Million Masterpiece Is Going Public",
    "Exited Byju’s board, say Peak XV, Prosus, CZI"
]