[
    "Mutual Funds: Small-cap fund inflows at record high of ₹5,472 crore in June",
    "Stocks to buy this week: Experts suggest these eight technical picks",
    "SAT refuses to grant stay on order against Punit Goenka, Subash Chandra",
    "Does America need more unemployment?",
    "How China’s latest export curbs could hurt India",
    "Janet Yellen’s China visit comes with risks for India a ....",
    "Empty spaces: Why are so many offices vacant?",
    "Credit card dues at ₹2 trillion by April mark a milestone",
    "Maruti Suzuki likely to breach pre-covid sales peak in FY24",
    "Can M&M retain its SUV edge in the EV era?",
    "For technology firms, Q1 may be a quarter to forget",
    "No amicable settlement between SpiceJet and Maran: Sun Group",
    "Share Market LIVE: Sensex, Nifty turn green; RIL, Tata Steel jump; IT drags",
    "Hyundai Exter SUV launched in India at a starting price of ₹5,99,900!",
    "Bank of Baroda to PNB: These three banking stocks hit 52-week high",
    "Monsoon LIVE News: ‘Flood-like situation unlikely in Delhi, government prepared’",
    "Weather Alert: List of trains cancelled due to heavy rainfall. Details here",
    "Energy drink under scrutiny for containing caffeine of 6 Coke cans, 2 Red Bulls",
    "Elon Musk to take over Meta for a day if he wins a cage fight against Mark Zuckerberg?",
    "Rajya Sabha polls: TMC announces six new candidates",
    "West Bengal Panchayat Polls",
    "Hyundai Exter SUV launch live updates",
    "Adani Enterprises share price",
    "PM Modi to ink deal with France to acquire Rafale-M fighters, attack submarines",
    "Hyundai Exter launched in India at ₹5.99 lakh! Check design, features, more",
    "PE inflow in realty sector slips 5% to $1.9 billion in Apr-Jun: Report",
    "Monsoon Deluge: ‘Delhi systems are not designed…’ Arvind Kejriwal on heavy rains",
    "Oppo Reno 10, Oppo Reno 10 Pro and Oppo Reno 10 Pro+ debuts, price starts at ₹39,999",
    "Indian bond yields surge to over two-months high; check key reasons",
    "What next for Punit Goenka at Zee as SEBI ruling is upheld?"
]