[
    "RBI's guv Shaktikanta Das expects disinflation process to be slow in India",
    "Classified documents case: Trump pleads not guilty",
    "Cowin data breach: Assessing the risk of recurring attacks",
    "In charts: How easing costs lifted India Inc’s profits in Q4",
    "EU deforestation law may hit Indian exports worth $1.3 billion",
    "Despite low inflation print, RBI may hold firm on rate cuts",
    "Wet paint alert: Can Grasim Industries surprise Berger Paints?",
    "Why you should avoid filing tax returns before 15 June",
    "Our economic optimism needs a touch of realism",
    "Promoter’s professionalization dilemma: To be or not to be ‘pro’",
    "Adani Group in talks for first major debt refinancing of $3.8 billion: Report",
    "Accenture's AI practice to have 80,000 employees",
    "US consumer inflation cools for 11th straight month in May, rises just by 0.1%",
    "Go First flight cancellation extended till 16 June, full refund assured",
    "Cyclone Biparjoy: Location of impact, damages expected, preparations and more",
    "Study shows 2 of 3 Indians subjected to modern slavery. This is India's ranking",
    "Spotify fined $5.4 million for not informing users on data use",
    "Subhash Chandra, Punit Goenka move SAT against SEBI’s order: Report",
    "Rahul Gandhi's ‘truck trip' in US, coupled with Sidhu Moosewala songs | Watch",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "'Joe Biden is thrilled…': US NSA on PM Modi's state visit",
    "Explained: How the US Fed rate hike will impact the Indian stock market",
    "Managers beware! US-based company replaces bosses to keep ‘employees happy’",
    "CM Stalin slams 'Hindi imposition' by New India Assurance. Explained",
    "Market wrap: Sensex, Nifty end higher; mid, smallcaps hit all-time high",
    "HDFC Life Stock Live updates",
    "West Bengal Panchayat elections",
    "Women's Junior Hockey Asia Cup",
    "Adani Enterprises share price",
    "Maharashtra, Gujarat, TN top in goods shipments",
    "Horoscope Today: Money astrological predictions for 14 June 2023",
    "Power outages grip states amid scorching heat",
    "UP beats Maharashtra to be No. 1 in new equity investor sign-ups",
    "P-notes to make a return via Gift City",
    "Apple may shift over 18% of its iPhone production to India by March 2025: BofA"
]