[
    "IndiGo places world's largest aviation order, how it is different from Air India",
    "BYJU'S lays off more employees, nearly 1,000 affected across all departments",
    "Abrdn to sell entire 10.2% stake in HDFC AMC",
    "Return of investor confidence lights up new-age compani ....",
    "Investors suspect breaches at Mojocare, order forensic audit",
    "Why are the rich leaving India?",
    "Ashok Leyland has to swim against the tide",
    "Eating out: How to save money on your next dining experience",
    "Cough syrup linked to death of 12 kids in Cameroon likely made in India. Know mo",
    "‘Changed Lord Hanuman to angry bird...’: Bhupesh Baghel's swipe on Adipurush row",
    "₹2,000 note withdrawal to boost India’s GDP, says SBI Research",
    "Will Manipur be put under President's Rule? Know when it is imposed",
    "India to host G20 development ministers' meeting in Var ....",
    "Jaishankar to chair G20 development ministers’ meeting ....",
    "G20 Summit venue in Delhi not have helipad on its terrace",
    "G20 panel discusses bolstering global financial architecture",
    "Strengthen the global collaboration network on R&D: ....",
    "Put eco-centric industrialization on the G20’s agenda",
    "Global startup ecosystem gains momentum as G20 leaders ....",
    "Next G20 health meeting to focus on global health priorities",
    "G20 working group to discuss debt distress, global fina ....",
    "Advance, self-assessment tax data missing in prefilled income tax forms",
    "Tata Power eyes more state discom takeovers; plans to double capex in FY24",
    "US 'does not support' Taiwan's independence: Blinken tells Xi",
    "Great Indian Jugaad! Man climbs berths to reach toilet in packed train | Watch",
    "SEBI bars IIFL Securities from taking new clients for 2 years",
    "IndiGo buys 500 planes from Airbus, the largest order in aviation history",
    "MP govt razes houses of suspects after video of 'man-on-lease' goes viral",
    "PM Modi's US visit: Experts recommend these five defense stocks to buy today",
    "Warren Buffett's Berkshire Hathaway raises stake in 5 Japanese trading houses",
    "Adani Enterprises share price",
    "Meet the ₹12,000 cr home sales club",
    "Ashes 2023: Pietersen makes brutal assessment on England's pace attack",
    "HDFC to sell 90% in Credila to Baring EQT, ChrysCapital for ₹9,060 crore",
    "Global rankings that our officialdom never questions",
    "Companies must strive to retain productive women employees",
    "UFO spotted in Las Vegas or just a meteor?",
    "‘Pricing is key for adoption of generative AI by businesses’",
    "Our combat orientation has the world watching",
    "What is driving growth of GCCs, the offshore MNC units?",
    "Block deals to watchout on Tuesday: HDFC AMC, Timken likely to see large trade"
]