[
    "PM Modi's US visit sends ‘strong’ message to China in a subtle way",
    "US GDP data to Fed chair's speech: Top 5 triggers for stock market next week",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Two trains collided in West Bengal's Bankura",
    "Kejriwal urges Rahul to unite against Centre's Delhi ordinance",
    "Russia LIVE: US spy agencies uncover early signs of Russia revolt: Report",
    "Manipur violence remains on edge, NIA to probe blast case | Top updates",
    "Monsoon live updates: IMD forecasts heavy rainfall in Delhi",
    "Sunil Gavaskar slams selectors for not giving enough break to senior players",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "The Kerala Story can't find offers from any OTT platform",
    "How Belarus President's urgent call to Kremlin averts coup crisis in Russia?",
    "Opposition parties seek consensus for 2024 alliance, Congress-AAP deal unlikely",
    "IPOs next week: ideaForge Tech, Cyient DLM, PKH Ventures, other. Check details",
    "IMD issues very heavy rainfall warning in these states for next three days",
    "Heatwave in China: Beijing sees record temperatures for third day",
    "Why PM Modi's visit to 11th century Al-Hakim Mosque in Egypt is significant?",
    "Why Yes Bank shares will be in focus next week — explained",
    "Adani Enterprises share price",
    "As monsoon knocks the doors, can it revive demand for consumer durables?",
    "Ram Charan’s wife Upasana shares photo with newborn: ‘‘Overwhelmed…’",
    "PM Modi's Egypt visit: A look at India-Egypt ties, relevance in current scenario",
    "Bihar: Ammonia gas leak kills one and thirty injured in Hajipur",
    "Trump says US government has 'vital role' opposing abortion, won't say if he backs national ban"
]