[
    "Why Yes Bank shares will be in focus next week — explained",
    "Russian soldiers in Voronezh surrender to Wagner PMC. Russia-Ukraine LIVE",
    "Mint Explainer: When will we stop exploiting domestic workers?",
    "Blocking the Microsoft-Activision deal would harm consumers",
    "Monsoon update: Impact of uneven rainfall on planting activity",
    "America’s chance to become a clean-energy superpower",
    "Data recap: Yoga Day, IndiGo, Nilekani's gift to IIT-B, and more",
    "Brewing inclusivity: Women take charge of India's alco- ....",
    "Britannia eyes 50-50 biscuit plan",
    "The night the nickel market broke",
    "NRIs: Here’s what you need to know when writing a will",
    "Russian President Putin calls Wagner Group ‘traitor’ in televised address",
    "Gold rates today at three month low on strong dollar, US Fed rate hike buzz",
    "PM Modi thanks Biden for accepting proposal for adding ....",
    "AI holds great potential in learning, skilling: Modi at ....",
    "The G20 can build a global bridge to a future of sustai ....",
    "G20 group proposes projects to boost PPPs",
    "G20 SFWG recommends projects to develop PPPs, best prac ....",
    "G20 panel on bolstering multilateral banks to ready fir ....",
    "Mandaviya to inaugurate G20 co-branded event on health ....",
    "India proposes giving African Union full membership of G20",
    "Mumbai rains: IMD issues yellow alert; heavy rains predicted in next 4-5 days",
    "Wagner chief mutiny against Russia: ‘Knife in the back of people’, says Putin",
    "Maruti Suzuki eVX electric vehicle spied testing. Here's what to expect",
    "PM Modi's US visit LIVE: PM Modi concludes US State visit, emplanes for Egypt",
    "Amazon commits $15 bn investment in India during meeting with PM Narendra Modi",
    "What is Pink WhatsApp scam? How to protect yourself if already downloaded",
    "Two main board IPOs worth ₹1159 crore to open next week. GMP, other details",
    "DA Hike: Madhya Pradesh announces 4% hike in dearness allowance (DA)",
    "Gear up for some exciting OTT releases this week",
    "Diljit Dosanjh reacts on Anthony Blinken's shoutout at lunch hosted for PM Modi",
    "Kedarnath Temple ‘gold scam’: UK govt. forms high-level panel to investigate",
    "AI friend in cockpit case: ‘Our industry operates with…’ CEO Campbell Wilson",
    "Adani Enterprises share price",
    "PAN Aadhaar linking: Penalty amount; how to pay to link the two documents",
    "Putin vows to crush 'armed mutiny' after Wagner chief tries to oust top brass",
    "Adipurush row: Cine worker's body writes to Amit Shah for case against director",
    "Wagner army moves toward Moscow, Putin says ‘situation difficult’ in Rostov",
    "Russian President Vladimir Putin calls for ‘unity’, says ‘will not allow..’",
    "Hyundai India begins production of SUV Exter in Tamil Nadu manufacturing unit",
    "The Tearful Executive Who Tapped the Brakes on Electric Cars at Toyota"
]