[
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Microsoft US5949181045, MSFT:US",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18272.70\n\n+203.70 (+1.13%)",
    "Sensex\n\n61802.87\n\n+748.58 (+1.23%)",
    "India coal imports surge to 162 MT in FY23; coking coal reaches 54 MT",
    "'Fundamentally Wrong' | Jaishankar Slams World Press Freedom Index",
    "Supreme Court to hear on Monday pleas on Manipur violence",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Sensex zooms 700 points, Nifty shoots past 18,250: What's driving the rally?",
    "F&O Manual | Bulls drive market rebound, but bears on the prowl; finance stocks in focus",
    "Market LIVE Updates: Indices gain over 1%; Tata Motors, IndusInd Bank, Bajaj Finance surge 4%",
    "Living In One Of The Biggest 2 BHK In Mumbai | The Tenant",
    "Coronation Ceremony Of King Charles | Watch King Charles Coronation At Westminster Abbey",
    "Weekend Guide: What To Watch, Read, Listen & More!",
    "Jaishankar Talks Tough On 'Cross-Border Terror' In Front Of Pakistan's Bilawal Bhutto At SCO Meet",
    "Karnataka Elections: Who will become the chief minister? Here are the top contenders",
    "What’s Happening In Manipur? | ‘Shoot-at-sight’ Ordered In ‘Extreme Cases’",
    "Behind The Go First Fiasco: Why Did India’s 5th Largest Airline Have To File For Bankruptcy?",
    "Canara Bank, Adani Port gain entry into Kotak's largecap portfolio",
    "IndusInd Bank up 5%, recovers after brokerages reaffirm faith",
    "Zomato pilots B2B logistics service as part of its bid to speed up revenue growth",
    "Hero MotoCorp Q4 FY23: Decent set of numbers; new products key growth drivers",
    "General Atlantic to deploy up to $1 billion a year in India",
    "China’s high turnover stock market is punishing liquidity trades",
    "JSW Group exploring a potential stake sale in JSW Paints",
    "IT stocks firm up on ‘Maximum Pessimism’ list after weak Q4 show; Adani shines on optimism",
    "Bank credit picks up momentum. But where is the money going?",
    "India coal imports surge to 162 MT in FY23; coking coal reaches 54 MT",
    "'Fundamentally Wrong' | Jaishankar Slams World Press Freedom Index",
    "Supreme Court to hear on Monday pleas on Manipur violence",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Sensex zooms 700 points, Nifty shoots past 18,250: What's driving the rally?",
    "Canara Bank, Adani Port gain entry into Kotak's largecap portfolio",
    "IndusInd Bank up 5%, recovers after brokerages reaffirm faith",
    "General Atlantic to deploy up to $1 billion a year in India",
    "IT stocks firm up on ‘Maximum Pessimism’ list after weak Q4 show; Adani shines on optimism",
    "Bank credit picks up momentum. But where is the money going?",
    "From Ratan Tata to Elon Musk, user creates images of billionaires working out using AI",
    "Cyclone Mocha: Intense rain, rough sea warning for parts of east India",
    "Karnataka Election 2023 LIVE Updates: Rahul Gandhi takes a bus ride in Bengaluru",
    "When Kishore Biyani learnt Big Bazaar crowd management from Tirupati temple",
    "Brutal heat continues to grip Asia in warning for rest of world",
    "News Live: India's Go Airlines asks tribunal to urgently pass order on insolvency plea",
    "'Don't believe Nykaa is a good representation of India e-commerce': Meesho co-founder",
    "Binance pauses bitcoin withdrawals, citing large volumes",
    "Go First seeks urgent order from NCLT as lessors move to repossess aircraft",
    "Singapore’s soaring rents are becoming a political problem",
    "Woman with constant burping issue diagnosed with Stage 3 cancer",
    "MG Comet EV first drive, review - Urban mobility solved?",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "From Ratan Tata to Elon Musk, user creates images of billionaires working out using AI",
    "Cyclone Mocha: Intense rain, rough sea warning for parts of east India",
    "Karnataka Election 2023 LIVE Updates: Rahul Gandhi takes a bus ride in Bengaluru",
    "When Kishore Biyani learnt Big Bazaar crowd management from Tirupati temple",
    "Brutal heat continues to grip Asia in warning for rest of world",
    "News Live: India's Go Airlines asks tribunal to urgently pass order on insolvency plea",
    "'Don't believe Nykaa is a good representation of India e-commerce': Meesho co-founder",
    "Binance pauses bitcoin withdrawals, citing large volumes",
    "Go First seeks urgent order from NCLT as lessors move to repossess aircraft",
    "Singapore’s soaring rents are becoming a political problem",
    "Woman with constant burping issue diagnosed with Stage 3 cancer",
    "Man goes bungee jumping to celebrate divorce, falls 70 feet after rope snaps",
    "This company threw a lavish party with branded drinks – then laid off 13 percent of its workforce",
    "'Renting can make you wealthier than owning a home': Indian-origin millionaire Ramit Sethi",
    "Only in Bengaluru: Techie realises his neighbour is the founder of Rapido. Then…",
    "DRDO Scientist Arrested For Sharing Secrets With Pak ISI | Case Of Suspected Honey-Trap",
    "Immigration Central: Canada to deport 700 Indian students due to fake admission letters",
    "Russia says it has billions of Indian rupees that it can't use",
    "Market LIVE Updates: Indices gain over 1%; Tata Motors, IndusInd Bank, Bajaj Finance surge 4%",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "Tech Mahindra Q4 earnings miss expectations, Street keeps a cautious stance",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Kerala tourist boat capsizes, at least 22 dead",
    "Tata IPL 2023: Hyderabad wins after no-ball drama; Gujarat in control",
    "Woman with constant burping issue diagnosed with Stage 3 cancer",
    "Bengaluru entrepreneur's response to scammer offering job on WhatsApp is viral",
    "Billionaire signs up to be frozen after death to be revived in the future",
    "From Ratan Tata to Elon Musk: AI images of billionaires working out",
    "Rahul Gandhi meets Zomato, Swiggy delivery agents in Bengaluru over Masala Dosa, coffee. Watch",
    "Advance / Decline (NSE) \n\n1280765",
    "Canara bank reports outstanding results - dividend hiked from rs 6.5 t...",
    "You are right , the har gully electric campaign is really good and sho...",
    "Dear arvind ji. is it good time to enter marico and itc",
    "Canara bank reports outstanding results - dividend hiked from rs 6.5 t...",
    "You are right , the har gully electric campaign is really good and sho...",
    "Dear arvind ji. is it good time to enter marico and itc",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Qualcomm to acquire Israeli auto-chip maker Autotalks",
    "China’s high turnover stock market is punishing liquidity trades",
    "Brutal heat continues to grip Asia in warning for rest of world",
    "Go First seeks urgent order from NCLT as lessors move to repossess aircraft",
    "K P Energy commissions 29 MW wind energy project in Gujarat",
    "India coal imports surge to 162 MT in FY23; inbound coking coal shipment grows to 54 MT",
    "When calendar overrules the mind",
    "FM Sitharaman to review state of the economy at FSDC meeting today",
    "Will meet Nitish Kumar during his Mumbai visit: Sharad Pawar",
    "Excise policy case desperate attempt by BJP to malign AAP: Arvind Kejriwal",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Protean_eGOV_Technologies_Limited_addendum_II_to_the_DRHP",
    "Vishnu Prakash R Punglia Ltd.",
    "Will performance-linked fees help mutual fund investors?",
    "54% of new mutual fund investors are millennials",
    "Performance-based fee for mutual funds: What stakeholders say",
    "Performance based fee is the least SEBI can do to ensure better returns by mutual funds",
    "How do MNC mutual funds work?",
    "Sebi likely to come up with performance-linked incentive scheme for mutual funds",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "Weekly Tactical Pick – Why this insurer can turn out to be a star performer",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Will performance-linked fees help mutual fund investors?",
    "Roaring multi-asset mutual funds bet on these midcap stocks. Do you own any?",
    "How do MNC mutual funds work?",
    "WhiteOak Capital MF launches Multi-Asset Allocation Fund. Should you invest?",
    "How does MC30 measure risk in a mutual fund?",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "How to use I-T department’s Excel utilities to file returns",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Will setting up a high-rise committee help Delhi-NCR tackle structural safety issues?",
    "MC weekend guide: Are New York-style loft apartments the future of Mumbai real estate market?",
    "Nexus Select Trust may look at acquiring retail properties in 30 metros and Tier 2 cities",
    "CREDAI NCR wants state development authorities to be brought under RERA as 'promoters'",
    "Zapkey secures fresh funding from DSP and existing investors",
    "Nisus Finance invests Rs 24.5 crore in delayed Greater Noida project",
    "Real estate sentiment score dips to 57 in Q1 CY23 on global slowdown fears: Report",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Indian gold prices hit record high, dampen demand: Dealers",
    "India needs an urgent push to secure its copper resources",
    "Gold or fixed income: Which is better to help diversify your portfolio?",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Trade Spotlight | What's your game plan for Hitachi Energy, Engineers India, TVS Motor today?",
    "Hot Stocks | Here's why you should bet on NOCIL, Hitachi Energy India for short term",
    "Hot Stocks | Bet on Aditya Birla Capital, ABB India, Bharat Electronics for double-digit returns",
    "General Insurance Corporation tops Nifty500, up 18%",
    "Daily Voice | Green Portfolio's Divam Sharma expects a Fed pivot starting September",
    "Daily Voice | Union AMC CEO bullish on Indian equities, is overweight on these 4 sectors",
    "PAI04|Pudumjee Ind|22.95|-0.45|-1.960784",
    "MI44|UNO Minda|522.00|16.30|3.122605",
    "JSW Ispat Special Products",
    "MI16|JSW Ispat Speci|33.15|-0.10|-0.301659",
    "JKB|JK Bank|56.65|-0.55|-0.970874",
    "Privi Speciality Chemicals",
    "HKA|Privi Special|1119.00|34.05|3.042895",
    "HSE|HDFCSILVER|75.41|-0.55|-0.729346",
    "AT|Apollo Tyres|373.30|4.40|1.178677",
    "Set SMS alerts for market news",
    "RBI directions on outsourcing IT services fills a regulatory lacuna in tech-related issues",
    "Why Warren Buffett prefers cash",
    "Chart of the Day: Global food inflation rises, but India has little to worry",
    "First Republic Bank, its board members and KPMG hung around each other for too long",
    "Agri Picks Report May 08,2023: Geojit",
    "Market LIVE Updates: Indices gain over 1%; Tata Motors, IndusInd Bank, Bajaj Finance surge 4%",
    "IndusInd Bank up 5%, recovers after brokerages reaffirm faith",
    "Sensex up 659 points, Nifty climbs 183: What's driving the rally",
    "JSW Energy gains 5% on power purchase deal with Solar Energy Corp",
    "Agri Picks Report May 08,2023: Geojit",
    "Oil prices creep higher as recession fears begin to fade",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Start-up Street: ‘Boring’ businesses can turn into successful start-ups",
    "SaaS firm Pando raises $30 million in Series B",
    "ZestIoT raises $6.5 million in Series A round led by IvyCap Ventures",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Gamifying Pedagogy | Unusual Suspects",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Download from Windows Phone",
    "Top Articles from Financial Times"
]