[
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Adani Power INE814H01011, ADANIPOWER, 533096",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Adani Power INE814H01011, ADANIPOWER, 533096",
    "Microsoft US5949181045, MSFT:US",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18193.05\n\n+124.05 (+0.69%)",
    "Sensex\n\n61509.27\n\n+454.98 (+0.75%)",
    "Alibaba logistics arm eyes up to $2 billion Hong Kong IPO",
    "Supreme Court to hear on Monday pleas on Manipur violence",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Covid-19 no longer a global health emergency: WHO",
    "Britannia gains on a robust Q4 but brokerages cautious on valuation, volumes",
    "Britannia gains on a robust Q4 but brokerages cautious on valuation, volumes",
    "Market LIVE Updates: Sensex adds 400 pts, Nifty above 18,150; IndusInd Bank surges 4%",
    "What's your game plan for Hitachi Energy, Engineers India, TVS Motor today?",
    "Here's why you should bet on NOCIL, Hitachi Energy India for short term",
    "Living In One Of The Biggest 2 BHK In Mumbai | The Tenant",
    "Coronation Ceremony Of King Charles | Watch King Charles Coronation At Westminster Abbey",
    "Weekend Guide: What To Watch, Read, Listen & More!",
    "Jaishankar Talks Tough On 'Cross-Border Terror' In Front Of Pakistan's Bilawal Bhutto At SCO Meet",
    "Karnataka Elections: Who will become the chief minister? Here are the top contenders",
    "What’s Happening In Manipur? | ‘Shoot-at-sight’ Ordered In ‘Extreme Cases’",
    "Behind The Go First Fiasco: Why Did India’s 5th Largest Airline Have To File For Bankruptcy?",
    "Buzzing Stocks: Britannia, Marico, Lupin, Coal India, banks, others in focus",
    "Brokerages see limited growth for core business of Bharat Forge",
    "Paytm posts 52% surge in Q4 revenue, narrows down losses to Rs 168 crore",
    "Coal India net profit declines 18% on higher provisions, misses estimates",
    "Grounded Go Air can fly in a week if planes not seized, CEO says",
    "Best of India bond rally may be over with sales deluge coming",
    "OPEC share in crude import pie shrinks to record low as Russian supplies peak",
    "Chola the new Raja among NBFCs? IEX rebound, HNIs’ Dubai option, broking wars, and gold",
    "A sour infra bet turns the tide, API play chases top dollars, bank versus union & more",
    "Alibaba logistics arm eyes up to $2 billion Hong Kong IPO",
    "Supreme Court to hear on Monday pleas on Manipur violence",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Covid-19 no longer a global health emergency: WHO",
    "Britannia gains on a robust Q4 but brokerages cautious on valuation, volumes",
    "Market LIVE Updates: Sensex adds 400 pts, Nifty above 18,150; IndusInd Bank surges 4%",
    "Buzzing Stocks: Britannia, Marico, Lupin, Coal India, banks, others in focus",
    "Brokerages see limited growth for core business of Bharat Forge",
    "Grounded Go Air can fly in a week if planes not seized, CEO says",
    "Chola the new Raja among NBFCs? IEX rebound, HNIs’ Dubai option, broking wars, and gold",
    "A sour infra bet turns the tide, API play chases top dollars, bank versus union & more",
    "Karnataka Election 2023 LIVE Updates: Campaigning for assembly polls to end today",
    "Rahul Gandhi meets Zomato, Swiggy delivery agents in Bengaluru over Masala Dosa, coffee. Watch",
    "Singapore’s soaring rents are becoming a political problem",
    "Binance pauses bitcoin withdrawals, citing large volumes",
    "Defence Minister Rajnath Singh to inaugurate IAF Heritage Centre in Chandigarh",
    "Cyclone Mocha to make landfall in West Bengal, Odisha this week",
    "Donald Trump will not testify in New York rape, defamation trial",
    "Siemens, SAP say EU draft Data Act puts trade secrets at risk",
    "At least five wounded due to Russian strikes on Kyiv, city officials say",
    "Janet Yellen warns of 'constitutional crisis' if Congress fails to act on debt",
    "US NSA Jake Sullivan meets Ajit Doval in Saudi Arabia, both to meet again in Australia this month",
    "MG Comet EV first drive, review - Urban mobility solved?",
    "Newsletter with commodity research advice and market analysis",
    "Karnataka Election 2023 LIVE Updates: Campaigning for assembly polls to end today",
    "Rahul Gandhi meets Zomato, Swiggy delivery agents in Bengaluru over Masala Dosa, coffee. Watch",
    "Singapore’s soaring rents are becoming a political problem",
    "Binance pauses bitcoin withdrawals, citing large volumes",
    "Defence Minister Rajnath Singh to inaugurate IAF Heritage Centre in Chandigarh",
    "Cyclone Mocha to make landfall in West Bengal, Odisha this week",
    "Donald Trump will not testify in New York rape, defamation trial",
    "Siemens, SAP say EU draft Data Act puts trade secrets at risk",
    "At least five wounded due to Russian strikes on Kyiv, city officials say",
    "Janet Yellen warns of 'constitutional crisis' if Congress fails to act on debt",
    "US NSA Jake Sullivan meets Ajit Doval in Saudi Arabia, both to meet again in Australia this month",
    "Man goes bungee jumping to celebrate divorce, falls 70 feet after rope snaps",
    "'Renting can make you wealthier than owning a home': Indian-origin millionaire Ramit Sethi",
    "Only in Bengaluru: Techie realises his neighbour is the founder of Rapido. Then…",
    "This company threw a lavish party with branded drinks – then laid off 13 percent of its workforce",
    "DRDO Scientist Arrested For Sharing Secrets With Pak ISI | Case Of Suspected Honey-Trap",
    "Russia says it has billions of Indian rupees that it can't use",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "Immigration Central: Canada to deport 700 Indian students due to fake admission letters",
    "Rahul Gandhi meets Zomato, Swiggy delivery agents in Bengaluru over Masala Dosa, coffee. Watch",
    "Nitish Rana's wife 'stalked and chased' by men in Delhi, accused arrested",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Coronation of the longest-serving British heir apparent, King Charles III",
    "King Charles III is officially ascending throne; a look at other King Charles who reigned before",
    "Watch: Mamata Banerjee walks on treadmill holding pet dog: 'Extra motivation'",
    "Rahul Gandhi rides pillion on Blinkit delivery man's scooter in Bengaluru. Watch",
    "Anand Mahindra to King Charles: 'You will be remembered for more than your crown'",
    "'Renting can make you wealthier than owning a home': Indian-origin millionaire Ramit Sethi",
    "Ashneer Grover wants Mumbai's Worli Sea link lights to stay on all night: 'It's such a beauty'",
    "Advance / Decline (NSE) \n\n1456440",
    "Picture abhi baaki hai mere dost :)",
    "Strict trade sl 1358 tgt 1520",
    "Wow what a move ....jio finance no chance to move like this ...impossi...",
    "Picture abhi baaki hai mere dost :)",
    "Strict trade sl 1358 tgt 1520",
    "Wow what a move ....jio finance no chance to move like this ...impossi...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Alibaba logistics arm eyes up to $2 billion Hong Kong IPO",
    "Singapore’s soaring rents are becoming a political problem",
    "Battle for China's electric SUV market heats up at home and abroad",
    "Paytm focused on reaching financial milestone 'in near future,' CEO Vijay Shekhar Sharma says",
    "Grounded Go Air can fly in a week if planes not seized, CEO says",
    "Why airlines keep folding in India’s booming aviation market",
    "When calendar overrules the mind",
    "FM Sitharaman to review state of the economy at FSDC meeting today",
    "OPEC share in India's crude import basket shrinks to record low as Russian supplies peak",
    "Manipur ethnic strife over jobs hurts job creation",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Protean_eGOV_Technologies_Limited_addendum_II_to_the_DRHP",
    "Vishnu Prakash R Punglia Ltd.",
    "Will performance-linked fees help mutual fund investors?",
    "54% of new mutual fund investors are millennials",
    "Performance-based fee for mutual funds: What stakeholders say",
    "Performance based fee is the least SEBI can do to ensure better returns by mutual funds",
    "How do MNC mutual funds work?",
    "Sebi likely to come up with performance-linked incentive scheme for mutual funds",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "Weekly Tactical Pick – Why this insurer can turn out to be a star performer",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Will performance-linked fees help mutual fund investors?",
    "Roaring multi-asset mutual funds bet on these midcap stocks. Do you own any?",
    "How do MNC mutual funds work?",
    "WhiteOak Capital MF launches Multi-Asset Allocation Fund. Should you invest?",
    "How does MC30 measure risk in a mutual fund?",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "How to use I-T department’s Excel utilities to file returns",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Will setting up a high-rise committee help Delhi-NCR tackle structural safety issues?",
    "MC weekend guide: Are New York-style loft apartments the future of Mumbai real estate market?",
    "Nexus Select Trust may look at acquiring retail properties in 30 metros and Tier 2 cities",
    "CREDAI NCR wants state development authorities to be brought under RERA as 'promoters'",
    "Zapkey secures fresh funding from DSP and existing investors",
    "Nisus Finance invests Rs 24.5 crore in delayed Greater Noida project",
    "Real estate sentiment score dips to 57 in Q1 CY23 on global slowdown fears: Report",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Indian gold prices hit record high, dampen demand: Dealers",
    "India needs an urgent push to secure its copper resources",
    "Gold or fixed income: Which is better to help diversify your portfolio?",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Trade Spotlight | What's your game plan for Hitachi Energy, Engineers India, TVS Motor today?",
    "Hot Stocks | Here's why you should bet on NOCIL, Hitachi Energy India for short term",
    "Hot Stocks | Bet on Aditya Birla Capital, ABB India, Bharat Electronics for double-digit returns",
    "General Insurance Corporation tops Nifty500, up 18%",
    "Daily Voice | Green Portfolio's Divam Sharma expects a Fed pivot starting September",
    "Daily Voice | Union AMC CEO bullish on Indian equities, is overweight on these 4 sectors",
    "SOC01|Seya Industries|20.90|0.40|1.913876",
    "KW|Kritika Wires|12.75|1.15|9.019608",
    "I11|3i Infotech|33.15|-2.80|-8.446456",
    "TPS|TD Power System|174.70|-5.35|-3.062393",
    "Rex Pipes & Cables Industries",
    "RPC02|Rex Pipes|42.30|-1.50|-3.546099",
    "SE01|Salzer Electro|313.25|9.60|3.064645",
    "Shree Digvijay Cement Company",
    "SDC|Shree Digvijay|76.85|2.40|3.122967",
    "Set SMS alerts for market news",
    "When calendar overrules the mind",
    "Manipur ethnic strife over jobs hurts job creation",
    "Market LIVE Updates: Sensex adds 400 pts, Nifty above 18,150; IndusInd Bank surges 4%",
    "Oil prices creep higher as recession fears begin to fade",
    "Brokerages see limited growth for core business of Bharat Forge",
    "Britannia gains on a robust Q4 but brokerages cautious on valuation, volumes",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Oil prices creep higher as recession fears begin to fade",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Oil set for worst run this year as recession fears rattle market",
    "Start-up Street: ‘Boring’ businesses can turn into successful start-ups",
    "SaaS firm Pando raises $30 million in Series B",
    "ZestIoT raises $6.5 million in Series A round led by IvyCap Ventures",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Gamifying Pedagogy | Unusual Suspects",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Download from Windows Phone",
    "Top Articles from Financial Times"
]