[
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Adani Power INE814H01011, ADANIPOWER, 533096",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Adani Power INE814H01011, ADANIPOWER, 533096",
    "Microsoft US5949181045, MSFT:US",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18069.00\n\n-186.80 (-1.02%)",
    "Sensex\n\n61054.29\n\n-694.96 (-1.13%)",
    "Warren Buffett says Berkshire is cautious on banking sector",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Covid-19 no longer a global health emergency: WHO",
    "28% excess rainfall in India in pre-monsoon season so far",
    "India's imports from OPEC at all-time low as Russian oil buy peaks'",
    "India's imports from OPEC at all-time low as Russian oil buy peaks'",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Buffett says Apple is a better business than any other in Berkshire's portfolio",
    "Dalal Street Week Ahead: 10 key factors that will keep traders busy",
    "Living In One Of The Biggest 2 BHK In Mumbai | The Tenant",
    "Coronation Ceremony Of King Charles | Watch King Charles Coronation At Westminster Abbey",
    "Weekend Guide: What To Watch, Read, Listen & More!",
    "Jaishankar Talks Tough On 'Cross-Border Terror' In Front Of Pakistan's Bilawal Bhutto At SCO Meet",
    "Karnataka Elections: Who will become the chief minister? Here are the top contenders",
    "What’s Happening In Manipur? | ‘Shoot-at-sight’ Ordered In ‘Extreme Cases’",
    "Behind The Go First Fiasco: Why Did India’s 5th Largest Airline Have To File For Bankruptcy?",
    "Immigration Central | Malta’s Startup Residence Scheme to welcome third-country entrepreneurs",
    "AIR film review: Matt Damon is everything from intense, funny, to vulnerable and desolate",
    "Mumbai’s newest gallery, Akara Contemporary, will host gen-next artists",
    "PM Modi holds massive road show for 2nd day in Bengaluru amid fanfare",
    "Will a high-rise committee help Delhi-NCR tackle structural safety issues?",
    "Warren Buffett faults handling of bank failures, upbeat on U.S., Berkshire",
    "Are New York-style loft apartments the future of Mumbai real estate market?",
    "IT sector recovery likely from FY25, says Pankaj Pandey of ICICI Securities",
    "Warren Buffett says Berkshire is cautious on banking sector",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "NCLT to hear two insolvency petitions filed against Go First on May 8",
    "Covid-19 no longer a global health emergency: WHO",
    "28% excess rainfall in India in pre-monsoon season so far",
    "India's imports from OPEC at all-time low as Russian oil buy peaks'",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Immigration Central | Malta’s Startup Residence Scheme to welcome third-country entrepreneurs",
    "AIR film review: Matt Damon is everything from intense, funny, to vulnerable and desolate",
    "PM Modi holds massive road show for 2nd day in Bengaluru amid fanfare",
    "Are New York-style loft apartments the future of Mumbai real estate market?",
    "IT sector recovery likely from FY25, says Pankaj Pandey of ICICI Securities",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Warren Buffett says Berkshire is cautious on the banking sector",
    "Go First lessors may not get possession of aircraft if IBC kicks in",
    "Amara Raja lays foundation stone for Rs 9,500 crore Lithium Cell facility in Telangana",
    "King Charles III: The monarch with a multi-faith outlook, great love for India",
    "Was going all in on P&W engines the mistake Go First made?",
    "Warren Buffett predicts earnings decline across Berkshire units",
    "Warren Buffett's Berkshire Hathaway posts $35.5 billion profit in Q1",
    "2,380 fresh Covid cases in India, active cases drop to 27,212",
    "Union Bank of India reports 93% rise in Q4 net profit",
    "At least 9 people killed by gunman at Texas mall; shooter killed by police",
    "MG Comet EV first drive, review - Urban mobility solved?",
    "Newsletter with commodity research advice and market analysis",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Warren Buffett says Berkshire is cautious on the banking sector",
    "Go First lessors may not get possession of aircraft if IBC kicks in",
    "Amara Raja lays foundation stone for Rs 9,500 crore Lithium Cell facility in Telangana",
    "King Charles III: The monarch with a multi-faith outlook, great love for India",
    "Was going all in on P&W engines the mistake Go First made?",
    "Warren Buffett predicts earnings decline across Berkshire units",
    "Warren Buffett's Berkshire Hathaway posts $35.5 billion profit in Q1",
    "2,380 fresh Covid cases in India, active cases drop to 27,212",
    "Union Bank of India reports 93% rise in Q4 net profit",
    "At least 9 people killed by gunman at Texas mall; shooter killed by police",
    "Only in Bengaluru: Techie realises his neighbour is the founder of Rapido. Then…",
    "Russia says it has billions of Indian rupees that it can't use",
    "2 women ‘forced to change’ at US airport gate by American Airlines staff. They were wearing…",
    "Man goes bungee jumping to celebrate divorce, falls 70 feet after rope snaps",
    "This company threw a lavish party with branded drinks – then laid off 13 percent of its workforce",
    "Tech Mahindra Q4 earnings miss expectations, Street keeps a cautious stance",
    "Itasha, the 'cringeworthy' cartoon cars of Japan, are making an image U-turn",
    "DRDO Scientist Arrested For Sharing Secrets With Pak ISI | Case Of Suspected Honey-Trap",
    "Dentsu COO earns Rs 1.5 crore annually, lives in a rented Mumbai apartment",
    "Bengaluru techie loses Rs 1.6 lakh while searching for house on rent in city",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Coronation of the longest-serving British heir apparent, King Charles III",
    "King Charles III is officially ascending throne; a look at other King Charles who reigned before",
    "King Charles's coronation: Agitated horse runs into crowd during parade. Viral video",
    "Man goes bungee jumping to celebrate divorce, falls 70 feet after rope snaps",
    "Air India passenger bitten by scorpion onboard. What airline said",
    "Soon you can book railway tickets for your pets online. Here's how",
    "Man arrested for opening store selling cocaine, heroin and meth",
    "Advance / Decline (NSE) \n\n7001336",
    "As a future consumer ltd investor.. buy and recommend this company pro...",
    "Yes bro by next week it will go to 2450",
    "Pathetic results 10% lower circuit tomorrow top line botton line every...",
    "As a future consumer ltd investor.. buy and recommend this company pro...",
    "Yes bro by next week it will go to 2450",
    "Pathetic results 10% lower circuit tomorrow top line botton line every...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty reclaims 18,000 mark",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Latest news today: Rescue operations in full swing in violence-hit Manipur",
    "Dow has best day since January 6 after Apple rally, jobs data",
    "TPG-backed RR Kabel files IPO papers with Sebi",
    "India's imports from OPEC at all-time low as Russian oil buy peaks'",
    "Sun Pharma recalls over 24,000 prefilled syringes of generic medication in the US",
    "India's imports from OPEC at all-time low as Russian oil buy peaks'",
    "Fuel prices on May 7: Petrol and diesel prices remain unchanged across major cities",
    "Wadias’ Go First manoeuvre should set the tone for IBC use",
    "Delhi Police tightens security as farmers head to Jantar Mantar to support protesting wrestlers",
    "EC should ban PM Modi from campaigning in Karnataka: Rajasthan CM Gehlot",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Protean_eGOV_Technologies_Limited_addendum_II_to_the_DRHP",
    "Vishnu Prakash R Punglia Ltd.",
    "54% of new mutual fund investors are millennials",
    "Performance-based fee for mutual funds: What stakeholders say",
    "Performance based fee is the least SEBI can do to ensure better returns by mutual funds",
    "How do MNC mutual funds work?",
    "Sebi likely to come up with performance-linked incentive scheme for mutual funds",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "WhiteOak Capital MF launches Multi-Asset Allocation Fund. Should you invest?",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "Weekly Tactical Pick – Why this insurer can turn out to be a star performer",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How do MNC mutual funds work?",
    "WhiteOak Capital MF launches Multi-Asset Allocation Fund. Should you invest?",
    "How does MC30 measure risk in a mutual fund?",
    "Why are long-duration funds becoming popular?",
    "Gold or fixed income: Which is better to help diversify your portfolio?",
    "SIPs work for debt funds, too. And, they beat bank FDs. Here’s the proof",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "How to use I-T department’s Excel utilities to file returns",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Will setting up a high-rise committee help Delhi-NCR tackle structural safety issues?",
    "MC weekend guide: Are New York-style loft apartments the future of Mumbai real estate market?",
    "Nexus Select Trust may look at acquiring retail properties in 30 metros and Tier 2 cities",
    "CREDAI NCR wants state development authorities to be brought under RERA as 'promoters'",
    "Zapkey secures fresh funding from DSP and existing investors",
    "Nisus Finance invests Rs 24.5 crore in delayed Greater Noida project",
    "Real estate sentiment score dips to 57 in Q1 CY23 on global slowdown fears: Report",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Indian gold prices hit record high, dampen demand: Dealers",
    "India needs an urgent push to secure its copper resources",
    "Gold or fixed income: Which is better to help diversify your portfolio?",
    "Zimbabwe plans to launch digital currency backed by gold",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Hot Stocks | Bet on Aditya Birla Capital, ABB India, Bharat Electronics for double-digit returns",
    "General Insurance Corporation tops Nifty500, up 18%",
    "Trade Spotlight | Your strategy for trading in Engineers India, Rail Vikas Nigam, Ceat today",
    "Trade Spotlight | How to trade in MTAR Tech, Devyani International, Carborundum Universal today",
    "Daily Voice | Green Portfolio's Divam Sharma expects a Fed pivot starting September",
    "Daily Voice | Union AMC CEO bullish on Indian equities, is overweight on these 4 sectors",
    "Daily Voice | This CIO sees higher probability of a Fed pause as bank stress mounts",
    "Neutral TVS Motor Company; target of Rs 1060: Motilal Oswal",
    "Neutral Tata Chemical; target of Rs 1110: Motilal Oswal",
    "Swastik Pipe closes below 30-Day Moving Average of 79.01 today.",
    "Manaksia Steels closes below  its 50-Day,150-Day,200-Day Moving Average today.",
    "Jet Airways closes below 30-Day Moving Average of 61.07 today.",
    "Ponni Sugars(E) closes below 30-Day Moving Average of 443.76 today.",
    "Tata Chemicals closes below 30-Day,50-Day Moving Average today.",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Weekender: US Imperial Preference or Chinese Co-Prosperity Sphere?",
    "The Reading List: May 5, 2023",
    "Dedollarisation efforts will make only a small dent in the greenback’s dominance",
    "AI is helping us read minds, but should we?",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Trade setup for Monday: Top 15 things to know before the opening bell",
    "Momentum takes break but these 3 stocks to return upto 9% in short-term",
    "Buy Dabur India; target of Rs 605: Sharekhan",
    "Buy Tata Power Company; target of Rs 245: Sharekhan",
    "Headwinds from US banks fallout, debt default fears to keep investors anxious",
    "Oil set for worst run this year as recession fears rattle market",
    "Agri Picks Report May 05,2023: Geojit",
    "Start-up Street: ‘Boring’ businesses can turn into successful start-ups",
    "SaaS firm Pando raises $30 million in Series B",
    "ZestIoT raises $6.5 million in Series A round led by IvyCap Ventures",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Hero Moto Q4 beats estimates, input costs hurt United Breweries & more | Market Minutes",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Gamifying Pedagogy | Unusual Suspects",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Hero Moto Q4 beats estimates, input costs hurt United Breweries & more | Market Minutes",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Download from Windows Phone",
    "Top Articles from Financial Times"
]