[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Larsen INE018A01030, LT, 500510",
    "Apple US0378331005, AAPL:US",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18267.25\n\n-29.75 (-0.16%)",
    "Sensex\n\n61827.83\n\n-76.69 (-0.12%)",
    "SC gives go-ahead to resolution plan submitted by Supertech",
    "Puma appoints K Balagopalan as India Managing Director",
    "Jio, Airtel add 19.8 lakh subscribers in February: Trai",
    "Why are banks wary of lending to industry? Inside the treacherous world of corporate loans",
    "Asian Paints down even after a robust Q4; what brokerages have to say",
    "Maruti Suzuki India plans to invest over $5.5 billion to double capacity by 2030",
    "Market LIVE Updates: Sensex falls 130 pts, Nifty around 18,250; Auto stocks rise, metals drag",
    "Google Introduces Pixel 7A, Pixel Fold | Goes Big On AI | Here Are The Key Takeaways Of I/O 2023",
    "Amritsar Blasts: Who Are The Accused? | Three IED Blasts Happened Near Golden Temple In A Week",
    "Stock Of The Day: Crompton Greaves Consumer Electricals | Should you buy after the sharp selloff?",
    "Apple’s India push | Foxconn buys 300-acre site in Bengaluru",
    "Cyclone Mocha: How Are Cyclones Named? | When Will Cyclone Mocha Make Landfall?",
    "Eicher surges 7 percent on strong March quarter earnings",
    "Tata Motors Q4FY23 Preview: Expect 30% YoY rise in revenue, 5-7x YoY growth in net profit",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "Latest MSCI India rejig: Two Adani stocks out; check out other highlights",
    "Macquarie Capital acquires majority stake in CloudExtel in India",
    "Who is Linda Yaccarino, the woman rumoured to become new Twitter CEO?",
    "ZEE-Sony merger could face another big test",
    "Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "Co-developer policy likely by Noida and Greater Noida authorities for stalled projects",
    "Bengaluru rent: 'Tenants' caught in major drug bust. 'Landlord' is...",
    "'Meet Elona, new Twitter CEO': Elon Musk's big announcement unleashes meme fest",
    "Income Tax Department mulling over taxing Netflix India: Report",
    "BharatPe is a $3 billion write-off, value destroyed by Rajnish Kumar: Ashneer Grover",
    "Europe would have been in deeper recession in absence of Russian oil: Puri",
    "Why corporates are moving away from Connaught Place to Gurugram & Noida",
    "Air India’s pilot unions fold in standoff with airline, pilots ‘free to sign new contracts’",
    "IBLA 2023: Give ONDC time, we will see good take-off in next 2-3 years, says NPCI's Dilip Asbe",
    "Coal prices likely to be hiked as CIL prepares to revise wages: Sources",
    "GoFirst's resolution professional reassures employees that airline will restart operations",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Pakistani actor wants to file complaint against PM Modi. See Delhi Police's hilarious response",
    "McDonald’s food causes second-degree burns in 4-year-old, parents file case",
    "MSCI index review: The big gainers and losers",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "Buzzing Stocks: Tata Motors, Dmart, ONGC, M&amp;M, Eicher Motors, others in focus today",
    "Stock Market Today: Top 10 things to know before the market opens",
    "Karnataka Election 2023 Highlights: Scindia certain BJP will win in Karnataka",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "National Technology Day 2023: PM Modi launches projects worth Rs 5,800 crore",
    "Bengaluru police seizes drugs worth Rs 7.06 crore; tweets, \"Found more 'tenants' for Jail\"",
    "This university will cover abortion costs for its students",
    "Jennifer Bansiwal quits 'Taarak Mehta Ka Ooltah Chashmah', files sexual harassment case",
    "Advance / Decline (NSE) \n\n993920",
    "Friend cricgopi predicts 204rs is the intraday tgt which is around 7.5...",
    "Good mornig tradersx now trade with the most on vhatsap 9 $even 48 fou...",
    "Dixon picking up in early morning trade, keep a close watch",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Apple to open first online shop in Vietnam in a push to emerging market",
    "Masayoshi Son now owes SoftBank $5.2 billion on side deals",
    "Asian shares tentative on global growth concerns, Japan surges",
    "Fuel prices on May 12 : Petrol, diesel rates unchanged across major metros",
    "Fate of GE and Intel a warning to Indian companies against rigid business models",
    "Consumer stocks could benefit as this X factor reappears",
    "Shiv Sena Judgment: Slap on the wrist but with lessons for the future",
    "Five Takeaways From Donald Trump’s Unruly CNN Town Hall",
    "Pakistan: What next for Imran Khan? Perhaps a bleak future",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Got Rs 10 lakh to invest? Kotak AMC’s Harish Krishnan shares strategy for retail investors",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How is MF expense ratio calculated?",
    "Why short duration funds are all weather funds",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Gurugram Global City: Tepid bidder response forces e-auction delay by a month",
    "SC gives go-ahead to resolution plan submitted by Supertech before insolvency court",
    "Colliers India expected to hire 400 employees, enter more tier-2 markets",
    "CBRE partners with NASSCOM for DISRUPTECH 2.0 to support, mentor startups",
    "K Raheja Corp, Aditya Shagun Developers to build 3 mn sq ft IT park in Pune",
    "Bengaluru’s MG Road tops high street rankings, Hyderabad’s Somajiguda comes second",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Nazara Technologies: Blockbuster end to the year",
    "Trade Spotlight | Your trade for Cyient, Jubilant Pharmova, Engineers India today",
    "MC Interview | Don't expect shortage of coal, imports will continue to increase: Coal Secretary",
    "Bang Overseas is moved by 3.33",
    "Shera Energy is moved by 8.02",
    "Systango Tech is moved by -3.03",
    "Triveni Turbine is moved by 3.06",
    "Precision Wires is moved by 3.43",
    "Dynamic Services & Security",
    "Dynamic Service is moved by -3.86",
    "Set SMS alerts for market news",
    "LatentView’s dismal Q4 a reality check for investors",
    "Agri Picks Report May 12,2023: Geojit",
    "Morning Scan: All the big stories to get you started for the day",
    "Midcap Magic: Sona BLW forges electrifying growth in auto ancillary space",
    "Indian Hotels trades lower; Nuvama cuts rating but other brokerages confident. Here’s why",
    "Intellect Design jumps 9% on crossing Rs 2,000-crore revenue mark",
    "Oil prices recover on short-covering, US debt ceiling fears weigh",
    "Crude oil prices firm as USD retreats | China's crude import declines by 16% | Commodities live",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "MSCI rejig, Asian Paints, Eicher Motors & more | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Larsen & Tourbo: Buy into weakness? Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]