[
    "SBI INE062A01020, SBIN, 500112",
    "ITC INE154A01025, ITC, 500875",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18203.40\n\n+73.45 (+0.41%)",
    "Sensex\n\n61729.68\n\n+297.94 (+0.49%)",
    "Moneycontrol Pro Panorama: Dancing elephants and awkward valuations",
    "Jaguar owner Tata leans toward UK over Spain for battery plant",
    "Zomato on ONDC: ‘Continue to watch progress closely, and learn from it’",
    "Zomato strengthens top deck, announces three top-level appointments",
    "Zomato Q4 net loss narrows to Rs 188 crore as revenue jumps 70%",
    "Punjab National Bank Q4 results: Key highlights from the earnings",
    "Blackstone Sr MD Asheesh Mohta On The Landmark Nexus REIT IPO, M&A Strategy, Realty Outlook & More",
    "Tesla eyeing India for a new gigafactory? | Tesla’s global expansion plans",
    "Amazon's Big Bet On India | AWS To Invest $12.7 Billion By 2030 | CEO Adam Selipsky Interview",
    "Will Artificial Intelligence really take your job? Level up with these skills to beat ChatGPT, AI",
    "RBI board approves transfer of Rs 87,416 crore as dividend to govt for 2022-23",
    "How will tax on foreign tour spends on credit cards affect your holiday. The complete guide.",
    "HDFC MF launches defence-themed fund. Should you invest?",
    "Nexus Select Trust REIT stock climbs over 4% in debut trade",
    "MC Exclusive: Go First looking at three fleet-size options to restart operations",
    "SEBI mandates prominent risk disclosures empowering derivatives traders and investors",
    "Tax collected at source increase: A move to expand tax base?",
    "Jet Airways operator’s certificate expires today. Will it take to air in 2023?",
    "Chris Wood adds Axis Bank, Thermax to portfolio, increases L&T's weight",
    "Sebi's proposed fee caps could slash AMC profits by Rs 1,400 crore",
    "Live News Today: PM Modi meets children and members of Indian diaspora in Hiroshima",
    "Karnataka News Live Updates: Siddaramaiah, DK Shivakumar arrive in Delhi",
    "JSW Steel Q4 earnings: Net profit rises 13% to Rs 3,664 crore",
    "Woman laid off by Amazon rejoins same team after 4 months",
    "Who is the Gurdaspur woman slapped by a police officer?",
    "SC panel report on Adani finds no regulatory failure on price manipulation",
    "Tesla held talks with India on auto incentives, battery making: Report",
    "Why ONDC's retail orders fell by 50% last weekend",
    "SC upholds Tata Motors' disqualification by BEST from electric bus tender, junks plea",
    "KTM 390 Adventure spoke wheels with fully adjustable suspension; All you need to know",
    "Newsletter with fundamental stock ideas, multi-baggers and insights",
    "Closing Bell: Nifty ends at 18,200, Sensex up 298 pts; IT stocks outshine, pharma drags",
    "Krafton's BGMI game is back in India 10 months after suspension",
    "When an air hostess did not recognise Infosys founder Narayana Murthy on flight",
    "Sundar Pichai's childhood home in Chennai sold: 'Father broke down'",
    "Google reveals its first foldable phone Pixel Fold",
    "Tyre-makers under pressure as too much rubber hits the road",
    "Karnataka to revise property guidance value, a hike between 10-30% likely: Sources",
    "Business class passenger on Air India flight turns violent, wife hides in economy class",
    "'15-minute phone call': Indian Amazon employee laid off in US",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Gainers & Losers: 10 stocks that moved the most on May 19",
    "Justice Prashant Mishra and KV Viswanathan takes oath as Supreme Court judges: See Pics",
    "Chennai sizzles at 42.7 degrees: Rajinikanth, Vadivelu memes to beat the heat",
    "'Today has been difficult': Amazon employee laid off in Hyderabad",
    "Elon Musk wanted bathroom next to his Twitter office, claims lawsuit. His reaction…",
    "Advance / Decline (NSE) \n\n8891152",
    "Zomato strengthens top deck, announces three top-level appointments th...",
    "Isme to 10 lakh ka ghata hi khaya hoga pukka. aaj ki date me kum se ku...",
    "What could be the reason for same operating margin in q3 and q4 when p...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Hundreds of millions of life years lost to pandemic: WHO",
    "Pakistan anti-terrorism court grants pre-arrest bail to Imran Khan",
    "In Pics: Rescue workers reach Italian towns isolated by floods as death toll rises to 13",
    "Gail to borrow up to Rs 7,000 crore domestically to fund Rs 10,000 crore capex plan in FY24",
    "Indian Oil eyes processing bio-naphtha for petrochemicals: Chairman Shrikant Madhav Vaidya",
    "Kabira Mobility unveils KM5000 e-cruiser bike; deliveries to begin next year",
    "E2W Subsidy Phase-out: Manufacturers will be forced to innovate and launch cheaper models",
    "MC Explains | Why El Nino won’t derail India growth story",
    "MVA to set up committee to work out seat-sharing formula for Lok Sabha polls: Congress leader",
    "Kiren Rijiju takes charge of Earth Sciences Ministry",
    "Netweb_Technologies_India_Limited_Corrigendum_to_DRHP",
    "Jupiter_Life_Line_Hospitals_Limited_DRHP",
    "JSW_Infrastructure_Limited_DRHP",
    "Sebi's proposal on TER to curb mis-selling, bring in transparency",
    "A surgical strike: HDFC MF launches defence-themed fund. Should you invest?",
    "Sebi proposes uniform total expense ratio for mutual funds",
    "Large, mid or smallcap? Find out which fund suits you the best",
    "Does the large size of SBI Small Cap Fund bother its fund manager, R Srinivasan?",
    "Can inflows into gold ETFs sustain?",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Chart of the Day: Term premium has shrunk, a sign of many things",
    "HDFC Defence Fund NFO: Here are the hot defence stocks to watch out for",
    "Despite correction, these mid- & small-cap technology stocks got picked by mutual funds",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "Trident Group acquires Shipra Mall in Ghaziabad for Rs 551 cr via auction",
    "Greater Noida Authority hires consultant to assess status of incomplete projects",
    "Cognizant giving up 30-35 percent space in Chennai may have marginal impact: DLF",
    "Godrej Construction to develop 1 msf, with a revenue potential of Rs 1,500 crore in Mumbai",
    "Mumbai developers seek relaxation on govt charges for over 100 delayed projects approved in 2021",
    "Land transactions at all-time high, but clear titles remain a challenge",
    "Brookfield India REIT, GIC to acquire commercial property for $1.4 billion",
    "Commodities Live: Commodities eye the G7 meeting, Powell speech today",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Zydus Lifesciences: Time to book profit, post strong rally over a year?",
    "Weekly Tactical Pick – Why this chemical stock warrants a look?",
    "Trade Spotlight | How to trade in KRBL, HEG, Poonawalla Fincorp today",
    "Trade Spotlight | Your game plan for CreditAccess Grameen, Cyient, Amara Raja Batteries today",
    "Daily Voice | Scope of early interest rate cut by RBI low: Azeem Ahmad of Waterfield Advisors",
    "Daily Voice | 'Financial services sector to drive double digit market growth'",
    "Daily Voice | This fund manager is bullish on SRF, SKF, PI Industries. Find out why",
    "Buy CreditAccess Grameen; target of Rs 1420: JM Financial",
    "PNB Q4 net profits spikes nearly six-fold to Rs 1,159 crore",
    "R M Drip & Sprinklers Systems",
    "R M Drip  is moved by -0.43",
    "Bhartiya Inter is moved by -3.41",
    "India Glycols is moved by 3.05",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | Dancing elephants and awkward valuations",
    "Regulating AI: Checks are required, but the control of the technology by a few a risk",
    "Taking Stock: Market gains on late buying; Sensex up 298 points, Nifty above 18,200",
    "Agri Picks Report May 19, 2023: Geojit",
    "Oil prices fall on strong US dollar, sticky inflation",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "Storyboard: Cannes Special",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Did SBI, ITC & Indigo Q4 numbers beat Street estimates? Market Minutes",
    "PVR-INOX: Time to check in? Moneycontrol Alpha",
    "Footage, Analytics & Actionable Insight | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]