[
    "Brightcom Group INE425B01027, BCG, 532368",
    "IEX INE022Q01020, IEX, 540750",
    "Apple US0378331005, AAPL:US",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18587.65\n\n+24.25 (+0.13%)",
    "Sensex\n\n62700.42\n\n+74.79 (+0.12%)",
    "Boland sparks India collapse as Australia wins WTC final",
    "Sundar Pichai turns 51: From IIT Kharagpur to Google CEO",
    "Go First extends suspension of flight operations till June 14",
    "Russia to deploy tactical nuclear weapons in Belarus in July, says Putin",
    "Forex reserves jump $5.9 billion to $595 billion",
    "Top 10 picks for next 3-4 weeks as market stays bullish despite rush for profits",
    "Old Bridge’s Kenneth Andrade takes a contrarian bet on IT services, pharma",
    "Capacity addition in chemicals, FDA red flags in pharma not a worry: Andrade",
    "Market LIVE Updates: Indices marginally up; Go Fashions, TVS Motor, Cochin Shipyard in focus",
    "Ulwe Better Than New York: This tenant moved the seas to live in Navi Mumbai",
    "2024 Lok Sabha Elections: Will the opposition unite with Congress to beat BJP?",
    "The face behind the fight for same-sex marriage | Pride 2023",
    "How do Mumbai’s Youngsters Spend Their First Salary? | Ground Report | Expert Tips",
    "What's unique about the Mumbai Trans Harbour Link? Highway connects Navi Mumbai, Raigad",
    "Block deal in Go Fashion, key Nifty levels to watch out for & more | Market Minutes",
    "Emerging economies should leverage services sector to boost productivity: RBI",
    "Franklin Templeton repays investors of two debt funds",
    "CEA, finmin executives to push for rating upgrade by Moody's",
    "Govt to list SCI's non-core assets on bourses this month; invite bids for privatisation thereafter",
    "Titagarh Wagons to raise Rs 288 crore via preferential allotment of shares",
    "Contrarian call on IEX, investors cool to Voltas, simmers in Kotak Bank, and calm before storm",
    "Analysts at a loss, a frayed corporate house, and more",
    "Madhya Pradesh Elections LIVE: Priyanka Gandhi to start campaign in Jabalpur",
    "Looming US debt crisis is in a late-stage big cycle, ace investor Ray Dalio says",
    "‘Decade of emerging markets’ may be about to regain traction",
    "TVS Motor's Singapore unit to increase stake in Swiss E-Mobility Group",
    "WTC: Overcast conditions, grass on pitch influenced decision to bowl first: Dravid",
    "Amritsar-Ahmedabad IndiGo flight strays into Pakistan airspace",
    "Six of India Inc top 10 see values erode by Rs 83,637.96 crore, TCS hit hardest",
    "'Incredible feeling' to win 23 Grand Slams, says Djokovic",
    "IEX says market coupling will kill innovation, move akin to clubbing Ola, Uber",
    "Sri Lanka likely Asia Cup venue after India-Pakistan row: Official",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Japan restaurant chain seeks Rs 4 crore in damages from teen who licked soy sauce bottle",
    "Kajol quits social media, deletes Instagram posts: ‘Facing one of the toughest trials of my life’",
    "Vicky Kaushal and a new middle cinema for millennials",
    "Family celebrates despite son scoring 35 per cent in Class 10 exam. Watch",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "Gaddiyan Uchiyan Rakhiyan: Vicky Kaushal's viral dance spotlights lesser-known Punjabi artistes",
    "TCS Chairman N Chandrasekaran talks about AI-expansion plans",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "BMW M2 coupe finally launched in India, starting at Rs 98 lakh: See Pics",
    "Donald Trump indicted on seven charges over classified documents case, here's all you need to know",
    "‘Modi Thali’ at New Jersey restaurant ahead of PM’s US visit. Watch",
    "This airline allows male cabin crew to wear makeup: 'Fashions change and so...'",
    "Whatsapp account hacked: Cybercriminals impersonate user to ask contacts for money",
    "Advance / Decline (NSE) \n\n1357553",
    "Buy in bulk, it will cross day high again, keep buy for upper target.....",
    "Easemytrip has 70 crore on gofirst i think this is reason for is going...",
    "Sellers with no brains ........selling low price",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Minor earthquake shakes Johannesburg, South Africa's biggest city",
    "Former US President Trump indicted on felony charges for classified documents",
    "Cricket’s WTC cycle, especially final, needs to be a bigger & a far grander affair",
    "Moody's sees 6-6.3% economic growth in Q1, flags fiscal slippage risks",
    "How much of a threat is El Nino to the Indian economy?",
    "Finance Ministry starts process for deciding on convenor of GST rate rationalisation GoM",
    "BJP MP Brij Bhushan says will contest again from Kaisarganj, skips reference to wrestlers' stir",
    "Karnataka Chief Minister Siddaramaiah launches free bus travel scheme for women",
    "Valiant_Laboratories_Limited_DRHP",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "Why have China-focussed mutual funds hit a bump, again?",
    "MFs can now participate in repos on Commercial Papers, Certificate of Deposits",
    "RBI MPC: Deposit and lending rates remain on a steady path; life goes on as usual, for now",
    "Reaching that crorepati milestone hinges on your commitment to investing",
    "Debt mutual funds 2.0: Life after removal of long-term indexation benefit",
    "Is this the time to invest in auto funds?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Equity mutual fund inflows halve to Rs 3,240 crore in May, SIP book hits record high",
    "Franklin Templeton equity funds go up when things are down. Here's why",
    "ICICI Pru Bluechip Fund completes 15 years. Does it still have its mojo?",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Is the Pune real estate market going the Mumbai way?",
    "Why Bengaluru’s villas are all the rage among millennial buyers",
    "Hyderabad records 5,877 residential property registrations in May, up 31% MoM",
    "Why do some Bollywood stars prefer renting apartments in Mumbai rather than buying them?",
    "Forbes Global 2000 | JPMorgan top of the class; Chinese firms' tally shrinks",
    "K Raheja Corp announces Rs 1,100 cr pre-launch sales for South Mumbai project",
    "Yamuna Expressway Authority launches data centre scheme, eyes Rs 220 crore revenue",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "Gold firms as dollar eases, focus on Fed cues",
    "Gold near two-month low on surprise rate hikes in Australia, Canada",
    "Gold steady near $1950, as focus turns to US Fed's June 14 meeting",
    "Aditya Birla Group forays into branded jewellery retail with Rs 5,000-crore bet",
    "Gold rises as dollar sheds gains against peers",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | Your trading strategy for Paytm, Suzlon Energy, Manappuram Finance today",
    "Hot Stocks | Here is why you should bet on Chemplast Sanmar, United Spirits for short term",
    "Trade Spotlight | How should you trade in JBM Auto, HEG, JSW Steel today",
    "Tourism Finance Corp of India",
    "Tourism Finance is moved by 3.00",
    "Simbhaoli Sugar is moved by 1.79",
    "Refex Ind is moved by 3.09",
    "Cochin Shipyard is moved by 4.21",
    "Easy Trip is moved by 3.15",
    "Muthoot Cap is moved by 3.51",
    "Shri Rama Multi is moved by 7.63",
    "Set SMS alerts for market news",
    "Climate Change: The 36-year-old treaty slowing the Arctic meltdown",
    "India's generic drugs industry needs better oversight",
    "Welcome the brave new world of GenAI, but manage the creative destruction",
    "IEX investors have reason to worry even without market coupling",
    "Agri Picks Report June 12, 2023: Geojit",
    "Jupiter Wagons up 2% on NCLT nod to buy controlling stake in Stone India",
    "Cochin Shipyard shares gain 6% on bagging Rs 300-crore defence project",
    "Go Fashion tanks 5% after large deal, Sequoia Capital likely seller",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "Stock gaming platform TradingLeagues raises $3.5 million from Leo Capital, others",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "See More Top Companies in India",
    "RBI MPC decision, Tech Mahindra & utility stocks in focus | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]