[
    "IKIO Lighting INE0LOJ01019, IKIO, 543923",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18826.00\n\n+137.90 (+0.74%)",
    "Sensex\n\n63384.58\n\n+466.95 (+0.74%)",
    "City court grants ED 8 days custody of TN minister Balaji",
    "India's forex kitty declines by $1.32 billion to $593.75 billion",
    "Rupee closes near six week high against US dollar",
    "GST Council meet on July 11 to discuss report on online gaming: Vivek Johri",
    "How did IndiGo grab the market created by the grounding of Go First?",
    "Rahul Goswami to join Franklin Templeton India MF as head of fixed income",
    "IKIO Lighting shares settle with nearly 42% premium in debut trade",
    "NSEL case: Sebi disposes notices against Sharekhan Commodities without directions",
    "Cyclone Biparjoy Makes Landfall, Strong Winds, Heavy Rains Hit Gujarat Coast",
    "Decoding FD Laddering I Benefits of Multiple Smaller FDs over a big one? | Watch",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "SEC enforcement chief rejects criticism of crypto crackdown",
    "GIFT Nifty, earlier SGX Nifty, may become tradeable 22 hours a day from July 3",
    "FinMin officials meet Moody's, pitch for sovereign rating upgrade",
    "After India’s goods exports, services exports now showing weakness: Nomura",
    "India weighs barter trade with crisis-hit Egypt in credit line talks: Report",
    "Market Coupling | IEX may lose market share, power sector likely to gain",
    "Govt likely to come out with logistics cost estimate by Sept: DPIIT Official",
    "Here’s all you need to know about ActivMoney auto sweep account feature",
    "In real terms, MSP increase has been moderate in both UPA & NDA govts",
    "PM Modi collaborates with Grammy award-winning singer Falu for a new song",
    "Manipur News: Civil society groups urge PM Modi to form court-monitored tribunal",
    "Assam flood worsens as incessant rain continues, 34,000 people affected",
    "Michael Jordan to sell majority stake in NBA's Charlotte Hornets: Team",
    "Cyclone Biparjoy Live: Rain hampers restoration work in Kutch, Rajasthan braces for heavy downpour",
    "Microscope, please: A 'Louis Vuitton' handbag, smaller than a grain of salt, is up for auction",
    "Cyclone Biparjoy adversely impacts APM Terminals Pipavav Port",
    "Intel, Micron spending spree shows diplomacy bearing fruit",
    "Billionaire Reuben brothers sue Trafigura over nickel fraud",
    "El Niño and Arabian Sea cyclone fuel a bearish monsoon",
    "Market at all-time high but doesn't feel like a bull run, says Nithin Kamath",
    "We asked ChatGPT for the best Indian stocks. Here’s what it came up with",
    "2023 Hero Xtreme 160R 4V review - keeping up with the competition!",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Bollywood box office pins hopes on Prabhas-starrer Adipurush to offset weak Q1 performance",
    "Yawning gap: SBI chairman’s Rs 37 lakh salary reignites public vs private banks debate",
    "Why youth in China are quitting high-paying jobs to become waiters, baristas",
    "Man fakes his own death to teach family a lesson, then shows up at funeral in helicopter",
    "Closing Bell: Nifty above 18,800, Sensex gains 467 pts led by financial, capital goods",
    "8-year-old girl’s false complaint lands Bengaluru delivery agent in trouble",
    "In pics: Paws and popcorn — Thai cinema goes pet-friendly",
    "Canada freezes deportation of Indian students who used fraudulent university letters",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Cyclone Biparjoy wreaks havoc in Gujarat before weakening into cyclone storm: See Pics",
    "Man spends Rs 6.5 lakh to try and look like singer Ricky Martin",
    "Couple skips catering service, orders McDonald's meal for guests at their wedding",
    "Blood-covered pilot keeps calm and records video after massive bird hits aircraft. Watch",
    "'Start with...': Edelweiss CEO lists 3 steps to build a portfolio for your child",
    "Advance / Decline (NSE) \n\n1280780",
    "Nothing is in technicla where its in same range for 3 months in row",
    "I would say go for mrpl bec in the next 2 quaters all the debt might b...",
    "Greaves cotton | karun carpets private limited, promoter bought net 19...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Patience was handsomely rewarded towards the end of last week as bulls stamped their authority.",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "News junkies turn to TikTok to chart new paths in media",
    "Archaeologists in Peru find 3,000-year-old mummy in Lima: See Pics",
    "Baidu wins licence to operate driverless taxis in Shenzhen",
    "Milk prices unlikely to go up until Diwali as production increases",
    "NLC India forms arm to undertake green energy projects",
    "Time is right for India-US trade to grow exponentially, says TCS North America head",
    "Excess Cash Conundrum: Reward shareholders, invest or just hold",
    "'Wasteful' fossil fuel, farm subsidies worsening climate change, says World Bank",
    "Govt examining recommendation to impose countervailing duty on Chinese steel imports",
    "People should trust education planners, says minister Jitendra Singh",
    "In real terms, MSP increase has been moderate in both UPA & NDA governments",
    "Bengal panchayat poll nomination process peaceful, asserts Mamata Banerjee",
    "Western_Carriers_(India)_Limited_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Will direct plan expenses of MFs go up with execution-only platforms?",
    "Moneycontrol Selects: Top stories this evening",
    "Explainer: How SEBI’s norms on execution-only platforms will impact investors",
    "More AMCs make a beeline for Multi Asset Allocation Funds",
    "Mutual funds may not get holdings waiver post HDFC Bank - HDFC merger: Report",
    "Inflation down: But does that mean rates will be cut soon?",
    "Strengthening grievance redressal framework a work in progress: IRDAI chief",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Can the stake sale in UTI AMC fuel a stock rally?",
    "This Father’s Day, show Papa you care: Here are 5 financial gifts for your Dad",
    "Cautious of market highs, these large-caps exit MF portfolio",
    "Income tax returns: Types of TDS certificates and why they are needed",
    "Old is gold: Income tax exemptions & deductions that senior citizens can claim",
    "EPF or NPS: Which is the better investment option?",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "Delhi Metro to operate, maintain Mumbai Metro’s first underground line",
    "Indian office sector sees investments worth $0.9 billion in Q1 FY23: Report",
    "Apartments under Rs 50 lakh: Here’s where you can buy in Delhi-NCR",
    "Will NCLT’s approval of Ace Infracity resolution plan for 3C Homes set precedence?",
    "Bengaluru’s property resale market gets a boost from housing shortage",
    "Greater Noida Authority to launch warehousing scheme in Ecotech 16 soon",
    "Kerala property sales may be hit this fiscal after increase in fair value of land",
    "Rental income of retail malls to increase by 8-10% in FY2024: ICRA",
    "Gold finds support as Dollar index nears 5-week low",
    "Gold down third day ahead of FOMC; track latest prices",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | How do you trade KEI Industries, Tanla Platforms, APL Apollo Tubes today?",
    "Tata Consumer Products sees strong break out, analysts expect it above Rs 1,000",
    "2 investment themes and 3 preferred bets of Porinju Veliyath",
    "FIIs may not prefer Chinese equities over Indian after Fed’s hawkish pause: Anand Tandon",
    "Hydrocarbon order pipeline at $20 billion, energy transition opportunities strong: L&T Energy head",
    "GAIL closes above 50-Day Moving Average of 107.31 today.",
    "Emkay Global Financial Services",
    "Emkay Global closes above 200-Day Moving Average of 74.69 today.",
    "Onelife Capital closes above 30-Day Moving Average of 12.46 today.",
    "Geojit Fin closes above 150-Day Moving Average of 45.13 today.",
    "Southern Petrochemical Industries Corporation",
    "SPIC closes above 150-Day Moving Average of 67.17 today.",
    "Navin Fluorine International",
    "Navin Fluorine closes above 30-Day Moving Average of 4641.11 today.",
    "Agarwal Float closes below 30-Day Moving Average of 36.60 today.",
    "Set SMS alerts for market news",
    "Global heat records are falling. A little panic might be in order",
    "The Reading List: June 16, 2023",
    "Taking Stock: Nifty, Sensex record closing high on fabulous Friday, investors richer by Rs 2 lk cr",
    "Metal prices shine this week, more China stimulus expected",
    "Accumulate CEAT; target of Rs 2260: Prabhudas Lilladher",
    "Accumulate KEC International; target of Rs 578: Prabhudas Lilladher",
    "Gainers & Losers: 10 stocks that moved the most on June 16",
    "Commodities Live: Metal prices shine, more China stimulus expected | Copper, iron, steel in focus",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "Yulu eyes expansion as it closes in on profitability",
    "See More Top Companies in India",
    "IKIO Lighting listing, PVR-INOX in focus on Adipurush release & more | Market Minutes",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Getting India Smart & Connected | Unusual Suspects",
    "Fed throws a surprise, Axis Bank block deal & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]