[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Infosys INE009A01021, INFY, 500209",
    "Apple US0378331005, AAPL:US",
    "Reliance INE002A01018, RELIANCE, 500325",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18598.65\n\n+99.30 (+0.54%)",
    "Sensex\n\n62846.38\n\n+344.69 (+0.55%)",
    "Govt hosts India’s first mining start-up summit in Mumbai",
    "'Shame': Twitter reacts to Indian wrestlers getting detained in Delhi",
    "FDI equity inflows dip 22% to $46 bn in 2022-23",
    "CBI books Rolls Royce for alleged corruption in Hawk Advanced Jet Trainer deal",
    "Is aviation going the telecom way?",
    "At $3.31-trillion valuation, India reclaims fifth spot in global stock market tally",
    "Goodyear's India unit posts near two-fold jump in Q4 profit on easing costs",
    "Instagram star influencer moves out of village to rent in Navi Mumbai | The Tenant",
    "First Glimpse Of New Parliament | Inside Look Of Lok Sabha & Rajya Sabha Chambers",
    "FDI Into India Falls 16% In FY23: Why Are Foreign Investors Wary?",
    "Maruti Suzuki Jimny: A worthy successor to the Gypsy? | Drive Report",
    "Australian MPs were \"jealous\" of PM Modi's popularity, says Leader Of Opposition Peter Dutton",
    "What Is ‘Disease X’? WHO Rings Warning Bells For A Deadlier Pandemic",
    "Head-to-Head: ITC, HUL stake equal claims to FMCG crown",
    "Go First offers pilots Rs 1 lakh in addition to monthly salary in bid to retain them",
    "ONGC plans Rs 1 lakh crore green push to set up 10 GW of capacity by 2030",
    "CV makers beef up operations to leverage record industry volumes during FY24",
    "Urban unemployment hit new low of 6.8% in January-March: Govt survey",
    "Amid market glut, export slump, cashewnut prices crash",
    "Warburg Pincus affiliate acquires stake in Vistaar Finance, backs Avijit Saha as CEO",
    "ITR filing: These common mistakes may attract income tax department notice",
    "This 60-year-old's wealth doubled to $35 billion this year, thanks to AI. Meet Jensen Huang",
    "Manipur Violence Update: Manipur administration warns against generating, spreading fake news",
    "Return of unclaimed deposits will take time, says FM Nirmala Sitharaman",
    "Indian pharma must ensure compliance with global standards: Kiran Mazumdar-Shaw",
    "Billionaire Nikhil Kamath is worried about friendship recession. Here's what it means",
    "Michael Mauboussin believes this simple, fair-value calculation method deserves a book",
    "L&T sets up four-member brainstorming panel to strengthen green energy efforts",
    "Girl stabbed 22 times to death by alleged boyfriend in Delhi CCTV horror, bystanders walked by",
    "IIT graduate quit Rs 36 lakh job offer to take UPSC exam, ranks 135",
    "Edelweiss CEO Radhika Gupta wants foreigners to be charged more at tourist sites",
    "Inside Paisabazaar’s ongoing pivot to a recurring revenue model",
    "One big lesson Bill Ackman has drawn from Hindenburg’s takedown of Icahn Enterprises",
    "A guide to commercial real estate investing",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "PM Modi responds to Shah Rukh Khan’s video on new Parliament building",
    "New seasons of 14 OTT shows to look forward to",
    "Delhi woman, kidnapped in 2006, found after 17 years",
    "PM Modi launches Rs 75 coin. Where and at what price can you buy it?",
    "Once a symbol of China’s growth, now a sign of a housing crisis",
    "Closing Bell: Nifty around 18,600, Sensex gains 345 pts; auto, bank, metal, realty rally",
    "Woman becomes 'full-time daughter' after parents offer her Rs 47,000 per month",
    "Simple One electric scooter launched at a starting price of Rs 1.45 lakh: See Pics",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "ISRO's GSLV-F12 carrying navigation satellite lifts off from Chennai",
    "Advance / Decline (NSE) \n\n1139941",
    "Yo yo stock for the last 2 years. moves up then down."
]