[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Infosys INE009A01021, INFY, 500209",
    "Apple US0378331005, AAPL:US",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18599.00\n\n+5.15 (+0.03%)",
    "Sensex\n\n62792.88\n\n+5.41 (+0.01%)",
    "IKIO Lighting IPO subscribed 1.55 times on bidding debut",
    "Does EPAM Systems’ guidance cut signal tough road ahead for Indian IT?",
    "Days of steady US pricing for pharma players to come in FY24, says JM Financial",
    "WWDC 2023 | Apple focuses on mental health with new updates",
    "Expect consistent demand for cement: Geojit Financial Service",
    "Govt-appointed panel will explore how NPS can be improved for employees: PFRDA chairman",
    "Bajaj Finance to bring down dependence on telemarketing calls: Sanjiv Bajaj",
    "ICICI Pru Bluechip Fund completes 15 years. Does it still have its mojo?",
    "Trade setup for Wednesday: Top 15 things to know before the opening bell",
    "Apple Vision Pro Is A Computer On Your Face! Game-changing Rs 3 Lakh AR Headset Launched",
    "Will FAME II Subsidy Cuts Affect The Growth Momentum Of Electric 2-Wheelers?",
    "Chinese warship has close encounter with US missile destroyer in Taiwan Strait",
    "NSE Shifts Nifty bank futures & options expiry day to Friday; decoding the impact | NSE Vs BSE",
    "India's Defence Exports At A Record High, Make-In-India Push Pays Off",
    "Growth Of Indian Luxury Market: Why Are Global Brands Bullish On Indian Ambassadors?",
    "SAT quashes SEBI order cancelling Brickwork Ratings' licence",
    "Sequoia Capital splits into three entities: India, China, US to operate independently",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "Indian market way too concentrated; participants slowly warming up to Sensex: BSE MD",
    "Which are Jefferies’ top stock ideas for June?",
    "Govt recommends Sat Pal Bhanoo, R Doraiswamy as MDs for LIC",
    "World Bank offers dim outlook for the global economy in face of higher interest rates",
    "HDFC Bank’s suspension of manager highlights pressure to meet sales targets",
    "Can Honda Cars end its one-trick pony ride with the Elevate?",
    "WTC final: An India win could make cricket go 'retro' all over again",
    "Mumbai realty: Redevelopment projects worth Rs 20,000 crore unable to take off in Juhu",
    "Man with over 100 kids now has his 12 wives on birth control pills",
    "Rehana Fathima: Sued for kids painting on her topless body, Kerala activist’s huge win in court",
    "Chinese restaurant's misogynistic poster sparks outrage: 'get drunk to give him a chance'",
    "Billionaire Nikhil Kamath to donate majority of his wealth as he joins 'The Giving Pledge'",
    "How Ratan Tata helped this 21-year-old man build a Rs 500-crore company",
    "Ankur Warikoo says he used supplements to lose 8 kg in 16 weeks, gets schooled by a doctor",
    "Chinese woman charges Rs 11 to help strangers 'feel alive'. Here's what she offers",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "HDFC Bank officer abuses employees in online meeting, suspended after video goes viral",
    "Bengaluru-Chennai train journey may soon be reduced to 2 hours",
    "Comic Tanmay Bhat's YouTube channel restored, hackers had renamed it to...",
    "Closing Bell: Sensex, Nifty end flat amid volatility; IT index major drag",
    "Honda's SUV Elevate makes global debut in India",
    "Father refuses to believe his son died in Odisha train crash, finds him alive in morgue",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "WestBridge Capital buys majority stake in Tamil Nadu-based Kovai Pazhamudhir Nilayam",
    "How a trans actor’s Bud Light campaign plunged an Indian-origin CEO’s marketing firm into crisis",
    "Maruti Suzuki Jimny and 5 more cars making their way to market this June",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In Pics: Honda Elevate makes global debut in India, bookings to commence in July",
    "In Pics: Apple enters Augmented Reality race with Vision Pro headset",
    "Bomb scare at Kolkata airport: 541 flyers offloaded from Qatar Airways flight to London",
    "Sequoia Capital's Shailendra Singh has a Twitter handle request as company splits into 3",
    "Advance / Decline (NSE) \n\n1096958",
    "Bajaj auto ran vertically for the last 4days from 4500 rs level to 475...",
    "Yeh jo banknifty hai, isko itna ghamand dikhaane ki zaroorat nahi hai....",
    "This is a junk stock. the organization wants to dump this junk.",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Hesitation has been a feature of this trend and the momentum continues to blow in this manner.",
    "Read C. K. Narayan full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Domestic investors awaits for RBI policy outcome this week.",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, headwinds averted",
    "Read Ambareesh Baliga full Report",
    "Ukraine dam supplying water to nuclear plant and Crimea is breached, unleashing floods",
    "Crypto exchange Binance hit by outflows of $780 million in last 24 hours",
    "Emirates looks at placing new order for long-haul jets",
    "KEC International bags two orders for Train Collision Avoidance System worth Rs 600 crore",
    "Sugar slips on Brazil's rising output, progress of monsoon in India",
    "MahaRERA allows large real estate agencies to self-train staff for appearing in RERA exam",
    "The 20% up rule — bull market vs bear rally",
    "If the economy is so bad, why is the labour market so good?",
    "RBI's MPC starts deliberations on policy rate, decision on June 8",
    "OPEC Meeting Outcome: The untold story",
    "Ebixcash_Limited_Addendum_to_DRHP",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Bajaj Finserv MF, India’s newest, to launch today",
    "UTI Nifty 50 Equal Weight Index Fund NFO: Should you invest?",
    "Do equity savings funds make sense after the tax hit on debt mutual funds?",
    "Planning to look at MF stock picks last month and play copy cat? Here’s why you shouldn’t",
    "HDFC Mutual Fund sends notice to investors about change of sponsor. What should you do?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Odisha train accident: FinMin urges insurance companies to expedite claim settlement",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Future Generali India launches health insurance policy with multiple optional covers",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Indian issuers raised nearly $43 billion in green bonds from January 2014 to March 2023",
    "MF multibagger smallcap stocks: Returns of over 1,200% in 2 years, and more to come",
    "How a 10-year bond crashed and burnt out in just 8 months",
    "MFs – The losers and the gainers in the new regime",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "Which are Jefferies’s top stock ideas for this June?",
    "Awfis plans to add 1,000 seats in Bengaluru, Hyderabad",
    "Noida Authority demolishes 32 illegal structures including farmhouses on Yamuna riverbed",
    "Hyderabad surges ahead of Bengaluru with highest new office supply in FY23: Report",
    "Sanjeev Jaiswal takes over as VC & CEO of MHADA in Mumbai",
    "Aditya Birla Group forays into branded jewellery retail with Rs 5,000-crore bet",
    "Gold rises as dollar sheds gains against peers",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "UltraTech Cement top gainer in Nifty50, surpassing record high can bring more action in stock",
    "Hot Stocks | NELCO, Nuvoco Vistas, Orient Cement may fetch double-digit returns in short term",
    "Trade Spotlight | How should you trade in Rossari Biotech, NLC India, eClerx Services today",
    "As bull run on D-Street continues, here are top 10 ideas for next 3-4 weeks",
    "MC Interview | Market may take some more time to hit fresh record highs: Milan Vaishnav",
    "Metalyst Forgin closes below 50-Day Moving Average of 3.26 today.",
    "The Investment Trust of India",
    "The Investment  closes below 200-Day Moving Average of 88.42 today.",
    "Annapurna Swa closes below 30-Day Moving Average of 250.85 today.",
    "Pudumjee Ind closes below 50-Day Moving Average of 22.61 today.",
    "IEX closes below 50-Day Moving Average of 152.04 today.",
    "Indiabulls Real closes below 150-Day Moving Average of 69.03 today.",
    "Mohini Health & closes below 50-Day Moving Average of 55.25 today.",
    "Set SMS alerts for market news",
    "Russia’s dambusting is another war crime",
    "Taking Stock: Market ends flat amid volatility; RBI begins 3-day meeting",
    "CarTrade Tech sees surge in volumes despite correction in MF and FII holding",
    "Gainers & Losers: 10 stocks that moved the most on June 6",
    "Hero MotoCorp gains 1% on positive analyst outlook",
    "Commodities Live: Sugar Prices Slip In International Markets To 6-week Low; What Explains The Dip?",
    "Agri Picks Report June 06, 2023: Geojit",
    "Rahul Yadav fiasco: Investors call for proper due diligence, stronger monitoring after funding",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Saudi Arabia to cut oil output, RBI rate decision & the week ahead | Market Minutes",
    "The Giving Economy | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]