[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Yes Bank INE528G01035, YESBANK, 532648",
    "Apple US0378331005, AAPL:US",
    "HDFC Bank INE040A01034, HDFCBANK, 500180",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n19497.30\n\n+98.80 (+0.51%)",
    "Sensex\n\n65785.64\n\n+339.60 (+0.52%)",
    "RBI appoints P Vasudevan as new Executive Director",
    "GST Council likely to exempt IGST on cancer drug import",
    "Rupee closes one month low against US dollar",
    "Janet Yellen in China as US seeks to stabilise ties",
    "GIC to acquire 74% stake in Genus Power's smart metering venture",
    "FMCG cos to see moderate revenue growth, but greater margins in Q1FY24",
    "Titan Q1 update: Revenue grows 20% YoY on strong performance in key businesses",
    "Clean up your portfolios amid market rally: Sridhar Sivaram to investors",
    "US job openings dip to 9.8 million but remain high, showing resilience in labour market",
    "Best Features Of Apple iOS 17 | NameDrop, Check In, Clear OTP Messages",
    "Pakistan Gets Another $3 Billion From IMF | How Long Will Pakistan’s Economy Survive?",
    "Invicto: Maruti’s Largest & Most Expensive Car Launched Starting At Rs 24.79 Lakhs",
    "Wimbledon 2023: How are the grass tennis courts at Wimbledon maintained?",
    "Senco Gold IPO subscribed 73.35 times as institutional buyers go shopping",
    "SBI rejigs senior leadership to boost dominance: Report",
    "Byju Raveendran holds EGM amid crisis, proposes setting up Board Advisory Committee",
    "NSEL ‘paired contracts’ probe: Sebi suspends registrations of 3 commodity brokerages",
    "Nippon India Mutual Fund limits inflows into smallcap fund",
    "Govt approves draft notification for mandating air conditioned truck cabins",
    "Chandrayaan-3 mission to be launched on July 14, announces ISRO",
    "PPF vs FD: Know which is a better tax saving option",
    "Threads profile can be deleted only on deleting linked Instagram account: Meta",
    "News LIVE updates: PM Modi to flag off Gorakhpur-Lucknow Vande Bharat Express on July 7",
    "Go First case: NCLT defers hearing of applications by lessors",
    "FM Sitharaman advises banks to focus on risk management and regulatory framework",
    "Motilal Oswal Nifty Microcap 250 Index Fund garners Rs 120 crore during NFO period",
    "1 lakh unicorns, 10-20 lakh startups doable: Rajeev Chandrasekhar on India's techade opportunity",
    "Threads had big launch energy. Twitter is under pressure",
    "'Nikhil is a better trader than I am': Zerodha CEO Nithin Kamath on co-founder brother",
    "Woman slams computers to the ground at airport over missing reservation. Video",
    "Puravankara more than doubles sales to Rs 1,126 crore in Q1 of FY24",
    "Madras HC declares as invalid 2019 Lok Sabha election of expelled AIADMK member O P Ravindhranath",
    "Harley Davidson X 440 first ride review: A new breed of AI (American-Indian)",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Man's past-present photos of food served on Vande Bharat Express are viral, IRCTC responds",
    "Titanic sub victims spent final moments in darkness, watching sea creatures pass by",
    "RBI issues draft circular on issuance of debit, credit and prepaid cards",
    "Closing Bell: Nifty at 19,500, Sensex up 340 pts led by oil &amp; gas, power, realty",
    "TCS to get 25,000 employees trained in Microsoft's Azure Open AI",
    "ITC at record after fifth day of gains amid hotel demerger buzz",
    "Mandira Bedi’s ‘nightmare’ at Mumbai airport: ‘absolute chaos’",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In pictures: Dalai Lama celebrates his 88th birthday along with followers",
    "3 protesters arrested at Wimbledon for interrupting matches by throwing confetti",
    "'Public is God': Shivraj Singh Chouhan washes feet of tribal man who was urinated on. Video",
    "'South Park' creators ban tips at their iconic restaurant, pay staff $30 per hour",
    "Why US CEO, who spends $2 million a year on age reversal, has dinner at 11 am",
    "Mark Zuckerberg tweets after 11 years as Threads launches. It's obviously an Elon Musk jibe",
    "Advance / Decline (NSE) \n\n1247807",
    "Kal aayega asli maza, uk market down 3 percent and usa also 2 percent ...",
    "97 seems to be a big hurdle for it. once it will break it with high vo...",
    "Next week new high my next tgt 225 after one year 450",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Trends remained muted until the positive vibes in Bank Nifty started to surge ahead.",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty breaches the 19k mark, but euphoria missing",
    "Read Ambareesh Baliga full Report",
    "Stocks squeal as borrowing costs return to banking crisis highs",
    "Secure Your Family's Financial Future by Investing in a Bajaj Finance Fixed Deposit",
    "Audi to launch electric SUV Q8 e-tron in India in August",
    "Retail inflation likely to have remained flat at 4.26% in June: Barclays",
    "RBI group says gains from including govt bonds in global indices outweigh risks",
    "Recession odds fall, a bit",
    "Tribal communities in Northeast need not worry about Uniform Civil Code, says BJP leader",
    "Delhi court summons Rajasthan CM Ashok Gehlot in defamation complaint by union minister",
    "Congress appoints Kanhaiya Kumar as AICC in-charge of students' wing",
    "Motisons_Jewellers_Limited_Addendum_to_DRHP",
    "Muthoot_Microfin_Limited_DRHP",
    "AKME_Fintrade_(India)_Limited_DRHP",
    "Which is the best day of the month to invest in an SIP?",
    "Edelweiss MF to merge ETF-Nifty Bank with Nifty Largemidcap 250 Index Fund; focus on index funds",
    "Bond market teaches you why even a single basis point matters a lot: A Balasubramanian",
    "Smart investing: When exactly should you invest in a Focused Fund scheme?",
    "Microcaps can be multibaggers, but it’s a ‘chakravyuh’. Here’s a plan",
    "Majority of insurance-buyers find products & processes to be complex: Policybazaar study",
    "Plum Insurance forays into business insurance space, targets startups and SMEs",
    "Critical illness standalone covers or riders: Which one to pick?",
    "Regulations on How Insurance Companies Should Value Each Bike Component After Depreciation",
    "Life and health insurance policies welcome LGBTQ community, but not all is rosy, just yet",
    "Maha government's flagship health insurance scheme to cover all: CM Shinde",
    "How to avoid disappointment when making an insurance claim | Simply Save",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "SBI Mutual Fund to accept investments in SBI International Access–US Equity FOF",
    "AMFI reclassification: Smallcap stocks that got upgraded to midcaps. Do you own them?",
    "Win for the unitholder is a win for the shareholder: Navneet Munot of HDFC MF",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Know which is a better tax saving option",
    "ITR Filing: Handy tips for those filing returns for the first time",
    "Filing ITR for crypto gains? Here’s what you need to know | Simply Save",
    "ITR Filing: All you need to know about how to account for income from house property",
    "ITR filing for FY 2022-23: 28 days left, check these changes in income tax return forms",
    "MC Explains: How to get your capital gains statement for MF investments",
    "ITR filing: Mind the disclosures while filing tax returns to keep taxman at bay",
    "CBRE launches development solutions platform for better project management",
    "Tata Communications leases office space to Hinduja Realty in Bandra Kurla Complex in Mumbai",
    "Industrial and warehousing sector touches 22.4 million sq ft of leasing in H1 2023, up 7%: Savills",
    "Land acquisition for third phase of Noida airport to start from September-end",
    "Embassy Group to launch 4 million sq ft of residential portfolio, eyes Rs 3,300 cr revenue",
    "Gold slips as strong US data fuels Fed rate-hike bets",
    "Gold slips as US dollar, yields rise after Fed minutes",
    "Gold rangebound in cautious trading ahead of Fed meet minutes",
    "Gold firms as traders hunker down for Fed cues",
    "Gold futures quiet, cues from Fed minutes awaited: Track latest prices",
    "Gold advances on weaker US economic cues",
    "Gold slips as stronger dollar, rate hike expectations dent appeal",
    "Betting on farm futures is not equivalent to gambling",
    "Is NPS the best retirement planning tool?",
    "Seeking higher EPS pension? You have till July 11 now to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Banks education loan increases 18.3% after demand returns as pandemic ebbs",
    "HDFC-HDFC Bank Merger: All you need to know about its impact on home loan customers",
    "Financial Stability Report: Write-offs improved asset quality",
    "Personal Finance: Prepaying your home loan early on can save you lakhs",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "RBI‘s circular on issuance of cards a win for customers, say experts",
    "Visa says co-branding offers opportunities for new categories to emerge",
    "Government flip flop on TCS confounds credit card holders",
    "TCS of 20% on credit cards put on hold, forex cards get Rs 7-lakh exemption",
    "When should you upgrade your credit card?",
    "Free lounge visit, air miles is fine. But how do credit cards make money?",
    "Making UPI payments via RuPay credit cards: Is it worth it?",
    "Credit card bad debt doubles to 18% for state-run banks: RBI Financial Stability Report",
    "Trade Spotlight | Your trading plan for Aegis Logistics, BHEL, Asahi India Glass today",
    "Trade Spotlight | How to trade in KEC International, Aster DM Healthcare, Bajaj Finance",
    "Hot Stocks | Ganesh Housing, J&amp;K Bank, Hero MotoCorp may deliver double-digit returns",
    "Cera Sanitaryware – Why the caution despite stupendous growth?",
    "Daily Voice | Mihir Vora of Max Life explains why this sector is a structural long term play",
    "Vaswani Ind closes above 50-Day Moving Average of 20.99 today.",
    "Shree Digvijay Cement Company",
    "Shree Digvijay closes above 50-Day Moving Average of 79.76 today.",
    "Atul closes above 50-Day Moving Average of 6844.24 today.",
    "Nahar Spinning closes above 30-Day,200-Day Moving Average today.",
    "Shree Renuka closes above 30-Day Moving Average of 43.40 today.",
    "Beardsell closes above 50-Day Moving Average of 26.77 today.",
    "Asian Hotel (E) closes above 30-Day Moving Average of 122.54 today.",
    "Set SMS alerts for market news",
    "The success of PM PRANAM depends on reducing urea usage by farmers",
    "Moneycontrol Pro Panorama | Tech gets wings",
    "The Pawar war suits BJP but has it bitten off more than can be chewed?",
    "Taking Stock: Up, up and away. Sensex gains 340 points, Nifty conquers 19,500",
    "Sebi looking to mandate FPIs to use RFQ platform for 10% of secondary transactions",
    "Oil dips as China demand fears offset tighter supply outlook",
    "Hold Multi Commodity Exchange of India; target of Rs 1430: ICICI Securities",
    "Samvardhana Motherson’s acquisitions keep it on path to achieve ‘challenging’ Vision 2025 goals",
    "Gainers & Losers: 10 stocks that moved the most on July 6",
    "Agri Picks Report July 06, 2023: Geojit",
    "Agri Picks Report July 05, 2023: Geojit",
    "Policy Next_MSME-Growth Series: How is Leadership & Communication important for MSMEs to grow?",
    "Funding winter hurts! India unicorn employee addition falls to fifth",
    "See More Top Companies in India",
    "JSW Steel to enter Sensex, FOMC minutes & stocks to watch | Market Minutes",
    "The New B2C: Business to Climate | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]