[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Tata Power INE245A01021, TATAPOWER, 500400",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18755.90\n\n+39.75 (+0.21%)",
    "Sensex\n\n63228.51\n\n+85.35 (+0.14%)",
    "Realme co-founder Madhav Sheth quits",
    "US lawmakers seek new law to protect TikTok user information",
    "RBI's Shaktikanta Das given 'Governor of the Year' award in London",
    "Fed keeps rates unchanged for first time in 15 months",
    "Bain Capital to sell stake up to $267 million in Axis Bank via block deal: Sources",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "After 1 year, the momentum in this Nifty index is finally turning bullish!",
    "Decoding FD Laddering I Benefits of Multiple Smaller FDs over a big one? | Watch",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "Kylian Mbappe Rejects Contract Renewal With PSG Shortly After Messi’s Exit",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "Flipkart, PhonePe could be $100 billion businesses in India: Walmart",
    "Go First's insolvency plea: Central Bank of India, 3 other lessors approach NCLT",
    "What does HNI-meter say about investing in equities?",
    "Jefferies predicts significant domestic earnings growth slowdown in F24",
    "Sebi impounds over Rs 12 crore from 3 unregistered advisory services",
    "Centre discontinues sale of rice, wheat under OMSS to states to check price rise",
    "Bengaluru start-up, Shroff eye hospital develop ‘bioengineered cornea’, to seek nod for trials",
    "EPFO announces formula for calculating higher pension on actual salary",
    "SBI Chairman Dinesh Khara took home Rs 37 lakh annual salary in FY23",
    "Cyclone Biparjoy Updates: Indian Navy on standby in view of approaching cyclone Biparjoy",
    "Manipur Violence: Official residence of industry minister Nemcha Kipgen set on fire in Imphal West",
    "Belarus starts taking delivery of Russian nuclear weapons, says President Lukashenko",
    "Scores drown, countless missing in migrant shipwreck off Greece",
    "5 earthquakes hit Jammu region in a day, educational institutes shut",
    "Delhi Police likely to file charge sheet on Thursday in Brij Bhushan Singh case: Officials",
    "Lightspeed-backed Frontrow mulls sale or shutdown, months after layoffs, restart",
    "Small footwear companies given up to one year to implement quality controls: Piyush Goyal",
    "Why Supreme Court upheld the ban on bike taxis in Delhi?",
    "Zoho to take on OpenAI, Google with new AI model, Sridhar Vembu overseeing project",
    "India's potential drone deal under spotlight: All about the MQ-9B SeaGuardian",
    "Hungry Swiggy agent walked 3 km to deliver order. How his luck changed after that",
    "Production-ready Innova Hycross-based Maruti Suzuki MPV spied",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "‘Dinner leke aagaye’: Swiggy delivers food at 'Mannat' after Shah Rukh Khan's Twitter banter",
    "Cyclone Biparjoy LIVE Updates: Sea remains turbulent under the impact of Biparjoy",
    "How investor Shankar Sharma, 60, managed to get the body of a man in mid-40s",
    "Bengaluru | MNC employee asked to resign, makes hoax bomb threat; held",
    "Man earns Rs 1.5 lakh per month, opts to pay family bills over buying Apple products",
    "Closing Bell: Sensex gains, Nifty at 18,750; metals shine",
    "India set to lose 6,500 millionaires in 2023: report",
    "Traders in Nepal stop importing onions, vegetables from India after govt slaps 13% VAT",
    "RIL's new energy business will be 10x by 2050, says Bernstein",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Volvo unveils C40 Recharge EV SUV for India; to be launched in August",
    "In 5 charts: How China’s sputtering recovery is hurting crude prices",
    "Ashneer Grover's birthday greeting from wife Madhuri Jain: 'You look younger than ever'",
    "21-year-old influencer dies at Chinese weight loss camp trying to lose 90 kg",
    "Chinese people are eating 'white people food' in latest trend: 'lunch of suffering'",
    "How Rhea Chakraborty, others remembered Sushant Singh Rajput on his death anniversary",
    "Advance / Decline (NSE) \n\n1086974",
    "Intentionally in some blogs again spread the rumor of jp morgan previo...",
    "Uski wjh se fall hobraha ud83dude02",
    "Good morning soma holders very soon soma stock not available in market...",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Donald Trump can still run for White House in 2024 even if convicted",
    "Explainer: Why are other automakers chasing Tesla's 'Gigacasting'?",
    "How to tap the competitive advantage of being ‘bad’",
    "Gainers & Losers: 10 stocks that moved the most on June 14",
    "Zurich Insurance eyes $400 million stake in general insurance arm of India's Kotak",
    "Fed keeps rates unchanged for first time in 15 months but signals 2 more potential hikes this year",
    "India's May WPI inflation at -3.48%, lowest in seven-and-a-half years",
    "Developing countries have hit the financial rocks",
    "TRS will now be called BRS in Lok Sabha",
    "Kenya is poised to become the ‘Singapore of Africa’",
    "Opposition parties least concerned about development, grabbing power their sole agenda: JP Nadda",
    "Crayons_Advertising_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Western_Carriers_(India)_Limited_DRHP",
    "Valiant_Laboratories_Limited_DRHP",
    "Moneycontrol Selects: Top stories this evening",
    "Explainer: How SEBI’s norms on execution-only platforms will impact investors",
    "More AMCs make a beeline for Multi Asset Allocation Funds",
    "Mutual funds may not get holdings waiver post HDFC Bank - HDFC merger: Report",
    "Inflation down: But does that mean rates will be cut soon?",
    "SEBI issues regulations for execution-only platforms for direct mutual fund schemes",
    "Why have MFs fallen in love with Mankind Pharma just a month since its listing?",
    "How LIC Mutual Fund's chief executive plans to turn the tortoise into a hare",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Has the time come for credit risk funds again? Yes, says R Sivakumar of Axis MF",
    "Mutual funds lose Rs 342 cr in just two sessions as bears plunder IEX shares",
    "HDFC Defence Fund to stop lumpsum investments and new STPs, restricts SIPs to Rs 10,000",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "PAN-Aadhaar linking: Link your PAN and Aadhaar by June 30 to avoid PAN deactivation",
    "Gurugram administration may pick 15 critical condominiums for structural audit next week",
    "Greater Noida Authority puts 13 data centre plots on sale; scheme closes on July 4",
    "Karnataka RERA asks developer to refund amount paid by buyer for unregistered Bengaluru project",
    "Millennials driving demand for Bengaluru's under-Rs 50-lakh homes",
    "Housing prices rise 8% YoY in Q1CY2023: Report",
    "Bengaluru records highest warehousing transactions; secondary markets emerging",
    "Gold down third day ahead of FOMC; track latest prices",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Tata Consumer Products sees strong break out, analysts expect it above Rs 1,000",
    "Hyderabad Industries: Time to build up on the stock, but keep patience",
    "Trade Spotlight | Your game plan for Linde India, Nazara Technologies, REC today",
    "Buy Gokaldas Exports; target of Rs 635: Sharekhan",
    "Visesh Infotech closes below 30-Day,50-Day Moving Average today.",
    "Antarctica closes below 30-Day,50-Day Moving Average today.",
    "Dhanuka Realty closes below 30-Day,50-Day Moving Average today.",
    "Bright Solar closes below 50-Day,200-Day Moving Average today.",
    "Cool Caps closes below 30-Day,50-Day Moving Average today.",
    "Khandwala Sec closes below 150-Day Moving Average of 32.37 today.",
    "Set SMS alerts for market news",
    "For the Fed, doing nothing is the greater risk",
    "Sam Altman’s advice to exempt smaller companies and startups from AI regulation is problematic ​",
    "Taking Stock: Market ends marginally higher ahead of Fed outcome; metals outshine",
    "Buy Transport Corporation of India; target of Rs 860: Sharekhan",
    "Agri Picks Report June 14, 2023: Geojit",
    "Oil prices dip after unexpected rise in US crude stocks",
    "Yulu eyes expansion as it closes in on profitability",
    "Indifi Technologies raises $35 million in Series E round led by ICICI Venture",
    "Enhancing Shareholder Value: Startups should plan their transfer pricing policies well",
    "See More Top Companies in India",
    "Wall Street at new 2023 high, India inflation cools & AMC stocks in focus | Market Minutes",
    "Block deal in Go Fashion, key Nifty levels to watch out for & more | Market Minutes",
    "ESG or non-ESG funds: Which scheme to pick? | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]