[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Coal India INE522F01014, COALINDIA, 533278",
    "Apple US0378331005, AAPL:US",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18487.75\n\n-46.65 (-0.25%)",
    "Sensex\n\n62428.54\n\n-193.70 (-0.31%)",
    "Shareholders to take call on listing: Future Generali India MD",
    "Ashok Leyland total sales fall to 13,134 units in May",
    "Amarendu Prakash takes over as SAIL Chairman",
    "Greater Noida Authority asks to cancel plot allotments of 50 defaulters",
    "Coal India OFS: What should investors do?",
    "CIL OFS: Institutions submit bids worth Rs 6,500 crore; govt exercises green shoe option",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "NBFC-MFIs' assets under management to see up to 30% growth in FY24: Crisil",
    "India Q4 GDP grows 6.1% | Blowout GDP growth: Inside the India growth story",
    "Nvidia first US chipmaker valued at $1 trillion: CEO Huang talks about failures on his journey",
    "Should You Sell Your Mutual Funds Now? What All You Should Take Into Account Before Selling MFs?",
    "Watch: Right time to buy real estate stocks? Inventories down, prices up, shows Jefferies' report",
    "5 Things You Must Remember To Do If You're Switching Jobs: Watch!",
    "Zerodha's Nikhil Kamath is worried about 'Friendship Recession': Here is what it means",
    "LIC’s transfer of funds to shareholders’ fund – is it a one-off event?",
    "Gujarat firm gets notice for contamination probe after eye infections reported",
    "GST collections in May cross Rs 1.57 lakh crore, up 12% YoY",
    "NSE, BSE remove Adani Enterprises from short-term ASM framework",
    "Government interviews candidates for RBI deputy governor position",
    "NCERT drops chapters on democracy, periodic table from class 10 textbooks",
    "Green fixed deposit norms kick in from June 1. Here’s what you need to know",
    "Info Edge initiates forensic audit into Rahul Yadav's startup 4B Networks",
    "Foxconn to manufacture 2 crore mobiles a year at its Bengaluru facility",
    "MS Dhoni successfully undergoes knee surgery in Mumbai",
    "News Highlights: 83% Indians would delegate as much work as possible to AI: Microsoft report",
    "Maharashtra plans Rs 95,000 cr outlay for Mumbai, Navi Mumbai as data centre hub",
    "Ola's Bhavish Aggarwal to enter AI space, registers new company",
    "Car sales continue on uphill drive in May",
    "What is Sustainable Aviation Fuel and how does it help India’s green journey?",
    "Coal prices plummet to lowest levels since July 2021",
    "Delhi High Court reserves judgment on Go First aircraft deregistration case",
    "Maharashtra junks 15-year cap on women selling property to “non-female” buyers",
    "Singapore overtakes Hong Kong as most expensive Asia-Pacific city to buy or rent homes",
    "Amid surge in airfares, civil aviation ministry analyses routes impacted by Go First crisis",
    "74% Indian workers worried about AI replacing them: Microsoft report",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with technical analysis, research advice, and insights",
    "MS Dhoni set to be admitted in hospital after winning IPL with CSK",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "Bengaluru: Gusty winds tear beams, panels off Rs 314-crore Visvesvaraya Terminal. Watch",
    "‘Indigo ki audacity’: Founder's rant after Rs 21,000-ticket to Ahmedabad",
    "MC Exclusive: PR Sundar, Mangaiyarkarasi Sundar found to have two DINs, in violation of law",
    "Mumbai Police bans public gatherings till June 11. Find out what’s allowed and what’s not allowed",
    "Closing Bell: Nifty ends below 18,500, Sensex down 194 pts; realty outperform",
    "Simple One electric scooter launched at a starting price of Rs 1.45 lakh: See Pics",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In Pics: Here’s a low-down on US’ debt ceiling crisis and what happens to the bill now",
    "Man fired for spending 6 hours a shift in toilet: 'It’s like being paid to use the loo'",
    "'Mock alien signal' sent from Mars to Earth for first time and you can try to decode it",
    "Why is Pride Month celebrated in June? All about its history, significance and impact",
    "Over 500 MBBS doctors compete for 20 jobs: Pic of crowd at Delhi's GTB hospital is viral",
    "Ashneer Grover on BharatPe co-founder Bhavik Koladiya's apology after abusive call: 'I wish...'",
    "Advance / Decline (NSE) \n\n1249798",
    "Not rock, it will be rocket...",
    "Rvnl will soon get the 18000 crore kazakhstan railway contract soon as...",
    "I belive nfl can touch 120 on some romerss ? sand can toch 150 on news...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Russia fines WhatsApp for first time for not deleting banned content",
    "Amazon's Ring used to spy on customers, FTC says in privacy settlement",
    "Reliance's operating performance to remain resilient: S&P",
    "Hyundai Motor sales in May rises 16% to 59,601 units",
    "Byju’s lenders scrap talks to restructure $1.2 billion loan",
    "India's economy likely to grow in 6.5-6.7% range in FY'24: CII President R Dinesh",
    "Investment more than consumption leading India's economic growth: Economists",
    "India’s hunger for Russian oil crowds out the Saudis",
    "GDP figure exposes lies of Rahul Gandhi's 'market of hate' against India's development: BJP",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Your first salary should be where your investment journey begins",
    "Can arbitrage funds sustain the momentum?",
    "B30 AUM in mutual funds grew higher than T30’s",
    "8 money changes to watch out for in June",
    "SEBI nudges AMFI to form ethics committee to catch bad apples in time",
    "Parag Parikh Flexi Cap Fund: So far, so good. But can it do an encore?",
    "Future Generali India launches health insurance policy with multiple optional covers",
    "ULIPs back in focus after debt mutual funds taxation; But do they make sense?",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "From Rs 40 trillion to Rs 100 trillion: How SEBI wants mutual funds to chart the way forward",
    "MF industry safe, but Sebi will step in if self-regulation isn't strong: Madhabi Puri Buch",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: What is Form-16? All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Watch For This While Buying Property, So That Selling It Later Is Easy | Real Estate",
    "Flex workspace provider WeWork adds over 3,600 desks in Bengaluru",
    "Electric vehicle makers require 13 mn sq ft real estate space by 2030 to meet output target: CBRE",
    "Developers' body requests Centre to restructure GST on MMR redevelopment projects",
    "US commercial real estate to be in meltdown, warns Elon Musk",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Moneycontrol Daily: Your Essential 7",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "KPIT Technologies hits a new high with a decisive breakout. What should you do?",
    "Trade Spotlight | How to trade in PI Industries, Dixon Technologies, CDSL today",
    "Trade Spotlight | Your strategy for India Cements, Birla Corporation, Orient Electric today",
    "Hot Stocks | Dreamfolks Services, Sundram Fasteners, RBL Bank may deliver up to 12% in short term",
    "No stress in BFSI, NBFC shares to catch up with rest of market: Mahesh Patil",
    "Daily Voice | Rate cuts will happen later than when markets are expecting, says this fund manager",
    "Railtel Corporation of India",
    "Railtel closes above 30-Day Moving Average of 118.33 today.",
    "Star Paper closes above 150-Day Moving Average of 178.07 today.",
    "Godrej Agrovet closes above 30-Day Moving Average of 430.41 today.",
    "Euro Panel closes below 30-Day Moving Average of 123.10 today.",
    "GMM Pfaudler closes below 30-Day Moving Average of 1470.10 today.",
    "Coral India Finance and Housing",
    "Coral India Fin closes above 50-Day Moving Average of 31.79 today.",
    "Tainwala Chemicals and Plastics (India)",
    "Tainwala Chem closes below 30-Day,50-Day Moving Average today.",
    "Set SMS alerts for market news",
    "Q4 GDP: Robust growth to keep rate cuts at bay",
    "Firm prices of roughs and weak demand to keep Indian diamond exports dull",
    "For the GSLV programme, reliability and lifting heavier satellites remain key challenges",
    "Taking Stock: Last-hour selling drags market down; Sensex falls 194 points, Nifty below 18,500",
    "Agri Picks Report June 01, 2023: Geojit",
    "Hold Torrent Pharmaceuticals; target of Rs 1910: Sharekhan",
    "Buy Prestige Estates; target of Rs 630: HDFC Securities",
    "Oil falls after large surprise build in US crude stocks",
    "Dollar At Seven-Week High | US Economic Data Reflects Strength | Commodities Live",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "India's Q4 GDP surprise, Coal India OFS & grey market sentiment check | Market Minutes",
    "Want your bank locker to be safer? Don’t ignore the new locker agreement | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]