[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Infosys INE009A01021, INFY, 500209",
    "Apple US0378331005, AAPL:US",
    "Vedanta INE205A01025, VEDL, 500295",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18398.85\n\n0.00 (0.00%)",
    "Sensex\n\n62345.71\n\n0.00 (0.00%)",
    "Wall Street advances, Treasury yields rise as debt-ceiling debate rolls along",
    "Siddaramaiah outpaces Shivakumar as the likely CM of Karnataka: Sources",
    "NSE launches WTI crude oil and natural gas futures contracts",
    "Microsoft wins EU antitrust nod for Activision deal, after UK veto",
    "Haryana raises rebate on property tax payments from 10% to 30% till July 31",
    "Top 10 things to know before the market opens today",
    "CCL Products, Mastek, Apollo Hospitals can fetch double-digit returns in short term",
    "How to trade in EPL, Godrej Properties, Zensar Technologies today",
    "US debt ceiling crisis, NSE Q4 results, PVR-Inox's loss & more | Market Minutes",
    "BSE MD & CEO Sundararaman Ramamurthy exclusive on Sensex, Bankex F&O relaunch",
    "\"BharatPe is a $3 bn write-off\" Ashneer Grover hits back l Ashneer Grover's reaction to EOW's FIR",
    "Stock of The Day: Home First Finance | What makes it a preferred bet in housing finance space?",
    "Watch: Reasons for disparity in GST collection among different states",
    "Karnataka Election 2023: Can Congress Deliver On Promises Made In Manifesto?",
    "Why PM Modi’s state visit to the US is especially significant this time | Explained",
    "Buzzing Stocks: HDFC Bank, Pfizer, Bharti Airtel, UltraTech Cement, others in focus",
    "Berger Paints Q4 profit drops 16%: What should investors do now?",
    "US-based Baron Capital marks down Swiggy’s fair value by 34% after Invesco double blow",
    "PVR Inox net loss more than triples to Rs 333.37 crore in Q4",
    "China April industrial output rises 5.6%, retail sales jump 18.4%; below forecast",
    "US on track for June 1 default without debt ceiling hike, Treasury says",
    "Windfall tax on crude oil down to nil from Rs 4,100 per tonne",
    "Mirror, mirror on the wall, does the Nifty @ 18,400 have it all?",
    "Karnataka News LIVE Updates: Congress to choose CM by evening",
    "Morning Scan: All the big stories to get you started for the day",
    "Massive $202 million jewellery auctions set world record in Geneva",
    "Govt weighs 'unique code' for economic offenders with links to PAN, Aadhaar",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Indian carmakers back zero duty on limited British imports under trade deal",
    "OpenAI readies new open-source AI model",
    "SAP and Microsoft to deepen collaboration on generative AI in recruiting",
    "ZestMoney founders call it quits 2 months after PhonePe deal falls through",
    "Warren Buffett sheds stake in TSMC, while Macquarie, Fidelity buy shares",
    "Elon Musk documents subpoenaed in Jeffrey Epstein lawsuit by US Virgin Islands",
    "Tesla to make significant investments in France at some point: Elon Musk",
    "Outgoing Puma India MD Abhishek Ganguly raises Rs 430 crore for his startup",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Newsletter with commodity research advice and market analysis",
    "‘Are you joking?’ Sudha Murty's 10 Downing Street address stuns UK immigration officer",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "Indigo’s mother-daughter cabin crew duo wins the internet. Watch",
    "PVR Inox to shut down over 50 theatres in the next six months",
    "Karnataka News Highlights: Congress to choose CM candidate by Tuesday evening",
    "Stock Market Today: Top 10 things to know before the market opens",
    "Google reveals its first foldable phone Pixel Fold",
    "NSE Q4 profit up 31% at Rs 2,067 crore, board recommends dividend of Rs 80 per share",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Five things you need to know before you buy the MG Comet: See Pics",
    "US truck driver's big lottery win will give him $1000 payouts every week for life",
    "Robots could control humanity, AI company founder rings warning bells",
    "What Elon Musk said about Indian food",
    "How Apple Watch's Fall Detection saved 2 people in the US",
    "Advance / Decline (NSE) \n\n1105950",
    "Let us see whether rs. 1150/- is possible on the board.",
    "Principal deputy spokesperson for the us department of state, vedant p...",
    "Nifty views posted by so many boarders here in clik to q.options.22.34...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "China April industrial output rises 5.6%, retail sales jump 18.4%; below expectations",
    "SVB’s former CEO says Fed, social media contributed to bank’s collapse",
    "Stan Druckenmiller, David Tepper lead family offices betting on AI",
    "Live News Updates: At least 6 dead, 700 injured as powerful cyclone Mocha floods homes in Myanmar",
    "DMCC to launch flagship office in Mumbai to develop India-UAE trade to ‘next level’",
    "Markets talk, are we listening?",
    "India needs to balance conflicting interests as it designs an emission trading system",
    "India’s Cannes pavilion to be based on Saraswati Yantra",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "Ultra short duration funds: Riding rising rates",
    "Why debt mutual funds are still relevant and investment-worthy",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Bajaj Finance FD offers high interest rates, but is it still a good choice?",
    "Here are sectors that smallcap mutual funds category love to hold",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Mumbai outperforms Bengaluru, Delhi on list of global prime cities index in Q1 2023: Report",
    "Real estate stocks dance to DLF stellar show, Nifty Realty zooms 4%",
    "Noida Authority forms panel to finalise structural safety audit charges",
    "Welspun One Logistics Parks raises Rs 500 crore AIF from HNIs, domestic investors",
    "Sebi weighs rules to regulate portals offering fractional ownership of realty assets",
    "SEBI to regulate platforms offering fractional ownership of real estate assets",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Trade Spotlight | How to trade in EPL, Godrej Properties, Zensar Technologies today",
    "Hot Stocks | CCL Products, Mastek, Apollo Hospitals can fetch double-digit returns in short term",
    "Top 10 trading ideas for next 3-4 weeks as Nifty may scale higher despite consolidation",
    "Trade Spotlight | Your game plan for Kajaria Ceramics, Chalet Hotels, Intellect Design Arena today",
    "Hot Stocks | Bet on Jubilant Pharmova, Engineers India, Container Corp for short term",
    "Daily Voice | This research head sees smallcap as a good space to invest in",
    "United Polyfab  Standalone March 2023 Net Sales at Rs 179.62 crore, up 3.97% Y-o-Y",
    "Hemkunta Ind Standalone March 2023 Net Sales at Rs 0.01 crore, down 91.35% Y-o-Y",
    "Procter&Gamble Standalone March 2023 Net Sales at Rs 320.92 crore, up 19.83% Y-o-Y",
    "Jayshree Chem Standalone March 2023 Net Sales at Rs 2.78 crore, up 21.93% Y-o-Y",
    "Aaron Industrie Standalone March 2023 Net Sales at Rs 16.06 crore, up 23.34% Y-o-Y",
    "The Byke Hosp Standalone March 2023 Net Sales at Rs 26.80 crore, down 19.01% Y-o-Y",
    "LGB Forge Standalone March 2023 Net Sales at Rs 32.39 crore, up 0.67% Y-o-Y",
    "Set SMS alerts for market news",
    "Marketing Musings: Will the iconic Cola Wars return in new avatars?",
    "Market LIVE Updates: Indices likely to open higher amid positive global cues; SGX trades firm",
    "Oil prices rise as tight supplies compete with economic concerns",
    "Learning to live with the ups and downs of startups",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Momentum still strong, earnings season has been a big surprise | The Week on Dalal Street",
    "Science of matching skills with jobs | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]