[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Larsen INE018A01030, LT, 500510",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18314.80\n\n+17.80 (+0.10%)",
    "Sensex\n\n62027.90\n\n+123.38 (+0.20%)",
    "UBS chief pledges '360-degree' probe into Credit Suisse",
    "Dish TV posts Q4 net loss at Rs 1,720.62 cr, revenue down 21.45% to Rs 504.8 cr",
    "Rail strikes in Britain disrupt services amid wage dispute standoff",
    "Delhi Police records statement of WFI chief Brij Bhushan Sharan Singh",
    "Karnataka Election Results 2023 Live: Will exit polls get it right or a surprise is in store?",
    "With most exit polls pointing to a cliffhanger in Karnataka, parties face a tense wait to May 13",
    "‘Go First trying to hold on to assets they don’t own’, aircraft lessors tell NCLAT",
    "Tata Motors hikes capex by about 27% to Rs 38,000 crore for JLR and PV business",
    "Watch: Reasons for disparity in GST collection among different states",
    "Proposal to ban diesel cars by 2027: What’s the need? Central Govt yet to accept the suggestion",
    "Explained | Delhi vs Centre: Impact of Supreme Court verdict on LG vs Kejriwal",
    "Why PM Modi’s state visit to the US is especially significant this time | Explained",
    "Cyclone Mocha: How Are Cyclones Named? | When Will Cyclone Mocha Make Landfall?",
    "Lenders not to fund Go First before resolution, says top banking official",
    "Byju’s raises $250 mn from Davidson Kempner via structured instruments",
    "“We will not fire anyone because…”: Zerodha CEO announces AI policy",
    "SEBI imposes Rs 1.9 crore fine on former Karvy officials for violations",
    "Twitter appoints former NBCUniversal ad chief Linda Yaccarino as new CEO",
    "Govt tells CERC to consult Power Ministry before issuing any regulation from now",
    "GST e-invoicing | Exempt small firms from oversights for at least one year, say stakeholders",
    "Govt unlikely to invite EoIs for Concor soon as internal processes still pending",
    "Investment advisors say advertisement code restrictive, seek more clarity",
    "News Highlights: Linda Yaccarino is new Twitter CEO, announces Elon Musk",
    "This AI start-up CEO skipped traditional fundraising, rejected 61 investors to raise $12 million",
    "Karnataka Election 2023 Updates: Counting across 36 centres to decide fate of 2,615 candidates",
    "Amazon, Flipkart, Meesho ordered to stop selling seat belt alarm stopper clips",
    "How Zomato-backed Magicpin is going all out on its ONDC bet",
    "CCI to inquire whether Google’s user choice billing policy violates its order",
    "RBI launches ‘100 Days 100 Pays’ campaign for return of unclaimed deposits",
    "Landlords cannot hike rents for unregistered rental properties: Karnataka HC",
    "Mocha intensifies into ‘very severe’ cyclonic storm, IMD issues alert for farmers, fishermen",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Inside Rakesh Jhunjhunwala’s sprawling 14-storey Mumbai bungalow. Watch",
    "Pakistani actor wants to file complaint against PM Modi. See Delhi Police's hilarious response",
    "BharatPe is a $3 billion write-off, value destroyed by Rajnish Kumar: Ashneer Grover",
    "McDonald’s food causes second-degree burns in 4-year-old, parents file case",
    "Closing Bell: Sensex up 123 points, Nifty above 18,330; M&amp;M, IndusInd, Axis Bank top gainers",
    "Google reveals its first foldable phone Pixel Fold",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "CBSE Class 12 and Class 10 results declared, girls outshine boys",
    "Ola driver robbed by cab riders near Gurgaon railway station",
    "2 killed by tuskers, 4 elephants electrocuted in Andhra Pradesh",
    "First 'three-parent baby' born in the UK through pioneering IVF procedure",
    "Why 82-year-old man kept father's dead body in freezer for 18 months",
    "Advance / Decline (NSE) \n\n8511163",
    "Always try not to s.options.22.34.886838.me trade blind s.options.22.3...",
    "More the people, more the s.options.22.34.886838.me views of stocks,, ...",
    "Kirit parikh commitee has done a lot of good for this company in terms...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "25 years of Google Search: Will the tech giant hit the reset button amid rise in AI? Take a look",
    "China regulator says Tesla to update software of more than 1 million cars",
    "Turkey Elections: Here's a look at the key players",
    "TP Saurya, Tata Power Trading Company ink pact to set up 200 MW solar project in Rajasthan",
    "Sundaram Home Finance confident of continuing growth: MD Lakshminarayanan Duraiswamy",
    "India has huge sales potential: Boeing",
    "IIP growth falls to 5-month low of 1.1% in March on poor manufacturing performance",
    "April CPI inflation crashes to 18-month low of 4.7% due to favourable base",
    "Live: PM Modi launches projects worth over Rs 4,000 crore in Gujarat",
    "Speaker must decide on disqualification of 16 MLAs at the earliest: Uddhav Thackeray",
    "Shiv Sena Judgment: Slap on the wrist but with lessons for the future",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Got Rs 10 lakh to invest? Kotak AMC’s Harish Krishnan shares strategy for retail investors",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How is MF expense ratio calculated?",
    "Why short duration funds are all weather funds",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Greater Noida builders told to register 4,000 flats or face regulatory action",
    "Maharashtra govt may offer deemed conveyance to housing societies without land ownership",
    "Highways and metros make peripheral localities hotspots for aspirational lifestyle",
    "Foreign investments account for 81% of real-estate investments in 2017- 22: Report",
    "Gurugram Global City: Tepid bidder response forces e-auction delay by a month",
    "SC gives go-ahead to resolution plan submitted by Supertech before insolvency court",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Gold \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "SRF: Chemicals continue to shine, but all priced in",
    "Nazara Technologies: Blockbuster end to the year",
    "Trade Spotlight | Your trade for Cyient, Jubilant Pharmova, Engineers India today",
    "MC Interview | Don't expect shortage of coal, imports will continue to increase: Coal Secretary",
    "KM Sugar Mills closes below 30-Day Moving Average of 28.11 today.",
    "Gujarat Gas closes below  its 50-Day,150-Day,200-Day Moving Average today.",
    "Jubilant Pharmo closes below 200-Day Moving Average of 341.56 today.",
    "Vedanta closes below 30-Day,50-Day Moving Average today.",
    "DCB Bank closes below 150-Day Moving Average of 114.42 today.",
    "Lypsa Gems closes below 30-Day Moving Average of 4.36 today.",
    "EID Parry closes below 50-Day Moving Average of 501.34 today.",
    "Set SMS alerts for market news",
    "The Reading List: May 12, 2023",
    "Why OPEC needs oil prices to stay elevated",
    "Moneycontrol Pro Panorama | Inflation is easing, or is it?",
    "Fininfluencers: Reining them in takes some effort but SEBI has the long arm to crack the whip",
    "Taking Stock: Another dull day for markets, Sensex, Nifty close mixed",
    "Moneycontrol Selects: Top stories this afternoon",
    "Buy Birla Corporation; target of Rs 1290: Motilal Oswal",
    "Buy Mahanagar Gas; target of Rs 1250: Motilal Oswal",
    "Buy Craftsman Automation; target of Rs 3950: Motilal Oswal",
    "Agri Picks Report May 12,2023: Geojit",
    "Oil prices recover on short-covering, US debt ceiling fears weigh",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "Momentum till strong, earnings season has been a big surprise | The Week on Dalal Street",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "MSCI rejig, Asian Paints, Eicher Motors & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]