[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Apple US0378331005, AAPL:US",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18534.10\n\n+46.35 (+0.25%)",
    "Sensex\n\n62547.11\n\n+118.57 (+0.19%)",
    "Full list of trains cancelled after Coromandel Express tragedy",
    "UK PM Rishi Sunak planning global AI watchdog: Report",
    "Ashok Leyland total sales fall to 13,134 units in May",
    "Amarendu Prakash takes over as SAIL Chairman",
    "Odisha Triple Train Tragedy Live Updates: Those found responsible will be punished, says PM Modi",
    "Initial probe suggests Coromandel Express entered loop line instead of main line, hit goods train",
    "Railway Minister Ashwini Vaishnaw promises independent probe into the tragedy",
    "A survivor recounts the horror of Odisha triple train crash: ‘bloodbath on tracks’",
    "Need To Take Measures Against Terror Financing And Propaganda: Jaishankar At BRICS Meeting",
    "Apple WWDC 2023: What To Expect At Apple’s Big Event?",
    "Growth Of Indian Luxury Market: Why Are Global Brands Bullish On Indian Ambassadors?",
    "ITC Vs HUL: How Do The FMCG Majors Fare Post Their Q4 Numbers?",
    "India Focussed On Improving Business Viability: Morgan Stanley MD Ridham Desai's Praises PM Modi",
    "‘Robots Can Control Humans…’: Humanoid Robot Ameca Warns Of ‘Nightmare Scenario’",
    "Govt bans 14 cocktail drugs citing risk to humans; check the list here",
    "NCLT to hear pleas of 3 Go First lessors on June 5",
    "ITC and TCS among top dividend-paying stocks in Asia Pacific: CLSA",
    "IT employee union NITES approaches Labour Ministry against HCLTech on HR policy update",
    "Last of the summer holidays: 11-day itinerary for London and Scotland",
    "Why commercialization of climbing Mt Everest has become a problem of Himalayan proportions",
    "How a 74-year-old Mumbai real estate agent cleared MahaRERA exam",
    "Nifty at 20,000 by December? This Elliott Wave analyst believes so",
    "Kavach explained: How railways' collision prevention system works",
    "Bengaluru man, declared brain dead, gives life to 5 others",
    "Anand Mahindra on Odisha train tragedy: ‘apparently Kavach wasn’t installed’",
    "59 MPs write to German ambassador for return of baby girl to India",
    "SC stays Allahabad HC order on examining 'rape' victim's horoscope",
    "Ashneer Grover claims media misreported BharatPe's FY22 report: 'Not one journalist...'",
    "Only in Bengaluru: Landlord invests Rs 8 lakh in tenant’s AI startup",
    "Tata Group plans Rs 13,000-crore lithium-ion cell facility in Gujarat",
    "Biden cheers $31.4-trillion debt ceiling deal, declares from Oval Office: 'Crisis averted'",
    "Bengaluru firm CEO held for cheating 2,000 students of Rs 18 crore in education loan scam",
    "Finfluencers ‘renting’ analyst licences for a fee after Sebi whip on advisory services",
    "India has huge potential for recycling of electronic wastes, says NITI Aayog CEO",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Newsletter with technical analysis, research advice, and insights",
    "Al Pacino, 83, asked pregnant girlfriend for a DNA test to confirm paternity: report",
    "Why companies offer higher salary packages to external hires",
    "NATO’s big gamble in Ukraine has failed",
    "Why Bengaluru's tech corridor, Outer Ring Road, needs an urgent fix",
    "Nvidia's stunning $184 billion surge; Five charts tell the story",
    "In Pics: All about lithium and its use in batteries",
    "RBI imposes Rs 2.20 cr penalty on Indian Overseas Bank for rule violations",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In Pics | PM Modi at Odisha train crash site, takes stock of situation",
    "In Pics | Deadly train crashes in India",
    "Delhi man shares screen during work call - it gets stuck on ‘very embarrassing’ page",
    "Advance / Decline (NSE) \n\n1328729",
    "Sab near phase se darte hai. but bear phase aata hi kab hai 3months or...",
    "A small cap stock giving break out financial results is gmdc limited. ...",
    "In gmdc fiis have increased their holding continuously for the last 5 ...",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Hesitation has been a feature of this trend and the momentum continues to blow in this manner.",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "China objects to NATO labelling it a 'threat': Embassy",
    "Five children’s movies to stream now",
    "As Kyiv reckons with deaths by a shelter, Russia evacuates border towns",
    "In Pics: Here’s what market experts have to say about the investing landscape",
    "HMSI sales fall 7% to 3,29,393 units in May",
    "Moneycontrol Pro Weekender | Are we the champions?",
    "Economists look at FY24 with cautious optimism",
    "What did the economists miss in India’s GDP estimates?",
    "Odisha train tragedy: BJP talks of morality, decency, so Vaishnaw must quit, says Chhattisgarh CM",
    "Pakistani establishment out for vengeance against Imran Khan, plots his political downfall",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Do equity savings funds make sense after the tax hit on debt mutual funds?",
    "Planning to look at MF stock picks last month and play copy cat? Here’s why you shouldn’t",
    "HDFC Mutual Fund sends notice to investors about change of sponsor. What should you do?",
    "Your first salary should be where your investment journey begins",
    "Can arbitrage funds sustain the momentum?",
    "B30 AUM in mutual funds grew higher than T30’s",
    "8 money changes to watch out for in June",
    "Aegon Life launches life insurance covers for surrogate mothers, egg donors",
    "SBI Life to acquire Sahara India's life insurance business: IRDAI",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Future Generali India launches health insurance policy with multiple optional covers",
    "ULIP debt funds back in focus after debt mutual funds taxation. Here’s the top performing funds",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "From Rs 40 trillion to Rs 100 trillion: How SEBI wants mutual funds to chart the way forward",
    "SEBI nudges AMFI to form ethics committee to catch bad apples in time",
    "Link your PAN and Aadhaar by June 30 to prevent PAN deactivation",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "5 things to know about 50% premium waiver for cluster development in Mumbai",
    "DTCP forms teams to conduct inspections of 60 high-rises in Gurugram",
    "Homebuyers of Mahira Homes project stage protest at Jantar Mantar against delay in possession",
    "MC Explains: Bengaluru minister hints at property tax hike; experts say it's time",
    "Property tax waiver for flat owners of up to 500 sq ft flats in Navi Mumbai?",
    "Cut penal interest, other levies from developers' dues to revive projects, says CREDAI chief",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Weekly Tactical Pick – Why this cement stock deserves attention",
    "Trade Spotlight | Your trading plan for RBL Bank, Redington, Apollo Hospitals Enterprises",
    "KPIT Technologies hits a new high with a decisive breakout. What should you do?",
    "Trade Spotlight | How to trade in PI Industries, Dixon Technologies, CDSL today",
    "No stress in BFSI, NBFC shares to catch up with rest of market: Mahesh Patil",
    "Edelweiss Financial Services",
    "Edelweiss closes below  its 30-Day,50-Day,150-Day,200-Day Moving Average today.",
    "Antarctica closes below 30-Day,50-Day Moving Average today.",
    "GOCL Corp closes below 150-Day Moving Average of 327.88 today.",
    "ABM Inter closes below 150-Day Moving Average of 58.55 today.",
    "Ducon Infratech closes below 50-Day Moving Average of 6.95 today.",
    "IRIS Business S closes below 30-Day,200-Day Moving Average today.",
    "Cupid closes below 200-Day Moving Average of 251.37 today.",
    "Set SMS alerts for market news",
    "Lunch with the FT | Sci-fi writer Ted Chiang: ‘The machines we have now are not conscious’",
    "The Reading List: June 2, 2023",
    "Turkey's elections are over but it still hasn't recovered from the earthquakes",
    "Is AI an existential threat? 'Extinction' warning may do more harm than good",
    "Over 80 smallcaps gain up to 40% even as market ends flat for the week",
    "Base metals may get some support from additional Chinese realty initiatives",
    "5-year plan, Mumbai Airport hotel hold key to Lemon Tree's fortunes",
    "Buy S Chand and Company; target of Rs 257: Prabhudas Lilladher",
    "Buy Apollo Hospitals Enterprise; target of Rs 5300: Prabhudas Lilladher",
    "Are Metals Headed For Weekly Increase? | Copper Supported On Low Supply Growth | Commodities Live",
    "Agri Picks Report June 02, 2023: Geojit",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "See More Top Companies in India",
    "FINANCIAL ADVISOR AWARDS THE JURY ROUND",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Will markets cheer 'Thank God It's Friday'? Market Minutes",
    "The Giving Economy | Unusual Suspects",
    "Want your bank locker to be safer? Don’t ignore the new locker agreement | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]