[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Apple US0378331005, AAPL:US",
    "Coal India INE522F01014, COALINDIA, 533278",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18531.70\n\n+43.95 (+0.24%)",
    "Sensex\n\n62553.63\n\n+125.09 (+0.20%)",
    "Banking sector stocks most overrated in India, says Mark Mobius",
    "Ashok Leyland total sales fall to 13,134 units in May",
    "Amarendu Prakash takes over as SAIL Chairman",
    "Greater Noida Authority asks to cancel plot allotments of 50 defaulters",
    "NSE asks brokers to keep tab on clients trading deep out-of-money options",
    "AU Small enters Jefferies' India portfolio, CAMS removed: Chris Wood explains why",
    "Market LIVE Updates: Nifty falls 50 points from high, Sensex up 100 pts; realty, metal outperform",
    "IndiGo to fly direct to 6 new destinations in Africa, Asia",
    "Apple WWDC 2023: What To Expect At Apple’s Big Event?",
    "Growth Of Indian Luxury Market: Why Are Global Brands Bullish On Indian Ambassadors?",
    "ITC Vs HUL: How Do The FMCG Majors Fare Post Their Q4 Numbers?",
    "India Focussed On Improving Business Viability: Morgan Stanley MD Ridham Desai's Praises PM Modi",
    "‘Robots Can Control Humans…’: Humanoid Robot Ameca Warns Of ‘Nightmare Scenario’",
    "Watch For This While Buying Property, So That Selling It Later Is Easy | Real Estate",
    "Know your stock: Why are analysts upbeat on KIMS?",
    "Coal India shares up 1% as May production and sales growth cheers Street",
    "Suzlon falls further 2% on profit booking after steep surge post stellar Q4 numbers",
    "Lemon Tree Hotels: Ready to ride the industry upcycle",
    "India's impressive GDP data has some puzzling elements",
    "ITR: Common errors to avoid while filing income tax return for FY23",
    "Infosys turns ex-dividend, stock falls. Here is how much the Murtys will get",
    "Congress victory in Karnataka complicates opposition unity efforts",
    "ULIP debt funds back in focus after debt MF taxation. Here are top performers",
    "Shankar Sharma likens investing in smallcap stocks to betting on a marathon",
    "How 20% TCS on foreign remittances under LRS can impact overseas spend of Indians",
    "Higher employee costs of Mumbai is better than high attrition rate of Bengaluru: Startup founders",
    "Rajasthan’s free power offer set to worsen its stressed fiscal position",
    "Great Indian resignation: Toxic bosses is top reason for quitting, says report",
    "N Chandrasekaran is a ‘very simple person,’ says UP man who cycled 15 days to meet him",
    "Maharashtra: SSC results declared; overall pass percentage at 93.83",
    "Green fixed deposit norms kick in from June 1. Here’s what you need to know",
    "In Pics | India celebrates 350th anniversary of Chhatrappati Shivaji Maharaj's coronation",
    "Maruti Suzuki Jimny review, first drive - Legacy builds the story",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "Woman’s breakdance in saree is breaking that internet. Watch viral video",
    "Poonawalla Fincorp's Business Loans: The perfect solution for your funding needs",
    "Over 500 MBBS doctors compete for 20 jobs: Pic of crowd at Delhi's GTB hospital is viral",
    "MS Dhoni set to be admitted in hospital after winning IPL with CSK",
    "Bengaluru: Gusty winds tear beams, panels off Rs 314-crore Visvesvaraya Terminal. Watch",
    "Indian dad's demo walk before heading to Chennai railway station has over 2 million views",
    "Road that folds like a carpet? Video of Maharashtra's poor quality road is viral",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Apple plans major retail push with new stores across China, US",
    "Elon Musk’s son asks about police cats, Delhi Police has the best reply",
    "Why Indian employees resign: Toxic bosses, low salary and…",
    "Indian-origin teen Dev Shah wins Spelling Bee 2023. His favourite game is Wordle",
    "Jordan crown prince Hussein weds Saudi architect Rajwa Al Saif in lavish ceremony",
    "Advance / Decline (NSE) \n\n1349693",
    "Kaha se laye bhai ye news ud83dude00ud83dude00ud83dude00",
    "Intraday trades avialbe daily 4 to 5 cals with full guidence just texx...",
    "Exact 16 continuous red candle formed on 3 h chart ...........heavy se...",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "New Tiananmen museum opens in New York ahead of June 4 anniversary",
    "Volkswagen brings VW bus back to North American market after 20 years",
    "In Pics: Apple plans major retail push with new stores across China, US",
    "HMSI sales fall 7% to 3,29,393 units in May",
    "The risk of not taking risks",
    "Digital ad tech firm iCubesWire aims to double topline to Rs 350 crore in FY'24",
    "Global inflows help Indian stocks become EM Asia’s top gainers",
    "India mulls green Ammonia tender to curb fertilizer emissions",
    "Want justice for wrestlers, but after due process of law: Union minister Anurag Thakur",
    "In Pics: CM Siddaramaiah holds meeting with senior officials on roll out of 5 guarantees",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Planning to look at MF stock picks last month and play copy cat? Here’s why you shouldn’t",
    "HDFC Mutual Fund sends notice to investors about change of sponsor. What should you do?",
    "Your first salary should be where your investment journey begins",
    "Can arbitrage funds sustain the momentum?",
    "B30 AUM in mutual funds grew higher than T30’s",
    "8 money changes to watch out for in June",
    "SEBI nudges AMFI to form ethics committee to catch bad apples in time",
    "Future Generali India launches health insurance policy with multiple optional covers",
    "ULIP debt funds back in focus after debt mutual funds taxation. Here’s the top performing funds",
    "Don’t see health insurance premiums rising this year, says SBI General Insurance CEO & MD",
    "LIC: Profitable growth is the main objective",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "From Rs 40 trillion to Rs 100 trillion: How SEBI wants mutual funds to chart the way forward",
    "Parag Parikh Flexi Cap Fund: So far, so good. But can it do an encore?",
    "ITR filing mistakes: Common errors to avoid while filing income tax return for FY 2022-23",
    "Govt may cut solar panel import tax to make up domestic shortfall",
    "Govt 'profiteering' through higher taxes at cost of people: Chidambaram on fuel prices",
    "PwC Australia puts nine partners on leave amid tax leak scandal",
    "Tax collection in India one of the highest, reduce direct tax to 25% from 40%: Surjit Bhalla",
    "Income tax returns for 2023-24: What is Form-16? All you need to know about Form-16",
    "MC Explains: Higher tax exemption on leave encashment for non-govt employees",
    "Property tax waiver for flat owners of up to 500 sq ft flats in Navi Mumbai?",
    "Biggest concern after COVID-19 is to bring employees back to offices: Mike Davis",
    "Vaishnavi Group to develop 10 million sq ft in Bengaluru, targets Rs 5,000 crore revenue",
    "Flex workspace provider WeWork adds over 3,600 desks in Bengaluru",
    "Commodity crash signals disinflation is taking hold for now",
    "US debt-ceiling deal: Could gold price appreciate by 25 percent?",
    "Gold Price At Two-month Lows | Strong Recovery In US Yields | Commodities Live",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Weekly Tactical Pick – Why this cement stock deserves attention",
    "Trade Spotlight | Your trading plan for RBL Bank, Redington, Apollo Hospitals Enterprises",
    "KPIT Technologies hits a new high with a decisive breakout. What should you do?",
    "Trade Spotlight | How to trade in PI Industries, Dixon Technologies, CDSL today",
    "No stress in BFSI, NBFC shares to catch up with rest of market: Mahesh Patil",
    "Daily Voice | Rate cuts will happen later than when markets are expecting, says this fund manager",
    "Nippon India ETF Nifty 50 Shariah BeES",
    "SHARIABEES is moved by 0.28",
    "Destiny Logisti is moved by -3.13",
    "Trigyn Tech is moved by 5.31",
    "Only Sellers in SG FINSERVE on BSE",
    "Maha Rashtra Apex Corporation",
    "Maha Rasht Apex is moved by 0.58",
    "Set SMS alerts for market news",
    "Steel: Rising capex and softer prices not hurting credit outlook, yet",
    "Farmer producer organisations need a level playing field",
    "Will ChatGPT be Homer Simpson’s salvation?",
    "Agri Picks Report June 02, 2023: Geojit",
    "Are Metals Headed For Weekly Increase? | Copper Supported On Low Supply Growth | Commodities Live",
    "Oil prices rise as market awaits possible OPEC+ cuts",
    "CEO of AI startup ends WFH: ‘more comfortable, but…’",
    "Fintech soonicorn Kinara Capital looks to raise $150-$200 million",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "See More Top Companies in India",
    "Will markets cheer 'Thank God It's Friday'? Market Minutes",
    "India's Q4 GDP surprise, Coal India OFS & grey market sentiment check | Market Minutes",
    "Want your bank locker to be safer? Don’t ignore the new locker agreement | Simply Save",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]