[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Vedanta INE205A01025, VEDL, 500295",
    "Apple US0378331005, AAPL:US",
    "Infosys INE009A01021, INFY, 500209",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18314.80\n\n+17.80 (+0.10%)",
    "Sensex\n\n62027.90\n\n+123.38 (+0.20%)",
    "Clash between 2 groups in Akola; Sec 144 imposed in parts of city",
    "Pope Francis meets Ukrainian President Volodymyr Zelenskyy at Vatican",
    "After stiff three-way fight, Congress wins key battles in Old Mysore region",
    "ONDC looks cheaper than Zomato and Swiggy: Decoding the discount war",
    "Adani Enterprises, Adani Transmission take the QIP route to raise Rs 21,000 crore",
    "Star Air: A regional air scaling up is a new thing in India",
    "This research head sees smallcap as a good space to invest in",
    "Karnataka Election 2023: Can Congress Deliver On Promises Made In Manifesto?",
    "Watch: Reasons for disparity in GST collection among different states",
    "Explained | Delhi vs Centre: Impact of Supreme Court verdict on LG vs Kejriwal",
    "Why PM Modi’s state visit to the US is especially significant this time | Explained",
    "Proposal to ban diesel cars by 2027: What’s the need? Central Govt yet to accept the suggestion",
    "Google Introduces Pixel 7A, Pixel Fold | Goes Big On AI | Here Are The Key Takeaways Of I/O 2023",
    "Congress romps home to Karnataka House but has two contenders for CM seat",
    "Karnataka Elections: Five reasons behind BJP's failure to retain power",
    "Bean shortage drives up cost of even the cheapest cup of coffee",
    "Auditor of Zomato subsidiary resigns",
    "New Twitter CEO says she is excited to help to transform Twitter",
    "How severe is India’s water crisis and why it is likely to worsen",
    "35 years of 1988 International Everest Expedition: 'A new route was hard to resist'",
    "Imran Khan slams Pakistan Army for jumping into politics",
    "Happy Mother’s Day 2023: Wishes, greetings, messages, pics, images, WhatsApp status",
    "Security forces fired at by militants in J&K's Anantnag; combat underway",
    "Himachal govt to prepare drug de-addiction, rehabilitation policy: CM Sukhvinder Singh",
    "Thailand election underway with opposition favoured to top polls",
    "Will ONDC disrupt Swiggy and Zomato’s business?",
    "Karnataka Election Results: Congress cracks the victory code, BJP’s double engine strategy blunted",
    "Karnataka Elections: Hyderabad Karnataka goes with Congress. Was Mallikarjun Kharge a factor?",
    "Turkiye president Erdogan faces toughest political challenge in May 14 election",
    "Imran Khan blames Pakistan Army chief Asim Munir for arrest",
    "Haryana's new excise policy allows alcohol at large corporate offices",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "Karnataka elections 2023: As Congress wins big, here's what its manifesto promises",
    "Inside Rakesh Jhunjhunwala’s sprawling 14-storey Mumbai bungalow. Watch",
    "RBI imposes Rs 2.92 crore penalty on Canara Bank for violations",
    "Google reveals its first foldable phone Pixel Fold",
    "Shivakumar recalls Sonia visiting him in jail, gets emotional after Congress' victory",
    "McDonald’s food causes second-degree burns in 4-year-old, parents file case",
    "RBI cancels certificate of registration of 7 NBFCS, 14 surrender permits",
    "Bengaluru woman flew to Delhi to meet online friend. He sped away with her cash, jewellery, phone",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "In Pics: Karnataka Election Results 2023 Highlights",
    "CBSE Class 12 and Class 10 results declared, girls outshine boys",
    "Happy Mother's Day 2023: Google Doodle celebrates with photos of animal families",
    "Raghav Chadha and Parineeti Chopra get engaged in Delhi",
    "Nithin Kamath clears the air on AI replacing jobs, explains Zerodha's policy on layoffs",
    "‘Feeling awkward’: Man shares video of couple on Delhi Metro, gets schooled on Twitter",
    "After accident, coma and memory loss, UP girl scores 90.4% in CBSE exams",
    "Advance / Decline (NSE) \n\n8511163",
    "G7 finance ministers warn of uncertainty on global economy officials s...",
    "Will this have a postive effect on the stock, sir?",
    "It is 19 cr in hurry md of company pronounced it 96 instead of 19 btw ...",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "In-Depth | Turkey's Erdogan risks defeat in toughest election till date; what it means for India",
    "No question of imposing martial law, says Pakistan Army after political turmoil",
    "TP Saurya, Tata Power Trading Company ink pact to set up 200 MW solar project in Rajasthan",
    "Sundaram Home Finance confident of continuing growth: MD Lakshminarayanan Duraiswamy",
    "India has huge sales potential: Boeing",
    "Moneycontrol Pro Weekender: Immaculate disinflation?",
    "India's growth path lies in liberal democracy to earn world's trust: Raghuram Rajan",
    "IIP growth falls to 5-month low of 1.1% in March on poor manufacturing performance",
    "Maharashtra: Clash between 2 groups in Akola; Section 144 imposed in parts of city",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Got Rs 10 lakh to invest? Kotak AMC’s Harish Krishnan shares strategy for retail investors",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How is MF expense ratio calculated?",
    "Why short duration funds are all weather funds",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "SEBI to regulate platforms offering fractional ownership of real estate assets",
    "Greater Noida builders told to register 4,000 flats or face regulatory action",
    "Maharashtra plans deemed conveyance for homebuyers awaiting land ownership",
    "Highways and metros make peripheral localities hotspots for aspirational lifestyle",
    "Karnataka HC prevents landlords from rent hikes for unregistered properties",
    "Foreign investments account for 81% of real-estate investments in 2017- 22: Report",
    "Gurugram Global City: Tepid bidder response forces e-auction delay by a month",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "SRF: Chemicals continue to shine, but all priced in",
    "Nazara Technologies: Blockbuster end to the year",
    "Trade Spotlight | Your trade for Cyient, Jubilant Pharmova, Engineers India today",
    "Daily Voice | This research head sees smallcap as a good space to invest in",
    "Buy Larsen and Toubro; target of Rs 2615: Prabhudas Lilladher",
    "Buy Nazara Technologies; target of Rs 804: Prabhudas Lilladher",
    "Buy Chalet Hotels; target of Rs 504: Prabhudas Lilladher",
    "Kalpataru Power Transmission",
    "Buy Kalpataru Power Transmission; target of Rs 625: Prabhudas Lilladher",
    "Buy V.I.P. Industries; target of Rs 900: Prabhudas Lilladher",
    "Reduce Dr. Reddy&#39;s Laboratories; target of Rs 4500: Prabhudas Lilladher",
    "Accumulate Asian Paints; target of Rs 3360: Prabhudas Lilladher",
    "Set SMS alerts for market news",
    "The Reading List: May 12, 2023",
    "Why OPEC needs oil prices to stay elevated",
    "Moneycontrol Pro Panorama | Inflation is easing, or is it?",
    "Commodity investors await FOMC deliberations, Powell on policy guidance",
    "Buy Aditya Birla Capital; target of Rs 190: Motilal Oswal",
    "Buy Gujarat State Petronet; target of Rs 346: Motilal Oswal",
    "Buy MAS Financial Services; target of Rs 900: Motilal Oswal",
    "Agri Picks Report May 12,2023: Geojit",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "Momentum till strong, earnings season has been a big surprise | The Week on Dalal Street",
    "Science of matching skills with jobs | Unusual Suspects",
    "MSCI rejig, Asian Paints, Eicher Motors & more | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]