[
    "Ideaforge Tech INE349Y01013, IDEAFORGE, 543932",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Olectra Greente INE260D01016, OLECTRA, 532439",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n19331.80\n\n-165.50 (-0.85%)",
    "Sensex\n\n65280.45\n\n-505.19 (-0.77%)",
    "Bengal SEC says will look into poll violence complaints, demands for re-poll",
    "J&K: Water level rising fast in Jhelum, tributaries due to continued rain",
    "HDFC Bank to replace HDFC on MSCI indices on July 13",
    "Amarnath Yatra halted for 2nd day as heavy rain continues in Kashmir",
    "Chandrayaan-3 mission launch on July 14",
    "NSDL files for IPO; IDBI Bank, NSE and SBI to sell stake",
    "RIL sets July 20 as record date for Reliance Strategic Investments demerger",
    "4 in 10 Nifty 500 trade 50% below record highs amid midcap, smallcap frenzy",
    "Over 60 smallcaps gain up to 41% in market's record sprint",
    "Protest In Tel Aviv, Israel Rises As Police Commander Quits The Force | World News",
    "Best Features Of Apple iOS 17 | NameDrop, Check In, Clear OTP Messages",
    "Pakistan Gets Another $3 Billion From IMF | How Long Will Pakistan’s Economy Survive?",
    "Invicto: Maruti’s Largest & Most Expensive Car Launched Starting At Rs 24.79 Lakhs",
    "Wimbledon 2023: How are the grass tennis courts at Wimbledon maintained?",
    "NCLT approves Vamsiram Builders’ resolution plan for Indu Projects",
    "Delhi HC turns down PepsiCo's appeal against revocation of potato patent",
    "Adani Enterprises buy 30% in Trainman for Rs 3.5 crore",
    "IPO-bound Yatharth Hospital mops up Rs 120 crore via private placement",
    "Emmanuel Macron blamed video games for the violent riots in France. He isn’t the first one",
    "Bewitching neighbour: Why Bhutan remains a favourite with the Indian traveller",
    "How far will Neeraj Chopra's javelin go this year?",
    "Railways to cut fares by 25% in AC chair cars, executive classes",
    "AMFI reclassification: Smallcap stocks that got upgraded to midcaps. Do you own them?",
    "PM Modi inaugurates projects worth over Rs 24,300 crore in Rajasthan's Bikaner",
    "Bengal Poll Violence LIVE: What I have seen on the ground is very disturbing, says WB Governor",
    "Taiwan’s new Mumbai office highlights growing ties with India",
    "Farmer fined Rs 50 lakh for sending thumbs-up emoji",
    "Shot putter Karanveer Singh fails dope test, out of Asian Championships",
    "McDonald's puts tomato off the menu in some of stores as price soars",
    "Anand Mahindra is mighty impressed with this woman and wants to recruit her. Here's why",
    "Innovation in EVs seen denting copper demand growth potential",
    "Trai seeks views on regulating WhatsApp, Facebook and others",
    "Yellen criticises Chinese treatment of US companies during visit to revive relations",
    "Consensual sex not rape if promise of marriage is broken: Orissa HC",
    "Harley Davidson X 440 first ride review: A new breed of AI (American-Indian)",
    "Newsletter with fundamental stock ideas, multi-baggers and insights",
    "Harvard scientist reveals 4 simple practices that helped reverse his biological age by a decade",
    "Man's past-present photos of food served on Vande Bharat Express are viral, IRCTC responds",
    "7 Indian restaurants on Taste Atlas’ list of 150 most legendary restaurants in the world",
    "Titanic sub victims spent final moments in darkness, watching sea creatures pass by",
    "Retail tomato prices climb to Rs 155/kg; TN govt launches fairprice sales to offset the surge",
    "Sudha Murty says 'difficult to deal with a successful man'. Watch",
    "Why US CEO, who spends $2 million a year on age reversal, has dinner at 11 am",
    "The curious case of former NSG commando &amp; RAW agent Lucky Bisht",
    "He went to get 5 items at IKEA and left with 78. Why he's getting trolled for tweeting about it",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Market scales fresh record high, rupee trades at 6-week low",
    "India's Entrepreneur Inc huddles together at the Moneycontrol Startup Conclave",
    "Leftist student to an entrepreneur: How France shaped Narayana Murthy's life. Video",
    "How a Harvard scientist reversed his biological age by 10 years: ‘I don’t exercise every day’",
    "Watch Sudha Murty's tribute to wives of entrepreneurs: 'secretary, nanny, adviser'",
    "Easyjet forces 19 passengers off plane because it’s ‘too heavy’ to take off",
    "Advance / Decline (NSE) \n\n7531302",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty breaches the 19k mark, but euphoria missing",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Wall Street ends choppy day lower after jobs data",
    "Broadcom to invest in a $1 billion EU-funded chip programme in Spain",
    "Moneycontrol Pro Weekender | Mr Bond gives the markets a scare",
    "'Difficult To Live With The Most Successful...': Sudha Murty's Tribute To Wives Of Entrepreneurs",
    "Cipla recalls six batches of bronchospasm treatment inhalation aerosol in US",
    "Bangladeshi banks plan India Rupee transactions as reserves fall",
    "Govt may set mandates for green hydrogen use by industries: Official",
    "Alphalogic_Industries_Limited_DRHP",
    "Balaji_Speciality_Chemicals_Limited_Addendum_to_DRHP",
    "Acceleratebs_India_Limited_DRHP",
    "Motisons_Jewellers_Limited_Addendum_to_DRHP",
    "SEBI issues framework for PE funds as sponsors and self-sponsored AMCs",
    "SEBI puts onus on trustees to ensure fairness of fees, expenses charged by fund houses",
    "New fund offer of Canara Robeco Multicap Fund opens today; should you invest?",
    "Motilal Oswal Nifty Microcap 250 Index Fund garners Rs 120 crore during NFO period",
    "Nippon India Mutual Fund limits inflows into smallcap fund",
    "Which is the best day of the month to invest in an SIP?",
    "Edelweiss MF to merge ETF-Nifty Bank with Nifty Largemidcap 250 Index Fund; focus on index funds",
    "Single premium term plans – Should you opt for them?",
    "Majority of insurance-buyers find products & processes to be complex: Policybazaar study",
    "Plum Insurance forays into business insurance space, targets startups and SMEs",
    "Critical illness standalone covers or riders: Which one to pick?",
    "Regulations on How Insurance Companies Should Value Each Bike Component After Depreciation",
    "Life and health insurance policies welcome LGBTQ community, but not all is rosy, just yet",
    "Maha government's flagship health insurance scheme to cover all: CM Shinde",
    "Bond market teaches you why even a single basis point matters a lot: A Balasubramanian",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "RBI group says gains from including govt bonds in global indices outweigh risks",
    "SBI Mutual Fund to accept investments in SBI International Access–US Equity FOF",
    "Excise duty hike in K'taka would lead to dowtrading, may impact sales, say liquor makers",
    "Tax proposals should be planned and implemented like test cricket",
    "Public Provident Fund (PPF) vs Fixed Deposit (FD): Know which is a better tax saving option",
    "ITR Filing: Handy tips for those filing returns for the first time",
    "Filing ITR for crypto gains? Here’s what you need to know | Simply Save",
    "ITR Filing: All you need to know about how to account for income from house property",
    "ITR filing for FY 2022-23: 28 days left, check these changes in income tax return forms",
    "Incuspaze expands with new Noida centre, meeting workspace demand​",
    "UPRERA permits association of allottees and promoter to complete a stuck project in Ghaziabad",
    "Prestige Group, WS Industries to develop 6.5 acre IT park in Chennai",
    "Kartik Aaryan buys apartment in Mumbai for Rs 17.50 crore",
    "Authorities begin land acquisition for wayside amenities along Mumbai-Nagpur Samruddhi Expressway",
    "Gold heads for fourth weekly loss on prospects of more rate hikes",
    "Gold slips as strong US data fuels Fed rate-hike bets",
    "Gold slips as US dollar, yields rise after Fed minutes",
    "Gold rangebound in cautious trading ahead of Fed meet minutes",
    "Gold firms as traders hunker down for Fed cues",
    "Gold futures quiet, cues from Fed minutes awaited: Track latest prices",
    "Gold advances on weaker US economic cues",
    "Gold slips as stronger dollar, rate hike expectations dent appeal",
    "Is NPS the best retirement planning tool?",
    "Seeking higher EPS pension? You have only five more days to apply",
    "Aditya Birla Sun Life Insurance rolls out guaranteed pension plan Nishchit",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Banks education loan increases 18.3% after demand returns as pandemic ebbs",
    "HDFC-HDFC Bank Merger: All you need to know about its impact on home loan customers",
    "Financial Stability Report: Write-offs improved asset quality",
    "Personal Finance: Prepaying your home loan early on can save you lakhs",
    "Looking out for lower interest rates on home loans? A good credit score helps",
    "Walmart-backed PhonePe launches merchant lending services",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "RBI‘s circular on issuance of cards a win for customers, say experts",
    "Visa says co-branding offers opportunities for new categories to emerge",
    "Government flip flop on TCS confounds credit card holders",
    "TCS of 20% on credit cards put on hold, forex cards get Rs 7-lakh exemption",
    "When should you upgrade your credit card?",
    "Free lounge visit, air miles is fine. But how do credit cards make money?",
    "Making UPI payments via RuPay credit cards: Is it worth it?",
    "Trade Spotlight | Your trading plan for Aegis Logistics, BHEL, Asahi India Glass today",
    "Trade Spotlight | How to trade in KEC International, Aster DM Healthcare, Bajaj Finance",
    "Daily Voice | Watch out for these 3 factors in Q1 earnings season",
    "India can follow global models to bring fuel under GST: CBIC Chairman Vivek Johri",
    "Buy Godrej Consumer Products; target of Rs 1250: Sharekhan",
    "Buy Jyothy Labs; target of Rs 275: Sharekhan",
    "Varanium closes below 30-Day Moving Average of 156.59 today.",
    "Tree House Education and Accessories",
    "Tree House closes below 150-Day Moving Average of 16.90 today.",
    "Astron Paper & Board Mill Ltd.",
    "Astron Paper &  closes below 50-Day Moving Average of 25.72 today.",
    "Gillanders Arbu closes below 150-Day Moving Average of 69.76 today.",
    "Sadhana Nitro closes below 30-Day Moving Average of 107.37 today.",
    "Set SMS alerts for market news",
    "Hey Microsoft, can you lend your regulator a lawyer?",
    "Young men gaming more. Are they working less?",
    "The Reading List: July 7, 2023",
    "Taking Stock: Catching breath? Sensex down 505 points, Nifty below 19,350",
    "Eicher Motors plunges 12% in 5 days as competition rises; key support level at Rs 3,000: Experts",
    "Agri Picks Report July 07, 2023: Geojit",
    "Oil prices steady as rate hike fears offset signs of tightening supply",
    "AI4Bharat researchers to raise $12 million from Peak XV, Lightspeed for own firm, sources say",
    "Policy Next_MSME - Growth Series- Have Indian MSMEs demonstrated the ability to take risks?-Part 2",
    "See More Top Companies in India",
    "MAKE IN INDIA: A NEW DEAL FOR DEFENCE",
    "Titan Q1 update, Idea Forge Debut & Bitcoin rally | Market Minutes",
    "The New B2C: Business to Climate | Unusual Suspects",
    "How to avoid disappointment when making an insurance claim | Simply Save",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]