[
    "IKIO Lighting INE0LOJ01019, IKIO, 543923",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18775.20\n\n+87.10 (+0.47%)",
    "Sensex\n\n63230.22\n\n+312.59 (+0.50%)",
    "Stellantis to unveil €25,000 EV in fight for mass-market buyers",
    "Coal stock grows 44% to over 110 MT: Coal Ministry",
    "Go First hopes to resume daily flights by June-end",
    "Behind RBI's move to cap FLDG at 5% and why it’s not good news for fintechs",
    "Market ‘illogical’ about broking stocks: Angel’s Dinesh Thakkar",
    "Should monthly salaries be replaced by weekly paychecks?",
    "Market LIVE Updates: Indices at day's high, Sensex gains 300 pts; Nifty near to 18,800",
    "Decoding FD Laddering I Benefits of Multiple Smaller FDs over a big one? | Watch",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "Kylian Mbappe Rejects Contract Renewal With PSG Shortly After Messi’s Exit",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "Wipro record date on June 16: Should you tender shares?",
    "Bumper debut: IKIO Lighting lists at 37% premium to issue price",
    "Analysts see nearly 14% upside in Ashok Leyland; here's why",
    "Tighter regulations to benefit, not hurt broking: Angel’s Dinesh Thakkar",
    "New governing council of IAMAI meets for the first time since getting elected",
    "Govt likely to collect all-time high dividend of Rs 63,056 cr from listed PSUs",
    "Mysterious 1,000% rise in ‘deep fried’ stocks baffle Indonesia",
    "PVR bulls bet on Adipurush, CEAT, Gujarat Gas, China’s labour pangs, Uncle Scroogeman Sachs",
    "Will direct plan expenses of MFs go up with execution-only platforms?",
    "The AI boom has Silicon Valley on a manic quest",
    "Lodha, Oberoi Realty and others poised to benefit from Mumbai's infrastructure boom",
    "Cyclone Biparjoy Live: Over 900 without power, 2 dead as Biparjoy batters Gujarat",
    "Samvardhana Motherson arm to buy Cirma Entreprise for 7.2 mn euros",
    "Bengaluru man dies by suicide alleging caste discrimination at corporate: report",
    "Nissan confirms top executive Ashwani Gupta leaving company",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "'World's largest kidney stone' removed from Sri Lanka man",
    "Barred from office, Bengaluru employee makes hoax bomb threat to company",
    "Why Sweden is blaming Beyoncé for its high inflation",
    "Oracle cuts hundreds of jobs, rescinds job offers in its health unit",
    "2023 Hero Xtreme 160R 4V review - keeping up with the competition!",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "Man fakes his own death to teach family a lesson, then shows up at funeral in helicopter",
    "Yawning gap: SBI chairman’s Rs 37 lakh salary reignites public vs private banks debate",
    "Why youth in China are quitting high-paying jobs to become waiters, baristas",
    "Canada freezes deportation of Indian students who used fraudulent university letters",
    "How investor Shankar Sharma, 60, managed to get the body of a man in mid-40s",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "Matchbox apartments: 1BHK units in Bengaluru shrink by 30%, demand up by 40%",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "Bengaluru food delivery agent beaten up after 8-year-old makes false complaint",
    "'World's largest kidney stone' removed from Sri Lankan man",
    "Advance / Decline (NSE) \n\n1518466",
    "With an eps of 80 this stock should be trading at 400 minimum.",
    "All investor should write to sebi that u cant put esm in profitable co...",
    "Upper circuit is outperforming",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "US does not expect breakthrough in China ties from Antony Blinken visit: Jake Sullivan",
    "Virgin Galactic plans first commercial space service for June; shares take off",
    "China's Xpeng expands self-driving capability to Beijing, eyes wider expansion",
    "Analysts pin hopes on Adipurush for PVR INOX's Q1 show",
    "Gainers & Losers: 10 stocks that moved the most on June 15",
    "Glenmark Pharma slashes price of breast cancer drug Trastuzumab",
    "Will fine-tuning the PLI scheme help?",
    "GAIL India issues swap tender for 12 LNG cargoes in 2024",
    "India, China bought 80% of Russia's oil in May: IEA",
    "CoWIN data 'leak': TMC MP Derek O'Brien lodges complaint with Kolkata cyber police, seeks probe",
    "Crayons_Advertising_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Western_Carriers_(India)_Limited_DRHP",
    "Valiant_Laboratories_Limited_DRHP",
    "Moneycontrol Selects: Top stories this evening",
    "Explainer: How SEBI’s norms on execution-only platforms will impact investors",
    "More AMCs make a beeline for Multi Asset Allocation Funds",
    "Mutual funds may not get holdings waiver post HDFC Bank - HDFC merger: Report",
    "Inflation down: But does that mean rates will be cut soon?",
    "SEBI issues regulations for execution-only platforms for direct mutual fund schemes",
    "Why have MFs fallen in love with Mankind Pharma just a month since its listing?",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Can the stake sale in UTI AMC fuel a stock rally?",
    "This Father’s Day, show Papa you care: Here are 5 financial gifts for your Dad",
    "Cautious of market highs, these large-caps exit MF portfolio",
    "Income tax returns: Types of TDS certificates and why they are needed",
    "Old is gold: Income tax exemptions & deductions that senior citizens can claim",
    "EPF or NPS: Which is the better investment option?",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "Kerala property sales may be hit this fiscal after increase in fair value of land",
    "Rental income of retail malls to increase by 8-10% in FY2024: ICRA",
    "Noida Authority likely to auction 3 commercial plots in Sector 50 by June-end",
    "ED arrests two M3M promoters in money laundering case",
    "MC Explains: How does Metro connectivity impact real estate prices in mature markets?",
    "Godrej Properties acquires prime land parcel in Kolkata's New Alipore for luxury housing project",
    "Gold down third day ahead of FOMC; track latest prices",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | How do you trade KEI Industries, Tanla Platforms, APL Apollo Tubes today?",
    "Tata Consumer Products sees strong break out, analysts expect it above Rs 1,000",
    "FIIs may not prefer Chinese equities over Indian after Fed’s hawkish pause: Anand Tandon",
    "Hydrocarbon order pipeline at $20 billion, energy transition opportunities strong: L&T Energy head",
    "Worth Investment & Trading",
    "Only Buyers in Worth Invt on BSE",
    "GVK Power & Infrastructure",
    "Only Buyers in GVK Power on NSE",
    "Only Sellers in GCM Capital on BSE",
    "Only Sellers in Sawaca Business on BSE",
    "Milgrey Finance & Investments",
    "Only Sellers in Milgrey Finance on BSE",
    "Only Sellers in Agni Green on NSE",
    "Confidence Futuristic Energetech",
    "Only Buyers in Confidence Futu on BSE",
    "Set SMS alerts for market news",
    "Britain could be the right place to write AI's rules",
    "New York's congestion toll plan could learn from the London experience",
    "Metal prices shine this week, more China stimulus expected",
    "Agri Picks Report June 16, 2023: Geojit",
    "Samvardhana Motherson snaps two-day losing streak on Rs 65 crore deal to acquire French firm",
    "Piramal Pharma soars 5% on hopes of turnaround in CDMO business",
    "Oil prices dip, pausing after previous session's surge",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "Yulu eyes expansion as it closes in on profitability",
    "Indifi Technologies raises $35 million in Series E round led by ICICI Venture",
    "See More Top Companies in India",
    "IKIO Lighting listing, PVR-INOX in focus on Adipurush release & more | Market Minutes",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Wall Street at new 2023 high, India inflation cools & AMC stocks in focus | Market Minutes",
    "Fed throws a surprise, Axis Bank block deal & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]