[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Adani Wilmar INE699H01024, AWL, 543458",
    "Apple US0378331005, AAPL:US",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18285.40\n\n-62.60 (-0.34%)",
    "Sensex\n\n61773.78\n\n-208.01 (-0.34%)",
    "Facebook owner Meta starts final round of layoffs",
    "The Kremlin offers a Trump-Putin ticket for 2024",
    "LIC Q4 profit surges nearly 6-fold to Rs 13,428 crore",
    "If deals come true! What fills the hole for Delhivery, Gati and Allcargo Logistics?",
    "Rs 2,000 note withdrawal: CD, CP yield falls on hopes of improvement in bank deposits",
    "Head-to-head: TCS trounces Infy on all fronts of financials",
    "Rs 2,000 Note Exchange Begins: How Did People In Delhi & Mumbai React?",
    "Are People Exchanging Rs 2000 Notes For Gold Jewellery? | Report From Zaveri Bazaar, Mumbai",
    "'The Boss' — Australian PM Anthony Albanese's praise for PM Modi In Sydney",
    "LIVE: JSW Energy Q4 Results: Joint MD & CEO on FY23 performance & renewable energy plans",
    "Market Live: Q4 Earnings Season – Taking Stock Of The Hits & Misses | Winners & Losers Of Q4",
    "BSE, NSE put Adani Enterprises under short-term ASM framework",
    "Go First crisis: April salary to be fully paid before resuming ops, says airline",
    "Nykaa Q4 earnings: Net profit tanks 72% YoY to Rs 2 crore",
    "India’s copper and aluminium demand strong, says Hindalco MD Satish Pai",
    "Modi at 9: Promises on law, digital push, better access to justice met partially",
    "How a company squandered 80% funds raised via preferential issue",
    "IT freshers suffer agony as top firms delay onboarding",
    "Siemens' motors business divestment upsets street; ‘fair deal’, says management",
    "How 20% TCS will affect investments in foreign stocks, property abroad",
    "Stalled US debt talks, inflation woes hit stocks",
    "CBDT extends deadline for registration by charitable, religious trusts till Sept 30",
    "Sengol in new Parliament: History, making and reason behind installation",
    "Six charts that influenced SEBI’s mutual fund total expense ratio proposals",
    "Govt launches UDAN 5.1 for helicopter routes to boost remote area access",
    "To OpenAI CEO Sam Altman’s AI regulation advice, India says it has own ideas",
    "Prepare for disease deadlier than Covid, warns WHO chief",
    "Governments' IT spend may touch $589 billion in 2023: Gartner",
    "Myntra's integrates ChatGPT to enhance product discovery",
    "Hyundai Exter SUV set for India launch on July 10; deliveries to begin in August",
    "Tata Safari Facelift Spied Again; Fresh Details Revealed",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "National Brother's Day 2023: Wishes, quotes and messages that can be shared",
    "Zimbabwe tops ‘World’s most miserable countries’ list. India’s rank is…",
    "UPSC topper Ishita Kishore left corporate job for public service: ‘Since I am from SRCC…’",
    "US CEO, who spends $2 million a year on age reversal, now using teen son as 'blood boy'",
    "Closing Bell: Nifty below 18,300, Sensex falls 208 pts; metals drag, pharma gains",
    "In Pics: Kohli's sublime century powers Bangalore to crucial win in Indian Premier League 2023",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Jeff Bezos, girlfriend make grand entrance at Cannes on $500 million superyacht",
    "Happy birthday, Clint Eastwood",
    "New Parliament Building Inauguration by PM Modi Live: Congress, AAP, TMC, others unite in boycott",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Is your MF justified for the expenses it charges you?",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Deloitte employee praises Adolf Hitler in LinkedIn post, sacked after backlash",
    "Sydney Harbour Bridge, Opera House lit up with Indian tricolour during PM Modi's visit. Watch",
    "Fake AI image of Pentagon explosion causes US markets to briefly plummet",
    "How the world's richest person Bernard Arnault lost over $11 billion in a day",
    "Advance / Decline (NSE) \n\n9631071",
    "Buy hero motocorp buy at cmp 2738 tgt will be 2795 sl 2712 srchon tegl...",
    "Again super profits here in this d.options.22.34.886838.me stock, tata...",
    "D agarwal sold 2.7 pc stake to marque investor name not disclosed. vis...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "UK annual inflation slides to 13-month low",
    "Alibaba unit ordered to pay NetEase $7.2 million over game copyright violation",
    "Copper gripped by China fears as prices plunge below $8,000",
    "LG India expects 10% growth, exploring new business categories, says MD",
    "Pristyn Care enters into hair transplant surgery, plans to expand operations",
    "Uber India to deploy 25,000 electric cars by 2025 through fleet partnerships",
    "Sri Lanka expects FDI to jump to $1.3 billion with India taking lead",
    "Moody's sees India as fastest-growing G20 nation over next few years",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "LIVE: Civil Aviation and Steel Minister Jyotiraditya Scindia speaks at the CII annual session",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Passive investing gaining momentum but retail investors still have only a small share",
    "MF romance with logistics deepens with Delhivery, but fizzles out for Gati",
    "HDFC Defence Fund advances NFO closing date from June 2 to May 30",
    "Mutual funds brace for impact of Sebi consultation paper on total expenses",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "How can retirees use MC30?",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Is your mutual fund justified for the expenses it charges you?",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Oberoi Realty acquires 6.4 acres in Thane near Mumbai",
    "Sebi’s proposal allowing smaller REITs opens one door but shuts another",
    "Noida Authority asks builders to register 1,097 flats in 21 projects or face action",
    "Shriram Properties acquires new project in Chennai; eyes Rs 1,200 crore sales revenue",
    "Rustomjee Group has 20 forthcoming projects with saleable potential of 27.86 million sq.ft.",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Explained: IRDAI’s diktat on credit cards",
    "Balaji Amines: Does it merit a look?",
    "Trade Spotlight | Your strategy for Route Mobile, Bajaj Electricals, Divi's Labs today",
    "Hot Stocks | Paytm, Apollo Tyres, TVS Motor may fetch up to 16% return in short term",
    "Delhivery: A reality check on the growth hype",
    "Daily Voice | LIC Mutual Fund bullish on these 4 sectors for FY24, says this fund manager",
    "Interview | 'Nifty likely hitting 19,000 by June, expect buying interest in these 4 stocks'",
    "Anik Industries closes below 30-Day Moving Average of 32.09 today.",
    "KCP closes below 50-Day Moving Average of 102.71 today.",
    "Thyrocare Techn closes below 30-Day Moving Average of 463.84 today.",
    "Spencer Retail closes below 50-Day Moving Average of 58.82 today.",
    "Anant Raj closes below 30-Day Moving Average of 141.13 today.",
    "HMT closes below 30-Day,50-Day Moving Average today.",
    "Albert David closes below 150-Day,200-Day Moving Average today.",
    "Set SMS alerts for market news",
    "Greenspan’s success shows Jerome Powell how to skip",
    "Moneycontrol Pro Panorama | Japan's day in the sun",
    "US and India cannot slacken in Great Game with China in the Pacific Island countries",
    "Taking Stock: Market snaps 3-day gains; Nifty below 18,300, Sensex falls 208 pts",
    "Agri Picks Report May 24, 2023: Geojit",
    "Buy Bharat Petroleum Corporation; target of Rs 425: Prabhudas Lilladher",
    "Buy Narayana Hrudayalaya; target of Rs 980: Prabhudas Lilladher",
    "Buy Crompton Greaves Consumer Electricals; target of Rs 371: Prabhudas Lilladher",
    "Commodities Live: Crude Gains 1%; Gasoline Prices At 5-week Highs | Why Are Prices Surging?",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "See More Top Companies in India",
    "Market remains watchful but there is good news on ITC, NMDC and Biocon | Market Minutes",
    "Should you bet on sectors with highest earnings growth? Moneycontrol Alpha",
    "BPCL surprises the Street, correction in IT stocks & more | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]