[
    "Mankind Pharma INE634S01028, MANKIND, 543904",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18315.10\n\n+49.15 (+0.27%)",
    "Sensex\n\n61940.20\n\n+178.87 (+0.29%)",
    "Vanguard slashes Ola's valuation by 35% to $4.8 billion",
    "Go First cancels all flights scheduled till May 19, assures full refunds",
    "L&T Q4 net profit spikes 10% to Rs 3,987 crore, misses estimates",
    "How ONDC is cheaper than Zomato & Swiggy: Decoding the discount war",
    "Amid nervousness over US inflation data, Sensex manages to close in green",
    "Hard days for Indian software giants as foreign funds log out of IT stocks",
    "Is ONDC Really Cheaper Than Zomato & Swiggy? | ONDC vs Food Delivery Apps | e-Commerce",
    "US debt ceiling crisis explained: Clock ticks to debt default, Biden holds urgent meetings",
    "NR Narayana Murthy & Sudha Murty cast votes in Bengaluru, listen to their message to young voters!",
    "Imran Khan arrested by Rangers outside Islamabad High Court: Why was former Pak PM arrested?",
    "Watch Now | 'The Kerala Story' declared tax-free in Uttar Pradesh, banned in West Bengal",
    "Why do airlines fail in India? | Go First: The latest victim of Indian aviation business",
    "Dr Reddy's Q4 net profit jumps to Rs 959 crore on favourable base, US launches, brand deals",
    "Nexus Select Trust REIT IPO subscribed 48%, HNIs portion booked 86% on day 2",
    "Asian Paints Q4 Preview: Revenue to grow 10%, margins to expand on falling input costs",
    "Karnataka Election 2023 live updates: 65.69% voter turnout recorded till 5pm",
    "Will HD Kumaraswamy continue to rule in Channapatna?",
    "BJP to face a tough four-corner fight in Belagavi North",
    "Nowhere in the world does judiciary appoint itself, Harish Salve on collegium system",
    "Korma, Coke and peacocks: What Imran Khan supporters looted from Pakistan Corps Commander's house",
    "Latest LIVE News: L&T Q4 results miss estimates, AM Naik to step down as Chairman",
    "Panel gears up to get stalled real estate projects moving",
    "Pakistani court indicts former PM Imran Khan in Toshakhana corruption case",
    "Pakistani actor wants to file complaint against PM Modi. See Delhi Police's hilarious response",
    "Promoting EV Sales: FAME scheme targets need to be more realistic",
    "India braces for heatwave return amidst Cyclone Mocha's influence and El Niño concerns",
    "SC to hear pleas on Adani-Hindenburg row on May 12",
    "Boy who dropped out of school at 17 is now a retired millionaire at 22",
    "This country just arrested a man for ‘misusing’ ChatGPT",
    "How Narayana Murthy's parents ensured he voted in elections",
    "Go First insolvency spoils summer travel plans of Indians",
    "Woman who wrote book on grief after husband’s death has been charged with his murder",
    "MG Comet EV first drive, review - Urban mobility solved?",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "'If we oldies can...': Sudha Murty after voting in Karnataka election",
    "Bengaluru entrepreneur's response to a scammer offering a job on WhatsApp is viral",
    "Tech Mahindra Q4 earnings miss expectations, Street keeps a cautious stance",
    "Itasha, the 'cringeworthy' cartoon cars of Japan, are making an image U-turn",
    "Grocery shop-owner father-in-law teaches billionaire Nithin Kamath how to live a good life",
    "Latest LIVE News: L&amp;T Q4 results miss estimates, AM Naik to step down as Chairman",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "WhatsApp calls, messages from international numbers? Beware of scammers",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Gainers & Losers: 10 stocks that moved the most on May 10",
    "Karnataka Assembly Elections: BJP bids to retain power in south Indian bastion",
    "Couple who adopted ‘6-year-old’ girl claim she was an adult who tried to kill them",
    "Advance / Decline (NSE) \n\n1085945",
    "Just compare and analyse the shareholding patter of march 23 with dece...",
    "Reading through all the q.options.22.34.886838.me boarders here in cli...",
    "After making ath of 125, ncc gave correction of 10% which was healthy....",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "In Pics: All you need to know about the origin of the universe",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "China names Li Yunze top financial regulator in surprise move",
    "GAIL plans $4.9 billion ethane cracker in West India",
    "OYO travel agent enrollment sees sharp uptick in FY23",
    "Govt gives time till May 31 for Goods Transport Agencies to opt for GST payment",
    "MP cabinet approves proposal of Rs 2123 crore to pay loan interest of defaulter farmers",
    "Imran Khan produced before special court; Anti-corruption watchdog seeks 14-day physical remand",
    "Some people don't want to see anything good happen in country: PM Modi",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Protean_eGOV_Technologies_Limited_addendum_II_to_the_DRHP",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Mutual funds with performance fees: Does a model like this exist globally?",
    "Got Rs 10 lakh to invest? Kotak AMC’s Harish Krishnan shares strategy for retail investors",
    "Fear and greed: Two behavioural traits that lead to wrong investments",
    "Will performance-linked fees help mutual fund investors?",
    "54% of new mutual fund investors are millennials",
    "Performance-based fee for mutual funds: What stakeholders say",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How is MF expense ratio calculated?",
    "Why short duration funds are all weather funds",
    "Roaring multi-asset mutual funds bet on these midcap stocks. Do you own any?",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Karnataka Elections: Homebuyers, experts seek policy changes from new MLAs",
    "Kolte Patil signs two residential projects in Pune with topline potential of Rs 1,300 crore",
    "Six years of MahaRERA: 41 lakh houses under construction in Maharashtra, says chairman",
    "MC Exclusive: Columbia Pacific to invest Rs 200 cr to launch senior living homes across India",
    "10 things you should know about India’s first retail REIT",
    "Yamuna Expressway Authority likely to implement Master Plan 2041 by June 30 this year",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Indian gold prices hit record high, dampen demand: Dealers",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "DCB Bank: Risk-reward extremely favourable, buy for long term",
    "Trade Spotlight | Your strategy for Firstsource Solutions, Nazara Tech, Varun Beverages today",
    "Hot Stocks | Sula Vineyards, Tube Investments, Vindhya Telelinks may fetch up to 15% returns",
    "Trade Spotlight | How should you trade in Tata Motors, Bajaj Finance, CSB Bank today",
    "Hot Stocks | Bet on NOCIL, MSTC, Angel One for up to 15% return in short term",
    "MC Interview | Don't expect shortage of coal, imports will continue to increase: Coal Secretary",
    "Dr Reddy&#39;s Q4 net profit jumps to Rs 959 crore on favourable base, US launches, brand deals",
    "Williamson Magor and Company",
    "Williamson Mago is moved by -3.44",
    "ADF Foods is moved by 3.23",
    "Ducol Organics and Colours",
    "Ducol Organics is moved by -3.56",
    "Gyscoal Alloys is moved by 8.62",
    "AYM Syntex is moved by -3.01",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | Markets and investors look optimistic with strong start to FY24",
    "Imran Khan Arrest: It has come down to street power versus Pakistan Army’s grip over power",
    "What central banks need to consider when making monetary policy in times of war and crisis",
    "Taking stock: Amid nervousness over US inflation data, Sensex manages to close in green",
    "Agri Picks Report May 10,2023: Geojit",
    "Neutral UPL; target of Rs 750: Motilal Oswal",
    "Buy Canara Bank; target of Rs 400: Motilal Oswal",
    "Coal at a 16-Month low| Weak demand from Europe | Commodities Live",
    "What’s Cooking: Actor Suniel Shetty launches food delivery app Waayu, looks to back more startups",
    "Start-up Street: ‘Boring’ businesses can turn into successful start-ups",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Select Nexus Trust REIT, Nazara Tech & sectors to watch out for | Market Minutes",
    "Moneycontrol Alpha: Paytm : Will the rally sustain?",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]