[
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Brightcom Group INE425B01027, BCG, 532368",
    "Apple US0378331005, AAPL:US",
    "Reliance INE002A01018, RELIANCE, 500325",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18688.10\n\n0.00 (0.00%)",
    "Sensex\n\n62917.63\n\n-310.88 (-0.49%)",
    "Stellantis to unveil €25,000 EV in fight for mass-market buyers",
    "Coal stock grows 44% to over 110 MT: Coal Ministry",
    "Go First hopes to resume daily flights by June-end",
    "Market ‘illogical’ about broking stocks: Angel’s Dinesh Thakkar",
    "Tighter regulations to benefit, not hurt broking: Thakkar",
    "Top 10 things to know before the market opens today",
    "Behind RBI's move to cap FLDG at 5% and why it’s not good news for fintechs",
    "Decoding FD Laddering I Benefits of Multiple Smaller FDs over a big one? | Watch",
    "How To Deal With Toxic Work Culture | HDFC Boss Yelling, Coding Ninjas Videos Go Viral",
    "Kylian Mbappe Rejects Contract Renewal With PSG Shortly After Messi’s Exit",
    "What's the 'ideal' salary for a comfortable lifestyle in an Indian metro city? | Experts' Take",
    "Banks, LIC appoint SBI Capital Markets as i-banker for stake sale in UTI MF: Sources",
    "Buzzing Stocks: IKIO Lighting, BHEL, TVS Motor, Pitti Engg, Natco Pharma & others in focus",
    "IKIO Lighting listing, PVR-INOX in focus on Adipurush release & more | Market Minutes",
    "Govt likely to collect all-time high dividend of Rs 63,056 cr from listed PSUs",
    "Mysterious 1,000% rise in ‘deep fried’ stocks baffle Indonesia",
    "Nissan confirms top executive Ashwani Gupta leaving company",
    "All the big stories to get you started for the day",
    "Will direct plan expenses of MFs go up with execution-only platforms?",
    "Samvardhana Motherson arm to buy Cirma Entreprise for 7.2 mn euros",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "Why Sweden is blaming Beyoncé for its high inflation",
    "Tech Mahindra appoints Mohit Joshi as additional director from June 20",
    "India’s $210 billion wedding industry warms to LGBTQ ceremonies",
    "Oracle cuts hundreds of jobs, rescinds job offers in its health unit",
    "India seeks exemptions for MSMEs from EU's carbon tax: Commerce Secretary",
    "As Apple nears $3 trillion m-cap, a look at 5 most valuable firms in the world",
    "Hero Motocorp under govt radar, corporate affairs ministry initiates probe: Sources",
    "CoinEx accepts New York ban, to pay $1.8 million to resolve lawsuit",
    "Tata Motors evinces interest in green technology project in Jharkhand",
    "2023 Hero Xtreme 160R 4V review - keeping up with the competition!",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Man fakes his own death to teach family a lesson, then shows up at funeral in helicopter",
    "Yawning gap: SBI chairman’s Rs 37 lakh salary reignites public vs private banks debate",
    "Why youth in China are quitting high-paying jobs to become waiters, baristas",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "How investor Shankar Sharma, 60, managed to get the body of a man in mid-40s",
    "Matchbox apartments: 1BHK units in Bengaluru shrink by 30%, demand up by 40%",
    "Shah Rukh Khan reveals how he met billionaire who built Burj Khalifa: 'At a dhaba'",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "Bengaluru man filmed stealing woman's innerwear under pretext of looking for house to rent",
    "The art of 'Skiplagging': A clever travel hack that airlines don't approve",
    "Zara trolled for Rs 3,000 shirt with Hindi words that make little sense",
    "Advance / Decline (NSE) \n\n8501230",
    "No today and next session is most important ftse fund and restructurin...",
    "Down down down down 5% circuit",
    "In the morningu2026u2026. say u2026.. jai sri ramu2026. and sell this on every...",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty closes flat, RBI Policy non event",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Spend now, worry later: no point saving in inflation-stricken Argentina",
    "Gainers & Losers: 10 stocks that moved the most on June 15",
    "Glenmark Pharma slashes price of breast cancer drug Trastuzumab",
    "India's merchandise trade deficit soars to 5 month high",
    "Milk prices up again in May, but fodder crash offers some respite",
    "Government mulls tweaks to boost $731 billion insurance sector",
    "Live News Updates: Go First extends flight cancellations till June 19 due to operational reasons",
    "CoWIN data 'leak': TMC MP Derek O'Brien lodges complaint with Kolkata cyber police, seeks probe",
    "Crayons_Advertising_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Western_Carriers_(India)_Limited_DRHP",
    "Valiant_Laboratories_Limited_DRHP",
    "Moneycontrol Selects: Top stories this evening",
    "Explainer: How SEBI’s norms on execution-only platforms will impact investors",
    "More AMCs make a beeline for Multi Asset Allocation Funds",
    "Mutual funds may not get holdings waiver post HDFC Bank - HDFC merger: Report",
    "Inflation down: But does that mean rates will be cut soon?",
    "SEBI issues regulations for execution-only platforms for direct mutual fund schemes",
    "Why have MFs fallen in love with Mankind Pharma just a month since its listing?",
    "How much health insurance should a fresher get?",
    "Morning Scan: All the big stories to get you started for the day",
    "Star Health founder Jagannathan resigns from company's board",
    "Should India look at the US, UK model to improve safety of railway network?",
    "Life insurers to maintain momentum this fiscal, but margins a worry, say analysts",
    "Odisha train crash: Insurers must expedite, ease claim settlement process for victims, says IRDAI",
    "Politics Before Safety: Why epic tragedies still plague the trainwreck that is Indian Railways",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "This Father’s Day, show Papa you care: Here are 5 financial gifts for your Dad",
    "Cautious of market highs, these large-caps exit MF portfolio",
    "How LIC Mutual Fund's chief executive plans to turn the tortoise into a hare",
    "Old is gold: Income tax exemptions & deductions that senior citizens can claim",
    "EPF or NPS: Which is the better investment option?",
    "ITR filing, HRA and Section 80GG: How to claim tax benefits on rent paid",
    "GST council must distinguish between betting-related, skill-based online games: Former CBIC chair",
    "Ashneer Grover says paying tax is a punishment: 'Taxpayers are doing charity in this country'",
    "ITR filing: Salaried tax-payer? Know how to choose between forms ITR-1 and ITR-2",
    "New vs old tax regimes: There is still time to weigh and choose the I-T regime that suits you",
    "Kerala property sales may be hit this fiscal after increase in fair value of land",
    "Rental income of retail malls to increase by 8-10% in FY2024: ICRA",
    "Noida Authority likely to auction 3 commercial plots in Sector 50 by June-end",
    "ED arrests two M3M promoters in money laundering case",
    "MC Explains: How does Metro connectivity impact real estate prices in mature markets?",
    "Godrej Properties acquires prime land parcel in Kolkata's New Alipore for luxury housing project",
    "Gold down third day ahead of FOMC; track latest prices",
    "Gold jewellery recycling seen matching record this year",
    "Gold rate today: International prices cautious ahead of key US data",
    "Commodities Live: Precious metals slip as dollar index steadies; should you buy now?",
    "Gold steady after best week in 1-1/2 months; Check out latest prices",
    "Gold Rate Today: Gold prices in spotlight ahead of Fed meet next week; check latest rates",
    "Gold Rate Today: Gold prices ease day after climb; check latest rates",
    "Gold Rate Today: Gold poised for weekly gain; check latest prices",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Moneycontrol Daily: Your Essential 7",
    "Capital Small Finance Bank eyes Rs 14,000 crore of total business in FY24",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "Trade Spotlight | How do you trade KEI Industries, Tanla Platforms, APL Apollo Tubes today?",
    "Tata Consumer Products sees strong break out, analysts expect it above Rs 1,000",
    "FIIs may not prefer Chinese equities over Indian after Fed’s hawkish pause: Anand Tandon",
    "Hydrocarbon order pipeline at $20 billion, energy transition opportunities strong: L&T Energy head",
    "KCK Ind closes below 30-Day,50-Day Moving Average today.",
    "Vakrangee closes below 30-Day,50-Day Moving Average today.",
    "Nidan Laboratories & Healthcare",
    "Nidan Lab closes below 150-Day Moving Average of 46.78 today.",
    "Paras Petro closes below 30-Day,50-Day Moving Average today.",
    "Jyoti Structure closes below 30-Day Moving Average of 7.72 today.",
    "Omfurn India closes below 30-Day Moving Average of 46.37 today.",
    "Diligent Media Corporation Ltd.",
    "Diligent Media  closes below 200-Day Moving Average of 3.24 today.",
    "Set SMS alerts for market news",
    "US should look south, not far east, on trade pacts",
    "For big oil, green is out, black is back",
    "Moneycontrol Pro Panorama | A pregnant pause but more rate hikes loom",
    "Market LIVE Updates: SGX indicates positive start; S&P 500, Nasdaq at 14 month high",
    "Oil prices dip, pausing after previous session's surge",
    "Agri Picks Report June 15, 2023: Geojit",
    "Oil prices tick up as markets look to key Chinese economic data",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "Yulu eyes expansion as it closes in on profitability",
    "Indifi Technologies raises $35 million in Series E round led by ICICI Venture",
    "See More Top Companies in India",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Wall Street at new 2023 high, India inflation cools & AMC stocks in focus | Market Minutes",
    "Fed throws a surprise, Axis Bank block deal & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]