[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Infosys INE009A01021, INFY, 500209",
    "Apple US0378331005, AAPL:US",
    "Vedanta INE205A01025, VEDL, 500295",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18398.85\n\n+84.05 (+0.46%)",
    "Sensex\n\n62345.71\n\n+317.81 (+0.51%)",
    "NSE launches WTI crude oil and natural gas futures contracts",
    "Microsoft wins EU antitrust nod for Activision deal, after UK veto",
    "Haryana raises rebate on property tax payments from 10% to 30% till July 31",
    "PVR Inox to shut down over 50 theatres in the next six months",
    "Trade setup for Tuesday: Top 15 things to know before the opening bell",
    "Mirror, mirror on the wall, does the Nifty @ 18,400 have it all?",
    "Equity markets and the intersection of crude oil, forex and interest rates",
    "India in talks with EU to allow Indian energy auditors to do carbon verification of exports",
    "BSE MD & CEO Sundararaman Ramamurthy exclusive on Sensex, Bankex F&O relaunch",
    "\"BharatPe is a $3 bn write-off\" Ashneer Grover hits back l Ashneer Grover's reaction to EOW's FIR",
    "Stock of The Day: Home First Finance | What makes it a preferred bet in housing finance space?",
    "Watch: Reasons for disparity in GST collection among different states",
    "Karnataka Election 2023: Can Congress Deliver On Promises Made In Manifesto?",
    "Why PM Modi’s state visit to the US is especially significant this time | Explained",
    "ZestMoney founders resign two months after PhonePe deal falls through",
    "Amazon implements layoffs in India as part of global workforce reductions",
    "Amazon notifies sellers of revised fee structure, potentially leading to increased prices",
    "Government plans to assign ‘unique code’ to economic offenders, link it to PAN, Aadhaar",
    "Siddaramaiah likely to be next Karnataka CM, DK Shivakumar slips in race: Sources",
    "Windfall tax on crude petroleum slashed to nil from Rs 4,100 per tonne",
    "Heatwave impact | 85% Indian households face power cuts every day: Survey",
    "US-based Baron Capital follows Invesco, marks down Swiggy’s fair value by 34%",
    "Mumbai outperforms Bengaluru, Delhi in index list for Q1 2023: Report",
    "CLP puts Kharge in charge to pick winner; Shivakumar cancels Delhi visit",
    "News Highlights: Windfall tax on crude petroleum reduced to nil from Rs 4,100 per tonne",
    "Adani-Hindenburg saga: Sebi warns on premature conclusion to investigation",
    "Outgoing Puma India MD Abhishek Ganguly raises Rs 430 crore for his startup",
    "NCLAT to pronounce verdict on appeal against Go First insolvency on May 22",
    "Karnataka News Highlights: Congress President will take appropriate call, says Surjewala",
    "NSE Q4 profit up 31% at Rs 2,067 crore, board recommends dividend of Rs 80 per share",
    "India's carmakers back zero duty on limited British imports under trade deal",
    "PVR Inox Q4 net loss more than triples to Rs 333.37 crore",
    "India’s combined trade deficit falls to $1.38 billion in April, lowest in 21 months",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "‘Are you joking?’ Sudha Murty's 10 Downing Street address stuns UK immigration officer",
    "Closing Bell: Nifty ends around 18,400, Sensex gains 318 pts; realty index up 4%",
    "Google reveals its first foldable phone Pixel Fold",
    "Karnataka News LIVE Updates: Next Karnataka CM's name to be decided by tomorrow, says Congress",
    "Indigo’s mother-daughter cabin crew duo wins the internet. Watch",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "Tata Motors turns profitable: Street bets on JLR's ambitious targets, debt reduction",
    "Stock Market Today: Top 10 things to know before the market opens",
    "Live News Updates: Windfall tax on crude petroleum reduced to nil from Rs 4,100 per tonne",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Five things you need to know before you buy the MG Comet: See Pics",
    "US truck driver's big lottery win will give him $1000 payouts every week for life",
    "Robots could control humanity, AI company founder rings warning bells",
    "This influencer's AI chatbot gives the 'girlfriend experience' for $1 per minute",
    "How Apple Watch's Fall Detection saved 2 people in the US",
    "Advance / Decline (NSE) \n\n1105950",
    "Btst.. executed.....exittt right now....game over.",
    "Always try not to trade blind on any stocks, better to be here on clik...",
    "3420 before expiry.....sell call 3420",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "In Pics: Ukraine's Zelensky, in Britain, wins pledge of long-range drones",
    "Turkey Elections 2023: Erdogan ascendant as Turkey heads for historic runoff",
    "Rishi Sunak welcomes Ukraine President Volodymyr Zelenskyy on surprise visit to the UK",
    "DMCC to launch flagship office in Mumbai to develop India-UAE trade to ‘next level’",
    "Vedanta appoints Sonal Shrivastava as CFO",
    "Oil prices rise as tight supplies compete with economic concerns",
    "Debt MFs attracts Rs 1.06 lakh crore in FY23; liquid funds account 60% inflow",
    "India needs to balance conflicting interests as it designs an emission trading system",
    "India’s Cannes pavilion to be based on Saraswati Yantra",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "Ultra short duration funds: Riding rising rates",
    "Why debt mutual funds are still relevant and investment-worthy",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Bajaj Finance FD offers high interest rates, but is it still a good choice?",
    "Here are sectors that smallcap mutual funds category love to hold",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Mumbai outperforms Bengaluru, Delhi on list of global prime cities index in Q1 2023: Report",
    "Real estate stocks come to party on DLF's stellar numbers; Nifty Realty zooms 4%",
    "Noida Authority forms panel to finalise structural safety audit charges",
    "Welspun One Logistics Parks raises Rs 500 crore AIF from HNIs, domestic investors",
    "Sebi weighs rules to regulate portals offering fractional ownership of realty assets",
    "SEBI to regulate platforms offering fractional ownership of real estate assets",
    "Gold ticks up as US debt ceiling talks drag on",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Top 10 trading ideas for next 3-4 weeks as Nifty may scale higher despite consolidation",
    "Trade Spotlight | Your game plan for Kajaria Ceramics, Chalet Hotels, Intellect Design Arena today",
    "Hot Stocks | Bet on Jubilant Pharmova, Engineers India, Container Corp for short term",
    "SRF: Chemicals continue to shine, but all priced in",
    "Daily Voice | This research head sees smallcap as a good space to invest in",
    "Godawari Power closes above 30-Day Moving Average of 367.84 today.",
    "Damodar Ind closes below 30-Day Moving Average of 42.46 today.",
    "Steel Str Wheel closes below 30-Day,50-Day Moving Average today.",
    "ORIENTAL AROMAT closes below 30-Day Moving Average of 381.31 today.",
    "Bodhi Tree Mult closes below 50-Day Moving Average of 180.66 today.",
    "Cupid closes below 50-Day Moving Average of 260.42 today.",
    "Subros closes below 200-Day Moving Average of 318.97 today.",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | Karnataka verdict: Jumping to the wrong conclusions",
    "Startups-IAMAI row: Regulations necessary to promote competition and give consumers choice",
    "Oaktree’s Howard Marks warns of crunch time for private credit",
    "Buy Tata Motors; target of Rs 605: Prabhudas Lilladher",
    "Hold Polycab India; target of Rs 3249: Prabhudas Lilladher",
    "Jefferies upgrades Navin Fluorine to 'buy', sees 19% upside potential; here's why",
    "Learning to live with the ups and downs of startups",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Tata Motors, DLF and Dalal Street in the week ahead | Market Minutes",
    "Momentum still strong, earnings season has been a big surprise | The Week on Dalal Street",
    "Science of matching skills with jobs | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]