[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "LIC India INE0J1Y01017, LICI, 543526",
    "Apple US0378331005, AAPL:US",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18214.20\n\n-71.20 (-0.39%)",
    "Sensex\n\n61523.01\n\n-250.77 (-0.41%)",
    "US AAA credit rating may be cut by Fitch on debt-limit impasse",
    "Ola Electric taps Kotak, Goldman Sachs for IPO in early 2024",
    "Indian entrepreneurs stage desi coup as Dream11 founder elected IAMAI chairperson",
    "Nykaa Q4 results: Analysts maintain bullish stance but lower the target price",
    "Market LIVE Updates: Indices extend losses with Nifty around 18,200; Sensex falls 250 pts",
    "Rs 2,000 Note Exchange Begins: How Did People In Delhi & Mumbai React?",
    "Are People Exchanging Rs 2000 Notes For Gold Jewellery? | Report From Zaveri Bazaar, Mumbai",
    "'The Boss' — Australian PM Anthony Albanese's praise for PM Modi In Sydney",
    "LIVE: JSW Energy Q4 Results: Joint MD & CEO on FY23 performance & renewable energy plans",
    "Market Live: Q4 Earnings Season – Taking Stock Of The Hits & Misses | Winners & Losers Of Q4",
    "LIC: Profitable growth is the main objective",
    "Ujjivan SFB may apply for universal bank license after reverse merger",
    "SME IPOs 2023 so far: 33 of 49 stocks trading above offer price",
    "UBS downgrades Tata Motors to sell; ups target price to Rs 450 a share",
    "Family of Mankind Pharma promoter sells property in Delhi for Rs 91 crore",
    "Go First Crisis: Justice Parthiba Singh recuses from hearing",
    "Why candidates remain confident of switching jobs despite recession fears",
    "JSW Energy to set up 3,800-tonne green hydrogen plant in Karnataka",
    "Revised bank locker rules: 5 things you must bear in mind",
    "Modi govt @ 9 |4 ministers, a pandemic and 3 airlines nearly down, Indian aviation still flies",
    "Meta India's head of legal among senior leaders affected by layoffs, say sources",
    "With biggest stadium as home ground, Gujarat Titans sees high ticket revenues",
    "IPO-bound gaming and blockchain firm Yudiz Solutions gets NSE nod",
    "Short Call: Siemens derating, SG Finserv rockets, Wonderla Holidays, Greek turnaround",
    "PM Modi flags off Delhi-Dehradun Vande Bharat Express",
    "AI-created pic triggers market crash: Welcome to investing in the wackadoodle world",
    "Matrix Partners sees founders having realistic expectations post downturn",
    "SoftBank in talks with 5 Indian startups, may infuse up to $100 million in each",
    "Tata Safari Facelift Spied Again; Fresh Details Revealed",
    "Set Price & Volume alerts to take quick action on your portfolio.",
    "UPSC topper Ishita Kishore left corporate job for public service: ‘Since I am from SRCC…’",
    "Zimbabwe tops ‘World’s most miserable countries’ list. India’s rank is…",
    "LIC Q4 profit surges nearly 6-fold to Rs 13,428 crore; dividend declared",
    "In Pics: Kohli's sublime century powers Bangalore to crucial win in Indian Premier League 2023",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Deloitte employee praises Adolf Hitler in LinkedIn post, sacked after backlash",
    "BSNL 4G network to go live in 2 weeks, says Ashwini Vaishnaw",
    "Allen appoints former Meta exec Abha Maheshwari as CEO of digital arm",
    "Trade setup for Thursday: Top 15 things to know before the opening bell",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "PM Modi returns home after travelling across three nations",
    "Tata IPL 2023: Brilliant Madhwal takes 5-5 as Mumbai knock Lucknow out of IPL",
    "Jay Kotak’s post as fiancée Aditi Arya graduates from Yale: ‘immensely proud’",
    "Wipro chairman Rishad Premji takes 50 percent paycut this year",
    "West Bengal board topper was asked whom he credits for his success. ‘Me,’ he replied",
    "Hiring expert reveals how to use ChatGPT to ace job interviews: ‘works every time’",
    "Fake AI image of Pentagon explosion causes US markets to briefly plummet",
    "Advance / Decline (NSE) \n\n1038953",
    "Operator uncles will come tomorrow for weekly closing",
    "I am enjoying an awesome profit. . . .",
    "See a big rally from next 2/3 days. record date for bonus is 31/5/23. ...",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Ukraine says it shot down 36 drones in overnight Russian attacks",
    "BYD and Great Wall Motor locked in rare war of words over EV emissions",
    "Six drones downed in Crimea, no victims: Governor",
    "Bank of Maharashtra tops PSU lenders chart in profit and loan growth in FY23",
    "Wipro's fitness push: Tech giant all set to sponsor Bengaluru Marathon",
    "Govt crackdown soon on developers of delayed power projects: R K Singh",
    "Modi@9: Mission to clean up India continues, but Swachh Bharat 2.0 faces tall order",
    "RBI may need to buy $18 billion of bonds to add cash, says ICICI Bank",
    "Ashok Gehlot vs Sachin Pilot: Cong chief Kharge, Rahul Gandhi meet feuding leaders this evening",
    "Manipur violence is a blow to BJP’s hopes in pollbound Mizoram",
    "Crayons_Advertising_Limited_DRHP",
    "Hemant Surgical Industries Limited",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Enhancing fixed income returns when the yield curve is flat is not easy, but there’s a way out",
    "Six charts that influenced SEBI’s mutual fund total expense ratio proposals",
    "Passive investing gaining momentum but retail investors still have only a small share",
    "MF romance with logistics deepens with Delhivery, but fizzles out for Gati",
    "HDFC Defence Fund advances NFO closing date from June 2 to May 30",
    "Mutual funds brace for impact of Sebi consultation paper on total expenses",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "Simply Save: How 20% TCS will affect your investments in foreign stocks and property abroad",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Is your mutual fund justified for the expenses it charges you?",
    "How can retirees use MC30?",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "TDS, TCS aren’t money lost forever, you can adjust or claim it back",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Predictability of growth and demand pushes small town India’s fortunes",
    "Chart of the Day: India tops the pack in APAC office property market",
    "Oberoi Realty acquires 6.4 acres in Thane near Mumbai",
    "Sebi’s proposal allowing smaller REITs opens one door but shuts another",
    "Noida Authority asks builders to register 1,097 flats in 21 projects or face action",
    "Gold edges higher as traders eye US debt ceiling, Fed minutes",
    "Commodities Live: Copper prices at a six-month low | Silver prices declined by 8% in May",
    "The new gold boom: how long can it last?",
    "Gold steadies as US debt-ceiling talks make little progress",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Balaji Amines: Does it merit a look?",
    "Trade Spotlight | Your strategy for Route Mobile, Bajaj Electricals, Divi's Labs today",
    "Daily Voice | LIC Mutual Fund bullish on these 4 sectors for FY24, says this fund manager",
    "Everest Kanto is moved by -3.38",
    "Regency Ceramic is moved by 1.64",
    "Electronics Mar is moved by 3.20",
    "Only Sellers in Labelkraft Tech on BSE",
    "Brooks Labs has hit 52wk low of Rs 57.80 on NSE",
    "Vesuvius India is moved by 3.27",
    "Set SMS alerts for market news",
    "Tech funds: Cathie Wood can’t fight the Fed",
    "Sewage smells sweet in the stock market",
    "Agri Picks Report May 25, 2023: Geojit",
    "Borosil Renewables stock declines 3% as Q4 profit shrinks",
    "Piramal Pharma zooms 13.5% on strong sequential growth in Q4",
    "Commodities Live: Dollar strength weighs on commodities; copper and aluminum in focus",
    "Oil prices fall on US debt uncertainty",
    "PSU's start-up challenge to employ AI, renewables in ship design, construction",
    "Funding in Indian agrifoodtech startups falls 33% to $2.4 billion in 2022: Report",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "See More Top Companies in India",
    "Market remains watchful but there is good news on ITC, NMDC and Biocon | Market Minutes",
    "Should you bet on sectors with highest earnings growth? Moneycontrol Alpha",
    "BPCL surprises the Street, correction in IT stocks & more | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]