[
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Mankind Pharma INE634S01028, MANKIND, 543904",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18264.40\n\n+195.40 (+1.08%)",
    "Sensex\n\n61764.25\n\n+709.96 (+1.16%)",
    "RBI imposes Rs 1.73 crore penalty on HSBC for incorrect credit information",
    "NLC India board approves raising up to Rs 5,000 crore via bonds",
    "General Atlantic to deploy up to $1 billion a year in India",
    "Indian Railways record monthly freight loading of 126.46 MT for April 2023",
    "'ED's visit' nothing to do with Manappuram Finance, says its MD",
    "Invesco slashes Swiggy’s valuation to $5.5 billion; 2nd markdown in 4 months",
    "Moody’s expects Oyo’s EBITDA to increase by 65% to $55 million YoY in FY24",
    "Global financial situation daunting, but India well protected: DEA Secretary Ajay Seth",
    "Key takeaways from Berkshire annual meet: Buffett warns of US slowdown, China risks",
    "Kerala Boat Accident: 22 Dead After Houseboat Capsized In Malappuram | Rescue Ops Underway",
    "'Fundamentally Wrong' | Jaishankar Slams World Press Freedom Index",
    "FAANG stocks - Tide turning post strong earnings?| US tech stocks | Facebook | Apple | Google",
    "Why ‘Godfather Of AI’ Geoffrey Hinton Quit Google? | Dangers Of Artificial Intelligence (AI)",
    "FMCG Q4 Earnings: What Should You Watch Out For? | Britannia | Nestle | HUL | Dabur",
    "Stock Of The Day: CSB Bank | Will the shine of gold loans continue for CSB bank ?",
    "Living In One Of The Biggest 2 BHK In Mumbai | The Tenant",
    "Passengers face more uncertainty as refunds likely to take more time",
    "Banks in wait-and-watch mode on additional funding, seek clarity from cash-strapped airline",
    "Go First lessors request to deregister and export 13 more A320 aircraft, says DGCA official",
    "Tata Steel UK reports cash burn at $150 million in H2 FY22-23, above guidance",
    "Luxury carmakers eye 2X growth rate of passenger vehicle market in 2023",
    "India discovers massive lithium reserves in Rajasthan, likely to meet 80% of domestic needs",
    "MahaRERA may suspend registration of over 500 projects on compliance faliures",
    "Cyclone Mocha: Origin of its name and how cyclones get their names",
    "Nithin Kamath shares pic with father-in-law: ‘He’s the best example of how to live a good life’",
    "A DigiYatra-like voting experience as EC pilots facial recognition for elections",
    "CBSE introduces coding, AI, financial literacy from class 6 onwards",
    "Air India urination case: SC issues notices to Centre, DGCA on plea of woman for framing SOP",
    "Karnataka Election 2023 LIVE Updates: Campaigning for Karnataka elections end tomorrow",
    "Tobacco tax hike | Committee lies dormant, unlikely to submit report soon: Sources",
    "Cyclone Mocha: Intense rain, rough sea warning for parts of east India",
    "WhatsApp scam alert: Beware of calls, messages from international numbers",
    "News Live | Manipur violence: 60 innocent lives lost, 231 injured, says CM Biren Singh",
    "5 more cheetahs to be released into free-ranging conditions in MP's Kuno before monsoon",
    "Singapore’s soaring rents are becoming a political problem",
    "MG Comet EV first drive, review - Urban mobility solved?",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Man goes bungee jumping to celebrate divorce, falls 70 feet after rope snaps",
    "'Renting can make you wealthier than owning a home': Indian-origin millionaire Ramit Sethi",
    "This company threw a lavish party with branded drinks – then laid off 13 percent of its workforce",
    "Only in Bengaluru: Techie realises his neighbour is the founder of Rapido. Then…",
    "DRDO Scientist Arrested For Sharing Secrets With Pak ISI | Case Of Suspected Honey-Trap",
    "Tech Mahindra Q4 earnings miss expectations, Street keeps a cautious stance",
    "Immigration Central: Canada to deport 700 Indian students due to fake admission letters",
    "Itasha, the 'cringeworthy' cartoon cars of Japan, are making an image U-turn",
    "Russia says it has billions of Indian rupees that it can't use",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Manipur Violence: 23,000 flee violence in northeast India",
    "Tata IPL 2023: Hyderabad wins after no-ball drama; Gujarat in control",
    "Nithin Kamath shares pic with father-in-law: 'He's the best example of how to live a good life'",
    "This website is paying $1,000 to watch all 'Fast and Furious' movies. Here's why",
    "Elon Musk refutes rumours on father's wealth, again: 'He has been bankrupt for 25 years'",
    "Bengaluru entrepreneur's response to scammer offering job on WhatsApp is viral",
    "Advance / Decline (NSE) \n\n1201863",
    "Adani port gains entry into kotak largecap portfolio. kotak said adani...",
    "Always try not to d.options.22.34.886838.me trade blind d.options.22.3...",
    "Us market down so tomorrow indian market gap down.",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "German industrial output slumps, recession fears rise",
    "Chinese automaker BYD to make EVs in Vietnam",
    "Qualcomm to acquire Israeli auto-chip maker Autotalks",
    "MakeMyTrip adds AI voice chat to lure more travellers",
    "Adani units may drop out of MSCI index on review, analyst says",
    "User groups in real estate forced to evolve norms when policymakers fail",
    "India coal imports surge to 162 MT in FY23; inbound coking coal shipment grows to 54 MT",
    "‘The Kerala Story’ banned in West Bengal, decision taken to ‘maintain peace’: Mamata Banerjee",
    "A market for gender neutral dressing slowly comes of age",
    "Manipur Violence: A painful reminder that the traumas of the past remain strong in the Northeast",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Protean_eGOV_Technologies_Limited_addendum_II_to_the_DRHP",
    "Vishnu Prakash R Punglia Ltd.",
    "Will performance-linked fees help mutual fund investors?",
    "54% of new mutual fund investors are millennials",
    "Performance-based fee for mutual funds: What stakeholders say",
    "Performance based fee is the least SEBI can do to ensure better returns by mutual funds",
    "How do MNC mutual funds work?",
    "Sebi likely to come up with performance-linked incentive scheme for mutual funds",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "Life insurance stocks record renewed interest as investors shrug off growth concerns",
    "Weekly Tactical Pick – Why this insurer can turn out to be a star performer",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Roaring multi-asset mutual funds bet on these midcap stocks. Do you own any?",
    "WhiteOak Capital MF launches Multi-Asset Allocation Fund. Should you invest?",
    "How does MC30 measure risk in a mutual fund?",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "How to use I-T department’s Excel utilities to file returns",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "Birla Estates acquires 28.6-acre land parcel in Bengaluru, eyes Rs 3,000 crore revenue",
    "Luxury housing sales up 151% across major cities in Q1 2023: Report",
    "Flex space operators leased 2.9 million sq ft in Delhi-NCR in 2022: JLL report",
    "MC Explains: Can development work be reversed if a master plan is withdrawn?",
    "Over 87 land deals for over 1,862 acres closed in FY23 across India: Report",
    "Will setting up a high-rise committee help Delhi-NCR tackle structural safety issues?",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "Indian gold prices hit record high, dampen demand: Dealers",
    "India needs an urgent push to secure its copper resources",
    "Gold or fixed income: Which is better to help diversify your portfolio?",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Top 10 trading ideas for next 3-4 weeks as bulls dare the bear trap, keep markets charged",
    "Trade Spotlight | What's your game plan for Hitachi Energy, Engineers India, TVS Motor today?",
    "Hot Stocks | Here's why you should bet on NOCIL, Hitachi Energy India for short term",
    "Hot Stocks | Bet on Aditya Birla Capital, ABB India, Bharat Electronics for double-digit returns",
    "General Insurance Corporation tops Nifty500, up 18%",
    "Daily Voice | Green Portfolio's Divam Sharma expects a Fed pivot starting September",
    "Daily Voice | Union AMC CEO bullish on Indian equities, is overweight on these 4 sectors",
    "Mahanagar Gas Q4 net profit at Rs 269 crore, beats estimates; final dividend declared",
    "AVT Natural is moved by 0.63",
    "Sarla Performan is moved by 1.45",
    "Steel Str Wheel is moved by -0.47",
    "Kandarp Digi is moved by -2.43",
    "CMM Infraprojec is moved by 4.46",
    "Flexituff Ventures International",
    "Flexituff Ventu is moved by -5.28",
    "Set SMS alerts for market news",
    "Pension funds share blame for private equity’s horror stories",
    "Taking stock: Sensex jumps 710 points, Nifty closes above 17,250",
    "Agri Picks Report May 08,2023: Geojit",
    "Gainers & Losers: 10 stocks that moved the most on May 8",
    "Buy Alembic Pharma; target of Rs 704: KR Choksey",
    "Buy Cholamandalam Investment and Finance Company; target of Rs 1120: KR Choksey",
    "Metals gain on soft dollar index | Steel prices surge by 2.5% in China | Commodities Live",
    "Oil prices creep higher as recession fears begin to fade",
    "Start-up Street: ‘Boring’ businesses can turn into successful start-ups",
    "SaaS firm Pando raises $30 million in Series B",
    "ZestIoT raises $6.5 million in Series A round led by IvyCap Ventures",
    "See More Top Companies in India",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "M&M Financial: Is the optimism justified? | Moneycontrol Alpha",
    "Gamifying Pedagogy | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]