[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Adani Wilmar INE699H01024, AWL, 543458",
    "Apple US0378331005, AAPL:US",
    "Adani Ports INE742F01042, ADANIPORTS, 532921",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18314.40\n\n+111.00 (+0.61%)",
    "Sensex\n\n61963.68\n\n+234.00 (+0.38%)",
    "When economics collides with geopolitics",
    "It’s time to reform the Security Council: UN Secretary-General Guterres",
    "China poses 'biggest challenge to global security': Rishi Sunak",
    "Cholera outbreak claims ten more lives in South Africa",
    "Q4 Results Scorecard: The agony and the ecstasy",
    "Market gains for second day; Sensex up 234 points, Nifty above 18,300 as IT, metals shine",
    "SEBI’s performance-based fee plan throws MF industry into a tizzy",
    "RBI Governor Das explains why Rs 2,000 notes were withdrawn",
    "JSW Steel Q4 Results | ‘India’s Growth Fuelled Good Quarter’, Says Jayant Acharya",
    "Zomato, Nykaa, Paytm, Delhivery High On Mutual Fund Houses' Buy List In April: Time To Buy?",
    "WhatsApp Job Scam: 5 Tips To Ensure You Don’t Get Scammed!",
    "The Siblings Who Moved Next Door To Find A Parking Spot | The Tenant",
    "Maruti’s WagonR outsells every other car In the country. Here is why",
    "Aditya Birla Capital taps Jefferies, I-Sec, BofA Sec, Axis Cap for QIP",
    "JSW Steel to continue to look at value-accretive acquisition opportunities: CEO",
    "Race for HDFC Credila: Consortium of BPEA EQT, Chrys Capital & Faering Capital in the lead",
    "CESC Q4 net profit remains flat at Rs 445 crore",
    "Meta fined $1.3 billion over data transfers to US",
    "Black money finds no mention in RBI Governor Das' address on Rs 2,000 notes",
    "Fitch sees India doing all it can to cut fiscal deficit to 4.5% by FY26",
    "NCLAT upholds Go First's insolvency order, lessors asked to move NCLT",
    "Bengaluru's infrastructure nightmare continues",
    "Live News Today: Actor Sarath Babu passes away at 71 in Hyderabad",
    "Veteran Telugu actor Sarath Babu dies at 71",
    "RBI will ensure adequate liquidity in system, says governor Shaktikanta Das",
    "Nirvana frontman Kurt Cobain's smashed guitar sells for nearly Rs 5 crore at auction",
    "Karnataka teacher suspended for Facebook post criticising Siddaramaiah, freebies policy",
    "Infosys techie who died in Bengaluru rain fury had family visiting, hired MUV that drowned",
    "Independent Politicians: Heroes in local body elections but zeroes in general elections",
    "Lenders, housing, housing-related stocks, the best way to play investment upcycle",
    "14-year-old girl from Mumbai's Dharavi chosen as face of beauty brand",
    "Cannes red carpet was like Dadar station, says Indian influencer Niharika NM",
    "Banking Central: Black money menace, rampant fake currency behind Rs 2,000 note recall",
    "Delhi woman, driving BMW, runs over man while returning from party",
    "Tata Safari Facelift Spied Again; Fresh Details Revealed",
    "Newsletter with fundamental stock ideas, multi-baggers and insights",
    "Infosys techie drowns after car gets stuck in Bengaluru underpass after heavy shower",
    "Happy birthday, Clint Eastwood",
    "Bengaluru woman tattoos husband's name on forehead, gets criticised. Watch",
    "Banking Central | Black money menace, rampant fake currency behind Rs 2,000 note recall",
    "Closing Bell: Nifty ends above 18,300, Sensex up 234 pts; pharma, IT, metals rally",
    "Women wear 6 kg of clothes to avoid excess baggage fee, get fined by airline",
    "Airline weighs passenger ‘like baggage’ before flight, divides opinion",
    "Student wears Indian flag at his graduation in the US, Kiran Mazumdar Shaw reacts",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "Gainers & Losers: 10 Stocks that moved the most on May 22",
    "PM Modi conferred with Fiji's highest honour, holds talks with Papua New Guinea: See Pics",
    "Jeff Bezos, girlfriend make grand entrance at Cannes on $500 million superyacht",
    "Who is James Marape, Papua New Guinea leader who touched PM Modi's feet?",
    "Advance / Decline (NSE) \n\n10381044",
    "Gail (india) jumps on planning to borrow up in fy24",
    "Get daily cals with super all segments just texxct now on vhatsap e!gh...",
    "Results are out and availsble in bse",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "India’s gems and jewellery exports sluggish, industry hopeful for revival from July",
    "Suzlon bags 204 MW order from Serentica Renewables",
    "Tata Motors launches CNG version of Altroz; price starts at Rs 7.55 lakh",
    "L&T bags orders worth over Rs 2,500 crore in India, abroad",
    "Domestic demand to lay foundation for capex cycle despite global risks, finance ministry says",
    "‘Boomy’ talk about the Chinese economy is a charade",
    "Air strikes hit Khartoum as seven-day ceasefire approaches",
    "JPC needed to probe allegations against Adani group: Congress",
    "Netweb_Technologies_India_Limited_Corrigendum_to_DRHP",
    "Jupiter_Life_Line_Hospitals_Limited_DRHP",
    "JSW_Infrastructure_Limited_DRHP",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "SEBI wants mutual funds to catch front running, insider trading frauds",
    "Five Sebi proposals may make mutual funds cheaper and more transparent",
    "Commissions to drop if SEBI’s proposal to cut MF expense ratio goes through, say distributors",
    "Sebi's proposal on TER to curb mis-selling, bring in transparency",
    "Sebi's proposed fee caps could slash AMC profits by Rs 1,400 crore",
    "A surgical strike: HDFC MF launches defence-themed fund. Should you invest?",
    "Sebi proposes uniform total expense ratio for mutual funds",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Chart of the Day: Term premium has shrunk, a sign of many things",
    "HDFC Defence Fund NFO: Watch out for the hottest defence stocks",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Mumbai third on the list of top data centre markets in Asia-Pacific region: Report",
    "Tata Realty plans to develop 5 million sq ft office space in Bengaluru, to invest Rs 4,000 crore",
    "Titan Company purchases commercial space in Mumbai for Rs 100 crore",
    "Salman Khan to build 19-storey, sea-facing hotel in Mumbai: report",
    "Chintels Paradiso case: Residents unhappy with pace of CBI investigation, demand speedy resolution",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "Commodities Live: Commodities eye the G7 meeting, Powell speech today",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Divi’s Lab: Sequential improvement, but long way to go",
    "Concor Q4: Stable show amid a volatile macro environment",
    "Top 10 trading ideas for next 3-4 weeks as bulls take charge of Nifty, 8 weeks on",
    "Trade Spotlight | Your strategy for KEC International, Ramco Cements, Mastek today",
    "Hot Stocks | Here's why you should bet on NIIT, KEI Industries for short term",
    "Interview | 'Nifty likely hitting 19,000 by June, expect buying interest in these 4 stocks'",
    "Daily Voice | This fund manager is bullish on financials, capital goods, export manufacturers",
    "RBI unlikely to change policy stance in the next few meetings, says Weekend Investing founder",
    "GI Engineering is moved by -5.16",
    "Indo Thai Secu is moved by 4.76",
    "Cyber Media Research and Services",
    "Cyber Media Res is moved by 4.18",
    "Munjal Auto Ind is moved by -1.26",
    "Mahalaxmi Rub is moved by -0.02",
    "Timescan Logist is moved by 4.76",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | When economics collides with geopolitics",
    "Colonial exploitation included heritage theft, and that continues to this day",
    "Chart of the Day | Non-ferrous metals wilt, Dr Copper also under the weather",
    "Agri Picks Report May 22, 2023: Geojit",
    "NLC India Ltd jumps 7% on robust Q4 numbers",
    "Sun Pharma Advanced Research Company falls 5% as quarterly loss widens to Rs 82 crore",
    "US debt ceiling deal to set the tone for commodities market next week",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "US debt-ceiling worry weighs on market, stock picking key in capital goods | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "PVR-INOX: Time to check in? Moneycontrol Alpha",
    "Footage, Analytics & Actionable Insight | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]