[
    "Brightcom Group INE425B01027, BCG, 532368",
    "Suzlon Energy INE040H01021, SUZLON, 532667",
    "Apple US0378331005, AAPL:US",
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18771.25\n\n-85.60 (-0.45%)",
    "Sensex\n\n63238.89\n\n-284.26 (-0.45%)",
    "US, India back Ukraine 'territorial integrity'",
    "Monsoon starts with deficit in 2023, but situation not alarming yet",
    "Bitcoin, Ethereum continue upward march on BlackRock's ETF plan",
    "Asia stocks subdued after Jerome Powell testimony fails to surprise",
    "Twitter resumes paying Google Cloud",
    "Flurry of AI, defense deals as Joe Biden, PM Modi meet",
    "Adani Group statements to investors draw US regulatory scrutiny",
    "Top 15 things to know before the opening bell today",
    "Accenture bookings decline 22% sequentially, headcount falls by 6k",
    "Noida Restaurant Service Charge Fight: What To Do If A Restaurant Levies Service Charge?",
    "Raamdeo Agrawal: Stock market stalwart on the way forward, investment themes, hot sectors",
    "Fed chair Jerome Powell says ‘long way to go in fight against inflation’, signals more rate hikes",
    "Joe & Jill Biden lay out a vegetarian feast in the White House | What’s on the menu? | Modi in US",
    "Nifty Midcap consistently outperforming Nifty; 5 Midcap shares with huge return potential",
    "Here’s Why Singapore Slowdown May Impact Non-Resident Indians",
    "5 affluent passengers inside 'Titan' submarine| Oxygen supply elevates concern",
    "Here’s how you can spot whether a photo is real, or AI-Generated!",
    "Joe Biden, PM Modi hail new era for US-India ties and tout deals",
    "PM Modi, President Joe Biden hail decision to manufacture of GE F-414 engines in India",
    "Corporate leaders, lawmakers among guests at State Dinner hosted for PM Modi",
    "India, US take pride in diversity; our institutions based on democratic values: Modi",
    "HDFC invests in Bonito Design, Relata; divests entire stake in Ruralshores",
    "Wrong, baseless and incorrect: Vedanta on reports about selling its Sterlite Copper Plant",
    "Sebi bars Eros Intl MD and CEO from Board positions",
    "Three board members resign due to differences with founder Raveendran",
    "Moneycontrol Daily: Your Essential 7",
    "All five on Titanic sub dead after 'catastrophic' implosion",
    "Indians' funds in Swiss banks down 11% to Rs 30k crore on dip in customer deposits",
    "Applied Materials to invest $400 million in 4 years to build engineering centre in Bengaluru",
    "Monetary policy needs to remain in 'brace' mode, says RBI DG Patra",
    "Jayanth Varma says policy stance disconneted from reality, calls it vestigial",
    "Go First stops pilots’ retention allowance from July 1",
    "Suhana Khan buys agricultural land in Alibag for Rs 12.91 crore",
    "Meesho on TIME's 100 most influential companies",
    "5 lakh people hit, one dead as flood situation in Assam worsens",
    "RBI allows remittances under LRS for paying fees to foreign institutions in IFSCs",
    "Bengaluru society asks maids to use waiting areas over parks, gets slammed on Twitter",
    "Income Tax Return filing: Things to keep in mind while filing taxes",
    "2023 Hyundai Verna Turbo vs Volkswagen Virtus GT comparison review",
    "Daily Stock, Futures & Options, and Commodity Research Advice.",
    "DMRC looks for couple kissing on Delhi Metro 2 days after complaint, gets trolled on Twitter",
    "Closing Bell: Nifty below 18,800, Sensex down 284 pts; midcap index down 1%",
    "Neil DeGrasse Tyson on meeting PM Modi: 'I was delighted...'",
    "GE Aerospace, HAL sign MoU to produce fighter jet engines for IAF",
    "Hero MotoCorp unleashes Xtreme 160R 4V: A power-packed thrill for motorcycle enthusiasts",
    "In pics: At least 78 dead, hundreds missing as migrant ship sinks off Greek coast",
    "A US town is swarming with millions of Mormon crickets, covering roads, houses. Watch",
    "Man who went on Titanic sub recalls terrifying voyage: 'Suicide mission'",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "PM Modi at White House amid India-US bilateral meet. See pics",
    "Lamborghini celebrates milestone in India: 150th Huracán delivery marks record-breaking success",
    "90-year-old woman, living in house with two bulbs, gets electricity bill of Rs 1 lakh",
    "Man caught doing push-ups on road sign in Odisha. Viral video",
    "Remember Inspector Vivek from 'CID'? He's now working in Bengaluru as a…",
    "Ashneer Grover says airport lounges are like ‘free meal scheme canteens’",
    "Ahmedabad airport ‘black cocaine’ seizure: What is the drug and how it evades detection?",
    "Advance / Decline (NSE) \n\n5701482",
    "Market Analysis - Technical View",
    "Have an opinion on this news? post your comment here.",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "BOE is likely to announce 25 bps rate hike, as widely expected.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Nifty inches away from all-time high",
    "Read Ambareesh Baliga full Report",
    "Japan inflation slows to 3.2% in May",
    "Wall Street ends higher as Jerome Powell wraps up testimony",
    "Tata Steel says it won’t reach emissions goal with current tech",
    "Gainers & Losers: 10 stocks that moved the most on June 22",
    "Coal power capacity may rise as demand surges",
    "Govt likely to offer assured base pension in compromise with states: Report",
    "Organisational Culture: Revisiting the first principles of sustainability",
    "‘The Country Is His Family’: Why Modi and Other Top Indians Stay Single",
    "AAP to walk out of oppn meet if Cong doesn't promise support against Centre's ordinance: Report",
    "Mukka_Proteins_Limited_DRHP",
    "RBZ_Jewellers_Limited_DRHP",
    "CELL_POINT_INDIA_LIMITED_DRHP",
    "Sandeep Bagla: A fixed income market champion who is now building Trust MF brick by brick",
    "MFs’ deployment in up to 90-day CPs of NBFCs rises 21-month high in May: SEBI data",
    "Will HDFC MF’s new scheme revive the interest in consumer sector funds?",
    "Does the rush in small cap stocks indicate a risk-off market?",
    "Sensex hits a new all-time high: Time to stop SIP in equity mutual funds?",
    "SIP closures rise 7.4% month-on-month in May",
    "MC explains: Why third-party motor insurance is critical for all vehicles on the road",
    "Beware of employer-assisted housing loans. It is the ultimate golden handcuffs",
    "Now, insurance cos can launch group Ulips, combi plans without prior IRDAI nod",
    "Does life insurance make sense without tax benefits?",
    "LIC announces relaxations for victims of Biparjoy Cyclone",
    "Strengthening grievance redressal framework a work in progress: IRDAI chief",
    "How much health insurance should a fresher get?",
    "Small Savings Schemes: Income proof needed if investment exceeds Rs 10 lakh",
    "Why fixed income investors must now opt for shorter duration",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Retirement Planning in a Volatile Market",
    "Sensex on a high: Here’s why Mirae’s Swarup Mohanty loves largecaps",
    "LIC Mutual Fund set to acquire schemes of IDBI Mutual Fund",
    "Midcap index at record high: 10 stocks powering the mutual funds",
    "Simply Save | Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "ITR filing: Know the difference between AIS and Form 26AS before filing your income tax return",
    "Using AI, Income-Tax department sends notices to tax evaders for fake donations",
    "Direct tax collections at Rs 3.8 lakh crore, up 11.2% so far in FY24",
    "Income tax returns: Types of TDS certificates and why they are needed",
    "Old is gold: Income tax exemptions &amp; deductions that senior citizens can claim",
    "Grade A commercial space in top six cities touches 700 mn sq ft: CREDAI-CRE Matrix Report",
    "Ashrai Infra launches office and high-street retail project in Greater Noida west",
    "Looking beyond net zero: Retrofitting, ESG crucial to meet real estate's sustainable goals",
    "Bengaluru society asks housekeepers to use waiting areas over parks, gets slammed on Twitter",
    "24% decline in unsold homes priced above Rs 2.5 crore in MMR: Report",
    "EFC India plans to almost triple office space capacity to 60,000 seats",
    "Latest gold prices: Three-month tested as Jerome Powell's comments weigh",
    "Gold hovers near 3-month low on Powell comments",
    "Latest gold prices: At 3-month low on hawkish US Fed",
    "Gold slides 1% on strong US housing data, firmer dollar",
    "Commodities Live: Strong Domestic & Export Demand Push Prices of Spices To Record Highs!",
    "Latest gold prices: Below $1950, near three-month low",
    "Latest gold prices: Rangebound around $1950, eye on BoE, Jerome Powell's testimony",
    "EPF or NPS: Which is the better investment option?",
    "70% of NPS annuity subscribers choose single life policy to pass on principal to nominee: PFRDA",
    "Minimum assured return on the cards, rollout in the near future: PFRDA chief",
    "NPS Equity funds shine, but struggles to beat broader indices",
    "NPS: Securing India’s greying population",
    "Explained: Debt investments through NPS",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Karur Vysya bank to set up dedicated home loan branches in Mumbai, Bengaluru",
    "Chart of the Day: PSU banks show first sign of loan market share gain in FY23",
    "With RBI hitting a pause, what happens to your EMIs?",
    "Bank of Korea warns of financial risk as real estate loans fail",
    "Jaiprakash Associates defaults on Rs 3,961 crore loans on May 31",
    "RBI panel suggests penalty for home loan providers on loss of borrowers' documents",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card boom in India: 10 crore cards expected by 2023 end",
    "American credit card users owe nearly $1 trillion: Here’s how to avoid their mistakes",
    "Car breakdown or a flat on the expressway? Your credit card can rescue you",
    "Credit cards transactions rise 30.1% in FY23 in volume: RBI Annual Report",
    "Credit cards are useful, but an emergency fund they ain’t",
    "Airmiles, lounge benefits, free hotel room: Credit cards line up goodies for summer holidays",
    "Trade Spotlight | How should you deal in Aether Industries, BSE, JBM Auto today",
    "Trade Spotlight | Your strategy for JSW Energy, Linde India, Tube Investments today",
    "Hot Stocks | Bet on Indiabulls Housing Finance and GNFC, sell JSW Steel for short term",
    "Trade Spotilght | How to trade in Shriram Finance, Balkrishna Industries, Dr Lal Path Labs",
    "Visesh Infotech closes below 30-Day,50-Day Moving Average today.",
    "Medico Remedies closes below 150-Day Moving Average of 72.43 today.",
    "KCK Ind closes below 30-Day Moving Average of 22.42 today.",
    "RKEC Projects closes below 30-Day,150-Day Moving Average today.",
    "Vaswani Ind closes below 200-Day Moving Average of 21.33 today.",
    "GTL Infra closes below 30-Day,50-Day Moving Average today.",
    "Megasoft closes below 150-Day Moving Average of 31.11 today.",
    "Set SMS alerts for market news",
    "Justin Trudeau diversified Canada’s economy like no one before",
    "Amazon Prime suit puts subscription services on notice",
    "No rain in Panama means more pain in LNG",
    "Oil steadies after sliding on UK rate hike",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "Called out by intern for not paying stipend, Soshals app founder’s justification",
    "Start-up Street: Micromanaging founders can kill their own start-ups",
    "See More Top Companies in India",
    "LESSONS IN MARKETING EXCELLENCE",
    "TCS bags $1 billion deal, Carlyle to exit Delhivery & more | Market Minutes",
    "Missing advance tax payments data in ITR forms complicates taxpayers' lives",
    "Oops...Your Annual Information Statement might have crucial errors | Simply Save",
    "Getting India Smart & Connected | Unusual Suspects",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]