[
    "Adani Enterpris INE423A01024, ADANIENT, 512599",
    "Vedanta INE205A01025, VEDL, 500295",
    "Apple US0378331005, AAPL:US",
    "Adani Ports INE742F01042, ADANIPORTS, 532921",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18418.55\n\n+104.15 (+0.57%)",
    "Sensex\n\n62234.72\n\n+271.04 (+0.44%)",
    "Jamie Dimon has no plans to step down as JPMorgan CEO anytime soon",
    "Go First’s aircraft lessors caught in a legal tangle, sent back to NCLT",
    "Meta fined $1.3 billion over data transfers to US",
    "Is there panic buying in gold jewellery using Rs 2,000 notes?",
    "MC Exclusive | RBI junks Dhanlaxmi Bank proposal on chairman",
    "Growth-starved edtech soonicorns stare at a valuation crisis",
    "Market LIVE Updates: Sensex up 250 pts, Nifty at 18,400; Bajaj Finserv, IndusInd Bank top gainers",
    "JSW Steel Q4 Results | ‘India’s Growth Fuelled Good Quarter’, Says Jayant Acharya",
    "Zomato, Nykaa, Paytm, Delhivery High On Mutual Fund Houses' Buy List In April: Time To Buy?",
    "WhatsApp Job Scam: 5 Tips To Ensure You Don’t Get Scammed!",
    "The Siblings Who Moved Next Door To Find A Parking Spot | The Tenant",
    "Maruti’s WagonR outsells every other car In the country. Here is why",
    "Adani Ports recoups all stock losses since Hindenburg attack",
    "BPCL's strong Q4 show: What analysts are saying",
    "Gland Pharma shares tumble 34% in 2 days",
    "Macquarie changes Zomato, Delhivery ratings: Check here",
    "Carmakers to pump in over Rs 1.2 lakh crore over next few years",
    "Plans to pare debt by 90% in 3 years: Ajmera Realty director",
    "Delhi HC reserves order in Rs 2,000 note exchange PIL",
    "Coaching institutes watch out. ChatGPT is coming for your students",
    "Insurers selling mutual funds: What experts say",
    "PM Modi in Australia Live Updates: NRIs reach Sydney on charter flight to greet PM Narendra Modi",
    "Ola Electric valued at $6 billion after latest funding round",
    "Blackstone, KKR among marquee PE funds in race for Glenmark Life Sciences",
    "Zoom lifts full-year sales forecast, focuses on products for business to boost growth",
    "RBI’s dollar purchases casting a pall over rupee",
    "US Fed on brink of policy U-turn? Time may be right to think gold",
    "RSS affiliate says Rs 2,000 note withdrawal to hit black money",
    "NCLT asks NSE, BSE to review approvals to Zee-Sony merger: Report",
    "Vivriti seeks $250 million for debut India ABS Private Debt Fund",
    "'Modi Airways': NRIs in Australia charter flight to Sydney to greet PM",
    "Rising share of non-fossil fuels to make power generation in India cleaner",
    "PM Modi has a new follower as Papua New Guinea PM opens Twitter account",
    "Tata Safari Facelift Spied Again; Fresh Details Revealed",
    "Newsletter with fundamental stock ideas, multi-baggers and insights",
    "Happy birthday, Clint Eastwood",
    "Take a look at the ‘Journey Beyond Unicorn’ with Nikhil Kamath",
    "Jeff Bezos, girlfriend make grand entrance at Cannes on $500 million superyacht",
    "Vedanta declares first interim dividend for FY24; details here",
    "Bengaluru woman tattoos husband's name on forehead, gets criticised. Watch",
    "Infosys techie drowns after car gets stuck in Bengaluru underpass after heavy shower",
    "In Pics: Kohli's sublime century powers Bangalore to crucial win in Indian Premier League 2023",
    "How tax on foreign tour spends on credit cards will affect your holidays",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "PM Modi arrives in Sydney to hold talks with Australian counterpart Anthony Albanese",
    "Scorching summer: Heatwave alert for Delhi, Uttar Pradesh and other states",
    "Inside 'Modi Airways', charter flight to Sydney for NRIs to greet PM. Watch",
    "Jeff Bezos engaged to Lauren Sanchez with a 20-carat diamond: reports",
    "Suniel Shetty on WFH vs work-from-office: 'Taste of real pressure'",
    "'Shocking, just can't believe': SS Rajamouli on 'RRR' actor Ray Stevenson's death",
    "Cannes red carpet was like Dadar station, says Indian influencer Niharika NM",
    "Advance / Decline (NSE) \n\n1265740",
    "Buying seen - my target for itc is rs 440 for the intraday with a stop...",
    "200 point down to nahi up ho gaya",
    "What else do you want?. in last 3 months from 2900 to 3400. almost 20%...",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Read Ambareesh Baliga full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Republican US Senator Tim Scott launches presidential bid with optimistic message",
    "Tesla offers China-made electric vehicles for sale in Canada",
    "Explainer: How the World Health Organization could fight future pandemics",
    "Kalpataru Power Transmission rechristened as Kalpataru Projects International",
    "Venus Remedies gets GMP certification from Kenya for production facilities in Baddi",
    "India's pre-pandemic long-term inflation rate seen at 4.3%: RBI staff analysis",
    "Big investors rush into bonds after ‘cataclysmic’ year",
    "Russia pushes India for help to avert Global Financial isolation",
    "Rahul Gandhi takes truck ride from Delhi to Chandigarh, listens to 'Mann Ki Baat' of drivers",
    "Farmers and industry suffer as pesticides regulations stay lax",
    "Nova_Agritech_Limited_Addendum_to_DRHP",
    "Netweb_Technologies_India_Limited_Corrigendum_to_DRHP",
    "Jupiter_Life_Line_Hospitals_Limited_DRHP",
    "JSW_Infrastructure_Limited_DRHP",
    "Insurers selling mutual funds positive for both; can increase compliance burden",
    "How can retirees use MC30?",
    "Get paid only if you perform: SEBI’s plan throws MF industry into a tizzy",
    "SEBI wants mutual funds to catch front running, insider trading frauds",
    "Five Sebi proposals may make mutual funds cheaper and more transparent",
    "Commissions to drop if SEBI’s proposal to cut MF expense ratio goes through, say distributors",
    "Sebi's proposal on TER to curb mis-selling, bring in transparency",
    "Sebi moots proposal to strengthen investor grievance mechanism",
    "Moneycontrol Daily: Your Essential 7",
    "ZestMoney to stop insurance biz, affiliate programmes as it charts revival plan",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Is your mutual fund justified for the expenses it charges you?",
    "Finmin's Rs 7-lakh relief to taxing foreign spends on credit cards can't resolve TCS crisis",
    "20% TCS On International Credit Card Spends: The How, What, Why Answered! | Experts' Take",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Operational office stock offers REIT-worthy assets valued at over $61 billion for future listing",
    "Wave Megacity’s 38 Noida properties to be auctioned for non-payment of dues",
    "Rs 2,000 note withdrawal: Real estate experts see rise in land, secondary deals in cash",
    "REITs and InvITS must ensure dematerialisation of securities by June 30: Sebi",
    "Mumbai third on the list of top data centre markets in Asia-Pacific region: Report",
    "Ground Report | No panic in gold jewellery market on Rs 2,000 note withdrawal",
    "Gold dips as Fed officials suggest higher-for-longer US rates",
    "Jewellers getting more inquiries for gold after RBI withdraws Rs 2,000 notes; no panic buying",
    "Commodities Live: Commodities eye the G7 meeting, Powell speech today",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "NPS also invests in equities. Here’s how",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "Why a down payment corpus is just as important when taking a home loan",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Using credit card reward points for domestic travel: A guide",
    "Paytm, SBI Cards launch Paytm SBI Card on the RuPay network",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Delhivery: A reality check on the growth hype",
    "Balkrishna Industries on a breakout, stock shows fresh bullish overtone",
    "Trade Spotlight | How to trade in Elgi Equipments, Muthoot Finance, Mastek today",
    "Hot Stocks | Bet on Godrej Industries, IDBI Bank, MSTC for at least 11% return in short term",
    "Divi’s Lab: Sequential improvement, but long way to go",
    "Daily Voice | LIC Mutual Fund bullish on these 4 sectors for FY24, says this fund manager",
    "Interview | 'Nifty likely hitting 19,000 by June, expect buying interest in these 4 stocks'",
    "Daily Voice | This fund manager is bullish on financials, capital goods, export manufacturers",
    "ILandFS Investment Managers",
    "Refex Ind is moved by 6.53",
    "Only Sellers in Vikas Proppant  on BSE",
    "Ushanti Colour  is moved by 10.29",
    "Transwarranty is moved by 5.43",
    "Network 18 Media & Investments",
    "Network 18 is moved by 3.24",
    "Set SMS alerts for market news",
    "Why Rainbow’s investors are not worried about its big capex plans",
    "Agri Picks Report May 23, 2023: Geojit",
    "Oil prices rise on outlook for higher gasoline demand, tighter supply",
    "Garware Technical Fibres gains 4% on wider profits in Q4",
    "Fusion Micro Finance rallies 3% on robust Q4 results",
    "Analysts see up to 20% upside in BPCL shares post Q4 show, stock among top Nifty gainers",
    "Oil futures steady as US default risk offsets supply decline",
    "Start-up Street: When business advisors cheat entrepreneurs",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "See More Top Companies in India",
    "BPCL surprises the Street, correction in IT stocks & more | Market Minutes",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Footage, Analytics & Actionable Insight | Unusual Suspects",
    "PVR-INOX: Time to check in? Moneycontrol Alpha",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]