[
    "Mankind Pharma INE634S01028, MANKIND, 543904",
    "Rail Vikas INE415G01027, RVNL, 542649",
    "Apple US0378331005, AAPL:US",
    "Larsen INE018A01030, LT, 500510",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18297.00\n\n-18.10 (-0.10%)",
    "Sensex\n\n61904.52\n\n-35.68 (-0.06%)",
    "SC gives go-ahead to resolution plan submitted by Supertech",
    "Puma appoints K Balagopalan as India Managing Director",
    "Jio, Airtel add 19.8 lakh subscribers in February: Trai",
    "Trade setup for Friday: Top 15 things to know before the opening bell",
    "AI pilot unions fold in standoff with airline, pilots free to sign new contracts",
    "PM allocated Rs 1,200 cr to invest in Indian semiconductor start-ups: IT minister",
    "WhatsApp claims new AI efforts reduce international spam calls by at least 50%",
    "Is ONDC Really Cheaper Than Zomato & Swiggy? | ONDC vs Food Delivery Apps | e-Commerce",
    "Apple’s India push | Foxconn buys 300-acre site in Bengaluru",
    "NR Narayana Murthy & Sudha Murty cast votes in Bengaluru, listen to their message to young voters!",
    "Cyclone Mocha: How Are Cyclones Named? | When Will Cyclone Mocha Make Landfall?",
    "US debt ceiling crisis explained: Clock ticks to debt default, Biden holds urgent meetings",
    "Imran Khan's arrest: Protests rage in Pakistan after former PM arrested on corruption charges",
    "NCLT decision to admit Go First's insolvency riles lessors & vendors",
    "BharatPe is a $3 billion write-off, value destroyed by Rajnish Kumar: Ashneer Grover",
    "GoFirst's resolution professional reassures employees that airline will restart operations",
    "Barely 4 in 10 Indian employees using AI despite rising demand, shows study",
    "Europe would have been in deeper recession in absence of Russian oil: Puri",
    "IBLA 2023: Give ONDC time, we will see good take-off in next 2-3 years, says NPCI's Dilip Asbe",
    "Coal prices likely to be hiked as CIL prepares to revise wages: Sources",
    "Eyeing orders worth Rs 10 lakh cr, aim to have order win rate of 15-20%: L&T CFO",
    "Why corporates are moving away from Connaught Place to Gurugram & Noida",
    "Same-sex marriage case: Who argued for and against the matter in Supreme Court?",
    "News Highlights: Pakistan SC orders immediate release of PTI chief Imran Khan",
    "Karnataka’s unhappy tryst with hung assemblies and coalition governments",
    "MC Exclusive: NSE paid out Rs 500-1,000 crore to brokers in rebates on options trades",
    "Karnataka Election 2023 Highlights: Scindia certain BJP will win in Karnataka",
    "SC gives go-ahead to resolution plan submitted by Supertech before insolvency court",
    "Larsen & Tourbo: Buy into weakness? | Moneycontrol Alpha",
    "SpiceJet quashes insolvency talk, says efforts on to revive grounded fleet",
    "Uddhav Thackeray can't be restored as CM, says Supreme Court",
    "Yuzvendra Chahal becomes the highest wicket-taker in IPL history",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Newsletter with Stock & Index F&O trading advice and market analysis",
    "Pakistani actor wants to file complaint against PM Modi. See Delhi Police's hilarious response",
    "Closing Bell: Indices close marginally lower; Dr Reddy's, L&amp;T, Hindalco, Divi's Lab top losers",
    "Karnataka Election 2023 Live: Scindia certain BJP will win in Karnataka",
    "Karnataka Exit Polls: How accurate were they last time?",
    "Live News Updates: Pakistan SC orders immediate release of PTI chief Imran Khan",
    "Boy who dropped out of school at 17 is now a retired millionaire at 22",
    "Bengaluru’s MG Road tops high street rankings, Hyderabad’s Somajiguda comes second",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "National Technology Day 2023: PM Modi launches projects worth Rs 5,800 crore",
    "Jennifer Bansiwal quits 'Taarak Mehta Ka Ooltah Chashmah', files sexual harassment case",
    "Cruise ship passenger installed hidden camera in bathroom, filmed 150 people before he was caught",
    "Man charged with abetting suicide of young girl ends life",
    "Sundar Pichai tells you how to get full refund for a cancelled flight",
    "Advance / Decline (NSE) \n\n1205799",
    "Nothing going to happen tomorrow..as usual no deep red or green .flat ...",
    "Nifty views posted by s.options.22.34.886838.me so many boarders here ...",
    "If petrol diesel are included in gst, then sky has no limits. iocl wil...",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Rupee continues its positive momentum, despite uptick in dollar index.",
    "Read Mecklai Financial full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets end flat, FII flows supports",
    "Read Ambareesh Baliga full Report",
    "Five Takeaways From Donald Trump’s Unruly CNN Town Hall",
    "Pakistan's ex-PM Imran Khan arrested: The country's history of imprisoning its prime ministers",
    "IBLA 2023: A look at the leading business icons and political figures who attended the event",
    "Man Group appoints its first female CEO in 240 years",
    "NIIF appoints Rajiv Dhar as interim CEO",
    "Adopting global best practices can help India Inc strengthen ESG performance",
    "India funding costs surge to one-month high on cash squeeze",
    "Businesses with turnover of over Rs 5 crore to generate e-invoice from August 1",
    "Pakistan: What next for Imran Khan? Perhaps a bleak future",
    "AAP calls SC verdict on Centre-Delhi services row 'tight slap' on mission to topple govts",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "MC30 funds for investors new to equity market",
    "Why investors are picking corporate-bond funds",
    "Equity inflows crash 70% to Rs 6,480 crore in April, stay in positive zone for 26 straight months",
    "Some mutual fund houses cut down expense ratio on Nifty 50 ETFs to benefit passive investors",
    "Got Rs 10 lakh to invest? Kotak AMC’s Harish Krishnan shares strategy for retail investors",
    "Fear and greed: Two behavioural traits that lead to wrong investments",
    "Will performance-linked fees help mutual fund investors?",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "What are proportionate deduction waiver covers?",
    "Moneycontrol Daily: Your Essential 7",
    "How staying fit benefits your health as well as your health insurance premium",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "How is MF expense ratio calculated?",
    "Why short duration funds are all weather funds",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "Colliers India expected to hire 400 employees, enter more tier-2 markets",
    "CBRE partners with NASSCOM for DISRUPTECH 2.0 to support, mentor startups",
    "K Raheja Corp, Aditya Shagun Developers to build 3 mn sq ft IT park in Pune",
    "Vatika group partners with IREAA India for leasing retail projects in New Gurugram",
    "MHADA lottery 2023: Results announced for Konkan Board lottery of 4,640 affordable homes",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "King Dollar and Queen Gold are here to stay",
    "Gold gains with focus on US inflation readings",
    "Gold imports dip 24% to $35 billion in 2022-23",
    "India's gold demand in January-March drops by 17% to 112.5 tonnes due to high prices: WGC",
    "Record gold prices to dampen Indian demand in June, September quarters: WGC",
    "JPMorgan sees investors moving to Gold, tech amid recession risk",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Gold loans: Banks and NBFCs that offer the lowest interest rates",
    "RBI drafts rules on loan penal charges. How will they benefit loan borrowers?",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "Women’s day 2023: Best credit cards for women",
    "Nazara Technologies: Blockbuster end to the year",
    "Trade Spotlight | Your trade for Cyient, Jubilant Pharmova, Engineers India today",
    "DCB Bank: Risk-reward extremely favourable, buy for long term",
    "Trade Spotlight | Your strategy for Firstsource Solutions, Nazara Tech, Varun Beverages today",
    "MC Interview | Don't expect shortage of coal, imports will continue to increase: Coal Secretary",
    "SAIL closes above 150-Day Moving Average of 83.98 today.",
    "Tracxn closes below 30-Day Moving Average of 68.16 today.",
    "Kapston Service closes below 150-Day Moving Average of 134.57 today.",
    "Integra Essenti closes below 200-Day Moving Average of 6.83 today.",
    "Five-Star Business Finance",
    "Five-Star Busin closes below 30-Day,50-Day Moving Average today.",
    "Zenithexpo closes below 30-Day Moving Average of 82.99 today.",
    "D. P. Abhushan closes above 30-Day Moving Average of 315.22 today.",
    "Set SMS alerts for market news",
    "Moneycontrol Pro Panorama | Will GoAir’s manoeuvre end in a safe landing?",
    "ONDC has made a promising start. But, it could learn from ‘Market Design’",
    "Taking Stock: Sensex, Nifty ends listless but broader market shows some spark",
    "Gainers & Losers: 10 stocks that moved the most on May 11",
    "Aditya Birla Capital shares fall 4% despite sharp increase in Q4 profitability",
    "Reduce Computer Age Management Services; target of Rs 2000: HDFC Securities",
    "Crude oil prices firm as USD retreats | China's crude import declines by 16% | Commodities live",
    "Agri Picks Report May 11,2023: Geojit",
    "Oil prices rise on strong fuel demand data",
    "Startup Incubators: Are they worth it?",
    "Distribution and logistics startup Ripplr gets $40 million in Series B round",
    "See More Top Companies in India",
    "Larsen & Tourbo: Buy into weakness? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "Did Dr Reddy's, L&T and Novelis meet Q4 Street estimates? Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]