[
    "Tata Motors INE155A01022, TATAMOTORS, 500570",
    "IOC INE242A01010, IOC, 530965",
    "Apple US0378331005, AAPL:US",
    "Infosys INE009A01021, INFY, 500209",
    "Microsoft US5949181045, MSFT:US",
    "Fixed Deposit Interest Calculator",
    "Credit Card Debit Payoff Calculator",
    "Assets Allocation Planning",
    "Debt Evaluation Calculator",
    "Current Expense Calculator",
    "MC HEALTH INSURANCE RATINGS",
    "Commodities chat with Manisha Gupta",
    "AMBAREESH BALIGA\nFundamental, Stock Ideas, Multibaggers & Insights\nSubscribe",
    "CK NARAYAN\nStock & Index F&O Trading Calls & Market Analysis\nSubscribe",
    "SUDARSHAN SUKHANI\nTechnical Call, Trading Calls & Insights\nSubscribe",
    "T GNANASEKAR\nCommodity Trading Calls & Market Analysis\nSubscribe",
    "MECKLAI FINANCIALS\nCurrency Derivatives Trading Calls & Insights\nSubscribe",
    "SHUBHAM AGARWAL\nOptions Trading Advice and Market Analysis\nSubscribe",
    "MARKET SMITH INDIA\nModel portfolios, Investment Ideas, Guru Screens and Much More\nSubscribe",
    "TraderSmith\nProprietary system driven Rule Based Trading calls\nSubscribe",
    "STOCK REPORTS BY THOMSON REUTERS\nDetails stock report and investment recommendation\nSubscribe",
    "POWER YOUR TRADE\nTechnical and Commodity Calls\nSubscribe",
    "INVESTMENT WATCH\nSet price, volume and news alerts\nSubscribe",
    "STOCKAXIS EMERGING MARKET LEADERS\n15-20 High Growth Stocks primed for price jumps\nSubscribe",
    "Enjoy seamless experience on APP10x faster & More Feature",
    "Auriferous Aqua Farma , 519363",
    "Upgrade your experience\t\t\t\t\t\t\t\t\t\t\tRemove ads",
    "Business In The Week Ahead",
    "MC Health Insurance Ratings",
    "Unlocking opportunities in Metal and Mining",
    "Nifty 50\n\n18184.10\n\n-102.40 (-0.56%)",
    "Sensex\n\n61592.90\n\n-339.57 (-0.55%)",
    "Prestige Group to widen mall portfolio with 8 new properties in 4 years",
    "Mumbaikars to get weather updates on phone during monsoon: BMC",
    "Tata starts iPhone making in Bengaluru, seeks to acquire Wistron factory",
    "The worrying reasons behind disinflation and declining exports",
    "Import of laptops, PCs, medical devices, solar cells from China falls",
    "How high demand, layoffs are pushing landlords to screen prospective tenants in Bengaluru",
    "Softening inflation lifts rate cut hopes; will the weather gods oblige?",
    "Why a down payment corpus is just as important when taking a home loan",
    "Market LIVE Updates: Sensex falls 300 pts, Nifty below 18,200 dragged by IT, power, realty",
    "BSE MD & CEO Sundararaman Ramamurthy exclusive on Sensex, Bankex F&O relaunch",
    "\"BharatPe is a $3 bn write-off\" Ashneer Grover hits back l Ashneer Grover's reaction to EOW's FIR",
    "Stock of The Day: Home First Finance | What makes it a preferred bet in housing finance space?",
    "Watch: Reasons for disparity in GST collection among different states",
    "Karnataka Election 2023: Can Congress Deliver On Promises Made In Manifesto?",
    "Why PM Modi’s state visit to the US is especially significant this time | Explained",
    "MC Exclusive: CapitaLand to deploy Rs 4,500 cr over next 6-7 years",
    "Bharti Airtel beats profit estimates with 50% jump in net: What should you do with the stock?",
    "Shares of Jindal Steel & Power fall 3% as Q4 profit slumps 79%",
    "Vodafone Idea slumps 2% after British parent values its India investment at nil",
    "ChatGPT and co will take quite a while to match financial advisors",
    "India remains a bright spot, economy expected to grow 6.7% in 2024: UN",
    "Stubborn cash squeeze risks derailing economic recovery",
    "Avoid these 5 financial mistakes to safeguard yourself from heavy losses",
    "Karnataka News LIVE Updates: No question of resigning even if not CM, says Shivakumar",
    "BMC gets tech savvy, develops weather notification system for Mumbai citizens",
    "Tesla executives to meet govt officials today, tomorrow to firm up supply chain",
    "US consumers have some $500 billion of excess savings to spend",
    "Kim Kardashian's $1 billion buyout pitch leans on her social media reach",
    "Govt out to tighten reins on royalty payments by OTT, IT and ITES: Sources",
    "US default may trigger recession, 'break' financial markets, Janet Yellen warns",
    "What smartphone does the CEO of Google use? Sundar Pichai reveals in viral video",
    "Mike Pence calls for end to Fed’s jobs role as he weighs 2024 bid",
    "Buying spree: Zomato, Nykaa among top mutual fund additions in April",
    "Meta India's head of partnerships Manish Chopra steps down",
    "Oil dips on demand worries after unexpected US crude build",
    "New Hyundai Exter variants, colours, and powertrain explained",
    "Newsletter with commodity research advice and market analysis",
    "Bengaluru's traffic nightmare: Techies stuck in IT corridors for hours, many return home",
    "‘Are you joking?’ Sudha Murty's 10 Downing Street address stuns UK immigration officer",
    "'I'm grieving': Amazon employee laid off in Bengaluru",
    "Arjun Tendulkar bitten by dog before big Mumbai Indians IPL game, memes follow",
    "Trade setup for today: Top 15 things to know before the opening bell",
    "CEO says remote workers are hurting businesses: ‘We caught trains, buses, ferries to work’",
    "When Sudha Murty, in salwar kameez, was called 'Behenji' at London airport",
    "Ex-TCS, Amazon employee reveals he got offers with 30% hike even after being laid off",
    "How Lucknow woman got interview calls from Google, Microsoft, Amazon, Infosys and Goldman Sachs",
    "Exclusive:ग्रोथ और मुनाफा दोनों हमारे लिए हैं अहम- फाल्गुनी नायर",
    "बाजार में गिरावट का दौर जारी, Sensex 435 अंक टूटा- Nifty 17900 के नीचे बंद",
    "एक्सपायरी के दिन बाजार का मूड खराब, Sensex 600 अंक तक टूटा, जानिए वजह?",
    "PolicyBazaar IPO Refund: क्या आपको शेयर भी नहीं मिले और पैसे भी नहीं लौटे तो जानिए क्या है मामला?",
    "नवाब मलिक के दामाद ने देवेंद्र फडणवीस को भेजा 5 करोड़ रुपये का मानहानि का नोटिस",
    "क्रिप्टो करेंसी पर आई आरबीआई गवर्नर की चेतावनी, कहा फाइनेंशियल स्टेबिलिटी के लिहाज से है खतरनाक",
    "SBI या Post Office? जानिए आपको कहां निवेश करके मिलेगा सबसे ज्यादा ब्याज- जानें डिटेल्स",
    "Nykaa IPO: फाल्गुनी नायर की दौलत में इजाफा, अरबपतियों की लिस्ट में हुईं शामिल",
    "YES Securities ने कमजोर Q2 नतीजों के बाद इस सीमेंट स्टॉक की घटाई रेटिंग, जानिए वजह?",
    "MSCI इंडेक्स में कल होगा बदलाव का ऐलान, जाने कौन सी कंपनियां होंगी शामिल और कौन बाहर",
    "Kangana Ranaut: जानें, पद्म पुरस्कारों के दौरान क्यों करण जौहर को ढूंढ रही थीं कंगना रनौत?",
    "यूएस एफडीए से लगा झटका, ये फार्मा शेयर 4% टूटा, क्या है आपके पास?",
    "कोरोना वायरस महामारी से फैला 80 लाख टन प्लास्टिक कचरा – रिपोर्ट",
    "US Debt Ceiling: All you need to know about it",
    "'15-minute phone call': Indian Amazon employee laid off in US",
    "'Time for my Bollywood debut?' US ambassador meets Shah Rukh Khan at 'Mannat'",
    "Cannes 2023: Sara Ali Khan goes full desi for Cannes debut, Esha Gupta stuns in white",
    "Advance / Decline (NSE) \n\n8241145",
    "Sail result may be on saturday",
    "Hold only stock hfcl ltd u2026u2026 expected big order news and buy on dip...",
    "Looks like results leaked and insiders selling. sudden fall today",
    "Sign Up for F&O Advice & Analysis by Dr. CK Narayan",
    "Read C. K. Narayan full Report",
    "Sign Up for Long Term Calls & Analysis by Ambareesh Baliga",
    "Markets gains on sustained FII flows",
    "Read Ambareesh Baliga full Report",
    "Sign Up for Commodity Calls & Analysis by T Gnanasekar",
    "Read T Gnanasekar full Report",
    "Sign Up for Currency Calls & Analysis by Mecklai Financial",
    "Read Mecklai Financial full Report",
    "Sign Up for Technical Calls & Analysis by Sudarshan Sukhani",
    "Read Sudarshan Sukhani full Report",
    "Shell to use new AI technology in deep sea oil exploration",
    "Elon Musk says Tesla not immune to tough economy that he foresees",
    "Australia cancels Quad leaders summit after Joe Biden postpones trip; may meet at sidelines of G7",
    "Suzlon bags 99-MW wind energy project from Vibrant Energy",
    "Why this small niche NBFC deserves a place in the portfolio",
    "India set for LNG deal-making rush in win for Modi’s gas push",
    "India’s exports set to feel the heat from weakening global growth",
    "Startup valuations reset a reflection of the investment landscape’s dynamism",
    "Congress to send observers to Manipur to assess ground situation",
    "Rahul Gandhi to visit US in first week of June, address NRIs in New York",
    "Erdogan rival appeals to Turkish youth ahead of runoff vote",
    "JSW_Infrastructure_Limited_DRHP",
    "TVS Supply Chain Solutions Limited_DRHP",
    "Fincare_Small_Finance_Bank_Limited_DRHP",
    "SIPs and bank FDs attract investors amid volatility and new tax rules",
    "Are your equity funds investing in the same stocks?",
    "Ultra short duration funds: Riding rising rates",
    "Why debt mutual funds are still relevant and investment-worthy",
    "Personal Finance: AIFs, PMS or MFs - making the right choice",
    "Short Call: Savvy HNIs play momentum in MFs, BSE’s margin surprise",
    "MC30 funds for investors new to equity market",
    "Why insurance for surrogate mothers might be difficult to offer",
    "Explained: IRDAI’s diktat on credit cards",
    "Mother’s Day 2023: 9 things to consider before buying health insurance for your mom",
    "Simply Save: All you wanted to know about a top-up health insurance plan",
    "Banks posted strong results but profitability may be at a peak, says Emkay Global's Karwa",
    "Irdai proposes to tighten norms for media campaigns by insurers",
    "How to decide about the health cover upgrade in your 40s",
    "The fixed income party’s not over, only the venue has shifted",
    "Missed the April 5 PPF deadline? Don’t fret; you won’t lose much",
    "Flight To Safety: Funds to flow into fixed income, debt funds",
    "FIIs invest $840 million in debt so far in 2023: Will the trend continue?",
    "Govt and AAA-rated bonds, target maturity and short-term funds will shine in 2023",
    "Moneycontrol, GoldenPi team up to offer more fixed income investment options",
    "Post Office Time Deposits: Should you invest?",
    "RBI rate hike leaves bond street with a lot of comfort but little direction",
    "Bajaj Finance FD offers high interest rates, but is it still a good choice?",
    "Small-cap mutual funds love these sectors for higher returns",
    "Got your first job? Here's how you can make tax-saving investments",
    "Planning to sell your property? Know your responsibilities as a seller",
    "Wealthtech startup Fisdom to foray into asset management space",
    "Caveat Emptor: Deduct TDS on property purchases, or else…",
    "Faceless tax assessment scheme fuels deluge of appeals, puts taxpayers in limbo",
    "We may see a new high on Nifty later this year: Ashish Shanker of Motilal Oswal Private Wealth",
    "Chart of the Day: What is triggering luxury apartment sales?",
    "MC Exclusive: CapitaLand to deploy Rs 4,500 cr over next 6-7 yrs, foray into Indian tier-2 cities",
    "Sebi proposes self-sponsored REITs and InvITS",
    "Sebi proposes special rights to certain unitholders of REITs and InVITs",
    "Bollywood actress Neetu Kapoor acquires Rs 17.4 Crore apartment in Mumbai",
    "UPRERA invites expression of interest for developing smart court using AI technology",
    "What's behind the central bank’s hoarding of gold",
    "Falling commodity prices buoy trade balance",
    "Gold ticks up as US debt ceiling talks drag on",
    "India’s combined trade deficit hits 21-month low at $1.38 billion in April",
    "Commodities Live: Crude Prices Slip Below $70/Barrel | NSE Launches WTI Crude Derivatives In Rupee",
    "Man swallows 7 gold biscuits to avoid custom officials, arrested",
    "Gold rebounds as US inflation data boosts Fed rate-hike pause bets",
    "Deadline for choosing higher pension option extended to June 26: Your key questions answered",
    "In your 30s and not yet invested in mutual funds? Here’s how to make a start",
    "May 3rd is the last date to apply for higher pension from EPS, check how to apply",
    "EPF e-passbook facility remains under the weather",
    "In your early 50s and nearing retirement? These 2 MC30 schemes can take you there",
    "Active vs Auto: Which National Pension Scheme investment choice is better for FY2023-24?",
    "When should you increase your VPF contributions?",
    "HDFC looks to offload Rs 2,000 crore stressed developer loans: Report",
    "India’s middle-class and the EMI conundrum: 4-step guide to reducing the home loan burden",
    "BharatPe acquires NBFC Trillion Loans",
    "SEBI delivers final order in Karvy demat scam, cracks down on MD and directors",
    "India’s banks have it all, except caution",
    "Google took enforcement action on 3,500 personal loan apps in India in 2022",
    "Delhi government has started process of preparing its budget for 2023-24",
    "Women's presence in a sector is a barometer of how fair the business is: Housing Secretary",
    "How big must your emergency fund be?",
    "Delhi Draft Master Plan 2041: Does it take into account exigencies such as COVID-19?",
    "Mutual funds join hands to induct 50,000 more distributors to widen reach",
    "Want to quit your job and do your own thing? 5 factors to ponder before taking the plunge",
    "Gold returns 25% so far this year; should you buy more or just hold?",
    "Credit card platform Kiwi launches 'credit on UPI' service",
    "Moneycontrol Daily: Your Essential 7",
    "Credit cards have much to offer than just credit; here are tips to get the best out of them",
    "Travelling abroad for summer holidays? Here are 5 credit cards with low forex markup fees",
    "Credit cards don’t bleed your money, they breed it for you!",
    "Top 5 credit cards for international travel",
    "Higher spending, missed payments? Your credit card may be cancelled",
    "How much upside is there to the IDBI Bank stock with Kotak Bank eyeing a possible stake?",
    "Hot Stocks | Bet on Elecon Engineering, Mishra Dhatu Nigam, Sonata Software for 13-17% returns",
    "Trade Spotlight | How to trade in Engineers India, PNC Infratech, Finolex Industries today",
    "Navin Fluorine: Innovator-led growth to continue in FY24 for this pricey stock",
    "Trade Spotlight | How to trade in EPL, Godrej Properties, Zensar Technologies today",
    "Daily Voice | This fund manager is bullish on SRF, SKF, PI Industries. Find out why",
    "Expect EBITDA margin to sustain at 25-30% in FY24, says Meghmani Finechem CMD Maulik Patel",
    "DSPN50ETF is moved by -1.45",
    "Prakash Ind is moved by -3.36",
    "Urja Global is moved by -0.65",
    "Bombay Super is moved by -5.07",
    "SOLARA ACTIVE PHARMA SCIENCES",
    "SOLARA ACTIVE P is moved by -3.01",
    "Tamil Nadu Newsprint and Papers",
    "Tamil Newsprint is moved by -3.00",
    "Sunflag Iron and Steel Company",
    "Sunflag Iron is moved by -3.03",
    "Set SMS alerts for market news",
    "Agri Picks Report May 17,2023: Geojit",
    "Amber Enterprises zooms on 82% jump in Q4 net profit, ROCE at 15%",
    "LIC Housing Finance shares tank 6% after muted Q4 results",
    "Gold slips as US data, Fedspeak sow doubts on rate cuts",
    "KreditBee eyes offline expansion to reduce loan disbursement timelines",
    "Learning to live with the ups and downs of startups",
    "See More Top Companies in India",
    "Bharti Airtel & Metropolis Healthcare Q4 results; Nifty at 19,000 soon? Market Minutes",
    "Nifty @ 18,300: What next? Moneycontrol Alpha",
    "MC Selects Podcast: Your on-the-go daily news wrap",
    "US debt ceiling crisis, NSE Q4 results, PVR-Inox's loss & more | Market Minutes",
    "Download from Windows Phone",
    "Education Franchisee Opportunity",
    "Financial Terms (Glossary)",
    "Top Articles from Financial Times"
]