[
    "E. Jean Carroll says she's 'overwhelmed with joy' for women across the U.S. after Trump verdict",
    "'This is about getting my name back,' Carroll tells Savannah Guthrie on 'TODAY'",
    "Senate GOP suggest Carroll verdict could imperil Trump's 2024 chances",
    "Mike Pence navigates anger from all sides as he inches toward a presidential run",
    "Mike Pence admits the Trump White House 'could have done a better job of controlling spending'",
    "Donald Trump embraces Jan. 6 defendant who wants Mike Pence executed",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "Texas mall shooter was expelled from military over mental health concerns",
    "Shooter ranted against Jews, women and racial minorities on apparent social media page",
    "Inflation and 'overheated' economy have many households in a corner",
    "More Americans are so worried about money, it's hurting their mental health",
    "Debt limit debate endangers already fragile U.S. economic outlook",
    "As a monster tornado bore down, many in the Mississippi Delta had no chance of finding a shelter",
    "A Mississippi city reeling from a clean water crisis sees a sudden end to trash collection",
    "Extreme weather meets reality of poverty to create a tragedy in Mississippi",
    "Andrew Caballero-Reynolds / AFP via Getty Images file",
    "Early campaign strategy at play as Biden hits road for first time since launching re-election bid",
    "Rep. George Santos faces federal charges, sources say",
    "Here are new Biden immigration policies to expect as Title 42 ends",
    "Impasse persists after Biden and congressional leaders hold 'tense' meeting on debt ceiling",
    "Dianne Feinstein set to return to the Senate after a nearly 3-month absence due to health issues",
    "California Highway Patrol via AP file",
    "California to pay $24 million settlement to family of man who died in police custody",
    "Two missing climbers on mountain in Denali National Park most likely fell, officials say",
    "Missing hiker rescued alive from Glacier National Park",
    "Buddy Holly, the petit basset griffon Vendéen, wins Westminster dog show",
    "Aris Messinis / AFP via AP",
    "Arman Soldin, journalist working for AFP news agency, killed in Ukraine",
    "@VictoriaPolice via Twitter",
    "Woman survived on wine and lollipops in the Australian wilderness for 5 days",
    "Michael Cunningham / Northern Advocate via AP",
    "Student's body found in cave after New Zealand hit by floods",
    "5 killed in attack on one of Africa's oldest synagogues",
    "Pakistan cracks down on Imran Khan's supporters after violence",
    "Tory Lanez denied new trial in Megan Thee Stallion shooting",
    "Araya Doheny / Getty Images",
    "Marcia Gay Harden says her kids, who 'are all queer,' inspire her LGBTQ advocacy",
    "Jay L. Clendenin / Los Angeles Times via Getty Images",
    "Writers strike: What TV shows are being affected",
    "Robert De Niro welcomes his 7th baby at 79",
    "Nick Cannon shoots down 'deadbeat dad' label: 'I've been villainized'",
    "8-year-old boy survives in wilderness after being separated from family for two days",
    "Tracing the origins of the notorious Kohinoor Diamond",
    "Nurses at HCA hospitals would have owed thousands if they left before 2 years: investigation",
    "Tiger Woods’ ex alleges sexual harassment ahead of court hearing",
    "Michael Ciaglo for NBC News",
    "Fred Dugfour / AFP Pool via Getty Images file",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Senate Republicans suggest Carroll verdict could imperil Trump's 2024 chances",
    "Tucker Carlson says he'll launch new show on Twitter",
    "David Paul Morris / Bloomberg via Getty Images file",
    "Tempur Sealy is buying Mattress Firm for $4 billion",
    "Tom Dulat / Getty Images file",
    "Leaked Google engineer memo warns that Big Tech could lose AI race to the little guys",
    "Miguel Roberts / The Brownsville Herald via AP file",
    "Screen women for breast cancer at 40, instead of 50, new guidelines say",
    "Women should get screened for breast cancer at 40 rather than 50, new guidelines say",
    "Teens should be trained in media literacy and limit their screen time, psychologists say",
    "Rise of mpox cases in Chicago raises concern about possible summer spread",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Mario Tama / Getty Images file",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "In a galactic first, a star is seen swallowing a planet in one gulp",
    "Manchin introduces bill to speed energy permitting",
    "Jeremy Wallace / The Aspen Times via AP file",
    "Colorado expands translation access for parents of special ed students",
    "Focus On Sport / Getty Images",
    "First Latino quarterback to lead team to the Super Bowl dies at 85",
    "Fort Hood, Texas, is officially renamed Fort Cavazos after the first Latino four-star general",
    "Shahar Azran / Getty Images file",
    "Fred Lindinger / United Archives via Getty Images file",
    "Pioneering Black opera singer Grace Bumbry dies at 86",
    "Vivien Killilea / Getty Images file",
    "Richard Dreyfuss says Oscars' new diversity standards 'make me vomit'",
    "Eddie Brady / Getty Images",
    "Missouri school board member resigns and plans to move over anti-LGBTQ bills",
    "David Clumpner Photography",
    "Censured Montana Rep. Zooey Zephyr proposes to girlfriend at queer prom",
    "Russell Hons / Cal Sport Media via AP file",
    "North Dakota governor OKs law to ignore transgender pronouns",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Angela Weiss / AFP via Getty Images file",
    "9 best teeth whitening treatments",
    "21 mom-approved Mother's Day gifts",
    "Mother's Day gifts for every kind of mom",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "29 best Mother's Day gifts on Amazon",
    "15 top-rated Amazon coffee accessories",
    "Do Not Sell My Personal Information"
]