[
    "Leila Register / NBC News; Getty Images",
    "Nathan Howard / Reuters via Redux",
    "19-year-old arrested on multiple charges after crashing into barriers near the White House",
    "VIDEO: U-Haul truck rams security barriers across the street from the White House",
    "Russia claims it defeated alleged incursion from Ukraine, a day after attack began",
    "Russia says it battles saboteurs in cross-border raid by pro-Ukraine forces",
    "Don't expect Ron DeSantis to go scorched earth against Trump",
    "Ron DeSantis is learning that not every state wants to be Florida",
    "Sepia Times / Universal Image Group via Getty Images",
    "Buckingham Palace rejects calls to return remains of 'stolen' prince to Ethiopia",
    "Prince Harry loses bid to challenge decision not to let him pay for U.K. police protection",
    "Thomas Imo / Photothek via Getty Images",
    "How many people are held in solitary confinement in U.S. prisons and jails? Now there’s a number.",
    "Cj Gunther / EPA-EFE / Shutterstock file",
    "Father and son duo who ran a $20 million lottery fraud scheme sentenced to prison",
    "California man who stopped to help family of ducks cross road is killed by car",
    "A Black professor has long said what the IRS now admits: The tax system is biased",
    "Two infants found dead in garbage in Cleveland",
    "South Carolina governor faces backlash for remark about hunting Democrats with dogs",
    "Cheney Orr / AFP via Getty Images file",
    "Chinese immigrants sue Florida for law banning certain nationals from buying property",
    "Trump to appear virtually in New York criminal case for first time since arraignment",
    "Kari Lake loses another court battle in bid to overturn AZ gubernatorial defeat",
    "Lionel Hahn / Getty Images file",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "Michael Zagaris / Getty Images file",
    "Oakland A's announcer Glen Kuiper fired after he appeared to use a racial slur on air",
    "Leila Register / NBCLeila Register / NBC News",
    "Their small businesses went viral on TikTok for the wrong reasons — now what?",
    "Rolf Harris, disgraced children's TV entertainer and convicted sex offender, dies at 93",
    "Fantasia shines in 'The Color Purple' musical remake trailer",
    "Alexander Zemlianichenko / AP file",
    "Evan Gershkovich's pre-trial detention extended for three months",
    "Matthew Horwood / Getty Images",
    "Cars set on fire in Cardiff as UK police face 'large scale disorder' after road crash",
    "London Metropolitan Police / via AP file",
    "Portuguese police resume search for Madeleine McCann, British child missing since 2007",
    "7 people arrested in Spain linked to racial abuse cases against soccer star Vinícius",
    "Sherpa guide Kami Rita scales Mount Everest for a record 28th time",
    "Airlines, airports gear up for kickoff of busy summer travel season",
    "United Airlines CEO talks airfares, delays, passenger compensation",
    "Man killed by car after saving ducks crossing street",
    "Carol Yepes / Getty Images",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Robert Nickelsberg / Getty Images",
    "Three states agree to reduce water usage so the Colorado River doesn't go dry",
    "Allison Joyce / Getty Images",
    "Sen. Tim Scott vows not to overturn the election if he loses",
    "NASA has sights set on Mars with help from a nuclear rocket engine",
    "Adobe adds generative AI to Photoshop",
    "Fake picture of explosion at Pentagon spooks Twitter",
    "BSIP / Universal Images Group via Getty Images",
    "U.S. progress in HIV fight continues to trail many other rich nations",
    "Luke Sharrett / Bloomberg via Getty Images file",
    "60,000 pounds of an explosive chemical lost during rail shipment, officials say",
    "If bird flu starts to spread among people, existing vaccines may be inadequate, experts say",
    "Weight loss drugs can lead to muscle loss, too. Is that a bad thing?",
    "In the Amazon, Brazilian ecologists try new approach against deforestation and poverty",
    "Extreme weather has killed 2 million people over past half century, U.N. says",
    "Fernando Vergara / AP file",
    "Alejandro Lopez Pineda / Netflix",
    "'Mother and Child' director wraps his first Netflix Spanish-language movie",
    "8-year-old sought help 3 times on day she died, immigration officials say",
    "Family Photos; Jordan Vonderhaar for NBC News",
    "The 73 minutes that changed Uvalde haunts the families of the children who died",
    "After her only son died by suicide, a mother wants other gay Black students to thrive",
    "Justin Sullivan / Getty Images",
    "Many trans health bills came from a handful of far-right interest groups, analysis finds",
    "Malcolm Davon Smith via AP",
    "Using 'he/him' and 'she/her' in emails got 2 people fired at small Christian college",
    "Patrick McMullan via Getty Images file",
    "'Live Laugh Lesbian': Target's cheeky Pride collection strikes again",
    "'American Idol' crowns first Pacific Islander and Hawaii native as winner",
    "Jacobs Stock Photography Ltd / Getty Images",
    "Asian Americans are least likely of all racial groups to have an end-of-life plan, new study finds",
    "The best sunscreens for oily skin",
    "The best early Memorial Day sales to shop now",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "The best luggage under $150",
    "Is a vertical climber right for you?",
    "Our predictions for Prime Day 2023",
    "What to shop this Memorial Day",
    "Best weekender bags for your next short getaway",
    "Casper; Lo & Sons; Pottery Barn",
    "The 6 best sales to shop right now",
    "Do Not Sell My Personal Information"
]