[
    "Chelsea Stahl / NBC News; Getty Images",
    "The U.S.'s obsession with AR-15 rifles, explained",
    "6 charts that show the rise of guns in the U.S. — and people dying from them",
    "Why are there so many mass shootings this year?",
    "Alfredo Estrella / AFP via Getty Images",
    "Mayorkas says border crossings dropped by 50% after Covid restrictions were lifted",
    "Migrants say a whisper network encouraged many to cross before Title 42 ended",
    "Why Lyme disease symptoms go away quickly for some and last years for others",
    "Umit Bektas / Pool via APUmit Bektas / Pool via AFP - Getty Images",
    "Erdogan faces biggest challenge yet as earthquakes and the economy could cost him re-election",
    "Erdoğan's rival boosted by withdrawal ahead of Turkey presidential vote",
    "Patrick Semansky / AP file",
    "Nikki Haley: A 2024 candidate who pledged a federal abortion ban would not be 'honest'",
    "RNC Chair Ronna McDaniel: 2024 GOP candidates must tackle abortion 'head on'",
    "Grizzlies suspend Ja Morant after he appears to flash gun on social media once again",
    "Scott Olson / Getty Images file",
    "One year after Tops supermarket shooting, friends and family honor victim with scholarship fund",
    "Joyce Lobeck / Yuma Sun via AP file",
    "2 dead and 5 injured in Arizona shooting",
    "3 killed, others injured in California freeway crash",
    "3 men arrested and charged in slayings of 3 women in L.A. neighborhood",
    "Chicago gay bars boycott Anheuser-Busch for distancing itself from Dylan Mulvaney",
    "Tom Williams / CQ-Roll Call via AP file",
    "Murphy: Biden’s using 14th Amendment for debt ceiling would ‘absolve Congress from being adults’",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Ron DeSantis tiptoes around Iowa as Trump cancels visit amid tornado threat",
    "Bonnie Cash / Getty Images file",
    "Americans are worried the economy will turn. Whether it does could decide 2024.",
    "Florida Democrats struggle to coalesce around a candidate to take down Sen. Rick Scott",
    "Israel cease-fire with Gaza militants appears to hold after days of fighting",
    "Oli Scarff / AFP - Getty Images",
    "Home city of Ukraine's Eurovision Song Contest act is attacked during performance",
    "Anatolii Stepanov / AFP via Getty Images file",
    "China unlikely to play peacemaker role in Ukraine war, Western officials and experts say",
    "Swedish singer Loreen wins Eurovision Song Contest for a 2nd time",
    "Shelling and airstrikes pound Sudan's capital as rivals hold talks",
    "Justine Goode / NBC News / Getty Images",
    "Summer vacation is increasingly for the rich",
    "Student athletes share notes of gratitude on Mother’s Day",
    "13-year-old girl recovering after shark attack in Florida",
    "Driverless cars creating traffic jams in San Francisco",
    "Mom surprises daughter with ticket to Taylor Swift’s Eras Tour",
    "Shelby Tauber for NBC News",
    "Cat and dog torture videos litter Twitter, adding to concerns about moderation",
    "Vartika Sharma for NBC News",
    "National Maternal Mental Health Hotline received over 12,000 calls and texts in its first year",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Social Security advocates brace for U.S. debt default: Seniors should 'be prepared'",
    "Meet 'Chonkosaurus,' the viral Chicago River snapping turtle",
    "Daniel Dorsa / NYT via Redux; NBC News",
    "Heather Armstrong’s friends remember the Dooce.com blogger’s complicated legacy",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Kevin Winter / Getty Images for iHeartRadio file",
    "Country music star Jimmie Allen's former manager accuses him of sexual assault and harassment",
    "Actor Jamie Foxx is out of the hospital and recuperating, his daughter says",
    "'Queen Charlotte' star Arséma Thomas says playing Lady Danbury gave her power",
    "China says Tesla to fix software for 1.1 million vehicles with braking issue",
    "Former NBCUniversal ad chief Linda Yaccarino named CEO of Twitter",
    "Non-profit providing critical doula services to Black women cost-free",
    "Peter Dazeley / Getty Images",
    "FDA approves drug to treat hot flashes and night sweats",
    "The importance of CPR during cardiac arrest, learned by this mother and daughter",
    "Michael J. Fox opens up about variety of injuries due to Parkinson's disease",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Adria Malcolm for NBC News",
    "Saul Loeb / AFP via Getty Images file",
    "Daniel Cardenas / Anadolu Agency via Getty Images",
    "Mexico to launch database tool of over 10,000 missing people",
    "Migrants in the treacherous Darien jungle find a more organized route",
    "Joe Maher / Getty Images file",
    "Michael M. Santiago / Getty Images",
    "Jordan Neely's family says manslaughter charge is too lenient for NYC subway rider",
    "Caroline Brehman / CQ-Roll Call, Inc via Getty Images file",
    "Kansas City declares itself an LGBTQ sanctuary city",
    "Phillip Faraone / Getty Images for Drake's Hollywood file",
    "'Selling Sunset' star Chrishell Stause and musician G Flip got married",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "Arkansas Pride event changes venue after drag show restriction",
    "Food truck in L.A. explores Indonesian culture through cuisine",
    "Killed in an American mass shooting, a victim makes a crucial final journey home to India",
    "Lauren Schatzman / NBC News",
    "Asian Americans are no longer pop culture side-kicks — they're defining the mainstream",
    "Man accused in deadly shooting at  Taiwanese church in California is indicted on 98 charges",
    "Courtesy Vivian Le; Zoe Malin; Shari Uyehara",
    "Select staffers' favorite pet products",
    "6 top-rated luggage sets for your next trip",
    "16 products that will upgrade your braid care routine",
    "Tuft & Needle; Supergoop; Aura Frame",
    "7 best sales to shop this weekend",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "Do Not Sell My Personal Information"
]