[
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "Philadelphia shooting suspect isn't trans, officials say, but speculation continues",
    "Suspect in Philadelphia shooting believed to be mentally ill, law enforcement source says",
    "Victims of Philadelphia shooting include a lifelong resident and a teen hero",
    "Jabin Botsford / The Washington Post via Getty Images",
    "More Mar-a-Lago search warrant information released in Trump classified docs case",
    "In a post-presidency audio recording, Trump discusses classified documents",
    "Special counsel Jack Smith subpoenaed Arizona secretary of state's office in Jan. 6 probe",
    "Questions emerge about disappearance of Texas teen who was reported found 8 years later",
    "Missing Texan who was found after 8 years is in hospital and nonverbal, family says",
    "Russian jets harassed American drones that were targeting ISIS, U.S. says",
    "Armed Russian jets flew over a U.S. base in Syria nearly every day in March",
    "Davide Bonaldo / Sipa via AP",
    "What you need to know about Threads, Instagram’s new Twitter competitor",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Man sentenced to life in prison for rape of 10-year-old",
    "Former New York Mayor Bill de Blasio and wife announce separation",
    "Missing Michigan toddler found dead; man suspected in her disappearance arrested",
    "N.J. judge under investigation for lip-syncing lyrics about murder and drugs on TikTok",
    "Need a new passport? State Department tells travelers to apply at least 6 months before departure",
    "Video appearing to show DoorDash driver cursing at customer over 25% tip sparks online debate",
    "Ron DeSantis defends video going after Trump on LGBTQ issues: ‘Totally fair game’",
    "Julia Nikhinson / Sipa / Bloomberg via Getty Images file",
    "Lab test confirms white substance found at the White House is cocaine",
    "On the campaign trail, Mike Pence faces skepticism over his Jan. 6 break with Trump",
    "Rebecca S. Gratz / The Washington Post via Getty Im",
    "Iowa's GOP governor calls a special session to push abortion restrictions",
    "Tax records show Sen. Joe Manchin has been late on payments repeatedly in recent years",
    "Biden administration appeals ban on social media contacts",
    "Lawyer who advanced Trump's stolen election claims announces retirement",
    "Signs of life — and support — for Prigozhin with Wagner's future still a mystery",
    "U.S. Navy says it stopped Iran from trying to seize two tankers",
    "Tlaxiaco Municipal Police/AFP via Getty Images",
    "Dozens killed when bus plunges into a gulch in southern Mexico",
    "Genaro Molina / Los Angeles Times via Getty Images",
    "Tuesday was the hottest day in the world since record-keeping began — breaking Monday's record",
    "War with China might not be 'imminent,' but Taiwan is preparing anyway",
    "Israeli troops withdraw from West Bank as Gaza rockets are fired",
    "Irina Shatilova / Getty Images/iStockphoto",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "Chinnapong / Getty Images/iStockphoto",
    "Barriers to transgender health care lead some to embrace a do-it-yourself approach",
    "BelVita breakfast sandwiches recalled for possible peanut contamination",
    "CTE diagnosed in a female professional athlete for the first time",
    "Sthanlee B. Mirador / Sipa USA via AP file",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "Nathan CongletonNBC / NBCUniversal via Getty Images",
    "Tatum O'Neal was in a coma for 6 weeks after overdose and stroke",
    "‘Peaky Blinders’ and Cillian Murphy denounce homophobic video shared by DeSantis campaign",
    "'Smallville' actor Allison Mack released from prison early after cult sex trafficking conviction",
    "What experts want you to know about dog food",
    "What causes rosacea? Derms explain.",
    "June reader favorites: KN95 masks, portable air conditioners and more",
    "July 4th marked hottest day ever recorded globally",
    "Instagram and Meta launch new app to rival Twitter",
    "Watch: Lead runner takes wrong turn during race, finishes 3rd",
    "Dramatic rescue of driver in burning car caught on camera",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "Rachel Woolf / The Washington Post via Getty Images file",
    "@beberexha / via Instagram",
    "Fans keep throwing stuff at artists onstage. Will it ever stop?",
    "Drew Angerer / Getty Images file",
    "Nicolas Economou / NurPhoto via Getty Images file",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "A disjointed jet stream has some climate scientists spooked",
    "Al Drago / Bloomberg via Getty Images file",
    "Proposed English-speaking part in revamped U.S. citizenship test raises concerns",
    "Gentrification leads to madness and cannibalism in ‘The Horror of Dolores Roach’",
    "Scott Eisen / Getty Images",
    "Activists spurred by affirmative action ruling challenge legacy admissions at Harvard",
    "Suzanne Cordeiro / AFP - Getty Images",
    "Migrants at the U.S.-Mexico border swelter in unforgiving Texas and Arizona heat",
    "Exonerated member of ‘Central Park Five’ wins primary for NYC Council seat",
    "Supreme Court backtracked on Black death row inmates’ racial bias claims, liberal justices say",
    "John Phillips / Getty Images",
    "Eamon Queeney for The Washington Post via Getty Images file",
    "N.C. governor vetoes trio of LGBTQ restrictions in ongoing fight with GOP supermajority",
    "South Korea includes American teenager in Women’s World Cup squad",
    "Scott Eisen / Getty Images file",
    "Do Not Sell My Personal Information"
]