[
    "Julie Bennett / Getty Images file",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "Judges in Kentucky and Tennessee block parts of transgender youth care bans",
    "Brendan Smialowski / AFP via Getty Images file",
    "Dozens of witnesses have testified as the Jan. 6-focused grand jury probes Trump",
    "'Planned in plain sight': Senate report finds intel agencies failed in the lead-up to Jan. 6",
    "How hot is too hot for the human body to function optimally?",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "St. Paul Police Department",
    "Police link man to two women whose bodies were found in different Minnesota storage units",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "1 dead, at least 15 injured after car driving wrong way collides with bus in Chicago",
    "Paras Griffin / Getty Images file",
    "Georgia mayor arrested on burglary and trespassing charges",
    "Christian Petersen / Getty Images file",
    "FDA asked to investigate Logan Paul’s energy drink, PRIME, which has the caffeine of 6 Coke cans",
    "3 Georgia teens charged with murder after plot to egg a home goes wrong, police say",
    "Suspect in California fatal hostage incident escapes custody",
    "9 shot in downtown Cleveland; no suspect in custody",
    "Drew Angerer / Getty Images",
    "Biden defends ‘difficult decision' to give Ukraine cluster bombs amid congressional pushback",
    "Two Birds Photography | Brittany",
    "GOP presidential candidate Doug Burgum says he wouldn't do business with Trump",
    "Ron DeSantis' presidential bid is giving life to a struggling Florida Democratic Party",
    "Biden heads to Europe with a king and a war on his agenda",
    "Nicholas Hunt / WireImage file",
    "Aretha Franklin’s sons are going to court over her estate. Here’s what to know.",
    "John Shearer / Getty Images for TAS Rights Management",
    "Taylor Swift's friendship with Taylor Lautner and wife Tay Lautner has the internet obsessed",
    "Did 'Barbie' cross the line? How a 'child-like' map stirred a South China Sea dispute",
    "'Dolores Roach' actor Justina Machado still loves empanadas — though not the horror-filled kind",
    "Keke Palmer is the latest Black mother facing backlash over what she wears",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "Irina Shatilova / Getty Images/iStockphoto",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Brain scans of coffee drinkers suggest there's more to feeling alert than just the caffeine",
    "Rob Newell  / CameraSport via Getty Images",
    "Why this summer's big sporting events might look a little different",
    "US drone strike kills an Islamic State group leader in Syria, the Defense Department says",
    "Is Russia purging Wagner Group troops in Africa?",
    "Britain's BBC faces questions as presenter accused of paying teenager for pictures",
    "Sudan on the brink of a 'full-scale civil war,' U.N. chief warns",
    "Kobo; Kara Birnbaum / NBC News",
    "The 7 best e-readers of 2023",
    "Early Prime Day deals to shop right now",
    "Owala; AmazonAmazon; Owala",
    "Best for Your Pet Awards 2023 favorites: Treats, toys and food",
    "How experts shop for a garden hose",
    "Target Circle Week starts July 9",
    "U.S. women’s soccer star Megan Rapinoe announces retirement",
    "Chicago couple creates gardens and jobs for at-risk youth",
    "Man who lost job becomes bestselling author after viral video",
    "Video shows crash site of small plane that killed six in California field",
    "Betty Laura Zapata / Bloomberg via Getty Images file",
    "What’s it like to have a bounty on your head for supporting democracy?",
    "Paul Hanna / Bloomberg via Getty Images",
    "Chaotic, blissful and confusing: What Threads users are saying about the new social media app",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Edward Berthelot / Getty Images file",
    "The 10 strangest, most troubling allegations about Ye's Donda Academy",
    "Kamil Krzaczynski / AFP via Getty Images",
    "Need a new passport? State Department says apply at least 6 months before your departure",
    "Brett Coomer / Houston Chronicle via AP",
    "Houston man whose mother said he was missing no longer wants contact with her, aunt says",
    "U.S. District Court for the District of Columbia",
    "Trump-appointed judge gives a 'break' to Jan. 6 rioter who wants to be a police officer",
    "Ben Stansall / AFP via Getty Images file",
    "Baby boomers and their cash are driving the housing market right now",
    "UPS customers weigh backup plans as threatened strike date approaches",
    "U.S. fines meat company that used two minors to run hazardous machinery at Minnesota factory",
    "Employment among people with disabilities hits post-pandemic high",
    "Mark Felix / AFP - Getty Images",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Johan Nilsson / TT News Agency via AP file",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Mario Tama / Getty Images file",
    "El Paso Walmart mass shooter sentenced to 90 life terms",
    "Catholic priests report beatings, surveillance by Nicaragua government",
    "Brandon Bell / Getty Images/FILE",
    "Lawsuit seeking reparations for Tulsa Race Massacre is dismissed",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Mike Coppola / Getty Images file",
    "U.S. Forest Service and HBCUs unite to boost diversity in wildland firefighting",
    "From 'Barbie' to 'Joy Ride,' July's hottest releases hit the big screen",
    "Trans woman, bookstore, teacher sue over Montana law banning drag reading events",
    "Niall Carson / PA Wire via AP",
    "Pope taps priest who runs LGBTQ Catholic outreach to join major Vatican gathering",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Do Not Sell My Personal Information"
]