[
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "Drones strike Moscow in first attack on capital's residential areas since the war began",
    "Putin vows to retaliate for what he said was a Ukrainian attack",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Mike Pence is set to launch his presidential campaign next week",
    "Former N.J. Governor Chris Christie to announce his 2024 presidential bid Tuesday",
    "Anna Moneymaker / Getty Images",
    "Live Updates: debt ceiling",
    "Democratic Reps. Ocasio-Cortez, Khanna and Jayapal say they'll vote 'no' on debt deal",
    "House to vote on Biden-McCarthy debt ceiling bill days before deadline for default",
    "GOP presidential hopefuls mostly line up against debt limit deal",
    "Ex-CIA officer accused of abusing women may walk free because of how feds searched his phones",
    "LGBTQ flag burned at California elementary school ahead of Pride event",
    "MLB players say drag troupe invited to Dodgers' Pride Night mocks Christianity",
    "Sign with a homophobic slur in front of Florida business sparks backlash",
    "Congress threatens to block funding for Space Command HQ as abortion laws impact location decision",
    "DeSantis plays up his personal side, hits back at Trump in campaign blitz across Iowa",
    "Drew Angerer / Getty Images file",
    "House Oversight chair prepares to hold FBI director in contempt over document in Biden probe",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images file",
    "Republican Rep. Chris Stewart plans to leave Congress",
    "Nevada governor signs new abortion protections into law",
    "Majority of Americans favor affirmative action in colleges as Supreme Court seems poised to end it",
    "Democrats in Congress reintroduce bill to break down mental health stigmas among Asian Americans",
    "Nun whose body shows little decay since 2019 death draws hundreds to rural Missouri",
    "Boiler explosion at southeastern Texas power plant leaves contractor dead",
    "Cassville Missouri Police / via AP",
    "Body of missing Missouri ER doctor found in Arkansas, family says",
    "GordonBellPhotography / Getty Images / iStockphoto",
    "White man who pulled gun in MLK Day confrontation with Black teens gets probation",
    "Police identify remains of Arizona woman strangled and left in trunk in Florida in 1969",
    "Filipino cuisine gets a nod in one of the U.S.'s highest culinary honors",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "Gints Ivuskans / AFP - Getty Images",
    "Latvian Parliament elects first openly gay president of a Baltic nation",
    "North Korean spy satellite launch fails",
    "An airline is asking passengers to weigh in before their flights",
    "Chinese jet flew past nose of U.S. plane, Pentagon says",
    "Ezra Miller won't be recast if there's a sequel to ‘The Flash,’ director says",
    "Dominik Bindl / Getty Images",
    "Al Pacino, 83, is expecting a baby with girlfriend, Noor Alfallah, 29",
    "MEGA / GC Images / Getty Images file",
    "Alec Baldwin receives hip replacement after suffering 'intense chronic pain,' wife says",
    "Scottie Pippen says Michael Jordan was 'horrible to play with' on Chicago Bulls",
    "Harold Perrineau says he was fired from ‘Lost’ after asking for character to have ‘equal depth’",
    "Leila Register / Getty Images",
    "Justine Goode / NBC News / Getty Images",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "South_agency / Getty Images",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Harvard introduces course in Tagalog for the first time",
    "Car flies 120 feet after driving up tow truck ramp at full speed",
    "Could AI lead to human extinction? New warning sparks concern",
    "Air New Zealand announces voluntary weigh-in for passengers",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "China rejects meeting with Pentagon chief in a setback for U.S. hopes of a thaw",
    "Joel Saget / AFP - Getty Images",
    "AI risks leading humanity to 'extinction,' experts warn",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Live updates: House vote comes days ahead of default deadline",
    "Amazon.com's Ring will pay $5.8 million after employees spied on customer videos",
    "LGBTQ activists call for new strategies to promote equality after Target backlash",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Chip Somodevilla / Getty Images file",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "El Salvador Presidential Press Office via AP",
    "At least 150 people jailed under El Salvador's emergency powers have died, new report says",
    "Jemal Countess / Getty Images",
    "Here are 10 words that will be featured in the African American English Dictionary",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Do Not Sell My Personal Information"
]