[
    "A Navy base put up a wall of shipping containers to protect against stray bullets",
    "Anatolii Stepanov / AFP - Getty Images file",
    "Ukraine recaptures southeastern village as long-awaited counteroffensive rumbles on",
    "Ukraine counteroffensive has 'no chance,' Putin says as Russians brace for long war",
    "Leila Register / NBC News; Getty Images",
    "Despite brand boycotts and backlashes, Pride events see solid corporate support",
    "Meet the drag nuns caught up in the culture war over Pride events",
    "4 people killed, dozens injured in chaotic night of mass shootings across the country",
    "Shooting at strip mall gathering leaves 20 people shot, 1 dead",
    "5 dead, more than 640,000 without power in southern U.S. after storms rip through region",
    "Gov. Abbott signs disaster declaration after deadly Texas tornado",
    "Wichita man arrested after allegedly sneaking into hospital and sexually assaulting 3 patients",
    "5 dead after being hit by speeding driver in Minneapolis, police say",
    "Scott Olson / Getty Images file",
    "Michigan man charged with threatening synagogue massacre",
    "Girl who died in Border Patrol custody mourned at New York funeral",
    "Dog fatally stabbed in New York's Central Park after 'verbal dispute' between dog walkers",
    "Coast Guard offloads cocaine worth $186M in Miami seized in Caribbean, Atlantic",
    "Man fatally shot after driving away with Wisconsin deputy hanging from vehicle, authorities say",
    "Supreme Court considers recoil from landmark gun rights ruling",
    "Chris Christie says RNC loyalty pledge is a 'useless idea'",
    "Donald Trump could try to pardon himself if re-elected, Asa Hutchinson says",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis leverages his Covid response for a foothold in Nevada",
    "Amid a slow start, Biden hits 2024 campaign trail with a nod to labor support",
    "Mike Pence: Donald Trump has been 'walking away' from conservative principles",
    "The ‘whatabout Biden’ defense: What are the allegations made by Trump to deflect from indictment?",
    "Justine Goode; NBC News / Getty Images",
    "Meet the Black outdoorsy groups reclaiming the joys of nature",
    "How vulnerable is your neighborhood to extreme heat?",
    "Chemical traces offer evidence of the universe's earliest stars",
    "It’s already a hot start to what is expected to be a hot summer",
    "'It's my future': Montana youth undertake one of the world's most high-profile climate trials",
    "John Liakos / InTime News via AP",
    "Emotional reunion for brothers as hopes fade for survivors of migrant boat shipwreck",
    "Blinken arrives in Beijing on mission to cool U.S.-China tensions",
    "Future Publishing / Getty Images",
    "Better ties with the U.S. may be about one thing: China's struggling economy",
    "How did four kids survive a plane crash and 40 days by themselves in the jungle?",
    "Children among at least 17 killed by airstrike in Sudan's capital, officials say",
    "King Charles rides on horseback in first ‘Trooping the Colour’ parade as monarch",
    "Flamin’ Hot Cheetos film reignites debate over the origin story",
    "Daniel Ellsberg, who leaked the Pentagon Papers, dies at 92",
    "Driver rescued after his car plunges off a dock in New York",
    "People are still being awful on flights, and no one really knows why",
    "Leila Register / NBC News; Twitter",
    "How many people are watching Tucker Carlson’s new show on Twitter?",
    "Justine Goode / NBC News; Getty Images",
    "How women broke barriers in the hip-hop fashion industry",
    "Russia will lose the war if Ukraine's counteroffensive succeeds, Zelenskyy says",
    "Andrew Caballero-Reynolds / AFP - Getty Images",
    "White House press secretary violated Hatch Act, government watchdog says",
    "David Paul / Bloomberg via Getty Images",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Philadelphia Fire Department via AP",
    "Fiery truck crash in Philadelphia closes stretch of I-95, possibly for months",
    "Virginia Sherwood / NBCU Photo Bank via Getty Images file",
    "Actor Treat Williams dies at 71 after motorcycle accident",
    "Kourtney Kardashian Barker  / Instagram",
    "Kourtney Kardashian announces pregnancy with homage to Blink-182 video",
    "Courtesy Jennie Livingston via Janus Films",
    "11 essential drag films to watch this Pride month",
    "Roy Rochlin / Getty Images file",
    "Pete Davidson charged with reckless driving after crashing car into Beverly Hills house",
    "Gavin Rossdale says he and ex Gwen Stefani don't 'co-parent' their three sons",
    "Ricardo Arduengo / AFP via Getty Images file",
    "Homeowners in states hobbled by extreme weather are running out of options to protect their homes",
    "Jamal Khashoggi's widow speaks out",
    "Cancer was once considered a disease of aging but rates among young people are rising rapidly",
    "Patrick Smith / Getty Images",
    "Tori Bowie’s death shows how pervasive racial disparities are in maternal health",
    "Rates of a 'silent' liver disease are soaring, new research shows",
    "FDA asks drugmakers to update Covid boosters to target XBB.1.5 for the fall",
    "Biden picks North Carolina's former health chief, Mandy Cohen, to run CDC",
    "Colombia's Armed Forces Press Office via AP",
    "Indigenous plane crash searchers turned to ayahuasca to find missing kids",
    "Theo Wargo / Getty Images for Songwriters Hall of Fame",
    "Gloria Estefan makes history with induction into Songwriters Hall of Fame",
    "Montinique Monroe / Getty Images file",
    "Texas Gov. Abbott signs law shutting diversity offices at public universities",
    "Courtesy Warner Bros. Pictures and DC Comics",
    "'The Flash' gives a nod to Latin music fans with this glimpse of a classic",
    "Jose M. Osorio  / Chicago Tribune via Getty Images file",
    "Chicago police officer fired over raid at the wrong home where a Black woman was handcuffed naked",
    "Tennessee Democrats expelled over protests win primaries for their old seats",
    "Presidential hopeful Francis Suarez opposes 'Don't Say Gay' expansion backed by DeSantis",
    "Mark Gunter / Getty Images for Art Hearts Fashion",
    "Trans activist apologizes for going topless at a White House Pride event",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "First Muslim woman confirmed as a federal judge",
    "Charley Gallay / Getty Images for Disney",
    "Ke Huy Quan surprises Harrison Ford on 'Indiana Jones' red carpet",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "The best at-home pizza ovens of 2023",
    "Do Not Sell My Personal Information"
]