[
    "Trump is found liable for sexually abusing and defaming E. Jean Carroll and must pay $5 million",
    "Jury's decision came less than 4 hours after deliberations and they decided the $5M award",
    "How the verdict may contribute to Trump's political narrative",
    "Rep. George Santos faces federal charges, sources say",
    "GOP Rep. George Santos announced re-election bid in New York last month",
    "Chris Goodney / Bloomberg via Getty Images file",
    "Harlan Crow declines to give Senate committee a list of gifts he gave to Clarence Thomas",
    "Justice Clarence Thomas defenders make the case for Supreme Court ethics reform",
    "Tucker Carlson says he'll launch new show on Twitter",
    "Far right laments Tucker Carlson’s ouster and loss of its shot at the mainstream",
    "Texas mall shooter was expelled from military over mental health concerns",
    "Patriarch of family killed in Texas shooting was a taekwondo master who ‘loved being a dad’",
    "Texas mall shooter ranted against Jews, women and racial minorities on apparent social media page",
    "Impasse persists after Biden and congressional leaders hold 'tense' meeting on debt ceiling",
    "Anna Moneymaker / Getty Images file",
    "Dianne Feinstein set to return to the Senate after a nearly 3-month absence due to health issues",
    "Here are new Biden immigration policies to expect as Title 42 ends",
    "Ohio secretary of state tells donors he'll enter GOP Senate primary 'soon'",
    "Georgia Gov. Brian Kemp hosts a private donor retreat as he plans 2024 involvement",
    "Michael Ciaglo for NBC News",
    "Missouri school board member resigns and plans to move over anti-LGBTQ bills",
    "S.C. police shooting survivor says deputies opened fire on him and his mother 'immediately'",
    "Tory Lanez denied new trial in Megan Thee Stallion shooting",
    "Two missing climbers on mountain in Denali National Park most likely fell, officials say",
    "Search underway for 2 inmates who escaped from Philadelphia prison unnoticed for 18 hours",
    "Screen women for breast cancer at 40, instead of 50, new guidelines say",
    "Victim of deadly crash near the southern border begs Biden for help after leg amputation",
    "Jay L. Clendenin / Los Angeles Times via Getty Images",
    "Writers strike: What TV shows are being affected",
    "Robert De Niro welcomes his 7th baby at 79",
    "Vivien Killilea / Getty Images file",
    "Richard Dreyfuss says Oscars' new diversity standards 'make me vomit'",
    "Nick Cannon shoots down 'deadbeat dad' label: 'I've been villainized'",
    "Pioneering Black opera singer Grace Bumbry dies at 86",
    "Fred Dugfour / AFP Pool via Getty Images file",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Gavriil Grigorov / Kremlin Pool Photo via APGavriil Grigorov / AFP - Getty Images",
    "Putin's Victory Day features security fears and infighting rather than military might",
    "@VictoriaPolice via Twitter",
    "Former Pakistan leader Imran Khan arrested",
    "Israeli strikes in Gaza kill 10 civilians and 3 senior Palestinian militants",
    "David Paul Morris / Bloomberg via Getty Images file",
    "Tempur Sealy is buying Mattress Firm for $4 billion",
    "Tom Dulat / Getty Images file",
    "Alain Jocard / AFP via Getty Images file",
    "Leaked Google engineer memo warns that Big Tech could lose AI race to the little guys",
    "More Americans are so worried about money, it's hurting their mental health",
    "Inflation and 'overheated' economy have many households in a corner",
    "8-year-old boy survives in wilderness after being separated from family for two days",
    "Nurses at HCA hospitals would have owed thousands if they left before 2 years: investigation",
    "Tiger Woods’ ex alleges sexual harassment ahead of court hearing",
    "Not so happy returns: Retailers tighten refund policies",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Is DeSantis wise to feud with Disney? We asked experts — and voters who could decide his fate",
    "Women should get screened for breast cancer at 40 rather than 50, new guidelines say",
    "Miguel Roberts / The Brownsville Herald via AP file",
    "Teens should be trained in media literacy and limit their screen time, psychologists say",
    "Rise of mpox cases in Chicago raises concern about possible summer spread",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Mario Tama / Getty Images file",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "In a galactic first, a star is seen swallowing a planet in one gulp",
    "Manchin introduces bill to speed energy permitting",
    "Jeremy Wallace / The Aspen Times via AP file",
    "Colorado expands translation access for parents of special ed students",
    "Focus On Sport / Getty Images",
    "First Latino quarterback to lead team to the Super Bowl dies at 85",
    "Fort Hood, Texas, is officially renamed Fort Cavazos after the first Latino four-star general",
    "Shahar Azran / Getty Images file",
    "Fred Lindinger / United Archives via Getty Images file",
    "Araya Doheny / Getty Images",
    "Marcia Gay Harden says her kids, who 'are all queer,' inspire her LGBTQ advocacy",
    "Eddie Brady / Getty Images",
    "David Clumpner Photography",
    "Censured Montana Rep. Zooey Zephyr proposes to girlfriend at queer prom",
    "Russell Hons / Cal Sport Media via AP file",
    "North Dakota governor OKs law to ignore transgender pronouns",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Angela Weiss / AFP via Getty Images file",
    "9 best teeth whitening treatments",
    "21 mom-approved Mother's Day gifts",
    "Mother's Day gifts for every kind of mom",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "29 best Mother's Day gifts on Amazon",
    "15 top-rated Amazon coffee accessories",
    "Do Not Sell My Personal Information"
]