[
    "BSIP / Universal Images Group via Getty",
    "FDA grants full approval to new Alzheimer's drug meant to slow disease",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Jeanne Accorsini / Sipa via AP Images",
    "Twitter accuses Meta of stealing trade secrets for its new Threads app",
    "Chaotic, blissful and confusing: What Threads users are saying about the new social media app",
    "Instagram's Threads bursts out of the gate with more than 30 million sign-ups",
    "Texas Center for the Missing",
    "Houston teenager 'missing' for 8 years was at home the whole time, police say",
    "Questions emerge about disappearance of Texas teen who was reported found 8 years later",
    "Missing Texan who was found after 8 years is in hospital and nonverbal, family says",
    "Samuel Corum / Getty Images",
    "Cocaine found in the White House was in a different location than previously reported, sources say",
    "Lab test confirms white substance found at the White House is cocaine",
    "Metropolitan Police Department",
    "Jan. 6 defendant arrested with guns near Obama's home may be released next week",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump aide Nauta pleads not guilty in Florida classified documents case",
    "Saul Loeb / AFP via Getty Images",
    "Biden touts clean energy investments in S.C. amid 'Bidenomics' push",
    "2 top public health positions in Ron DeSantis' administration are vacant",
    "Tax records show Sen. Joe Manchin has been late on payments repeatedly in recent years",
    "Biden administration appeals ban on social media contacts",
    "For two California reparations task force members, the hard work comes next",
    "OceanGate Expeditions via AP",
    "OceanGate suspends all exploration and commercial operations after Titan implosion",
    "Los Angeles County Sheriff's Dept.",
    "L.A. county sheriff's office probes 'disturbing' video showing deputy slam woman to ground",
    "7-year-old shot and killed on Fourth of July after jet ski dispute in Florida",
    "Memphis prosecutors seek death penalty against man charged with kidnapping and killing teacher",
    "Subway faces backlash over 'distasteful' sign referencing Titan implosion",
    "Incoming director of Smithsonian American Women's History Museum steps down",
    "JM Haedrich  / Sipa via AP",
    "Monica Schipper / Getty Images for Netflix",
    "Angelina Jolie says racial disparity in health care has 'endangered' her children of color",
    "Edward Berthelot / GC Images file",
    "Keke Palmer's boyfriend faces backlash for shaming her sheer dress at Usher concert",
    "Ricky Martin and husband, Jwan Yosef, announce divorce",
    "Ercin Erturk / Anadolu Agency via Getty Images",
    "Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Wigs, guns and a giant sledgehammer: Russian media claims to show Wagner mercenary chief's home",
    "Jenin residents begin picking up pieces after Israeli forces end raid",
    "Alexander Zemlianichenko / AP",
    "Mercenary chief is still in Russia despite deal to end mutiny with exile, leader of Belarus says",
    "Tourist who etched names on Colosseum says he didn't know it was ancient in apology letter",
    "Greta Thunberg charged with disobeying police order at climate protest",
    "Janet Yellen arrives in Beijing on mission to find common ground for U.S. and China",
    "NBC News / AP; Bloomberg via Getty Images",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Eva Marie Uzcategui / Bloomberg via Getty Images file",
    "Kamil Krzaczynski / AFP via Getty Images",
    "Need a new passport? State Department says apply at least 6 months before your departure",
    "Mortgage demand drops to lowest level in a month as interest rates rise",
    "NHTSA presses Tesla for more records in Autopilot safety probe",
    "The best products to buy during Prime Day",
    "The best women's razors for summer",
    "What to know before buying an Amazon Echo speaker",
    "Early Prime Day deals to shop right now",
    "Our editors' favorite smart plugs of 2023",
    "Watch: Yankees cameraman injured by overthrown ball",
    "Bull-running San Fermin festival gets underway in Pamplona",
    "Can Tom Cruise save the summer blockbuster?",
    "AI could help plan your next vacation — here's how to do it",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Barriers to transgender health care lead some to embrace a do-it-yourself approach",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "@beberexha / via Instagram",
    "Fans keep throwing stuff at artists onstage. Will it ever stop?",
    "More Mar-a-Lago search warrant information released in Trump classified docs case",
    "Man sentenced to life in prison for rape of 10-year-old",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "WHO report on deadly virus among babies in 3 countries has U.S. doctors on edge",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "Citizens of the Planet / Universal Images Group via Getty Images",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Johan Nilsson / TT News Agency via AP file",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Guillermo Legaria   / AFP via Getty Images file",
    "The show that inspired ‘Ugly Betty’ is getting a sequel with the original Colombian star",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "California and Texas officials ask DOJ to investigate Florida for sending migrants to other states",
    "Joe Raedle / Getty Images file",
    "Judge blocks Florida provision that would limit Latino voter registration",
    "In one of the world's deadliest cities, a musician's idea pays off",
    "Visual Ideas/Nora Pelaez / Getty Images/Tetra images RF",
    "Some Black Twitter users are hoping new Spill app will be a safe space",
    "Supreme Court backtracked on Black death row inmates’ racial bias claims, liberal justices say",
    "Rich Fury / Getty Images file",
    "1 in 5 United Methodist congregations in the U.S. have left over LGBTQ conflicts",
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "Philadelphia shooting suspect isn't trans, officials say, but speculation continues",
    "John Phillips / Getty Images",
    "‘Peaky Blinders’ and Cillian Murphy denounce homophobic video shared by DeSantis campaign",
    "South Korea includes American teenager in Women’s World Cup squad",
    "Al Drago / Bloomberg via Getty Images file",
    "Proposed English-speaking part in revamped U.S. citizenship test raises concerns",
    "Do Not Sell My Personal Information"
]