[
    "Texas Center for the Missing",
    "Houston teenager 'missing' for 8 years was at home the whole time, police say",
    "Questions emerge about disappearance of Texas teen who was reported found 8 years later",
    "Texas teen was found unresponsive and remains nonverbal, family says",
    "Samuel Corum / Getty Images",
    "Cocaine found in the White House was in a different location than previously reported, sources say",
    "Lab test confirms white substance found at the White House is cocaine",
    "Wigs, guns and a giant sledgehammer: Russian media claims to show Wagner mercenary chief's home",
    "EXCLUSIVE: Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Mercenary chief is still in Russia despite deal to end mutiny with exile, leader of Belarus says",
    "Paul Hanna / Bloomberg via Getty Images",
    "Threads’ early hours marked by internet nostalgia as users feel out Twitter rival",
    "Instagram's Threads bursts out of the gate with more than 30 million sign-ups",
    "Some Black Twitter users are hoping new Spill app will be a safe space",
    "OceanGate Expeditions via AP",
    "OceanGate suspends all exploration and commercial operations after Titan implosion",
    "Titanic submersible lost at sea raises legal questions for high-risk businesses",
    "Los Angeles County Sheriff's Dept.",
    "L.A. county sheriff's office probes 'disturbing' video showing deputy slam woman to ground",
    "Subway faces backlash over 'distasteful' sign referencing Titan implosion",
    "Sophie Lo / Courtesy The Smithsonian American Women’s History Museum",
    "Incoming director of Smithsonian American Women's History Museum steps down",
    "Alaska Airlines flight diverted after passenger makes 'direct threat' to plane's safety",
    "Two firefighters die battling large cargo ship fire in New Jersey",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump aide Nauta pleads not guilty in Florida classified documents case",
    "Saul Loeb / AFP via Getty Images",
    "Biden announces clean energy manufacturing investments in South Carolina",
    "2 top public health positions in Ron DeSantis' administration are vacant",
    "Tax records show Sen. Joe Manchin has been late on payments repeatedly in recent years",
    "Biden administration appeals ban on social media contacts",
    "JM Haedrich  / Sipa via AP",
    "Edward Berthelot / GC Images file",
    "Juan Ocampo / Getty Images file",
    "Keke Palmer's boyfriend faces backlash for shaming her sheer dress at Usher concert",
    "Ricky Martin and husband, Jwan Yosef, announce divorce",
    "Tourist who etched names on Colosseum says he didn't know it was ancient in apology letter",
    "Janet Yellen arrives in Beijing on mission to find common ground for U.S. and China",
    "Toxic gas leak in South Africa has killed 16 people, including 3 children, police say",
    "Russian jets harassed American drones that were targeting ISIS, U.S. says",
    "Woman found dead in a Canadian river nearly 50 years ago has been identified",
    "Eva Marie Uzcategui / Bloomberg via Getty Images file",
    "Kamil Krzaczynski / AFP via Getty Images",
    "Need a new passport? State Department says apply at least 6 months before your departure",
    "Allison Joyce / Bloomberg via Getty Images",
    "Mortgage demand drops to lowest level in a month as interest rates rise",
    "NHTSA presses Tesla for more records in Autopilot safety probe",
    "What experts want you to know about dog food",
    "What causes rosacea? Derms explain",
    "June reader favorites: KN95 masks, portable air conditioners and more",
    "Watch: Yankees cameraman injured by overthrown ball",
    "Bull-running San Fermin festival gets underway in Pamplona",
    "Can Tom Cruise save the summer blockbuster?",
    "AI could help plan your next vacation — here's how to do it",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Barriers to transgender health care lead some to embrace a do-it-yourself approach",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "@beberexha / via Instagram",
    "Fans keep throwing stuff at artists onstage. Will it ever stop?",
    "Julia Nikhinson / Sipa / Bloomberg via Getty Images file",
    "Drew Angerer / Getty Images file",
    "'Smallville' actor Allison Mack released from prison early after cult sex trafficking conviction",
    "dtimiraos / Getty Images/iStockphoto",
    "WHO report on deadly virus among babies in 3 countries has U.S. doctors on edge",
    "Irina Shatilova / Getty Images/iStockphoto",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "Chinnapong / Getty Images/iStockphoto",
    "BelVita breakfast sandwiches recalled for possible peanut contamination",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "A disjointed jet stream has some climate scientists spooked",
    "'Dolores Roach' actor Justina Machado still loves empanadas — though not the horror-filled kind",
    "Rich Fury / Getty Images file",
    "Al Drago / Bloomberg via Getty Images file",
    "Proposed English-speaking part in revamped U.S. citizenship test raises concerns",
    "Gentrification leads to madness and cannibalism in ‘The Horror of Dolores Roach’",
    "For two California reparations task force members, the hard work comes next",
    "Visual Ideas/Nora Pelaez / Getty Images/Tetra images RF",
    "Some Black Twitter users are hoping this app will be a safe space",
    "Supreme Court backtracked on Black death row inmates’ racial bias claims, liberal justices say",
    "Exonerated member of ‘Central Park Five’ wins primary for NYC Council seat",
    "1 in 5 United Methodist congregations in the U.S. have left over LGBTQ conflicts",
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "Philadelphia shooting suspect isn't trans, officials say, but speculation continues",
    "John Phillips / Getty Images",
    "‘Peaky Blinders’ and Cillian Murphy denounce homophobic video shared by DeSantis campaign",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "South Korea includes American teenager in Women’s World Cup squad",
    "Scott Eisen / Getty Images file",
    "Do Not Sell My Personal Information"
]