[
    "'Like a Van Gogh': A disjointed jet stream has some climate scientists spooked",
    "Smoke from Canadian wildfires has 'no end' in sight as South swelters",
    "Summer travel season off to rough start amid widespread flight delays",
    "Paul Daly / The Canadian Press via AP",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "U.S. Coast Guard opens investigation into fatal sub implosion",
    "Manuel Balce Ceneta / AP file",
    "Biden warns top aides against offering him political advice about Hunter",
    "Hunter Biden, fresh off his plea agreement, attends state dinner at White House",
    "Legal experts say the charges against Hunter Biden are rarely brought",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "Biden says he sees 'no real consequence' to calling Xi a 'dictator'",
    "Blinken says spy balloon 'chapter should be closed' after China talks",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Biden says Putin was weakened by Yevgeny Prigozhin's revolt",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Owen Berg / NBC News / Getty Images",
    "Liberal wins at the Supreme Court may prove to be fleeting",
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Biden pushes vision for economic growth 'from the middle out and bottom up'",
    "Biden has started using a CPAP machine at night to deal with sleep apnea",
    "Connecticut House Democrats",
    "State Rep. assaulted after attending Eid service with her family in Connecticut",
    "Charges dropped against NYC man accused in fatal subway stabbing",
    "Yankees pitcher Domingo Germán throws perfect game against Oakland",
    "Missouri man sentenced in death of woman who was caged and dismembered",
    "Abducted infant killed when man drives Camaro into Ohio house at 'full speed'",
    "As China crests second Covid wave, families still mourn victims of the first one",
    "Police arrest 150 as unrest spreads after 17-year-old driver killed by officer in France",
    "Max Mumby / Indigo / Getty Images",
    "Inflation hits royal finances as King Charles turns down heating to save emissions",
    "After 27 tries, Chinese millionaire considers giving up on college entrance exam",
    "Pie in the sky! A wall painting found in Pompeii doesn't depict Italy’s iconic dish",
    "Sthanlee B. Mirador / Sipa USA via AP",
    "Colleen Ballinger responds to allegations with a song",
    "Frazer Harrison / Getty Images file",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "Ethan Miller / Getty Images file",
    "Pete Davidson checks into rehab",
    "Chrissy Teigen and John Legend welcome baby No. 4",
    "Australian teen becomes first female to pull off Tony Hawk's famed '720' skateboard maneuver",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Inside daring effort to rescue Ukrainian children",
    "Delta jet makes emergency landing without nose gear",
    "Watch: Chimpanzee is awestruck after seeing open sky after 28 years in a cage",
    "Global outrage after tourist carves names into Rome's Colosseum",
    "Erik McGregor / LightRocket via Getty Images",
    "Sarah L. Voisin / The Washington Post via Getty Images file",
    "Supreme Court deals a blow to Trump ally John Eastman's 2020 election theory",
    "Arkady Budnitsky / Anadolu Agency via Getty Images",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Sean Gardner / Getty Images file",
    "NASCAR driver Jimmie Johnson's in-laws and their grandson are dead in an apparent murder-suicide",
    "Scott Eisen / Getty Images",
    "Trump explores messing with the first GOP debate",
    "Christine Peterson / Telegram & Gazette / USA Today Network",
    "Andrew Caballero-Reynolds / AFP - Getty Images",
    "Tick and mosquito season is already shaping up to be severe this year",
    "Have a summer cold? Common viruses are back from a pandemic hiatus",
    "What to know about the health risks of wildfire smoke",
    "Leonardo Munoz / VIEW press / Corbis via Getty Images file",
    "Overstock.com will relaunch Bed Bath & Beyond after buying its IP assets for $21.5 million",
    "Stephanie Keith / Bloomberg via Getty Images file",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Astronauts' urine and sweat are almost entirely recycled into drinking water with new system",
    "Blistering heat grips the South and puts Texas under triple-digit temperatures",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "Mexico Instituto Nacional de Migracion",
    "Bus of migrants help mother give birth before being detained in Mexico",
    "Alberto Ortega / Europa Press via Getty Images file",
    "Spanish Royal Academy rejects changing  language to anti-colonial ‘Ñamericano’",
    "Stefani Reynolds / Bloomberg via Getty Images file",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Brandon Bell / Getty Images file",
    "A 2013 Supreme Court decision invited widespread voter suppression laws, experts say",
    "Laurence Griffiths / Getty Images",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "Justine Good4 / NBC News; Getty Images / AP",
    "What to know about California's highly anticipated reparations proposal",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Chris Delmas / AFP via Getty Images file",
    "Dwyane Wade says his daughter physically hid from him when she came out to the family",
    "Oscars invite Taylor Swift, Ke Huy Quan, RRR and other new members to Academy",
    "Michelle Yeoh and Chadwick Boseman are honored with Walk of Fame stars",
    "Lev Radin / Sipa via AP file",
    "NYC makes Diwali an official school holiday, but there’s a catch this year",
    "Do Not Sell My Personal Information"
]