[
    "Russia claims full control of Bakhmut, a symbolic but costly victory for Putin",
    "Russia issues retaliatory arrest warrant for International Criminal Court prosecutor",
    "Zelenskyy says peace will become ‘closer’ as he makes dramatic visit to Japan for G7 summit",
    "Shelter operators in Mexico say some migrants are rethinking how to cross the U.S. border",
    "Supreme Court ends dispute over Trump-era asylum-seeker policy",
    "8-year-old girl dies in U.S. Border Patrol custody in Texas",
    "National Treasure gallops to victory in the 148th Preakness Stakes",
    "Horse trained by Bob Baffert euthanized on track ahead of the Preakness",
    "Horse deaths prompt calls for change at Churchill Downs",
    "15-year-old arrested after bringing AR-15, ammunition to a Phoenix high school, police say",
    "Spencer Platt / Getty Images file",
    "Charlie Javice, financial aid startup founder, indicted in JPMorgan Chase fraud case",
    "Holmes County Sheriff's Office via Facebook",
    "Girl, 2, dies after Florida parents 'decided to leave the child in the car', authorities say",
    "Forsyth County Sheriff's Office",
    "Semi truck driver charged in Oregon crash that killed 7 and injured 4",
    "Pregnant woman and her toddler fatally shot in Idaho, sheriff says",
    "Utah man admits to killing wife and in-laws, police say",
    "Hannah Schoenbaum / AP file",
    "Ting Shen / Bloomberg via Getty Images",
    "Debt ceiling talks back on after GOP briefly halted negotiations",
    "Strange alliances emerge in Tennessee as the GOP governor pushes for gun reform",
    "How national Democrats helped pull off a surprise win in the Jacksonville mayoral race",
    "Manchin seeks alternatives to Biden labor secretary nominee Julie Su",
    "Stefan Rousseau / Pool via Getty Images",
    "The G7 shows China's rise prompting assertive new alliances in its own backyard",
    "At least 9 dead in crush at soccer stadium in El Salvador",
    "Pakistani trans activists to appeal Shariah court ruling against law aimed at protecting them",
    "Extremist Israeli Cabinet minister visits sensitive Jerusalem holy site",
    "British novelist Martin Amis dies at 73",
    "Justine Goode / NBC News / Getty Images",
    "Inside ChatGPT: How AI chatbots work",
    "Trying to make sense of artificial intelligence? Here's your guide",
    "An AI glossary: The words and terms to know about the booming industry",
    "MLB player opens up on taking a step back from baseball due to anxiety",
    "L.A. food truck serving up Korean staples with a twist",
    "Jim Brown, legendary NFL running back, dies at age 87",
    "L.A. Dodgers under fire for rescinding Pride Night invite to drag group",
    "New Mexico teen gunman who killed three women struggled with mental health, family said",
    "Chandan Khanna / AFP - Getty Images file",
    "In Florida, agricultural workers are fearful and brace for changes under new immigration law",
    "Most endangered U.S. historic sites include two Chinatowns",
    "Jordan Vonderhaar for NBC News",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "National Center for Missing & Exploited Children",
    "Mother accused of kidnapping Illinois girl from 'Unsolved Mysteries' is released on bond",
    "Valentyn Ogirenko / Reuters via Redux",
    "Russian scientists face treason charges as 'unstoppable' missiles they worked on are shot down",
    "DeSantis is sending Florida law enforcement and National Guard members to the Texas border",
    "Why you gotta be so mean? Rude concertgoer behavior is ruining the fun for some fans",
    "Patrick McMullan via Getty Images file",
    "'Live Laugh Lesbian': Target's cheeky Pride collection strikes again",
    "Irfan Khan / Los Angeles Times via Getty Images",
    "Black WGA strikers say they've helped streamers boost diversity — and wound up worse off",
    "Montana banned TikTok. Creators in the state are bracing for what's next.",
    "Child labor bill passed by Iowa Legislature appears to violate federal law, federal officials say",
    "Monica Schipper / Getty Images file",
    "YouTuber and VidCon co-founder Hank Green shares cancer diagnosis",
    "Andy Rourke, The Smiths bass player, dies at 59",
    "Salman Rushdie honored at PEN America gala, his first in-person appearance since stabbing",
    "Nathan Stirk / Getty Images",
    "If bird flu starts to spread among people, existing vaccines may be inadequate, experts say",
    "Jazmin Orozco Rodriguez / KFF Health News",
    "Small, rural communities are becoming abortion access battlegrounds",
    "Florian Gaertner / Photothek via Getty Images file",
    "Weight loss drugs can lead to muscle loss, too. Is that a bad thing?",
    "Woman who refused tuberculosis treatment found in contempt of court weeks after arrest warrant",
    "Government of Alberta Fire Service/The Canadian Press via AP",
    "Wildfires rip across Canada as heat wave smashes temperature records",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Scientists announce rough draft of human pangenome",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "Family Photos; Jordan Vonderhaar for NBC News",
    "The 73 minutes that changed Uvalde haunts a family who lost their child",
    "The parents of an 8-year-old who died in Border Patrol custody call for 'justice'",
    "Black astronaut says lunar mission will be 'major accomplishment' in American history",
    "Racist threat against Black students at California high school evokes fear in parents",
    "Missouri teacher who used racial slur resigns; student who taped him suspended",
    "Raymond Boyd / Getty Images file",
    "Tupac Shakur to be honored with a street name in California",
    "Orlando police investigate a hateful anti-gay message written on a traffic sign",
    "Miguel Sotomayor / Getty Images",
    "Trans girl is told not to wear dress to Mississippi graduation, lawsuit says",
    "Daniel Knighton / Getty Images file",
    "LA Pride drops out of Dodgers' Pride Night after the team disinvites drag troupe",
    "Jacobs Stock Photography Ltd / Getty Images",
    "Asian Americans are least likely of all racial groups to have an end-of-life plan, new study finds",
    "Fans upset by death of Marvel's first Muslim superhero",
    "An ancient writing system from the Philippines makes an unlikely comeback",
    "What to shop this Memorial Day",
    "Best weekender bags for your next short getaways",
    "Casper; Lo & Sons; Pottery Barn",
    "The 6 best sales to shop right now",
    "30 best new products so far this May",
    "5 best luggage tags for travel",
    "Our essential guide to grooming your dog at home",
    "The best early Memorial Day sales to shop now",
    "7 best lightweight luggage options",
    "aldomurillo / Getty Images",
    "The best standing desks, according to ergonomic experts",
    "9 ways to treat sunburns at home",
    "Do Not Sell My Personal Information"
]