[
    "Live: Supreme Court decisions",
    "Supreme Court rejects race as a determining factor in college admissions",
    "Jonathan Drake / Reuters / Redux",
    "Just now18m agoFootnote: Affirmative action decision doesn't apply to military academies",
    "Just now18m agoHarvard says they will comply with decision",
    "Just now25m agoRon DeSantis praises affirmative action ruling",
    "Just now29m agoSotomayor's dissent: 'Equality requires acknowledgment of inequality.'",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "4 things students need to know now",
    "Amy Sussman / Getty Images file",
    "Civil rights groups blast Supreme Court for sharply curtailing affirmative action",
    "Supreme Court rules for Christian postal worker who refused to work Sundays",
    "David Gladstone / NBC News",
    "Mike Pence meets with Zelenskyy in surprise trip to Ukraine",
    "Top generals' uncertain fate overshadows Putin's show of public support",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "As China crests second Covid wave, families still mourn victims of the first one",
    "U.S. intelligence community remains divided over likely Covid origin, report shows",
    "Pittsburgh Post-Gazette; AP; Getty Images",
    "71 million under heat alerts as smoke from wildfires has 'no end' in sight",
    "Just now32m agoRockland County urges people to wear N95 masks",
    "Just now48m agoSatellite views of the smoke",
    "Just now1h agoMaryland and D.C. issue ‘code red’ air quality alerts",
    "Just now2h ago71 million people under heat alerts",
    "A disjointed jet stream has some climate scientists spooked",
    "Kena Betancur / Getty Images",
    "Summer travel season off to rough start amid widespread flight delays",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Samuel Corum / Bloomberg via Getty Images fileNBC News; Getty IMages",
    "For some Republicans who endorsed Biden in 2020, the next election looks bleak",
    "Manuel Balce Ceneta / AP file",
    "Biden warns top aides against offering him political advice about Hunter",
    "State Rep. assaulted after attending Eid service with her family in Connecticut",
    "Biden has started using a CPAP machine at night to deal with sleep apnea",
    "Live updates: Task force will recommend dozens of policies for California reparations",
    "At least 12 have drowned at Florida beaches as rip current continues to plague Panhandle",
    "Matt Nighswander / NBC News",
    "Tiffany's flagship store in Manhattan is on fire, authorities say",
    "Utah grief author accused of poisoning her husband sued for over $13M by his sister",
    "Charges dropped against NYC man accused in fatal subway stabbing",
    "Stefano Rellandini / AFP - Getty Images",
    "France to deploy 40,000 officers to quell violence after deadly police shooting",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "Shootout outside U.S. consulate in Saudi port city leaves assailant and security guard dead",
    "Professor and 2 students stabbed in gender issues class at Canadian university",
    "Inflation hits royal finances as King Charles turns down heating to save emissions",
    "Catherine Powell / Getty Images for CMT file",
    "Country music star Kelsea Ballerini hit in the face during a concert",
    "ABC Photo Archives / Disney via Getty Images",
    "'Boy Meets World' stars say Ben Savage 'disappeared' from their lives: 'He ghosted us'",
    "Sthanlee B. Mirador / Sipa USA via AP",
    "Colleen Ballinger responds to allegations with a song",
    "Pete Davidson checks into rehab",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "Kelsey Brunner for NBC News",
    "Follow the latest news and conversations at the Aspen Ideas Festival",
    "Just now28m agoDucey: Immigration is a 'solvable problem'",
    "Just now46m agoHenry: America's immigration system neglects people’s well-being",
    "Just now51m agoDucey defends decision to bus migrants to D.C.",
    "Just now1h agoRep. Gonzales says his constituents are 'tired' and 'exhausted'",
    "How to have sensitive conversations about race at Aspen Ideas Festival",
    "Follow full coverage of the Aspen Ideas Festival",
    "The best products to buy during Prime Day",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "Madonna hospitalized with bacterial infection, postpones tour",
    "Simone Biles to return to competition for the first time since Tokyo",
    "Inside daring effort to rescue Ukrainian children",
    "Delta jet makes emergency landing without nose gear",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Tick and mosquito season is already shaping up to be severe this year",
    "Erik McGregor / LightRocket via Getty Images",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Supreme Court strikes down college affirmative action programs",
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Kevin Dietsch / Getty Images",
    "Laurence Griffiths / Getty Images",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "Science Photo Library - CDC / Getty Images",
    "CDC recommends RSV shots for older adults, clearing the way for vaccinations to begin this fall",
    "Christine Peterson / Telegram & Gazette / USA Today Network",
    "Andrew Caballero-Reynolds / AFP - Getty Images",
    "Have a summer cold? Common viruses are back from a pandemic hiatus",
    "Leonardo Munoz / VIEW press / Corbis via Getty Images file",
    "Overstock.com will relaunch Bed Bath & Beyond after buying its IP assets for $21.5 million",
    "Stephanie Keith / Bloomberg via Getty Images file",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "Astronauts' urine and sweat are almost entirely recycled into drinking water with new system",
    "Key civil rights groups blast Supreme Court for sharply curtailing affirmative action",
    "4 things students need to know after the Supreme Court ruled against affirmative action",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "California reparations live updates: Task force will recommend dozens of policies",
    "Timothy D. Easley / AP file",
    "Judges in Kentucky and Tennessee block portions of transgender youth care bans",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Oscars invite Taylor Swift, Ke Huy Quan, RRR and other new members to Academy",
    "Do Not Sell My Personal Information"
]