[
    "Chip Somodevilla / Getty Images file",
    "A break-glass option, gumbo and a bike ride: How the debt ceiling deal got done",
    "Biden-McCarthy debt ceiling bill passes the House and will head to the Senate",
    "McCarthy proves his naysayers wrong",
    "Instead of door-knocking, they were at the casino: Inside the flawed GOP turnout operation",
    "Ron DeSantis' security becomes a flashpoint for Florida’s top police agency",
    "Mike Pence is set to launch his presidential campaign next week",
    "Marco Gualazzini / Contrasto / Redux",
    "Russian mercenaries exploit a war-torn African nation as they lead Putin’s fight in Ukraine",
    "U.S. accuses Russia's Wagner Group mercenaries of fueling war in Sudan",
    "Ukraine prepares 'for a new phase of the war' as counteroffensive appears imminent",
    "Family of Native American man killed by Border Patrol in Arizona wants to know why he was shot",
    "As the U.S. government expands UFO investigations, a new group forms for pilots who spot them",
    "'Trump Bucks' websites taken down after being exposed for selling bogus currency",
    "Kevin Dietsch / Getty Images",
    "Pentagon is blocking U.S. cooperation with international investigations of war crimes in Ukraine",
    "L.E. Baskow / Las Vegas Review-Journal",
    "Pentagon leaders cancel drag show at a Nevada Air Force base",
    "A verified AOC parody account got a boost from Elon Musk’s Twitter",
    "Abbott appoints interim attorney general in Texas following Paxton’s impeachment",
    "Lowndes County Sheriff’s Office",
    "Police video shows a car rocketing off a tow truck on a Georgia highway",
    "Danny Lawson / PA via Getty Images",
    "3 teens arrested after killing and eating New York village's prized swan, police say",
    "Tenants of partially collapsed building in Iowa say complaints were ignored for years",
    "Doug Lindey / The Journal via AP file",
    "Hawaii man pleads guilty and is fined following death of Yellowstone bison calf",
    "Search for man who fell off Carnival cruise ship near Florida is suspended",
    "Nun whose body shows little decay since 2019 death draws hundreds to rural Missouri",
    "De Agostini via Getty Images",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "Leigh Henningham / Monash Turner Institute",
    "The shape of your brain may strongly influence your thoughts and behavior, study finds",
    "Bruce Willis’ daughter Tallulah reveals the first signs he had dementia",
    "Teen birthrates hit another record low as progress starts to slow",
    "Foodborne illness outbreaks at restaurants are often linked to sick workers, CDC finds",
    "Myung J. Chun / Los Angeles Times via Getty Images",
    "Danny Masterson found guilty of rape",
    "Kim Cattrall couldn't stay away from 'Sex and the City' role after all",
    "Katie Jones / Variety / Penske Media via Getty Images file",
    "Actor Armie Hammer won’t face sexual assault charge",
    "Sean ‘Diddy’ Combs files lawsuit alleging race played a role in marketing of his liquor brands",
    "Months after Adidas cut ties with Kanye West, Yeezy shoes are back on sale",
    "Franck Robichon / AFP - Getty Images",
    "U.S. warns China: Refusing to talk risks incidents ‘spiraling’",
    "Sam Mooy / Getty Images file",
    "Australian veteran loses defamation case over reports of Afghan execution",
    "Gints Ivuskans / AFP - Getty Images",
    "Latvian Parliament elects first openly gay president of a Baltic nation",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "An airline is asking passengers to weigh in before their flights",
    "Actor Danny Masterson found guilty of rape",
    "Dramatic car flip caught on camera",
    "Watch: Dashcam captures missile falling on busy Kyiv highway",
    "NASA and Pentagon officials present UFO preliminary findings",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "A dedicated generation has changed the way Asian food is consumed",
    "Justine Goode / NBC News / Getty Images",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "NBC News; Courtesy The Street Sensei",
    "How drag bans have made clothing a political statement, according to a queer style expert",
    "Anna Moneymaker / Getty Images",
    "Debt ceiling vote news: Biden-McCarthy plan passes, heads to Senate",
    "Tom Williams / CQ-Roll Call Inc. via Getty Images",
    "Amazon.com's Ring will pay $5.8 million after employees spied on customer videos",
    "AI risks leading humanity to 'extinction,' experts warn",
    "LGBTQ activists call for new strategies to promote equality after Target backlash",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Kevin Frayer / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "NOAA predicts 'near-normal' hurricane season",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Acquittal in Louisiana fuels fight to review at least 1,500 nonunanimous verdicts",
    "Oscar Gonzalez / NurPhoto via Getty Images",
    "Writer Gioconda Belli, stripped of citizenship by Nicaragua's government, wins poetry prize",
    "A New York man is fired after a woman accused him of ripping her wig off in the street",
    "Paras Griffin / Getty Images file",
    "Teen fatally shot in back by S.C. store owner who wrongly accused him of shoplifting, sheriff says",
    "LGBTQ flag burned at California elementary school before Pride event",
    "MLB players say drag troupe invited to Dodgers' Pride Night mocks Christianity",
    "Sign with a homophobic slur in front of Florida business sparks backlash",
    "Filipino cuisine gets a nod in one of the U.S.'s highest culinary honors",
    "Leila Register / Getty Images",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "The best cooling pillows of 2023",
    "Memorial Day mattress and bedding sales to shop",
    "14 best sunscreens for sensitive skin",
    "Do Not Sell My Personal Information"
]