[
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "Ron DeSantis' presidential campaign launch melts down in Twitter glitches",
    "A glass of wine and a laughing-crying emoji: Trump team trolls Ron DeSantis launch",
    "With DeSantis event, Twitter solidifies its place in the conservative media world",
    "Getty Images; Redferns; APPaul Natkin / Getty Images",
    "Tina Turner, 'Queen of Rock 'n' Roll,' dies at 83",
    "A look back at the music icon's legendary life and career",
    "FROM 2020: Tina Turner reflects on love and finding joy through fashion",
    "Target quietly moves Pride merchandise in some stores as conservative activists declare victory",
    "Brandon Bell / Getty Images",
    "Uvalde’s town square is a space for public mourning a year after elementary school massacre",
    "The 73 minutes that changed Uvalde haunts the families of the children who died",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Fitch puts U.S.' AAA on rating watch negative",
    "House Democratic angst grows as Biden's debt limit negotiations with GOP drag on",
    "Inside the Florida group pushing to slash food stamp rolls nationwide",
    "2024 presidential tracker: See who's in the race and who's on the sidelines",
    "White House memo says GOP was caught ‘telling the truth’ on motive for Hunter Biden probe",
    "Saul Loeb / AFP via Getty Images",
    "Jan. 6 rioter who put his feet on desk in Pelosi office sentenced to 4.5 years in prison",
    "Biden picks history-making Air Force fighter pilot to serve as next Joint Chiefs chairman",
    "Jack Dorsey shares Robert F. Kennedy Jr. video echoing conspiracy theories",
    "Texas GOP leaders in feud over alleged drinking on the job and 'illegal conduct'",
    "DHS warns of attacks against government buildings, minority groups ahead of 2024 election",
    "Walker Mortuary; KPCW.org via AP",
    "Key moments in the poisoning death of a Utah dad and his wife’s arrest",
    "Driver of U-Haul that rammed White House gate is not a U.S. citizen, prosecutors say",
    "Artist instantly paralyzed after being shoved into moving subway train, New York prosecutor says",
    "Joshua Boucher / Pool / The State via AP",
    "Alex Murdaugh indicted on financial fraud charges related to housekeeper's death",
    "3 former Mississippi police officers indicted in death of man in custody",
    "Man arrested at Va. preschool had an AK-47 in his car and said he was going to the CIA, police say",
    "Anwar Hussein / Getty Images file",
    "FBI releases its files on Queen Elizabeth II, revealing fears of 'everpresent' IRA threats",
    "Russian Defense Ministry / EPA via Shutterstock",
    "U.S. distances itself from raid into Russia that involved American military vehicles",
    "95-year-old Australian woman dies after police shoot her with stun gun",
    "Miami zoo apologizes after treatment of kiwi bird outrages New Zealand",
    "German police conduct raids on climate activists as impatience mounts",
    "Moha El-Jaw / Getty Images / iStockphoto",
    "New clues emerge about possible factors behind sudden infant death syndrome",
    "Tanja Ivanova / Getty Images",
    "Multivitamins may help slow loss of memory as people get older",
    "Experimental brain and spinal cord implants restored a paralyzed man's ability to walk",
    "CDC investigating salmonella outbreak in 6 states linked to Papa Murphy's cookie dough",
    "U.S. progress in HIV fight continues to trail many other rich nations",
    "'Jeopardy' fans are livid after minor spelling error ends record-setting 9-game winning streak",
    "Trae Patton / NBC via Getty Images",
    "'The Voice' crowns Season 23 winner as Blake Shelton gets his farewell",
    "Melissa McCarthy recalls working on 'hostile' set that made her 'physically ill'",
    "Bruce Willis' wife gets emotional sharing how daughter, 9, helps care for her dad",
    "Netflix password sharing crackdown rolls out in the U.S.",
    "A look back at Tina Turner’s iconic career",
    "Why Tina Turner was ‘simply the best’",
    "Paralyzed man able to walk again with brain and spine implants",
    "Researchers debate why orcas are attacking and sinking boats",
    "Leila Register / NBC News; Getty Images",
    "Their small businesses went viral on TikTok for the wrong reasons — now what?",
    "Francois Gohier / VW Pics/Universal Images Group via Getty Images file",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Government of Alberta Fire Service / The Canadian Press via AP file",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Paul Natkin / Getty Images",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Ivan Romano / Getty Images file",
    "Google searches questioning sexuality and gender up 1,300% since 2004, analysis shows",
    "Three states agree to reduce water usage so the Colorado River doesn't go dry",
    "NASA has sights set on Mars with help from a nuclear rocket engine",
    "Gilles Clarenne  / AFP - Getty Images",
    "Texas says phone app encourages illegal border crossings in suit against Biden administration",
    "Melissa Sue Gerrits / Getty Images file",
    "With affirmative action on the line, colleges consider changes to the admissions process",
    "Elite Virginia high school doesn't discriminate against Asian Americans, court finds",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "The NAACP's Florida travel advisory is less about traveling and more about Black voters",
    "Thom Bridge / Independent Record via AP file",
    "Montana first to ban drag performers from reading to children in schools, libraries",
    "Target pulls some Pride collection items after threats to employees",
    "Amir Hamja / Bloomberg via Getty Images file",
    "'Stop Asian Hate' drove a funding surge for AAPI startups and nonprofits. What comes next?",
    "Richard Shotwell / Invision / AP file",
    "Ming-Na Wen, 'Joy Luck Club' actor, will finally get a star on Hollywood Walk of Fame",
    "Memorial Day mattress and bedding sales to shop",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "The best early Memorial Day sales to shop now",
    "Lululemon just launched a new-and-improved trail sneaker",
    "7 best Amazon gaming week deals",
    "The best sunscreens for oily skin",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "The best luggage under $150",
    "Do Not Sell My Personal Information"
]