[
    "Adria Malcolm for NBC News; Getty Images",
    "Migrants met by Border Patrol vans moments after Title 42 lifted",
    "WATCH: Groups of migrants cross the Rio Grande near Brownsville, Texas",
    "Russia denies any Ukrainian breakthrough after Bakhmut gains spark panic",
    "Ukraine drives back Russian forces around Bakhmut in its first significant gains in months",
    "U.S. envoy says Russian ship picked up weapons in South Africa",
    "Michael M. Santiago / Getty Images",
    "NYC subway rider who put Jordan Neely in fatal chokehold surrenders to police",
    "Ex-Marine who fatally choked a subway performer to be charged with manslaughter",
    "Drew Angerer / Getty Images file",
    "Congress leaves town with no debt ceiling deal, but some see signs of progress",
    "Debt ceiling meeting between Biden and congressional leaders is delayed",
    "Vartika Sharma for NBC News",
    "National Maternal Mental Health Hotline received over 12,000 calls and texts in its first year",
    "A simple, low-cost treatment could save 22,000 new mothers' lives every year, scientists suggest",
    "YouTuber who crashed plane in California mountains did it for sponsorship deal, authorities say",
    "Hopewell Township Police Department via AP file",
    "Meteorite crashes through roof of New Jersey home and bounces around in a bedroom",
    "A Chicago woman was arrested in a series of baseball bat attacks, police say",
    "Missing 30-year-old Ohio EMT found alive, police say",
    "University of Utah swimmer allegedly flees to Canada amid rape investigation, police say",
    "Justice Department seeks to prevent Trump deposition in lawsuits by ex-FBI officials",
    "Brittainy Newman / AP file",
    "Judge in Virginia says law banning sales of handguns to young adults is unconstitutional",
    "Jeff J Mitchell / Getty Images",
    "Trump notifies court he plans to appeal $5 million E. Jean Carroll verdict",
    "CIA announces steps to tackle sexual misconduct cases",
    "Criminal investigation into Sen. Bob Menendez expands with new subpoenas",
    "Aamir Qureshi / AFP - Getty Images",
    "Former Pakistan PM Imran Khan released on bail",
    "Mahmud Hams / AFP - Getty Images",
    "Palestinian militants fire more rockets, Israeli airstrikes hit Gaza despite cease-fire efforts",
    "Sudan's rival forces agree to protect civilians but no cease-fire",
    "Top jewelry pieces fall short of target prices at Christie’s auction derided by Jewish groups",
    "Marlena Sloss / Bloomberg via Getty Images file",
    "Elon Musk says he's hired a new CEO for Twitter and will reduce his own role",
    "Al Drago / Bloomberg via Getty Images",
    "Covid transformed the U.S. labor market, and it isn’t done yet",
    "Douglas Sacha / Getty Images",
    "Blinded by the light: Cars in the U.S. still lack glare-reducing headlight technology",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "Peloton recalls 2.2 million exercise bikes over safety hazard",
    "Grocery store prices drop for first time since September 2020",
    "Peloton recalls more than 2M bikes over safety hazard",
    "Google unveils latest AI features",
    "Artificial intelligence helping recycling center sort waste",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Trump's comments on Mar-a-Lago documents 'like red meat to a prosecutor'",
    "Christina Chung for NBC News",
    "Tough immigration policies are making it harder to build new homes",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "Natalee Holloway case suspect to be extradited to U.S. in alleged fraud targeting her mom",
    "Erik McGregor / LightRocket via Getty Images file",
    "Supreme Court throws out convictions in sweeping New York corruption probe",
    "Walker Mortuary; KPCW.org via AP",
    "Utah mom accused of killing husband with fentanyl tried to poison him before, family says",
    "Jessica Rinaldi / Boston Globe via Getty Images file",
    "Parents' fraud convictions in college admissions scandal overturned by appeals court",
    "Arturo Holmes / FilmMagic file",
    "Elliot Page recalls past feelings of dysphoria and 'joy' he now feels in his body",
    "Jacklyn Zeman, longtime 'General Hospital' actor, dies at 70",
    "Paul Chinn / San Francisco Chronicle via Getty Images file",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "Paramount brands to lay off 25% of U.S. staff as MTV News shuts down",
    "CDC monitoring cases of drug-resistant ringworm",
    "FDA ends ban on blood donations from gay and bisexual men",
    "At least 2 cases of drug-resistant ringworm infections found in the U.S., CDC says",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Stringer via Reuters/Redux",
    "Patrick T. Fallon / AFP via Getty Images",
    "Live updates: Migrants weigh next steps after Title 42 immigration policy expires",
    "Adria Malcolm for NBC News",
    "House passes Republican border security bill hours before Covid restrictions lift",
    "Andrew Savulich / New York Daily News/TNS via Getty Images file",
    "White House calls for 'thorough investigation' into Jordan Neely's death",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Ed Reed / Office of Mayor Eric Adams",
    "NYC mayor calls fatal subway chokehold on Jordan Neely a ‘tragedy that never should have happened’",
    "Arkansas Pride event changes venue after drag show restriction",
    "Charlie Neibergall / AP file",
    "West Virginia’s Bob Huggins agrees to $1M pay cut, 3-game suspension for homophobic slur",
    "Man accused in deadly shooting at  Taiwanese church in California is indicted on 98 charges",
    "José Luis Villegas  / AP file",
    "California Senate passes bill that would make caste discrimination illegal",
    "'Sesame Street' debuts its first Filipino American muppet",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "Mother's Day gifts for every kind of mom",
    "Do Not Sell My Personal Information"
]