[
    "Canadian wildfire smoke disrupts U.S. air travel",
    "Live Updates / 123 million under air quality alerts",
    "Another day of orange haze in store as NYC endures world's worst air quality",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Florida grand jury investigates Trump classified document handling",
    "Trump ally Bannon subpoenaed in special counsel Jack Smith's Jan. 6 grand jury probe",
    "Secret Service agents have testified in Trump classified documents probe",
    "Wally McNamee / Corbis via Getty Images file",
    "Pat Robertson, conservative evangelist and Christian Coalition founder, dies at 93",
    "Robertson was one of the most prominent and influential Christian broadcasters in the U.S.",
    "Maxar Technologies; Planet Labs",
    "Satellite images show the scale of the Ukraine dam destruction",
    "What could the Ukraine dam disaster mean for Russia's war?",
    "Biden and Sunak to focus on Ukraine and economic security in British PM’s first White House visit",
    "David Paul Morris / Bloomberg via Getty Images file",
    "States have introduced nearly 200 bills this year to 'subvert' elections, report finds",
    "Sarah Silbiger / Bloomberg via Getty Images file",
    "Conservatives bring the House to a halt as anger at McCarthy's debt deal remains",
    "Al Drago / Bloomberg via Getty Images",
    "Senators to introduce a bipartisan AI bill aimed at keeping up with China",
    "How Ron DeSantis found a home in Florida’s swamp",
    "Biden vetoes GOP bill seeking to block student loan forgiveness plan",
    "Marion County Sheriff's Office",
    "Sebastian Silva / AFP via Getty Images",
    "Joran van der Sloot, chief suspect in Natalee Holloway disappearance, transferred to U.S. custody",
    "Body found amid search for missing Minnesota mother and arrest made",
    "Child labor investigation spreads to meatpacking, produce companies in 11 states",
    "California campground gunman sentenced to 119 years in string of shootings that killed a father",
    "Jewel Samad / AFP via Getty Images file",
    "Olivier Chassignole / AFP - Getty Images",
    "4 children stabbed in knife attack in France",
    "Sea Shepherd Conservation Society / via AP",
    "World’s most endangered porpoise hangs on, avoiding extinction in Mexico’s Gulf of California",
    "Pope in ‘good general condition’ after surgery to remove intestinal scar tissue, repair hernia",
    "Australia to ban swastikas and other Nazi symbols",
    "John Salangsang / Invision for American Humane/AP file",
    "Shannen Doherty reveals breast cancer has spread to her brain in emotional post",
    "'Never Have I Ever' star Maitreyi Ramakrishnan on the signs Devi finally grew up in final season",
    "Grandmother knows best: Cuban American women tout their abuelas' cooking and life lessons",
    "An unsubstantiated claim that Jamie Foxx was hospitalized after a Covid vaccination is going viral",
    "The Iron Sheik, pro wrestling legend and social media star, dies at 81",
    "Fox News tells Tucker Carlson he violated his contract with new Twitter show",
    "Dimitrios Kambouris / Getty Images file Kevin Mazur / Getty Images",
    "Chris Licht out at CNN after tumultuous run as CEO",
    "Chris Trotman / LIV Golf / Getty Images",
    "Here's why the PGA Tour just merged with LIV Golf",
    "Apple to stop autocorrecting swear word to 'ducking' on iPhone",
    "SEC’s crypto crackdown unlikely to affect traders in near term but could transform the industry",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "FAA pauses some flights over reduced visibility from wildfire smoke",
    "Millions in US wake up to smoky haze for third day in a row",
    "The countdown is on in Paris for 2024 Olympics",
    "Spencer Platt / Getty Images",
    "What to know about the health risks of wildfire smoke",
    "Timothy A. Clary / AFP - Getty Images",
    "Asians in the U.S. say air quality ‘feels dangerously like home’",
    "Muhammed Enes Yildirim / Anadolu Agency via Getty Images",
    "Eduardo Munoz Alvarez / Getty Images",
    "Air quality concerns continue into Thursday as wildfire smoke covers the Northeast",
    "Classified documents probe: Trump lawyers told by DOJ he is the target of investigation",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Is it safe to exercise outdoors when the air quality is poor?",
    "More kids and teens are getting anxiety medication without therapy, report finds",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Rebecca Blackwell / AP file",
    "Here comes El Nino: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Two California lakes are making comebacks with different results",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "John Moore / Getty Images file",
    "Ulises Ruiz / AFP via Getty Images file",
    "8 young workers at drug cartel call center killed; bodies placed in bags",
    "Joe Maher / Getty Images file",
    "James MacDonald / Bloomberg via Getty Images",
    "Black residents of Detroit brace themselves for rougher air quality conditions",
    "Racist message, dead raccoon left for Oregon mayor, Black city council member",
    "Allen J. Schaben / Los Angeles Times via Getty Images",
    "Three arrested at protests outside an L.A. school board meeting about Pride Month",
    "Missouri governor signs bill banning transgender care for minors, some adults",
    "Congressman honors drag icon RuPaul on the House floor",
    "Pride flag burned outside a City Hall in Arizona",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "The best pimple patches for breakouts",
    "Where to find a KN95 mask right now",
    "TheraGun; Ooni; Vivian Le / NBC News",
    "22 best Father's Day gifts of 2023",
    "Songsak rohprasit / Getty Images",
    "Where to find NIOSH-approved N95 masks right now",
    "Kara Birnbaum/ NBC News; Vivian Le/ NBC News",
    "12 best pair hair removers of 2023",
    "9 new products launching in June",
    "May reader favorites: Sunscreens, deodorants and more",
    "Do Not Sell My Personal Information"
]