[
    "Gusher of cash reshapes GOP presidential contest",
    "Exclusive: Ron DeSantis administration officials solicit campaign cash from lobbyists",
    "After flubbed Twitter rollout, DeSantis' team talks strategy with donors",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Budweiser parent is now offering money back to boost sales after trans marketing backlash",
    "Target quietly moved Pride merchandise in some stores as conservative activists declare victory",
    "Hannah Rappleye / NBC News",
    "Months after residents sound the alarm, Pennsylvania 'cracks' down on Shell plant",
    "Pollution’s fatal threat gains urgency after 9 million died in one year",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images",
    "Top GOP negotiator says still many hang-ups in debt ceiling negotiations",
    "What will happen if the U.S. hits the debt ceiling?",
    "‘Lehman on steroids’: How a debt default now could be ‘much worse’ than 2011 crisis",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "What China wants to improve relations with U.S. and why it may be a tall order",
    "Dylan Hollingsworth / Bloomberg via Getty Images file",
    "Texas House committee recommends Attorney General Ken Paxton be impeached",
    "A North Dakota governor running for president? You betcha.",
    "Republicans brace for 2022 losers to take another crack at winning",
    "Feds investigating if Menendez and wife got gifts including D.C. apartment, Mercedes and jewelry",
    "Doug Mastriano will not run for Senate in Pennsylvania in 2024",
    "Oath Keepers founder gets 18 years in longest Jan. 6 sentencing yet",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board fines doctor who spoke about 10-year-old patient’s abortion",
    "Los Angeles District Attorney's Office via AP",
    "Man declared innocent of attempted murder and freed after 33 years in California prison",
    "2 planes aborted landings when a Southwest jet taxied across their runways in San Francisco",
    "Brian Laundrie's mother offered him a shovel and garbage bags in 'burn after reading' letter",
    "Passenger opens plane door during flight in South Korea",
    "JIJI Press / AFP - Getty Images",
    "Suspect in killing of 4 people, including 2 police officers, in Japan captured after standoff",
    "Car drives into gates of Downing Street where U.K. Prime Minister Rishi Sunak lives",
    "China faces a new Covid wave that could peak at 65 million cases a week",
    "Border raid exposes Russian defenses and divisions",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "On TikTok, there’s always a new ‘girl’ aesthetic",
    "Amanda Edwards / Getty Images file",
    "After a year of long overdue Hollywood love, actor James Hong is still having his moment",
    "Fans around the world gather to remember Tina Turner's influence",
    "There's growing evidence of marijuana's 'worrisome' link to mental health risks in young adults",
    "12 of the most common long Covid symptoms identified in long-awaited new report",
    "Tanja Ivanova / Getty Images",
    "Multivitamins may help slow loss of memory as people get older",
    "FDA grants full approval to Paxlovid to treat Covid in high-risk adults",
    "New clues emerge about possible factors behind sudden infant death syndrome",
    "Watch: Killer whale attack caught on camera near Morocco",
    "Hundreds of animals relocated to sanctuaries after Puerto Rico's only zoo closes",
    "Lululemon workers say they were fired for breaking policy after calling police on robbery",
    "Tina Turner remembered for empowering survivors of domestic abuse",
    "Tracking major Supreme Court cases",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "Thomas Simonetti / The Washington Post via Getty Images",
    "Ron DeSantis is stuck in the middle and getting punched from above and below",
    "Brandon Bell / Getty Images",
    "Uvalde's town square is a space for public mourning a year after elementary school massacre",
    "Samuel Corum / Getty Images file",
    "Debt ceiling: A deal is coming soon, GOP aide says",
    "@bizarre_design / via Instagram",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "Government of Alberta Fire Service / The Canadian Press via AP file",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Yang jin / Imaginechina / AP file",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "NSO spyware used in Armenia-Azerbaijan conflict, report finds",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban ‘Latinx’ now promote ‘Latine’",
    "Cuba's rural towns are hit hard with fuel shortages",
    "Mireya Acierto / Getty Images file",
    "DeSantis' anti-DEI education law creates confusion and a 'chilling effect' on faculty",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "The NAACP's Florida travel advisory is less about traveling and more about Black voters",
    "Parker Seibold / The Gazette via AP file",
    "After Club Q shooting, New York woman accused of threats to Colorado LGBTQ businesses",
    "Don't expect everyone on 'The Ultimatum: Queer Love' to get their happy ending",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "After being wrongfully accused of spying for China, professor wins appeal to sue the government",
    "The best Memorial Day sales to shop now",
    "Memorial Day mattress and bedding sales to shop",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "7 best Amazon gaming week deals",
    "The best sunscreens for oily skin",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "Do Not Sell My Personal Information"
]