[
    "All 5 aboard Titanic sub presumed dead after evidence of 'catastrophic implosion'",
    "AP; U.S. Coast Guard; Getty Images",
    "Just now53m agoOcean depth will make recovering bodies from Titanic submersible difficult",
    "Just now1h ago'Our hearts are broken,' Explorers Club, which lost 2 members on Titan, says",
    "Just now1h agoWhat legal action could OceanGate face after loss of Titan?",
    "Just now1h ago'I hope this discovery provides some solace': Coast Guard's Mauger",
    "Titan passenger Suleman Dawood’s aunt claims he was ‘terrified’ before trip",
    "Former Titan passengers share eerie accounts of safety issues",
    "Stefani Reynolds / AFP - Getty Images",
    "House postpones Biden impeachment vote, sending matter to committees",
    "Stefani Reynolds / Pool via AP",
    "Narendra Modi to address joint session of Congress as U.S. and India forge closer ties",
    "Win McNamee / Getty Images file",
    "Marjorie Taylor Greene calls Lauren Boebert 'a little b----' on the House floor",
    "J. Scott Applewhite / AP file",
    "Rep. George Santos' $500K bond was guaranteed by his father and aunt",
    "Biden says he sees 'no real consequence' to calling Xi a 'dictator'",
    "Biden's campaign won't be on TikTok, but wants its message there",
    "State Sen. Angela Paxton barred from voting on impeachment of her husband, Texas AG Ken Paxton",
    "Criminal charges filed over fake signatures that spoiled Michigan GOP gubernatorial bids",
    "Elizabeth Flores / Star Tribune via Getty Images",
    "Minnesota man charged with vehicular homicide in crash that killed 5 young Muslim women",
    "Suspect in mass shooting at Washington music festival told police he was high on psychedelics",
    "Kerry Sheridan / AFP via Getty Images file",
    "Giant African land snail spotted in Florida, forcing quarantine in parts of county",
    "San Francisco displays the largest ever pink triangle for Pride Month in a stand against pushback",
    "Texas continues to bake as blistering heat wave shows no sign of letting up",
    "'Straight out of a horror movie': Massive hail storm injures nearly 100 concertgoers",
    "Three of Mount Rainier's glaciers have melted away",
    "Kimberly White / Getty Images for TechCrunch file",
    "'It's horrifying': Discord CEO on child abuse issues after NBC News investigation",
    "Al Drago / Bloomberg via Getty Images",
    "TikTok COO Vanessa Pappas steps down",
    "Johnny Milano / Bloomberg via Getty Images file",
    "Overstock.com wins auction for Bed Bath & Beyond’s intellectual property, digital assets",
    "In hidden Discord communities, adults are abusing and extorting children",
    "'A moment of revolution': Schumer unveils strategy to regulate AI amid dire warnings",
    "Jo Yong-Hak  / Reuters / Redux",
    "Choi Sung-bong, 'Korea's Got Talent' singer and cancer scam celebrity, dies at 33",
    "Gaby Oraa / Bloomberg via Getty Images",
    "House Democrats push Biden admin on 'next steps' to help Venezuelans",
    "Natalia Kolesnikova / AFP via Getty Images",
    "WSJ journalist Evan Gershkovich must stay in jail until late August, Moscow court rules",
    "'Taylor Swift law' introduced to criminalize ticket scalping in Brazil",
    "Exhibition honors Caribbean children left behind by post-World War II migrants",
    "Kesha and Dr. Luke settle defamation lawsuit over sexual assault allegations",
    "Timothy A. Clary / AFP - Getty Images",
    "At 7-foot-4, expectations are high for leading NBA prospect Victor Wembanyama",
    "Corey Nickols / Getty Images for IMDb",
    "Diego Luna could make Emmy history for 'Star Wars'",
    "Clark Haggans, longtime NFL linebacker who won a Super Bowl with the Steelers, dies at 46",
    "77th NBA Draft kicks off at Barclays Center tonight",
    "Actor Luke Macfarlane is officially a daddy: 'Bros' star announces birth of baby girl",
    "Aaron Rodgers says using psychedelics with teammates was 'radically life-changing'",
    "Graphics show how abortion access has changed in America",
    "Poll: 61% of voters disapprove of Supreme Court decision overturning Roe",
    "Senate Democrats plan abortion-rights push to mark one year without Roe v. Wade",
    "Harris to deliver speech in North Carolina on anniversary of Roe v. Wade reversal",
    "Twins set to make history during NBA Draft",
    "Summer of bugs: Snails, crickets, lantern flies invade towns in US",
    "FTC alleges Amazon tricked users into signing up for Prime",
    "Search for missing sub focuses on underwater banging sounds",
    "Mark Abramson for NBC News",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Leila Register / NBC News; Getty Images",
    "Doctors say HCA hospitals push patients into hospice care to improve mortality stats",
    "Chelsea Stahl / NBC News; Getty Images",
    "How ex-Confederates spread racist attitudes far and wide after the Civil War",
    "Ibrahim Rayintakath for NBC News",
    "Jessica Fox / Canadian Forces",
    "U.S. District Court for the District of Columbia",
    "Joshua Boucher / Pool / The State via AP",
    "Judge in Alex Murdaugh trial says he 'felt sorry' for convicted murderer",
    "Judge strikes down Florida's ban on Medicaid funding for transgender treatment",
    "Harvard human remains case highlights need for body donation regulations, experts say",
    "CDC panel recommends RSV vaccines for adults ages 65 and up",
    "CDC warns people to protect themselves from measles when traveling",
    "Darrell Schoppe / Cover Images via AP",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Rescue operation faces extreme environment in search for missing sub",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "George Walker IV / AP file",
    "Congress and Postal Service unveil stamp honoring John Lewis",
    "Rocco Spaziani / Mondadori Portfolio via Getty Images file",
    "Shannon Broderick / Laramie Daily Boomerang via AP file",
    "Sorority says rules allow transgender woman at Wyoming chapter",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "The best way to clean your grill",
    "What is Walmart Plus Week?",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "When is Amazon Prime Day 2023? What to know",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Do Not Sell My Personal Information"
]