[
    "Officials say mission is still 'search and rescue' as target area 'exponentially' expands",
    "Inside the Titanic tourist submersible missing with 5 people",
    "Rescue operation faces extreme environment in search for missing sub",
    "Joshua Boucher / The State via AP, PoolJoshua Boucher / Pool / The State via AP",
    "Judge in Alex Murdaugh trial says he 'felt sorry' for convicted murderer",
    "From shocking deaths to murder charges: The events that led to Murdaugh's conviction",
    "Ibrahim Rayintakath for NBC News",
    "In hidden Discord communities, adults are abusing and extorting children",
    "Discord's rise punctuated by leak of classified documents",
    "Abdulmonam Eassa / AFP - Getty Images",
    "Blast in central Paris injures multiple people, gas explosion suspected",
    "U.S. District Court for the District of Columbia",
    "Jan. 6 rioter who electroshocked D.C. Officer Michael Fanone sentenced to 12.5 years",
    "D.C. chiropractor who 'scuffled' with officers on Jan. 6 is sentenced to prison",
    "Oath Keepers founder gets 18 years in longest Jan. 6 sentencing yet",
    "arker Michels-Boyce for The Washington Post via Getty Images file",
    "Four takeaways from Virginia's legislative primaries",
    "Sean Rayford / Getty Images file",
    "South Carolina's later GOP primary could open a big gap in the 2024 calendar",
    "Anna Moneymaker / Getty Images",
    "House Democrats grill John Durham during his testimony on FBI missteps in Trump-Russia probe",
    "Indicted Rep. George Santos' bail guarantors' names will be revealed Thursday, judge says",
    "Senators invite PGA Tour and LIV Golf heads to testify before Congress",
    "Pentagon leak suspect Jack Teixeira to be arraigned after federal indictment",
    "Rep. Lauren Boebert to force House vote on impeaching Biden",
    "Leila Register / NBC News; Getty Images",
    "Doctors say HCA hospitals push patients into hospice care to improve mortality stats",
    "Genetic genealogy used to link suspect in Idaho slayings to crime scene, prosecutors say",
    "Once wrongly imprisoned, member of ‘Central Park Five’ is running for office",
    "simpson33 / Getty Images/iStockphoto",
    "FTC sues Amazon over 'deceptive' Prime sign-up and cancellation process",
    "Sales of e-cigs packed with nicotine soar as regulators try to crack down",
    "Kansas man arrested and charged with threatening to bomb Nashville Pride event",
    "Idaho man accused of killing 4 'lost it' after neighbor allegedly exposed himself to family",
    "Fototeca Storica Nazionale / Getty Images file",
    "Rome's newest tourist spot: The site where Julius Caesar was assassinated",
    "Bloomberg via Getty Images file",
    "Biden calls Xi a 'dictator,' fueling Chinese anger",
    "Wolfgang Schwan / Anadolu Agency via Getty Images",
    "Ukraine conference grapples with ‘years and years’ of rebuilding needs",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi’s White House visit highlights deep diaspora divides",
    "41 women die in grisly riot in Honduran prison blamed on gangs",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Kindergarten teachers accused of drugging children in Taiwan",
    "Franco Origlia / FilmMagic",
    "French filmmaker Luc Besson cleared of all charges in rape case",
    "Michael Kovac / WireImage file",
    "Armie Hammer and Elizabeth Chambers reach divorce deal",
    "Michael Kovac / Getty Images",
    "Kesha 'almost died' after egg freezing complication due to autoimmune disorder",
    "Smosh co-founders reunite to acquire comedy brand from Rhett & Link",
    "Man who threw phone at Bebe Rexha during concert thought 'it would be funny,' police say",
    "What’s it like inside the missing submersible Titan?",
    "Man moved to tears when family surprises him with a new dog",
    "Meet three of the US players headed to the Women’s World Cup",
    "Inside look at the missing Titanic tourist submersible",
    "Mark Abramson for NBC News",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Chelsea Stahl / NBC News; handout photos; Getty Images",
    "Stephanie Mei-Ling for NBC News",
    "Black mermaids came to slay at annual Coney Island parade",
    "Andrej Isakovic / AFP via Getty Images file",
    "Rocked by 2 mass shootings in 2 days, this small country chose a different path",
    "Missing Titanic submersible live updates: Search effort is up to 2.5 miles deep, Coast Guard says",
    "Map: Where the pills for medication abortions are legal",
    "Gabby Jones / Bloomberg via Getty Images file",
    "Hospital turns over transgender patient records to Tennessee attorney general in investigation",
    "HCA hospitals accused of pushing patients toward hospice",
    "Supreme Court's Samuel Alito defends against ethics questions",
    "Elon Musk meets with Indian leader Narendra Modi, calling himself a 'fan'",
    "OceanGate Expeditions via AP",
    "Titanic tour company offered up-close experience for $250,000",
    "How vulnerable is your neighborhood to extreme heat?",
    "Homeowners in California and Florida are running out of options to protect their homes",
    "James Devaney / GC Images / Getty Images",
    "What happened to Bad Bunny's superhero spinoff?",
    "How one city's apology to Black and Latino residents sparked a backlash",
    "Colombia's Armed Forces Press Office via AP",
    "Indigenous plane crash searchers turned to ayahuasca to find missing kids",
    "Congress to unveil stamp honoring John Lewis",
    "Collin Mayfield / Sipa USA via AP file",
    "Atlanta police training center opponents sue over delays in approving referendum",
    "Bill Glauber / USA Today Network",
    "Two arrested in Milwaukee Juneteenth shooting that wounded 6, including alleged shooters",
    "Mickey Bernal / Getty Images file",
    "Judge strikes down Arkansas ban on transition care for minors",
    "Students and authors sue Florida school district that banned a book about two male penguins",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "When is Amazon Prime Day 2023? What to know",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Do Not Sell My Personal Information"
]