[
    "Bob Self / Florida Times-Union via USA TODAY NETWORK",
    "How national Democrats helped pull off a surprise win in the Jacksonville mayoral race",
    "Florida Democrats flip the Jacksonville mayor's office in a major upset",
    "Ting Shen / Bloomberg via Getty Images",
    "Debt ceiling talks back on after GOP briefly halted negotiations",
    "The debt ceiling debate could put health insurance in jeopardy for millions",
    "EXCLUSIVE: New House bill would block pay for members of Congress if the U.S. defaults",
    "New Mexico teen gunman who killed three women struggled with mental health, family said",
    "New Mexico teen gunman died in hail of police gunfire, likely his final wish, chief says",
    "Rob Edgcumbe / Stocktrek Images via AP file",
    "U.S. and allies plan to provide Ukrainian pilots with F-16 fighter jets",
    "Russia hit with new sanctions as Zelenskyy is set to join world leaders at G-7 summit in Japan",
    "Biden heads for a summit in Japan, leaving a looming crisis at home",
    "Black astronaut says lunar mission will be 'major accomplishment' in American history",
    "WATCH: Meet the 4 astronauts heading on a historic moon mission",
    "Jim Brown, legendary NFL Hall of Famer and civil rights activist, dies at 87",
    "Woman in video appearing to take bike from Black men has receipts she rented it, lawyer says",
    "Man charged with killing boy 9 years after 5-year-old was found in suitcase",
    "Utah mom accused of poisoning husband took out $2 million in life insurance policies on him",
    "3 arrested after caregivers in New Mexico accused of torturing disabled woman who died",
    "The parents of an 8-year-old who died in Border Patrol custody call for 'justice'",
    "CDC reports another death linked to recalled eyedrops, as cases of bacterial infection rise to 81",
    "Georgia prosecutor indicates charges in Trump election probe could come in early August",
    "Manchin seeks alternatives to Biden labor secretary nominee Julie Su",
    "Nebraska lawmakers pass 12-week abortion ban, restrictions on gender-affirming care for minors",
    "Pentagon leak suspect Jack Teixeira ordered to remain in jail as he awaits trial",
    "D.C. police lieutenant indicted on charge of tipping off Proud Boy Enrique Tarrio about arrest",
    "Xinhua News Agency via Getty Images file",
    "Top U.S. and China commerce officials to hold rare trade talks next week",
    "Icon and Image / Getty Images file",
    "Andy Rourke, The Smiths bass player, dies at 59",
    "Police taser a 95-year-old woman with dementia in Australia",
    "Syria's Assad receives warm welcome at Arab summit after years of isolation",
    "A costly joke: China slaps comedy firm with $2 million fine for military gag",
    "Montana banned TikTok. Creators in the state are bracing for what's next.",
    "Montana becomes first state to ban TikTok after governor signs bill into law",
    "Jim Brown, legendary NFL running back, dies at age 87",
    "L.A. Dodgers under fire for rescinding Pride Night invite to drag group",
    "Exoskeleton helps paralyzed college grad walk across stage",
    "Outrage after New Orleans Hertz denied Puerto Rican man’s rental car",
    "Justine Goode / NBC News / Getty Images",
    "Why you gotta be so mean? Rude concertgoer behavior is ruining the fun for some fans",
    "Chandan Khanna / AFP - Getty Images file",
    "In Florida, agricultural workers are fearful and brace for changes under new immigration law",
    "Most endangered U.S. historic sites include two Chinatowns",
    "Jordan Vonderhaar for NBC News",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "Inside ChatGPT: How AI chatbots work",
    "New York City public schools remove ChatGPT ban",
    "Trying to make sense of artificial intelligence? Here's your guide",
    "SeventyFour / Getty Images/iStockphoto",
    "Child labor bill passed by Iowa Legislature appears to violate federal law, federal officials say",
    "David Paul Morris / Bloomberg via Getty Images",
    "Federal Reserve chair hints at a pause in rate hikes when central bank meet next month",
    "Target is recalling 5 million scented candles because their glass jars can break",
    "Hyundai and Kia agree to $200 million settlement with customers over car thefts",
    "Twitter accuses Microsoft of misusing its data, foreshadowing a fight over AI",
    "Spencer Platt / Getty Images file",
    "Woman who refused tuberculosis treatment found in contempt of court weeks after arrest warrant",
    "Joseph Prezioso / AFP via Getty Images",
    "States with abortion bans could drive away young doctors, survey finds",
    "Couples 55 and older will be able to contribute more than $10,000 to health savings accounts",
    "1 in 5 older adults skipped or delayed medications last year because of cost",
    "Monica Schipper / Getty Images file",
    "YouTuber and VidCon co-founder Hank Green shares cancer diagnosis",
    "Salman Rushdie honored at PEN America gala, his first in-person appearance since stabbing",
    "Fans upset by death of Marvel's first Muslim superhero",
    "Government of Alberta Fire Service/The Canadian Press via AP",
    "Wildfires rip across Canada as heat wave smashes temperature records",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Scientists announce rough draft of human pangenome",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "8-year-old girl dies in U.S. Border Patrol custody in Texas",
    "Racist threat against Black students at California high school evokes fear in parents",
    "Missouri teacher who used racial slur resigns; student who taped him suspended",
    "Raymond Boyd / Getty Images file",
    "Tupac Shakur to be honored with a street name in California",
    "Orlando police investigate a hateful anti-gay message written on a traffic sign",
    "Miguel Sotomayor / Getty Images",
    "Trans girl is told not to wear dress to Mississippi graduation, lawsuit says",
    "Daniel Knighton / Getty Images file",
    "LA Pride drops out of Dodgers' Pride Night after the team disinvites drag troupe",
    "San Francisco to name first-in-nation drag laureate",
    "Jacobs Stock Photography Ltd / Getty Images",
    "Asian Americans are least likely of all racial groups to have an end-of-life plan, new study finds",
    "An ancient writing system from the Philippines makes an unlikely comeback",
    "What to shop this Memorial Day",
    "Best weekender bags for your next short getaways",
    "Casper; Lo & Sons; Pottery Barn",
    "The 6 best sales to shop right now",
    "30 best new products so far this May",
    "5 best luggage tags for travel",
    "Our essential guide to grooming your dog at home",
    "The best early Memorial Day sales to shop now",
    "7 best lightweight luggage options",
    "aldomurillo / Getty Images",
    "The best standing desks, according to ergonomic experts",
    "9 ways to treat sunburns at home",
    "Do Not Sell My Personal Information"
]