[
    "Samuel Corum / Getty Images fileSamuel Corum / Getty Images",
    "Live Updates: Debt ceiling",
    "Treasury says June 5 is new default deadline, buying more time for negotiations",
    "New default date comes as sides stuck on work requirements and future federal spending",
    "What will happen if the U.S. hits the debt ceiling?",
    "Steven Hirsch / AFP - Getty Images file",
    "Prosecutors say they have a recording of Trump and a witness in Manhattan DA case",
    "Trump's N.Y. criminal trial will begin in March 2024, halfway through presidential primaries",
    "AP fileAlex Brandon / AP file",
    "Republicans brace for 2022 losers to take another crack at winning",
    "Gusher of cash reshapes GOP presidential contest",
    "Doug Mastriano will not run for Senate in Pennsylvania in 2024",
    "A tree felled in a storm leaves a nation mourning a 'great loss'",
    "A historic tree symbolizing Sierra Leone’s freedom falls during rainstorm",
    "How an outrageous drag queen found mainstream fame in 'The Little Mermaid'",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Halle Bailey addresses racist trolls criticizing her role as Ariel in 'The Little Mermaid'",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Courtesy NeJame Law Office",
    "Florida deputy charged after stun gun turned man covered with fuel into 'human fireball'",
    "Michael M. Santiago / Getty Images",
    "U.S. Virgin Islands Dept. of Justice",
    "Winner of historic $2B Powerball sued by man who claims ticket was stolen from him",
    "12-year-old graduates college in California, setting school record",
    "Ex-ice cream truck driver who killed 2 brothers in mistaken identity case sentenced to life",
    "U.S. District Court for Washington, D.C.",
    "Self-proclaimed 'idiot' Oath Keeper sentenced to more than 8 years in Jan. 6 case",
    "Patrick Semansky / AP file",
    "Trump dominates 2024 endorsement race while DeSantis generates little movement",
    "Ron DeSantis says he would consider presidential pardons for Jan. 6 rioters",
    "U.S. accuses Russia's Wagner Group mercenaries of fueling war in Sudan",
    "Sergey Bobok / AFP - Getty Images",
    "Who are the anti-Putin groups behind the dramatic raid into Russia?",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Passenger opens plane door during flight in South Korea",
    "New British Cycling rules bar transgender women from competing in elite female events",
    "Kevin Mazur / BBMA2017/Getty Images for dcp file",
    "Celine Dion pulls plug on European tour citing ongoing health issues",
    "Tom Hanks delivers commencement speech at Harvard: ‘The truth is sacred’",
    "Bettmann Archive / Getty Images",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "On TikTok, there's always a new 'girl' aesthetic",
    "Study links young adults' marijuana use and mental health illness",
    "Passenger detained after allegedly opening plane’s emergency door while in-flight",
    "Custodian teaching students how to sweep their chess competition",
    "Record surge of post-pandemic travelers in airports this Memorial Day weekend",
    "New investigation into Navy SEAL training finds dangerous conditions",
    "Hannah Rappleye / NBC News",
    "Months after residents sound the alarm, Pennsylvania 'cracks' down on Shell plant",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "James Borchuck / Tampa Bay Times via AP file",
    "Cancer drug shortage across U.S. has become ‘life-threatening’",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Justin Sullivan / Getty Images",
    "Ford EVs will use Tesla charging tech in surprise partnership between rival automakers",
    "Justin Sullivan / Getty Images file",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "Daisy Jasmin Estrada Borja",
    "A Latina who's not allowed to wear Mexican American sash at graduation takes legal action",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Courtesy Connecticut House Democrats",
    "Connecticut lawmakers who tried to ban 'Latinx' now promote 'Latine'",
    "Fans around the world gather to remember Tina Turner's influence",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "South Dakota governor calls on college board to ban drag shows and eliminate 'preferred pronouns'",
    "Charlie Neibergall / AP file",
    "Iowa Gov. Reynolds signs bill restricting instruction on sexual orientation and gender identity",
    "George Wood / Getty Images file",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "14 best sunscreens for sensitive skin",
    "The best Amazon Memorial Day deals to shop now",
    "The best Memorial Day sales to shop now",
    "The best mattresses to keep you cool",
    "Memorial Day mattress and bedding sales to shop",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "Do Not Sell My Personal Information"
]