[
    "All 5 aboard Titanic sub presumed dead after evidence of 'catastrophic implosion'",
    "AP; U.S. Coast Guard; Getty Images",
    "Just now9m agoFamily of father and son killed in submersible ask for prayers",
    "Just now3h agoOcean depth will make recovering bodies from Titanic submersible difficult",
    "19-year-old Titan passenger was 'terrified' before trip, his aunt says",
    "Former Titan passengers share eerie accounts of safety issues",
    "Modi tells Congress that U.S.-India ties represent 'defining partnership of this century'",
    "Biden admin hopes Modi visit will move India ‘in right direction’ with Russia",
    "Michael M. Santiago / Getty Images file",
    "GOP-led House ethics panel has issued over 30 subpoenas in its probe of Rep. George Santos",
    "Rep. George Santos' $500K bond was guaranteed by his father and aunt",
    "Trump campaign's Election Day operations official appears before Jan. 6 grand jury",
    "Demetrius Freeman / The Washington Post via Getty Images file",
    "IRS agent tells House committee there was meddling with Hunter Biden case",
    "Win McNamee / Getty Images file",
    "Marjorie Taylor Greene calls Lauren Boebert 'a little b----' on the House floor",
    "Stefani Reynolds / AFP - Getty Images",
    "House postpones Biden impeachment vote, sending matter to committees",
    "Moms for Liberty chapter apologizes for quoting Hitler in newsletter",
    "Biden says he sees 'no real consequence' to calling Xi a 'dictator'",
    "Criminal charges filed over fake signatures that spoiled Michigan GOP gubernatorial bids",
    "Villa Rica Police Dept. via WXIA",
    "Georgia police department under investigation for using photo of a Black man for target practice",
    "Augustas Cetkauskas / Getty Images / iStockphoto",
    "College bowling sex scandal at Stephen F. Austin University leads to ouster of assistant coach",
    "Elizabeth Flores / Star Tribune via Getty Images",
    "Minnesota man charged with vehicular homicide in crash that killed 5 young Muslim women",
    "Suspect in mass shooting at Washington music festival told police he was high on psychedelics",
    "Giant African land snail spotted in Florida, forcing quarantine in parts of county",
    "San Francisco displays the largest ever pink triangle for Pride Month in a stand against pushback",
    "Cleveland mom charged with murder after baby is left home alone for 10 days and dies",
    "Kimberly White / Getty Images for TechCrunch file",
    "'It's horrifying': Discord CEO on child abuse issues after NBC News investigation",
    "Al Drago / Bloomberg via Getty Images",
    "TikTok COO Vanessa Pappas steps down",
    "Johnny Milano / Bloomberg via Getty Images file",
    "Overstock.com wins auction for Bed Bath & Beyond’s intellectual property, digital assets",
    "In hidden Discord communities, adults are abusing and extorting children",
    "'A moment of revolution': Schumer unveils strategy to regulate AI amid dire warnings",
    "Alessandro Serrano / AGF/Universal Images Group via Getty Images file",
    "Vatican sends Bolivia diary of late priest who allegedly confessed to abusing minors",
    "Jo Yong-Hak  / Reuters / Redux",
    "Choi Sung-bong, 'Korea's Got Talent' singer and cancer scam celebrity, dies at 33",
    "Gaby Oraa / Bloomberg via Getty Images",
    "House Democrats push Biden admin on 'next steps' to help Venezuelans",
    "WSJ journalist Evan Gershkovich must stay in jail until late August, Moscow court rules",
    "'Taylor Swift law' introduced to criminalize ticket scalping in Brazil",
    "Kesha and Dr. Luke settle defamation lawsuit over sexual assault allegations",
    "Search for Titanic submersible unleashes ‘eat the rich’ sentiment online",
    "Timothy A. Clary / AFP - Getty Images",
    "He's 7-foot-4. Expectations are high for leading NBA prospect Victor Wembanyama",
    "Corey Nickols / Getty Images for IMDb",
    "Diego Luna could make Emmy history for 'Star Wars'",
    "Clark Haggans, longtime NFL linebacker who won a Super Bowl with the Steelers, dies at 46",
    "77th NBA Draft kicks off at Barclays Center tonight",
    "Actor Luke Macfarlane is officially a daddy: 'Bros' star announces birth of baby girl",
    "Graphics show how abortion access has changed in America",
    "Poll: 61% of voters disapprove of Supreme Court decision overturning Roe",
    "Senate Democrats plan abortion-rights push to mark one year without Roe v. Wade",
    "Harris to deliver speech in North Carolina on anniversary of Roe v. Wade reversal",
    "Twins set to make history during NBA Draft",
    "Summer of bugs: Snails, crickets, lantern flies invade towns in US",
    "FTC alleges Amazon tricked users into signing up for Prime",
    "Search for missing sub focuses on underwater banging sounds",
    "Mark Abramson for NBC News",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Leila Register / NBC News; Getty Images",
    "Doctors say HCA hospitals push patients into hospice care to improve mortality stats",
    "Chelsea Stahl / NBC News; Getty Images",
    "How ex-Confederates spread racist attitudes far and wide after the Civil War",
    "Ibrahim Rayintakath for NBC News",
    "Jessica Fox / Canadian Forces",
    "U.S. District Court for the District of Columbia",
    "Anna Moneymaker / Getty Images",
    "Republicans decide to forgo Biden impeachment vote after internal fighting",
    "OB-GYN shortage worsening in U.S. one year after Roe v. Wade reversal",
    "Judge strikes down Florida's ban on Medicaid funding for transgender treatment",
    "Harvard human remains case highlights need for body donation regulations, experts say",
    "CDC panel recommends RSV vaccines for adults ages 65 and up",
    "Three of Mount Rainier's glaciers have melted away",
    "Darrell Schoppe / Cover Images via AP",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Rescue operation faces extreme environment in search for missing sub",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "Exhibition honors Caribbean children left behind by post-World War II migrants",
    "Congress and Postal Service unveil stamp honoring John Lewis",
    "Rocco Spaziani / Mondadori Portfolio via Getty Images file",
    "Shannon Broderick / Laramie Daily Boomerang via AP file",
    "Sorority says rules allow transgender woman at Wyoming chapter",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "When is Amazon Prime Day 2023? What to know",
    "The best way to clean your grill",
    "What is Walmart Plus Week?",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Do Not Sell My Personal Information"
]