[
    "Ukraine launches counteroffensive against Russia",
    "Satellite images show the scale of the Ukraine dam destruction",
    "Biden and Sunak to focus on Ukraine and economic security in British PM’s first White House visit",
    "Joshua Lott / AFP via Getty Images file",
    "Supreme Court backs landmark voting rights law, strikes down Alabama congressional map",
    "Tracking major Supreme Court cases",
    "Supreme Court rules for Jack Daniel’s in ‘poop-themed’ dog toy trademark fight",
    "Andrew Cabellero-Reynolds / AFP via Getty Images",
    "Wildfire smoke snarls U.S. air travel with flight delays",
    "Live Updates / Broadway shows, zoos and aquariums close over poor air quality",
    "Another day of orange haze in store as NYC endures world's worst air quality",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Florida grand jury investigates Trump classified document handling",
    "Trump ally Bannon subpoenaed in special counsel Jack Smith's Jan. 6 grand jury probe",
    "Secret Service agents have testified in Trump classified documents probe",
    "Wally McNamee / Corbis via Getty Images file",
    "Pat Robertson, conservative evangelist and Christian Coalition founder, dies at 93",
    "Robertson was one of the most prominent and influential Christian broadcasters in the U.S.",
    "David Paul Morris / Bloomberg via Getty Images file",
    "States have introduced nearly 200 bills this year to 'subvert' elections, report finds",
    "Patrick T. Fallon / AFP - Getty Images file",
    "Gov. Gavin Newsom calls for constitutional amendment to curb gun access",
    "Sarah Silbiger / Bloomberg via Getty Images file",
    "Conservatives bring the House to a halt as anger at McCarthy's debt deal remains",
    "Senators to introduce a bipartisan AI bill aimed at keeping up with China",
    "How Ron DeSantis found a home in Florida’s swamp",
    "DC Police Dept.; NBC Washington",
    "Death of N.C. man shocked three times with a Taser is classified as a homicide",
    "Sebastian Silva / AFP via Getty Images",
    "Joran van der Sloot, chief suspect in Natalee Holloway disappearance, transferred to U.S. custody",
    "Body found amid search for missing Minnesota mother and arrest made",
    "Jewel Samad / AFP via Getty Images file",
    "Five killed in criminal shooting in Israeli city of Nazareth",
    "Olivier Chassignole / AFP - Getty Images",
    "4 children stabbed in knife attack in France",
    "World’s most endangered porpoise hangs on, avoiding extinction in Mexico’s Gulf of California",
    "Pope in ‘good general condition’ after surgery to remove intestinal scar tissue, repair hernia",
    "Robyn Beck / AFP - Getty Images",
    "Tupac Shakur’s sister tears up as late rapper gets star on Hollywood Walk of Fame",
    "John Salangsang / Invision for American Humane/AP file",
    "Shannen Doherty reveals breast cancer has spread to her brain in emotional post",
    "'Never Have I Ever' star Maitreyi Ramakrishnan on the signs Devi finally grew up in final season",
    "YouTube channel Wong Fu Productions reflects on 20 years of Asian American storytelling",
    "Grandmother knows best: Cuban American women tout their abuelas' cooking and life lessons",
    "Justin Sullivan / Getty Images file",
    "Black workers at California Tesla factory allege rampant racism, seek class-action status",
    "Fox News tells Tucker Carlson he violated his contract with new Twitter show",
    "Dimitrios Kambouris / Getty Images file Kevin Mazur / Getty Images",
    "Chris Licht out at CNN after tumultuous run as CEO",
    "Here's why the PGA Tour just merged with LIV Golf",
    "Apple to stop autocorrecting swear word to 'ducking' on iPhone",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Supreme Court strikes down Alabama congressional map in voting rights case",
    "FAA pauses some flights over reduced visibility from wildfire smoke",
    "Millions in US wake up to smoky haze for third day in a row",
    "Spencer Platt / Getty Images",
    "What to know about the health risks of wildfire smoke",
    "Timothy A. Clary / AFP - Getty Images",
    "Asians in the U.S. say air quality ‘feels dangerously like home’",
    "Muhammed Enes Yildirim / Anadolu Agency via Getty Images",
    "What could the Ukraine dam disaster mean for Russia's war?",
    "Marion County Sheriff's Office",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Is it safe to exercise outdoors when the air quality is poor?",
    "More kids and teens are getting anxiety medication without therapy, report finds",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Rebecca Blackwell / AP file",
    "Here comes El Nino: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Two California lakes are making comebacks with different results",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "John Moore / Getty Images file",
    "Child labor investigation spreads to meatpacking, produce companies in 11 states",
    "Ulises Ruiz / AFP via Getty Images file",
    "8 young workers at drug cartel call center killed; bodies placed in bags",
    "Joe Maher / Getty Images file",
    "An unsubstantiated claim that Jamie Foxx was hospitalized after a Covid vaccination is going viral",
    "James MacDonald / Bloomberg via Getty Images",
    "Black residents of Detroit brace themselves for rougher air quality conditions",
    "Allen J. Schaben / Los Angeles Times via Getty Images",
    "Three arrested at protests outside an L.A. school board meeting about Pride Month",
    "Missouri governor signs bill banning transgender care for minors, some adults",
    "Congressman honors drag icon RuPaul on the House floor",
    "Pride flag burned outside a City Hall in Arizona",
    "Dickson Lee / South China Morning Post via Getty Images file",
    "‘The Idol’ viewers agree: Blackpink’s Jennie is the highlight of a messy show",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "The best pimple patches for breakouts",
    "Where to find a KN95 mask right now",
    "TheraGun; Ooni; Vivian Le / NBC News",
    "22 best Father's Day gifts of 2023",
    "Songsak rohprasit / Getty Images",
    "Where to find NIOSH-approved N95 masks right now",
    "Kara Birnbaum/ NBC News; Vivian Le/ NBC News",
    "12 best pair hair removers of 2023",
    "9 new products launching in June",
    "May reader favorites: Sunscreens, deodorants and more",
    "Do Not Sell My Personal Information"
]