[
    "Supreme Court strikes down college affirmative action programs",
    "Kevin Dietsch / Getty Images",
    "Lawmakers react to Supreme Court affirmative action ruling",
    "Biden says it would be a 'mistake' to try to expand the Supreme Court",
    "Sotomayor and Jackson slam idea that U.S. is 'colorblind'",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "4 things students need to know now",
    "Chelsea Stahl / NBC News; Getty Images",
    "Medical schools will be even less diverse after affirmative action ruling, experts say",
    "Drew Angerer / Getty Images",
    "Some Asian Americans say affirmative action ruling used group as ‘pawns’",
    "Democrats say document from Trump impeachment probe rebuts GOP claims about a Biden bribery scheme",
    "House Republicans demand testimony from DOJ and IRS officials on Hunter Biden probe",
    "Corey Nickols / Getty Images for IMDb",
    "Transgender influencer Dylan Mulvaney says Bud Light never reached out to her after backlash",
    "Anheuser-Busch CEO says his company will continue to support the LGBTQ community",
    "Amy Beth Bennett / South Florida Sun-Sentinel via AP, Pool",
    "Ex-Parkland school security officer found not guilty over failure to confront 2018 gunman",
    "Lezlie Sterling / Zuma Press",
    "California reparations final report details who's eligible, but no dollar figure set",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Iowa woman wins lottery more than 20 years after tornado wiped out her home",
    "Nicaraguan migrant who died in ICE custody had been recommended for release, advocates say",
    "Tiffany's flagship store in Manhattan was ablaze following electrical fire, authorities say",
    "NFL suspends 3 players indefinitely, fourth gets 6 games for violating gambling policy",
    "Federal judge rejects Trump bid to dismiss E. Jean Carroll defamation claims",
    "Kent Nishimura / Los Angeles Times via Getty Images file",
    "Jan. 6 participant, identified nearly two years ago, is arrested near Obama home",
    "Biden says he has never discussed specific cases with AG Merrick Garland",
    "Supreme Court rules for Christian mail carrier who refused to work Sundays",
    "Kamala Harris slams lawmaking 'extremists' at LGBTQ Pride event",
    "Christie goes after DeSantis for dodging Jan. 6 question: 'Was he alive that day?'",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Samir Hussein / WireImage via Getty Images file",
    "Travis Scott won't be criminally charged in  Astroworld concert deaths, officials say",
    "Catherine Powell / Getty Images for CMT file",
    "Country music star Kelsea Ballerini hit in the face during a concert",
    "Pepsi introduces Colachup, a ketchup infused with cola",
    "'Boy Meets World' stars say Ben Savage 'disappeared' from their lives: 'He ghosted us'",
    "Colleen Ballinger responds to allegations with a song",
    "Pavel Bednyakov / Sputnik via AP file",
    "Putin's stooge or savior: What role did Belarus leader play in ending Russian rebellion?",
    "Tobias Schwarz / AFP via Getty Images file",
    "Google says it will remove Canadian news links from searches in the country",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "David Gladstone / NBC News",
    "Mike Pence meets with Zelenskyy in surprise trip to Ukraine",
    "Russian general is believed to be detained in aftermath of Wagner mutiny",
    "French police officer faces voluntary homicide charge after teenager's shooting",
    "As China crests second Covid wave, families still mourn victims of the first one",
    "Science Photo Library - CDC / Getty Images",
    "CDC recommends RSV shots for older adults, clearing the way for vaccinations to begin this fall",
    "chris-mueller / Getty Images/iStockphoto",
    "Pedestrian deaths hit a 41-year high. Reckless driving and bigger cars may be to blame.",
    "Angela Weiss / AFP - Getty Images",
    "Tranq increasingly found in opioid overdose deaths, CDC warns",
    "Tick and mosquito season is already shaping up to be severe this year",
    "Kelsey Brunner for NBC News",
    "Follow the latest news and conversations at the Aspen Ideas Festival",
    "Just now12m agoUp next: Andrew Yang",
    "Just now14m agoWill Uber use self-driving cars?",
    "Just now18m agoUber is providing data to cities about where to bolster charging infrastructure",
    "Just now23m agoIncentivizing restaurants to use sustainable packaging",
    "How to have sensitive conversations about race at Aspen Ideas Festival",
    "Follow full coverage of the Aspen Ideas Festival",
    "The best products to buy during Prime Day",
    "Everything you need for a picnic",
    "WindmillFrigidaire; Windmill",
    "6 top-rated air conditioners for 2023",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "Baker offers sourdough scavenger hunt to his local community",
    "Madonna hospitalized with bacterial infection, postpones tour",
    "Simone Biles to return to competition for the first time since Tokyo",
    "Inside daring effort to rescue Ukrainian children",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Frazer Harrison / Getty Images file",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "Brandon Bell / Getty Images",
    "Ron DeSantis vetoes popular criminal justice bill as he moves to Trump's right",
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Al Drago / Bloomberg via Getty Images file",
    "Courtesy Patrick Tomlinson",
    "The FBI has formed a national database to track and prevent 'swatting'",
    "Robyn Beck / AFP via Getty Images file",
    "These retailers will take over Bed Bath & Beyond's 'top-notch' store leases",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "A disjointed jet stream has some climate scientists spooked",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "Jonathan Drake / Reuters / Redux",
    "What’s in the California Reparations Task Force's final report",
    "Christine King Farris, the last living sibling of Martin Luther King Jr., dies at 95",
    "Tasos Katopodis / Getty Images for GLAAD",
    "Timothy D. Easley / AP file",
    "Judges in Kentucky and Tennessee block portions of transgender youth care bans",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Do Not Sell My Personal Information"
]