[
    "Diego Herrera Carcedo / Anadolu Agency via Getty Images",
    "Ukraine drives back Russian forces around Bakhmut in its first significant gains in months",
    "Russian mercenary chief 'promised ammunition' after threatening Bakhmut retreat",
    "Putin's Victory Day features security fears and infighting rather than military might",
    "Ahead of Title 42 end, migrants in El Paso are urged to turn themselves in",
    "Live Updates / Bus of migrants arrives at VP Harris' residence",
    "House to vote on Republican border security bill hours before Covid restrictions lift",
    "@breakingchesky via Instagram",
    "NBC News' Morgan Chesky describes 'frightening' health scare during hike",
    "WATCH: NBC's Morgan Chesky talks high altitude pulmonary edema scare",
    "Pure Trump re-injected into the main vein of American politics at CNN town hall",
    "Trump dismisses his sex abuse verdict and gloats that it will help his 2024 bid",
    "Trump says he would pardon a 'large portion' of Jan. 6 rioters",
    "Christina Chung for NBC News",
    "Dwindling immigration puts squeeze on home building",
    "Absentee owners are crowding the housing market, data shows",
    "Mortgage fees on home loans backed by Fannie Mae and Freddie Mac are going up",
    "Ernesto Benavides / AFP via Getty Images file",
    "Natalee Holloway case suspect to be extradited to U.S. in alleged fraud targeting her mother",
    "Jessica Rinaldi / Boston Globe via Getty Images file",
    "Parents in college admissions scandal have fraud convictions overturned, appeals court rules",
    "Amy Beth Bennett / Pool / /South Florida Sun Sentinel via AP file",
    "Judge who presided over Parkland school shooting trial announces resignation",
    "Closing arguments set to start in triple murder trial of Idaho mom Lori Vallow",
    "Utah mom accused of killing husband with fentanyl tried to poison him before, family says",
    "Adam Glanzman / Bloomberg via Getty Images file",
    "Peloton recalls 2.2 million exercise bikes due to safety hazard",
    "Douglas Sacha / Getty Images",
    "Blinded by the light: Cars in the U.S. still lack glare-reducing headlight technology",
    "Axel Heimken / AFP via Getty Images file",
    "How Europe is leading the world in building guardrails around AI",
    "Former DHS disinformation expert sues Fox News for defamation",
    "Google is giving its dominant search engine an artificial intelligence makeover",
    "Daniel Acker / Bloomberg via Getty Images file",
    "Supreme Court rejects challenge to California pork industry restriction",
    "Luke Sharrett / Bloomberg via Getty Images file",
    "Small businesses brace for 'catastrophic' scenario from looming debt ceiling crisis",
    "Alabama senator on white nationalists in the military: 'I call them Americans'",
    "Rep. George Santos pleads not guilty to a 13-count federal indictment",
    "House Republicans escalate attacks on Biden family, alleging business with foreign nationals",
    "Erdogan’s rival boosted by withdrawal ahead of Turkey presidential vote",
    "Pakistan arrests hundreds of Imran Kahn supporters after wave of violence over ex-PM's detention",
    "Jussi Nukari / AFP - Getty Images",
    "Around 24 injured in Finland bridge collapse, many of them children",
    "Israel kills another militant commander in Gaza as fighting goes on and truce efforts falter",
    "Debt ceiling standoff could derail Biden's G-7 trip where Russia and China are on the agenda",
    "Jacklyn Zeman, longtime 'General Hospital' actor, dies at 70",
    "'Sesame Street' debuts its first Filipino American muppet",
    "Arturo Holmes / FilmMagic file",
    "Elliot Page recalls past feelings of dysphoria and 'joy' he now feels in his body",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "New details on Utah author charged with fatally poisoning husband",
    "Blinding headlights are growing problem on US roads",
    "FDA votes unanimously for over-the-counter sale of birth control pill",
    "Peanut allergy skin patch shows promise for toddlers",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "The local toll of election denialism: Virginia county loses second registrar in 2 months",
    "Greg Lovett / The Palm Beach Post / USA Today Network",
    "In South Florida, ‘black snow’ makes breathing difficult for some Black and Latino residents",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Why it took doctors months to diagnose a woman's eye infection caused by contaminated eyedrops",
    "New peanut allergy treatment could save toddlers’ lives, researchers say",
    "A simple, low-cost treatment could save 22,000 new mothers' lives every year, scientists suggest",
    "A 'peanut patch' desensitized toddlers with peanut allergies in a promising late-stage trial",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "Stringer via Reuters/Redux",
    "Live Updates: Title 42 immigration policy expires tonight, border officials prepare",
    "Patrick T. Fallon / AFP via Getty Images",
    "Title 42 immigration policy set to expire tomorrow",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Ed Reed / Office of Mayor Eric Adams",
    "NYC mayor calls fatal subway chokehold on Jordan Neely a ‘tragedy that never should have happened’",
    "California Dept. of Justice",
    "Argument at California reparations hearing shows toll of talking about racism, members say",
    "Charlie Neibergall / AP file",
    "West Virginia’s Bob Huggins agrees to $1M pay cut, 3-game suspension for homophobic slur",
    "@dylanmulvaney via Instagram",
    "Chicago gay bars boycott Anheuser-Busch for distancing itself from Dylan Mulvaney",
    "Justin Sullivan / Getty Images",
    "Transgender youths sue over Montana gender-affirming care ban",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "Mother's Day gifts for every kind of mom",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Do Not Sell My Personal Information"
]