[
    "Mandel Ngan / AFP - Getty Images fileMandel Ngan / AFP - Getty Images",
    "George Santos faces fraud, money laundering and theft of public funds charges",
    "Live Updates / Rep. Santos accused of receiving unemployment benefits while drawing $120K salary",
    "A timeline of Rep. George Santos' fabrications and controversy",
    "Biden admin to allow for the release of some migrants into the U.S. with no way to track them",
    "Ron DeSantis signs immigration crackdown as Biden prepares to end Title 42",
    "Here are new Biden immigration policies to expect as Title 42 ends",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "Extreme weather meets reality of poverty to create a tragedy in Mississippi",
    "'He did it and you know it': E. Jean Carroll says she confronted Trump's lawyer after verdict",
    "WATCH: 'This is about getting my name back,' Carroll says on 'TODAY'",
    "Senate Republicans suggest Carroll verdict could imperil Trump's 2024 chances",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Here's where extreme heat could be devastating in coming years",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Orleans Parish District Attorney",
    "Man freed after 29 years in prison for a rape the victim insisted he didn't commit",
    "@dylanmulvaney via Instagram",
    "Chicago gay bars boycott Anheuser-Busch for distancing itself from Dylan Mulvaney",
    "Argument at California reparations hearing shows toll of talking about racism, members say",
    "Passenger charged with hiding camera in cruise ship restroom",
    "House Republicans escalate attacks on Biden family, alleging business with foreign nationals",
    "Stephen Brashear / AP file",
    "House lawmakers to host bipartisan dinner with OpenAI CEO Sam Altman",
    "The local toll of election denialism: Virginia county loses second registrar in 2 months",
    "Mike Pence navigates anger from all sides as he inches toward a presidential run",
    "Biden to host India Prime Minister Modi in June",
    "Comment on transgender issue roils Kentucky governor's race",
    "Early campaign strategy at play as Biden hits road for first time since launching re-election bid",
    "Carolyn Van Houten / The Washington Post via Getty Images file",
    "Consumer price growth falls to below 5% for the first time in two years",
    "Natalie Behring / Getty Images file",
    "HSBC downgrades Anheuser-Busch InBev as it deals with a 'Bud Light crisis'",
    "Jason Merritt / FilmMagic file",
    "Paramount brands to lay off 25% of U.S. staff as MTV News shuts down",
    "Tucker Carlson says he'll launch new show on Twitter",
    "Hackers to test limits of AI technology at Las Vegas event",
    "Simon Maina / AFP - Getty Images file",
    "Aris Messinis / AFP via AP",
    "Arman Soldin, journalist working for AFP news agency, killed in Ukraine",
    "@VictoriaPolice via Twitter",
    "Woman survived on wine and lollipops in the Australian wilderness for 5 days",
    "Palestinian militants launch rocket attacks after Israeli strikes on Gaza",
    "Student's body found in cave after New Zealand hit by floods",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Widow who wrote book on grief charged with husband’s murder",
    "A look at NASA’s new mission to explore the Earth’s oceans",
    "Mammogram age recommendation lowered from 50 to 40",
    "Beyoncé fans in US buy tickets in Europe amid soaring demand",
    "Michael Ciaglo for NBC News",
    "Fred Dugfour / AFP Pool via Getty Images file",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Rep. George Santos faces federal charges, sources say",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "Justin Sullivan / Getty Images file",
    "U.K. man pleads guilty to hack on Twitter accounts of Joe Biden and Elon Musk",
    "Morgan Wallen postpones shows for six weeks due to vocal cord injury",
    "Tory Lanez denied new trial in Megan Thee Stallion shooting",
    "Miguel Roberts / The Brownsville Herald via AP file",
    "Screen women for breast cancer at 40, instead of 50, new guidelines say",
    "Andrew Matthews / PA via AP file",
    "Babies that have DNA from three different people born for first time in the U.K.",
    "Hate mosquitoes? Coconut scents could help keep them away, small study suggests",
    "Nurses at HCA hospitals would have owed thousands if they left before 2 years: investigation",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "Herika Martinez  / AFP - Getty Images",
    "Everything you need to know about Title 42 ahead of its end date",
    "Jeremy Wallace / The Aspen Times via AP file",
    "Colorado expands translation access for parents of special ed students",
    "Focus On Sport / Getty Images",
    "First Latino quarterback to lead team to the Super Bowl dies at 85",
    "California Dept. of Justice",
    "Justin Sullivan / Getty Images",
    "Transgender youth sue over Montana gender-affirming care ban",
    "Timothy D. Easley / AP file",
    "Araya Doheny / Getty Images",
    "Marcia Gay Harden says her kids, who 'are all queer,' inspire her LGBTQ advocacy",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Angela Weiss / AFP via Getty Images file",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "21 mom-approved Mother's Day gifts",
    "Mother's Day gifts for every kind of mom",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Do Not Sell My Personal Information"
]