[
    "Alex Wong / Getty Images file",
    "FBI agent who testified for Republicans was suspended over leaked sensitive information",
    "GOP witnesses undermined Jan. 6 cases with conspiracy theories, FBI says",
    "Joshua Lott / AFP via Getty Images file",
    "Supreme Court backs landmark voting rights law, strikes down Alabama congressional map",
    "Tracking major Supreme Court cases",
    "Supreme Court rules for Jack Daniel’s in ‘poop-themed’ dog toy trademark fight",
    "Jason Davis / Getty Images file",
    "Elon Musk’s response to an anti-trans video sparked 24 hours of chaos at Twitter",
    "AP, Getty Images, AFPDavid Dee Delgado / Getty Images",
    "N.Y. sends firefighters to Canadian wildfires as U.S. records worst smoke day in 20 years",
    "10 hours in the smoke: NYC delivery workers say they had 'no choice' but to work",
    "Wrinkles and trouble sleeping are among the strange symptoms poor air quality can cause",
    "Earl S. Cryer / AFP via Getty Images file",
    "Nutrient found in high-protein foods helps slow aging in animals — and maybe humans, too",
    "Marion County Sheriff's Office",
    "Gun used in Florida neighbor's killing was bought last year after previous dispute, affidavit says",
    "DC Police Dept.; NBC Washington",
    "Sebastian Silva / AFP via Getty Images",
    "Joran van der Sloot, chief suspect in Natalee Holloway disappearance, transferred to U.S. custody",
    "Wally McNamee / Corbis via Getty Images file",
    "Pat Robertson, conservative evangelist and Christian Coalition founder, dies at 93",
    "19-year-old Ph.D. started community college when he was 7",
    "Father accused of killing daughter Harmony Montgomery convicted on gun charges",
    "Human remains identified as Minnesota mother missing since March, police say",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "GOP senators remain tight-lipped on potential Trump indictment",
    "Drew Angerer / Getty Images file",
    "Biden classified documents investigation shows few signs of wrapping up soon",
    "Mandel Ngan / AFP - Getty Images file",
    "House Republicans attack Biden and his family after viewing FBI document",
    "Donald Trump asks for new trial in E. Jean Carroll case",
    "Gov. Gavin Newsom calls for constitutional amendment to curb gun access",
    "States have introduced nearly 200 bills this year to 'subvert' elections, report finds",
    "Robocalls to voters before 2020 election result in $5 million fine",
    "Aleksey Filippov / AFP - Getty Images",
    "Russia shells civilians fleeing dam collapse in southern Ukraine",
    "Ukraine launches counteroffensive against Russia",
    "Maxar Technologies; Planet Labs",
    "Satellite images show the scale of the Ukraine dam destruction",
    "Jewel Samad / AFP via Getty Images file",
    "Five killed in criminal shooting in Israeli city of Nazareth",
    "4 children stabbed in knife attack in France",
    "Australian man sentenced to 9 years in prison for 1988 manslaughter of gay American",
    "Stephanie Mei-Ling / Apple",
    "Tom Holland is taking a break from acting after making ‘The Crowded Room’",
    "Chandan Khanna  / AFP via Getty Images file",
    "Jake Paul is making a feature-length boxing drama",
    "Robyn Beck / AFP - Getty Images",
    "Tupac Shakur’s sister tears up as late rapper gets star on Hollywood Walk of Fame",
    "Shannen Doherty reveals breast cancer has spread to her brain in emotional post",
    "'Never Have I Ever' star Maitreyi Ramakrishnan on the signs Devi finally grew up in final season",
    "FDA panel recommends injectable drug to prevent RSV in infants",
    "Christopher Katsarov / The Canadian Press via AP file",
    "Experimental drug for marijuana addiction shows promise, small study finds",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Is it safe to exercise outdoors when the air quality is poor?",
    "What to know about the health risks of wildfire smoke",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Supreme Court strikes down Alabama congressional map in voting rights case",
    "FAA pauses some flights over reduced visibility from wildfire smoke",
    "Millions in US wake up to smoky haze for third day in a row",
    "Spencer Platt / Getty Images",
    "Timothy A. Clary / AFP - Getty Images",
    "Asians in the U.S. say air quality ‘feels dangerously like home’",
    "Muhammed Enes Yildirim / Anadolu Agency via Getty Images",
    "What could the Ukraine dam disaster mean for Russia's war?",
    "Live updates: Florida grand jury investigates Trump's handling of classified documents",
    "Donald Iain Smith / Getty Images/Tetra images",
    "Minors may need parents’ permission to join social media under newly-passed Louisiana bill",
    "Justin Sullivan / Getty Images file",
    "Black workers at California Tesla factory allege rampant racism, seek class-action status",
    "An unsubstantiated claim that Jamie Foxx was hospitalized after a Covid vaccination is going viral",
    "Fox News tells Tucker Carlson he violated his contract with new Twitter show",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Rebecca Blackwell / AP file",
    "Here comes El Nino: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "Two California lakes are making comebacks with different results",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "New York City sues state counties over ‘xenophobic’ migrant bans",
    "Grandmother knows best: Cuban American women tout their abuelas' cooking and life lessons",
    "John Moore / Getty Images file",
    "Child labor investigation spreads to meatpacking, produce companies in 11 states",
    "2 Connecticut officers fired over treatment of man paralyzed in police van after 2022 arrest",
    "Joe Maher / Getty Images file",
    "Allen J. Schaben / Los Angeles Times via Getty Images",
    "Three arrested at protests outside an L.A. school board meeting about Pride Month",
    "Missouri governor signs bill banning transgender care for minors, some adults",
    "Congressman honors drag icon RuPaul on the House floor",
    "Alex Kent / Bloomberg via Getty Images",
    "Dickson Lee / South China Morning Post via Getty Images file",
    "YouTube channel Wong Fu Productions reflects on 20 years of Asian American storytelling",
    "Our predictions for Prime Day 2023",
    "18 best Father's Day gifts on Amazon",
    "What causes rosacea? Derms explain.",
    "11 best women's walking shoes in 2023",
    "The 9 best BBQ smokers for summer 2023",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "The best pimple patches for breakouts",
    "Where to find a KN95 mask right now",
    "Do Not Sell My Personal Information"
]