[
    "Mohammad Zaatari / AP file",
    "U.S. to provide cluster munitions to Ukraine",
    "Will it win the war or cause disaster? U.S. debates sending cluster bombs to Ukraine",
    "EXCLUSIVE: Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Andrew Cabalerro-Reynolds / AFP - Getty Images file",
    "Ron DeSantis bragged about sending help to Iowa — 10 hours after being told it wasn't needed",
    "Casey DeSantis' first solo public event homes in on kids and parents",
    "Ron DeSantis says he'll debate with or without Trump: 'I'll be there'",
    "Did 'Barbie' cross the line? How a 'child-like' map stirred a South China Sea dispute",
    "'Barbie' movie banned in Vietnam over map of disputed South China Sea",
    "Brett Coomer / Houston Chronicle via AP",
    "Houston man whose mother said he was missing no longer wants contact with her, aunt says",
    "Houston mom often cried about her 'missing' son who was home the whole time, neighbor says",
    "Serial killer docuseries 'Last Call' reckons with NYC's history of anti-gay violence",
    "NYC launches program to reexamine gay bar drugging and homicide cases",
    "John Tlumacki / Boston Globe via Getty Images",
    "U.S. payrolls climbed by 209,000 in June, less than expected",
    "Paul Chinn / San Francisco Chronicle via AP file",
    "Foot fondler on the loose in Lake Tahoe area, officials warn",
    "via the Consumer Product Safety Commission",
    "New York beach officials use drones to search for sharks amid a spate of attacks on swimmers",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Double-decker bus and city bus collide in Manhattan, sending 18 people to hospitals",
    "Bromberger Hoover Photography / Getty Images",
    "Jimmy and Rosalynn Carter mark 77th wedding anniversary at home in Plains, Georgia",
    "Republicans request Secret Service briefing on cocaine found at White House",
    "Amanda Andrade-Rhoades / AP file",
    "Freedom Caucus members voted to oust Rep. Marjorie Taylor Greene. It's unclear if it worked.",
    "Biden to deliver remarks on new actions to lower health care costs and limit 'junk fees'",
    "GOP senator presses colleges to comply with Supreme Court affirmative action ruling",
    "Russian jets again harass U.S. drones over Syria, says U.S. military",
    "Mark Schiefelbein  / Pool via AFP - Getty Images",
    "Yellen defends U.S. actions to protect national security in meeting with Chinese premier",
    "Australian official calls Donald Trump Jr. a 'big baby' over canceled tour",
    "Dutch museums will return art and artifacts that were looted from Sri Lanka and Indonesia",
    "Fire in Milan retirement home kills 6 people, injures around 80",
    "Think it's hard to get a Taylor Swift ticket in the U.S.? Try competing with Swifties in Asia",
    "Tommaso Boddi / Getty Images file",
    "Kevin Costner's estranged wife ordered to leave home by the end of the month in divorce battle",
    "Getty Images/AFP-Getty Images",
    "Britney Spears says she was 'backhanded' by NBA star Victor Wembanyama's security guard",
    "HBO cancels 'A Black Lady Sketch Show' after four seasons",
    "The show that inspired 'Ugly Betty' is getting a sequel with the original Colombian star",
    "Early Prime Day deals to shop right now",
    "9 best charcoal grills of 2023",
    "What to know before buying an Amazon Echo speaker",
    "The best women's razors for summer",
    "The best products to buy during Prime Day",
    "How to navigate crowded national parks this summer",
    "OceanGate suspends ‘all exploration’ after fatal implosion",
    "Twitter CEO Elon Musk threatens to sue new rival Threads",
    "Powerball nears $600 million ahead of weekend drawing",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Paul Hanna / Bloomberg via Getty Images",
    "Chaotic, blissful and confusing: What Threads users are saying about the new social media app",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "Ercin Erturk / Anadolu Agency via Getty Images",
    "Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Tourist who etched names on Colosseum says he didn't know it was ancient in apology letter",
    "Bing Guan / Bloomberg via Getty Images file",
    "Alaska Airlines flight diverted after passenger makes 'direct threat' to plane's safety",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "Twitter threatens to sue Meta over new app Threads",
    "Meta rebuts claim it hired former Twitter employees to make Threads",
    "BSIP / Universal Images Group via Getty",
    "FDA grants full approval to new Alzheimer's drug meant to slow disease",
    "Monica Schipper / Getty Images for Netflix",
    "Angelina Jolie says racial disparity in health care has 'endangered' her children of color",
    "WHO report on deadly virus among babies in 3 countries has U.S. doctors on edge",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "Johan Nilsson / TT News Agency via AP file",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Catholic priests report beatings, surveillance by Nicaragua government",
    "Deforestation in the Amazon has dropped 34%, reversing trend under Bolsonaro",
    "Guillermo Legaria   / AFP via Getty Images file",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "California and Texas officials ask DOJ to investigate Florida for sending migrants to other states",
    "Stephen McCarthy / Sportsfile via Getty Images file",
    "A diverse U.S. squad heads to women’s World Cup",
    "For two California reparations task force members, the hard work comes next",
    "Niall Carson / PA Wire via AP",
    "Pope taps priest who runs LGBTQ Catholic outreach to join major Vatican gathering",
    "Rich Fury / Getty Images file",
    "Ricky Martin and husband, Jwan Yosef, announce divorce",
    "1 in 5 United Methodist congregations in the U.S. have left over LGBTQ conflicts",
    "José Luis Villegas / AP file",
    "California’s caste bill moves forward — with one change",
    "Connecticut legislator attacked after Muslim service says police downplayed assault",
    "Do Not Sell My Personal Information"
]