[
    "Paul Hennessy / Anadolu Agency via Getty Images file",
    "Ron DeSantis bragged about sending help to Iowa — 10 hours after being told it wasn't needed",
    "Casey DeSantis' first solo public event homes in on kids and parents",
    "Ron DeSantis says he'll debate with or without Trump: 'I'll be there'",
    "Brett Coomer / Houston Chronicle via AP",
    "Houston man whose mother said he was missing no longer wants contact with her, aunt says",
    "Houston mom often cried about her 'missing' son who was home the whole time, neighbor says",
    "Getty Images/AFP-Getty Images",
    "Britney Spears says she was hit by security guard for NBA rookie",
    "Mark Schiefelbein / AFP - Getty Images",
    "Yellen defends U.S. actions to protect national security in meeting with Chinese premier",
    "Yellen says she's 'concerned' about China's new export controls on chipmaking metals",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Two California lakes are making comebacks with different results",
    "Republicans request Secret Service briefing on cocaine found at White House",
    "Amanda Andrade-Rhoades / AP file",
    "Freedom Caucus members voted to oust Rep. Marjorie Taylor Greene. It's unclear if it worked.",
    "Tom Williams / CQ-Roll Call via Getty Images file",
    "GOP senator presses colleges to comply with Supreme Court affirmative action ruling",
    "Judge denies Justice Department request to block Trump deposition in lawsuits by ex-FBI officials",
    "Lawmakers seek to loosen rules on marijuana use by military recruits and security personnel",
    "Paul Chinn / San Francisco Chronicle via AP file",
    "Foot fondler on the loose in Lake Tahoe area, officials warn",
    "New York beach officials use drones to search for sharks amid a spate of attacks on swimmers",
    "Gardiner Anderson / New York Daily News via Getty Images",
    "Double-decker bus and city bus collide in Manhattan, sending 18 people to hospitals",
    "Russian jets again harass U.S. drones over Syria, says U.S. military",
    "Australian official calls Donald Trump Jr. a 'big baby' over canceled tour",
    "Deforestation in the Amazon has dropped 34%, reversing trend under Bolsonaro",
    "Fire in Milan retirement home kills 6 people, injures around 80",
    "Dutch museums will return art and artifacts that were looted from Sri Lanka and Indonesia",
    "BSIP / Universal Images Group via Getty",
    "FDA grants full approval to new Alzheimer's drug meant to slow disease",
    "3 unanswered questions about the newly approved Alzheimer's drug Leqembi",
    "Irina Shatilova / Getty Images/iStockphoto",
    "A high BMI is not necessarily associated with a higher risk of death, study finds",
    "How hot is too hot for the human body to function optimally?",
    "WHO report on deadly virus among babies in 3 countries has U.S. doctors on edge",
    "Tommaso Boddi / Getty Images file",
    "Kevin Costner's estranged wife ordered to leave home by the end of the month in divorce battle",
    "Guillermo Legaria   / AFP via Getty Images file",
    "The show that inspired 'Ugly Betty' is getting a sequel with the original Colombian star",
    "'Dolores Roach' actor Justina Machado still loves empanadas — though not the horror-filled kind",
    "In one of the world's deadliest cities, a musician's idea pays off",
    "What to know before buying an Amazon Echo speaker",
    "The best women's razors for summer",
    "The best products to buy during Prime Day",
    "When is Amazon Prime Day 2023? What to know",
    "7 top-rated tower fans to stay cool this summer",
    "How to navigate crowded national parks this summer",
    "OceanGate suspends ‘all exploration’ after fatal implosion",
    "Twitter CEO Elon Musk threatens to sue new rival Threads",
    "Powerball nears $600 million ahead of weekend drawing",
    "Paul Hanna / Bloomberg via Getty Images",
    "Chaotic, blissful and confusing: What Threads users are saying about the new social media app",
    "These tenants fought one of America's largest corporate landlords — and scored some wins",
    "Barriers to transgender health care lead some to embrace a do-it-yourself approach",
    "Justine Goode; NBC News / Getty Images",
    "DeSantis is squeezing the sunshine out of Florida’s public records law, critics say",
    "Ercin Erturk / Anadolu Agency via Getty Images",
    "Former U.S. officials have held secret Ukraine talks with prominent Russians",
    "Drew Angerer / Getty Images file",
    "'Smallville' actor Allison Mack released from prison early after cult sex trafficking conviction",
    "Texas Center for the Missing",
    "Questions over Rudy Farias' disappearance and Instagram's Threads app debuts: Morning Rundown",
    "Jabin Botsford / The Washington Post via Getty Images",
    "More Mar-a-Lago search warrant information released in Trump classified docs case",
    "Jeanne Accorsini / Sipa via AP Images",
    "Meta rebuts claim it hired former Twitter employees to make Threads",
    "NBC News / AP; Bloomberg via Getty Images",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Eva Marie Uzcategui / Bloomberg via Getty Images file",
    "Need a new passport? State Department says apply at least 6 months before your departure",
    "Mortgage demand drops to lowest level in a month as interest rates rise",
    "Johan Nilsson / TT News Agency via AP file",
    "Greta Thunberg charged with disobeying police order at climate protest in Sweden",
    "Triple-digit heat continues to scorch parts of the U.S.",
    "Record nighttime heat in Texas poses a sneaky risk to people's health",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "California and Texas officials ask DOJ to investigate Florida for sending migrants to other states",
    "Joe Raedle / Getty Images file",
    "Judge blocks Florida provision that would limit Latino voter registration",
    "Monica Schipper / Getty Images for Netflix",
    "Angelina Jolie says racial disparity in health care has 'endangered' her children of color",
    "For two California reparations task force members, the hard work comes next",
    "Visual Ideas/Nora Pelaez / Getty Images/Tetra images RF",
    "Some Black Twitter users are hoping new Spill app will be a safe space",
    "Supreme Court backtracked on Black death row inmates’ racial bias claims, liberal justices say",
    "Rich Fury / Getty Images file",
    "Ricky Martin and husband, Jwan Yosef, announce divorce",
    "1 in 5 United Methodist congregations in the U.S. have left over LGBTQ conflicts",
    "Steven M. Falk / The Philadelphia Inquirer via AP file",
    "Philadelphia shooting suspect isn't trans, officials say, but speculation continues",
    "John Phillips / Getty Images",
    "‘Peaky Blinders’ and Cillian Murphy denounce homophobic video shared by DeSantis campaign",
    "Connecticut legislator attacked after Muslim service says police downplayed assault",
    "Visual China Group via Getty Images",
    "Singer Coco Lee dies by suicide at 48, her siblings say",
    "South Korea includes American teenager in Women’s World Cup squad",
    "Do Not Sell My Personal Information"
]