[
    "Patrick T. Fallon / AFP - Getty Images",
    "New arrivals in El Paso weigh agonizing choices as Title 42 expiration deadline looms",
    "Title 42 already ended for many crossing the border, official says",
    "Trump dismisses his sex abuse verdict and gloats that it will help his 2024 bid",
    "Trump says he would pardon a 'large portion' of Jan. 6 rioters",
    "Trump's sexual abuse verdict won't hurt his 2024 primary chances, friends and foes say",
    "Walker Mortuary; KPCW.org via AP",
    "Rep. George Santos pleads not guilty to a 13-count federal indictment",
    "Speaker Kevin McCarthy says he won't support Santos' re-election bid after indictment",
    "A timeline of Rep. George Santos' fabrications and controversy",
    "lolostock / Getty Images/iStockphoto",
    "A 'peanut patch' desensitized toddlers with peanut allergies in a promising late-stage trial",
    "House Republicans escalate attacks on Biden family, alleging business with foreign nationals",
    "Saul Loeb / AFP via Getty Images file",
    "Debt ceiling standoff could derail Biden's G-7 trip where Russia and China are on the agenda",
    "Anna Moneymaker / Getty Images",
    "Sen. Dianne Feinstein returns to Capitol Hill, casts her first votes since February",
    "'He did it and you know it': E. Jean Carroll says she confronted Trump's lawyer after verdict",
    "Former DHS disinformation expert sues Fox News for defamation",
    "House members to host bipartisan dinner with OpenAI CEO Sam Altman",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "Simon Dawson / Bloomberg via Getty Images file",
    "JPMorgan alleges former executive 'thwarted' efforts to cut ties with Epstein",
    "Miami-Dade Police Department",
    "Ohio EMT last seen going to car 4 days ago is thought to be in danger, police say",
    "Man freed after 29 years in prison for a rape the victim insisted he didn't commit",
    "Ex-Raider Henry Ruggs pleads guilty to driving drunk at 156 mph, causing fatal crash",
    "FDA advisory panels back making Opill birth control pill available over the counter",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Andrew Matthews / PA via AP file",
    "Babies who have DNA from three different people born in the U.K. for first time",
    "In South Florida, ‘black snow’ makes breathing difficult for some Black and Latino residents",
    "Hate mosquitoes? Coconut scents could help keep them away, small study suggests",
    "Charley Gallay / Getty Images for Disney file",
    "Hulu content to be added to Disney+ for 'one-app experience,' CEO Bob Iger says",
    "Carolyn Van Houten / The Washington Post via Getty Images file",
    "Consumer price growth falls to below 5% for the first time in two years",
    "Natalie Behring / Getty Images file",
    "HSBC downgrades Anheuser-Busch InBev as it deals with a 'Bud Light crisis'",
    "Paramount brands to lay off 25% of U.S. staff as MTV News shuts down",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "WATCH: 8-week-old kitten rescued after getting caught in truck frame",
    "Ukrainian rapper-turned-soldier asked to perform at Eurovision",
    "MTV News shuts down after 36 years",
    "Google launches new AI tools",
    "Michael Ciaglo for NBC News",
    "Fred Dugfour / AFP Pool via Getty Images file",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Andy Buchanan / AFP - Getty Images file",
    "Ernesto Benavides / AFP via Getty Images file",
    "Suspect in Natalee Holloway disappearance to be extradited to U.S.",
    "Ulises Ruiz / AFP via Getty Images file",
    "Paul Chinn / San Francisco Chronicle via Getty Images file",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "U.K. man pleads guilty to hack on Twitter accounts of Joe Biden and Elon Musk",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "Title 42 immigration policy set to expire tomorrow",
    "Greg Lovett / The Palm Beach Post / USA Today Network",
    "Herika Martinez  / AFP - Getty Images",
    "Everything you need to know about Title 42 ahead of its end date",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Ed Reed / Office of Mayor Eric Adams",
    "NYC mayor calls fatal subway chokehold on Jordan Neely a ‘tragedy that never should have happened’",
    "California Dept. of Justice",
    "Argument at California reparations hearing shows toll of talking about racism, members say",
    "Charlie Neibergall / AP file",
    "West Virginia’s Bob Huggins agrees to $1M pay cut, 3-game suspension for homophobic slur",
    "@dylanmulvaney via Instagram",
    "Chicago gay bars boycott Anheuser-Busch for distancing itself from Dylan Mulvaney",
    "Justin Sullivan / Getty Images",
    "Transgender youths sue over Montana gender-affirming care ban",
    "Timothy D. Easley / AP file",
    "Comment on transgender issue roils Kentucky governor’s race",
    "'Sesame Street' debuts its first Filipino American muppet",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "Mother's Day gifts for every kind of mom",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Do Not Sell My Personal Information"
]