[
    "Sergey Guneev / Sputnik via AP",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "Putin blasts rebel leaders as traitors and says Russia would've crushed the revolt",
    "Scott Olson / Getty Images",
    "Judge in Trump docs case denies special counsel's request to keep 84 witnesses secret",
    "Trump aide Walt Nauta to be arraigned in Florida on Tuesday",
    "Georgia secretary of state to meet with special counsel investigators",
    "Hundreds of flights canceled as severe weather slams the East Coast",
    "VIDEO: Destructive storms batter East Coast while Texas grapples with record-breaking heat",
    "Flight canceled? Here are some expert tips.",
    "Evelyn Hockstein / For the Washington Post via Getty Images",
    "'Planned in plain sight': Senate report finds intel agencies failed in the lead-up to Jan. 6",
    "Multiple Secret Service agents have testified before Jan. 6 grand jury, sources say",
    "Intermittent fasting is as effective as calorie counting for weight loss, study finds",
    "Experimental drug could offer more weight loss than any drug on the market, study finds",
    "Leila Register  / NBC News; Getty Images; Reuters",
    "Slavery's descendants: America's family secret",
    "U.S. District Court for D.C.",
    "Jan. 6 defendant, representing himself, questions son who turned him into the FBI",
    "Cavan Images / Getty Images",
    "Pregnant workers may receive new protections and accommodations as new law takes effect",
    "J. Scott Applewhite / AP file",
    "Democratic lawmakers seek Supreme Court investigation into Clarence Thomas",
    "Vice President Kamala Harris makes a surprise visit to NYC's Stonewall Inn",
    "Kansas attorney general sues to stop trans people from changing their birth certificates",
    "Ron DeSantis endorses 'deadly force' against migrants suspected of trafficking drugs",
    "Jessica Rinaldi / Boston Globe via Getty Images",
    "Man arrested after couple celebrating 50th wedding anniversary are found dead in home",
    "Zach Wilkinson / The Moscow-Pullman Daily News via AP pool file",
    "Prosecutors will pursue death penalty in slayings of 4 University of Idaho students",
    "Don Emmert / AFP via Getty Images file",
    "For California marine mammals, toxic algae bloom is a mass casualty incident",
    "5 teens killed after car plunges into Florida retention pond",
    "Three die in Gulf of Mexico rip currents off Panama City Beach",
    "Obama draws ire of Indian officials with call to protect Muslim rights",
    "Anna Moneymaker / Getty Images",
    "White House blasts harassment of reporter who asked Modi about human rights record",
    "Petros Giannakouris / AP fuile",
    "Far-right victories in Greece highlight trend across Europe",
    "Israel OK’s plans for thousands of new settlement homes, defying White House calls for restraint",
    "Myanmar torches drugs worth half a billion as illicit trade soars",
    "Silver Screen Collection / Getty Images file",
    "Rock Hudson documentary offers an intimate look into the Hollywood icon's double life",
    "Future Publishing via Getty Images",
    "Tomas Stevens / Sipa USA via AP file",
    "Influencers praise conditions in Shein factory despite abuse allegations",
    "Actor Angela Bassett will finally take home an Oscar",
    "Olivia Rodrigo announces sophomore album 'Guts'",
    "The next Ozempic? New weight-loss drug shows promising results",
    "Alligator attacks 13-year-old swimming in a Florida creek",
    "Ryan Reynolds, Michael B. Jordan, and more invest in Alpine F1 team",
    "Sarah Ferguson reveals breast cancer diagnosis, urges screenings",
    "Leila Register / NBC News; Getty Images",
    "How digital creators went from a Hollywood afterthought to major power players in entertainment",
    "Nathan Laine / Bloomberg via Getty Images",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "'They don't want us here': Florida immigrants detail their exit over DeSantis law",
    "Chicago's consent decree woes offer a warning as Minneapolis police face federal oversight",
    "Kathleen Flynn / Reuters / Redux",
    "Supreme Court paves the way for Louisiana congressional districts to be redrawn",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Democrats warn party: The threat of Trump winning in 2024 is 'very real'",
    "Twitter shows users police brutality and anti-vaccine videos on TikTok copycat",
    "John Lamparski / Getty Images",
    "Jesse Watters replaces Tucker Carlson in Fox News prime-time hour",
    "James Crown, businessman and Aspen Institute chair, dies in race track crash",
    "Eli Lilly releases new data from potentially game-changing weight loss drug trial",
    "Soumyabrata Roy / NurPhoto via Getty Images",
    "CDC issues alert after 5 cases of locally acquired malaria reported in Texas and Florida",
    "NaluPhoto / Getty Images/iStockphoto",
    "Dolphin moms use 'baby talk' with their newborns, research shows",
    "Oregon county sues fossil fuel companies, alleging they caused deadly 2021 heat wave in Northwest",
    "Three of Mount Rainier's glaciers have melted away",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "Luis Robayo / AFP via Getty Images",
    "Argentine dictatorship’s 'death flight' plane returned to country for a historical reckoning",
    "Mark Felix / Bloomberg via Getty Images file",
    "Latinos now outnumber non-Hispanic whites in Texas, census data shows",
    "These pilots fly women who need abortions to states where it's allowed",
    "Leon Bennett / FilmMagic file",
    "Paras Griffin / Getty Images",
    "Patti LaBelle flubs lyrics for a Tina Turner tribute, pleads 'I'm trying, y'all'",
    "Mark Terrill / Invision / AP",
    "BET Awards honor hip-hop's 50 years, Busta Rhymes",
    "Bing Guan / Bloomberg via Getty Images",
    "New York governor signs 'safe haven' law for transgender youth",
    "Club Q shooter sentenced to life in prison for attack on gay nightclub",
    "What’s fueling the rise in Hindu nationalism in the U.S.",
    "Drew Angerer / Getty Images",
    "Iowa paper apologizes for cartoon that GOP hopeful Vivek Ramaswamy called 'bigoted'",
    "Over 60% of Netflix users have watched a Korean title on the streaming service, CEO says",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Our favorite pet stain removers and litter boxes of 2023",
    "We tried hundreds of pet care products — these are the best.",
    "Pet Awards 2023: The best toys and apparel for cats and dogs",
    "The best cat and dog food of 2023, according to vets",
    "How we chose the 2023 Pet Awards winners",
    "9 highly rated toiletry bags to keep you organized",
    "How to choose the right face sunscreen",
    "Target Circle Week starts July 9",
    "Do Not Sell My Personal Information"
]