[
    "BREAKING: Jury reaches verdict in E. Jean Carroll rape and defamation case against Trump",
    "Jury reaches verdict in E. Jean Carroll rape and defamation case against Trump",
    "Special coverage on NBC News NOW",
    "Stephanie Keith / Getty Images",
    "Carroll was 'exactly' Trump's type, her lawyer says in closing arguments",
    "Nicholas Kamm / AFP via Getty Images file",
    "Trump didn't testify in trial after judge's deadline passes",
    "Jeff J Mitchell / Getty Images",
    "Notable moments from Trump's deposition in the E. Jean Carroll case",
    "Kena Betancur / AFP - Getty Images",
    "Trump 'raped me': E. Jean Carroll testifies about alleged attack at trial",
    "Utah author accused of poisoning husband",
    "Michael Ciaglo for NBC News",
    "Missouri school board member resigns and plans to move over anti-LGBTQ bills",
    "Anna Moneymaker / Getty Images file",
    "Dianne Feinstein set to return to the Senate after a nearly 3-month absence due to health issues",
    "Biden to meet with congressional leaders on debt ceiling as default looms",
    "Eric Lee / Bloomberg via Getty Images",
    "Georgia Gov. Brian Kemp hosts a private donor retreat as he plans 2024 involvement",
    "Texas House panel advances bill to raise age to buy semi-automatic rifles",
    "S.C. police shooting survivor says deputies opened fire on him and his mother 'immediately'",
    "Philadelphia Police Dept. Philadelphia Police Dept.",
    "Escape of 2 inmates, including a suspect in multiple murders, went unnoticed for almost 19 hours",
    "Miguel Roberts / The Brownsville Herald via AP file",
    "Screen women for breast cancer at 40, instead of 50, new guidelines say",
    "Victim of deadly crash near the southern border begs Biden for help after leg amputation",
    "Two NYU business school students fatally shot during vacation in Puerto Rico",
    "Gavriil Grigorov / AFP - Getty Images",
    "Putin's Victory Day features security fears and infighting rather than military might",
    "Betsy Joles / Bloomberg via Getty Images",
    "Former Pakistan leader Imran Khan arrested",
    "Mohammed Abed / AFP - Getty Images",
    "Israeli strikes in Gaza kill 10 civilians and 3 senior Palestinian militants",
    "China consultancy crackdown sends jitters across foreign business",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Alain Jocard / AFP via Getty Images file",
    "Leaked Google engineer memo warns that Big Tech could lose AI race to the little guys",
    "Paul Yeung / Bloomberg via Getty Images file",
    "More Americans are so worried about money it's hurting their mental health",
    "Inflation and 'overheated' economy have many households in a corner",
    "FTX founder Sam Bankman-Fried seeks dismissal of indictment",
    "FBI says it has sabotaged hacking tool created by elite Russian spies",
    "Robert De Niro welcomes his seventh baby at 79",
    "Vivien Killilea / Getty Images file",
    "Richard Dreyfuss says Oscar's new diversity standards 'make me vomit'",
    "Shahar Azran / Getty Images file",
    "Nick Cannon shoots down 'deadbeat dad' label: 'I've been villainized'",
    "Pioneering Black opera singer Grace Bumbry dies at 86",
    "'Little Richard: I Am Everything' depicts the star’s lifelong struggle with sexuality and religion",
    "Tiger Woods’ ex alleges sexual harassment ahead of court hearing",
    "Not so happy returns: Retailers tighten refund policies",
    "Tennessee boy becomes author at age four",
    "Floodwaters drive new gold rush in California",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Is DeSantis wise to feud with Disney? We asked experts — and voters who could decide his fate",
    "via GoFundMe; LinkedIN; KXAS",
    "Texas mall shooting victims include 3-year-old boy and his parents",
    "Drew Angerer / Getty Images file",
    "Trump prohibited from posting evidence in hush money case to social media, judge rules",
    "Hurley School District via Facebook",
    "2nd grader who vanished while camping in Michigan is found safe after he sheltered under a log",
    "Georgijevic / Getty Images",
    "Teens should be trained in media literacy and limit their screen time, psychologists say",
    "Paul Bersebach / Orange County Register via Getty Images file",
    "Rise of mpox cases in Chicago raises concern about possible summer spread",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Mario Tama / Getty Images file",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "In a galactic first, a star is seen swallowing a planet in one gulp",
    "Manchin introduces bill to speed energy permitting",
    "Fort Hood is officially renamed Fort Cavazos after the first Latino four-star general",
    "Congress has failed for over two decades to reform immigration — here's a timeline",
    "Driver who rammed SUV into migrants in Texas is charged with manslaughter",
    "Fred Lindinger / United Archives via Getty Images file",
    "Eddie Brady / Getty Images",
    "David Clumpner Photography",
    "Censured Montana Rep. Zooey Zephyr proposes to girlfriend at queer prom",
    "Russell Hons / Cal Sport Media via AP file",
    "North Dakota governor OKs law to ignore transgender pronouns",
    "Brandon Bell / Getty Images",
    "Texas AG to investigate Austin children’s hospital over transgender care for minors",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Angela Weiss / AFP via Getty Images file",
    "Tim Graham Photo Library / via Getty Images file",
    "South Asians watch another monarch ascend the throne that devastated their families",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "29 best Mother's Day gifts on Amazon",
    "15 top-rated Amazon coffee accessories",
    "8-top rated juicers to add to your kitchen setup",
    "Oura; Le Creuset; Solo Stove",
    "7  best sales to shop this week",
    "Gift these flowers and plants for Mother's Day",
    "9 best new products so far this May",
    "Top-rated carry-on luggage you need before summer travel season",
    "Do Not Sell My Personal Information"
]