[
    "Adria Malcolm for NBC News",
    "Migrants wait for chance to enter U.S. after end of pandemic-era restrictions",
    "Live Updates / Title 42 has expired as border officials prepare for a possible influx",
    "House passes Republican border security bill hours before Covid restrictions lift",
    "Spencer Platt / Getty Images",
    "NYC subway rider who put Jordan Neely in fatal chokehold to be charged with manslaughter",
    "White House calls for 'thorough investigation' into Jordan Neely's death",
    "Jeff J Mitchell / Getty Images",
    "Trump notifies court he plans to appeal $5 million E. Jean Carroll verdict",
    "Trump's comments on Mar-a-Lago documents 'like red meat to a prosecutor'",
    "Some Republicans push back on Trump's comments on the debt ceiling and Ukraine",
    "Marlena Sloss / Bloomberg via Getty Images file",
    "Elon Musk says he's hired a new CEO for Twitter and will reduce his own role",
    "Tucker Carlson says he'll launch new show on Twitter",
    "Black Tech Twitter, trans users and more marginalized groups flock to Bluesky",
    "YouTuber who crashed plane in California mountains did it for sponsorship deal, authorities say",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "Criminal investigation into Sen. Bob Menendez expands with new subpoenas",
    "Justice Department seeks to prevent Trump deposition in lawsuits by ex-FBI officials",
    "Erik McGregor / LightRocket via Getty Images file",
    "Supreme Court throws out convictions in sweeping New York corruption probe",
    "Drew Angerer / Getty Images file",
    "Debt ceiling meeting between Biden and congressional leaders is delayed",
    "CIA announces steps to tackle sexual misconduct cases",
    "Biden swipes at 'MAGA Republicans' over firefighter and conservation jobs",
    "Feinstein returns to the Senate Judiciary Committee, helping advance Biden judges",
    "University of Utah swimmer allegedly flees to Canada amid rape investigation, police say",
    "A Chicago woman was arrested in a series of baseball bat attacks, police say",
    "Brittainy Newman / AP file",
    "Judge in Virginia says law banning sales of handguns to young adults is unconstitutional",
    "Natalee Holloway case suspect to be extradited to U.S. in alleged fraud targeting her mom",
    "Parents' fraud convictions in college admissions scandal overturned by appeals court",
    "Man accused in deadly shooting at  Taiwanese church in California is indicted on 98 charges",
    "Idaho prosecutors ask jury to convict Lori Vallow in the killings of 2 of her children",
    "Diego Herrera Carcedo / Anadolu Agency via Getty Images",
    "Ukraine drives back Russian forces around Bakhmut in its first significant gains in months",
    "Ahmad Gharabli / AFP - Getty Images",
    "Salvatore Di Nolfi / Keystone via AP",
    "Top jewelry pieces fall short of target prices at Christie’s auction derided by Jewish groups",
    "Serbians hand over thousands of weapons after mass shootings",
    "Erdoğan’s rival boosted by withdrawal ahead of Turkey presidential vote",
    "Patrick T. Fallon / AFP via Getty Images file",
    "More gay and bisexual men can donate blood under new FDA rules",
    "@breakingchesky via Instagram",
    "NBC News' Morgan Chesky describes 'frightening' health scare during hike",
    "At least 2 cases of drug-resistant ringworm infections found in the U.S., CDC says",
    "Why it took doctors months to diagnose a woman's eye infection caused by contaminated eyedrops",
    "Mpox is no longer a global health emergency, WHO announces",
    "Al Drago / Bloomberg via Getty Images",
    "Covid transformed the U.S. labor market, and it isn’t done yet",
    "Douglas Sacha / Getty Images",
    "Blinded by the light: Cars in the U.S. still lack glare-reducing headlight technology",
    "Adam Glanzman / Bloomberg via Getty Images file",
    "Peloton recalls 2.2 million exercise bikes over safety hazard",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "How Europe is leading the world in building guardrails around AI",
    "Google unveils latest AI features",
    "Artificial intelligence helping recycling center sort waste",
    "76ers star James Harden meets Michigan State University shooting victim",
    "New details on Utah author charged with fatally poisoning husband",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "Christina Chung for NBC News",
    "Tough immigration policies are making it harder to build new homes",
    "The local toll of election denialism: Virginia county loses second registrar in 2 months",
    "Greg Lovett / The Palm Beach Post / USA Today Network",
    "In South Florida, ‘black snow’ makes breathing difficult for some Black and Latino residents",
    "Walker Mortuary; KPCW.org via AP",
    "Utah mom accused of killing husband with fentanyl tried to poison him before, family says",
    "Jessica Rinaldi / Boston Globe via Getty Images file",
    "Arturo Holmes / FilmMagic file",
    "Elliot Page recalls past feelings of dysphoria and 'joy' he now feels in his body",
    "Jacklyn Zeman, longtime 'General Hospital' actor, dies at 70",
    "Paul Chinn / San Francisco Chronicle via Getty Images file",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "Paramount brands to lay off 25% of U.S. staff as MTV News shuts down",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Stringer via Reuters/Redux",
    "Patrick T. Fallon / AFP via Getty Images",
    "Herika Martinez / AFP via Getty Images file",
    "Mexico suspends operations at some migrant centers pending review after deadly fire",
    "Andrew Savulich / New York Daily News/TNS via Getty Images file",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Ed Reed / Office of Mayor Eric Adams",
    "NYC mayor calls fatal subway chokehold on Jordan Neely a ‘tragedy that never should have happened’",
    "Arkansas Pride event changes venue after drag show restriction",
    "Charlie Neibergall / AP file",
    "West Virginia’s Bob Huggins agrees to $1M pay cut, 3-game suspension for homophobic slur",
    "José Luis Villegas  / AP file",
    "California Senate passes bill that would make caste discrimination illegal",
    "'Sesame Street' debuts its first Filipino American muppet",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "Mother's Day gifts for every kind of mom",
    "Do Not Sell My Personal Information"
]