[
    "BREAKING: Club Q shooter sentenced to life in prison",
    "Photos: 24 hours that took Russia to the brink of civil war",
    "Biden says U.S. and allies 'made clear' they weren't involved in Russian mutiny attempt",
    "Five or six Secret Service agents have testified before Jan. 6 grand jury, sources say",
    "Supreme Court dismisses House Democrats' dispute over Trump hotel documents",
    "Prosecutors ask to delay Trump's classified documents trial until December",
    "John Lamparski / Getty Images",
    "Jesse Watters replaces Tucker Carlson in Fox News prime-time hour",
    "EXCLUSIVE: How many people are watching Tucker Carlson’s new show on Twitter?",
    "Fox News sends Tucker Carlson cease-and-desist letter over new Twitter show",
    "Scott Olson / Getty Images",
    "Club Q shooter sentenced to life in prison for attack on gay nightclub",
    "Army veteran who disarmed Club Q attacker to lead first Pride parade since the shooting",
    "Kelsey Brunner for NBC News",
    "The future of AI takes center stage at the Aspen Ideas Festival",
    "WATCH LIVE: GM CEO Mary Barra on the future of cars at Aspen Ideas Festival",
    "James Crown, businessman and Aspen Institute chair, dies in race track crash",
    "Al Drago / Bloomberg via Getty Images",
    "Ron DeSantis vows to send the military to block drugs from reaching Mexican ports",
    "Kathleen Flynn / Reuters / Redux",
    "Supreme Court paves the way for Louisiana congressional districts to be redrawn",
    "Supreme Court rebuffs OSU and enables the remaining sex abuse victims to sue",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Democrats warn party: The threat of Trump winning in 2024 is 'very real'",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Putin's instability could test Biden as he runs for re-election",
    "Sarah McBride launches historic bid to become first trans member of Congress",
    "Zach Wilkinson / The Moscow-Pullman Daily News via AP file",
    "Bryan Kohberger's attorney alleges there is 'no connection' between him and Idaho student victims",
    "Jenna Watson / IndyStar / USA Today Network",
    "1 dead as tornadoes and thunderstorms hit the Midwest and the South",
    "Amy Beth Bennett / South Florida Sun-Sentinel via AP, Pool file",
    "Closing arguments set for trial of deputy accused of failing to stop Parkland school massacre",
    "Man dead and another hospitalized after boat hits ferry near Miami port",
    "Girl, 17, killed and 3 others wounded in shooting in Houston, police say",
    "Teen who died on Titanic sub brought Rubik's Cube with him in bid to break world record",
    "Kim Won Jin / AFP - Getty Images",
    "Thousands of North Koreans march in anti-U.S. rallies as country marks Korean War anniversary",
    "Police detain 50 after Pride march in Istanbul",
    "Sarah Ferguson, Duchess of York, diagnosed with breast cancer",
    "Dave J Hogan / Getty Images",
    "Olivia Rodrigo just announced her sophomore album, ‘Guts’",
    "Bradley Collyer / PA via AP file",
    "Ryan Reynolds and Rob McElhenney among new investors backing F1 team Alpine in $218 million deal",
    "Paras Griffin / Getty Images",
    "Patti LaBelle flubs lyrics for a Tina Turner tribute, pleads 'I'm trying, y'all'",
    "Haruki Murakami pleads for keeping Tokyo park and baseball stadium that inspired his writing",
    "BET Awards honor hip-hop's 50 years, Busta Rhymes",
    "Alligator attacks 13-year-old swimming in a Florida creek",
    "Sarah Ferguson reveals breast cancer diagnosis, urges screenings",
    "Drug makers race to create oral versions of Ozempic, Wegovy",
    "Niall Horan on new album ‘The Show’ and One Direction sensation",
    "Leila Register / NBC News; Getty Images",
    "How digital creators went from a Hollywood afterthought to major power players in entertainment",
    "Nathan Laine / Bloomberg via Getty Images",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "'They don't want us here': Florida immigrants detail their exit over DeSantis law",
    "Chicago's consent decree woes offer a warning as Minneapolis police face federal oversight",
    "OceanGate / AFP - Getty Images",
    "What is a 'catastrophic implosion'? How pressure but no pain likely marked the end for Titanic sub",
    "Richard Shotwell / Invision/AP file",
    "Hikers find human remains in area where Julian Sands went missing in January",
    "Jared Siskin / Patrick McMullan / Getty Images",
    "Nervous about AI? Many Internet creators  consider it a tool, not a threat.",
    "Florian Gaertner / Photothek via Getty Images file",
    "Effective pills for weight loss, including an oral version of Ozempic, are on the horizon",
    "Universal Images Group via Getty Images file",
    "A cholesterol-lowering alternative to statins reduces deaths from heart disease, new study finds",
    "Does Ozempic treat PCOS and addiction? What the science says.",
    "Skin moles that grow hair may offer a treatment for baldness, a study in mice suggests",
    "Black veterans are denied VA health benefits more often than white veterans, new data shows",
    "Oregon county sues fossil fuel companies, alleging they caused deadly 2021 heat wave in Northwest",
    "Three of Mount Rainier's glaciers have melted away",
    "Darrell Schoppe / Cover Images via AP",
    "Ocean heat wave that can cause extreme weather may linger into fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Luis Robayo / AFP via Getty Images",
    "Argentine dictatorship’s 'death flight' plane returned to country for a historical reckoning",
    "Mark Felix / Bloomberg via Getty Images file",
    "Latinos now outnumber non-Hispanic whites in Texas, census data shows",
    "These pilots fly women who need abortions to states where it's allowed",
    "Mark Terrill / Invision / AP",
    "Graeme Sloan / Sipa via AP file",
    "Party and protest mix as LGBTQ pride parades roll from coast to coast",
    "Brendan Farrington / AP file",
    "U.S. court blocks Florida law restricting drag performances",
    "Over 60% of Netflix users have watched a Korean title on the streaming service, CEO says",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "How to choose the right face sunscreen",
    "Target Circle Week starts July 9",
    "Slip; Nu Skin; Loop Earplugs",
    "Select Wellness Awards 2023 bestsellers",
    "What is Walmart Plus Week?",
    "7 best sales to shop this week",
    "When is Amazon Prime Day 2023? What to know",
    "The best way to clean your grill",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "Do Not Sell My Personal Information"
]