[
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Biden says Putin was weakened by Yevgeny Prigozhin's revolt",
    "Paul Daly / The Canadian Press via AP",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "U.S. Coast Guard opens investigation into fatal sub implosion",
    "Owen Berg / NBC News / Getty Images",
    "Liberal wins at the Supreme Court may prove to be fleeting",
    "A 2013 Supreme Court decision invited widespread voter suppression laws, experts say",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "Ron DeSantis vetoes popular criminal justice bill as he moves to Trump's right",
    "Frazer Harrison / Getty Images file",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "Canadian wildfire smoke blankets parts of U.S. as others face severe heat and storms",
    "Just now39m agoAlmost 500 active fires in Canada",
    "Just now2h agoTemperatures in Texas higher than in Death Valley this week",
    "Just now3h agoNew Orleans breaks record for excessive heat warnings in a year",
    "Just now3h agoHeat is the leading cause of weather-related deaths in U.S.",
    "'Like a Van Gogh': A disjointed jet stream has some climate scientists spooked",
    "Kena Betancur / Getty Images",
    "Summer travel season off to rough start amid widespread flight delays",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Stewart  F. House / Getty Images",
    "Body camera video from Allen, Texas, mall shooting shows officer chase and kill gunman",
    "Joe Burbank / Orlando Sentinel via Getty Images file",
    "Passenger rescued after falling off 10th deck of cruise ship, Coast Guard says",
    "At least 12 have drowned at Florida beaches as rip current continues to plague Panhandle",
    "Daniel Penny pleads not guilty in NYC subway chokehold death of Jordan Neely",
    "Missouri man sentenced in death of woman who was caged and dismembered",
    "Delta flight makes emergency landing in N.C. without nose gear after malfunction",
    "Manuel Balce Ceneta / AP file",
    "Biden warns top aides against offering him political advice about Hunter",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Christine Peterson / Telegram & Gazette / USA Today Network",
    "Biden pushes vision for economic growth 'from the middle out and bottom up'",
    "More Democrats than Republicans are open to a third-party presidential candidate",
    "Abducted infant killed when man drives Camaro into Ohio house at 'full speed'",
    "Laurie Dieffembacq / Belga/Sipa USA via AP file",
    "Anheuser-Busch CEO says his company will continue to support the LGBTQ community",
    "Leonardo Munoz / VIEW press / Corbis via Getty Images file",
    "Overstock.com will relaunch Bed Bath & Beyond after buying its IP assets for $21.5 million",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "FBI and SEC respond to complaints about Twitter audio star Mario Nawfal",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "After 27 tries, Chinese millionaire considers giving up on college entrance exam",
    "Genya Savilov / AFP - Getty Images",
    "3 children among 9 dead after Russian missile slams into pizza restaurant",
    "Archaeological Park of Pompeii via AFP - Getty Images",
    "Pie in the sky! A wall painting found in Pompeii doesn't depict Italy’s iconic dish",
    "Millions become a year or two younger as South Korea scraps traditional way of counting age",
    "Unrest after police shooting of teenager prompts France to heighten security",
    "Ethan Miller / Getty Images file",
    "Pete Davidson checks into rehab",
    "Weiss Eubanks / NBCU Photo Bank via Getty Images file",
    "Chrissy Teigen and John Legend welcome baby No. 4",
    "Francois Nel / Getty Images file",
    "Australian teen becomes first female to pull off Tony Hawk's famed '720' skateboard maneuver",
    "McDonald's Grimace breaks his silence on TikTok trend",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Inside daring effort to rescue Ukrainian children",
    "Delta jet makes emergency landing without nose gear",
    "Watch: Chimpanzee is awestruck after seeing open sky after 28 years in a cage",
    "Global outrage after tourist carves names into Rome's Colosseum",
    "Erik McGregor / LightRocket via Getty Images",
    "Sarah L. Voisin / The Washington Post via Getty Images file",
    "Supreme Court deals a blow to Trump ally John Eastman's 2020 election theory",
    "Arkady Budnitsky / Anadolu Agency via Getty Images",
    "Mutiny and mayhem in Russia a probable boon for Ukraine",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Sean Gardner / Getty Images file",
    "NASCAR driver Jimmie Johnson's in-laws and their grandson are dead in an apparent murder-suicide",
    "Poor air quality expected to linger 'the next few days' in the northern U.S.",
    "Judge in Trump docs case denies special counsel's request to keep 84 witnesses secret",
    "Andrew Caballero-Reynolds / AFP - Getty Images",
    "Biden has started using a CPAP machine at night to deal with sleep apnea",
    "Tick and mosquito season is already shaping up to be severe this year",
    "Have a summer cold? Common viruses are back from a pandemic hiatus",
    "What to know about the health risks of wildfire smoke",
    "Astronauts' urine and sweat are almost entirely recycled into drinking water with new system",
    "Blistering heat grips the South and puts Texas under triple-digit temperatures",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "Mexico Instituto Nacional de Migracion",
    "Bus of migrants help mother give birth before being detained in Mexico",
    "Alberto Ortega / Europa Press via Getty Images file",
    "Spanish Royal Academy rejects changing  language to anti-colonial ‘Ñamericano’",
    "Stefani Reynolds / Bloomberg via Getty Images file",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Brandon Bell / Getty Images file",
    "Laurence Griffiths / Getty Images",
    "Justine Good4 / NBC News; Getty Images / AP",
    "What to know about California's highly anticipated reparations proposal",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Chris Delmas / AFP via Getty Images file",
    "Dwyane Wade says his daughter physically hid from him when she came out to the family",
    "Oscars invite Taylor Swift, Ke Huy Quan, RRR and other new members to Academy",
    "Michelle Yeoh and Chadwick Boseman are honored with Walk of Fame stars",
    "Lev Radin / Sipa via AP file",
    "NYC makes Diwali an official school holiday, but there’s a catch this year",
    "Do Not Sell My Personal Information"
]