[
    "Win McNamee / Getty Images file",
    "House GOP conservatives send McCarthy an ultimatum on funding the government",
    "A collision course over government funding raises fears of a shutdown",
    "Hot and getting hotter: South and Southwest U.S. face triple-digit temperatures",
    "61,000 Europeans may have died in last summer’s heat waves, experts say",
    "World suffered its hottest day on record one week ago",
    "Northwestern head football coach fired after hazing investigation",
    "Dimitrios Kambouris / Getty Images for Netflix file",
    "Brendan Smialowski / AFP via Getty Images file",
    "Space Command builds out Colorado HQ as Congress members try to force Alabama move",
    "Congress threatens to block funding for Space Command HQ as abortion laws affect location decision",
    "Prosecutor who made Hunter Biden plea deal says he had OK to bring charges anywhere in U.S.",
    "Charlie Neibergall / AP file",
    "Trump feuds with Iowa Gov. Kim Reynolds",
    "Anna Moneymaker / Getty Images file",
    "House Republicans unveil 'election integrity' bill",
    "Curtis Means / Pool/DailyMail via AP file",
    "Steve Bannon ordered to pay his lawyers almost $500,000 in fees",
    "Roy Herron, longtime Tenn. Democratic lawmaker, dies at 69 after injuries from jet ski accident",
    "Texas Democrat Roland Gutierrez enters Senate race, pushed for gun legislation after Uvalde",
    "Biden meets with King Charles III and Rishi Sunak ahead of NATO summit",
    "AP; @zahakos; USA Today Network; NBC News",
    "Heavy flooding hits Vermont as New England braces for more rain",
    "James Lewis, prime suspect in unsolved 1982 Tylenol murders case, dies at 76",
    "Scott Olson / Getty Images file",
    "Larry Nassar was stabbed multiple times at Florida federal prison",
    "California fugitive involved in fatal hostage standoff is captured, sheriff's office says",
    "USDC Western District of Missouri",
    "Kansas City super fan 'ChiefsAholic' suspected in string of bank robberies across Midwest",
    "Marine taken into custody after missing 14-year-old girl is found in barracks of California base",
    "Man accused of shooting victims at random while riding a scooter is arraigned, officials say",
    "Filip Singer / WPA Pool / Getty Images",
    "Turkey agrees to back Sweden's NATO bid, secretary general says",
    "Putin met Prigozhin days after mercenary leader led mutiny",
    "Florian Gaertner / Photothek via Getty Images file",
    "E.U. investigates Ozempic and weight-loss drug Saxenda after reports of suicidal thoughts",
    "Russia’s first transgender politician drops her run for governor due to anti-LGBTQ bill",
    "NATO summit could test Biden's unity promise",
    "Belarusian tennis player booed at Wimbledon after losing to Ukrainian",
    "Latvia becomes 7th nation to be led by an openly gay head of state",
    "Logan Paul's PRIME Energy drink prompts concerns about the risks of caffeine for kids",
    "Frederick M. Brown / Getty Images",
    "Soap star Andrea Evans dies at age 66",
    "Simon Russell / Getty Images file",
    "Jeffrey Carlson, 'All My Children' actor,  dies at 48",
    "Trans model and actor is crowned Miss Netherlands and will compete for Miss Universe",
    "Harry Styles appears to be latest musician hit by an object while performing onstage",
    "Looking for bed sheets? Start here.",
    "8 best flat irons, according to experts",
    "Early Prime Day deals to shop right now",
    "The 8 best vacuums to shop",
    "Best head shavers to use at home",
    "Sen. Schumer seeks FDA probe of PRIME energy drinks",
    "Dangerous boat jumping challenge leaves at least 4 dead",
    "How to maximize savings on Amazon Prime Day",
    "Powerball and Mega Millions jackpots reach combined $1B",
    "Leila Register / NBC News; OceanGate Expeditions via AP",
    "A crypto prediction market draws bets and outrage on viral events",
    "Julie Bennett / Getty Images file",
    "State laws targeting LGBTQ rights have a new foe: federal judges",
    "Baby boomers and their cash are driving the housing market right now",
    "The (figurative) cage match between Mark Zuckerberg and Elon Musk is on",
    "Videos of unconscious boys' rapes found on phone left at restaurant, police say",
    "3 Georgia teens charged with murder after plot to egg a home goes wrong, police say",
    "FDA asked to investigate Logan Paul’s energy drink, PRIME, which has the caffeine of 6 Coke cans",
    "Europe signs off on a new privacy pact that allows people’s data to keep flowing to U.S.",
    "Brill / ullstein bild via Getty Images file",
    "YouTuber Colleen Ballinger has several live shows and podcast canceled",
    "Murat Kocabas / Sipa USA via AP",
    "Twitter traffic is 'tanking' as Meta's Threads hits 100 million users",
    "Sarah Silverman sues Meta and OpenAI for copyright infringement",
    "Kidney stones are rising among children and teens, especially girls, research shows",
    "As malaria cases tick up in Florida, a doctor treating patients describes their symptoms",
    "WHO reports dozens of babies sickened by rare, deadly viral infections",
    "Northern Lights unlikely to be seen across U.S. despite early forecast",
    "Valentine Chapuis / AFP via Getty Images file",
    "Backlash brews against Texas law that eliminates mandatory water breaks",
    "A dormant California lake that reappeared isn't going anywhere fast",
    "Son of renowned Guatemalan journalist fights for father's freedom a year after imprisonment",
    "Glenn Fawcett / U.S. Border Patrol file",
    "Deadly transport: More trucks are smuggling migrants in trailers",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Monica Morgan / WireImage file",
    "Hill Harper, an actor on ‘CSI: NY’ and ‘The Good Doctor,’ announces Senate bid in Michigan",
    "Jim Hughes / NY Daily News via Getty Images",
    "Mutulu Shakur, Black liberation activist and stepfather of Tupac, dies at 72",
    "Brandon Bell / Getty Images/FILE",
    "Lawsuit seeking reparations for Tulsa Race Massacre is dismissed",
    "Alabama Historical Commission",
    "A shipwreck awash in Black history takes center stage in Alabama",
    "Evert Elzinga / AFP - Getty Images",
    "Gints Ivuskans / AFP via Getty Images",
    "Atlanta Police Department’s Robbery Unit via Crime Stoppers Greater Atlanta Facebook",
    "Video shows Atlanta nail salon customers and staff ignore would-be robber's demands for cash",
    "Ed Araquel / Ed Araquel/Lionsgate",
    "How ‘Joy Ride’ centers Asian women’s desire in a refreshing way",
    "Donations pour in for Asian American-owned NYC bookstore decimated by fire",
    "Do Not Sell My Personal Information"
]