[
    "DEVELOPING: At least 3 dead and dozens injured after Texas town hit by tornado",
    "3 dead and dozens injured after tornado hits Texas city",
    "A March tornado in Mississippi laid bare a grim reality: Many had no hope of finding safety",
    "Margaret Small via APvia Facebook",
    "Indictment accuses Pentagon leak suspect Jack Teixeira of mishandling classified documents",
    "Eric Thayer / Getty Images file",
    "Conservative Justice Gorsuch echoes 'woke' historians in railing against historical injustices",
    "Supreme Court delivers win for Native American tribes in adoption case",
    "David Paul / Bloomberg via Getty Images file",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Reddit communities go private to protest pricing plan for apps",
    "Eva Marie Uzcategui / AFP via Getty Images file",
    "Faulty design may have doomed Surfside, Florida, tower long before collapse, investigators say",
    "February 2022: Surfside collapse exposed an overlooked threat: Saltwater rising from underground",
    "Andrew Caballero-Reynolds / AFP - Getty Images file",
    "House Republicans introduce their own student loan debt plan",
    "Suarez touts record as Miami mayor in first speech after launching long-shot presidential bid",
    "Getty Images / iStockphoto",
    "U.S. government says several agencies hacked as part of broader cyberattack",
    "'Stop pussyfooting around': Ron DeSantis questions why Gavin Newsom won’t challenge Biden",
    "Yuki Iwamura / Bloomberg via Getty Images file",
    "Second E. Jean Carroll defamation trial against Trump set for January",
    "Biden announces pledge by ticket sales giants to eliminate hidden fees and show full costs upfront",
    "Texas representative is first Black female Democrat to play in Congressional Baseball Game",
    "Key Republican deals a blow to House Democrats’ new push for tougher gun laws",
    "Mike Ehrmann / Getty Images",
    "Conor McGregor denies allegation he sexually assaulted woman at Game 4 of NBA finals",
    "Arapahoe County Sheriff's Office",
    "Colorado surgeon guilty of manslaughter in teen patient's death after breast augmentation",
    "Frederic J. Brown / AFP - Getty Images file",
    "FDA panel recommends updating Covid boosters for the fall",
    "American couple found dead in Mexico hotel room died of carbon monoxide poisoning, family says",
    "Michigan woman faces life sentence after she threw lye at father, causing fatal injuries",
    "Colorado mother faces murder charges in death of 2-month-old son",
    "Russia will lose the war if Ukraine's counteroffensive succeeds, Zelenskyy says",
    "Aterstall Vatmarker via AFP - Getty Images",
    "Climate protesters throw paint and glue at Monet painting in Swedish museum",
    "Nirmesh Vadera / AFP - Getty Images",
    "15 people dead after bus and semi-truck collide in Canada",
    "Mexican farmers take over airport; governor tells them to take over U.S. warehouses, instead",
    "Two-time Oscar winner and lawmaker Glenda Jackson dies at 87",
    "How Modelo Especial became America's No. 1 beer amid Bud Light's rapid decline",
    "More than 4,000 ads for Ozempic-style drugs were found running on Instagram and Facebook",
    "Jonathan Ferrey / LIV Golf via Getty Images file",
    "Sen. Wyden launches probe into PGA Tour's merger with Saudi-funded LIV Golf",
    "Mediterranean restaurant chain Cava's stock soars as much as 117% in market debut",
    "Twitter is the 'most dangerous' major social media platform for LGBTQ users, GLAAD says",
    "Women, people of color make solid gains in corporate board representation",
    "Kevin Mazur / Getty Images for Parkwood file",
    "Beyoncé shows blamed for fueling inflation in Sweden",
    "Amy Sussman / Getty Images file",
    "Al Pacino, 83, and Noor Alfallah, 29, welcome baby boy Roman Pacino to world",
    "‘Jeopardy’ fans reel as ‘Lord’s Prayer’ question goes unanswered",
    "Musician Jesse Malin paralyzed from waist down after rare spinal stroke",
    "Ke Huy Quan surprises Harrison Ford on 'Indiana Jones' red carpet",
    "Justine Goode / NBC News; Getty Images",
    "How women broke barriers in the hip-hop fashion industry",
    "50 Years Fly: The Rise, Fall and Revolution of Hip-Hop Fashion",
    "Gloria Estefan to become first Latina inducted into Songwriters Hall of Fame",
    "Southside Blooms bringing flowers and opportunity to Chicago's vacant lots",
    "How to avoid phone scams that use AI-voice cloning",
    "Biden pushes for end to junk fees that catch consumers by surprise",
    "NBC News; Getty Images; Courtesy Libero Copper & Gold",
    "A powerful U.S. political family is linked to copper mining in the Colombian rainforest",
    "Chip Somodevilla / Getty Images",
    "Republicans privately acknowledge Trump's legal woes are serious this time",
    "Tentative deal reached to get UPS drivers air-conditioned trucks ahead of strike threat",
    "Mario Tama / Getty Images file",
    "Inflation is finally slowing down, but consumers are still feeling the sting of high prices",
    "Catherine McQueen / Getty Images",
    "When it comes to obesity, is BMI really the best measure?",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "New results show vaccine could help fight brain cancer",
    "'It's my future': Montana youth undertake one of the world's most high-profile climate trials",
    "Chemical traces offer evidence of the universe's earliest stars",
    "It's already a hot start to what is expected to be a hot summer",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "Miami Mayor Francis Suarez files for 2024 presidential bid",
    "Tennessee Democrats expelled over protests win primaries for their old seats",
    "Court vacates convictions against Black Muslim man whose attorney made racist posts",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images file",
    "Michigan bans hairstyle discrimination in workplaces and schools",
    "David Zalubowski / AP file",
    "Suspect in mass shooting at Colorado gay nightclub is expected to take a plea deal",
    "Tayfun Coskun / Anadolu Agency via Getty Images",
    "Drag artists say all they want is 'basic respect' as attacks against their art form grow",
    "Jonathan Newton / The Washington Post via Getty Images file",
    "Johns Hopkins pulls 'lesbian' definition after uproar over use of 'non-men' instead of 'women'",
    "First Muslim woman confirmed as a U.S. federal judge",
    "Charley Gallay / Getty Images for Disney",
    "Courtesy of Vhey Preexa via Stable Diffusion",
    "Why this tool is reducing Asian influence in AI-generated art",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "The best at-home pizza ovens of 2023",
    "How to choose the best sunscreen",
    "The best cleaning tools to dust your home",
    "9 best teeth whitening treatments",
    "Do Not Sell My Personal Information"
]