[
    "Rob Edgcumbe / Stocktrek Images via AP file",
    "U.S. and allies plan to provide Ukrainian pilots with F-16 fighter jets",
    "Russia hit with new sanctions as Zelenskyy is set to join world leaders at G-7 summit in Japan",
    "Biden heads for a summit in Japan, leaving a looming crisis at home",
    "Utah mom accused of poisoning husband took out $2 million in life insurance policies on him",
    "Utah mom tried to poison husband before, family says",
    "Woman who authored children's book on grief after husband's death charged with murdering him",
    "Ting Shen / Bloomberg via Getty Images",
    "As clock ticks down on debt default, GOP negotiators 'press pause'",
    "Conservatives push for border bill to be added to debt ceiling negotiations",
    "CDC reports another death linked to recalled eyedrops, as cases of bacterial infection rise to 81",
    "Doctors expect more infections from eyedrops that may be contaminated with deadly bacteria",
    "Why it took doctors months to diagnose a woman's eye infection caused by contaminated eyedrops",
    "Joe Raedle / Getty Images file",
    "D.C. police lieutenant indicted on charge of tipping off Proud Boy Enrique Tarrio about arrest",
    "GOP witnesses undermined Jan. 6 cases with conspiracy theories, FBI says",
    "Charlotte Fire Department via Twitter",
    "Two construction workers missing after five-alarm blaze in North Carolina",
    "Fatal engine plant shooting in Ohio stemmed from a feud over a woman, police say",
    "Alex Powers / Albany Democrat-Herald via AP",
    "Seven people killed and others hurt in multi-vehicle crash in Oregon",
    "University of Louisiana at Lafayette via Facebook",
    "University of Louisiana-Lafayette champion water-skier dies 'suddenly' at 18",
    "Michigan 13-year-old who used a slingshot to save his  sister says he 'was just lucky'",
    "Georgia prosecutor indicates charges in Trump election probe could come in early August",
    "Louisiana Republican defends physically removing activist from news conference",
    "Robert F. Kennedy Jr. names Dennis Kucinich as 2024 campaign manager",
    "Disney scraps plan for new Florida campus as DeSantis feud heats up",
    "Rep. Marjorie Taylor Greene introduces articles of impeachment against Biden",
    "Xinhua News Agency via Getty Images file",
    "Top U.S. and China commerce officials to hold rare trade talks next week",
    "Saudi Press Agency  / Saudi Press Agency via AP",
    "Syria's Assad receives warm welcome at Arab summit after years of isolation",
    "Police taser a 95-year-old woman with dementia in Australia",
    "Andy Rourke, The Smiths bass player, dies at 59",
    "A costly joke: China slaps comedy firm with $2 million fine for military gag",
    "Target is recalling 5 million scented candles because their glass jars can break",
    "Justin Sullivan / Getty Images file",
    "Hyundai and Kia agree to $200 million settlement with customers over car thefts",
    "Monica Schipper / Getty Images file",
    "YouTuber and VidCon co-founder Hank Green shares cancer diagnosis",
    "Twitter accuses Microsoft of misusing its data, foreshadowing a fight over AI",
    "JPMorgan seeks files from Manhattan DA in Jeffrey Epstein lawsuits",
    "Should parents charge adult kids rent? Inside the family debate",
    "The No. 1 beach in the US is…",
    "Home prices see largest dip in a decade",
    "'Felt like Christmas:' San Diego siblings meet for the first time",
    "Justine Goode / NBC News / Getty Images",
    "Why you gotta be so mean? Rude concertgoer behavior is ruining the fun for some fans",
    "Chandan Khanna / AFP - Getty Images file",
    "In Florida, agricultural workers are fearful and brace for changes under new immigration law",
    "Most endangered U.S. historic sites include two Chinatowns",
    "Jordan Vonderhaar for NBC News",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "Valentyn Ogirenko / Reuters via Redux",
    "Russian scientists face treason charges as 'unstoppable' missiles they worked on are shot down",
    "Atlantic Productions / Magellan",
    "First full-size scan reveals Titanic wreck as never seen before",
    "Inside ChatGPT: How AI chatbots work",
    "New York City public schools remove ChatGPT ban",
    "Trying to make sense of artificial intelligence? Here's your guide",
    "Joseph Prezioso / AFP via Getty Images",
    "States with abortion bans could drive away young doctors, survey finds",
    "Spencer Platt / Getty Images file",
    "Woman who refused tuberculosis treatment is not in custody 2 months after arrest warrant issued",
    "Couples 55 and older will be able to contribute more than $10,000 to health savings accounts",
    "1 in 5 older adults skipped or delayed medications last year because of cost",
    "Icon and Image / Getty Images file",
    "Jamie McCarthy / Getty Images for PEN America",
    "Salman Rushdie honored at PEN America gala, his first in-person appearance since stabbing",
    "Fans upset by death of Marvel's first Muslim superhero",
    "Government of Alberta Fire Service/The Canadian Press via AP",
    "Wildfires rip across Canada as heat wave smashes temperature records",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Scientists announce rough draft of human pangenome",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "8-year-old girl dies in U.S. Border Patrol custody in Texas",
    "Jeff Neumann / Amazon Freevee",
    "A Latino high schooler's hilarious coming of age inspires new streaming comedy 'Primo'",
    "Most U.S. Latino history is left out of high school textbooks, study finds",
    "Racist threat against Black students at California high school evokes fear in parents",
    "Missouri teacher who used racial slur resigns; student who taped him suspended",
    "Raymond Boyd / Getty Images file",
    "Tupac Shakur to be honored with a street name in California",
    "Scott Olson / Getty Images",
    "Man who witnessed police murder of George Floyd sues Minneapolis over officers’ actions",
    "Miguel Sotomayor / Getty Images",
    "Trans girl is told not to wear dress to Mississippi graduation, lawsuit says",
    "Daniel Knighton / Getty Images file",
    "LA Pride drops out of Dodgers' Pride Night after the team disinvites drag troupe",
    "San Francisco to name first-in-nation drag laureate",
    "Penguin Random House and Florida parents sue school district over book bans",
    "An ancient writing system from the Philippines makes an unlikely comeback",
    "30 best new products so far this May",
    "5 best luggage tags for travel",
    "Our essential guide to grooming your dog at home",
    "The best early Memorial Day sales to shop now",
    "7 best lightweight luggage options",
    "aldomurillo / Getty Images",
    "The best standing desks, according to ergonomic experts",
    "9 ways to treat sunburns at home",
    "16 relaxation products Select staffers swear by",
    "Sergey Mironov / Getty Images",
    "6 best travel steamers for your next trip",
    "5 best packing cubes for travel",
    "Do Not Sell My Personal Information"
]