[
    "Ukraine's Prosecutor General Office via AP",
    "Why the destruction of Ukraine's Kakhovka dam could be so serious",
    "Live Updates / At least 16,000 people have fled their homes after dam destruction, U.N. chief says",
    "Ukraine accuses Russia of blowing up major dam",
    "PGA and Saudi-backed LIV merge in stunning end to bitter golf rivalry",
    "Wiktor Szymanowicz / Anadolu Agency via Getty Images",
    "Prince Harry says tabloids have ‘blood on their hands’ in historic testimony",
    "Robyn Beck / AFP - Getty Images",
    "Oregon breakaway effort is down to just 8 votes, deepening urban-rural divide",
    "Boppy’s recalled infant lounger is now linked to at least 10 deaths",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "Francis Chung / POLITICO via AP file",
    "Rep. Jim Jordan demands DOJ memo outlining scope of Trump probe",
    "Federal grand jury in Florida to hear testimony in Trump documents case",
    "Trump's attorneys sat down with special counsel ahead of grand jury meeting",
    "NBC News; Washington Post; AFP via Getty Images",
    "GOP presidential field gains candidates who are direct rebukes to Trump",
    "Chris Goodney / Bloomberg via Getty Images file",
    "Billionaire Harlan Crow's lawyer agrees to speak with Senate panel probing Clarence Thomas gifts",
    "Robert F. Bukaty / AP file",
    "Maine election officials say No Labels may be misleading voters in its third-party push",
    "George Santos' lawyer asks to keep identities of those who secured U.S. rep's $500,000 bond sealed",
    "Rep. James Comer to start contempt proceedings against FBI Director Wray on Thursday",
    "Cheney Orr / AFP via Getty Images file",
    "Atlanta lawmakers approve funds for police training center despite fierce opposition",
    "Amy Beth Bennett / Pool via AP file",
    "Commission: Florida judge should be reprimanded for conduct during Parkland school shooting trial",
    "Brett Forrest / SOPA Images/LightRocket via Getty Images file",
    "Eva Marie Uzcategui / Getty Images file",
    "Too many people in NYC are stopped, searched and frisked illegally, federal monitor says",
    "Merck sues U.S. government to halt Medicare drug price negotiation",
    "Lawyer for Natalee Holloway disappearance suspect is challenging his extradition to the U.S.",
    "Mother who served 20 years over deaths of her 4 children is freed after new evidence",
    "A gluten-free food makes a comeback in Cuba — and seeks world recognition",
    "Luis Antonio Rojas / Bloomberg via Getty Images",
    "In Mexico's most populous state, a party ends an almost 100-year dominance",
    "Almost 80 schoolgirls poisoned and hospitalized in Afghanistan, official says",
    "Hundreds of thousands march in Poland anti-government protests to show support for democracy",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Justin Sullivan / Getty Images",
    "Apple’s entry into VR is a ‘watershed moment,’ say top industry execs",
    "SEC sues Coinbase over exchange and staking programs",
    "Last tot standing: Buybuy Baby likely to survive as Bed Bath & Beyond fades into bankruptcy",
    "Alec Tabak / The Daily News via AP file",
    "Cuba Gooding Jr. settles lawsuit that accused him of rape, avoiding N.Y. trial",
    "Shanna Madison / Chicago Tribune via ZUMA Press Wire",
    "Taylor Swift accidentally swallows a bug during Eras Tour concert",
    "Ingo Barth / ullstein bild via Getty Images file",
    "Brazilian Astrud Gilberto, who sang 'The Girl from Ipanema' is dead at 83",
    "Elliot Page reveals secret romance with Kate Mara in 'Pageboy' memoir",
    "Matty Healy has angered fans way before those Ice Spice comments",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Prince Harry takes the stand in suit against British tabloid",
    "Apple unveils headset that blends real and digital world",
    "Video reportedly shows flooding in the town of Nova Kakhovka after dam wall breach",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Calls for woman's arrest grow after the fatal shooting of her neighbor in Florida",
    "Chandan Khanna / AFP - Getty Images file",
    "Trump asks 'How can DOJ possibly charge me' after his lawyers meet with feds",
    "Kentaro Aoyama / AP file/NBC News",
    "Lung cancer deaths cut in half with AstraZeneca pill, large trial finds",
    "Su Bikun / VCG via Getty Images file",
    "To ease cancer drug shortage, FDA will allow imports from China",
    "Is Covid ticking up? Viruses and other bugs could make a summer comeback",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Is 'Latino' the most misunderstood term?",
    "Ron DeSantis attacks Trump on immigration: ‘This is a different guy’ than in 2016",
    "Tayfun Coskun / Anadolu Agency via Getty Images file",
    "Cornel West announces his presidential campaign",
    "Christopher Polk / NBC via Getty Images file",
    "'Abbott Elementary' star calls out 'very dangerous' culture of sexuality speculation",
    "Jeff Greenberg / Universal Images Group via Getty Images",
    "Black Florida students are suing the state over less funding for their HBCU",
    "Alejandro Alvarez / Sipa USA via AP",
    "Nation's largest LGBTQ advocacy group declares state of emergency",
    "Police investigate alleged pellet gun shooting outside Kansas City LGBTQ bar",
    "Anna Shay, ‘Bling Empire’ star, dies at 62",
    "Karl Mondon / MediaNews Group via Getty Images",
    "California allots $5 million to help displaced Half Moon Bay shooting victims",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "15 Amazon tools that'll make your garden flourish",
    "6 best instant cameras of 2023",
    "What experts want you to know about dog food",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "Do Not Sell My Personal Information"
]