[
    "GoFundMe/LinkedIn/via KXAS",
    "Mall shooting victims include a 3-year-old boy and his parents",
    "Texas mall shooter ranted against Jews, women and racial minorities on apparent social media page",
    "Graphic videos spread on Twitter following Texas shooting and SUV incident",
    "Kirill Kudryavtsev / AFP - Getty Images",
    "Russia holds scaled-back Victory Day celebrations under shadow of Ukraine war",
    "Russian mercenary chief 'promised ammunition' after threatening Bakhmut retreat",
    "Situation around Europe's largest nuclear power plant is 'potentially dangerous,' watchdog warns",
    "Stressed out and burned out: Nurses demand change",
    "'Indentured servitude': Nurses hit with hefty debt when trying to leave hospitals",
    "Drew Angerer / Getty Images file",
    "Trump prohibited from posting evidence in hush money case to social media, judge rules",
    "U.S. District Court for Washington, D.C.",
    "DOJ charges 'Pink Beret' Jan. 6 rioter IDed after an ex spotted her in a viral FBI tweet",
    "Patrick T. Fallon / AFP - Getty Images file",
    "Texas House panel advances bill to raise age to buy semi-automatic rifles",
    "Nathan Howard / Bloomberg via Getty Images file",
    "McCarthy approaches Biden debt ceiling talks with the economy — and his job — at stake",
    "Stephanie Keith / Getty Images",
    "E. Jean Carroll was 'exactly' Donald Trump's type, her lawyer says in closing arguments",
    "Fetterman shares experience battling depression and seeking treatment in emotional interview",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Driver who rammed SUV into migrants in Texas is charged with manslaughter",
    "Courtesy of Mills & Edwards LLP",
    "Jordan Neely's family lashes out at Marine who put him in deadly chokehold on subway",
    "Hurley School District via Facebook",
    "2nd grader who vanished while camping in Michigan is found safe after he sheltered under a log",
    "KRDO-TV / The Gazette via AP, Pool, file",
    "Colorado woman found guilty of killing 11-year-old stepson",
    "West Virginia basketball coach Bob Huggins apologizes for homophobic slur",
    "Virginia boy, 17, dies after getting buried by several feet of sand in North Carolina",
    "Second escaped Virginia inmate is captured after a week on the run",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok ‘investigator’ faces fallout after claiming to crack a serial killer case",
    "Georgijevic / Getty Images",
    "Leila Register / DawangLeila Register / NBC News; HoliCHIC; Dawang",
    "‘Little Richard: I Am Everything’ depicts the star’s lifelong struggle with sexuality and religion",
    "The chronically online third culture is redefining Asian America",
    "Morteza Nikoubazl / NurPhoto via Getty Images",
    "Iran hangs 2 in rare blasphemy case as executions surge",
    "Hector Retamal / AFP - Getty Images",
    "China says it's imperative to stabilize U.S. relations",
    "Prince William invokes late queen in tribute to King Charles at coronation concert",
    "At least 22 dead as tourist boat capsizes in southern India",
    "Tennessee boy becomes author at age four",
    "Floodwaters drive new gold rush in California",
    "California closer to possibly paying descendants of enslaved people in reparations",
    "Alex Murdaugh admits to falsifying cause of housekeeper’s fatal fall",
    "Herika Martinez  / AFP - Getty Images",
    "Everything you need to know about Title 42 ahead of its end date",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "David Paul Morris / Bloomberg via Getty Images file",
    "A summer kitchen staple could be in short supply and cost more after record rainfall in California",
    "Leila Register / Getty Images",
    "Black Americans say white vigilantism played a role in Jordan Neely's homicide",
    "Texas mall shooting victims include 3-year-old boy and his parents",
    "Johannes Eisele / AFP via Getty Images file",
    "annual shareholder meeting",
    "Warren Buffett says bank runs would have been 'catastrophic' without government intervention",
    "ChatGPT is powered by these contractors making $15 an hour",
    "Debt limit debate endangers already fragile U.S. economic outlook",
    "Paul Bersebach / Orange County Register via Getty Images file",
    "Rise of mpox cases in Chicago raises concern about possible summer spread",
    "FDA weighing first over-the-counter birth control pill",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Mario Tama / Getty Images file",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "In a galactic first, a star is seen swallowing a planet in one gulp",
    "Manchin introduces bill to speed energy permitting",
    "Kevin Dietsch / Getty Images file",
    "Mayorkas says Biden administration has targeted smugglers and is ready at the border",
    "Biden shifts southern border strategy — without congressional action behind him",
    "Shortage of Black sperm donors across U.S. impacts family planning",
    "California reparations panel OKs recommendations on state apology, payments",
    "David Clumpner Photography",
    "Censured Montana Rep. Zooey Zephyr proposes to girlfriend at queer prom",
    "Russell Hons / Cal Sport Media via AP file",
    "North Dakota governor OKs law to ignore transgender pronouns",
    "Brandon Bell / Getty Images",
    "Texas AG to investigate Austin children’s hospital over transgender care for minors",
    "Leila Register / NBC News / Getty Images",
    "Gay fans who want to visit Disney say DeSantis' policies loom over 'the happiest place on earth'",
    "Angela Weiss / AFP via Getty Images file",
    "Tim Graham Photo Library / via Getty Images file",
    "South Asians watch another monarch ascend the throne that devastated their families",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "29 best Mother's Day gifts on Amazon",
    "15 top-rated Amazon coffee accessories",
    "8-top rated juicers to add to your kitchen setup",
    "Oura; Le Creuset; Solo Stove",
    "7  best sales to shop this week",
    "Gift these flowers and plants for Mother's Day",
    "9 best new products so far this May",
    "Top-rated carry-on luggage you need before summer travel season",
    "Amazon; Brooks Running; Spanx; NBC",
    "Select Wellness Awards: Shop the winners as seen on TODAY",
    "Do Not Sell My Personal Information"
]