[
    "Anna Moneymaker / Getty Images",
    "New House bill would block pay for members of Congress if the U.S. defaults",
    "Some Senate Democrats urge Biden to prepare to invoke the 14th Amendment to tackle the debt limit",
    "DOJ says classified docs leak suspect posted about mass shootings and had an arsenal of weapons",
    "Rick Friedman / Corbis via Getty Images",
    "Deutsche Bank agrees to pay $75 million to Jeffrey Epstein victims to settle lawsuit",
    "Musk to be subpoenaed for documents in Virgin Islands' Epstein lawsuit against JPMorgan",
    "Chung Sung-Jun / Getty Images file",
    "Government of Alberta Fire Service/The Canadian Press via AP",
    "Wildfires rip across Canada as temperature records smashed by heat wave",
    "Parents hope to keep Tennessee school shooter's 'dangerous and harmful' writings secret",
    "Adria Malcolm for NBC News",
    "8-year-old girl dies in U.S. Border Patrol custody in Texas",
    "Selcuk Acar / Anadolu Agency via Getty Images",
    "Prince Harry and Meghan say they were in a car chase with paparazzi; the NYPD is more muted",
    "New Mexico shooter used three weapons, including AR-15, and left a note",
    "New York hospital places employee on leave in Citi Bike viral video incident",
    "Idaho college students slaying suspect Bryan Kohberger indicted by grand jury",
    "Tolga Akmen / AFP via Getty Images file",
    "Montana becomes first state to ban TikTok after governor signs bill into law",
    "Phil Walter / Getty Images",
    "Appeals court appears skeptical of keeping full access to abortion pill mifepristone",
    "Stephen Maturen / Getty Images",
    "Secret Service director 'livid' over apparent security lapse at national security adviser's home",
    "Demetrius Freeman / The Washington Post via Getty Images file",
    "House GOP refers George Santos expulsion resolution to Ethics panel",
    "Members of Congress aim to revive federal reparations push",
    "Supreme Court rejects challenge to Illinois assault weapons ban",
    "Atlantic Productions / Magellan",
    "First full-size scan reveals Titanic wreck as never seen before",
    "Ukrainian Foreign Ministry / AFP - Getty Images",
    "Visiting Ukraine, China's envoy urged all sides to create space for peace talks",
    "Israel deploys heavy police presence ahead of contentious Jerusalem march",
    "Retired U.S. Special Forces soldier killed in Ukraine said he felt 'compelled to come help'",
    "A Mexican woman who killed the man who raped her was sentenced to 6 years in prison",
    "SAG-AFTRA calls for strike authorization vote ahead of studio talks",
    "Spencer Platt / Getty Images file",
    "Target wrestles with pullback in spending and theft that may cost it more than $1B this year",
    "David Paul Morris / Bloomberg via Getty Images file",
    "DOJ charges former Apple engineer with theft of autonomous car tech for China",
    "Elizabeth Holmes loses bid to avoid prison and is ordered to pay $452M in restitution",
    "Inside ChatGPT: How AI chatbots work",
    "Conflicting reports emerge after Harry and Meghan car chase",
    "Demi Lovato opens up about her struggles with mental health",
    "13-year-old rescues sister from kidnapping using slingshot",
    "How A.I. is helping doctors detect cancer",
    "Pompeii Archaeological Park / AFP - Getty Images",
    "Pompeii's victims weren't killed only by a volcanic eruption, newly unearthed skeletons show",
    "Jordan Vonderhaar for NBC News",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "Irfan Khan / Los Angeles Times via Getty Images",
    "Black WGA strikers say they've helped streamers boost diversity — and wound up worse off",
    "Guido Mieth / Getty Images",
    "Chronic pain is more common than diabetes or depression. Better treatments are emerging.",
    "Joseph Prezioso / Anadolu Agency via Getty Images file",
    "2 people banned from Disney World after fight over photo attempt",
    "Justine Goode / NBC News / Getty Images",
    "Trying to make sense of artificial intelligence? Here's your guide",
    "An AI glossary: The words and terms to know about the booming industry",
    "Federal appeals court deciding future of abortion pill mifepristone",
    "Alex Kormann / Star Tribune via Getty Images file",
    "FDA panel to vote on the first RSV vaccine for infants, administered to pregnant mothers",
    "Peter Dazeley / Getty Images",
    "FDA approves drug to treat hot flashes and night sweats",
    "High mortality rate among Black Americans has caused 1.63 million excess deaths over two decades",
    "Jeff Neumann / Amazon Freevee",
    "A Latino high schooler's hilarious coming of age inspires new streaming comedy 'Primo'",
    "Man indicted in theft of ruby slippers worn by Judy Garland in 'The Wizard of Oz'",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Scientists announce rough draft of human pangenome",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "Most U.S. Latino history is left out of high school textbooks, study finds",
    "Tom Williams / CQ-Roll Call via AP file",
    "Amy Sussman / Getty Images file",
    "NAACP warns Congress against debt ceiling deal that would 'harm' Black communities",
    "Black Californians hope state reparations don’t become another broken promise",
    "Penguin Random House and Florida parents sue school district over book bans",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "DeSantis signs 'Don't Say Gay' expansion and gender-affirming care ban",
    "Missouri terminates emergency rule to limit trans care for minors and some adults",
    "Craig Barritt / Getty Images for GLSEN",
    "Chasten Buttigieg worries his new LGBTQ children's book could be banned",
    "Starbucks India via YouTube",
    "Starbucks India ad starring trans model goes viral with mixed reactions",
    "South Korean court orders agency to compensate Asian American adoptee",
    "A dedicated generation has changed the way Asian food is consumed",
    "9 ways to treat sunburns at home",
    "The best early Memorial Day sales to shop now",
    "16 relaxation products Select staffers swear by",
    "Sergey Mironov / Getty Images",
    "6 best travel steamers for your next trip",
    "5 best packing cubes for travel",
    "The Doona stroller is a must-have for new parents",
    "16 products that will upgrade your braid care routine",
    "15 top-rated Amazon fitness accessories",
    "Courtesy Vivian Le; Zoe Malin; Shari Uyehara",
    "Select staffers' favorite pet products",
    "6 top-rated luggage sets for your next trip",
    "Do Not Sell My Personal Information"
]