[
    "DEVELOPING: Trump arrives at federal courthouse in Miami to be arraigned",
    "Live / Special coverage of Trump's arraignment in classified documents probe",
    "Just now8m agoHow Trump’s indictment in classified docs case could affect 2024 run",
    "Just now8m agoLake is in the crowd outside the courthouse",
    "Just now13m agoBacon: 'It’s obvious what the president did was wrong'",
    "Just now20m agoTrump posts to Truth Social that he is en route to courthouse",
    "Trump posts on Truth Social while traveling to arraignment",
    "Brendan Smialowski  / AFP - Getty Images",
    "The investigation into Trump's handling of classified documents",
    "Robert Nickelsberg / Getty Images fileApu Gomes / AFP via Getty Images file",
    "Inflation cooled to 4% in May — the lowest reading in two years",
    "See how the prices have changed for popular grocery items",
    "Tracker: Here's where prices have risen most — and what's behind the persistent inflation",
    "Kevin Dietsch / Getty Images file",
    "Garth Brooks addresses 'stir' over saying his bar will serve Bud Light",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Quintana Beach County Park / via Facebook",
    "Thousands of dead fish wash up on Texas coast, beachgoers urged to steer clear",
    "9 people injured in Denver shooting amid Nuggets celebrations, police say",
    "New York City police commissioner Keechant Sewell resigns after 18 months",
    "California man drowns on honeymoon in Hawaii while thieves steal belongings",
    "Michigan 2-year-old dies in accidental shooting after finding 'unsecured firearm'",
    "Ball lost in the twilight ends in miracle Stanford win to clinch College World Series spot",
    "22 U.S. service members injured in helicopter incident in Syria",
    "Woman who was declared dead bangs on coffin during her wake",
    "Leader of Belarus says he wouldn't hesitate to use Russian nuclear weapons to repel aggression",
    "Leila Register / NBC News; Getty Images",
    "For China's LGBTQ community, safe spaces are becoming harder to find",
    "More than 100 people killed after boat returning from wedding capsizes in Nigeria",
    "3 found dead and 3 hit by van in linked U.K. incidents, police say",
    "The German curator on a mission to return heirlooms lost in the Holocaust to Jewish families",
    "Brazil sees increase in neo-Nazi groups amid more conservatism",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images file",
    "Nevada 'fake electors' appear before D.C. grand jury investigating Jan. 6",
    "U.S. government buys data on Americans with little oversight, report finds",
    "Scott Olson / Getty Images",
    "Few Americans know Sen. Tim Scott, but some Democrats see him as a tough election opponent",
    "White House press secretary violated Hatch Act, government watchdog says",
    "McCarthy strikes temporary deal with GOP rebels, ending blockade on House floor",
    "The Beatles will release a new and 'final record' this year — with a little help from AI",
    "'Never Have I Ever' fans say goodbye to a South Indian American milestone",
    "Virginia Sherwood / NBCU Photo Bank via Getty Images file",
    "Actor Treat Williams dies at 71 after motorcycle accident",
    "Olympic sprinter Tori Bowie died from childbirth complications, autopsy finds",
    "'Wheel of Fortune' host Pat Sajak announces he will retire next year",
    "‘Wheel of Fortune’ host Pat Sajak to retire after 41 seasons",
    "Drinking alcohol in moderation may benefit heart health, study finds",
    "Utah mother accused of fatally poisoning husband denied bail",
    "Justine Goode / NBC News; Getty Images",
    "Deepfake porn of TikTok stars thrives on Twitter even though it breaks the platform's rules",
    "Stefan Wermuth / Bloomberg via Getty Images file",
    "Is this finally the end for Boris Johnson?",
    "Allie Sullberg for NBC News",
    "Experimental vaccine shows promise in delaying the return of aggressive brain tumor",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "How the Florida judge overseeing Trump's trial could hobble the Justice Department's case",
    "Man found dead in I-95 truck fire wreckage in Philadelphia identified by family",
    "Abraham Pineda / AFP via Getty Images file",
    "Fungal meningitis outbreak in U.S. kills 4 as CDC tries to track patients of clinics in Mexico",
    "Rich Schultz / Getty Images file",
    "Video captures moment foul ball hits Yankees broadcaster John Sterling in the head",
    "What happened to the common cold? Post-Covid, it feels like every sniffle needs a name",
    "When should you come out of Covid isolation? Experts weigh in.",
    "Win McNamee / Getty Images file",
    "Lawmaker demands more information about PGA Tour and LIV Golf merger",
    "Tracker: Here's where prices have risen most — and what's behind the soaring inflation",
    "It's already a hot start to what is expected to be a hot summer",
    "Ezra Acayan / Getty Images file",
    "How New York's day of smoke laid bare the realities of climate catastrophe",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Claudio Cruz / AFP - Getty Images",
    "Mexico City mayor to step down to pursue historic bid for presidency",
    "Jeenah Moon / Bloomberg via Getty Images file",
    "NYC mandates minimum wage for app-based delivery workers",
    "Gareth Cattermole / Getty Images file",
    "'Black Panther' actor Tenoch Huerta denies abuse allegations by musician María Elena Ríos",
    "Mike Coppola / Getty Images for Turner file",
    "Joseph Fiennes says playing Michael Jackson was the 'wrong decision' and a 'bad mistake'",
    "Lucy Garrett / Getty Images file",
    "California skate park is named for Black motorist fatally beaten in police traffic stop",
    "Mike Ehrmann / Getty Images",
    "Lil Wayne says he can't remember his own songs anymore due to memory loss",
    "Rogelio V. Solis / AP file",
    "Mississippi civil rights lawyer arrested recording traffic stop, attorney says",
    "Anna Moneymaker / Getty Images file",
    "Most Americans oppose including trans athletes in sports, poll finds",
    "Councilman Erik Bottcher via Twitter",
    "Pride flags vandalized at Stonewall National Monument",
    "Joe Raedle / Getty Images file",
    "Pulse nightclub victims remembered on 7th anniversary of massacre",
    "Kena Betancur / AFP via Getty Images file",
    "Most Asian Americans favor affirmative action, new Pew study shows",
    "How to choose the best sunscreen",
    "The best cleaning tools to dust your home",
    "9 best teeth whitening treatments",
    "10 best face moisturizers for dry skin",
    "Top-rated portable ACs under $400",
    "45+ AAPI-owned food and beverage brands to shop right now",
    "11 expert-approved gas grills to shop",
    "7 best sales to shop this weekend",
    "How to tell if your sunscreen is reef safe",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "Do Not Sell My Personal Information"
]