[
    "Russia hit with new sanctions as Zelenskyy is set to join world leaders at summit in Japan",
    "Biden heads for a summit in Japan, leaving a looming crisis at home",
    "Russian scientists face treason charges as 'unstoppable' missiles they worked on are shot down",
    "GOP witnesses undermined Jan. 6 cases with conspiracy theories, FBI says",
    "Trump told town hall he would pardon a 'large portion' of Jan. 6 rioters",
    "Haley tells Iowa voters that Jan. 6 lawbreakers 'should pay the price'",
    "How a family survived a 250-foot plunge off a California cliff in a Tesla",
    "Michigan 13-year-old who used a slingshot to save his  sister says he ‘was just lucky’",
    "New Mexico teen gunman died in hail of police gunfire, likely his final wish, chief says",
    "In Florida, agricultural workers are fearful and brace for changes under new immigration law",
    "Missouri high school student suspended 3 days after recording teacher using racial slur in class",
    "Groom whose wife was killed in wedding night crash sues driver and bars she allegedly visited",
    "Louisiana Republican defends physically removing activist from news conference",
    "Spencer Platt / Getty Images file",
    "JPMorgan seeks files from Manhattan DA in Jeffrey Epstein lawsuits",
    "Disney scraps plan for new Florida campus as DeSantis feud heats up",
    "Kent Nishimura / Los Angeles Times via Getty Images",
    "Sen. Dianne Feinstein suffered previously undisclosed complications from shingles",
    "Rep. Marjorie Taylor Greene introduces articles of impeachment against Biden",
    "House Republicans ask Pentagon for more info on 2021 Kabul bombing that killed 13 Americans",
    "The debt ceiling debate could put health insurance in jeopardy for millions",
    "Joseph Prezioso / AFP via Getty Images",
    "States with abortion bans could drive away young doctors, survey finds",
    "Woman who refused tuberculosis treatment is not in custody 2 months after arrest warrant issued",
    "Alex Kormann / Star Tribune via Getty Images file",
    "FDA panel recommends the first shot to prevent RSV in infants by vaccinating pregnant mothers",
    "1 in 5 older adults skipped or delayed medications last year because of cost",
    "FDA approves drug to treat hot flashes and night sweats",
    "Israeli crowds chant racist slogans and taunt Palestinians during contentious Jerusalem march",
    "Government of Alberta Fire Service/The Canadian Press via AP",
    "Wildfires rip across Canada as heat wave smashes temperature records",
    "Olivier Barge / Globalkites Project",
    "Desert monoliths reveal oldest blueprints for human-made megastructures",
    "Prince Harry and Meghan were 'shaken up' by paparazzi chase, security chief says",
    "Devastating floods leave behind wrecked farms and ruined homes in northern Italy",
    "'Felt like Christmas:' San Diego siblings meet for the first time",
    "Former actress converts buses into schools for kids at southern border",
    "Montana becomes first state to ban TikTok",
    "Peggy Whitson, American with most time in space, set to return to ISS",
    "Anna Moneymaker / Getty Images",
    "Atlantic Productions / Magellan",
    "First full-size scan reveals Titanic wreck as never seen before",
    "Jordan Vonderhaar for NBC News",
    "Uvalde parents remember their children one year after Robb Elementary shooting",
    "Irfan Khan / Los Angeles Times via Getty Images",
    "Black WGA strikers say they've helped streamers boost diversity — and wound up worse off",
    "Valentyn Ogirenko / Reuters via Redux",
    "Justine Goode / NBC News / Getty Images",
    "Inside ChatGPT: How AI chatbots work",
    "New York City public schools remove ChatGPT ban",
    "Trying to make sense of artificial intelligence? Here's your guide",
    "Why you gotta be so mean? Rude concertgoer behavior is ruining the fun for some fans",
    "Lynn Goldsmith; Andy Warhol Foundation for the Visual Arts",
    "Supreme Court rules against Warhol foundation in copyright fight over Prince images",
    "Fans upset by death of Marvel's first Muslim superhero",
    "Tupac Shakur to be honored with a street name in California",
    "A Latino high schooler's hilarious coming of age inspires new streaming comedy 'Primo'",
    "Lev Radin / Pacific Press / LightRocket via Getty Images file",
    "Couples 55 and older will be able to contribute more than $10,000 to health savings accounts",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Scientists announce rough draft of human pangenome",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "8-year-old girl dies in U.S. Border Patrol custody in Texas",
    "Chandan Khanna / AFP - Getty Images file",
    "Jeff Neumann / Amazon Freevee",
    "Most U.S. Latino history is left out of high school textbooks, study finds",
    "Racist threat against Black students at California high school evokes fear in parents",
    "Missouri teacher who used racial slur resigns; student who taped him suspended",
    "Raymond Boyd / Getty Images file",
    "Scott Olson / Getty Images",
    "Man who witnessed police murder of George Floyd sues Minneapolis over officers’ actions",
    "Daniel Knighton / Getty Images file",
    "LA Pride drops out of Dodgers' Pride Night after the team disinvites drag troupe",
    "San Francisco to name first-in-nation drag laureate",
    "Penguin Random House and Florida parents sue school district over book bans",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "DeSantis signs 'Don't Say Gay' expansion and gender-affirming care ban",
    "An ancient writing system from the Philippines makes an unlikely comeback",
    "Most endangered U.S. historic sites include two Chinatowns",
    "Stephen Maturen / Getty Images",
    "30 best new products so far this May",
    "5 best luggage tags for travel",
    "Our essential guide to grooming your dog at home",
    "The best early Memorial Day sales to shop now",
    "7 best lightweight luggage options",
    "aldomurillo / Getty Images",
    "The best standing desks, according to ergonomic experts",
    "9 ways to treat sunburns at home",
    "16 relaxation products Select staffers swear by",
    "Sergey Mironov / Getty Images",
    "6 best travel steamers for your next trip",
    "5 best packing cubes for travel",
    "Do Not Sell My Personal Information"
]