[
    "NYPD investigates another victim in connection to gay bar drugging scheme, police sources say",
    "Following gay bar homicide rulings, one victim's mom feels bittersweet vindication",
    "Final suspect in string of NYC gay bar robberies that left two dead was arrested last month",
    "Getty Images; dpa / picture alliance",
    "Elon Musk to host Ron DeSantis' 2024 announcement",
    "Don't expect Ron DeSantis to go scorched-earth against Trump",
    "Ron DeSantis is learning that not every state wants to be Florida",
    "Trump's N.Y. criminal trial will begin in March 2024, halfway through presidential primaries",
    "Georgia prosecutor indicates charges in Trump election probe could come in early August",
    "Bloomberg via Getty Images file",
    "What China wants to improve relations with U.S. and why it may be a tall order",
    "Beijing hit back at U.S. allies after 'anti-China' G-7 summit",
    "U.S. signs new security pact with Papua New Guinea amid competition with China",
    "Francois Gohier / VW Pics/Universal Images Group via Getty Images file",
    "Orcas sank three boats off the coast of Portugal, but don't call them 'killer' just yet",
    "Meet the 'world's deepest fish,' filmed at bone-crushing depths",
    "Nathan Howard / Bloomberg via Getty Images",
    "'We're not there yet': Debt ceiling talks still stuck on federal spending levels",
    "Nathan Howard / Reuters via Redux",
    "19-year-old arrested on multiple charges after crashing into barriers near the White House",
    "Chris Goodney / Bloomberg via Getty Images file",
    "South Carolina governor faces backlash for remark about hunting Democrats with dogs",
    "Chinese immigrants sue Florida for law banning certain nationals from buying property",
    "Two House Latinas propose bipartisan immigration bill",
    "Catholic clergy sexually abused nearly 2,000 children in Illinois, state finds",
    "Courtesy Rathod Mohammedbhai LLC",
    "via Indian River County Sheriff's Office",
    "Multimillionaire’s alleged plot to escape from a Florida jail and return to France unravels",
    "Alice Mannette / Hutchinson News / USA Today Network",
    "U.S. progress in HIV fight continues to trail many other rich nations",
    "Father and son duo who ran a $20 million lottery fraud scheme sentenced to prison",
    "California man who stopped to help family of ducks cross road is killed by car",
    "Sepia Times / Universal Image Group via Getty Images",
    "Buckingham Palace rejects calls to return remains of 'stolen' prince to Ethiopia",
    "Russia claims it defeated alleged incursion from Ukraine, a day after attack began",
    "Alexander Zemlianichenko / AP file",
    "Evan Gershkovich's pre-trial detention extended for three months",
    "Portuguese police resume search for Madeleine McCann, British child missing since 2007",
    "Cars set on fire in Cardiff as UK police face 'large scale disorder' after road crash",
    "Their small businesses went viral on TikTok for the wrong reasons — now what?",
    "Lionel Hahn / Getty Images file",
    "Jeff Bezos and Lauren Sánchez are engaged",
    "Michael Zagaris / Getty Images file",
    "Oakland A's announcer Glen Kuiper fired after he appeared to use a racial slur on air",
    "Netflix password sharing crackdown rolls out in the U.S.",
    "Rolf Harris, disgraced children's TV entertainer and convicted sex offender, dies at 93",
    "Leila Register / NBC News; Getty Images",
    "Airlines, airports gear up for kickoff of busy summer travel season",
    "United Airlines CEO talks airfares, delays, passenger compensation",
    "Man killed by car after saving ducks crossing street",
    "Thomas Imo / Photothek via Getty Images",
    "How many people are held in solitary confinement in U.S. prisons and jails? Now there’s a number.",
    "Carol Yepes / Getty Images",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Robert Nickelsberg / Getty Images",
    "Three states agree to reduce water usage so the Colorado River doesn't go dry",
    "Allison Joyce / Getty Images",
    "Sen. Tim Scott vows not to overturn the election if he loses",
    "Natalie Behring / Getty Images file",
    "Adam Glanzman / Bloomberg via Getty Images file",
    "BSIP / Universal Images Group via Getty Images",
    "Luke Sharrett / Bloomberg via Getty Images file",
    "60,000 pounds of an explosive chemical lost during rail shipment, officials say",
    "If bird flu starts to spread among people, existing vaccines may be inadequate, experts say",
    "Weight loss drugs can lead to muscle loss, too. Is that a bad thing?",
    "NASA has sights set on Mars with help from a nuclear rocket engine",
    "In the Amazon, Brazilian ecologists try new approach against deforestation and poverty",
    "Libby March / Bloomberg via Getty Images",
    "Fewer Black, Latino and male high schoolers want to go to college, survey finds",
    "Anna Moneymaker / Getty Images",
    "Corey Nickols / Getty Images for IMDb file",
    "Eva Longoria calls out a double standard in Hollywood: White men can fail, but Latinas can't",
    "Fernando Vergara / AP file",
    "Elias Williams for NBC News",
    "A site of segregation in New York City is becoming a landmark",
    "A Black professor has long said what the IRS now admits: The tax system is biased",
    "Fantasia shines in 'The Color Purple' musical remake trailer",
    "Largest U.S. gay rights group issues Florida travel advisory",
    "Richard Shotwell / Invision / AP file",
    "Ming-Na Wen, 'Joy Luck Club' actor, will finally get a star on Hollywood Walk of Fame",
    "Mariah Tauger / Los Angeles Times via Getty Images file",
    "Indian and Filipino restaurants underrepresented in the Asian food scene, new study says",
    "Cheney Orr / AFP via Getty Images file",
    "'American Idol' crowns first Pacific Islander and Hawaii native as winner",
    "Lululemon just launched a new-and-improved trail sneaker",
    "The best early Memorial Day sales to shop now",
    "7 best Amazon gaming week deals",
    "The best sunscreens for oily skin",
    "7 stationery sets to level up your snail mail",
    "11 top-rated Amazon products to help you sleep",
    "The best luggage under $150",
    "Is a vertical climber right for you?",
    "Our predictions for Prime Day 2023",
    "What to shop this Memorial Day",
    "Do Not Sell My Personal Information"
]