[
    "Penguin Random House and Florida parents sue school district over book bans",
    "Over half of 2022's most challenged books have LGBTQ themes",
    "Rodin Eckenroth / Getty Images file",
    "Pride Night celebrations at the ballpark were largely uncontroversial — until now",
    "MLB players say drag troupe invited to Dodgers' Pride Night mocks Christianity",
    "Press Trust of India via AP",
    "Dozens dead and over 350 injured after passenger trains derail in India, officials say",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "White House unveils strategy to combat antisemitism",
    "Drew Angerer / Getty ImagesGraeme Sloan / Sipa via AP file",
    "CIA Director Bill Burns took a secret trip to China in May",
    "How the U.S.-China clash is being felt on campus",
    "Elon Musk leaves China after whirlwind trip filled with praise and politics",
    "Texas cheerleader shot after friend got into wrong car recalls attack and road to recovery",
    "Brothers, ages 8 and 9, fatally shot as they played with kittens in their backyard",
    "Search suspended for 2 missing during tragic family fishing trip in Alaska",
    "Oklahoma man suffers hourslong bee attack, leaving hundreds of stingers in his body",
    "Girl, 4, found dead in Florida canal after wandering away from her family's vacation rental",
    "8-year-old who died in Border Patrol custody was not sent to hospital despite 104.9-degree fever",
    "Eric Thayer / Bloomberg via Getty Images file",
    "DOJ closes Pence classified documents investigation with no charges",
    "Giorgio Viera / AFP - Getty Images file",
    "Porn stars vs. parenthood: Ron DeSantis plays the family card against Trump",
    "Biden to deliver Oval Office speech about bipartisan debt ceiling deal",
    "Bill Clark / CQ-Roll Call, Inc via Getty Images",
    "FBI to show House Oversight leaders document in Biden probe on Monday",
    "The U.S. economy added 339,000 jobs in May, once again beating expectations",
    "Rep. Lisa Blunt Rochester readies run for open Delaware Senate seat",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "Jalisco State Prosecutor's Office",
    "45 bags of human remains found in western Mexico amid search for missing call center workers",
    "Greek Culture Ministry / via AP",
    "Newly discovered stone tools drag dawn of Greek archaeology back by a quarter-million years",
    "Russian mercenaries exploit a war-torn African nation as they lead Putin’s fight in Ukraine",
    "Dominik Bindl / Getty Images",
    "With Al Pacino expecting a child at 83, doctors warn of health risks for babies of older fathers",
    "Women more likely than men to skip or delay medications due to cost, CDC report finds",
    "Janice Carr/Ray Butler, MS / CDC",
    "Woman who refused tuberculosis treatment is in custody months after an arrest warrant was issued",
    "Medicare plans to pay for Alzheimer's drugs that win full FDA approval",
    "What is berberine, the supplement dubbed 'nature's Ozempic' on social media?",
    "Padma Lakshmi announces she’s leaving ‘Top Chef’ after 17 years",
    "Charlie Gillett Collection / Redferns",
    "Cynthia Weil, 'You’ve Lost That Lovin’ Feeling' songwriter and Grammy-winner, dies at 82",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "Former 'Wild 'N Out' star Jacky Oh dies at 32",
    "Greta Lee of 'Past Lives' says truthful storytelling means not serving the white male gaze",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Most Americans say companies should publicly support LGBTQ community, survey finds",
    "Walmart hasn't made changes to LGBTQ-themed merchandise in wake of Target backlash",
    "Firefighters reunite mother deer with fawn who fell down drain",
    "Brad Pitt claims Angelina Jolie unlawfully sold her stake in vineyard",
    "20-year hospital volunteer pays tribute to late son",
    "How to save money when booking summer travel",
    "The stark numbers driving Democratic panic about a third-party 2024 bid",
    "Tony Luong / The New York Times via Redux",
    "This former Navy pilot has a new mission: Normalizing UFO reporting",
    "A dedicated generation has changed the way Asian food is consumed",
    "Justine Goode / NBC News / Getty Images",
    "Doctors call for changes to laws that criminalize drug use during pregnancy",
    "Drew Angerer / Getty Images file",
    "Senate passes debt ceiling bill, averting disaster",
    "Robert F. Bukaty / AP file",
    "Ron DeSantis loses his temper with a reporter: 'Are you blind?'",
    "De Agostini via Getty Images",
    "Georgia gun shop owner shutters store after mass shootings targeting children",
    "Olly Curtis / Future via Getty Images files",
    "YouTube will stop removing false claims about 2020 election fraud",
    "Angus Mordant / Bloomberg via Getty Images file",
    "Chase online banking issue causes double transactions and fees",
    "Anthony Behar / Sipa USA via AP file",
    "Buy Buy Baby draws sale interest in Bed Bath & Beyond bankruptcy",
    "Twitter trust and safety chief Ella Irwin resigns",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Gary Hershorn / Getty Images file",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Immigration backlog has a U.S. asylum-seeker feeling like he's 'imprisoned in a country'",
    "Camilo Freedman / Bloomberg via Getty Images file",
    "El Salvador's Bukele pledges prison for white-collar criminals like the one for gangs",
    "Michael Brochstein / Sipa USA via AP file",
    "32 Mississippi school districts still under federal desegregation orders",
    "Ron DeSantis fires back at NAACP over travel advisory, education and shootings",
    "Residents of this small Alabama town are helping one another through a collective nightmare",
    "Some trans people turn to crowdfunding to leave Florida after anti-LGBTQ laws",
    "Ludovic Marin / Pool / AFP via Getty Images file",
    "Elon Musk’s new Twitter pronoun rule invites bullying, LGBTQ groups say",
    "Roy Rochlin / Getty Images file",
    "Global survey finds 9% of adults identify as LGBTQ",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "The best Memorial Day sales to shop now",
    "Do Not Sell My Personal Information"
]