[
    "TRUMP INDICTED ON 7 CHARGES",
    "Donald Trump's trial is a test of the nation",
    "Just now8m agoPro-Trump protesters outside Pence event called former VP 'a traitor'",
    "Just now18m agoTrump tries to make his criminal indictment about Biden",
    "Just now36m agoSen. Romney says Trump 'brought these charges upon himself'",
    "Just now1h agoHouse GOP whip reacts to Trump indictment after silence last  night",
    "Trump is 'not afraid' of 'ridiculous' indictment, lawyer says",
    "Brendan Smialowski / AFP - Getty Images",
    "Trump tries to make his own criminal indictment about Joe Biden",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Trump allies say Biden is 'weaponizing' DOJ against his chief 2024 rival",
    "Few of Trump's rivals challenge him after the federal indictment",
    "AFP; AP; Bloomberg; Getty Images",
    "New York City had plans to deal with climate change — but they didn't involve wildfire smoke",
    "Another day of unhealthy air forecast in parts of U.S. due to Canadian wildfire smoke",
    "L.E. Baskow / Las Vegas Review-Journal",
    "The Pentagon's ban on drag shows has upset both supporters and opponents",
    "Pentagon leaders cancel drag show at a Nevada Air Force base",
    "Sergei Supinsky / AFP - Getty Images",
    "Iran helping Moscow to build drone factory in Russia, U.S. says",
    "Ukraine sends Western tanks into battle for the first time to bolster counteroffensive",
    "Mines, disease and more: The dangers in Ukraine's floodwaters",
    "Nathan Howard / Bloomberg via Getty Images file",
    "Home foreclosures are rising nationwide, with Florida, California and Texas in the lead",
    "Spring housing demand reheating market as prices increase",
    "Mortgage demand from homebuyers drops to lowest levels in nearly three decades",
    "Joseph Prezioso / AFP via Getty Images file",
    "Ron DeSantis’ top aide organized government staff to solicit campaign cash from lobbyists",
    "Brandon Bell / Getty Images file",
    "Surprise Supreme Court win for Black voters could give Democrats an electoral boost",
    "Dylan Hollingsworth / Bloomberg via Getty Images file",
    "FBI arrests businessman linked to impeachment of Texas AG Ken Paxton",
    "Biden names deputy transportation secretary as new acting FAA chief",
    "Casey White, Alabama inmate who escaped prison with help from jail official, sentenced to life",
    "Los Angeles county DA's office quits Twitter due to barrage of 'vicious' homophobic attacks",
    "Girl, 10, rescued after surviving 24 hours alone in 'rugged' mountains in Washington state",
    "Gun used in Florida neighbor's killing was bought last year after previous dispute, affidavit says",
    "Fred Dufour / AFP via Getty Images file",
    "Thousands evacuated in China’s Tianjin after cracks appear near high-rises",
    "Man mauled to death by tiger shark off Egypt’s Red Sea coast",
    "Russia to deploy tactical nuclear weapons in Belarus in July, Putin says",
    "Child victims of France stabbing attack in critical but stable condition",
    "Golf's PGA Tour and LIV merger is the latest power play by Saudi Arabia",
    "He's Baby Gronk. She's Livvy. He's got drip and she rizzed him up (and we've got it translated)",
    "John Lamparski / Getty Images file",
    "A Tony nominee details his journey from the South Bronx to Broadway",
    "Dan MacMedan / Getty Images",
    "The movie version behind one of our favorite spicy snacks is streaming now",
    "Tom Holland is taking a break from acting after making ‘The Crowded Room’",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "13-year-old shark attack survivor invited to tag sharks",
    "Brides share why they wore their wedding dresses out of the town",
    "NFL legends give rookies advice ahead of new football season",
    "Wrinkles and trouble sleeping are among the strange symptoms poor air quality can cause",
    "Jason Davis / Getty Images file",
    "Alex Kent / Bloomberg via Getty Images",
    "Delivery workers say they don't have a choice but to ignore health guidance about the smoke",
    "Trump indictment live updates: Former president to face charges after classified docs probe",
    "Drew Angerer / Getty Images file",
    "Trump indicted on 7 charges in classified docs probe",
    "White House Covid response coordinator Ashish Jha to step down",
    "Earl S. Cryer / AFP via Getty Images file",
    "Nutrient found in high-protein foods helps slow aging in animals — and maybe humans, too",
    "FDA panel recommends injectable drug to prevent RSV in infants",
    "Experimental drug for marijuana addiction shows promise, small study finds",
    "GM’s electric vehicles will gain access to Tesla’s vast charging network",
    "Angela Weiss / AFP - Getty Images",
    "Nova Scotia Government via AFP - Getty Images",
    "Air quality levels in parts of the U.S. plunge as Canada wildfires rage",
    "Rebecca Blackwell / AP file",
    "Here comes El Niño: It’s early, likely to be big, sloppy and add even more heat to a warming world",
    "125 degrees? Puerto Rico faces 'dangerous situation' due to record-breaking heat",
    "Two California lakes are making comebacks with different results",
    "Courtesy Searchlight Pictures via YouTube",
    "New York City sues state counties over ‘xenophobic’ migrant bans",
    "Joshua Lott / AFP via Getty Images file",
    "Supreme Court backs landmark voting rights law, strikes down Alabama congressional map",
    "2 Connecticut officers fired over treatment of man paralyzed in police van after 2022 arrest",
    "Robyn Beck / AFP - Getty Images",
    "Tupac Shakur’s sister tears up as late rapper gets star on Hollywood Walk of Fame",
    "From ancient Greece to Coney Island, a new book charts the evolution of lesbian love",
    "Australian man sentenced to 9 years in prison for 1988 manslaughter of gay American",
    "Allen J. Schaben / Los Angeles Times via Getty Images",
    "Three arrested at protests outside an L.A. school board meeting about Pride Month",
    "J. Scott Applewhite / AP file",
    "Korean American judicial nominee shares her adoption and immigration journey with Senate committee",
    "19-year-old Ph.D. started community college when he was 7",
    "Dickson Lee / South China Morning Post via Getty Images file",
    "YouTube channel Wong Fu Productions reflects on 20 years of Asian American storytelling",
    "The 12 best toothpastes in 2023, according to dentists",
    "Cabana Life; Ruffle Butts; Athleta",
    "Top-rated UPF swimwear for sun protection",
    "Our predictions for Prime Day 2023",
    "18 best Father's Day gifts on Amazon",
    "What causes rosacea? Derms explain.",
    "11 best women's walking shoes in 2023",
    "The 9 best BBQ smokers for summer 2023",
    "No central air? No problem thanks to these portable ACs.",
    "Casper's new pillow is here — and it's great for hot sleepers",
    "The best disposable face masks to buy now",
    "Do Not Sell My Personal Information"
]