[
    "Biden admin to allow for the release of some migrants into the U.S. with no way to track them",
    "An influx of migrants is already at the border ahead of Title 42 ending",
    "Here are new Biden immigration policies to expect as Title 42 ends",
    "Mandel Ngan / AFP - Getty Images fileMandel Ngan / AFP - Getty Images",
    "George Santos surrenders to face fraud, money laundering and theft of public funds charges",
    "Rep. Santos charged as he faces a number of investigations into his finances and background",
    "Rep. Santos announced re-election bid in New York last month",
    "'He did it and you know it': E. Jean Carroll says she confronted Trump's lawyer after verdict",
    "WATCH: 'This is about getting my name back,' Carroll says on 'TODAY'",
    "Senate GOP suggest Carroll verdict could imperil Trump's 2024 chances",
    "Carolyn Van Houten / The Washington Post via Getty Images file",
    "Consumer price growth falls to below 5% for the first time in two years",
    "Tracker: Here's where prices have risen most — and what's behind the soaring inflation",
    "More Americans are so worried about money, it's hurting their mental health",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "Extreme weather meets reality of poverty to create a tragedy in Mississippi",
    "House Republicans escalate attacks on Biden family, alleging business with foreign nationals",
    "Mike Pence navigates anger from all sides as he inches toward a presidential run",
    "Timothy D. Easley / AP file",
    "Comment on transgender issue roils Kentucky governor's race",
    "Early campaign strategy at play as Biden hits road for first time since launching re-election bid",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "Justin Sullivan / Getty Images file",
    "U.K. man pleads guilty to hack on Twitter accounts of Joe Biden and Elon Musk",
    "Two missing climbers on mountain in Denali National Park most likely fell, officials say",
    "Missing hiker rescued alive from Glacier National Park",
    "Buddy Holly, the petit basset griffon Vendéen, wins Westminster dog show",
    "Simon Maina / AFP - Getty Images file",
    "Aris Messinis / AFP via AP",
    "Arman Soldin, journalist working for AFP news agency, killed in Ukraine",
    "@VictoriaPolice via Twitter",
    "Woman survived on wine and lollipops in the Australian wilderness for 5 days",
    "Palestinian militants launch rocket attacks after Israeli strikes on Gaza",
    "Student's body found in cave after New Zealand hit by floods",
    "Terry Wyatt / WireImage file",
    "Morgan Wallen postpones shows for six weeks due to vocal cord injury",
    "Jamie Schwaberow / Getty Images file",
    "Georgia's championship national team declines White House invitation",
    "Tory Lanez denied new trial in Megan Thee Stallion shooting",
    "Marcia Gay Harden says her kids, who 'are all queer,' inspire her LGBTQ advocacy",
    "Writers strike: What TV shows are being affected",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Widow who wrote book on grief charged with husband’s murder",
    "A look at NASA’s new mission to explore the Earth’s oceans",
    "Mammogram age recommendation lowered from 50 to 40",
    "Beyoncé fans in US buy tickets in Europe amid soaring demand",
    "Michael Ciaglo for NBC News",
    "Fred Dugfour / AFP Pool via Getty Images file",
    "Why leaked spy docs have sent China and Canada's fraught relationship to a new low",
    "Ken Walks via TikTok ; Getty Images",
    "A TikTok 'investigator' faces fallout after claiming to crack a serial killer case",
    "Stressed out and burned out: Younger nurses feel strain of nursing shortage",
    "Rep. George Santos faces federal charges, sources say",
    "Jabin Botsford / The Washington Post via Getty Images",
    "Senate Republicans suggest Carroll verdict could imperil Trump's 2024 chances",
    "Stephen Brashear / AP file",
    "House lawmakers to host bipartisan dinner with OpenAI CEO Sam Altman",
    "Chelsea Stahl / NBC News; Getty Images",
    "See how the prices have changed for popular grocery items",
    "Hackers to test limits of AI technology at Las Vegas event",
    "Tucker Carlson says he'll launch new show on Twitter",
    "Miguel Roberts / The Brownsville Herald via AP file",
    "Screen women for breast cancer at 40, instead of 50, new guidelines say",
    "Hate mosquitoes? Coconut scents could help keep them away, small study suggests",
    "Nurses at HCA hospitals would have owed thousands if they left before 2 years: investigation",
    "Women should get screened for breast cancer at 40 rather than 50, new guidelines say",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Record ocean temps and a predicted El Niño have weather forecasters on watch",
    "Herika Martinez  / AFP - Getty Images",
    "Everything you need to know about Title 42 ahead of its end date",
    "Jeremy Wallace / The Aspen Times via AP file",
    "Colorado expands translation access for parents of special ed students",
    "Focus On Sport / Getty Images",
    "First Latino quarterback to lead team to the Super Bowl dies at 85",
    "Shahar Azran / Getty Images file",
    "Nick Cannon shoots down 'deadbeat dad' label: 'I've been villainized'",
    "Fred Lindinger / United Archives via Getty Images file",
    "Pioneering Black opera singer Grace Bumbry dies at 86",
    "Vivien Killilea / Getty Images file",
    "Richard Dreyfuss says Oscars' new diversity standards 'make me vomit'",
    "Justin Sullivan / Getty Images",
    "Transgender youth sue over Montana gender-affirming care ban",
    "Araya Doheny / Getty Images",
    "Eddie Brady / Getty Images",
    "Missouri school board member resigns and plans to move over anti-LGBTQ bills",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "Biden calls for 'fair deal' for striking Hollywood writers",
    "Angela Weiss / AFP via Getty Images file",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "21 mom-approved Mother's Day gifts",
    "Mother's Day gifts for every kind of mom",
    "Walmart; Cadence; Hey Dewy",
    "21 unique Mother's Day gifts under $150",
    "Best tips and tricks for shopping on eBay",
    "Kara Birnbaum / NBC; Amazon",
    "28 best gifts for Teacher Appreciation Week",
    "Kara Birnbaum for NBC News ; Amazon ; Chanel",
    "How under-eye patches can firm and depuff skin",
    "29 best Mother's Day gifts on Amazon",
    "Do Not Sell My Personal Information"
]