[
    "Russia claims Ukraine launched a major attack in the east",
    "How the U.K. is trying to pressure other nations into arming Ukraine",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "Airman 1st Class Ericka Woolever / U.S. Air Force",
    "Fighter jets scrambled near D.C. to check off-course private plane that ultimately crashed",
    "Loud boom heard after fighter jets scrambled to intercept small plane",
    "Mother who served 20 years over deaths of her 4 children is freed after new evidence",
    "VIDEO: Scientific evidence revealed all children likely died of natural causes",
    "‘Trump too small’ trademark clash to be decided by Supreme Court",
    "Courtesy Warner Bros. Pictures",
    "Mother of slain Idaho student Ethan Chapin says her family won’t attend suspect’s trial",
    "Two teens fatally shot and four injured at party in vacant Missouri home, authorities say",
    "Love County Sheriff's Office",
    "Scuba diver finds live tear gas grenade in Oklahoma lake",
    "Pennsylvania teen fatally shot after he allegedly struck two troopers with car, police say",
    "Daughter, granddaughter charged after 71-year-old Maryland grandmother killed, police say",
    "California investigating whether migrant flight came from Florida",
    "Charlie Neibergall / AP file",
    "Nikki Haley suggests transgender kids are causing suicidal ideation in teenage girls",
    "Jim Watson / AFP - Getty Images",
    "With debt limit deal behind him, Biden returns to 'previously scheduled programming'",
    "Florida Democratic Rep. Maxwell Frost blasts DeSantis with f-bomb onstage during Paramore concert",
    "GOP candidates criticize Trump for praising Kim Jong Un",
    "Mass Communication Specialist 1st Class Andre T. Richard / U.S. Navy via AP",
    "U.S. releases video showing close-call with Chinese warship",
    "U.S. says Iran fast-attack boats ‘harassed’ ship in Strait of Hormuz",
    "Samiullah Popal  / EPA-EFE / Shutterstock",
    "Almost 80 schoolgirls poisoned and hospitalized in Afghanistan, official says",
    "Arrests and tight security in Hong Kong on Tiananmen Square anniversary",
    "Signal error blamed for deadly India train crash",
    "Immigrant health care workers can face harsh working conditions and $100,000 lawsuits for quitting",
    "Florian Gaertner / Photothek via Getty Images file",
    "Ozempic and Wegovy force weight-loss companies to upend their longstanding strategies",
    "nechaev-kon / Getty Images/iStockphoto",
    "Is Covid ticking up? Viruses and other bugs could make a summer comeback",
    "Younger people left this U.S. territory for better jobs. Who takes care of the seniors?",
    "Women more likely than men to skip or delay medications due to cost, CDC report finds",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Teachers show gratitude to high school senior who has sent hundreds of thank you notes",
    "New drug effective at preventing growth of lower-grade brain tumors, clinical trial finds",
    "Prince Harry prepares to testify in lawsuit against newspaper group",
    "Akilah Townsend for NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Abhishek Chinnappa / Getty Images",
    "Chuck Todd to depart 'Meet the Press'; Kristen Welker to become host",
    "Eliot Blondet / Sipa via AP Images file",
    "Elon Musk’s response to an anti-trans video sparked 24 hours of chaos at Twitter",
    "Olly Curtis / Future via Getty Images files",
    "YouTube will stop removing false claims about 2020 election fraud",
    "Chase online banking issue causes double transactions and fees",
    "Buy Buy Baby draws sale interest in Bed Bath & Beyond bankruptcy",
    "Michael Ochs Archives / Getty Images",
    "‘Love to Love You’ is a rare look at Donna Summer’s ‘multilayered’ life",
    "Akilah Townsend for NBC NewsAkilah Townsend / NBC News",
    "Pregnant transgender man stars on cover of Glamour UK’s Pride issue",
    "Why are people always debating proper plane etiquette on TikTok?",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Erika P. Rodríguez for NBC News",
    "Olivier Touron / AFP via Getty Images file",
    "A quarter of all children in the U.S. are Latino, U.S. census study finds",
    "Jalisco State Prosecutor's Office",
    "45 bags of human remains found in western Mexico amid search for missing call center workers",
    "Jeff Greenberg / Universal Images Group via Getty Images",
    "Black Florida students are suing the state over less funding for their HBCU",
    "Michael Brochstein / Sipa USA via AP file",
    "32 Mississippi school districts still under federal desegregation orders",
    "Trans adults in Florida 'blindsided' that new law also limits their access to health care",
    "Brandon Bell / Getty Images file",
    "Texas bans gender-affirming care for minors after Gov. Abbott signs bill",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "Greta Lee of 'Past Lives' says truthful storytelling means not serving the white male gaze",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "Do Not Sell My Personal Information"
]