[
    "Supreme Court bars affirmative action in college admissions",
    "Live / Special coverage of Supreme Court decisions",
    "Just now1m agoChart: the racial gap at flagship state universities",
    "Just now2m agoCourt rules against affirmative action programs at Harvard and UNC",
    "Just now5m agoAffirmative action case opinion",
    "Just now5m agoSecond case is Groff v. DeJoy, decision by Alito",
    "Owen Berg / NBC News / Getty Images",
    "Liberal wins at the Supreme Court may prove to be fleeting",
    "Tracking major Supreme Court cases",
    "Alexei Druzhinin / AP file",
    "Top generals' uncertain fate overshadows Putin's show of public support",
    "Anger and division roil Russian fighters after mercenary rebellion",
    "Russians took her son, so she traveled 3,000 miles to get him back",
    "Al Drago / Bloomberg via Getty Images file",
    "Ron DeSantis says he would eliminate four federal agencies if elected president",
    "For some Republicans who endorsed Biden in 2020, the next election looks bleak",
    "Ron DeSantis vetoes popular criminal justice bill as he moves to Trump's right",
    "Stefano Rellandini / AFP - Getty Images",
    "France to deploy 40,000 officers to quell violence after deadly police shooting",
    "Violence spreads across France after the fatal police shooting of a 17-year-old in a Paris suburb",
    "A disjointed jet stream has some climate scientists spooked",
    "Live Updates / Smoke from Canadian wildfires has 'no end' in sight as South swelters",
    "Summer travel season off to rough start amid widespread flight delays",
    "Utah grief author accused of poisoning her husband sued for over $13M by his sister",
    "Charges dropped against NYC man accused in fatal subway stabbing",
    "Yankees pitcher Domingo Germán throws perfect game against Oakland",
    "Xinhua News Agency / via Getty Images file",
    "Why war with China over Taiwan could ruin the global economy﻿",
    "As China crests second Covid wave, families still mourn victims of the first one",
    "Shootout outside U.S. consulate in Saudi port city leaves assailant and security guard dead",
    "Inflation hits royal finances as King Charles turns down heating to save emissions",
    "Professor and 2 students stabbed in gender issues class at Canadian university",
    "Manuel Balce Ceneta / AP file",
    "Biden warns top aides against offering him political advice about Hunter",
    "Connecticut House Democrats",
    "State Rep. assaulted after attending Eid service with her family in Connecticut",
    "Andrew Caballero-Reynolds / AFP - Getty Images",
    "Biden has started using a CPAP machine at night to deal with sleep apnea",
    "This Democrat has led an anti-gun violence group in Congress for a decade. Now some want a change.",
    "Biden pushes vision for economic growth 'from the middle out and bottom up'",
    "ABC Photo Archives / Disney via Getty Images",
    "'Boy Meets World' stars say Ben Savage 'disappeared' from their lives: 'He ghosted us'",
    "Sthanlee B. Mirador / Sipa USA via AP",
    "Colleen Ballinger responds to allegations with a song",
    "Ethan Miller / Getty Images file",
    "Pete Davidson checks into rehab",
    "Madonna delays tour after hospitalization for 'serious bacterial infection'",
    "McDonald's Grimace breaks his silence on TikTok trend",
    "The 6 best mattress toppers of 2023",
    "Expert advice on shopping for SPF lip balm",
    "13 best sports bras for workouts",
    "The best Select Pet Awards winners on Amazon right now",
    "The best Select Pet Awards winners under $25",
    "Supreme Court expected to rule on affirmative action and student loan cases",
    "Madonna hospitalized with bacterial infection, postpones tour",
    "Simone Biles to return to competition for the first time since Tokyo",
    "Inside daring effort to rescue Ukrainian children",
    "Delta jet makes emergency landing without nose gear",
    "Chelsea Stahl / NBC News; Getty Images; AP",
    "GOP presidential candidates want the Moms for Liberty vote in Pennsylvania after local victories",
    "Tick and mosquito season is already shaping up to be severe this year",
    "Erik McGregor / LightRocket via Getty Images",
    "What's fueling the rise in Hindu nationalism in the U.S.",
    "Brendan Smialowski  / AFP - Getty Images",
    "Have you heard the one about the old president? Well, Biden has a joke for you",
    "Scott Olson / Getty Images",
    "House Republicans embark on a mission: Avenge Trump",
    "Scott Eisen / Getty Images",
    "Trump explores messing with the first GOP debate",
    "Science Photo Library - CDC / Getty Images",
    "CDC recommends RSV shots for older adults, clearing the way for vaccinations to begin this fall",
    "Christine Peterson / Telegram & Gazette / USA Today Network",
    "Have a summer cold? Common viruses are back from a pandemic hiatus",
    "Leonardo Munoz / VIEW press / Corbis via Getty Images file",
    "Overstock.com will relaunch Bed Bath & Beyond after buying its IP assets for $21.5 million",
    "Stephanie Keith / Bloomberg via Getty Images file",
    "Doubt grows over Buy Buy Baby sale process as parent Bed Bath & Beyond splits auction",
    "Americans got stingier after a pandemic surge in giving, but donations remain high",
    "Scientists have finally ‘heard’ the chorus of gravitational waves that ripple through the universe",
    "Brutal heat wave makes Texas among the hottest places on Earth",
    "Human remains and debris from sub returned to land after fatal implosion near Titanic site",
    "Astronauts' urine and sweat are almost entirely recycled into drinking water with new system",
    "4 more charged in Texas human smuggling incident in which 53 migrants died",
    "Mexico Instituto Nacional de Migracion",
    "Bus of migrants help mother give birth before being detained in Mexico",
    "Alberto Ortega / Europa Press via Getty Images file",
    "Spanish Royal Academy rejects changing  language to anti-colonial ‘Ñamericano’",
    "Stefani Reynolds / Bloomberg via Getty Images file",
    "Colleges anxiously await a landmark Supreme Court affirmative action decision",
    "Brandon Bell / Getty Images file",
    "A 2013 Supreme Court decision invited widespread voter suppression laws, experts say",
    "Laurence Griffiths / Getty Images",
    "Simone Biles set to return to competition for first time since 2021 Tokyo Olympics",
    "Justine Good4 / NBC News; Getty Images / AP",
    "What to know about California's highly anticipated reparations proposal",
    "Angela Weiss / AFP via Getty Images file",
    "Google distances itself from company-sponsored drag show following employee petition",
    "Carlin Stiehl / Boston Globe via Getty Images file",
    "Over half of Americans have faced online hate, survey finds",
    "Ross D. Franklin / AP file",
    "Arizona governor's executive actions ban conversion therapy, allow trans health care",
    "Chris Delmas / AFP via Getty Images file",
    "Dwyane Wade says his daughter physically hid from him when she came out to the family",
    "Oscars invite Taylor Swift, Ke Huy Quan, RRR and other new members to Academy",
    "Michelle Yeoh and Chadwick Boseman are honored with Walk of Fame stars",
    "Lev Radin / Sipa via AP file",
    "NYC makes Diwali an official school holiday, but there’s a catch this year",
    "Do Not Sell My Personal Information"
]