[
    "Canadian Forces; Getty Images; OceanGate",
    "'Debris field' found in missing Titan search area, Coast Guard says",
    "A tale of two disasters: Missing sub captivates the world days after deadly migrant shipwreck",
    "Titanic submersible lost at sea raises legal questions for high-risk businesses",
    "J. Scott Applewhite / AP file",
    "Rep. George Santos’ $500K bond was guaranteed by his father and aunt",
    "A timeline of Rep. George Santos' fabrications and controversy",
    "Sharon Chischilly for NBC News",
    "Supreme Court rules against Navajo Nation in water rights dispute",
    "Supreme Court delivers win for Native American tribes in adoption case",
    "Graphics show how abortion access has changed in America",
    "Senate Democrats plan abortion-rights push to mark one year without Roe v. Wade",
    "Harris to deliver speech in North Carolina on anniversary of Roe v. Wade reversal",
    "Timothy A. Clary / AFP - Getty Images",
    "Why Victor Wembanyama is the next big NBA star",
    "Live Updates / 77th NBA Draft kicks off at Barclays Center tonight",
    "Win McNamee / Getty Images file",
    "Marjorie Taylor Greene calls Lauren Boebert 'a little b----' on the House floor",
    "Brandon Bell / Getty Images file",
    "State Sen. Angela Paxton barred from voting on impeachment of her husband, Texas AG Ken Paxton",
    "Special counsel gives Trump's team first batch of evidence in classified documents case",
    "Chip Somodevilla / Getty Images file",
    "Former Texas Rep. Will Hurd jumps into the 2024 GOP presidential race",
    "Narendra Modi to address joint session of Congress as U.S. and India forge closer ties",
    "House Democrats push Biden admin on 'next steps' to help Venezuelans",
    "Attorneys spar in John Eastman's disbarment case over bid to keep Trump in power",
    "'Straight out of a horror movie': Massive hail storm injures nearly 100 concertgoers",
    "Four dead and 10 injured after tornado strikes Texas town, destroying homes and businesses",
    "Kerry Sheridan / AFP via Getty Images file",
    "Giant African land snail spotted in Florida, forcing quarantine in parts of county",
    "Three of Mount Rainier's glaciers have melted away",
    "Texas continues to bake as blistering heat wave shows no sign of letting up",
    "Suspect in mass shooting at Washington music festival told police he was high on psychedelics",
    "Harvard human remains case highlights need for body donation regulations, experts say",
    "Natalia Kolesnikova / AFP via Getty Images",
    "WSJ journalist Evan Gershkovich must stay in jail until late August, Moscow court rules",
    "Phil Walter / Getty Images",
    "New Zealand PM disagrees with Biden, says China's Xi not a 'dictator'",
    "Alexander Polegenko / Zuma Press",
    "Ukraine strikes key bridge to Crimea used by Russian military",
    "Explosion kills 31 people at a barbecue restaurant in China",
    "See the Titanic wreckage more than 100 years later",
    "Corey Nickols / Getty Images for IMDb",
    "Diego Luna could make Emmy history for 'Star Wars'",
    "Rocco Spaziani / Mondadori Portfolio via Getty Images file",
    "Actor Luke Macfarlane is officially a daddy: 'Bros' star announces birth of baby girl",
    "Arturo Holmes / FilmMagic file",
    "Kevin Costner's estranged wife is requesting $248K a month for child support amid divorce",
    "Aaron Rodgers speaks about psychedelics and how it 'unlocked that whole world' for him",
    "'Taylor Swift law' introduced to criminalize ticket scalping in Brazil",
    "Twins set to make history during NBA Draft",
    "Summer of bugs: Snails, crickets, lantern flies invade towns in US",
    "FTC alleges Amazon tricked users into signing up for Prime",
    "Search for missing sub focuses on underwater banging sounds",
    "NBC News / Dirty Dozen Productions; via LinkedIn; Courtesy Dawood family; AFP via Getty Images",
    "The Titanic brought them together, and a tiny vessel could doom them",
    "Leila Register / NBC News; Getty Images",
    "Doctors say HCA hospitals push patients into hospice care to improve mortality stats",
    "Chelsea Stahl / NBC News; Getty Images",
    "How ex-Confederates spread racist attitudes far and wide after the Civil War",
    "Ibrahim Rayintakath for NBC News",
    "In hidden Discord communities, adults are abusing and extorting children",
    "Jessica Fox / Canadian Forces",
    "Desperate push to find missing Titanic sub before oxygen supply runs out",
    "U.S. District Court for the District of Columbia",
    "Judge strikes down Florida's ban on Medicaid funding for transgender treatment",
    "CDC panel recommends RSV vaccines for adults ages 65 and up",
    "CDC warns people to protect themselves from measles when traveling",
    "Michael Reynolds / Bloomberg via Getty Images file",
    "Biden's campaign won't be on TikTok, but wants its message there",
    "Johnny Milano / Bloomberg via Getty Images file",
    "Overstock.com wins auction for Bed Bath & Beyond’s intellectual property, digital assets",
    "FTC sues Amazon over 'deceptive' Prime sign-up and cancellation process",
    "Darrell Schoppe / Cover Images via AP",
    "'Unprecedented' ocean heat wave could linger through fall",
    "U.S. approves chicken made from cultivated cells, the nation's first 'lab-grown' meat",
    "An ancient Mayan empire city was found in the Mexican jungle",
    "Rescue operation faces extreme environment in search for missing sub",
    "Immigration drove white and Asian population growth in the U.S. last year",
    "Gaby Oraa / Bloomberg via Getty Images",
    "George Walker IV / AP file",
    "Exhibition honors Caribbean children left behind by post-World War II migrants",
    "Congress and Postal Service unveil stamp honoring John Lewis",
    "Shannon Broderick / Laramie Daily Boomerang via AP file",
    "Sorority says rules allow transgender woman at Wyoming chapter",
    "Christian-owned Texas business shielded from LGBTQ bias claims, appeals court rules",
    "Rose Zhang swings her way toward first major victory in Women’s PGA Championship",
    "Brent Lewin / Bloomberg via Getty Images file",
    "Narendra Modi's White House visit highlights deep diaspora divides",
    "Matthias Schrader / AP file",
    "Women pushed into ravine at German castle were recent Illinois college graduates",
    "What is Walmart Plus Week?",
    "Which meal delivery service is right for you?",
    "13 best mineral sunscreens of 2023",
    "Our predictions for Prime Day 2023",
    "When is Amazon Prime Day 2023? What to know",
    "7 best air purifiers under $150",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "Do Not Sell My Personal Information"
]