[
    "Drew Angerer / Getty Images",
    "White House, Republicans reach tentative debt ceiling deal",
    "McCarthy says the deal includes 'historic reductions in spending'",
    "House will vote on Wednesday to raise the debt limit",
    "Texas House votes to impeach Attorney General Ken Paxton, triggering suspension",
    "Texas attorney general facing impeachment after monthslong investigation",
    "Ancient tombs and mummification workshops unearthed in Egypt",
    "How do you make a mummy? Ancient Egyptians’ surprising formula revealed",
    "Maine Department of Inland Fisheries & Wildlife via Facebook",
    "Courtesy Shari and Will Robbins",
    "U.S. Coast Guard ends search for Louisiana teen who went overboard in the Bahamas",
    "Michael Reaves / Getty Images",
    "2 more horses die after injuries at Churchill Downs, bringing the total to 12",
    "Henry Kissinger, former U.S. diplomat, celebrates 100th birthday",
    "How many people are held in solitary confinement in U.S. prisons and jails? Now there’s a number.",
    "NBC News / Getty Images; Golden Patriots Future",
    "‘Trump Bucks’ promise wealth for MAGA loyalty. Some lose thousands.",
    "J. Scott Applewhite / AP file",
    "The ugly proxy war over Dianne Feinstein's Senate seat",
    "Harris, 1st woman to give commencement speech at West Point, welcomes cadets to ‘unsettled world’",
    "Ohio banned August elections. Then the GOP planned one that could help preserve an abortion ban.",
    "Prosecutors say they have a recording of Trump and a witness in Manhattan DA case",
    "Republicans brace for 2022 losers to take another crack at winning",
    "Ukraine prepares 'for a new phase of the war' as counteroffensive appears imminent",
    "John MacDougall / AFP via Getty Images file",
    "Amid a rise in politically motivated hate crimes, Germany cracks down on far-right",
    "Angelika Warmuth / dpa / picture alliance via Getty Images file",
    "A tree felled in a storm leaves a nation mourning a 'great loss'",
    "Man who opened emergency door on South Korea flight told police he felt suffocated",
    "State Farm no longer accepting property insurance applications in California",
    "Forgotten stories of Chinese Titanic survivors shared in new documentary",
    "National Guard pilot's surprise family reunion at son's kindergarten graduation",
    "Passenger detained after allegedly opening plane’s emergency door while in-flight",
    "Jose Luis Magana / AP file",
    "More than a quarter of DACA recipients are uninsured as they await the fate of health care rule",
    "Popular baby loungers are tied to more deaths than U.S. officials previously announced",
    "How major brands were forced into the conservative plan to target LGBTQ people",
    "Oath Keepers founder gets 18 years in longest Jan. 6 sentencing yet",
    "China faces a new Covid wave that could peak at 65 million cases a week",
    "The Washington Post / Rebecca S. Gratz for The Washington Post via Getty Images file",
    "Ron DeSantis is learning that not every state wants to be Florida",
    "Natalie Behring / Getty Images file",
    "How an outrageous drag queen found mainstream fame in 'The Little Mermaid'",
    "Kevin Mazur / BBMA2017/Getty Images for dcp file",
    "Celine Dion pulls plug on European tour citing ongoing health issues",
    "Tom Hanks delivers commencement speech at Harvard: ‘The truth is sacred’",
    "Taylor Swift's collaboration with Ice Spice raises eyebrows amid Matty Healy backlash",
    "Cancer drug shortage across U.S. has become ‘life-threatening’",
    "Brendan Smialowski  / AFP-Getty Images",
    "'I don’t know of a time that’s worse than this': Cancer drug shortages grow more acute",
    "Kaiti Sullivan /  The Washington Post via Getty Images file",
    "Indiana board reprimands Dr. Caitlin Bernard over 10-year-old's abortion case",
    "Mpox is down, but U.S. cities could be at risk for summertime outbreaks",
    "Scott Olson; Jim Watson / Getty Images",
    "Ron DeSantis signs Florida bill limiting the liabilities of private spaceflight companies",
    "Ricardo Arduengo  / AFP via Getty Images",
    "NOAA predicts 'near-normal' hurricane season",
    "Brendan Smialowski / AFP via Getty Images",
    "Military must focus on short- and long-term challenges of climate change, report finds",
    "States hit with unusually wet winters now brace for an unpredictable wildfire season",
    "Scientists are puzzled by Orcas sinking boats in a string of abnormal attacks",
    "Justin Sullivan / Getty Images",
    "Ford EVs will use Tesla charging tech in surprise partnership between rival automakers",
    "Justin Sullivan / Getty Images file",
    "Elon Musk's brain implant company Neuralink announces FDA approval of in-human clinical study",
    "Will Chinese hacking derail U.S. hopes for a thaw with Beijing?",
    "Malaysia raids Swatch stores and seizes rainbow pride watches",
    "Carol M. Highsmith / Getty Images file; NBC News",
    "Culture wars are making it harder than ever for the small number of Latino professors",
    "Daisy Jasmin Estrada Borja",
    "A Latina who's not allowed to wear Mexican American sash at graduation takes legal action",
    "Mexico's president urges Latinos not to vote for DeSantis, slams hardline immigration stance",
    "Actually, Black mermaids have been part of mythology for a long time",
    "Fans around the world gather to remember Tina Turner's influence",
    "Paul Natkin / Getty Images file",
    "Tina Turner, trailblazing 'Queen of Rock 'n' Roll' who dazzled audiences worldwide, dies at 83",
    "Rapper Fetty Wap sentenced to 6 years in prison for drug trafficking scheme",
    "South Dakota governor calls on college board to ban drag shows and eliminate 'preferred pronouns'",
    "Charlie Neibergall / AP file",
    "Iowa Gov. Reynolds signs bill restricting instruction on sexual orientation and gender identity",
    "George Wood / Getty Images file",
    "New British Cycling rules bar transgender women from competing in elite female events",
    "12-year-old graduates college in California, setting school record",
    "Taco Bell; Courtesy Fatima Sajjad",
    "Why South Asian Americans stan Taco Bell",
    "Bipartisan bill seeks to award Medal of Honor to doctor who died tackling Laguna Woods shooter",
    "Asian Americans Leadership Council",
    "Bill that set out to restrict Chinese property ownership dies in Texas House",
    "Memorial Day mattress and bedding sales to shop",
    "The best Memorial Day sales to shop now",
    "The best Amazon Memorial Day deals to shop now",
    "14 best sunscreens for sensitive skin",
    "The best mattresses to keep you cool",
    "Expert-approved travel car seats",
    "What are the benefits of a tinted moisturizer?",
    "Lululemon just launched a new-and-improved trail sneaker",
    "Do Not Sell My Personal Information"
]