[
    "Spencer Platt / Getty Images",
    "NYC subway rider who put Jordan Neely in fatal chokehold to be charged with manslaughter",
    "White House calls for 'thorough investigation' into Jordan Neely's death",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Trump's comments on Mar-a-Lago documents 'like red meat to a prosecutor'",
    "Some Republicans push back on Trump's comments on the debt ceiling and Ukraine",
    "Pure Trump re-injected into the main vein of American politics at CNN town hall",
    "Andres Leighton / APPatrick T. Fallon / AFP via Getty Images",
    "House passes Republican border security bill hours before Covid restrictions lift",
    "Live Updates / Over 10 days at checkpoints, one man pleads for the U.S. not to forget him",
    "All eyes on Biden as the Title 42 impact hits far beyond southern border",
    "Marlena Sloss / Bloomberg via Getty Images file",
    "Elon Musk says he's hired a new CEO for Twitter and will reduce his own role",
    "Tucker Carlson says he'll launch new show on Twitter",
    "Black Tech Twitter, trans users and more marginalized groups flock to Bluesky",
    "It's been almost 18 years since Natalee Holloway vanished: Here's a timeline of her case",
    "Natalee Holloway case suspect to be extradited to U.S. in alleged fraud targeting her mom",
    "Jeff J Mitchell / Getty Images",
    "Trump notifies court of plans to appeal $5 million E. Jean Carroll verdict",
    "Erik McGregor / LightRocket via Getty Images file",
    "Supreme Court throws out convictions in sweeping New York corruption probe",
    "Drew Angerer / Getty Images file",
    "Debt ceiling meeting between congressional leaders and Biden delayed",
    "Al Drago / Bloomberg via Getty Images",
    "Biden swipes at 'MAGA Republicans' over firefighter and conservation jobs",
    "Feinstein returns to the Senate Judiciary Committee, helping advance Biden judges",
    "Small businesses brace for 'catastrophic' scenario from looming debt ceiling crisis",
    "Calif. state Senate passes bill that would make caste discrimination illegal",
    "Jessica Rinaldi / Boston Globe via Getty Images file",
    "Parents in college admissions scandal have fraud convictions overturned, appeals court rules",
    "Dennis Fujimoto / The Garden Island via AP file",
    "Idaho prosecutors ask jury to convict Lori Vallow in the killings of 2 of her children",
    "Christina Chung for NBC News",
    "Tough immigration policies are making it harder to build new homes",
    "An agitated goat fools Oklahoma police responding to cries for 'help'",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Coast Guard suspends search for 3 people after aircraft crashed off California coast",
    "Man accused of molesting girls he coached at a competitive cheer club and a high school",
    "Diego Herrera Carcedo / Anadolu Agency via Getty Images",
    "Ukraine drives back Russian forces around Bakhmut in its first significant gains in months",
    "Ahmad Gharabli / AFP - Getty Images",
    "Salvatore Di Nolfi / Keystone via AP",
    "Top jewelry pieces fall short of target prices at Christie’s auction derided by Jewish groups",
    "Serbians hand over thousands of weapons after mass shootings",
    "Erdogan’s rival boosted by withdrawal ahead of Turkey presidential vote",
    "Patrick T. Fallon / AFP via Getty Images file",
    "More gay and bisexual men can donate blood under new FDA rules",
    "@breakingchesky via Instagram",
    "NBC News' Morgan Chesky describes 'frightening' health scare during hike",
    "At least 2 cases of drug-resistant ringworm infections found in the U.S., CDC says",
    "Why it took doctors months to diagnose a woman's eye infection caused by contaminated eyedrops",
    "Mpox is no longer a global health emergency, WHO announces",
    "Covid transformed the U.S. labor market, and it isn’t done yet",
    "Douglas Sacha / Getty Images",
    "Blinded by the light: Cars in the U.S. still lack glare-reducing headlight technology",
    "Adam Glanzman / Bloomberg via Getty Images file",
    "Peloton recalls 2.2 million exercise bikes due to safety hazard",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "How Europe is leading the world in building guardrails around AI",
    "New details on Utah author charged with fatally poisoning husband",
    "Blinding headlights are growing problem on US roads",
    "FDA votes unanimously for over-the-counter sale of birth control pill",
    "Peanut allergy skin patch shows promise for toddlers",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "The local toll of election denialism: Virginia county loses second registrar in 2 months",
    "Greg Lovett / The Palm Beach Post / USA Today Network",
    "In South Florida, ‘black snow’ makes breathing difficult for some Black and Latino residents",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Jacklyn Zeman, longtime 'General Hospital' actor, dies at 70",
    "Arturo Holmes / FilmMagic file",
    "Elliot Page recalls past feelings of dysphoria and 'joy' he now feels in his body",
    "Paul Chinn / San Francisco Chronicle via Getty Images file",
    "Heather Armstrong, founder of Dooce deemed 'Queen of the Mommy Bloggers,' dies at 47",
    "Tarte Cosmetics CEO pledges to make creator program more equitable and inclusive",
    "Paramount brands to lay off 25% of U.S. staff as MTV News shuts down",
    "Perboge / Getty Images/iStockphoto",
    "Andre Malerba / Bloomberg via Getty Images file",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Dust storms have killed hundreds and are a growing problem in parts of the U.S.",
    "Patrick T. Fallon / AFP via Getty Images",
    "Stringer via Reuters/Redux",
    "Live Updates: As Title 42 immigration policy expires tonight, border officials prepare for influx",
    "Herika Martinez / AFP via Getty Images file",
    "Mexico suspends operations at some migrant centers pending review after deadly fire",
    "Title 42 immigration policy set to expire tomorrow",
    "Andrew Savulich / New York Daily News/TNS via Getty Images file",
    "Mikala Compton / Austin American-Statesman / USA Today Network",
    "Army sergeant promised pardon by Texas Gov. Abbott gets 25 years in protester’s murder",
    "Ed Reed / Office of Mayor Eric Adams",
    "NYC mayor calls fatal subway chokehold on Jordan Neely a ‘tragedy that never should have happened’",
    "Arkansas Pride event changes venue after drag show restriction",
    "Charlie Neibergall / AP file",
    "West Virginia’s Bob Huggins agrees to $1M pay cut, 3-game suspension for homophobic slur",
    "José Luis Villegas  / AP file",
    "'Sesame Street' debuts its first Filipino American muppet",
    "Northern California farm draws on Philippine and Hmong ancestries",
    "Man killed in Texas shooting alongside his wife and one of his sons 'loved being a dad'",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "18 last-minute gifts that should arrive by Mother's Day",
    "Schmidt's; Salt & Stone; Native",
    "Does natural deodorant actually work?",
    "9 best teeth whitening treatments",
    "Mother's Day gifts for every kind of mom",
    "Do Not Sell My Personal Information"
]