[
    "Undocumented migrant crossings dropped on Friday, the first day after Title 42 was lifted",
    "El Paso residents are split on migration in and around their border city",
    "Everything you need to know about Title 42",
    "Said Khatib / AFP via Getty Images",
    "Israel and Palestinians agree to cease-fire ending days of fighting and bloodshed",
    "2 Palestinians killed in West Bank raid as Israel trades fire with militants",
    "Tornado threat cancels Trump's Iowa rally as Ron DeSantis campaigns in the state",
    "Ron DeSantis is a hot ticket at GOP events",
    "Ron DeSantis is on the verge of announcing his presidential bid",
    "Shelby Tauber for NBC News",
    "Monster tornado in Rolling Fork laid bare a grim reality: Many had no hope of finding safety",
    "Social Security advocates brace for U.S. debt default: Seniors should 'be prepared'",
    "Chip Somodevilla / Getty Images",
    "Florida Democrats struggle to coalesce on a candidate to take down Sen. Rick Scott",
    "Shawn Thew / EPA/Bloomberg via Getty Images",
    "North Carolina governor vetoes abortion limits, launches override showdown",
    "Former Manhattan prosecutor frustrates House Republicans at deposition on Trump case",
    "NJ elementary school bus went missing for nearly an hour after driver suffered medical emergency",
    "Luis Sinco / Los Angeles Times via Getty Images",
    "Unusually early heat wave in Pacific Northwest could break records",
    "Employee found dead in freezer at Louisiana Arby's",
    "At least one dead after reported tornado in south Texas near U.S.-Mexico border",
    "Fatal wedding crash suspect says she 'did nothing wrong,' records show",
    "Meet 'Chonkosaurus,' the viral Chicago River snapping turtle",
    "Earthquakes and the economy leave Turkey's Erdogan facing his toughest election battle in years",
    "Anatolii Stepanov / AFP via Getty Images file",
    "China unlikely to play peacemaker role in Ukraine war, Western officials and experts say",
    "Paul Ellis / AFP - Getty Images",
    "War hangs over Europe’s preeminent pop contest",
    "Zelenskyy lands in Rome for meetings with  Pope Francis and Meloni",
    "South Africa expresses 'utter displeasure' at U.S. accusations of arms shipment to Russia",
    "Daniel Dorsa / NYT via Redux; NBC News",
    "Heather Armstrong’s friends remember the Dooce.com blogger’s complicated legacy",
    "Kevin Winter / Getty Images for iHeartRadio file",
    "Country music star Jimmie Allen's former manager accuses him of sexual assault and harassment",
    "Joe Maher / Getty Images file",
    "Actor Jamie Foxx is out of the hospital and recuperating, his daughter says",
    "Michael J. Fox opens up about variety of injuries due to Parkinson's disease",
    "'Queen Charlotte' star Arséma Thomas says playing Lady Danbury gave her power",
    "Non-profit providing critical doula services to Black women cost-free",
    "Man thanks nurses who saved his life in a grocery store after suffering cardiac arrest",
    "Watch: Oklahoma police respond to cries for help and find a goat",
    "Watch: French surgeon sings to relax patients before surgery",
    "Cat and dog torture videos litter Twitter, adding to concerns about moderation",
    "Vartika Sharma for NBC News",
    "National Maternal Mental Health Hotline received over 12,000 calls and texts in its first year",
    "Jabin Botsford / The Washington Post via Getty Images file",
    "Trump's comments on Mar-a-Lago documents 'like red meat to a prosecutor'",
    "Sciepro  / Getty Images/Science Photo Library",
    "Scientists announce rough draft of human pangenome",
    "Stewart F. House / Getty Images",
    "Gunman was a 33-year-old suspected neo-Nazi sympathizer, officials say",
    "Erik McGregor / LightRocket via Getty Images file",
    "Supreme Court throws out convictions in sweeping New York corruption probe",
    "Michael Ciaglo for NBC News",
    "Lauren Schatzman / NBC News / Getty Images",
    "Asian Americans are no longer pop culture side-kicks — they're defining the mainstream",
    "The chronically online third culture is redefining Asian America",
    "CFOTO / Future Publishing via Getty Images",
    "China says Tesla to fix software for 1.1 million vehicles with braking issue",
    "Former NBCUniversal ad chief Linda Yaccarino named CEO of Twitter",
    "McDonald's found liable for hot Chicken McNugget that fell from Happy Meal, burned girl",
    "Peter Dazeley / Getty Images",
    "FDA approves drug to treat hot flashes and night sweats",
    "The importance of CPR during cardiac arrest, learned by this mother and daughter",
    "The pandemic emergency is over, but Covid's impact on the labor force is set to last",
    "Dane Rhys / Bloomberg via Getty Images file",
    "Biden administration's power plant rules underscore reality of EPA limits",
    "Perboge / Getty Images/iStockphoto",
    "'No Mow May' encourages homeowners to help bees by letting their lawns grow",
    "Deadly combo of extreme heat and air pollution grips parts of Southeast Asia",
    "In coastal Bangladesh, climate change devastates women’s reproductive health",
    "Saul Loeb / AFP via Getty Images file",
    "Daniel Cardenas / Anadolu Agency via Getty Images",
    "Mexico to launch database tool of over 10,000 missing people",
    "Migrants in the treacherous Darien jungle find a more organized route",
    "Patrick T. Fallon / AFP via Getty Images",
    "Migrants weigh next steps after Title 42 immigration policy expires",
    "Michael M. Santiago / Getty Images",
    "Jordan Neely's family says manslaughter charge is too lenient for NYC subway rider",
    "Courtesy of Mills & Edwards LLP",
    "Jordan Neely's family lashes out at Marine who put him in deadly chokehold on subway",
    "Caroline Brehman / CQ-Roll Call, Inc via Getty Images file",
    "Kansas City declares itself an LGBTQ sanctuary city",
    "Phillip Faraone / Getty Images for Drake's Hollywood file",
    "'Selling Sunset' star Chrishell Stause and musician G Flip got married",
    "Texas lesbian bar denied insurance for hosting drag shows, owner says",
    "Arkansas Pride event changes venue after drag show restriction",
    "Food truck in L.A. explores Indonesian culture through cuisine",
    "Killed in an American mass shooting, a victim makes a crucial final journey home to India",
    "Lauren Schatzman / NBC News",
    "Man accused in deadly shooting at  Taiwanese church in California is indicted on 98 charges",
    "Courtesy Vivian Le; Zoe Malin; Shari Uyehara",
    "Select staffers' favorite pet products",
    "6 top-rated luggage sets for your next trip",
    "16 products that will upgrade your braid care routine",
    "Tuft & Needle; Supergoop; Aura Frame",
    "7 best sales to shop this weekend",
    "lo&sons; Wandrd; Peak Design",
    "9 best beach towels you need this summer",
    "How to choose an indoor cycling bike",
    "21 mom-approved Mother's Day gifts",
    "11 best women's walking shoes in 2023",
    "Why the Yeti Rambler is my go-to tumbler on the go",
    "Do Not Sell My Personal Information"
]