[
    "Russia says Ukraine launched a major attack in the east",
    "How the U.K. is trying to pressure other nations into arming Ukraine",
    "Drone attack brings Putin's war home to a shaken Moscow",
    "Jim Watson / AFP - Getty Images",
    "With debt limit deal behind him, Biden returns to 'previously scheduled programming'",
    "Biden signs bipartisan debt ceiling bill to avert government default",
    "Samuel Corum / Getty Images file",
    "Fighter jets scrambled near D.C. to check off-course  private plane that ultimately crashed.",
    "Loud boom heard after fighter jets scrambled to intercept small plane",
    "Love County Sheriff's Office",
    "Scuba diver finds live tear gas grenade in Oklahoma lake",
    "Scott Olson / Getty Images",
    "Missing man’s body recovered at Iowa apartment collapse site; two others still missing",
    "Akilah Townsend for NBC NewsAkilah Townsend / NBC News",
    "Ticketless Taylor Swift fans gather outside stadiums for a different kind of Eras Tour experience",
    "Daughter, granddaughter charged after 71-year-old Maryland grandmother killed, police say",
    "Arson investigation underway after fire damages Los Angeles church for second time in 2 years",
    "GOP candidates criticize Trump for praising Kim Jong Un",
    "Bill Clark / CQ-Roll Call via AP file",
    "Sen. Rounds won't commit to support eventual GOP nominee if it’s not Tim Scott",
    "Grand jury in Trump classified documents case expected to meet this coming week after hiatus",
    "Former Trump lawyer compares classified documents case to Hillary Clinton’s emails",
    "Here's what's going on with Texas Attorney General Ken Paxton's impeachment",
    "Mass Communication Specialist 1st Class Andre T. Richard / U.S. Navy via AP",
    "U.S. releases video showing close-call with Chinese warship",
    "Mother who served 20 years over deaths of her 4 children is freed after new evidence",
    "Abhishek Chinnappa / Getty Images",
    "Signal error blamed for deadly India train crash",
    "Arrests and tight security in Hong Kong on Tiananmen Square anniversary",
    "Supporters of Russian opposition leader Navalny hold protests to mark his birthday",
    "Immigrant health care workers can face harsh working conditions and $100,000 lawsuits for quitting",
    "Florian Gaertner / Photothek via Getty Images file",
    "Ozempic and Wegovy force weight-loss companies to upend their longstanding strategies",
    "nechaev-kon / Getty Images/iStockphoto",
    "Is Covid ticking up? Viruses and other bugs could make a summer comeback",
    "Younger people left this U.S. territory for better jobs. Who takes care of the seniors?",
    "Women more likely than men to skip or delay medications due to cost, CDC report finds",
    "U.S. Ambassador confronts antisemitism during visit to Germany",
    "Teachers show gratitude to high school senior who has sent hundreds of thank you notes",
    "New drug effective at preventing growth of lower-grade brain tumors, clinical trial finds",
    "Prince Harry prepares to testify in lawsuit against newspaper group",
    "Omnia Ahmed; Abdel Rahman El Mahdi / NBC News",
    "Through bullets and border chaos, they fled Sudan's conflict with $800 and a family of five",
    "Marissa Leshnov for NBC News",
    "California's stolen land could be worth millions, and Black families are fighting for every penny",
    "30 drag performers who made ‘herstory’ ahead of Pride month 2023",
    "Chuck Todd to depart 'Meet the Press'; Kristen Welker to become host",
    "Eliot Blondet / Sipa via AP Images file",
    "Elon Musk’s response to an anti-trans video sparked 24 hours of chaos at Twitter",
    "Olly Curtis / Future via Getty Images files",
    "YouTube will stop removing false claims about 2020 election fraud",
    "Chase online banking issue causes double transactions and fees",
    "Buy Buy Baby draws sale interest in Bed Bath & Beyond bankruptcy",
    "Akilah Townsend / NBC News",
    "Pregnant transgender man stars on cover of Glamour UK’s Pride issue",
    "Jasmin Merdan / Getty Images",
    "Why are people always debating proper plane etiquette on TikTok?",
    "Cynthia Weil, 'You’ve Lost That Lovin’ Feeling' songwriter and Grammy-winner, dies at 82",
    "Padma Lakshmi announces she’s leaving ‘Top Chef’ after 17 years",
    "Joe Scarnici / Getty Images for New York Magazines file",
    "U.S. Poet Laureate verses are soaring into space — literally",
    "Hyoung Chang / Denver Post via Getty Images file",
    "World’s wheat supply at risk of a dangerous shock due to heat and drought, study warns",
    "Department of Defense via AP file",
    "NASA panel studying UFO sightings says stigma and poor data pose challenges",
    "Memorial Day 'Manhattanhenge' to light up New York City streets",
    "Erika P. Rodríguez for NBC News",
    "Olivier Touron / AFP via Getty Images file",
    "A quarter of all children in the U.S. are Latino, U.S. census study finds",
    "Jalisco State Prosecutor's Office",
    "45 bags of human remains found in western Mexico amid search for missing call center workers",
    "Michael Brochstein / Sipa USA via AP file",
    "32 Mississippi school districts still under federal desegregation orders",
    "Ron DeSantis fires back at NAACP over travel advisory, education and shootings",
    "Brandon Bell / Getty Images file",
    "Texas bans gender-affirming care for minors after Gov. Abbott signs bill",
    "Rodin Eckenroth / Getty Images file",
    "Pride Night celebrations at the ballpark were largely uncontroversial — until now",
    "Some trans people turn to crowdfunding to leave Florida after anti-LGBTQ laws",
    "Michael Tullberg / Getty Images file",
    "Asians in L.A. have the third-largest population — but the smallest voting share",
    "Meet the 14-year-old who won the Scripps National Spelling Bee with ‘psammophile’",
    "Greta Lee of 'Past Lives' says truthful storytelling means not serving the white male gaze",
    "Is spray sunscreen effective? Doctors weigh in.",
    "iRobot; Cozy Earth; Sur La Table",
    "7 best sales to shop this week",
    "Kara Birnbaum for NBC News",
    "Courtesy Shari Uyehara; Courtesy Zoe Malin; Brooklinen",
    "Select editors' favorite products from May",
    "Do ergonomic keyboards really work? We tried them.",
    "The best stroller wagons of 2023",
    "40 best new products this month",
    "Courtesy Bokksu; Courtesy SelfMade",
    "100+ AAPI-owned businesses to shop",
    "What dermatologists want you to know about kids' sunscreen",
    "The best coolers for 2023, according to experts",
    "Do Not Sell My Personal Information"
]