[
    "Hunter Biden to plead guilty to tax-related misdemeanor crimes",
    "White House memo says GOP was caught 'telling the truth' on motive for Hunter Biden probe",
    "OceanGate Expeditions / AP",
    "Rescuers race against time as passengers identified on missing Titanic tourist sub",
    "Billionaire adventurer and a father-and-son duo among the missing in Titanic sub",
    "Titanic tour company offered up-close experience for $250,000",
    "Brandon Bell / Getty Images file",
    "Trump classified documents trial will begin in mid-August, judge says",
    "Trump says his kids won't serve in his administration if he wins a second term",
    "Judge bars Trump from disclosing — or keeping — evidence in documents case",
    "Andrew Tate will face trial on rape, human trafficking charges in Romania",
    "Divisive influencer Andrew Tate and brother to be released from detention in Romania",
    "Mark Abramson for NBC News",
    "RFK Jr. wants to be president — but can he stop talking about vaccines?",
    "YouTube removes video of Robert F. Kennedy Jr. and Jordan Peterson for vaccine misinformation",
    "Scott Olson / Getty Images file",
    "Bipartisan team to limit Chinese purchase of U.S. farmland",
    "Andy Cross / The Denver Post via Getty Images file",
    "John Eastman faces disbarment proceedings in California over effort to reverse 2020 election",
    "Abaca Press/FILE / Sipa USA via AP",
    "White House plans high-profile events around anniversary of overturning Roe v. Wade",
    "Senate Democrats plan abortion-rights push to mark one year without Roe v. Wade",
    "House GOP moves to ban public access to military service records",
    "Chelsea Stahl / NBC News; handout photos; Getty Images",
    "Four killed in a fire that started in a New York City e-bike shop",
    "Flags vandalized at Stonewall National Monument 3 times during Pride month",
    "Video shows Delta and United planes in slow-motion bump at Boston airport",
    "The South sweeps up as weekend storms leave 6 dead and dozens injured",
    "Gavriil Grigorov / Sputnik via AP",
    "Biden warns the threat of Putin using tactical nuclear weapons is 'real'",
    "Nicolas Briquet / SOPA / Lightrocket via Getty Images file",
    "Paris Olympic headquarters searched in corruption probe",
    "American woman who was pushed into a ravine near Neuschwanstein castle is out of the hospital",
    "4 people wounded by man wielding axe who attacked diners at Chinese restaurants in New Zealand",
    "Blinken says spy balloon 'chapter should be closed' after China talks",
    "A 'Price Is Right' contestant celebrated so hard that he dislocated his shoulder",
    "Stefano Rellandini  / AFP - Getty Images",
    "Bebe Rexha taken to hospital after fan throws a phone at her face mid-concert",
    "Bob Levey / Getty Images file",
    "Houston rapper Big Pokey, early member of hip-hop collective Screwed Up Click, dies",
    "'The Flash' disappoints with a $55 million debut",
    "Kourtney Kardashian announces pregnancy with homage to Blink-182 video",
    "Stephanie Mei-Ling for NBC News",
    "Black mermaids came to slay at annual Coney Island parade",
    "With festivals and reflection, America marks Juneteenth",
    "Meet the Black outdoorsy groups reclaiming the joys of nature",
    "Inside look at the missing Titanic tourist submersible",
    "Bipartisan bill to establish commission on AI: Is it too little, too late?",
    "Boaters make daring rescue after witnessing houseboat capsize",
    "Thermostat wars: Debate heats up over office temperatures",
    "How one city's apology to Black and Latino residents sparked a backlash",
    "Andrej Isakovic / AFP via Getty Images file",
    "Rocked by 2 mass shootings in 2 days, this small country chose a different path",
    "Leila Register / NBC News; Getty Images",
    "People are using ChatGPT like a personal trainer. Professionals say it could be unsafe.",
    "Map: How vulnerable is your neighborhood to extreme heat?",
    "Titanic tourist submersible live updates: Rescuers race against time to find missing vessel",
    "The conspiracy candidate: What RFK Jr.’s anti-vaccine crusade could look like in the White House",
    "Despite brand boycotts and backlashes, Pride events see solid corporate support",
    "People are still being awful on flights, and no one really knows why",
    "Homeowners in California and Florida are running out of options to protect their homes",
    "Cancer was once considered a disease of aging but rates among young people are rising rapidly",
    "Patrick Smith / Getty Images",
    "Tori Bowie’s death shows how pervasive racial disparities are in maternal health",
    "Rates of a 'silent' liver disease are soaring, new research shows",
    "FDA asks drugmakers to update Covid boosters to target XBB.1.5 for the fall",
    "Biden picks North Carolina's former health chief, Mandy Cohen, to run CDC",
    "How vulnerable is your neighborhood to extreme heat?",
    "It’s already a hot start to what is expected to be a hot summer",
    "'It's my future': Montana youths undertake one of the world's most high-profile climate trials",
    "Chemical traces offer evidence of the universe's earliest stars",
    "Colombia's Armed Forces Press Office via AP",
    "Indigenous plane crash searchers turned to ayahuasca to find missing kids",
    "Theo Wargo / Getty Images for Songwriters Hall of Fame",
    "Gloria Estefan makes history with induction into Songwriters Hall of Fame",
    "Montinique Monroe / Getty Images file",
    "Texas Gov. Abbott signs law shutting diversity offices at public universities",
    "Stephanie Keith / Getty Images",
    "Courtesy Jennie Livingston via Janus Films",
    "11 essential drag films to watch this Pride month",
    "Presidential hopeful Francis Suarez opposes 'Don't Say Gay' expansion backed by DeSantis",
    "Mark Gunter / Getty Images for Art Hearts Fashion",
    "Trans activist apologizes for going topless at a White House Pride event",
    "Pregnant woman killed at Seattle intersection remembered as 'most selfless loving person'",
    "Filipino fisherman wows ‘America’s Got Talent audition’ judges with 'When a man loves a woman'",
    "Tom Williams / CQ-Roll Call, Inc via Getty Images file",
    "First Muslim woman confirmed as a federal judge",
    "Charley Gallay / Getty Images for Disney",
    "Ke Huy Quan surprises Harrison Ford on 'Indiana Jones' red carpet",
    "27 best new products in June from Our Place, Casper and more",
    "9 best sales to shop this weekend",
    "How to treat bug bites, according to doctors",
    "Is a Prime membership worth it?",
    "8 best men's running shoes of 2023",
    "Kara Birnbaum / NBC News; Getty Images",
    "14 top-rated pool toys for summer 2023",
    "How to shop for insect repellent",
    "7 best lightweight luggage options",
    "The best at-home pizza ovens of 2023",
    "Do Not Sell My Personal Information"
]