[
    "1 Phone Call, 9 Officers & A Race Against Time: How Odisha Rose to the Balasore Challenge",
    "Chargesheet by Jun 15, WFI Elections by Month End: What Centre Assured Wrestlers After 6-Hr Meet",
    "IND vs AUS Live Score, WTC Final: Smith, Head Rebuild Innings After Shami Gets Rid of Labuschagne",
    "Vicky Kaushal Was Nervous About Zara Hatke Zara Bachke Response, Says 'I Couldn't Sleep'",
    "'Revive or Survive?' Oppn Leaders Seek More Clarity from Congress as Patna Mega Meet Deferred",
    "Odisha Train Tragedy: Woman Declares Alive Husband ‘Dead’ To Claim Rs 17 Lakh Ex-Gratia",
    "Bharti Singh, Haarsh Limbhachiya Get Big Relief In Drug Case As Court Rejects NCB's Plea",
    "Gurgaon Metro: Union Cabinet Approves New Line Between HUDA City Centre and Cyber City",
    "Sonnalli Seygall Celebrates Her Big Day Draped in a Manish Malhotra Masterpiece",
    "Maruti Suzuki Jimny Launch: Price Starts at Rs 12.74 Lakh in India, Deliveries Start Today",
    "Deepika Padukone's Secret To Her Glowing Skin REVEALED | Just Three Steps To Follow",
    "Siddhant Chaturvedi & Navya Naveli Nanda Return From Goa Vacation Together; So It's Official Now?",
    "Samantha Ruth Prabhu Raises A Toast For Her Friendship With Vijay Deverakonda; And We Are In Awe",
    "Chandra Namaskar For The Win: Why & How You Must Perform Moon Salutation In The Hot & Humid Months",
    "Shahid Kapoor Brutally Trolled For Saying Marriage Is About Wife 'Fixing' Husband",
    "Sexy! Nikki Tamboli Flaunts Cleavage In A Very Plunging Choli, Hot Video Goes Viral; Watch",
    "When Karan Johar Had An Ugly Fallout With Kajol: 'I Feel Nothing for Her Any More'",
    "Prabhas Shares Marriage Plans Amid Kriti Sanon Dating Rumours, Announces His Wedding Venue",
    "Kartik Aaryan Attends Sonnalli Seygall's Wedding In Chappals; Video Goes Viral",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC Final, Day 1: India Remove Australia Openers in a Shared Morning Session at The Oval",
    "World Test Championship Final: The Big Test Awaits Captain Rohit Sharma",
    "IND vs AUS, WTC Final 2023: How Much Prize Money Will the Winners and Runners Up Receive?",
    "IND vs AUS WTC Final: What Happens, Who Wins Mace If The Oval Test Is A Draw Or Tie?",
    "IND vs AUS WTC Final 2023: How to Watch India vs Australia Clash For Free",
    "IND vs AUS WTC Final: Teams Wear Black Armbands for Victims of Odisha Train Trag ...",
    "Character and Their Biggest Fan: Bollywood Buffs Add Desi Touch to Viral Twitter ...",
    "Desi Student's Tweet On Luxurious College Hostel Has People Hilariously 'Flexing ...",
    "Jackie Shroff's Reflection on How Poverty Kept Family Close Hits Hard, Old Video ...",
    "Say Goodbye to Constipation with the Power of This Ayurvedic Ingredient",
    "Aaliyah Kashyap Slams Troll Who Claimed Her Fiance Relies On Her Dad Anurag Kashyap's Money",
    "Unlocking Deeper Connection: The Power of Active Listening in Building Relationships",
    "When Neelam Busted Rumours That Bobby Deol Cheated On Her With Pooja Bhatt | Throwback",
    "Woman’s Dance To Radha Kaise Na Jale Takes Internet By Storm",
    "All-Electric Volvo EX30 Makes World Premiere in Italy, Gets 480 Km Range Per Charge",
    "Delhi Ordinance 2023: AAP Outreach Against BJP's Anti Democratic Ordinance On Delhi Government",
    "Sumbul Touqeer Breaks Silence On Conflict Rumours With Imlie Co-Star Fahmaan Khan",
    "‘Everyone Will Know': Ukraine Security Official Says Counteroffensive Not Yet Launched",
    "Sara Ali Khan News | Sara Ali Khan Shuts Trolls Who Criticised Her Visit To Mahakaleshwar Temple",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "Astrological Predictions for June 7, 2023",
    "5 Places You Should Visit Before You Die",
    "9 Most Popular Indian Web Series Of All Time",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "9 Actresses Who Became Pregnant Before Marriage",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "OTT Releases This Week: Bloody Daddy, Avatar: The Way of Water, Never Have I Ever 4",
    "Amid Adipurush Release, Ranbir Kapoor-Sai Pallavi's Ramayan Film Put on Hold: Report",
    "Sara Ali Khan Opens Up On 'Marrying' a Cricketer Amid Shubman Gill Dating Rumours",
    "Shehzada Crew Still Waiting For Their Payment, Allege Dues of Rs 30 Lakh",
    "'The Return of Virat': ICC Pay Stunning Tribute to Kohli Ahead of WTC Final 2023",
    "Babar Azam, Chamari Athapaththu Lead ICC Player of the Month Nominations",
    "Cyclone Biparjoy to Become 'Very Severe Cyclonic Storm', To Make Landfall Here",
    "Curfew in Maharashtra’s Kolhapur After WhatsApp Posts on Aurangzeb, Tipu Sultan Lead to Clashes",
    "Mumbai Hostel Murder: Teen Raped, Strangulated with 'Dupatta'; Suspect Guard Found Dead on Tracks",
    "Mumbai Most Expensive Indian City For Expats; Hong Kong Tops Globally: Report",
    "Kharif MSP Announced: Cabinet Raises Paddy MSP to Rs 2,183/Quintal, Moong Dal Sees Highest Rise",
    "Torrent Power Stock Rises 9%, Hits 52-Week High On Signing MoU With Maharashtra Govt",
    "BSNL Revival Package: CCEA Approves Rs 89,047-Crore Support",
    "'Dollar Homes' In Gurugram, Delhi, Mumbai: Rents Surging 40-50% Amid High Demand",
    "HOT! Alaya F's Sexy Bikini Collection Is Definitely For Keeps, See Photos",
    "Suhana Khan Paints The Town Red In Bold Corset Top, Check Out The Star Kid's Hottest Style Moments",
    "Sunny Leone Makes Jaws Drop With Stunning Photos From Maldives Vacay, Check Out Her Sexy Pictures",
    "Malaika Arora Looks HOT And Happening In Chic Athleisure Wear, See Photos",
    "HOT! Alaya F Truly Sets The Temperature Soaring With One Picture At A Time, See Photos",
    "Character and Their Biggest Fan: Bollywood Buffs Add Desi Touch to Viral Twitter Trend",
    "UP Women Aggressively Fight Over Garage Space, Video Surfaces on Twitter",
    "Student Caught Using ChatGPT For Homework, He Forgot To...",
    "Jackie Shroff's Reflection on How Poverty Kept Family Close Hits Hard, Old Video Goes Viral",
    "Suffering From Depression, Manuj Jindal Had To Leave NDA, But He Cracked UPSC CSE Securing Rank 53",
    "JoSAA 2023 Counselling Schedule Released, Choice Filling To Begin On June 19",
    "NeXT to Replace NEET PG 2024? All You Need to Know",
    "NEET UG 2023 Results Likely To Be Announced by June Second Week",
    "More Education & Career News",
    "Apple's Acquisition of AR Startup Mira Sets the Stage for the 'Spatial' Reality Era: Explained",
    "Reddit to Lay Off About 5 Percent of its Workforce",
    "iOS 17 Update: 10 Important Features Coming To Your iPhone Soon",
    "Duck It! One Big News For Apple iPhone Users With iOS17 Update Release",
    "Hero MotoCorp to Launch a New Product on June 14, Is it the Iconic Karizma or the Extreme 160R?",
    "Air India New Delhi-San Francisco Flight Diverted to Russia, Engine Glitch Reported",
    "Honda Elevate SUV Launch in India: Bookings Start in July 2023, Price Reveal Later",
    "Travelogue: Delhi-Jalandhar-Delhi in MG ZS EV, Range Anxiety Eliminated?",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Pro, Anti LGBT Groups Fight Violently outside California School over Gender, Pride Month",
    "‘One Day The Tables Will Turn’: Imran Says PDM Harming Pakistan By Tearing PTI Apart",
    "New York was Most Polluted Major City in the World on Tuesday. Here's Why",
    "The Rise of Germany's Most Successful Far-right Party Since the Nazis | Timeline",
    "UK PM Rishi Sunak in Washington to Meet US President Joe Biden; Tech, Ukraine War on Agenda",
    "132nd Durand Cup to Kick-off on August 3, Shillong and Kokrajhar Named New Host Cities",
    "WWE NXT Results: Thea Hail Wins NXT Women's Championship No. 1 Contender Battle Royal",
    "WWE NXT: Bron Breakker Challenges Seth Rollins for World Heavyweight Title",
    "French Open: Carlos Alcaraz Books Novak Djokovic Clash as Aryna Sabalenka Condemns Ukraine War",
    "Summertime Digestive Issues: Avoid Bloating With This Homemade Drink",
    "Sunny Leone Is A Beach Babe In A, Wait For It, Blazer",
    "Shehnaaz Gill's Fashion Choices That Are Just Pure Black Magic",
    "5 Superfoods To Include In Your Diet For A Glowing Skin",
    "Reasons Why You Need To Start Having Mira Rajput’s Favourite Summer Snack, Litchi",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Why are Nazi Symbols Spotted on Ukraine's Frontlines? The Complex Issue EXPLAINED",
    "When Did Mark Zuckerberg Become 'Shredded'? All About His Controversy With Jiu Jitsu EXPLAINED",
    "BJP-Congress Slugfest Over Anti-Cow Slaughter Law in Karnataka: What's the Row? EXPLAINED",
    "'Fail-proof' Relay Rooms: Officials Say 'Intentional Malfunction' May be Behind Odisha Disaster",
    "Opinion | Why Bollywood Must Get Used to More Big-Budget Failures and Sleeper Hits",
    "Opinion | G7 Has Passed Its Expiry Date, Time to Disband It",
    "Opinion | Budget Airlines Or Air Buccaneers? Govt Needs to Rein in Opaque System of Surge Pricing",
    "Opinion | From Agniveers to Resilient Entrepreneurs: What India Can Learn from Israel",
    "Opinion | Pakistan Army and Its Imran Khan Dilemma: No Light at the End of the Tunnel",
    "‘Bill to Be Subsidised Only if....': Karnataka Govt on Free Electricity Proposal, Hiked Tariff",
    "White House Remarks on Indian Democracy 'Tight Slap' on Rahul Gandhi: BJP",
    "Nitish Sees off First Batch of Haj Pilgrims; Launches Indirect Attack on BJP",
    "Manolo Marquez Confident FC Goa Will 'Field a Good Team and Enjoy a Good Season'",
    "Karim Benzema Joins Saudi Pro League, Signs Three-Year Deal With Al Ittihad",
    "Kerala Blasters 'Temporary Pauses' Women's Team After Being Fined by AIFF for Forfeiting ISL Game",
    "ISL Transfer News: Odisha FC Sign Centre-back Mourtada Fall on 2-year Deal",
    "Pakistan's SAFF Championship 2023 Participation in Doubt, Yet to Get NOC to Travel to India"
]