[
    "Mumbai: Smoke Seen Coming From Top Floor of Trident Hotel, Mumbai Police Says 'No Fire'",
    "Kangana Ranaut Takes Another Indirect Dig at Adipurush? Says 'People Were So...'",
    "Kerala Man Stabbed to Death by Roommate in London, Third Killing of Indian National This Week",
    "Tamannaah Bhatia, Vijay Varma Set Instagram on Fire With Sensual Shoot; Photos Go Viral",
    "6 Earthquakes, Two Within 15 Minutes, Hit J&K and Ladakh Region in 24 Hours",
    "Bigg Boss OTT 2 LIVE Updates: Salman Khan Introduces Pooja Bhatt As The Final Contestant",
    "WATCH: IShowSpeed Finally Meets His Idol Cristiano Ronaldo as Duo Hits 'Siu', YouTuber Cries Later",
    "100+ Happy Father’s Day 2023 Wishes, Quotes, Images and WhatsApp Status For Your Dad",
    "Vijay Varma & Tamannaah Bhatia Are In Love & 'Happy' | DYK Tammy Broke Her No-Kiss Policy For Him?",
    "Adipurush Music Composer Duo, Ajay-Atul On Making 'Jai Shri Ram' Song For The Film | EXCLUSIVE",
    "Ali Fazal On His Role In Kandahar, Mirzapur 3 & A Possible Cameo In Fukrey 3 | EXCLUSIVE",
    "Kangana Ranaut Shares ‘Ram Ka Naam Badnam Na Karo’ Song As Adipurush Gets Mixed Reviews",
    "Ranveer Singh Carries Karan Deol, Dances To Dil Le Gayi Kudi At His Sangeet; Watch Video",
    "Hot! Nikki Tamboli Flaunts Cleavage In Bold Off-Shoulder Dress, Sexy Photos Go Viral",
    "Bigg Boss OTT 2 Time, Where To Watch Online: Here's How To Stream Salman Khan Show Live",
    "BTS 2023 Festa In Yeouido: RM, Jungkook To Perform LIVE, Where And How To Watch Online In India",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WATCH: Usman Khawaja Throws His Bat Up in the Air to Celebrate His First Test Hundred in England",
    "'Can You Imagine an ICC Event Without India vs Pakistan?': Ex-IND Opener Questions as WTC 3 Begins",
    "Ambati Rayudu to Join Politics, May Contest Lok Sabha Polls: Report",
    "Om Raut's Old Tweet 'Trolling' SRK's 'FAN' Goes Viral As 'Adipurush' Gets Panned ...",
    "'Adipurush' Roasted Over VFX, Costumes As Twitter Comes Armed With Honest Memes",
    "What Era Are You in Right Now? Desis Share Memes to Express Bittersweet Mood in  ...",
    "Gaddiya Uchiya Rakhiya: Vicky Kaushal's Viral Reel Has Spawned Hilarious Out-of- ...",
    "Bollywood Songs to Dedicate to Your Dearest Dad This Father's Day 2023!",
    "Karan Singh Grover Says He Wants To Cherish Devi's Firsts: 'Want To Be A Better Dad Everyday'",
    "Google Doodle Celebrates Life of Dr Kamala Sohonie, First Indian Woman to Get PhD in Science",
    "Twitter Video App For Smart TVs Is 'coming', Says Elon Musk",
    "Autistic Pride Day: Caregiving In Survival & Development | English News",
    "Gold Rate Today In India: Check 22 Carat Price In Your City On June 18",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "If Cricketers Were Marvel Superheroes…",
    "Happy Father's Day 2023: Wishes, Images &...",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Shilpa Shetty Encourages Surya Namaskar",
    "9 Great Benefits Of Cycling",
    "Hotness Alert! Celebs Who Went Topless",
    "6 Zodiac Signs That May Have Difficult...",
    "Meet Drisha Acharya, Karan Deol`s Fiancé",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Astrological Predictions for June 17, 2023",
    "Kriti Sanon Inspired Saree Looks",
    "WhatsApp Users Can Send Video Messages",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Astrological Predictions for June 16, 2023",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Remembering Sushant Singh Rajput",
    "Astrological Predictions for June 15, 2023",
    "Top 6 Budget-friendly ACs Under Rs 30,000",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "ODI WC Qualifier: If We Don't Qualify for the Main Event, We Go a Step Lower, Says Carl Hooper",
    "Bangladesh Recall Afif Hossain, Naim Sheikh in 15-Man Roster For ODI Series Against Afghanistan",
    "PM Modi Proposes G20 Membership for African Union; Sources Say 'Bold Step'",
    "Yoga Day 2023: PM Modi to Lead Celebrations With People From Over 180 Countries At UN HQ",
    "Gurugram Real Estate: Metro's Extension To Push Housing, Commercial Realty At Dwarka Expressway",
    "Forex Fluctuation: India's Foreign Exchange Reserves Decline $1.32 Bn to $593.75 Bn",
    "Infosys Work From Home Ends: Employees Asked To Return To Office To Avoid Disciplinary Action",
    "Petrol, Diesel Fresh Prices Announced For June 17: Check Fuel Rates In Your City",
    "GST Evasion: FM Nirmala Sitharaman Chairs Review Meeting On Drive Against Fake Billing",
    "Bollywood Divas And Their Stylish Beach Vacations In Pictures",
    "Malaika Arora Aces Her Gym Look In Simple Athleisure Wear, See Photos",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "US Man Wins Rs 41 Lakh In Lottery And His Winning Strategy Is...",
    "Video Of Thirsty Squirrel Asking For More Water Is Too Cute To Miss",
    "'Adipurush' Day 1 Has Been a Roller Coaster Ride. Here’s Everything Bizarre That Unfolded",
    "Uncovering History: This 3,000-Year-Old Sword Found In Germany Still Shines",
    "JEE Advanced 2023 Results Today, Steps To Check Results At jeeadv.ac.in",
    "JEE Advanced Result 2023 LIVE: IIT Guwahati To Release Result Today, What To Check In Scorecard",
    "HPBOSE Class 10th, 12th Compartment, Improvement Exam to be Held in July",
    "CUET UG 2023 Admit Card for June 19, 20 Exam Out at cuet.samarth.ac.in",
    "More Education & Career News",
    "Musk's Brain Chip Firm Neuralink to Start its First Human Trial This Year",
    "OpenAI Has Taken YouTube's Help To Train ChatGPT And Other AI Models: Report",
    "How To Use iOS 17's StandBy Feature To Transform Your iPhone Into A Smart Display",
    "WhatsApp Could Soon Let You Add Two Accounts On One Device: All Details",
    "All-New Hero Xtreme 160R Launched in India, Price Starts at Rs 1.27 Lakh",
    "2023 Honda Unicorn Launched in India, Price Starts at Rs 1.09 Lakh",
    "All-Electric Volvo C40 Recharge Unveiled in India, Gets Range of 530 Km",
    "Maruti Suzuki All-New MPV To Be Christened Invicto, Will Be Unveiled on July 5",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Plane Leaves Yemen Capital for Saudi Arabia Carrying Hajj Pilgrims, First Since 2016",
    "It's About Time the Super Wealthy Start Paying Fair Share of Taxes, Says Joe Biden",
    "Three People, Including Two Soldiers, Killed After Light Aircraft Crashes in Southern France",
    "Lionel Messi Likely to Make First Bow in US Against Arsenal During MLS All-Stars Clash",
    "Indonesia Open 2023: Satwiksairaj Rankireddy-Chirag Shetty Oust Kang-Seo to Storm Into Final",
    "3 Mental Health Challenges Faced By Vitiligo Patients",
    "Planning to Be A Father In Your 40’s; Here’s What You Need To Know",
    "Malvika Mohanan Sets The Temperature Soaring In A Backless Black And White Dress, See Photos",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Uniform Civil Code in Limelight Again: What it is, Major Court Judgements Around UCC | Explained",
    "Predator Drone Deal With US: What are MQ9 Reaper Drones & Why Does India Need Them? Explained",
    "Tamil Nadu Withdraws Consent to CBI for Probe in State Amid Senthil's Arrest: What Does Law Say?",
    "Chandrayaan-3 Scheduled for July Launch | A Guide to ISRO's 3rd Lunar Exploration Mission",
    "Indian Monsoon: What is El Nino and It's Impact on Rainy Season Explained",
    "Opinion | How India Can Effectively Tie Public Diplomacy to Its National Security Objectives",
    "Opinion | Why Sunny Deol’s ‘Gadar 2’ Could Spring a Surprise at The Box Office",
    "Opinion | Why Uttarakhand And Jharkhand Have Set Off Alarm Over Demographic Shift",
    "Opinion | PM Modi’s State Visit to US: Why 'Gastro-diplomacy' Must be on the Table Too",
    "Akhilesh Yadav Reveals ‘PDA’ Formula for 2024 Lok Sabha Polls to Counter BJP-led NDA in UP",
    "Toppling Elected Govts Through Horse Trading is Matter of Concern: Gehlot",
    "Nations League Final: Luka Modric's Croatia Aiming For First Trophy Against High-spirited Spain",
    "'Now I Can't Leave': World Cup Winner Lionel Messi Opens up on His Future With Argentina",
    "Germany Suffer 1-0 Loss to Poland in International Friendly"
]