[
    "Shubman Gill REACTS To Dating 'Sara' In Viral Video, Netizens Ask 'Which One, Khan Or...'; Watch",
    "Parineeti Chopra Kisses Raghav Chadha, Hugs Him and Gets Teary-Eyed In Engagement Video; Watch",
    "Denying Sex to Spouse for Long Time Without Sufficient Reason Amounts to Mental Cruelty: HC",
    "Salman Khan Wraps Up Tiger 3 Shoot, Says 'It Was Very Hectic'",
    "IPL 2023, GT vs MI Qualifier 2: From Akash Madhwal to Rashid Khan, The Players to Watch Out For",
    "The Kapil Sharma Show To Go Off-Air In July, New Season Likely In October? Know Here",
    "HP Board 10th Result 2023 Live: HP Result Declared At hpbose.org; How To Download",
    "Cannes 2023 LIVE: Sunny Leone Wows In Lilac; Raja Kumari Chooses Red At the French Riviera",
    "World Thyroid Day 2023: Symptoms of Hyperthyroidism And How To Avoid It",
    "Karan Johar: The Man, The Myth & The Legend | Why He Is The Undisputed Kingmaker Of The Industry",
    "Saba Azad Shares Her Morning Routine - Healthy Habits, Exercise & Dedicated Skincare Regime",
    "Vaibhavi Upadhyaya, Known For Roles In Sarabhai Vs Sarabhai & Crime Patrol, Dies In Car Accident",
    "Mandira Bedi Fitness Routine & Diet Plan For Toned Physique REVEALED",
    "Aahana Kumra's Message Is Quite Clear - Female Celebs Need Space | Malaika Arora | Kareena Kapoor",
    "Sexy! Nora Fatehi Oozes Hotness In A Very Racy Outfit With Plunging Neckline, Video Goes Viral",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC Final 2023: Team India Kick-start Preparations for Australia Showdown in New Training Jerseys",
    "Aakash Madhwal: IPL's Unassuming Hero Rides on Passion and Much More",
    "Naveen-ul-Haq Reacts to 'Kohli, Kohli' Chants, Opens up on Working With 'Legend' Gautam Gambhir",
    "MI vs LSG: Rohit Sharma's Men Eye Win in IPL Eliminator Amid Intense Meme Battle ...",
    "CSK Fan's 'Prediction' of Team's 15-run Triumph Over GT in IPL 2023 Spooks Inter ...",
    "Karnataka Labourer Uses Coffee Stirrer Sticks to Craft Eiffel Tower, Golden Temp ...",
    "'Give Rs 2000 Note for Items Worth 2100': Delhi Meat Shop's Smart Offer Seals th ...",
    "Onir's Next 'Pine Cone' To Open South Asia's Largest Queer Film Festival, Kashish Film Festival",
    "After The Kerala Story, Adah Sharma Begins Shooting For Commando 4, Says 'There Will Be...'",
    "Citadel 2 Confirmed! Joe Russo To Direct Sequel of Priyanka Chopra and Richard Madden Starrer",
    "Bigg Boss OTT 2: Fahmaan Khan FINALLY Reveals If He Is Participating In Salman Khan's Show",
    "Manoj Bajpayee's 'Sirf Ek Bandaa Kaafi Hai' Witnesses A Blockbuster Opening On Launch Day",
    "Actor Ashish Vidyarthi Ties The Knot With Rupali Barua At The Age of 60; Pic Go Viral",
    "Shubman Gill Reacts To Dating 'Sara' In Viral Video; Kapil Sharma's Show To Go Off-Air In July",
    "Junior Asia Cup Hockey: India Register a Comfortable 3-1 Win Against Japan",
    "Cub Born To Cheetah Brought In From Namibia Dies In Kuno National Park | English News | News18",
    "Rocky Aur Rani Kii Prem Kahani First Look | Ranveer Singh And Alia Bhatt Kapoor | Shorts | Video",
    "Dharavi Teen Maleesha Kharwa Becomes New Brand Ambassador Of Forest Essentials | English News",
    "Priyanka Chopra Jonas Reveals A Bollywood Director Wanted To See Her Underwear | Bollywood News",
    "Astrological Predictions for Thursday",
    "Top 9 Highest Peaks In The World",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "9 Must-watch Hindi Thriller OTT Shows",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "Mouni Roy Gives Holiday Glam Goals",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "Ferrari To Launch First Electric Car in 2025",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "8 Movies to Watch on Mother's Day with Your Mom",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "9 Health Benefits Of Sleeping Naked",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Five gift ideas to make your mother feel...",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "YouTuber Agastya Chauhan Dies While...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "ITR Filing 2023: Don't Forget These Essentials",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "Inside Nia Sharma's Vacay In Sikkim",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "Check Out The Unseen Pics Of Shah Rukh...",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Jacqueline Fernandez's Fitness Routines",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Busiest Airports In The World In 2022",
    "Salman Khan Buys New Bullet-proof Car",
    "Shahid Kapoor Roped In For Malayalam Director Rosshan Andrrews' Next Action-Thriller; Deets Inside",
    "Naveen-ul-Haq Reaches Dubai, Has 'Lots to Say' After Being Brutally Trolled on Social Media",
    "Watch: Back-to-Back Run Outs Break LSG's Back, Rohit Sharma's Direct Hit Fetches MI a Big Win",
    "Happy Birthday Kagiso Rabada: Best IPL Spells by the South African Speedster",
    "Bengaluru Rain to Continue, Cyclonic Winds Near Tamil Nadu Brew More Trouble | Advisory Here",
    "New Parliament Building Row Reaches Supreme Court, Plea Seeks Inauguration by President",
    "Leave Encashment Upon Retirement: Rs 25 Lakh Tax Exemption For Salaried Employees",
    "Angel Tax Exemption For Investment In Startups From 21 Nations; CBDT Notifies Details",
    "Rs 2,000 Note Exchange In SBI, PNB Or HDFC; Check Rules Of Your Bank Here",
    "Retirement Planning In India: Here's How To Create The Best Corpus",
    "Meet Mohan Singh Oberoi, From Being a Desk Clerk To Rs 12,700 Crore Hotel Group",
    "Inside Bhumi Pednekar's Dubai Holiday: Check Out The Diva's Stunning Pictures With Her Family",
    "Megan Fox Makes Jaws Drop With Scorching Hot Bikini Photoshoot, Check Out The Diva's Sexy Pictures",
    "Uorfi Javed Bares It All In Colourful Beaded Bikini, Check Out The Diva's Sexy Pictures",
    "Cannes 2023: Mouni Roy Makes Grand Red Carpet Debut In Princess-style Ruffled Gown, See Pics",
    "Alia Bhatt, Malaika Arora, Shahid Kapoor, Ranbir Kapoor Among Celebrities Spotted Out And About",
    "Yami Gautam Trolled for Asking Followers to 'Guess' The Song in Her Instagram Story, Here's Why",
    "Did You Know The World's Largest T-Shirt Is As Big As A Rugby Pitch?",
    "Man And His Non-Biological Child: Twitter's Viral Thread is Here to Remind You About Epic Duos",
    "Father-Son Duo Jailed For Orchestrating Rs 165 Crore Lottery Fraud",
    "Mystery Behind Rare Extra Crease In Pinky Finger; What Does It Mean?",
    "RBSE 12th Arts Stream Result 2023 Sees 92.35% Clearing Exam, Girls Outperform Boys",
    "Kerala DHSE +2 Results 2023 Released, 82.95% Pass HS 12th Exam",
    "MP Board 12th Result 2023: Decline in Pass Percentage, 55.28% Pass MPBSE Inter",
    "Maharashtra HSC Result 2023: Konkan Best-performing District, 91.25% Students Qualify",
    "More Education & Career News",
    "Gurugram Resident Loses Rs 70 Lakh In WhatsApp Work-From-Home Scam: How It Happened",
    "Windows PCs Will Finally Get Native Support For RAR Files: What It Means",
    "All Major Announcments From PlayStation Showcase: Spider-Man 2 Gameplay, New Handheld And More",
    "Google Wants To Bring Ads To Its Generative AI Search Results",
    "WhatsApp To Replace Phone Numbers With Usernames: Here's How It Will Work",
    "Mercedes-Benz Launched A 200 Limousine and AMG A 45 S 4MATIC+ Facelift, Details Inside",
    "Tata Tiago Driver's Miraculous Survival After Collision with Pickup Truck, Watch Video",
    "Elon Musk Sets Sights on India, Tesla's New Factory Location to be Sealed in 2023",
    "Simple One Electric Scooter Launched in India, Price Starts at Rs 1.45 Lakh",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Pakistan Govt Puts Imran Khan, Wife Bushra Among 80 PTI Members on No-fly List Over May 9 Violence",
    "Tipu Sultan's Bedchamber Sword Sold for ₹140 Crore at London Auction: Report",
    "‘Don’t Bother’: Bangladesh Responds as US Threatens Nation with New Visa Policy",
    "US Officials Suspect Ukrainian Hand in May 3 Drone Attack on Kremlin: Report",
    "'Russia Could See New Revolution': Putin's Ally Says War in Ukraine Backfired, Moscow 'Unprepared'",
    "F1: Championship Leader Max Verstappen Plays Down Importance of Monaco GP Win",
    "Neeraj Chopra's Finland Training Proposal Gets Approval",
    "UTT Season 4: Sathiyan Gnanasekaran, Ahanta Sharath Kamal Among Four Paddlers Retained",
    "Mrunal Thakur: From Nashik to Cannes Felt Like An Amazing Journey | Exclusive",
    "Aditi Rao Hydari Is A Vision In Blue, Exudes Grace And Elegance In A Gown At Cannes, See Photos",
    "African Misal: This Version of Misal is Making Food Lovers Take a Trip to Pune",
    "Shraddha Kapoor's Go-To Summer Outfits Are Worth Bookmarking; Pics",
    "Esha Gupta, Sunny Leone Rock the Same Bodycon Dress but With a Twist; See Photos",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Numerology Today, May 6: How Compatible is Number 8 with Number 7 and 9",
    "US Debt Ceiling: How Will the Average American Suffer in Case of Default? 10 Scary Points",
    "'He is the Boss': Australia's 'Rocking' Welcome to PM Modi | Explained",
    "What is a Sengol, the 'Symbol of Power & Justice' to be Installed in New Parliament Building?",
    "Imran Khan's 'Crusade': Amid Legal Battles and Trouble in PTI, the Pakistan Story Summed Up",
    "Opinion | Karnataka Lessons: Time’s Ripe For RSS And BJP To Rediscover Their Ideological Moorings",
    "Opinion | Hiroshima G7 Summit: Rhetoric and Reality",
    "Opinion | How PM Modi Uses Diaspora Diplomacy To Push The Rising India Story",
    "Opinion | Naya Kashmir Shines on the Global Stage",
    "Cong Tucked Away Sacred 'Sengol' in Museum, Called it 'Golden Stick Gifted' to Nehru: BJP",
    "New Parliament Row: 2 Parties Accept Invite to Attend Inauguration Amid Mass Boycott by Opposition",
    "India Clubbed with UAE, Maldives, China in AFC U-23 Asian Cup Qualifiers",
    "Liverpool Almost Closes Deal With Brighton Star Alexis Mac Allister: Report",
    "Manchester United May Target Real Madrid's Vinicius Jr in Blockbuster Transfer Move"
]