[
    "Joint Candidate in 2024? Oppn Ready to Go All In, But Cong May Not Agree to Stay Out of the Way",
    "Excise Policy Scam: Delhi HC Rejects Manish Sisodia's Bail Plea; AAP Leader to Move SC For Relief",
    "IPL 2023 Prize Money: CSK Get Rs 20 Crore, Gill Wins 4 Awards & Rs 40 Lakh- Full List Here",
    "When Saroj Khan Recalled Her Major Fallout With Salman Khan: 'Roti Allah Deta Hai... Tu Nahi'",
    "Mumbai-Goa Vande Bharat Gathers Steam; Rollout Expected in June| Here’s How It Will Ease Journey",
    "Delhi: Extended Ashram Flyover Completely Open For Heavy Vehicles, Details Here",
    "Anushka Sharma and Sakshi Dhoni Are Childhood Friends, Studied In Same School; Here's Proof",
    "Delhi Sakshi Murder: Are You Sure Your Partner Would Not Murder You? 10 Signs To Look Out For",
    "Moscow Suffers Minor Damage as Drones Attack Russian Capital",
    "'More Than 22 Players Tonight': Swiggy Sold 2423 Durex Condom Packets on IPL 2023 Final",
    "Know The Govt Schemes That Offer Higher Interest Rates Than Fixed Deposits",
    "Parineeti & Raghav Chadha To Follow Priyanka Chopra's Suit; Will Have Winter Wedding In Rajasthan?",
    "Gadar Ek Prem Katha To Re-Release In Theatres | Kiara, Kartik Shine In SPKK First Song | News Wrap",
    "Does Eating Mangoes Cause Breakouts & Acne? | Common Myths About Mango BUSTED",
    "When Priyanka Chopra Shut Karan Johar Up In Front of Kareena: 'I Wasn't Invited To Your...'",
    "Sexy! Ameesha Patel Turns Up The Heat In A Very Racy Strapless Dress, Hot Video Goes Viral; Watch",
    "Shubman Gill Gets Stumped By Dhoni Moments Before Sara, Vicky Kaushal Spotted At IPL Final",
    "Kajol Admits Dushman Makes Her 'Uncomfortable,' Talks About Ashutosh Rana As Film Clocks 25 Years",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Rinku Singh Interview: ‘Itna Nahi Soch Raha, Kismat Mein Hoga to India Khel Jayenge’ | Exclusive",
    "Chennai Super Kings Beat Gujarat Titans in Rain-Affected Final to Clinch Fifth IPL Title",
    "WATCH: Ravindra Jadeja Hugs Wife Rivaba After Handing CSK a Memorable Win in IPL 2023 Final",
    "WATCH: Ravindra Jadeja Dedicates IPL 2023 Final Win to 'Special CSK Member' MS Dhoni",
    "Was Dhoni in Zen Mode After CSK's Thrilling Victory Over GT in IPL 2023 Final?",
    "Virat Kohli's Poster Protects Fans From Rain in IPL 2023 Final, Internet Lauds T ...",
    "Viral Pic Shows US Pilot Scaling Cockpit Window After Being Locked Out of Plane",
    "Delhi Metro's 'Far From Her Memories' Stop is the Destination of All Broken Hear ...",
    "World No Tobacco Day 2023: How Tobacco Smoke Can Affect Your Lungs, Heart and Fertility",
    "When Karan Johar Tried to Have Sex On Plane: 'The Tiny Loo Wasn't Big... It Was A Bit Messy'",
    "World No Tobacco Day 2023: 7 Innovative Ways to Triumph Over Smoking Urges",
    "This Seagull Scarer Earns Rs 20,000 Per Day, Drives Away Birds",
    "Bank Holidays In India: Banks Closed For 12 Days In June 2023; Check Full List Here",
    "What is Hover Cover and Why IPL 2023 Fans Trended it During CSK vs GT Final Match?",
    "ED Conducts Searches Against Jharkhand Congress MLA in Money Laundering Case",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "This Mother-Son Reunion Will Make You Go Aww",
    "9 Upcoming OTT Releases in June",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "Top 9 Places to Visit in India Before You...",
    "Astrological Predictions for May 30, 2023",
    "Nothing Phone (2) To Launch In July",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Deepika Padukone Looks Embarrassed As She Reveals Bingeing On Sima Taparia's Show; Watch Video",
    "Sara Ali Khan, Vicky Kaushal In Disbelief As Jadeja Clinches IPL Win for CSK; Video Goes Viral",
    "IPL 2023: Gujarat Titans Opener Shubman Gill Clinches Orange Cap",
    "Virat Kohli Trains Hard in Nets Ahead of World Test Championship Final - See Photos",
    "J&K: Civilian Shot Dead by Terrorists in Anantnag; Politicians Condemn 'Heinous Targeted Attack'",
    "Stock Market Updates: Sensex Drops Over 50 pts, Nifty Near 18,580; IRCTC Down 3%",
    "Air India Hiring 600 Cabin Crew Members, Pilots Every Month: CEO Campbell Wilson",
    "Stock Broker May Hide These Things From You; Know What Former BSE Chairman Suggests",
    "Special Rs 75 Coin: What Is Its Price & How Can You Buy It?",
    "Esha Gupta Raises Temperature In Backless Black Gown, Check Out The Diva's Sexy Pictures",
    "See Unseen Photos From Ashish Vidyarthi's Wedding To Assamese Entrepreneur Rupali Barua",
    "Janhvi Kapoor Enjoys Tropical Holiday By Going Makeup-free, Check Out The Diva's Sexy Pictures",
    "10/10 For Finding The Odd Word In This Puzzle In 5 Seconds",
    "'Her Prayers Were The Loudest,' Video Of CSK Fan Crying Heart Out In IPL Final Goes Viral",
    "'Rain, Come Another Day': Memes Poured on Twitter During Delay in CSK-GT IPL 2023 Final",
    "This 2013 Tweet By MS Dhoni Is The Ultimate Take On Finisher 'Sir' Ravindra Jadeja",
    "JAC Jharkhand 12th Arts, Commerce Results 2023: How to Check Online, via SMS, DigiLocker",
    "WBCHSE 12th Board Exams 2024 To Begin On February 16, Check WB Uccha Madhyamik Timetable",
    "UPSC CDS Rank 11 Sanjiv Jajoo Clears Exam After 7 Failed Attempts, Says It's been 'Challenging'",
    "Afghan Woman Bags IIT Degree In Chemical Engineering; Hid 'Lab' In Home From Taliban",
    "More Education & Career News",
    "WhatsApp To Release Status Archive Feature For Businesses On Android: All Details",
    "OnePlus 11 5G Marble Odyssey Edition Launched In India: Price, Specs & Availability",
    "Twitter Not Paying PR Firm's Bills After Elon Musk Buyout: Report",
    "ISRO GSLV F12/NVS -1 Mission: Rocket Carries 2nd-gen NavIC Satellite",
    "Mumbai Metro Line 3: DMRC Gets Contract To Operate City's First Fully Underground Corridor",
    "From Scorpio N to XUV700 and Thar, Check Waiting Period For All Mahindra SUVs in India",
    "Upcoming Honda Elevate SUV to Feature ADAS Tech, Details Here",
    "Thiruvananthapuram International Airport: E-gate System Installed, Turns Paperless",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Mass Shooting at Florida's Hollywood Beach Injures Nine People, Including Three Minors",
    "UK Bars Export of Tipu Sultan’s Rare Sporting Gun Valued at 2 Million Pounds",
    "Pakistan and Russia Launch Direct Shipping Service",
    "IMF Looks for Board Meeting on Pakistan Before Current Program Expires",
    "South Africa Grants Putin Diplomatic Immunity for Upcoming BRICS Summit",
    "Neeraj Chopra Injured! 'Sustained A Muscle Strain During Training', Pulls Out of Competition",
    "PV Sindhu and Kidambi Srikanth Eye Good Show in Thailand Open",
    "Monaco Grand Prix: Max Verstappen Clinches Victory From Pole, Fernando Alonso Second",
    "Inclusivity 101: How Is Mental Health Support A Key Element Of An Inclusive Work Culture?",
    "Gen-Blend Romances: Study Reveals How Indians Are Embracing Age-Gap Relationships",
    "Sharvari Wagh Was at Her Hottest Best in a Cutout Black Gown at the IIFA; See Photos",
    "The World’s Best Hotel, Rambagh Palace’s Most Expensive Room Will Astound You; Details Inside",
    "Here’s Why You Should Avoid These 4 Foods On An Empty Stomach",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "What is a 'Bare Minimum Monday' & Why You'd Want Your Boss to Get Behind this New Work Trend",
    "Turkey's Erdogan Wins Historic Runoff Election: What are the Challenges that Lie Ahead?",
    "ISRO's GSLV Rocket Propels Next-Gen Navigational Satellite NVS-01: Why This is Remarkable",
    "Transfer of Power Aside, BJP's 'Sengol' is Part of a Larger Political Play in its Tamil Nadu Plan",
    "Wrestlers' Protest: What are the Allegations Against WFI Chief? Explained As Police Book Agitators",
    "Opinion | China’s Unfolding Airliners – Time for India to Get Its Own",
    "Opinion | Naya Sansad for Naya Bharat as Sun Sets on Nehruvian India",
    "Opinion | Dharma is the Atman of Civilisational and Cultural Heritage of India",
    "OPINION | A Naya Sansad for a Proud Naya Bharat",
    "OPINION | The USA’s Debt Ceiling Crisis Puts the Dollar and its War Machine at Risk",
    "BJP to Win Over 200 Seats in MP, Congress Claim is 'Khayali Pulao', Says CM Shivraj Chouhan",
    "Congress Unites: Gehlot, Pilot Unanimously Agree in Joint Fight Against BJP in Rajasthan",
    "La Liga: Barcelona Thrash Mallorca 3-0 as Ansu Fati, Gavi Strike at Camp Nou",
    "Serie A: Lecce Seal Survival With Win Over Monza, Lazio Beat Cremonese to go Second in League",
    "Premier League: Manchester City Defend Title as Leeds, Leicester, Southampton Relegated",
    "PSG Keeper Sergio Rico in Intensive Care Following Horse Riding Accident in Spain",
    "Luton Town Complete Fairytale Rise from Dark Days of Fifth Tier to Premier League"
]