[
    "Ayodhya Only Two Hours from Lucknow, Gorakhpur After PM Modi Flags Off Vande Bharat Today",
    "Delhi to Receive Rains for Next 5 Days, Alert Issued for Goa, Kerala Among Other States | Details",
    "'You Asked And It's Here': Sourav Ganguly to Announce Something Special on His 51st Birthday",
    "Jawan Trailer: Nayanthara First Look From Shah Rukh Khan Film Leaks Online? Photo Goes Viral",
    "Ranveer Singh To Be Announced as New Don After RRKPK Release? Here's What We Know",
    "Chandrayaan-3: India's Moon Mission Set for Launch on July 14 | All You Need to Know",
    "Did Mark Zuckerberg Drop An Update On Cage Fight With Elon Musk After Threads' Launch?",
    "Attention UPI Users! Common Mistakes To Avoid When Making UPI Payments",
    "Mona Singh On Her New Web Show 'Kafas', 'Jassi Jaisi Koi Nahin' & 'Laal Singh Chadha' | EXCLUSIVE",
    "Deepika Padukone & Sonakshi Sinha Spotted Wearing The Same Coord Sets; Who Styled It Better",
    "Ranveer Singh Birthday: Will He Reclaim His Throne With Rocky Aur Rani Kii Prem Kahaani Release?",
    "Sonu Sood Flexes His Muscles Giving Major Fitness Goals In Latest Workout Video",
    "Vijay Varma Teases Tamannaah Bhatia As They Discuss Sex, Lust; Her Reaction Goes Viral",
    "Tamannaah Bhatia Sizzles, Shakes a Leg With Rajinikanth In Jailer Song Kaavaalaa; Watch",
    "Salaar Teaser: Fan Spots MAJOR Clue Hinting At Biggest Crossover Between Prabhas, KGF Star Yash",
    "Sexy! Nikki Tamboli Goes Bold In A Very Plunging Mini Dress, Hot Video Goes Viral; Watch",
    "When Anil Kapoor Said He Would 'Leave' Wife Sunita Kapoor For Kangana Ranaut: 'She Is So...'",
    "BTS: Jungkook Leaves ARMYs Gasping For Breath As He Drops Shirtless Photo, Teases 'Seven' Schedule",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Son of a Tuition Teacher, Rounak Waghela, 15, Donates Part of His BCCI Match Fees to Coach",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be  ...",
    "Vande Bharat Passenger Upset Over 'Now vs Then' Quality of Food, IRCTC Responds  ...",
    "Did You Know 'Jaane Tu Ya Jaane Na' Had an Easter Egg Tribute to Samuel Beckett' ...",
    "What Happens When a Bird Hits An Aeroplane At High Speed? Scary Pic Goes Viral",
    "Nayanthara First Look From Jawan Leaks Online?; Mission Impossible Dead Reckoning 1st Reviews Out",
    "Remo D'Souza Brings India's First Hip Hop Dance Reality Show Hip Hop India; Details Inside",
    "Bigg Boss OTT 2: Akanksha Puri Bashes Salman Khan, Accuses Him of 'Changing Minds of Contestants'",
    "The Idol Star DaVine Joy Randolph Has This To Say About The Finale Plot Twist",
    "David de Gea Posts Cryptic Tweet Even as Manchester United Future Remains Unsure",
    "Bengal Panchayat Polls Ground Report | No Campaigning, No Voting—Why Giria Has Given Up",
    "NCP Entry Triggers Berth Pangs in Shinde Camp, CM Leaves President's Tour to Pacify Sena MLAs",
    "Alzheimer: This Country Has Approved New Drug That Will Combat Cognitive Decline",
    "'Barbie' Film's World Map is 'Child-Like' Drawing, Says Warner Bros after Vietnam Ban",
    "Britney Spears Claims US Basketball Star Wembanyama's Security Struck Her at Las Vegas Casino",
    "9 Interesting Facts About MS Dhoni",
    "9 Destinations To Visit In Monsoons",
    "Threads: Step-By-Step Guide To Sign-Up",
    "Ranveer Singh Birthday: Actor Imagined As...",
    "6 Health Benefits Of Raspberries",
    "Astrological Predictions for July 6, 2023",
    "Maruti Suzuki Invicto Launched In India",
    "6 TV Divas Stun In Bikinis",
    "Animals Who Have Great Memory",
    "5 Ways To Achieve Work-Life Balance",
    "Corporate Lessons From Chanakya",
    "JioBharat 4G Mobile Launched: Price And...",
    "What If 'Friends' Was Made In India?",
    "5 Phones Set To Launch This Week",
    "9 Divas Slay In Sexy Bikinis",
    "Shravani Mela Special Trains Announced",
    "9 Benefits Of A Plant-based Diet",
    "Buy iPhone 14, iPhone 14 Plus At Huge...",
    "6 Bollywood Actors Ruling OTT Platforms",
    "9 Tips To Stay Healthy In Monsoon",
    "7 Times Celebrities Slayed In Pearls",
    "Who is Akanksha Puri, Bigg Boss OTT 2...",
    "If South Indian Stars Turned Spiritual Gurus…",
    "WhatsApp Will Let You Share High-Quality Videos",
    "Most Powerful Numbers In Numerology",
    "9 Of The Highest-Grossing Hindi Films Of 2023",
    "Have You Linked Your PAN-Aadhar Card?",
    "5 Benefits Of Sleeping Next To Someone You Love",
    "Monthly Horoscope For July 2023",
    "9 Tips To Take Care Of Your Coloured Hair",
    "8 Tips To Take Care Of Your Pets During...",
    "Meet Jassym Lora Russell, Andre Russell's Wife",
    "9 Big Hindi Movies Releasing Soon",
    "7 Tips To Smell Good In Hot Weather",
    "ICC World Cup 2023: Match Schedule Of Team...",
    "7 Indian Restaurants In World's Legendary...",
    "How To Grow Sunflower In A Pot?",
    "How To Make Joint Financial Decisions As A...",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "5 Food Combinations with Milk to Avoid",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Shilpa Shetty Encourages Surya Namaskar",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Malaika Arora Rushes To Her Father As He Gets Hospitalised, Helps Mom Joyce Arora To Get Into Car",
    "Rishabh Pant Makes His Debut on Threads Asks Mark Zuckerberg to Join His Thread",
    "Bas de Leede's All-round Show Helps Netherlands Book Last Spot in 2023 ODI World Cup",
    "Delhi Liquor Policy Case: ED Arrests Manish Sisodia's Close Aide Dinesh Arora",
    "AC in Truck Cabins Soon, Nod to Draft Notification for Comfortable Working Conditions for Drivers",
    "Modi Surname Defamation Case: Gujarat HC to Deliver Verdict on Rahul Gandhi's Plea on Friday",
    "PPF Account: Check Features, Tax Benefits, Interest Rates Comparison With Bank FD",
    "Bitcoin Touches 13-Month High Level, Jumps 3.28% To $31,500",
    "Retail Inflation Likely To Have Remained Flat At 4.26% In June: Barclays",
    "Disha Patani's Lifestyle Magazine Cover Shoot, Check Out Her Sexy Photos",
    "Ahead of MS Dhoni's 42nd Birthday, Know All About CSK Captain's Cute Love Story With Sakshi",
    "Made in Heaven, Bandish Bandits And Other Indian OTT Shows To Look Forward To",
    "Mouni Roy's Gorgeous Moments In Sarees, Check Out Her Top 6 Looks",
    "Haute Couture Diva: Shilpa Shetty Raises Temperature In A Red Cutout Dress",
    "Radhika Madan Exudes Elegance In Bright Pink Lehenga, Check Out The Diva's Stunning Pictures",
    "Sobhita Dhulipala's Ravishing Corset Look, Check Out Her Sizzling Pics",
    "Rekha's Cover Shoot For Fashion Magazine Cover: She Rules The Golden Theme",
    "Hot! Chitrangada Singh Is a Smokeshow Sporting a Tangerine Pant Suit and a Sexy Black Bralette",
    "Soha Ali Khan-Kunal Kemmu's Trip To Disneyland With Daughter Inaaya, See Pics",
    "Dhoni’s Cheekiest Stump Mic Recordings Captured in Viral Twitter Thread",
    "'I Am Scared': Kerala YouTuber Behind Mohanlal Deepfake Edit Urges People to Be Cautious",
    "Created Threads Account? You Can’t Delete it Without Deleting Instagram and People are Livid",
    "Threads App is Here to Rival Twitter and Desis Are Already Weaving Hilarious Memes",
    "Sister-In-Law Exposes Bride's OnlyFans Account At Engagement; Internet Demands Apology",
    "TS SSC Supplementary Result 2023 Likely to Be Released Next Week, Check Latest Update",
    "Mark Your Calendars As School Holiday Schedule For July And August Is Here",
    "UPSC Success Story: 5 IITians Who Left High-paying Jobs To Become IAS, IPS",
    "CUET UG 2023 Results Expected To Be Declared On This Date",
    "First IIT Madras Campus Outside India Will be Set up in Tanzania’s Zanzibar, MoU Signed",
    "More Education & Career News",
    "Threads Is Offering Easy Sign-Up: How To Follow Your Instagram Friends, Import Bio",
    "What Is Meta's Threads And How To Use It: A Step-By-Step Guide",
    "Samsung Galaxy Unpacked Event Officially Confirmed For July 26: Check Timings, What To Expect",
    "ChatGPT-Maker OpenAI Says It Is Doubling Down On Preventing AI From 'Going Rogue'",
    "Meta Launches Twitter Rival Threads, Posing a Direct Challenge to Elon Musk",
    "Bajaj-Triumph Speed 400 Launched at Rs 2.23 Lakh, Scrambler 400X Price Reveal Later",
    "Maruti Suzuki Invicto Launched in India, Price Starts at Rs 24.79 Lakh",
    "Vande Bharat Express: Chennai to Vijayawada in Just 6.5 Hours, Check Details",
    "Indian Railway to Introduce Affordable Non-AC Vande Sadharan Train, Check Details",
    "2023 Kia Seltos Facelift Unveiled, Bookings Start from July 14",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Pakistan: Landslide Kills 8 Children in Khyber Pakhtunkhwa Province",
    "Titanic Submersible Tragedy: Sub Operator Halts All Expeditions Indefinitely",
    "Pakistan Govt Kicks Off Legal Battle Against Former PM Imran Khan, His Party PTI",
    "India Rejects Ruling by Permanent Court of Arbitration in Dispute with Pakistan",
    "NSA Doval Holds Talks with French President's Advisor; Focus on PM's Paris Visit Next Week",
    "Wimbledon 2023: Alexander Zverev Downs Qualifier, Andrey Rublev Beats Compatriot",
    "Grand Chess Tour: Indian GM Viswanathan Anand Shoots to Top in Zagreb on Day 1",
    "Canada Open: PV Sindhu, Lakshya Sen Advance to Second Round, B Sai Praneeth Ousted",
    "‘Paris 2024 is the Main Goal’: Story of Para-Badminton Star Vaishnavi Puneyani’s Unwavering Spirit",
    "Mouni Roy Looks Every Bit Gorgeous in a Blue Strapless, High-Slit Gown; See Photos",
    "8 Times Janhvi Kapoor Taught Us to Slay Classy and Sexy in Breathtaking Ethnic Attires",
    "Malaika Arora Steals the Show for Ghazal Gupta; 5 Times the Diva Wowed in Ethnic Attires",
    "Indians, Second Most Confident Travellers in Asia-Pacific, Reveals Survey",
    "World Zoonoses Day 2023: History, Significance, and How to Celebrate",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "All About the Digital Personal Data Protection Bill, 2022 | Explained",
    "What is a Demarche that the Indian Govt Has Issued to Canada Over 'Pro-Khalistani Activities'?",
    "After Maharashtra's Maneuvers, Will Bihar Boil With Political Upheaval? Explained",
    "Orkney Wants to Leave UK to Join Norway, But Why?",
    "Opinion | The Teesta Setalvad Files: A Sordid Saga of Forgery and Perjury",
    "Opinion | Dr Syama Prasad Mookerjee and Subhas Chandra Bose: The Icons of West Bengal",
    "Opinion | How Nephew Ajit’s Betrayal Would Hurt Sharad Pawar For The Rest Of His Life",
    "Opinion | SCO is Neither About Security Nor Good Neighbourliness, But it Has a Hidden Potential",
    "Global Watch | Violence in France: An Inevitable Clash of Civilisations",
    "Cong Says It'll Fight Rajasthan Polls Unitedly and Win; Party Unlikely to Declare CM Face",
    "Nobody Unhappy in My Party Over Ajit Pawar Joining Govt, Says Maha CM Eknath Shinde",
    "Real Madrid Sign Arda Guler on Six-year Deal from Fenerbahce",
    "Jim Ratcliffe Still Keen to Buy Manchester United as Sale Process Drags On",
    "Mason Mount Says, 'Keen to Replicate Manchester United Legends Who Donned the Number 7 Shirt'",
    "Paris Saint-Germain Signs Free Agent Marco Asensio on 3-year Deal"
]