[
    "Rain News LIVE: Yellow Alert in Mumbai, Tourist Advisory in Himachal; Intense Spell Over Kolkata",
    "BJP 'Very Unlikely' to Field over 50% Haryana MPs in 2024 Lok Sabha Polls",
    "Ghajini Actor Asin Sparks DIVORCE Rumours, Deletes All Pics With Husband Rahul Sharma",
    "British Actor Julian Sands Died While Hiking on California Mountain, Authorities Confirm",
    "Kusha Kapila's Ex-Husband Zorawar Reacts For 1st Time To Divorce, 'To Attack Her Character Is...'",
    "Pune: Woman Attacked by Man With A Machete; Locals Save Her | VIDEO",
    "S Jaishankar, Derek O'Brien's Rajya Sabha Seats Among 10 to Go to Polls on July 24",
    "England Captain Ben Stokes 'Sorry' After Cricket Report Exposes Racism and Sexism",
    "For This Year's 'Rare' Sawan, CM Yogi Bans Sale of Meat on UP's Kanwar Yatra Routes | Check Plan",
    "Karan Johar Trolled For 'Ignoring' Shreya Ghoshal In Rocky Aur Rani Kii Prem Kahaani Song Teaser",
    "Petrol, Diesel Fresh Prices Announced For June 28: Check Fuel Rates In Your City",
    "Sabyasachi, Manish Malhotra and Anita Dongre To Represent India at the Animal Ball 2023 in London",
    "Sex And The City Star Sarah Jessica Parker Wears Indian Designer | Desi Designers Who Went Global",
    "Tamannaah Bhatia & Vijay Varma On Love And Their Film 'Lust Stories 2' | Sujoy Ghosh | EXCLUSIVE",
    "Kartik Aaryan Flies Economy; Sara Ali Khan Enjoys Temple Runs - Reality Or Publicity Stunts?",
    "Oral & Dental Hygiene: Arginine Can Help You Maintain Health Of Your Teeth & Gums | Know How",
    "Vivek Agnihotri Answers If Censor Board Had No Objections To Adipurush, Says 'We Don't Watch Film'",
    "Kusha Kapila Trolled For Agreeing With Karan Johar Amid Divorce: 'Sexual Infidelity Is Not...'",
    "MORE FROM NEWS18 CRICKETNEXT",
    "ICC ODI World Cup 2023 Full Schedule: India To Begin Campaign vs Australia; IND vs PAK on Oct 15",
    "Duleep Trophy 2023: Fit-again Arzan Nagwaswalla Wants to Make Domestic Season Count",
    "'Degree Not Enough for Job in UK': Indian Student Pens Heartbreaking Reality in  ...",
    "Noida Billboard Featuring 'I Am Sorry Sanju' Message Has Twitter in Fits of Laug ...",
    "Sev Puri Dosa is Internet's New Food Combo That Will Make Your Taste Buds Go for ...",
    "'Dus Bahane': Desis on Twitter Choose Songs From 90s, 2000s They Still Vibe On",
    "Mumbai To Witness 10% Water Cut From July 1 As Lake Levels Remain Low Despite Rain",
    "Karan Johar Says Tum Kya Mile A Tribute To Yash Chopra, Apologises To Alia Bhatt For THIS Reason",
    "A Walk Through Time At These 5 Amazing Cultural Attractions In Europe",
    "Monsoon Can Make Us Prone To Fungal Infections, Expert Suggests 6 Tips To Prevent Them",
    "Science-Wise | Monsoon's Erratic Start A Concern as 47% India Rain-Deprived Despite Heavy Bursts",
    "CUET UG 2023 Answer Key Date to be Announced Soon: UGC Chairman",
    "National Selection Trials: Bhavesh Wins in Rapid fire, Ramita Tops Air Rifle Event",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Astrological Predictions for June 28, 2023",
    "Meet Jassym Lora Russell, Andre Russell's Wife",
    "7 Mutton Dishes You Must Try This Bakrid",
    "ICC World Cup 2023: Full List Of Stadiums",
    "7 Indian Restaurants In World's Legendary...",
    "Apple Pay Could Soon Launch In India",
    "How To Grow Sunflower In A Pot?",
    "How To Make Joint Financial Decisions As A...",
    "Astrological Predictions for June 27, 2023",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "India ODI Squad vs WI Announced",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 K-Drama Locations You Can Visit In South...",
    "5 Food Combinations with Milk to Avoid",
    "India Test Squad VS WI Announced",
    "Kajol Set To Make OTT Debut With Lust Stories 2",
    "9 Benefits Of Drinking Saffron Tea",
    "Indian Cricketers in Their Alternate...",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Best Careers For Each Zodiac Sign",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Why Travel To India During The Monsoon",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Kriti Sanon Inspired Saree Looks",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "How To File Complaint With IRCTC",
    "Remembering Sushant Singh Rajput",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Tamannaah Bhatia, Vijay Varma Make Debut As Couple At Lust Stories 2 Premiere, See Photos",
    "England ODI World Cup 2023 Full Schedule: Check Full List of Matches for the Defending Champions",
    "Australia ICC ODI World Cup Schedule: Check Fixtures, Venues and Match Timings",
    "Kevin Pietersen Turns 43: Former England Skipper’s Famous Tweets on India and IPL",
    "'Smart and Engaging Young Man': Shashi Tharoor Runs Into Shoaib Akhtar at Dubai Airport",
    "Happy Birthday Dale Steyn: 5 Best Bowling Spells by the South African Legend",
    "Ratan Tata Denies Investing in Cryptocurreny After Fake Image Goes Viral",
    "More Central Forces Could Be Sent to Strife-torn Manipur after July 8 Bengal Panchayat Polls",
    "TTD's Tirupati Goshala Sets Record with India's First Sahiwal Breed Calf Born via Cow Surrogacy",
    "Global Cuisine for God: Pizza, Pasta Among '56 Bhogs' Offered to Lord Jagannath During Rath Yatra",
    "Unique Rituals at Chitrakoot's Hanuman Temple: The Intriguing Tradition of Cannabis Offerings",
    "India's Current Account Deficit Narrows To 0.2% Of GDP In Q4 FY23",
    "HDFC-HDFC Bank Merger Effective From July 1; HDFC Stock Delisting From July 13",
    "Hindustan Aeronautics Announces 1:2 Stock Split; Approves Rs 15 Dividend",
    "Looking For A Personal Loan? Know The Factors That Affect The Interest Rate",
    "Stock Market Holiday: NSE, BSE to Remain Closed on Thursday for Bakrid",
    "Kim Kardashian Raises Temperature With Latest Swim Campaign; Check Out Diva's Hot and Sexy Photos!",
    "Kiara Advani Rules Vibrant Colours and Here's Why",
    "Katrina Kaif Weaves a Summer Fairytale with Floral Printed Dresses",
    "Shanaya Kapoor Oozes Charm in a Classic Red Saree; Check Out Actress Ethnic Looks",
    "Khloe Kardashian Birthday: Hot and Sexy Photos of the Reality TV Siren with Her Sisters",
    "New BFFs in B-Town: Six Times Disha Patani And Mouni Roy Gave Us Major Friendship Goals",
    "Nora Fatehi Proves That She's The Ultimate Beauty, See The Diva's Sexy Pictures!",
    "Arjun Kapoor Birthday: 10 Adorable Pictures With His Ladylove Malaika Arora",
    "From Secret Invasion to Lust Stories 2, 6 OTT Releases to Look Out for in July 2023",
    "Rs 40 in 5 Hours? Video Of Bengaluru Auto Driver Crying Due to Low Wage Sparks Debate on Twitter",
    "Tomato Prices Reach New Heights and Desis Embrace Memes to 'Sauce' the Sorrow",
    "Elon Musk vs. Mark Zuckerberg Cage Fight: Musk's Father Foresees 'A No-Win Situation' for His Son",
    "This Fruit Chai Made With Banana, Chikoo Has Desi Foodies in Shock",
    "Assam PAT 2023 Result To be Released Today At dte.assam.gov.in, How To Check",
    "JAC Delhi Counselling 2023 Round 1 Seat Allotment Results Today At jacdelhi.admissions.nic.in",
    "CUET UG 2023: Results In First Week Of July On cuet.samarth.ac.in ?",
    "SAMS Odisha Plus 2 Admission 2023 Registration Date Extended till July 30",
    "OSSC CGL Main Exam 2022 Schedule Released at ossc.gov.in",
    "More Education & Career News",
    "What Is Apple Pay And How To Use It On iPhone, Apple Watch: A Simple Guide",
    "Pixel Owners Again Face Battery Drain Issue After New Update: All Details",
    "OnePlus And Oppo Phones Could Soon Launch With 24GB RAM, But Why?",
    "Hiker With Broken Leg Uses iPhone 14's Emergency SOS Feature To Call For Help, Gets Rescued",
    "Meta Challenges Apple with Launch of Quest+ VR Subscription Service",
    "Bajaj-Triumph Scrambler 400 X in Pics: See Design, Features and More in Detail",
    "Bajaj-Triumph Speed 400 in Pics: See Design, Features and More in Detail",
    "Bajaj-Triumph Speed 400, Scrambler 400 X Unveiled; Price, Features, Engine and More",
    "Maruti Suzuki Invicto Interior Images Leaked Ahead of Launch, Check What's New",
    "2023 Kia Seltos Facelift GT Line Clear Images Leaked Ahead of Launch in India",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Paris Cops Kill Teenager for Fleeing Traffic Stop, Spark Controversy",
    "India and France Strengthen Bilateral Partnership with Inaugural Strategic Space Dialogue",
    "Wagner Chief Yevgeny Prigozhin Moves to Belarus as NATO Promises to Protect Allies",
    "\"Bidenomics\": What We Know About Biden's Battle Plan for Next Year's Election",
    "SAFF Championship: India and Kuwait Share Spoils in 1-1 Stalemate",
    "Manchester United Fans Protest Against Owners on Day of Kit Launch Outside Adidas Megastore",
    "Manchester United Release Kit for 2023/24 Season, Jersey to be Made with '100% Recycled Materials'",
    "Tushar Khandker Appointed Head Coach of Junior Indian Women's Hockey Team",
    "Malaika Arora Gets Declared As The First Indian Brand Ambassador For Anastasia Beverly Hills",
    "Janhvi Kapoor Wore a Zara Faded Crop Top Worth ₹2,290.00 For Raina Naidu Promo Shoot",
    "Nora Fatehi Is A Glam Doll In Red Mini Dress; This Is How Much It Costs",
    "Pooja Hegde Aces Airport Fashion In A Yellow Anarkali Suit Worth Rs 26,500",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "The Titanic Wants You to Sink With Its Stories. No One Can Fight",
    "What Exactly Happened in Russia? From Wagner Group Rebellion to Belarus Deal, All to Know",
    "Game-Changing Partnership: Why GE's Joint Fighter Jet Production in India is Trail-blazing",
    "Opinion | Responsible Behaviour in Space: Why Public Participation is Key",
    "Opinion | Pakistan-Russia Ties: No Counter to Indo-US Bonhomie or India-Russian Bear Hug",
    "Opinion | Ilhan Omar Running Islamist Agenda Against India in the Name of Minority Rights",
    "Opinion | Do the Wagner Mutiny & a Weakened Putin Spell Nuclear Nightmare for the Rest of Us?",
    "Owaisi Slams Modi on Triple Talaq, Asks Why 'Getting Inspiration from Pakistan'",
    "Raut Calls BRS B-team of BJP; KCR Says They Are a Team of Farmers, Minorities and Dalits",
    "‘If Telangana Can, Why Can’t You?’ KCR’s ‘Maha’ Pro-Farmer Pitch for 2024 Lok Sabha Elections"
]