[
    "French Open 2023: Novak Djokovic Clinches 23rd Grand Slam Title With Win Over Casper Ruud",
    "Amritsar-bound IndiGo Flight Enters Pak Airspace Due to Bad Weather; Returns Safely 30 Mins Later",
    "Clinical Australia Become World Test Championship Winners With 209-run Demolition Job of India",
    "'My Wife Was Stripped, Beaten by 120 Men', Army Jawan Claims; 'Exaggerated' Story, Say Police",
    "Kangana Ranaut Blames 'Fake Blind Items' for Sushant's Death, Opens Up On Fight With Hrithik",
    "Meet Sini Shetty, 21-Year-Old Miss India 2022 Who Will Represent India in Miss World 2023",
    "Deepika Padukone, Ranveer Singh Inspect Construction Progress Of Their New House; Watch",
    "Junior Asia Cup Hockey: Indian Women Clinch Title With Win Over Korea",
    "Asur 2's Kasturi Banerjjee: I Prioritize Weightlifting For My Fitness And No Diets",
    "Sara Ali Khan, Vicky Kaushal Celebrate Zara Hatke Zara Bachke Success With Media, Share Anecdotes",
    "Adipurush Final Trailer: Prabhas, Kriti's Film Is High On Action, Low On VFX & We're At A Deadlock",
    "Bigg Boss OTT 2 To Stream From June 17, With Salman Khan As Host | Sooraj Pancholi To Participate?",
    "Bare Minimum Monday: The New Workplace Trend That Has Left Internet Divided | All You Need To Know",
    "Deepika Padukone's Secret To Her Glowing Skin REVEALED | Just Three Steps To Follow",
    "Taarak Mehta Ka Ooltah Chashmah's Bawri Alleges Misconduct, Validating Jennifer Bansiwal's Claim",
    "Animal Pre-Teaser: 'Blood Thirsty' Ranbir Kapoor is Out To Kill It, In The Film and at Box Office",
    "Affairs With Rekha And Sridevi To Almost Marrying Hema Malini, Jeetendra's Controversial Love Life",
    "Rashmika Mandanna Brutally Mobbed at Mumbai Airport, Bodyguard Comes to Her Rescue; Watch",
    "Sexy! Nia Sharma Oozes Glamour In A Very Racy Black Bralette, Hot Video Goes Viral; Watch",
    "Priyanka Chopra Performs Special Puja on Her Dad's Death Anniversary, Malti Dresses in Lehenga",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC Final: A Loss India Will do Well to Remember",
    "IND vs AUS: After Shubman Gill's Dubious Catch, Sehwag-Jaffer Take Brutal Dig at Third Umpire",
    "Washington Sundar Confirms His Twitter Account Was Hacked, Says 'Last Few Tweets Not..'",
    "Fed Up with Mobile Phones? Jethalal's Hilarious Skit From 'TMKOC' Has Desis Rela ...",
    "Unicorn Spotted in India? Mythical Creature's Pics Has Twitter Sharing 'Startup' ...",
    "Man Attends Meeting on Bike While Stuck in Traffic in 'Peak Bengaluru' Moment",
    "This Crossover of Ajay Devgn and Riar Saab's 'Obsessed' is Too Hilarious",
    "Ranbir Kapoor Stars in Animal Pre Teaser, Kangana Ranaut Makes Shocking Claims About SSR's Death",
    "Prabhas Starrer Adipurush Advance Booking Starts On Good Note; 10,000 Tickets Sold",
    "Uncover How Cricketer Suryakumar Yadav Shed 12 Kilos With an Extreme Diet Routine",
    "Madhu Mantena, Ira Trivedi Are Now Married, First Photos From Fairytale Wedding Out",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "IndiGo Airlines Amritsar-Ahmedabad Flight Strays Into Pakistan Amid Bad Weather | Shorts | Viral",
    "Brij Bhusan Singh's Show Of Strength In Gonda, Huge Crowd Gathers To Meet Minister | News18",
    "India Rail Crash Probe is Focusing on Manual Bypass of Track Signal: Report",
    "Singer Neha Kakkar Spotted At The Airport Amid Reports Of Trouble In Her Marriage | #shorts #viral",
    "Actress Raveena Tandon's Daughter Rasha Thadani Slays In Denim Look | #Shorts #trending #viral",
    "Actress Rashmika Mandanna Is A Breath Of Fresh Air In Yellow Kurta | #Shorts #trending #viral",
    "Astrological Predictions for June 11, 2023",
    "8 Most Scenic Road Trips In India",
    "9 Most Popular Indian Web Series Of All Time",
    "Does Cactus Plant Bring Bad Luck in Homes?",
    "9 Smoothies To Try This Summer",
    "9 Times Alia Bhatt Slayed In Beachwear",
    "Mark Zuckerberg Claims Apple Vision Pro...",
    "Bollywood Actresses Without Makeup",
    "Astrological Predictions For June 9, 2023",
    "5 Quick Summer Breakfast Ideas",
    "Apple Launches Vision Pro Headset: What's...",
    "9 Most Expensive Cities For Expats In 2023",
    "Signs That A Man Finds You Attractive",
    "9 Actresses Who Became Pregnant Before Marriage",
    "5 Places You Should Visit Before You Die",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Shraddha Kapoor Flaunts Her 'Sunday Jhalli Mood' In A New Post, Check It Out",
    "Suhana Khan Reacts As Archies Channels Shah Rukh Khan's Pathaan in New Poster",
    "The Idol Ep 2 To Show 'Graphic Sex Scenes', Johnny Depp Reacts To Lily's Bold Series?",
    "Dharmendra Opens Up About Karan Deol's Wedding, Calls His Wife-to-Be Drisha ‘Pretty'",
    "'Keep Believing': Rishabh Pant Shows Support Towards Indian Team in the WTC Final",
    "'Cheating, Not Out' Trend on Twitter After Shubman Gill's Controversial Dismissal in WTC Final",
    "Watch: Cameron Green Gets Bowled by Ravindra Jadeja in a Strange, Comical Manner",
    "Deadly Honeymoon: Newly Wed Chennai Couple Drown In Bali During Photoshoot",
    "Curfew in Maharashtra's Amalner for 48 Hours After Clash Between 2 Groups Over 'Toys'",
    "Aadhaar-PAN Link Check Online: Easy Steps To Get Status On Your Mobile",
    "Punjab Petrol, Diesel Prices Go Up As Govt Hikes VAT",
    "Boost To Digital Lending, RBI Default Loss Guarantee Guidelines In Right Direction: Experts",
    "Petrol, Diesel June 11 Price List: Check New Rates In Delhi, Mumbai And Other Cities",
    "Gold Rates Today In India: Check Latest 22 Carat Price In Your City On June 11",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "Tamannaah Bhatia Is A Vision To Behold In Oversized Pantsuit, Check Out The Diva's Sexy Pictures",
    "Virat Kohli As a Cop or Pilot? AI Reimagines The Cricketer in 'Multiverse'",
    "Desi Twitter Recalls Their Favourite 'Celebrity Interaction' And You Cannot Miss This",
    "Wholesome Tweet About Geet And Her Family in 'Jab We Met' Will Make You Want to Rewatch The Film",
    "'Bewakoofiyan': Bride Rides Scooty Without Helmet, Delhi Police Responds",
    "'Mumbai in Nutshell': Viral Pic Shows Air Conditioner in Makeshift Room Over a Huge Open Drain",
    "UPSC GK Capsule: From Cyclone Biparjoy To Canada Wildfires, Know Major Events Of The Week",
    "CUET UG 2023 Results Likely To Be Announced In July, Check Updates",
    "COMEDK UGET 2023 Counselling Dates Announced, Registrations Begin Today At comedk.org",
    "NEET-UG 2023 Result To Be Out Soon, Check Points To Ensure Your Scorecard Is Error-Free",
    "JEE Advanced 2023 Answer Key Released At jeeadv.ac.in, How to Download",
    "More Education & Career News",
    "Realme 11 Pro+ First Look: Quick Look At New Mid-Range 200MP Camera Smartphone",
    "WhatsApp Is Working On New Interface For Group Settings Screen On iPhone: Know More",
    "Sony Launches New HT-S2000 Dolby Atmos Soundbar With 5.1 Channel  In India: Price & Availability",
    "Twitter Is Refusing to Pay Its Google Cloud Bills: Report",
    "Mystery USB Adapter Spotted Alongside Apple Vision Pro Headset In WWDC 2023 Video",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "All-New BMW M2 Launched in India, Price Starts at Rs 98 Lakh",
    "Hero Xtreme 160R Launch on June 14, Teaser Video Confirms 4 Valve Engine",
    "2024 Mercedes Benz G-Class Launched in India, Price Starts at Rs 2.55 Crore",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Minor Girl Dies in France While Attempting Viral Challenge on TikTok. All You Need to Know",
    "British Royal Guards Collapse During Rehearsal as UK Sees 'Hottest Day of Year' | On Cam",
    "Ashmita Chaliha, Ravi Win Singles Badminton Titles at Maldives International Challenge",
    "Let’s Talk Sex | Bad Sex, Bad Memory: The Surprising Connection Between Sex and Memory",
    "These Historic Forts and Palaces Are Now Luxurious Hotels Symbolizing The Best That India Offers",
    "Janhvi Kapoor's Black Dress From Aritzia Is Just For Rs 9,800; You Can Ace This Too!",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "What is a Counteroffensive? Key Point in Russia-Ukraine War EXPLAINED",
    "Opinion | Odisha Train Crash: It’s Time to Make Rail Safety True Fail-Safe",
    "Opinion | Imran Khan’s Failed Insurrection and Its Aftermath",
    "Opinion | From Startup India to Startup20, Why It’s The Right Time to Become an Entrepreneur",
    "Opinion | Why Tipra Motha is Struggling to Retain Momentum in Tripura",
    "Opinion | How Indian Democracy Is In Danger From Those Who Most Vociferously Swear By It",
    "Love is Love, It Sees No Walls, But If...: BJP’s Pankaja Munde on ‘Love Jihad’",
    "Amid Sexual Harassment Allegations, WFI Chief's Poetic Dig At BJP's UP Rally",
    "BJP Remains a Divided House in Karnataka Even After Drubbing in Assembly Polls",
    "IN PICTURES: Manchester City Seal Historic Treble With UEFA Champions League Triumph",
    "UEFA Champions League 2023: Manchester City Beat Inter 1-0 to Clinch Title and Complete Treble",
    "Newcastle United Sign Shirt Sponsorship Deal with Saudi Arabia Firm",
    "ISL Transfer News: Nandhakumar Sekar Joins East Bengal on 3-year Deal"
]