[
    "How a Minister's Trip to a Coffee Shop in Delhi's Khan Market Got Japan Interested in India's UPI",
    "For Once, MS Dhoni Lays Bare Unadulterated Emotions on a Magical 'Yellove' Night",
    "When Priyanka Chopra Shut Karan Johar Up In Front of Kareena: 'I Wasn't Invited To Your...'",
    "'Thalapathy' Ravindra Jadeja Does it For His 'Thala' MS Dhoni",
    "When Saroj Khan Recalled Her Major Fallout With Salman Khan: 'Roti Allah Deta Hai... Tu Nahi'",
    "IPL 2023 Prize Money: CSK Get Rs 20 Crore, Gill Wins 4 Awards & Rs 40 Lakh- Full List Here",
    "Mahindra Thar 5-door Spied Testing with Sunroof, Debuts in 2024",
    "Anushka Sharma and Sakshi Dhoni Are Childhood Friends, Studied In Same School; Here's Proof",
    "'More Than 22 Players Tonight': Swiggy Sold 2423 Durex Condom Packets on IPL 2023 Final",
    "Know The Govt Schemes That Offer Higher Interest Rates Than Fixed Deposits",
    "Parineeti & Raghav Chadha To Follow Priyanka Chopra's Suit; Will Have Winter Wedding In Rajasthan?",
    "Gadar Ek Prem Katha To Re-Release In Theatres | Kiara, Kartik Shine In SPKK First Song | News Wrap",
    "Does Eating Mangoes Cause Breakouts & Acne? | Common Myths About Mango BUSTED",
    "Sexy! Ameesha Patel Turns Up The Heat In A Very Racy Strapless Dress, Hot Video Goes Viral; Watch",
    "Kajol Admits Dushman Makes Her 'Uncomfortable,' Talks About Ashutosh Rana As Film Clocks 25 Years",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Rinku Singh Interview: ‘Itna Nahi Soch Raha, Kismat Mein Hoga to India Khel Jayenge’ | Exclusive",
    "WATCH: Ravindra Jadeja Hugs Wife Rivaba After Handing CSK a Memorable Win in IPL 2023 Final",
    "WATCH: Ravindra Jadeja Dedicates IPL 2023 Final Win to 'Special CSK Member' MS Dhoni",
    "Dhoni Makes a Cameo in Ravindra Jadeja's Wholesome Instagram DP After CSK Roar i ...",
    "Did Dhoni Cry After Ravindra Jadeja Hit the Winning Runs for CSK in IPL 2023 Fin ...",
    "Was Dhoni in Zen Mode After CSK's Thrilling Victory Over GT in IPL 2023 Final?",
    "Virat Kohli's Poster Protects Fans From Rain in IPL 2023 Final, Internet Lauds T ...",
    "Mouni Roy Steps Up Her Fashion Game, Is 'Overflowing With Joy' In Latest Pics; Check Here",
    "Sara Ali Khan Refuses to Pay Rs 3,000 For International Roaming, Calls Herself ‘Stingy’",
    "Salman Khan Questions Being Tagged 'Bad Guy' In Viral Video, Says 'If I Was...'; Watch",
    "Vicky Kaushal Reveals Sara Ali Khan Would Make This Bizarre Comment Before Their Romantic Scenes",
    "The Other Dhoni: Meet MS Dhoni's Elder Brother Narendra Singh",
    "LeT Leader Bhuttavi, Linked to 2008 Mumbai Attacks, Dies in Pakistani Prison: Report",
    "Actress Nabha Natesh Win Hearts With Her Stunning Artwork, See Pics",
    "From Hailee Steinfeld to Karan Soni, Meet the Voices Behind Spider-Man: Across the Spider-Verse",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "This Mother-Son Reunion Will Make You Go Aww",
    "9 Upcoming OTT Releases in June",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "Top 9 Places to Visit in India Before You...",
    "Astrological Predictions for May 30, 2023",
    "Nothing Phone (2) To Launch In July",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Deepika Padukone Looks Embarrassed As She Reveals Bingeing On Sima Taparia's Show; Watch Video",
    "Sara Ali Khan, Vicky Kaushal In Disbelief As Jadeja Clinches IPL Win for CSK; Video Goes Viral",
    "IPL 2023: Gujarat Titans Opener Shubman Gill Clinches Orange Cap",
    "Virat Kohli Trains Hard in Nets Ahead of World Test Championship Final - See Photos",
    "What is Foucault's Pendulum Installed in New Parliament Building & How Does it Work?",
    "25 People Injured in Road Accident After Private Bus Rams into Another in Kerala's Thrissur",
    "India's GDP Projected To Grow 6.5% In FY24, Domestic Economy Resilient: RBI",
    "Bank Holidays In India: Banks Closed For 12 Days In June 2023; Check Full List Here",
    "Stock Market Updates: Sensex Drops Over 50 pts, Nifty Near 18,580; IRCTC Down 3%",
    "Special Rs 75 Coin: What Is Its Price & How Can You Buy It?",
    "Ameesha Patel's Sexy Bikini-Clad Photos Will Definitely Make Your Jaw Drop, See Pics",
    "Esha Gupta Raises Temperature In Backless Black Gown, Check Out The Diva's Sexy Pictures",
    "See Unseen Photos From Ashish Vidyarthi's Wedding To Assamese Entrepreneur Rupali Barua",
    "Dhoni Makes a Cameo in Ravindra Jadeja's Wholesome Instagram DP After CSK Roar in IPL 2023",
    "10/10 For Finding The Odd Word In This Puzzle In 5 Seconds",
    "'Her Prayers Were The Loudest,' Video Of CSK Fan Crying Heart Out In IPL Final Goes Viral",
    "This 2013 Tweet By MS Dhoni Is The Ultimate Take On Finisher 'Sir' Ravindra Jadeja",
    "GSEB Gujarat 12th Arts, Commerce Results 2023 Date and Time Announced, Check Details",
    "JAC Jharkhand 12th Arts, Commerce Results 2023: How to Check Online, via SMS, DigiLocker",
    "WBCHSE 12th Board Exams 2024 To Begin On February 16, Check WB Uccha Madhyamik Timetable",
    "UPSC CDS Rank 11 Sanjiv Jajoo Clears Exam After 7 Failed Attempts, Says It's been 'Challenging'",
    "More Education & Career News",
    "This New App Uses AI And Phone’s Camera To Detect Fake Products: All You Need To Know",
    "How To Download Your Photos From Google Photos: A Simple Guide",
    "Google Searches Soar 1300% For These Terms Since 2004: Report",
    "OnePlus 11 5G Marble Odyssey Edition Launched In India: Price, Specs & Availability",
    "Samsung Users Face Lockscreen Bug With This OneUI Version, Now Fixed",
    "Mumbai Metro Line 3: DMRC Gets Contract To Operate City's First Fully Underground Corridor",
    "From Scorpio N to XUV700 and Thar, Check Waiting Period For All Mahindra SUVs in India",
    "Upcoming Honda Elevate SUV to Feature ADAS Tech, Details Here",
    "Thiruvananthapuram International Airport: E-gate System Installed, Turns Paperless",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "May 9 Jinnah House Arson Case Returns to Haunt Imran; Ex-PM to Appear before JIT",
    "Moscow Suffers Minor Damage as Drones Attack Russian Capital",
    "Chinese Social Media Influencer Dies after Drinking Several Bottles of Baijiu",
    "Clashes between Cops, Worshippers as Chinese Govt Tries to Demolish Centuries-Old Mosque",
    "Mass Shooting at Florida's Hollywood Beach Injures Nine People, Including Three Minors",
    "Neeraj Chopra Injured! 'Sustained A Muscle Strain During Training', Pulls Out of Competition",
    "PV Sindhu and Kidambi Srikanth Eye Good Show in Thailand Open",
    "Monaco Grand Prix: Max Verstappen Clinches Victory From Pole, Fernando Alonso Second",
    "Inclusivity 101: How Is Mental Health Support A Key Element Of An Inclusive Work Culture?",
    "Gen-Blend Romances: Study Reveals How Indians Are Embracing Age-Gap Relationships",
    "Sharvari Wagh Was at Her Hottest Best in a Cutout Black Gown at the IIFA; See Photos",
    "The World’s Best Hotel, Rambagh Palace’s Most Expensive Room Will Astound You; Details Inside",
    "Here’s Why You Should Avoid These 4 Foods On An Empty Stomach",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Bajrang Punia Warns Against 'Morphed' Photos of Wrestlers: How to Spot an AI Deepfake? Explained",
    "What is a 'Bare Minimum Monday' & Why You'd Want Your Boss to Get Behind this New Work Trend",
    "Turkey's Erdogan Wins Historic Runoff Election: What are the Challenges that Lie Ahead?",
    "Opinion | China’s Unfolding Airliners – Time for India to Get Its Own",
    "Opinion | Naya Sansad for Naya Bharat as Sun Sets on Nehruvian India",
    "Opinion | Dharma is the Atman of Civilisational and Cultural Heritage of India",
    "OPINION | A Naya Sansad for a Proud Naya Bharat",
    "OPINION | The USA’s Debt Ceiling Crisis Puts the Dollar and its War Machine at Risk",
    "Joint Candidate in 2024? Oppn Ready to Go All In, But Cong May Not Agree to Stay Out of the Way",
    "BJP’s 'Khane Pe Charcha' in UP: Where Citizens Will Chew Over Modi-Yogi Performance Ahead of 2024",
    "La Liga: Barcelona Thrash Mallorca 3-0 as Ansu Fati, Gavi Strike at Camp Nou",
    "Serie A: Lecce Seal Survival With Win Over Monza, Lazio Beat Cremonese to go Second in League",
    "Premier League: Manchester City Defend Title as Leeds, Leicester, Southampton Relegated",
    "PSG Keeper Sergio Rico in Intensive Care Following Horse Riding Accident in Spain",
    "Luton Town Complete Fairytale Rise from Dark Days of Fifth Tier to Premier League"
]