[
    "'Ek Bharat Shreshtha Bharat': How New Parl Building Captures Spirit of Every Part of India",
    "Alcohol, Cocaine Detected in Imran Khan's Medical Test, Says Pakistan Health Minister",
    "GT vs MI LIVE Score, IPL 2023 Qualifier 2: Ton-up Shubman Gill Propels Gujarat Titans to 233/3",
    "PM Modi Shares Glimpse of 'Iconic' New Parliament Building, Makes 'Special Request' | WATCH",
    "Salman Khan's Security Pushes Vicky Kaushal Away at IIFA; SHOCKING Video Goes Viral",
    "Keep These Things In Mind While Depositing Rs 2,000 Notes And To Avoid Income Tax Notice",
    "Priyanka Chopra’s Backless Lime Dress Is Worth A Staggering Rs400,000; Details Inside",
    "Ashish Vidyarthi, Rupali Barua Dance Joyfully Together In New Wedding Photos, Check Out Here",
    "Menstrual Hygiene Day 2023: Beyond Pads - Tips for Clean and Comfortable Periods",
    "India's Roll Call At Day 10 Of Cannes 2023: Kennedy, Agra & Nehemich Screened At The Film Fest",
    "Aditi Rao Hydari Exudes Cinderella Vibes, Sunny Leone & Esha Gupta Stun | India At Cannes 2023",
    "Karan Johar: The Man, The Myth & The Legend | Why He Is The Undisputed Kingmaker Of The Industry",
    "Aahana Kumra's Message Is Quite Clear - Female Celebs Need Space | Malaika Arora | Kareena Kapoor",
    "Ashish Vidyarthi's First Wife FINALLY Reacts To His 2nd Marriage, Says 'He Needs A Partner...'",
    "Sexy! Nikki Tamboli Oozes Hotness In A Very Racy Strapless Dress, Video Goes Viral; Watch",
    "Ashish Vidyarthi's First Wife Drops Cryptic Post After His 2nd Marriage, Says 'Do Not Get…'",
    "BTS: Jungkook Opens Up About Military Enlistment, Says 'When My Time Comes, I'll Slowly Cut...'",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Rohit Sharma: IPL’s Most Successful Player Pursuing an Unforgettable Legacy",
    "IPL 2023, Qualifier 2: Time for Hardik Pandya to Step up as Gujarat Titans Face the Heat",
    "'MS is a Magician': Matthew Hayden Decodes How Dhoni Turn Someone Else's 'Trash Into Treasure'",
    "WTC Final Prize Money Announced: Winner to Get Rs 13.22 Crore, Runners-up to Pocket Rs 6.61 Crore",
    "'Retirement is Tough': Man's Reflection on Parents' Mundane Life Post Career Hit ...",
    "Shri Ramcharitmanas Sets Guinness World Record As Longest Song Performed for 138 ...",
    "'Sorry Girls', 'Honking Hurts': Funny Messages on Indian Vehicles That Promise a ...",
    "Coimbatore Man Masters Bicycle Stunts Against All Odds, Aims to 'Wheelie' His Wa ...",
    "Urfi Javed Gets Brutally Trolled For Her Sheer Black Outfit, Netizens Call Her 'SHAMELESS'",
    "'Vaibhavi Upadhyaya Was Wearing Seatbelt,' Late Actress' Fiance FINALLY Breaks Silence",
    "Elevate Your Bridal Style with Bollywood-Inspired Jewellery Trends",
    "Sachin Pilgaonkar On Saying Goodbye To Acting: 'Cannot Even Think'",
    "How to Recognise if Your Child is Facing Mental Health Issues? 5 Early Signs to Look Out For",
    "Here's Why Rajesh Khanna Had To Once Leave His Luxurious Bungalow 'Aashirwad'",
    "Malavika Mohanan's ‘Low maintenance’ Fitness Exercise: Check Out The Benefits Here",
    "Anushka Sharma Dazzles in an Ornate Ivory Dress in her First Shot From Cannes 2023",
    "Govts of Same Ideology Working in Centre and State Have Benefitted Maha, Says CM Shinde",
    "Food Inspector Drains Out 21 Lakh Litres Of Water From Chhattisgarh Reservoir For Lost Phone",
    "Sengol Row | Happy That The Sceptre Has Found Its Right Place: Historian Pradeep Chakravarthy",
    "Russia Ukraine War Update Today | Russia Targets Clinic In Dnipro, Ukraine | #viral #trending",
    "What Will Happen To Your Facebook Account After Death? Read On",
    "Rocky Aur Rani Kii Prem Kahani First Look | Ranveer Singh And Alia Bhatt Kapoor | Shorts | Video",
    "Dharavi Teen Maleesha Kharwa Becomes New Brand Ambassador Of Forest Essentials | English News",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "Mouni Roy Gives Holiday Glam Goals",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "Ferrari To Launch First Electric Car in 2025",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "8 Movies to Watch on Mother's Day with Your Mom",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "9 Health Benefits Of Sleeping Naked",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Five gift ideas to make your mother feel...",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "YouTuber Agastya Chauhan Dies While...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "ITR Filing 2023: Don't Forget These Essentials",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "Inside Nia Sharma's Vacay In Sikkim",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "Check Out The Unseen Pics Of Shah Rukh...",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Jacqueline Fernandez's Fitness Routines",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Busiest Airports In The World In 2022",
    "Salman Khan Buys New Bullet-proof Car",
    "Who Is Rupali Barua? Meet The Entrepreneur Who Said 'I Do' To Ashish Vidyarthi",
    "'He’s Always With me': CSK Captain MS Dhoni's Message to Matheesha Pathirana's Sister",
    "On This Day in 1999: Dravid, Ganguly Put Together Record 318-run Stand in ODIs | WATCH",
    "On This Day in 2013: Mumbai Indians Defeated Chennai Super Kings to Lift Maiden IPL Title",
    "Virat Kohli Reaches 250 Million Instagram Followers, First Indian to Scale Landmark",
    "Happy Birthday Sunil Narine: Best Performances in the IPL by KKR All-rounder",
    "Air India Delhi-Vancouver Flight Returns Due To Technical Glitch, Passengers Safe",
    "How Modi Govt Found the Sengol: It Took 2 Yrs, A Thuglak Article, Letter to PMO & a 'Time' Report",
    "Investor Alert! Sebi To Issue Mutual Fund Light Regulations For Passive Funds; Know Details Here",
    "Go First Update: DGCA Required To Deregister Aircrafts, Airline Lessors Tell Delhi HC",
    "TCS To Be Linked With TDS? Here's What Govt Is Trying To Help Individual Taxpayers",
    "Pocket Money Secrets For Students: 10 Tips And Tricks To Save Money And Relax",
    "Leave Encashment Upon Retirement: Rs 25 Lakh Tax Exemption For Salaried Employees",
    "See Unseen Photos From Ashish Vidyarthi's Wedding To Assamese Entrepreneur Rupali Barua",
    "Janhvi Kapoor Enjoys Tropical Holiday By Going Makeup-free, Check Out The Diva's Sexy Pictures",
    "Inside Bhumi Pednekar's Dubai Holiday: Check Out The Diva's Stunning Pictures With Her Family",
    "Twitter Users Share 'Movie Screenshots' That Will Give You An Instant Heartbreak",
    "Shri Ramcharitmanas Sets Guinness World Record As Longest Song Performed for 138 Hours",
    "Twitter Thread on High School Incidents Has People Remembering Some 'Uncanny' Stories",
    "'Sorry Girls', 'Honking Hurts': Funny Messages on Indian Vehicles That Promise a Joyful 'Ride'",
    "WBJEE 2023 Result Declared, MD Sahil Akhtar from Kolkata Secures Rank 1",
    "MHT CET 2023 Answer Key Released, How to Raise Objection, Know Result Date",
    "MBOSE Meghalaya 10th, 12th Result 2023 Declared: How to Check Online, via Digilocker",
    "BSE Odisha to do Away With 2 Summative Assessments, Bring Back Old Pattern for 10th Board Exams",
    "More Education & Career News",
    "Gurugram Resident Loses Rs 70 Lakh In WhatsApp Work-From-Home Scam: How It Happened",
    "Windows PCs Will Finally Get Native Support For RAR Files: What It Means",
    "All Major Announcments From PlayStation Showcase: Spider-Man 2 Gameplay, New Handheld And More",
    "WhatsApp To Replace Phone Numbers With Usernames: Here's How It Will Work",
    "Nissan Magnite GEZA Special Edition Launched in India, Priced at Rs 7.39 Lakh",
    "MG Gloster Black Storm Edition Teased Ahead of Official Launch, Watch Video",
    "McLaren Artura High-Performance Hybrid Supercar Debuts in India, Priced at Rs 5.09 Crore",
    "FlyArystan Launches Direct Delhi-Shymkent Flights for Seamless Travel to Kazakhstan",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Republicans, Biden Close to Debt Ceiling Agreement, Congress Asked to Remain Ready for Voting",
    "Turkey Election Runoff 2023: Here's All You Need to Know",
    "Dozens of Strikes Hit Russian Border Region: Governor",
    "UK Chancellor Hunt Backs Interest Rate Hikes to Tackle Inflation Despite Recession Risk",
    "US Defence Secretary Lloyd Austin to Visit India Next Week, Meet Rajnath Singh",
    "Malaysia Masters: PV Sindhu Through to Final Four, Srikanth Kidambi Ousted",
    "La Liga: Osasuna Register 2-0 Win Over Athletic Club to go Seventh in League",
    "Four Accused of Vinicius Junior Effigy Hanging Released From Custody But Still Under Investigation",
    "Manchester United's Antony Suffers Injury During Chelsea Clash Ahead of FA Cup Final",
    "Two Santos Players Racially Abused During Copa Sudamericana Clash at Audax Italiano",
    "Lakshadweep: A First Timer's Guide to One of India's Most Beautiful Destinations",
    "Travel Tailored for You: Personalized Perfection Redefines the Wellness Experience",
    "Anupam Kher Sustains Hairline Fracture; Know Everything About Treatment, Causes And Recovery",
    "Nushrratt Bharuccha's Multi-Colour Jumpsuit Is A Summer Staple",
    "BTS Sensation Jimin Rocks ₹2.7 Lakh Dior Backpack, Ignites Style Frenzy",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "What is Sengol? Row Over Accuracy of Nehru Ceremony EXPLAINED",
    "Paralyzed Man Walks Again Using Only His Thoughts! The Scientific Leap EXPLAINED",
    "US Debt Ceiling: How Will the Average American Suffer in Case of Default? 10 Scary Points",
    "Opinion | Karnataka Lessons: Time’s Ripe For RSS And BJP To Rediscover Their Ideological Moorings",
    "Opinion | Hiroshima G7 Summit: Rhetoric and Reality",
    "Opinion | How PM Modi Uses Diaspora Diplomacy To Push The Rising India Story",
    "Opinion | Naya Kashmir Shines on the Global Stage",
    "Delhi Services Ordinance Issue: Kejriwal Seeks Time to Meet Cong Chief Kharge, Rahul Gandhi",
    "Delhi FC Crowned 2nd Division Champions, Earn Promotion to I-League",
    "How Much Each Premier League Team Will Receive as Prize Money This Season",
    "EFL Championship Play-Off Final: Premier League Spot at Stake in ‘Richest’ Football Match",
    "Clubs Steeped in Tradition Battle it Out for Survival as Premier League Curtain Call Looms Large",
    "India Clubbed with UAE, Maldives, China in AFC U-23 Asian Cup Qualifiers"
]