[
    "The ‘Golden Touch’ for Ram Temple in Ayodhya, Ground Floor Construction in Final Phase",
    "CoWIN Portal Safe, Reports of Telegram Bot Sharing Personal Info Mischievous: Health Ministry",
    "WTC Final: Why Were India, Australia Teams Fined Match Fee? Slow Over Rate Explained",
    "Prabhu Deva Welcomes A Baby Girl At 50, His 1st Child With Second Wife: 'I'm Done With...'",
    "Kiara Advani 'Recreates' SidKiara Wedding Pose With Kartik Aaryan, Sparks Controversy",
    "Last Indian Journalist Asked to Leave China as Rift Between New Delhi and Beijing Grows: Report",
    "India Tour West Indies to Commence from July 12 with 2-match Test Series: Check Full Schedule",
    "India's GDP Zooms To $3.75 Trillion In 2023 From $2 Trillion In 2014: Nirmala Sitharaman",
    "Intercontinental Cup: Sunil Chhetri Strikes as India Down Vanuatu 1-0 to Book Finals Berth",
    "Kanye West Slammed For Serving Sushi on Naked Women at His Birthday Bash, Video Goes Viral",
    "Kangana Ranaut Takes An Indirect, But Apparent, Dig At Ranbir Kapoor & Karan Johar - Yet Again",
    "Deepika Reciprocates Vin Diesel's Love, Visits House Site With Ranveer | The Archies New Poster",
    "Ranbir's Animal Pre-Teaser Out | Priyanka Chopra's Desi Baby | Madhu Mantena-Ira Trivedi Mehendi",
    "Kajol Returns To Instagram Hours After Bidding Goodbye; Fans Call Out Her 'Poor' Marketing Gimmick",
    "Radhika Madan Says Switching To Vegan Diet Changed Her Life | All You Should Know About Veganism",
    "Karan Johar Shares THIS Post Hours After Kangana Ranaut Attacked Him, Ranbir Kapoor",
    "Sexy! Nikki Tamboli Turns Up The Heat In A Very Plunging Blouse, Hot Video Goes Viral; Watch",
    "Niharika Konidela CONFIRMS Divorce From Chaitanya Jonnalagadda With Latest Instagram Post?",
    "Gadar 2 Teaser: Sunny Deol Returns As Tara Singh; Fans Chant 'Hindustan Zindabad'",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC final: The Setting up of Virat Kohli",
    "Dr Atul Gaikwad Adds Another Feather to his Coaching Hat",
    "'Unfortunately it has Turned into a PR agency, They're not Broadcasters Anymore': Gautam Gambhir",
    "Yashasvi Jaiswal has Hunger to Win & be the Best: RR CEO Jake Lush McCrum",
    "Man Earning Rs 1.5 Lakh per Month 'Glamourises' Responsibilities Over 'iPhone' i ...",
    "Gurugram Man Gets Drunk With Stranger, Gets 'Lift' to Metro Station, Realises it ...",
    "Jethalal-Iyer, Pani Puri-Pizza: Viral Twitter Thread of Desis Comparing Bizarre  ...",
    "'Chemistry So Good': Bollywood Fans List On-screen Couples Who Were Too 'Real' t ...",
    "Sunny Deol, Bobby Deol And Abhay Deol Pose Arm-In-Arm At Karan Deol's Roka, See Video",
    "Shah Rukh Khan Gives Jawan, Dunki Updates; Kiara Advani Sparks Controversy With 'Wedding' Photos",
    "Anusha Dandekar Opens Up On Her Ovarian Lump Removal Surgery, 'Recovery Has Been Pretty Intense'",
    "Anu Malik Reveals Javed Akhtar Objected Use Of 'Check That' In Main Hoon Na Qawwali Song",
    "National Sewing Machine Day 2023: Date, History, Significance and Ways to Celebrate This Day",
    "Dulquer Salmaan Reshoots King Of Kotha Climax In Kochi; Here's Why",
    "International Albinism Awareness Day 2023: Date, Theme, History and Significance",
    "Motivational Quotes: 50 Quotes About Life and Success to Inspire You!",
    "Colombian Plane Crash: Relatives Fight for Custody of Kids Who Survived Amazon for 40 Days",
    "Breaking News Live Updates - 13 June 2023: Read All News, as it Happens, Only on News18.com",
    "Fox News Warns Tucker Carlson Over Contract Violation with New Twitter Show",
    "US Worries Over North Korea's Plan to Deliver More Weapons to Russia",
    "Singer Neha Kakkar Spotted At The Airport Amid Reports Of Trouble In Her Marriage | #shorts #viral",
    "Actress Raveena Tandon's Daughter Rasha Thadani Slays In Denim Look | #Shorts #trending #viral",
    "Actress Rashmika Mandanna Is A Breath Of Fresh Air In Yellow Kurta | #Shorts #trending #viral",
    "8 Most Scenic Road Trips In India",
    "9 Most Popular Indian Web Series Of All Time",
    "6 Things Women Should Know Before Using...",
    "5 Trees Considered Sacred In Hinduism",
    "Astrological Predictions for June 12, 2023",
    "6 Signs You Have A Caring And Loving Partner",
    "Realme 11 Pro Series Launched In India: Key...",
    "Does Cactus Plant Bring Bad Luck in Homes?",
    "9 Smoothies To Try This Summer",
    "9 Times Alia Bhatt Slayed In Beachwear",
    "Mark Zuckerberg Claims Apple Vision Pro...",
    "Bollywood Actresses Without Makeup",
    "Astrological Predictions For June 9, 2023",
    "5 Quick Summer Breakfast Ideas",
    "Apple Launches Vision Pro Headset: What's...",
    "9 Most Expensive Cities For Expats In 2023",
    "Signs That A Man Finds You Attractive",
    "9 Actresses Who Became Pregnant Before Marriage",
    "5 Places You Should Visit Before You Die",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Ragini Diwedi Hosts Prabhudeva For An Evening Of Laughter And Fun Conversation",
    "Snowdrop Star Park Soo Ryun Dies at 29; Korean Actress Fell Down Stairs",
    "'Motivation and Energy': Keemo Paul Hails Impact of Legend Darren Sammy Ahead of ODI WC Qualifiers",
    "Chennai Super Kings Star Tushar Deshpande Ties the Knot with Fiance Nabha",
    "ECB Slams Former Yorkshire Chairman Colin Graves for Comments on Historical Racists Incidents",
    "WATCH: Arshdeep Singh Shines in County, Traps England Wicketkeeper to Bag His Maiden Wicket",
    "Chandrayaan-3 to Be Launched Between July 12 and 19: ISRO Chief",
    "Hold Talks or Protest Will Continue: Farmers Give 10 PM Deadline to Haryana Govt Over MSP Demand",
    "CPI Inflation Falls To 25-Month Low of 4.25% In May 2023; Industrial Production Rises 4.2%",
    "How To Extend Your Public Provident Fund Account After 15 Years",
    "Who Is Kairan Quazi? A 14-Year-Old Graduate Who Is Joining Elon Musk's SpaceX",
    "Flat Sizes In Mumbai Metropolitan Region, Chennai Shrinking: Anarock Report",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "Gujarat's Kshama Bindu, Who Married Herself Last Year, Celebrates First Anniversary",
    "Anushka Sharma Being Blamed For India's Loss in WTC Final Sparks Outrage Online",
    "Dhoni vs Ganguly: How India's Defeat in WTC Final Has Started an Unlikely Debate on Twitter",
    "CTET 2023 To Take Place On August 20, Check Exam Pattern",
    "TBJEE 2023 Results Declared At tbjee.nic.in, Check Toppers List For PCM, PCB Groups",
    "UPSC CSE Prelims 2023 Results Declared At upsc.gov.in, Check Other Details",
    "Has Your State Also Increased The Duration Of Summer Vacations? Know Here",
    "More Education & Career News",
    "Apple iPhone 15 Series Could See Major Price Hike: Here's How Much It Could Cost",
    "Smartphone Brand Honor To Re-Enter In India With Former Realme India CEO Madhav Sheth: All Details",
    "Apple Vision Pro Headset Could Get A Budget Version: What It Might Offer",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "All-New BMW M2 Launched in India, Price Starts at Rs 98 Lakh",
    "Hero Xtreme 160R Launch on June 14, Teaser Video Confirms 4 Valve Engine",
    "2024 Mercedes Benz G-Class Launched in India, Price Starts at Rs 2.55 Crore",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "46, Including Children, Killed in 'Vile Attack' in East DR Congo",
    "Facing Heat Over 'Partygate' Scandal, Boris Johnson Formally Resigns as Conservative MP",
    "​‘Those Who Have Left PTI…’: ‘Betrayed’ Imran Khan Talks to Journalists in Pak Court | Exclusive",
    "Kim Jong Un Issues Secret Order to Prevent Deaths as North Korea Reports Spike in Suicide Cases",
    "Germany and Ukraine Share Spoils in Friendly, Proceeds From Game to go to War Victims",
    "Lionel Messi Will Increase Major Soccer League Popularity, Says Neymar Jr",
    "U-17 Asian Wrestling Championships: Indian Women Claim Team Title in Bishkek",
    "'Had to Do the Cliche Footballer's Way': Sunil Chhetri Explains 'Pregnant' Goal Celebration",
    "Contraception: 6 Things That Women Should Know Before Using Birth Control Pills",
    "Claudication, Is Increasing Leg Cramps A Sign Of Cardiovascular Disease?",
    "5 Morning Yoga Asanas That Are Extremely Effective for Weight Loss",
    "5 Brands For Plus-Size Fashion You Must Check Out Now",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Ex-Intelligence Official Says US Collected UFOs: What are the Claims & Is There Truth to Them?",
    "Opinion | The Gender Gap In Healthcare Leadership Calls for Urgent Attention",
    "Opinion | Financial Analysis of State Lenders Required for Successful Privatisation of PSBs",
    "Opinion | Why Dalrymple Needs to Discard His White Mughal Mindset, But It May Not Be Easy for Him",
    "Right Word | Rahul Gandhi’s US Visit: Who are Minhaz, Aslam, Tanzeem and Sunita?",
    "Opinion | Imran Khan’s Failed Insurrection and Its Aftermath",
    "Violence, Appeasement New Normal in West Bengal: Union Minister Anurag Thakur",
    "Priyanka Gandhi Attacks MP's BJP Govt with '21 Jobs, 225 Scams' Jibe; Promises LPG, Power Sops",
    "Alienated Allies? All May Not Be Well in Haryana's Ruling BJP-JJP Coalition",
    "Low 5: Is BJP Unhappy with These Shiv Sena Ministers?"
]