[
    "‘We Want Peace’: News18 at Manipur Ground Zero Ahead of Home Minister Amit Shah’s 4-Day Visit",
    "IPL Final Live Score Updates: Shubman Gill, Wriddhiman Saha Put Gujarat Titans on Top Early",
    "With Hebbalkar as WCD Minister, How K'taka Govts Have Never Pushed Women Ministers to Top Ranks",
    "'Shameful': Malaika Arora Gets BRUTALLY Trolled for Posting Arjun Kapoor's 'Semi-Nude' Photo",
    "Parineeti Chopra Wipes Her Dad's Tears, Reveals The 'Only Problem' In the New Engagement Photos",
    "Government Says Nearly 1 Lakh UPI Frauds Reported Last Year; Here's How People Fall Into The Trap",
    "Employee Pension Scheme: Can You Exit After Applying For Higher EPS Pension?",
    "6 Ways to Keep Your Eyes Protected In The Summers",
    "Parineeti & Raghav Chadha To Follow Priyanka Chopra's Suit; Will Have Winter Wedding In Rajasthan?",
    "Gadar Ek Prem Katha To Re-Release In Theatres | Kiara, Kartik Shine In SPKK First Song | News Wrap",
    "Does Eating Mangoes Cause Breakouts & Acne? | Common Myths About Mango BUSTED",
    "Arjun Kapoor Shares Cryptic Post As Malaika Faces BACKLASH Over 'Semi-Nude' Pic: 'Choose Peace...'",
    "HOT! Disha Patani Raises The Heat In A Very Plunging Corset, Sexy Video, Photos Go Viral; Watch",
    "Varun Dhawan, Nora Fatehi's IIFA Dance Act Called 'Cringe'; Reddit Users Say 'What Was That?'",
    "Sexy! Ameesha Patel Looks Smoking Hot In A Sheer Thigh-High Slit Dress, Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "IPL 2023 Final Scenarios: Who Wins the Title if Rain Washes Out the Reserve Day?",
    "Shubman Gill Opens Up on Orange Cap Win for the First Time, Says 'It's Great But…’ | Exclusive",
    "IPL 2023 Team Review: Mumbai Indians Overcome Injuries in a Topsy-turvy Ride",
    "Ahmedabad Weather Live Updates: No Signs of Rain Ahead of Toss, Clear Skies at Motera Stadium",
    "IPL 2023 Final Tickets: Here's How to Get Entry Into the Stadium on Reserve Day",
    "Virat Kohli's Poster Protects Fans From Rain in IPL 2023 Final, Internet Lauds T ...",
    "Viral Pic Shows US Pilot Scaling Cockpit Window After Being Locked Out of Plane",
    "Delhi Metro's 'Far From Her Memories' Stop is the Destination of All Broken Hear ...",
    "Argentina's New Presidential Plane Pulls Off Low-level Stunts, Viral Video Draws ...",
    "Aamir Khan Keen On Roping Ranbir Kapoor For Champions After Salman Khan Backs Out, Details Inside",
    "'Ram Charan Doesn't Pick My Calls': Apoorva Lakhia Talks About Their Bond After Zanjeer Flopped",
    "Apoorva Lakhia Calls Ex-GF Dia Mirza ‘Good Friend’, Says 'She Decided to Be With Flop Director…'",
    "What Succession Star Cast Thinks Of The Season Finale",
    "Here’s Why You Should Avoid These 4 Foods On An Empty Stomach",
    "Genelia D'Souza Looks Stunning In Black Ruffled Saree At IIFA Awards, See Pics",
    "Dhanush Looks Unrecognisable In His Captain Miller Look As Lands In Mumbai, Fans in Shock",
    "Nikki Tamboli Brutally Trolled After She Steps Out In Sexy Top, Netizens Say 'Aise Kapde Kyun...'",
    "Woman Grooves To Salman Khan's Laga Laga Re, Internet Is Loving It",
    "IPL 2023 Final: MS Dhoni's Colossal Record - Becomes First Player to Play 250 IPL Games",
    "MS Dhoni Pranks Deepak Chahar Once Again Ahead of IPL 2023 Final Against Gujarat Titans | WATCH",
    "Hrithik Roshan Walks In All His Style & Swag As He Gets Papped At The Airport! | #Shorts #trending",
    "A Toy Story Optical Illusion Is The Challenge We Need",
    "This Mother-Son Reunion Will Make You Go Aww",
    "9 Upcoming OTT Releases in June",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "Top 9 Places to Visit in India Before You...",
    "A Glimpse Into India's New Parliament Building",
    "Astrological Predictions for May 29, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Sara Ali Khan Almost Falls In Her Saree As Rakhi Sawant Carries Her In Washroom, Video Goes Viral",
    "Adipurush: Kriti Sanon Awaits Reunion With Prabhas In Ram Siya Ram; Fans Dub It 'Soul Of The Film'",
    "Kajol Admits Dushman Makes Her Uncomforable, Talks About Ashutosh Rana As Film Completes 25 Years",
    "Watch: Shubman Gill And Mohammad Shami Play With Raindrops Ahead of IPL 2023 Final",
    "On This Day in 2016: SRH Beat RCB to Win Maiden IPL Title",
    "Air India Hiring 600 Cabin Crew Members, Pilots Every Month: CEO Campbell Wilson",
    "Stock Broker May Hide These Things From You; Know What Former BSE Chairman Suggests",
    "RBI May Reduce Policy Rate In Fourth Quarter Of 2024: Oxford Economics",
    "Special Rs 75 Coin: What Is Its Price & How Can You Buy It?",
    "Aadhaar-PAN Link, Advance Tax, TDS Challan: These 5 Dates In June You Can't Miss",
    "Esha Gupta Raises Temperature In Backless Black Gown, Check Out The Diva's Sexy Pictures",
    "See Unseen Photos From Ashish Vidyarthi's Wedding To Assamese Entrepreneur Rupali Barua",
    "Janhvi Kapoor Enjoys Tropical Holiday By Going Makeup-free, Check Out The Diva's Sexy Pictures",
    "Throwback Video of Hrithik Roshan Recreating His 'Kaho Na Pyaar Hai' Moves Leaves Fans in Frenzy",
    "Watch: Japanese Man Finds Live Frog In His Takeaway Udon Cup After Almost Finishing It",
    "AI Transforms Tom Cruise, Brad Pitt And Keanu Reeves Into Indian Monks And We Are Not Complaining",
    "Argentina's New Presidential Plane Pulls Off Low-level Stunts, Viral Video Draws Criticism Online",
    "This Medley Featuring Bella Ciao, Pasoori, And Bollywood Hits Is An Unmissable Crossover",
    "Maharashtra SSC Result 2023 Live: Class 10 Board Result to be out soon at mahahsscboard.in",
    "Jharkhand Board JAC 12th Arts, Commerce Result 2023 Tomorrow? Here's What We Know So Far",
    "Afghan Woman Bags IIT Degree In Chemical Engineering; Hid 'Lab' In Home From Taliban",
    "Once A Naxal, Maharashtra Girl Clears Class 12 Exam, Dreams Of Joining Police Force",
    "JEE Advanced 2023 Admit Card Released, Know How to Download",
    "More Education & Career News",
    "ISRO GSLV F12/NVS -1 Mission: Rocket Carries 2nd-gen NavIC Satellite",
    "Indian Wearable Brand Fire-Boltt Ranks 2nd In Global Smartwatch Market: Report",
    "Poco F5 5G Review: Value-For-Money Smartphone In Crowded Mid-Segment Market",
    "Snapchat's New AR Filter To Let Users Paint Their Nails: All Details Here",
    "Mumbai Metro Line 3: DMRC Gets Contract To Operate City's First Fully Underground Corridor",
    "From Scorpio N to XUV700 and Thar, Check Waiting Period For All Mahindra SUVs in India",
    "Upcoming Honda Elevate SUV to Feature ADAS Tech, Details Here",
    "Thiruvananthapuram International Airport: E-gate System Installed, Turns Paperless",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "EAM Jaishankar to Meet Chinese, Russian Counterparts at Cape Town BRICS Foreign Ministers' Summit",
    "Neeraj Chopra Injured! 'Sustained A Muscle Strain During Training', Pulls Out of Competition",
    "PV Sindhu and Kidambi Srikanth Eye Good Show in Thailand Open",
    "Monaco Grand Prix: Max Verstappen Clinches Victory From Pole, Fernando Alonso Second",
    "Do's and Don'ts While Choosing Nutritious Pet Food for Traveling With Your Furry Baby",
    "Iranian Model Sports an Outfit With Noose Around Her Neck at Cannes 2023; Makes Strong Statement",
    "Hypertension? Say Goodbye to Stress in 30 Seconds the Malaika Arora Way!",
    "World Digestive Health Day 2023: Theme, Significance, and 5 Common Digestive Disorders",
    "Here Is Why You're Not Shedding Weight Despite Your Workout Efforts",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "What is a 'Bare Minimum Monday' & Why You'd Want Your Boss to Get Behind this New Work Trend",
    "Turkey's Erdogan Wins Historic Runoff Election: What are the Challenges that Lie Ahead?",
    "ISRO's GSLV Rocket Propels Next-Gen Navigational Satellite NVS-01: Why This is Remarkable",
    "Transfer of Power Aside, BJP's 'Sengol' is Part of a Larger Political Play in its Tamil Nadu Plan",
    "Wrestlers' Protest: What are the Allegations Against WFI Chief? Explained As Police Book Agitators",
    "Opinion | China’s Unfolding Airliners – Time for India to Get Its Own",
    "Opinion | Naya Sansad for Naya Bharat as Sun Sets on Nehruvian India",
    "Opinion | Dharma is the Atman of Civilisational and Cultural Heritage of India",
    "OPINION | A Naya Sansad for a Proud Naya Bharat",
    "OPINION | The USA’s Debt Ceiling Crisis Puts the Dollar and its War Machine at Risk",
    "No Truck With AAP in 2024, No Support Over Ordinance Too: Delhi Congress",
    "Chandrababu Naidu Sounds Poll Bugle in AP, Promises Schemes for Women, Unemployed Youth",
    "La Liga: Barcelona Thrash Mallorca 3-0 as Ansu Fati, Gavi Strike at Camp Nou",
    "Serie A: Lecce Seal Survival With Win Over Monza, Lazio Beat Cremonese to go Second in League",
    "Premier League: Manchester City Defend Title as Leeds, Leicester, Southampton Relegated",
    "PSG Keeper Sergio Rico in Intensive Care Following Horse Riding Accident in Spain",
    "Luton Town Complete Fairytale Rise from Dark Days of Fifth Tier to Premier League"
]