[
    "Mumbai Monsoon Mayhem: Man Killed, Andheri Subway Shut & Houses Collapse; More Rain Likely",
    "Karnataka Man Kills Daughter Over Affair with Dalit. Heartbroken Lover Dies by Suicide Soon After",
    "At, Rs 1639 Crore, Indian Family Buys One Of World's Most Expensive Homes In Switzerland",
    "Dharmendra Lost Cool When Asked About Bobby, Sunny Deol at Esha's Wedding: 'Bakwaas Mat...'",
    "‘Worrisome’, Says Sharad Pawar on KCR’s ‘Show of Strength’ With 600 Cars in Maharashtra",
    "Asin Shuts Down Rumours About Divorce With Rahul Sharma: 'We Heard We Had Broken Up...'",
    "Rain News LIVE: Mumbai Rains Intensify, Andheri Subway Shut; 47 Roads Closed in Himachal",
    "Alia Bhatt, Ranveer Singh Share A Kiss In Rocky Aur Rani Kii Prem Kahaani Song Tum Kya Mile, Watch",
    "Ravi Kishan's 21-Year-Old Daughter Ishita Joins Defence Forces, Netizens Praise 'Star Kid'",
    "Rs 40 in 5 Hours? Video Of Bengaluru Auto Driver Crying Due to Low Wage Sparks Debate on Twitter",
    "Sensex Hits 64,000, Nifty Crosses 19,000 For First Time: Will The Bull Run Sustain?",
    "Kusha Kapila Trends After Divorce Announcement From Husband | All About The Social Media Star",
    "Kiara Advani Leaves Internet Green With Envy In Her Monsoon Look For SatyaPrem Ki Katha Promotions",
    "Kiara Advani-Kartik Aaryan's SatyaPrem Ki Katha Generates Buzz Ahead Of Release | Will It Work?",
    "Salman Khan Gets Death Threat From Goldy Brar, Who's Behind Sidhu Moosewala's Murder-EXPLAINED",
    "Katrina, Vicky On A Vacation In NYC | Tamannaah Overwhelmed By Fan Love | Game Over For Adipurush",
    "Tillotama Shome On Her Brilliant Filmography & Her Role In 'The Night Manager' | EXCLUSIVE",
    "Sex And The City Star Sarah Jessica Parker Wears Indian Designer | Desi Designers Who Went Global",
    "Mamta Kulkarni Calls Sridevi, Rekha 'Cosmetic Beauties' In Viral Video, 'Unke Peechay Koi Tha...'",
    "Kusha Kapila's Ex-Husband Zorawar Reacts For 1st Time To Divorce, 'To Attack Her Character Is...'",
    "MORE FROM NEWS18 CRICKETNEXT",
    "‘Virat Kohli is Now in Sachin Tendulkar’s Shoes, Everybody will Look to Win the World Cup for Him’",
    "Duleep Trophy 2023: Fit-again Arzan Nagwaswalla Wants to Make Domestic Season Count",
    "PCA Dejected as Mohali Misses Out on WC Hosting, Punjab Sports Minister Says 'Politics Involved'",
    "India to Tour Ireland for 3-match T20I Series in August, Confirms Ireland Cricket",
    "England Captain Ben Stokes 'Sorry' After Cricket Report Exposes Racism and Sexism",
    "ICC ODI World Cup 2023 Full Schedule: India To Begin Campaign vs Australia; IND vs PAK on Oct 15",
    "Bengaluru Store Staff Beaten By Goons in a Fight Over Mobile Charging Wire, Vide ...",
    "Woman Asks Sister to Roast Brinjal, What She Did Next Will Leave You ROFL",
    "Two-days-old Baby Becomes Millionaire With Rs 52 Crore Trust Fund, Here is How",
    "US Man Turns Lone Passenger on Flight, Gets First-class Treatment From Crew Afte ...",
    "'Will I Feel Your Presence Like I Always Do Baba?' Mahesh Kale Remembers Late Father",
    "Mumbai Metro: Lines 2A and 7 Break Daily Ridership Record with Over 2 Lakh Commuters",
    "Adipurush Actor Lavi Pajni Is Also Disappointed With Director Om Raut, Says 'I Am a Hindu Too'",
    "Harleen Sethi Chooses Self-Connection Over Digital Distractions on Her Birthday",
    "'He's Not Superman': When Henry Cavill Thought DC Fans Will Reject Him As Man Of Steel",
    "France Braces for Angry Protests, Violence after Cops Shoot Teenager",
    "Manchester United Stocks Up with Anticipation of Sale to Qatar's Sheikh Jassim",
    "PM Modi To Virtually Lay Foundation Stone Of 3 DU Buildings On June 30",
    "Govt Hikes Sugarcane Price By Rs 10 To Rs 315 Per Quintal For 2023-24 Season",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Astrological Predictions for June 28, 2023",
    "Meet Jassym Lora Russell, Andre Russell's Wife",
    "7 Mutton Dishes You Must Try This Bakrid",
    "ICC World Cup 2023: Full List Of Stadiums",
    "7 Indian Restaurants In World's Legendary...",
    "Apple Pay Could Soon Launch In India",
    "How To Grow Sunflower In A Pot?",
    "How To Make Joint Financial Decisions As A...",
    "Astrological Predictions for June 27, 2023",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "India ODI Squad vs WI Announced",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 K-Drama Locations You Can Visit In South...",
    "5 Food Combinations with Milk to Avoid",
    "India Test Squad VS WI Announced",
    "Kajol Set To Make OTT Debut With Lust Stories 2",
    "9 Benefits Of Drinking Saffron Tea",
    "Indian Cricketers in Their Alternate...",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Best Careers For Each Zodiac Sign",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Why Travel To India During The Monsoon",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Kriti Sanon Inspired Saree Looks",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "How To File Complaint With IRCTC",
    "Remembering Sushant Singh Rajput",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "England ODI World Cup 2023 Full Schedule: Check Full List of Matches for the Defending Champions",
    "Australia ICC ODI World Cup Schedule: Check Fixtures, Venues and Match Timings",
    "Kevin Pietersen Turns 43: Former England Skipper’s Famous Tweets on India and IPL",
    "'Smart and Engaging Young Man': Shashi Tharoor Runs Into Shoaib Akhtar at Dubai Airport",
    "Happy Birthday Dale Steyn: 5 Best Bowling Spells by the South African Legend",
    "At Rs 80-110, Tomato Prices Sting Indians; Other Vegetables Catching Up | FAQ & Easy Alternatives",
    "Mumbai To Witness 10% Water Cut From July 1 As Lake Levels Remain Low Despite Rain",
    "For This Year's 'Rare' Sawan, CM Yogi Bans Sale of Meat on UP's Kanwar Yatra Routes | Check Plan",
    "At 21,000 Tonnes, Indian Households Possess More Gold Than World Bank's Reserves",
    "Gold Rates Today In India: Check Updated Price Of 22 Carat In Your City On June 28",
    "Kim Kardashian Raises Temperature With Latest Swim Campaign; Check Out Diva's Hot and Sexy Photos!",
    "Kiara Advani Rules Vibrant Colours and Here's Why",
    "Katrina Kaif Weaves a Summer Fairytale with Floral Printed Dresses",
    "Shanaya Kapoor Oozes Charm in a Classic Red Saree; Check Out Actress Ethnic Looks",
    "Khloe Kardashian Birthday: Hot and Sexy Photos of the Reality TV Siren with Her Sisters",
    "New BFFs in B-Town: Six Times Disha Patani And Mouni Roy Gave Us Major Friendship Goals",
    "Nora Fatehi Proves That She's The Ultimate Beauty, See The Diva's Sexy Pictures!",
    "Arjun Kapoor Birthday: 10 Adorable Pictures With His Ladylove Malaika Arora",
    "From Secret Invasion to Lust Stories 2, 6 OTT Releases to Look Out for in July 2023",
    "Watch: US Woman Sleeps On Beach Without Sunscreen And Turns Into An 'Alien'",
    "US Man Turns Lone Passenger on Flight, Gets First-class Treatment From Crew After 18-hour Delay",
    "YouTuber Makes World's Largest iPhone Measuring 8 Feet And It's Fully Functional",
    "Punjab Chief Minister Bhagwant Mann Announces 3-fold Hike In Salaries Of 12,700 Teachers",
    "Doctor-turned-civil Servant Apala Mishra Scores Highest Marks in UPSC CSE Interview",
    "TS ICET 2023 Result Date and Time Announced, to be Declared Tomorrow at 3:30 PM",
    "NeXT Exam from 2024, Registration Begins Today, Step 1 Mock Test on July 28",
    "Mumbai University Admissions 2023: Second Merit List Today At 7 PM, Where To Check",
    "More Education & Career News",
    "Apple Watch Ultra 2 Could Launch This Year With New Chipset: Report",
    "This YouTuber Builds World's Biggest 'Working iPhone' | Watch",
    "Samsung Galaxy M34 5G Smartphone To Launch In India On July 7: What To Expect",
    "Microsoft Attempts To Pick Apart US Legal Argument Against Deal To Buy Activision",
    "What Is Apple Pay And How To Use It On iPhone, Apple Watch: A Simple Guide",
    "2023 BMW M 1000 RR Launch in India: Price Starts at Rs 49 Lakh, Deliveries in November",
    "Yamaha RX All Set to Make a Comeback, Bigger Engine Could Debut",
    "Bajaj-Triumph Scrambler 400 X in Pics: See Design, Features and More in Detail",
    "Bajaj-Triumph Speed 400 in Pics: See Design, Features and More in Detail",
    "Bajaj-Triumph Speed 400, Scrambler 400 X Unveiled; Price, Features, Engine and More",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "‘Everyone Will See’: Ukraine Defence Min Reznikov Says ‘Main Event’ in War Yet to Come",
    "‘My Name Is Khan and I’m Not a Traitor’: Imran Demands Live Trials for May 9 'Rioters'",
    "UK Man Dies in Jamaica Family Trip after Attempting to Finish 21 Cocktails Challenge",
    "Canada to Introduce Open Work Permits for US H-1B Visa Holders and Their Families",
    "Wagner Chief Yevgeny Prigozhin Moves to Belarus as NATO Promises to Protect Allies",
    "Checkmate! US Judge Throws Out Hans Niemann's Chess Cheating Lawsuit",
    "National Selection Trials: Bhavesh Wins in Rapid fire, Ramita Tops Air Rifle Event",
    "PM Modi Celebrates India's 'Incredible Athletes' Who Won 202 Medals at Special Olympics",
    "Boxer Ankit Narwal Suffers Hard-fought Defeat to Bow Out of Elorda Cup",
    "Armand Duplantis Sets New 2023 Pole Vault Best at 6.12m",
    "Happy Eid-ul-Adha 2023: Amazing Recipes To Try Out With Your Loved Ones This Festive Season",
    "Sabyasachi, Manish Malhotra and Anita Dongre To Represent India at the Animal Ball 2023 in London",
    "A Walk Through Time At These 5 Amazing Cultural Attractions In Europe",
    "Butter Chicken And Chicken Tikka Shine In Global Rankings",
    "Eid-ul-Adha 2023: Amazing Health Benefits of Goat Meat You Must Know This Bakrid",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "The Titanic Wants You to Sink With Its Stories. No One Can Fight",
    "What Exactly Happened in Russia? From Wagner Group Rebellion to Belarus Deal, All to Know",
    "Game-Changing Partnership: Why GE's Joint Fighter Jet Production in India is Trail-blazing",
    "Opinion | Responsible Behaviour in Space: Why Public Participation is Key",
    "Opinion | Pakistan-Russia Ties: No Counter to Indo-US Bonhomie or India-Russian Bear Hug",
    "Opinion | Ilhan Omar Running Islamist Agenda Against India in the Name of Minority Rights",
    "Opinion | Do the Wagner Mutiny & a Weakened Putin Spell Nuclear Nightmare for the Rest of Us?",
    "Bengal Panchayat Polls: BJP Promises End to Cut Money, Focus on Infra Push, Women Security",
    "FIR Against Amit Malviya in Bengaluru for Tweet Against Rahul Gandhi; 'See You In Court', Says BJP",
    "TMC Will Organise Sit-in in New Delhi to Press for Demand to Clear Dues: Abhishek Banerjee",
    "SAFF Championship: India and Kuwait Share Spoils in 1-1 Stalemate",
    "Manchester United Set To Place €30m Bid For Lille Youngster Carlos Baleba, According to Report",
    "Manchester United Fans Protest Against Owners on Day of Kit Launch Outside Adidas Megastore"
]