[
    "PM Modi Installs Sengol in New Parliament Building: What is Sceptre's Significance? Explained",
    "SRK Shares New Parliament Video, Adds 'Swades' Touch With His Voice-Over; PM Modi Reacts",
    "Rajasthan Storm to End? Congress Set for Meeting Next Week to Find Solution to Gehlot-Pilot Feud",
    "Karisma Kapoor Makes RARE Appearance With Ex-husband Sunjay Kapoor, Duo Step Out For Dinner; Watch",
    "'Prithvi Shaw Thinks He's a Star and Nobody Can Touch Him': Former India Pacer's Staggering Claim",
    "UPSC CSE 2023 Prelims Begins Today, Check Exam Day Guidelines",
    "WhatsApp To Release Screen Sharing Feature For Video Calls: Here's How It Will Work",
    "India's Roll Call At Day 10 Of Cannes 2023: Kennedy, Agra & Nehemich Screened At The Film Fest",
    "Aditi Rao Hydari Exudes Cinderella Vibes, Sunny Leone & Esha Gupta Stun | India At Cannes 2023",
    "Aahana Kumra's Message Is Quite Clear - Female Celebs Need Space | Malaika Arora | Kareena Kapoor",
    "Athiya Shetty SLAMS Claims That She And KL Rahul Went To A 'Strip Club,’ Says ‘Stop Taking…’",
    "Sexy! Nikki Tamboli Oozes Hotness In A Very Racy Strapless Dress, Video Goes Viral; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "WTC Final: Yashasvi Jaiswal Set to Replace Ruturaj Gaikwad as Stand-by Player",
    "'Sourav Ganguly Told me...': Virender Sehwag Cites His India Debut in Advice to Tilak Varma",
    "'It Can Happen': Sunil Gavaskar Says Shubman Gill Can Break Virat Kohli's Monumental IPL Record",
    "IPL 2023 Closing Ceremony: Date, Time, Performers and Where to Watch Midgame Show",
    "Surat Shop Sells Chocolate Samosa Pav and Foodies Can't Take it Anymore",
    "MI Fan Accidently Sends Beer Pic in Family Group, Hilarious Blunder Leaves Twitt ...",
    "How IPL Photographers Celebrate Win While Doing Their Job? IG Reel Shows Wholeso ...",
    "Assam Thieves, Who Robbed Bakery for Cake and Cash, End Up 'Celebrating' Birthda ...",
    "Sunny Leone Conquers Cannes, One Outfit At A Time",
    "International Celebs Who Made a Style Statement in Indian Fashion Designer Outfits at Cannes 2023",
    "Hrithik Roshan-Saba Azad, Sussanne Khan-Arslan Goni Join Preity Zinta For A Fun Night Out",
    "Esha Gupta Is Absolutely Killing It in a Sexy High-Slit Black Dress at IIFA; See Photos",
    "Nora Fatehi Flaunts Her Curves in a Vibrant Bodycon Dress at IIFA; See Photos",
    "Massive Blaze Breaks Out on 12th Floor of High-rise in Mumbai's Breach Candy, Fire Tenders at Spot",
    "Relationship Tips: Understanding 6 Relationship Types That Pose A Threat To Emotional Well-Being",
    "Nora Fatehi Pays Tribute To Helen As She Grooves To Piya Tu Ab To Aaja On IIFA 2023 Stage, WATCH",
    "Mercedes-Maybach Night Series in Pics: See Design, Features, Interior and More",
    "MP Board 10th, 12th Supplementary Exams 2023 Date Sheet Released, How To Download",
    "This Mother-Son Reunion Will Make You Go Aww",
    "Can You Spot the Hidden 'H'? Test Your Skills With This Challenging Alphabet Puzzle",
    "Nushrat Bharucha Dazzles Fans In Her Smashing Attire In Abu Dhabi  | #Shorts #trending #viral",
    "Astrological Predictions for May 28, 2023",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "9 Must-watch Hindi Thriller OTT Shows",
    "IIFA 2023: The Countdown Begins",
    "Cannes 2023: Inside Esha Gupta's Style Closet",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "6 Unhealthy Foods You Should Avoid Eating",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "Aishwarya Rai Bachchan And Other Stars At...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "Indian Celebs Shine At Cannes 2023",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Astrological Predictions for May 18, 2023",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "Sara, Esha, Manushi Debut In Style At Cannes...",
    "7 Animals That Don't Sleep Like You And Me",
    "IPL Playoff Teams: 2018-2022",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "K-Pop Singer Haesoo Dies By Suicide",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Global Brands And Their Brand Ambassadors...",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "IPL Orange Cap Holders: 2008-2022",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "Zomato Founder Deepinder Goyal's Luxury Car...",
    "AI-generated Photos Of Billionaires Hitting...",
    "9 Indian OTT Shows With Strong Female Leads",
    "Cute Pictures Of Anushka-Virat's Daughter...",
    "9 Powerful Benefits Of Journaling",
    "9 Celebrity Bridal Outfits To Inspire Your...",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "Parineeti Chopra-Raghav Chadha Watch IPL...",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "9 Of The Best Met Gala 2023 After Party Looks",
    "Biggest Player Fights In IPL History",
    "Why Has Go First Filed For Bankruptcy?",
    "Padma Lakshmi Makes Sizzling Sports...",
    "What Triggered the Virat Kohli-Gautam...",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "Indian Celebs At Met Gala 2023",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "Serena Williams Expecting 2nd Baby",
    "Go First Suspends All Flights On May 3-4",
    "Jock Zonfrillo, MasterChef Australia Judge,...",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "9 Of Ananya Panday's Hottest Bodycon Dresses",
    "Best Dressed Celebs At Filmfare Awards 2023",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "OTT Releases To Binge-Watch This Weekend",
    "Samantha Ruth Prabhu's Diet Revealed!",
    "Most Anticipated OTT Projects Of 2023",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Horoscope Today: Astrological Predictions...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tips To Prevent Digital Payment Frauds",
    "Aryan Khan Makes Directorial Debut",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Apple Saket Store Now Open For Customers In...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "Janhvi Kapoor Turns Seductress",
    "Redefining Pooja Hegde's Love For Monochromes",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Tara Sutaria's Hottest And Sexiest Swimwear...",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Zodiac Signs That Are More Likely To Be In...",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Allu Arjun Will Not Be Seen Playing A Cameo In Jawan, Details Inside",
    "IPL 2023 Final: 'My Heart Wants CSK to Win Because The Fact That...' - Sunil Gavaskar",
    "'It Appears That Shubman Gill is Following Their Footsteps But I Will...': Kapil Dev",
    "Virat Kohli Must be Fired up to Give His Best to Help India Win WTC Final: Former India Selector",
    "IPL Teams Give Phenomenal Returns Compared to Stock Market",
    "Virat Kohli's Latest WTC Final Post Sees Ex-Pakistan Skipper Make Massive '100' Prediction",
    "Rajasthan Horror: Man with 'Hydrophobia' Arrested for Killing Elderly Woman, Eating Her Flesh",
    "Breezy Days Ahead in Delhi; IMD’s ‘Orange Alert’ for Heavy Rain in 3 States | Weather Updates",
    "Petrol, Diesel Fresh Prices On May 28: Check Latest Rates In Your City",
    "Gold Rates Decline In India; Check New Rates Of 22 Carat In Your City On May 28",
    "TCS To Be Linked With TDS? Here's What Govt Is Trying To Help Individual Taxpayers",
    "Pocket Money Secrets For Students: 10 Tips And Tricks To Save Money And Relax",
    "See Unseen Photos From Ashish Vidyarthi's Wedding To Assamese Entrepreneur Rupali Barua",
    "Janhvi Kapoor Enjoys Tropical Holiday By Going Makeup-free, Check Out The Diva's Sexy Pictures",
    "MI Fan Accidently Sends Beer Pic in Family Group, Hilarious Blunder Leaves Twitter ROFL",
    "Prime Video Has A Sassy Response To Netflix's Password-Sharing Crackdown",
    "Internet's Odd Food Combo Family Has A New Member –Gulab Jamun With Curd",
    "'Co-workers Think I'm Unwell': Viral Poster in GT vs MI Sums Up IPL Fans' Work-Life Scenario",
    "Shubman Gill's Third Century Sets New Viewership Record on JioCinema and IPL Fans Can't Keep Calm",
    "UPSC GK Capsule: Withdrawal Of Rs 2,000 Note To G20 Summit, Know Top Events Of This Week",
    "GSEB Class 12th 2023: Arts, Commerce Results Likely To Be Released In June First Week",
    "REET Mains Level 1 Result 2023 Declared at rsmssb.rajasthan.gov.in, How to Check",
    "CUET 2023: Back-to-Back Exams, Far Away Centres Trouble Candidates Ahead Of Phase 2",
    "More Education & Career News",
    "BGMI Is Now Available To Download On Android; To Be Playable Soon - All Details Here",
    "ChatGPT For iOS Now Available In India; Crosses 500,000 Downloads Since Its Launch",
    "How To Play PS5 Games On Your Mobile Devices Using Remote Play: A Step-By-Step Guide",
    "YouTube Is Killing Stories Next Month To Focus On Shorts Videos",
    "Baidu Set To Launch Ernie 3.5, Its Own Generative AI Model: What You Need To Know",
    "Tesla Model Y: First EV to Earn Title of World's Best-Selling Car",
    "Cash-Strapped Go First Airlines Extends Cancellation of Flight Operations Till May 30",
    "Bhubaneswar Metro Construction Work to Commence by December 2023",
    "Patna Airport: Passengers Create Chaos After SpiceJet Flight Gets Delayed",
    "2023 Suzuki Gixxer SF 250 Review: Serves the Purpose Well!",
    "Putin Uses KH-22 ‘Kitchen Missile’ Meant To Target Aircraft Carriers To Decimate Ukraine Cities",
    "China Worried Over New Indo-Pacific Military Alliance? South Korea-Japan Boost Ties Amid US Pivot",
    "One Tank-Russian Victory Day, Wagner Warns Generals \"Deceiving\" Putin, Ukraine Wants Shells Faster",
    "Biden’s NSA Meets Saudi Crown Prince, UAE & Indian Officials | US’ Bid To Curb China’s Influence?",
    "Russia’s Marker Robots To Get BAS-80 Kamikaze Drones To Counter Western Tanks In Ukraine War",
    "Border Protection To Bakhmut Fighting | Elite Ukrainian Unit's Training Revealed Amid Russia's War",
    "Ukraine \"Preparing Counteroffensive\", Russia Nearing Bakhmut Capture, First Polish MiG-29s Arrive",
    "Shah Mahmood Qureshi to Lead PTI If Imran Khan is Disqualified: Report",
    "Hong Kong's Prominent Pro-democracy Civic Party Disbands Itself Amid Growing Pressure from China",
    "At Least Three Killed in Clash on Iran-Afghan Border",
    "Vladimir Putin Orders Stronger Russian Border Security",
    "FIH Pro League: India Suffer Second Defeat in a Row, Lose 2-4 Against Great Britain",
    "Indian Women's Hockey Team Beat Australia 'A' 2-1 in Final Game of Their Tour Down Under",
    "Sunil Chhetri on 'Difficult' Draw for Asian Cup: 'Hope We Give Good Account of Ourselves'",
    "Malaysia Masters: HS Prannoy Reaches Summit Clash, PV Sindhu Crashes Out in Semi-finals",
    "Esha Gupta Looks Hot! in a Black Dress with a High Slit at IIFA; Photos",
    "Jacqueline Fernandez Joins the Hooded Trend in an Ivory and Gold Ensemble",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "What's the 'X Date' for the US Debt Ceiling? How It's Calculated | EXPLAINED",
    "'Disturbed' Man Opens Plane's Emergency Door Mid-air: Can This Happen on Your Flight?",
    "Paralyzed Man Walks Again Using Only His Thoughts! The Scientific Leap EXPLAINED",
    "Opinion | Karnataka Lessons: Time’s Ripe For RSS And BJP To Rediscover Their Ideological Moorings",
    "Opinion | Hiroshima G7 Summit: Rhetoric and Reality",
    "Opinion | How PM Modi Uses Diaspora Diplomacy To Push The Rising India Story",
    "Opinion | Naya Kashmir Shines on the Global Stage",
    "PM Says Sengol Connects India's Glorious Past with Prosperous Future, Attacks Congress",
    "In Note from Tihar, Manish Sisodia Appeals PM to Ensure Justice for Protesting Wrestlers",
    "New Parliament Building Inauguration: NCP Chief Pawar Says MPs Not Taken into Confidence",
    "Brazil to Play Guinea, Senegal in Anti-racism Campaign in Support of Vinicius Junior",
    "Serie A: Sampdoria Salvage a Point Against Sassuolo in 2-2 Draw"
]