[
    "Big Blow to Cab Aggregators As Supreme Court Says No to Bike Taxis in Delhi, Stays HC’s Order",
    "Shubman Gill Fined for Criticising Umpire on Twitter After His Controversial Dismissal",
    "Gadar 2 Teaser: Sunny Deol Returns As Tara Singh; Fans Chant 'Hindustan Zindabad'",
    "Cyclone Biparjoy: PM Holds Meet to Review Preparedness; Gujarat on High Alert",
    "The Trial Trailer: Kajol's Courtroom Drama Looks Taut And Engaging; Watch",
    "Gurugram Man Gets Drunk With Stranger, Gets 'Lift' to Metro Station, Realises it Was His Own Car",
    "Last Indian Journalist Asked to Leave China as Rift Between New Delhi and Beijing Grows: Report",
    "Cyclone Biparjoy: Horrifying Video Shows Sea Waves Catching Beachgoers Off Guard in Maharashtra",
    "Niharika Konidela CONFIRMS Divorce From Chaitanya Jonnalagadda With Latest Instagram Post?",
    "Silvio Berlusconi, Former PM Who Reshaped Italy's Politics, Dies at 86",
    "New Hero Karizma XMR 210 Launch: Bike Spotted in Jaipur Ahead of India Debut",
    "Kajol Returns To Instagram Hours After Bidding Goodbye; Fans Call Out Her 'Poor' Marketing Gimmick",
    "Shah Rukh Khan's Fans Create Guinness World Record For Most People Performing His Iconic Pose",
    "Ranbir's Animal Pre-Teaser Out | Priyanka Chopra's Desi Baby | Madhu Mantena-Ira Trivedi Mehendi",
    "Varun Tej & Lavanya Tripathi Are Now Engaged; Ram Charan Attends Ceremony, Samantha Showers Love",
    "Radhika Madan Says Switching To Vegan Diet Changed Her Life | All You Should Know About Veganism",
    "Heart Failure: Causes, Treatment, Types, Stages & How It's Different From A Heart Attack",
    "Karan Johar Shares THIS Post Hours After Kangana Ranaut Attacked Him, Ranbir Kapoor",
    "Sexy! Nikki Tamboli Turns Up The Heat In A Very Plunging Blouse, Hot Video Goes Viral; Watch",
    "Pregnant Ileana D'Cruz Enjoys A Pool Day In A Racy Yellow Bikini; Sexy Photo Goes Viral",
    "Sonakshi Sinha's Boyfriend Zaheer Iqbal Tries To Pose Beside Her; Actress Says ‘Waha Jao’, Watch",
    "Samantha Ruth Prabhu Has Hiked Her Fees to Rs 10 Crores for Citadel? Here's The Truth",
    "MORE FROM NEWS18 CRICKETNEXT",
    "'My Fight With Virat Kohli and MS Dhoni...': Gautam Gambhir Comes Clean on His Rumored Rifts",
    "WTC Final: India Fined 100 Per Cent Match Fee for Slow Over Rate",
    "Man Earning Rs 1.5 Lakh per Month 'Glamourises' Responsibilities Over 'iPhone' i ...",
    "Gurugram Man Gets Drunk With Stranger, Gets 'Lift' to Metro Station, Realises it ...",
    "Jethalal-Iyer, Pani Puri-Pizza: Viral Twitter Thread of Desis Comparing Bizarre  ...",
    "'Chemistry So Good': Bollywood Fans List On-screen Couples Who Were Too 'Real' t ...",
    "Shah Rukh Khan Talks About Dunki, Reveals Most Challenging Part of Raju Hirani Film",
    "Janhvi Kapoor Gushes Over Sister Khushi Kapoor In The Archies' New Poster; Says ‘She's A Princess’",
    "Butt Acne Can Affect Anyone, Home Remedies to Prevent it",
    "Highest-Ever In Telugu States? Adipurush Pre-Release Business Details Out Now",
    "Manchester United Takeover Process Set To Become Clearer This Week, Says Report",
    "JSW Cement Signs $50 Million Green Loan Agreement With BNP Paribas",
    "Snake Gets Stuck In A Man’s Curly Hair, Internet Calls Him ‘Real-Life Medusa’",
    "Dimple Kapadia Reveals She Quit Working; 'Daughters Said Keep Your Vanity At Home And Go To Work'",
    "Singer Neha Kakkar Spotted At The Airport Amid Reports Of Trouble In Her Marriage | #shorts #viral",
    "Actress Raveena Tandon's Daughter Rasha Thadani Slays In Denim Look | #Shorts #trending #viral",
    "Actress Rashmika Mandanna Is A Breath Of Fresh Air In Yellow Kurta | #Shorts #trending #viral",
    "Astrological Predictions for June 12, 2023",
    "8 Most Scenic Road Trips In India",
    "9 Most Popular Indian Web Series Of All Time",
    "6 Signs You Have A Caring And Loving Partner",
    "Realme 11 Pro Series Launched In India: Key...",
    "Does Cactus Plant Bring Bad Luck in Homes?",
    "9 Smoothies To Try This Summer",
    "9 Times Alia Bhatt Slayed In Beachwear",
    "Mark Zuckerberg Claims Apple Vision Pro...",
    "Bollywood Actresses Without Makeup",
    "Astrological Predictions For June 9, 2023",
    "5 Quick Summer Breakfast Ideas",
    "Apple Launches Vision Pro Headset: What's...",
    "9 Most Expensive Cities For Expats In 2023",
    "Signs That A Man Finds You Attractive",
    "9 Actresses Who Became Pregnant Before Marriage",
    "5 Places You Should Visit Before You Die",
    "Apple 15-inch MacBook Air Launched: All Details",
    "WTC 2023: When and Where to Watch WTC...",
    "Sachin Tendulkar Buys Lamborghini Urus S",
    "Meet India's Richest Actresses",
    "6 Vastu Tips for the Bedroom to Improve Love...",
    "Ruturaj Gaikwad Ties The Knot With Utkarsha...",
    "Top Factors To Consider Before Buying A New...",
    "Tips For Treating Dry Summer Skin",
    "9 Upcoming Movies In June 2023",
    "This Jaipur Hotel Is Ranked No.1 In The World",
    "Astrological Predictions for June 2, 2023",
    "Top 9 Richest People in the World",
    "Ajay Devgn's Luxury Car Collection",
    "5 Most Followed South Indian Actresses On...",
    "Why Is Pride Month Celebrated In June?",
    "MS Dhoni's Emotions On Display At IPL 2023...",
    "Upcoming Smartphone Launches In June 2023",
    "9 Upcoming OTT Releases in June",
    "9 Healthy Reasons To Take The Stairs",
    "Astrological Predictions for June 4, 2023",
    "Bollywood Divas Who Look Hot In Sports Bra",
    "9 Surprising Benefits of Coffee for Your Skin",
    "Top 9 Places to Visit in India Before You...",
    "Nothing Phone (2) To Launch In July",
    "Astrological Predictions for May 30, 2023",
    "9 Health Benefits Of Watermelons",
    "8 of the Most-followed Sportspersons On...",
    "9 Benefits Of Surya Namaskar",
    "9 Pictures Of Virat Kohli You Won't Believe...",
    "Shah Rukh Khan’s Adorable Family Album",
    "9 Benefits Of Massage Therapy",
    "9 Must-watch Hindi Thriller OTT Shows",
    "9 Things To Know About Barbie",
    "Throwback Pictures Of MS Dhoni With Ziva And...",
    "Top 9 Highest Peaks In The World",
    "How To Open SBI PPF Account Online",
    "9 Countries With The Highest Alcohol...",
    "Anupamaa' Actor Nitesh Pandey No More",
    "9 Rare Pictures Of MS Dhoni",
    "9 Sexy Adah Sharma Bikini Pics",
    "Even A Severed Snake Head Can Kill! Find Out...",
    "9 Countries To Travel Visa-free For Indian...",
    "How To Beat The Monday Blues",
    "9 Of Adah Sharma's Best Saree Looks",
    "Rs 2000 Note Won't Be Legal Tender After...",
    "7 Hill Stations Which are Just 10 Hours Away...",
    "5 Magnificent Railway Routes In India",
    "9 Tips To Have A Successful Career",
    "9 Indian Cricketers Who Tried Acting In Films",
    "Meet Sagar Gupta, B.Com Graduate Who Earned...",
    "Shah Rukh Khan's Luxury Car Collection",
    "6 Benefits Of Drinking Coffee",
    "7 Animals That Don't Sleep Like You And Me",
    "How To Prevent PAN Card Misuse Online",
    "WhatsApp Chat Lock Feature Rolled Out:...",
    "Anushka Sharma To Esha Gupta: Indian Celebs...",
    "Esha Gupta's Sexy Pictures Raise Temperature",
    "5 Benefits Of Intermittent Fasting",
    "Parineeti Chopra-Raghav Chadha's Love Story",
    "5 Must-Visit Hill Stations In India",
    "9 SUVs with The Highest Waiting Period",
    "9 Summer Skin Problems You Can Avoid",
    "Celebrities In Summer Whites",
    "9 Powerful Indian Superheroes Of All Time",
    "7 binge-worthy K-dramas you should not miss",
    "How To Register On Income Tax Portal For ITR...",
    "5 High-Protein Snacks For Weight Loss",
    "9 Celebrity Dads Who Had Kids After 60",
    "7 Times Uorfi Javed Shocked Us With Her...",
    "Fast X: All The Cars In The New Fast And...",
    "Adipurush Trailer: Epic Retelling Of Ramayana",
    "9 Indian OTT Shows With Strong Female Leads",
    "9 Famous Wildlife Sanctuaries Of India",
    "Bollywood Celebs With Controversial Ads",
    "8 Countries With 4-Day Work Week",
    "5 Must-visit Buddhist Pilgrimage Sites in India",
    "Countries That Pay Couples To Have Kids",
    "Biggest Player Fights In IPL History",
    "Virat Kohli's Secret To Fitness - Strict Diet",
    "India Is The New No.1 Test Team in ICC Rankings",
    "Alia Bhatt's Debut At Met Gala",
    "5 Snack Options To Make Your Summers Healthier",
    "Indian Celebrities At The Met Gala",
    "Smart Habits For Saving Money",
    "Bollywood Actresses Who Are Trained Dancers",
    "Launch Of Kochi Water Metro: All You Need To...",
    "Inside Ram Charan-Upasana's Baby Shower",
    "Tamannaah Bhatia-Vijay Varma Enjoy Dinner Date",
    "South Korean Celebs Whose Untimely Deaths...",
    "Rest In Peace, Pamela Chopra",
    "Samantha Ruth Prabhu's London Holiday Album",
    "Upcoming Car Launches In India",
    "First Look At Apple Store In Delhi",
    "Surprising Benefits Of Healthy Sex Life",
    "Tips To Prevent Heatstroke",
    "Is Ileana D'Cruz Pregnant?",
    "Esha Gupta's Jaw-dropping Bikini Photos",
    "9 Easy Ways To Lose Weight",
    "5 Post Office Saving Schemes That Offer Tax...",
    "Tips To Take Care Of Your Skin This Summer",
    "Disha Patani Is Sensuality Personified",
    "Samantha Ruth Prabhu Redefines Glamour In White",
    "Do's and Don'ts During Pregnancy",
    "Salman Khan Buys New Bullet-proof Car",
    "Snowdrop Star Park Soo Ryun Dies at 29; Korean Actress Fell Down Stairs",
    "Avika Gor Makes A Big Revelation; Says South Industry Is ‘All About Nepotism’",
    "Mitchell Starc Doesn't 'Regret' Giving up IPL Money and Prioritising Australia",
    "WATCH: Cyclist Collides With Indian Flag Outside The Oval, Here's What Happened Next",
    "Asia Cup 2023 Likely to be Played in Pakistan and Sri Lanka - Report",
    "Kurukshetra: Farmers Proceed to Block Highway to Delhi as Protest Over MSP Escalates",
    "Mira Road Murder: Accused Bought 'Nilgiri Oil' to Cover Foul Smell, Took Pictures of Body",
    "Who Is Kairan Quazi? A 14-Year-Old Graduate Who Is Joining Elon Musk's SpaceX",
    "Urban Enviro IPO Day 1: Know Price, GMP, Financials; Should You Subscribe?",
    "Flat Sizes In Mumbai Metropolitan Region, Chennai Shrinking: Anarock Report",
    "Want To Own A Home Bakery? Tips And Tricks To Get Started",
    "How To File ITR? A Step-By-Step Guide To File Income Tax Return FY 2022-23 Online",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "Tamannaah Bhatia Is A Vision To Behold In Oversized Pantsuit, Check Out The Diva's Sexy Pictures",
    "Gujarat's Kshama Bindu, Who Married Herself Last Year, Celebrates First Anniversary",
    "Anushka Sharma Being Blamed For India's Loss in WTC Final Sparks Outrage Online",
    "Dhoni vs Ganguly: How India's Defeat in WTC Final Has Started an Unlikely Debate on Twitter",
    "TBJEE 2023 Results Declared At tbjee.nic.in, Check Toppers List For PCM, PCB Groups",
    "AP EAMCET Results 2023 Date and Time Announced, to be Released on June 14",
    "UPSC CSE Prelims 2023 Results Declared At upsc.gov.in, Check Other Details",
    "Has Your State Also Increased The Duration Of Summer Vacations? Know Here",
    "More Education & Career News",
    "How To Get Verified Blue Tick On Facebook And Instagram: A Simple Guide",
    "Google Meet To Come With 'On-the-Go' Mode Soon: All Details",
    "WhatsApp To Release New Emoji Keyboard: Here's All You Need To Know",
    "Apple tvOS 17: Native VPN Support Comes To Apple TV - All Details Here",
    "Realme 11 Pro+ First Look: Quick Look At New Mid-Range 200MP Camera Smartphone",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "All-New BMW M2 Launched in India, Price Starts at Rs 98 Lakh",
    "Hero Xtreme 160R Launch on June 14, Teaser Video Confirms 4 Valve Engine",
    "2024 Mercedes Benz G-Class Launched in India, Price Starts at Rs 2.55 Crore",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Ex-Intelligence Official Says US Collected UFOs: What are the Claims & Is There Truth to Them?",
    "China Aircraft Monitored US, France, Canada, Japan Navy Drill Near Taiwan: Report",
    "Poor Air Quality Returns to US After 3 Days of Respite, New York AQI at 'Unhealthy Levels'",
    "Shaped by Hardship, Novak Djokovic Grateful for 'Tennis Mother' and 'Tennis Father'",
    "Novak Djokovic Cements Status in GOAT Debate After Scaling Men's Grand Slam Peak",
    "FIH Pro League: India Beat Argentina 2-1 as Akashdeep Singh and Sukhjeet Singh Score",
    "'Inspiring Icon': Indian President Lauds Novak Djokovic on Historic 23rd Grand Slam Title",
    "French Open 2023: Novak Djokovic Clinches 23rd Grand Slam Title With Win Over Casper Ruud",
    "Contraception: 6 Things That Women Should Know Before Using Birth Control Pills",
    "Claudication, Is Increasing Leg Cramps A Sign Of Cardiovascular Disease?",
    "5 Morning Yoga Asanas That Are Extremely Effective for Weight Loss",
    "5 Brands For Plus-Size Fashion You Must Check Out Now",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Opinion | The Gender Gap In Healthcare Leadership Calls for Urgent Attention",
    "Opinion | Financial Analysis of State Lenders Required for Successful Privatisation of PSBs",
    "Opinion | Why Dalrymple Needs to Discard His White Mughal Mindset, But It May Not Be Easy for Him",
    "Right Word | Rahul Gandhi’s US Visit: Who are Minhaz, Aslam, Tanzeem and Sunita?",
    "Opinion | Imran Khan’s Failed Insurrection and Its Aftermath",
    "FIRs Filed Against Central Forces Over Protests Against Abhishek Banerjee",
    "Bengal Panchayat Polls: Calcutta HC Favours Extending Nomination Period, Deferring Poll Dates",
    "IT Professional Held in Pune for Issuing Threat to NCP's Sharad Pawar",
    "Farooq, Mehbooba to Attend Oppn Meet: JD(U) President",
    "What Eknath Shinde's Maiden Kashmir Sojourn Means for Shiv Sena's Pan-India Plans",
    "Intercontinental Cup: India Eye Spot in Final Against Lowly Vanuatu in Hot and Humid Bhubaneswar",
    "IN PICTURES: Manchester City Seal Historic Treble With UEFA Champions League Triumph"
]