[
    "On Day 2 of Nehru Museum Row, Surprise Support from an Opposer: 'Need to Show Other PMs' Work'",
    "Ranveer Singh Carries Karan Deol, Dances To Dil Le Gayi Kudi At His Sangeet; Watch Video",
    "WATCH | Violent Clashes in Junagadh Over Dargah Demolition Notice; One Killed, Vehicles Set Ablaze",
    "Bigg Boss OTT 2 Time, Where To Watch Online: Here's How To Stream Salman Khan Show Live",
    "MS Dhoni Dons A Rs 19,000 Pyjama Set As He Spends Quality Time With His Friends, Details Inside",
    "From Breakfast to Movie Night: Here’s How To Plan The Perfect Father’s Day",
    "Kochi Water Metro: Airtel Becomes First Telco to Launch 5G Services, Covers All Stations",
    "Vijay Varma & Tamannaah Bhatia Are In Love & 'Happy' | DYK Tammy Broke Her No-Kiss Policy For Him?",
    "Adipurush Music Composer Duo, Ajay-Atul On Making 'Jai Shri Ram' Song For The Film | EXCLUSIVE",
    "Ali Fazal On His Role In Kandahar, Mirzapur 3 & A Possible Cameo In Fukrey 3 | EXCLUSIVE",
    "Kangana Ranaut Shares ‘Ram Ka Naam Badnam Na Karo’ Song As Adipurush Gets Mixed Reviews",
    "Hot! Nikki Tamboli Flaunts Cleavage In Bold Off-Shoulder Dress, Sexy Photos Go Viral",
    "BTS 2023 Festa In Yeouido: RM, Jungkook To Perform LIVE, Where And How To Watch Online In India",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Why Ishan Kishan is Not Part of East Zone Duleep Trophy Squad",
    "Disappointed at Not Being Part of IPL But Aim is to Play for Indian Test Team: KV Sasikanth",
    "Ambati Rayudu to Join Politics, May Contest Lok Sabha Polls: Report",
    "Om Raut's Old Tweet 'Trolling' SRK's 'FAN' Goes Viral As 'Adipurush' Gets Panned ...",
    "'Adipurush' Roasted Over VFX, Costumes As Twitter Comes Armed With Honest Memes",
    "What Era Are You in Right Now? Desis Share Memes to Express Bittersweet Mood in  ...",
    "Gaddiya Uchiya Rakhiya: Vicky Kaushal's Viral Reel Has Spawned Hilarious Out-of- ...",
    "Father's Day 2023: Gift Your Main Man the Finest Whisky as You Celebrate Him This Year",
    "Bigg Boss OTT 2: Cricketing Legend Ajay Jadeja To Participate; Says 'It's A New Experience For Me'",
    "Bigg Boss OTT 2: Meet Jiya Shankar, Who Sets Instagram on Fire With Her Sexy Bikini Photos",
    "Jungkook, Taehyung Try To Prank Call RM But BTS Fans Recognise Them Immediately; Watch Video",
    "Kriti Sanon's Sister Nupur Rides A Swanky Car With Stebin Ben, Fans Ask, 'Are They Dating?'",
    "How Brown Carbon Also Contributes to Global Warming",
    "Kriti Sanon Knows How To Slay A Casual Look | WATCH | Kriti Sanon Fashion | #shorts #viral #",
    "TNDTE Diploma April Result 2023 Released At dte.tn.gov.in; Step To Download",
    "Bangladesh Recall Afif Hossain, Naim Sheikh in 15-Man Roster For ODI Series Against Afghanistan",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Singer Neha Kakkar Spotted At The Airport Amid Reports Of Trouble In Her Marriage | #shorts #viral",
    "Actress Raveena Tandon's Daughter Rasha Thadani Slays In Denim Look | #Shorts #trending #viral",
    "Astrological Predictions for June 17, 2023",
    "If Cricketers Were Marvel Superheroes…",
    "Happy Father's Day 2023: Wishes, Images &...",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Malaika Arora Stuns In Athleisure",
    "Hotness Alert! Celebs Who Went Topless",
    "Meet Drisha Acharya, Karan Deol`s Fiancé",
    "9 Great Benefits Of Cycling",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "6 Zodiac Signs That May Have Difficult...",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Kriti Sanon Inspired Saree Looks",
    "WhatsApp Users Can Send Video Messages",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Astrological Predictions for June 16, 2023",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "Remembering Sushant Singh Rajput",
    "Astrological Predictions for June 15, 2023",
    "Top 6 Budget-friendly ACs Under Rs 30,000",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "Alia Bhatt Calls Herself A Jet-Lagged Barbie; Clicks Selfies With Heart Of Stone co-star Gal Gadot",
    "This Video Featuring Mumbai Indian's Hrithik Shokeen is a Masterclass in Fielding",
    "WATCH: Shubman Gill Visits Parc des Princes as PSG Gift Him Number 7 Jersey",
    "Ashes 2023: Joe Root Hailed as 'England's Greatest' After 30th Test Ton",
    "NIA to Investigate Recent Attacks on Indian Embassies in Canada, US",
    "From Times Square to Niagara Falls, Indian-American Community Sends Welcome Messages for PM Modi",
    "Gurugram Real Estate: Metro's Extension To Push Housing, Commercial Realty At Dwarka Expressway",
    "Forex Fluctuation: India's Foreign Exchange Reserves Decline $1.32 Bn to $593.75 Bn",
    "Infosys Work From Home Ends: Employees Asked To Return To Office To Avoid Disciplinary Action",
    "Petrol, Diesel Fresh Prices Announced For June 17: Check Fuel Rates In Your City",
    "GST Evasion: FM Nirmala Sitharaman Chairs Review Meeting On Drive Against Fake Billing",
    "Bollywood Divas And Their Stylish Beach Vacations In Pictures",
    "Malaika Arora Aces Her Gym Look In Simple Athleisure Wear, See Photos",
    "Nayanthara's Heartwarming Photos With Twin Sons Will Melt Your Heart, See The Adorable Pictures",
    "US Man Wins Rs 41 Lakh In Lottery And His Winning Strategy Is...",
    "Video Of Thirsty Squirrel Asking For More Water Is Too Cute To Miss",
    "'Adipurush' Day 1 Has Been a Roller Coaster Ride. Here’s Everything Bizarre That Unfolded",
    "Uncovering History: This 3,000-Year-Old Sword Found In Germany Still Shines",
    "This YouTuber Declined a Salary of Rs 40 Cr Only to Earn a Net Worth of Rs 4000 Cr in 2 Years",
    "CUET UG 2023 Admit Card for June 19, 20 Exam Out at cuet.samarth.ac.in",
    "UPSC EPFO Admit Cards Released At upsc.gov.in; Here's How To Download",
    "JEE Advanced 2023 Results Tomorrow At jeeadv.ac.in, Check Result Time",
    "AP LAWCET Results 2023 Declared On cets.apsche.ap.gov.in; How To Check",
    "More Education & Career News",
    "Musk's Brain Chip Firm Neuralink to Start its First Human Trial This Year",
    "OpenAI Has Taken YouTube's Help To Train ChatGPT And Other AI Models: Report",
    "How To Use iOS 17's StandBy Feature To Transform Your iPhone Into A Smart Display",
    "WhatsApp Could Soon Let You Add Two Accounts On One Device: All Details",
    "Samsung Galaxy Z Fold 5 Leaked Render Gives Us Our First Look At The Upcoming Foldable",
    "All-New Hero Xtreme 160R Launched in India, Price Starts at Rs 1.27 Lakh",
    "2023 Honda Unicorn Launched in India, Price Starts at Rs 1.09 Lakh",
    "All-Electric Volvo C40 Recharge Unveiled in India, Gets Range of 530 Km",
    "Maruti Suzuki All-New MPV To Be Christened Invicto, Will Be Unveiled on July 5",
    "Bajaj Pulsar P150 Review: The Legacy Continues",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Islamic State-Linked Group Enter School, Kill 25 Children in Uganda",
    "King Charles to Become First Monarch in 37 Years to Take Part in Birthday Parade on Horseback",
    "Need More Tanks in Ukraine, Russian Defence Minister Shoigu Tells Kremlin",
    "Modi-Biden Talks to Touch Five Broad Areas of Significance, Says Ambassador Sandhu",
    "What Caused Thousands of Dead Fish to Wash Up Ashore on a Texas Beach? 'Mystery' Explained",
    "Lewis Hamilton Leads George Russell in Mercedes One-two in Canada Practice",
    "WWE Smackdown Results June 16: Jey Uso Turns on Roman Reigns, Pretty Deadly Win Gauntlet Match",
    "Libema Open: Emil Ruusuvuori Sinks Jannik Sinner to Reach Maiden Grass-court Semifinals",
    "Nottingham Open: Andy Murray Ease Past Dominic Stricker to reach Semi-final",
    "Antonio Lopez Habas Joins Mohun Bagan Super Giant as Technical Director",
    "Father's Day 2023: 9 Serene Retreats To Spend The Weekend With Your Dad",
    "Father's Day 2023: 4 Unique and Extremely Useful Gifting Ideas for Your Dad",
    "Kriti Sanon to Tamannaah Bhatia: 7 Times Bollywood Divas Totally Nailed the Holographic Trend",
    "Alia Bhatt Sported A Barbie-Core Ensemble Worth  Rs. 94,253 At The Promotions Of Heart Of Stone",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "Uniform Civil Code in Limelight Again: What it is, Major Court Judgements Around UCC | Explained",
    "Predator Drone Deal With US: What are MQ9 Reaper Drones & Why Does India Need Them? Explained",
    "Tamil Nadu Withdraws Consent to CBI for Probe in State Amid Senthil's Arrest: What Does Law Say?",
    "Chandrayaan-3 Scheduled for July Launch | A Guide to ISRO's 3rd Lunar Exploration Mission",
    "Indian Monsoon: What is El Nino and It's Impact on Rainy Season Explained",
    "Opinion | Why Sunny Deol’s ‘Gadar 2’ Could Spring a Surprise at The Box Office",
    "Opinion | Why Uttarakhand And Jharkhand Have Set Off Alarm Over Demographic Shift",
    "Opinion | PM Modi’s State Visit to US: Why 'Gastro-diplomacy' Must be on the Table Too",
    "Opinion | India's Diversity and Inclusion: Strengths in Public Diplomacy",
    "Everyone Can Make Promises but Modi Govt's 'strong Point' is Delivery, Says Jaishankar",
    "Nations League Final: Luka Modric's Croatia Aiming For First Trophy Against High-spirited Spain",
    "'Now I Can't Leave': World Cup Winner Lionel Messi Opens up on His Future With Argentina",
    "Germany Suffer 1-0 Loss to Poland in International Friendly"
]