[
    "In Bhopal, PM Modi Poses Question on Uniform Civil Code, Gives 'Option' to Voters to 'Pick Oppn'",
    "Weather News LIVE: CM Mamata's Chopper Makes Emergency Landing; Orange Alert in Mumbai",
    "ICC ODI World Cup 2023 Full Schedule: India To Begin Campaign vs Australia; IND vs PAK on Oct 15",
    "United for Centre, Divided in State? Mamata, Congress Fight for Space in Battleground Bengal",
    "Kusha Kapila Trolled For Agreeing With Karan Johar Amid Divorce: 'Sexual Infidelity Is Not...'",
    "SatyaPrem Ki Katha: Rochak Defends Pasoori Remake, 'Ali, Arijit Expected Such Reactions'",
    "Maharashtra SP Chief is Someone's 'Target', Receives Scary WhatsApp Message",
    "When 'Drunk' Dharmendra Allegedly Stopped Hema Malini From Marrying Jeetendra",
    "US Cruise Ship Hit by Sudden Storm at Florida Coast, Passengers Dodge Flying Chairs | On Cam",
    "'Dus Bahane': Desis on Twitter Choose Songs From 90s, 2000s They Still Vibe On",
    "Tomato Prices Double In 1 Week, May Cross ₹100 Per Kg Mark Soon",
    "Watch: Range Rover Evoque Turns Into Fireball After Short Circuit in Bonnet",
    "Sex And The City Star Sarah Jessica Parker Wears Indian Designer | Desi Designers Who Went Global",
    "Tamannaah Bhatia & Vijay Varma On Love And Their Film 'Lust Stories 2' | Sujoy Ghosh | EXCLUSIVE",
    "Kartik Aaryan Flies Economy; Sara Ali Khan Enjoys Temple Runs - Reality Or Publicity Stunts?",
    "Oral & Dental Hygiene: Arginine Can Help You Maintain Health Of Your Teeth & Gums | Know How",
    "Sexy! Nia Sharma Flaunts Her Bombshell Body In A Racy Cutout Monokini, Hot Video Goes Viral; Watch",
    "When Dharmendra's 1st Wife Spoke on His Marriage With Hema Malini: 'All Heroes Having Affairs'",
    "Tamannaah Bhatia Turns Emotional As Fan Reveals Tattoo of Actress' Face, Touches Her Feet; Watch",
    "MORE FROM NEWS18 CRICKETNEXT",
    "Mohammed Shami Requested to be Rested For West Indies Tour: Report",
    "Molestation Allegation Against Prithvi Shaw by Social Media Influencer is False: Police",
    "Carlos Brathwaite's Glum Expression Says it All as Netherlands Stun West Indies | WATCH",
    "Sev Puri Dosa is Internet's New Food Combo That Will Make Your Taste Buds Go for ...",
    "Men Getting Window Seat to Accompany Pal Who Forgot His ID to Bar is Pure Friend ...",
    "Delhi Men Try to Rob Couple on Street, End Up 'Giving' Rs 100 Instead: Watch Vir ...",
    "Eid ul Adha 2023: 5 Hacks To Ensure Fitness Doesn't Take A Back Seat In Celebrations",
    "Fan Calls Sonu Sood 'God', His Reaction Is Winning Twitter",
    "Sev Puri Dosa is Internet's New Food Combo That Will Make Your Taste Buds Go for a Toss",
    "Suhana Khan’s Theatrical Debut With Shah Rukh Khan To Be Helmed By Sujoy Ghosh; Report",
    "'Can The Wheel Be Broken?': Jung Hae-in Starrer D.P. 2 First Teaser Is Out And It Is Intense",
    "Sister of Slain Gangster Atiq Ahmad Moves SC Seeking Inquiry into 'Extra-judicial Killings'",
    "Aamir Khan Sees Off His Guests Barefoot, Reveals Gippy Grewal: 'He's Not Bothered'",
    "Russia Executed 77 Civilian Detainees in Ukraine: UN",
    "'Lord Hanuman' Watches Adipurush Movie In A Theatre | Adipurush Movie | #Shorts #trending #viral",
    "Meet Jassym Lora Russell, Andre Russell's Wife",
    "7 Health Benefits of Mosambi Juice",
    "ICC World Cup 2023: Full List Of Stadiums",
    "7 Indian Restaurants In World's Legendary...",
    "How To Make Joint Financial Decisions As A...",
    "Astrological Predictions for June 27, 2023",
    "Indian Actors Who Played Negative Roles In...",
    "9 Celebrities Who Swear By Aerial Yoga",
    "India ODI Squad vs WI Announced",
    "How To Grow Flax Seeds At Home",
    "Top 5 Bikes Launching In India This Year",
    "9 Popular Varieties Of Red Roses",
    "6 K-Drama Locations You Can Visit In South...",
    "5 Food Combinations with Milk to Avoid",
    "India Test Squad VS WI Announced",
    "Kajol Set To Make OTT Debut With Lust Stories 2",
    "9 Benefits Of Drinking Saffron Tea",
    "Indian Cricketers in Their Alternate...",
    "6 Surprising Health Benefits Of Kissing",
    "Your Worst Habit According To Your Zodiac Sign",
    "Malaika Arora's Favourite Yoga Asanas",
    "Bollywood Stars As Superheroes Would Look...",
    "Instagram Users Can Download Public Reels:...",
    "8 Most Valuable Football Players",
    "9 Different Types Of Coffee You Must Try",
    "Best Careers For Each Zodiac Sign",
    "Virat Kohli’s Stunning Net Worth Of INR 1000...",
    "9 Effects Of Smoking On Your Skin",
    "Most Practiced Yoga Asanas In The World",
    "Amazon Launches Prime Lite Membership In India",
    "Ram Charan And Upasana Kamineni Welcome Baby...",
    "6 Best Indoor Plants To Add Greenery To Your...",
    "9 Amazing Benefits Of Coconut Oil",
    "PM Narendra Modi’s Quotes On Yoga",
    "Shilpa Shetty Encourages Surya Namaskar",
    "Virat Kohli Reimagined as Popular Pop...",
    "Tips To Buy Dream Home Before You're 40",
    "Why Travel To India During The Monsoon",
    "Steps To Help You Recover After Breakup",
    "9 Ways To Improve Your Gut",
    "If Cricketers Were Marvel Superheroes…",
    "6 Zodiac Signs That May Have Difficult...",
    "Hotness Alert! Celebs Who Went Topless",
    "Malaika Arora Stuns In Athleisure",
    "Dhoni's Mother-in-law Runs Rs 800-Cr Firm",
    "Kriti Sanon Inspired Saree Looks",
    "Sexy Indian-Origin Women Pro-Wrestlers",
    "Father’s Day 2023: Celebrity Fathers & Sons",
    "Leonardo DiCaprio's Dating Neelam Gill?",
    "Tamannaah Bhatia and Vijay Varma are Giving...",
    "Tips To Make The Right Career Move",
    "Sharvari Wagh’s Fitness Mantra",
    "How To File Complaint With IRCTC",
    "Remembering Sushant Singh Rajput",
    "BTS Turns 10: Their Biggest Milestones",
    "Top 10 Least Friendly Cities In The World",
    "8 Most Scenic Road Trips In India",
    "6 Tips To Revive Physical Attraction In...",
    "9 Most Popular Indian Web Series Of All Time",
    "England ODI World Cup 2023 Full Schedule: Check Full List of Matches for the Defending Champions",
    "Australia ICC ODI World Cup Schedule: Check Fixtures, Venues and Match Timings",
    "Kevin Pietersen Turns 43: Former England Skipper’s Famous Tweets on India and IPL",
    "'Smart and Engaging Young Man': Shashi Tharoor Runs Into Shoaib Akhtar at Dubai Airport",
    "Happy Birthday Dale Steyn: 5 Best Bowling Spells by the South African Legend",
    "Air India Passenger Arrested for Defecating, Urinating & Spitting on Mumbai-Delhi Flight",
    "‘My Magistrate Wife, Her Lover Giving Me Threats Over Divorce’: UP Employee Seeks Help from CM",
    "India Summons Pakistani Diplomat Over Sikh Community Attacks, Lodges Strong Protest",
    "Delhi Merchant Navy Personnel Abducted: 4 Arrested Within 12 Hours, Toy Gun, Car Seized",
    "Delhi Airport Introduces Self Baggage Drop Facility to Cut Waiting Time | Know How to You Use",
    "Hindustan Aeronautics Announces 1:2 Stock Split; Approves Rs 15 Dividend",
    "Sebi Asks Investor Service Centres Of Exchanges To Provide Certain Basic Facilities",
    "Looking For A Personal Loan? Know The Factors That Affect The Interest Rate",
    "Stock Market Holiday: NSE, BSE to Remain Closed on Thursday for Bakrid",
    "ITR Filing Crosses 1 Cr Milestone Till June 26; Know How To Register And File ITR Soon",
    "Kiara Advani Rules Vibrant Colours and Here's Why",
    "Katrina Kaif Weaves a Summer Fairytale with Floral Printed Dresses",
    "Shanaya Kapoor Oozes Charm in a Classic Red Saree; Check Out Actress Ethnic Looks",
    "Khloe Kardashian Birthday: Hot and Sexy Photos of the Reality TV Siren with Her Sisters",
    "New BFFs in B-Town: Six Times Disha Patani And Mouni Roy Gave Us Major Friendship Goals",
    "Nora Fatehi Proves That She's The Ultimate Beauty, See The Diva's Sexy Pictures!",
    "Arjun Kapoor Birthday: 10 Adorable Pictures With His Ladylove Malaika Arora",
    "From Secret Invasion to Lust Stories 2, 6 OTT Releases to Look Out for in July 2023",
    "Sonakshi Sinha's 'Seychelles in a Nutshell'",
    "Zeenat Aman's Chic Cover Shoot For Vogue India",
    "Tamannaah Bhatia's Love Affair With Monochrome, Check Out The Diva's Top 6 Looks From Recent Times",
    "This Fruit Chai Made With Banana, Chikoo Has Desi Foodies in Shock",
    "Delhi Men Try to Rob Couple on Street, End Up 'Giving' Rs 100 Instead: Watch Viral Video",
    "Man Spotted Masturbating Outside Girls' PG in Delhi, DCW Chief Swati Maliwal Shares Footage",
    "NMC Webinar on NExT Exam To Be Held Today With Medical Colleges, MBBS Students",
    "Mumbai's St Xavier's College Reintroduces Marathi as Optional Language After Four Decades",
    "KCET Counselling 2023: Document Verification Begins Today, List of Required Certificates",
    "Presidency University Temporarily Suspends New Code of Conduct After Students Hold Protest",
    "More Education & Career News",
    "WhatsApp To Roll Out Darker Top App Bar Soon: All You Need To Know",
    "Oppo Reno 10 Pro+, Oppo Reno 10 Pro India Launch Soon: What To Expect",
    "Meta Challenges Apple with Launch of Quest+ VR Subscription Service",
    "Why Pakistani Hackers Are Now Targeting IITs, NITs: All Details",
    "Amazon To Create 20 Lakh Jobs In India By 2030, Says CEO Andy Jassy: All Details",
    "Maruti Suzuki Invicto Interior Images Leaked Ahead of Launch, Check What's New",
    "2023 Kia Seltos Facelift GT Line Clear Images Leaked Ahead of Launch in India",
    "Bangalore Metro: Purple Line Opens for Public in August; Check Stations, Routes and More",
    "Maruti Suzuki Invicto Clear Images Emerge Ahead of Official Launch, Spotted at Dealership",
    "Royal Enfield Classic 650 Spotted Testing for First Time in India, Check What's New",
    "Ukraine “Liberates” Donetsk Village, Russia \"Repels\" Ship Attack, Wagner Dares Shoigu On Contracts",
    "Russia Fumes At Canada's \"Theft\" As Trudeau Forfeits cargo plane For Ukraine On Kyiv Visit",
    "Russia Cites Failed Offensive Operations As Ukraine Claims Bakhmut Gains, Canada Pledges Missiles",
    "Oil Feud | Did Crown Prince MBS' Threat of \"Economic Consequences\" Prompt Biden's Saudi U-Turn?",
    "Which is Longer, Amazon or Nile? New Quest Expedition to Settle Old Debate",
    "Israel to Build 5,700 Settler Homes in Palestine’s Restive West Bank Ignoring US' Warnings",
    "Diwali to Be Added to List of Public School Holidays in New York City",
    "'Take Steps to Disband All Terrorist Groups': US Warns Pakistan Days After Modi-Biden Statement",
    "Carlos Alcaraz Retakes No. 1 Spot Ahead of Wimbledon, Novak Djokovic Pushed to Second",
    "FIFA Club World Cup 2023 to be Played in Saudi Arabian City of Jeddah",
    "Sports Minister Anurag Thakur Inaugurates State-of-the-art Hockey Astro Turf at BSF Headquarters",
    "Special Olympics World Games: India Finish With Incredible 202 Medals in Berlin",
    "Pooja Hegde Makes a Stylish Splash in the 7 Colours of the Rainbow",
    "Kim Kardashian Gives Faux Leather A Sexy Makeover; Drops Photos in Bold Itsy Bitsy Bikini",
    "Striking a Balance: Nurturing Active Learning in the Digital Age",
    "Kajal Aggarwal Dazzles In XITI Weaves For Satyabhama Pre-Glimpse Event",
    "Daily Horoscope, May 27: Money Astrological Prediction for Saturday",
    "Numerology Today, May 26: How Compatible is Number 4 with 9",
    "Daily Horoscope, May 26: Money Astrological Prediction for Friday",
    "Daily Horoscope, May 25: Money Astrological Prediction for Thursday",
    "Numerology Today, May 9: Born on 25th of Any Month? Find Out Your Personality Traits",
    "The Titanic Wants You to Sink With Its Stories. No One Can Fight",
    "What Exactly Happened in Russia? From Wagner Group Rebellion to Belarus Deal, All to Know",
    "Game-Changing Partnership: Why GE's Joint Fighter Jet Production in India is Trail-blazing",
    "Opinion | Responsible Behaviour in Space: Why Public Participation is Key",
    "Opinion | Pakistan-Russia Ties: No Counter to Indo-US Bonhomie or India-Russian Bear Hug",
    "Opinion | Ilhan Omar Running Islamist Agenda Against India in the Name of Minority Rights",
    "Opinion | Do the Wagner Mutiny & a Weakened Putin Spell Nuclear Nightmare for the Rest of Us?",
    "Former Telangana Minister, Ex-MP Among 35 BRS Leaders Set to Join Congress, Meet Kharge and Rahul",
    "Obama Remark Row: Rajnath, Hardeep Puri Join Leaders in Slamming Ex-US Prez | Story So Far",
    "'That is How a Star Shines': Liverpool Fans Laud Mohamed Salah as Training Video Goes Viral"
]