[
    "Continue reading the main story",
    "The dangerous heat wave will continue to bake the U.S. this week.2 min read",
    "Here’s what to know about heat waves and their causes.3 min read",
    "See detailed maps of the latest U.S. heat index.",
    "Shooter in Deadly Colorado Springs Rampage Pleads Guilty in Court4 min read",
    "In Classrooms, Teachers Put A.I. Tutoring Bots to the Test5 min read",
    "How Review-Bombing Can Tank a Book Before It’s Published5 min read",
    "Jesse Watters to Fill Tucker Carlson’s Old Slot as Fox Shuffles Lineup2 min read",
    "In New Hampshire, DeSantis Avoids Talking About Florida’s Abortion Ban",
    "Trump Weighs Skipping Primary Debates",
    "ReviewGoogle’s new Pixel Fold proves that phones with bendable screens are improving.4 min read",
    "ReviewKelly Clarkson’s new album, “Chemistry,” draws on familiar formulas.3 min read",
    "Serge SchmemannYevgeny Prigozhin Must Know What Happens in Russia to Rebels Who Fail7 min read",
    "Gail Collins and Bret StephensWhile We Wait for the Supreme Court to Make Up Its Mind …6 min read",
    "Ori NirA Dangerous Shift Is Underway in the West Bank5 min read",
    "Adrian J. Rivera‘Flamin’ Hot’ Is So Bad, It Burns6 min read",
    "Margaret RenklThe Nature of Joy5 min read",
    "Peter CoyA Renowned Economist’s New Idea for Stopping Climate Change5 min read",
    "Letters From Our ReadersWorrying About the Judge and the Jury for Trump’s Trial5 min read",
    "J. Michael LuttigIt’s Time for a Reckoning With Donald Trump4 min read",
    "David FrenchThe Legal Foundation of Women’s Sports Is Under Fire6 min read",
    "Farhad ManjooWe All Live in ‘South Park’ Now5 min read",
    "Lydia PolgreenMilitias Are Rampaging Through West Darfur, Killing With Impunity8 min read",
    "Richard MorganI’m Here, I’m Queer and I Came Out in the Name of Truth5 min read",
    "Tish Harrison WarrenCan Everyone Take a Sabbatical?6 min read",
    "Mark OppenheimerThe Pittsburgh Gunman Didn’t Just Kill 11 Jews. He Killed a Minyan.4 min read",
    "Nicholas KristofThe Real Lesson From the Hunter Biden Saga4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "After a Jarring Crash, Drivers Raise Concerns About NASCAR’s Safety Efforts",
    "An N.B.A. Star Has Serious Interest in Joining the Heat",
    "She Wanted to Make a Career Out of Motorsport. It Led to Formula 1 History.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]