[
    "New York City started busing migrants to a hotel in the town of Newburgh.3 min read",
    "Continue reading the main story",
    "Dealing With Covid Right Now",
    "What comes next for George Santos?3 min read",
    "These gifts will still arrive in time for Mother’s Day.",
    "Going out on Mother’s Day is a nightmare. Here are 12 brunch recipes to make instead.3 min read",
    "Frank BruniTrump’s ‘Stupid,’ ‘Stupid’ Town Hall9 min read",
    "David FirestoneGeorge Santos’s Spectacularly Dumb Alleged Scheme4 min read",
    "Charles M. BlowThe Panic Over Biden’s Age Is Manufactured4 min read",
    "Cihan TugalWhatever Happens Next, Turkey Is in Trouble4 min read",
    "Jeneen InterlandiAmerica Is Forgetting the Lessons of the Covid Health Emergency5 min read",
    "Lulu Garcia-NavarroMillions of People Watched Her Grow Up Online. What Did It Cost Her?",
    "David FrenchA Guilty Ex-President4 min read",
    "26 Empire State Buildings Could Fit Into New York’s Empty Office Space. That’s a Sign.",
    "Peter CoyGovernment Budget Deficits Can Pay for Themselves4 min read",
    "Jessica Grose‘Christianity’s Got a Branding Problem’6 min read",
    "David Wallace-WellsWe Could Easily Make Risky Virological Research Safer6 min read",
    "Letters From Our ReadersThe Impasse Over Raising the Debt Limit3 min read",
    "Listen to ‘The Daily’Representative George Santos is in even more trouble.",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The 10 M.L.B. Surprises No One Saw Coming This Season",
    "Indigenous N.H.L. Player Forgives ESPN Anchor for Insensitive Joke",
    "Patriots to Honor Tom Brady at 2023 Home Opener",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]