[
    "Continue reading the main story",
    "Did you follow the news this week? Take our quiz.",
    "The Best Movies on Amazon Prime Video Right Now22 min read",
    "‘The Night of the 12th’ Review: When a Case Doesn’t Close2 min read",
    "‘The Postcard’ Review: An Autobiographical Novel of Occupied France6 min read",
    "‘Undaunted’ Review: A History of Women in Journalism6 min read",
    "In the Ethicist: My husband flies first class and puts me in coach. Is that fair?4 min read",
    "We spent a day with one of New York City’s last bagel masters.1 min read",
    "The Editorial BoardWhy Is George Santos Still in Office?3 min read",
    "Nicholas Kristof50 Cents Can Change a Life4 min read",
    "Ross DouthatWhat the Writers’ Strike Means for the Future of Hollywood4 min read",
    "Maureen DowdClassical Crescendo4 min readMarcus Ohlsson/Trunk Archive",
    "Elizabeth SpiersHow ‘Succession’ Busts One of America’s Most Cherished Myths5 min read",
    "Brad StulbergThe Case for Obligation4 min read",
    "Rachel ConnollyLet Me Tell You About My Friend Dan. Dan Always Buys ‘The Best.’11 min read",
    "Warren ZanesWhat We Can Learn From Bruce Springsteen’s Great Left Turn5 min read",
    "Peter CoyTo See One of A.I.’s Greatest Dangers, Look to the Military4 min read",
    "Paul KrugmanHere’s How We’ll Know the U.S. Economy Is Headed for a ‘Soft Landing’",
    "Letters From Our ReadersSeeking Cures for Loneliness4 min read",
    "‘The Ezra Klein Show’Why Are Teens in Crisis? Here’s What the Evidence Says.",
    "Sarah WildmanMy Daughter’s Future Was Taken From Her, and From Us8 min read",
    "Farhad ManjooOffice Workers Don’t Hate the Office. They Hate the Commute.5 min read",
    "Hank Green, Novelist and YouTube Star, Announces He Has Cancer2 min read",
    "An Auction of Prosthetics, Mermaids and Creepy Dolls to Benefit Sea Turtles3 min read",
    "Ugly Tale of Migrants Displacing Veterans Makes Waves and Then Dissolves4 min read",
    "Two Champions Give Lightweight Boxing a Stirring Matchup4 min read",
    "Bill Perkins, Defender of His Harlem Constituents, Dies at 743 min read",
    "A ‘Canadian Armageddon’ Sets Parts of Western Canada on Fire4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Just How Bad Are the 2023 Oakland A’s? They Could Make History.",
    "How the N.H.L.’s Most Dysfunctional Team Turned Into a Stanley Cup Contender",
    "College Football Is in an Arms Race. One Storied Program Is Falling Behind.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]