[
    "The nuclear power plant in Zaporizhzhia again lost power after Russian shelling.",
    "Continue reading the main story",
    "Leer en español. (Read in Spanish.)16 min read",
    "U.S. Debt Ceiling Standoff",
    "When Will the U.S. Default?",
    "Even flirting with a U.S. debt default is having economic consequences.5 min read",
    "These monoliths are the oldest known architectural plans recorded in history.3 min read",
    "A Wirecutter vacuum expert who has rabbits and cats shares how she de-furs her home.",
    "Ezra KleinLiberals Are Persuading Themselves of a Debt Ceiling Plan That Won’t Work4 min read",
    "Rachel ConnollyLet Me Tell You About My Friend Dan. Dan Always Buys ‘The Best.’11 min readTracy Ma",
    "David FrenchWhy Ukraine Needs Those F-16s5 min read",
    "Susan StubsonWhat Christian Nationalism Has Done to My State and My Faith Is a Sin7 min read",
    "Daniela J. LamasNot Every Pandemic Needs Someone to Blame4 min read",
    "Gordon WitkinHere’s What We Can Do Now About Gun Violence6 min read",
    "Tish Harrison WarrenWe Should Be More ‘Amish’ About Technology6 min read",
    "Letters From Our ReadersWhen Corporations Take Over Health Care5 min read",
    "Maureen DowdClassical Crescendo4 min read",
    "Nicholas KristofHow to Change a Life for 50 Cents4 min read",
    "Brad StulbergFor People to Really Know Us, We Need to Show Up4 min read",
    "Ross DouthatWhat the Writers’ Strike Means for the Future of Hollywood4 min read",
    "Jamelle BouieThere Is a Reason Ron DeSantis Wants History Told a Certain Way6 min read",
    "Fire Guts Manila’s Historic Post Office Building2 min read",
    "Brittney Griner Returns to the W.N.B.A. With a Weekend of Celebration5 min read",
    "Grenade Detonation Kills Father and Injures His Two Children2 min read",
    "Arson Is the Latest in a String of Attacks on Minnesota Mosques2 min read",
    "Bill Saluga, a Memorable Comedic Wiseguy, Is Dead at 854 min read",
    "Typhoon Mawar Is Expected to Hit Guam by Wednesday2 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The Yankees Took Care of a Big Roster Problem. Is Another Change Coming?",
    "On Opening Night, Breanna Stewart Gives New York a Taste of the Future",
    "A Celebration of the Weirdest Jobs in Soccer",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]