[
    "Continue reading the main story",
    "Mayor Adams Addresses Killing",
    "U.S. Debt Ceiling Standoff",
    "Understand the G.O.P. Plan",
    "Consumers are running out of reasons to splurge on a “pro” phone, our columnist writes.4 min read",
    "David NasawElon Musk Makes Sense. Yes, Really.6 min read",
    "Zeynep TufekciThe Shockingly Lax Laboratory Standards in the U.S.8 min read",
    "Luis Alberto UrreaMy Mother Returned from World War II a Changed Woman5 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "Ross DouthatConservative Media Has an Audience Problem6 min read",
    "Cecilia MárquezThe Long and Violent History of Anti-Black Racism in the Latino Community4 min read",
    "Peter CoyThe Struggle to Explain the ‘Gender Well-Being Gap’4 min read",
    "Farhad ManjooTucker Carlson on Twitter Could Work Awfully Well5 min read",
    "David BrooksThe Second Phase of the Biden Presidency4 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Frank BruniTrump’s ‘Stupid,’ ‘Stupid’ Town Hall9 min read",
    "Letters From Our ReadersBullying, and Suicide, in High School5 min read",
    "Matter of OpinionWhat if We Just Paid Clarence Thomas $1 Million?",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Here are some more recent favorites:",
    "What’s in Our Queue? Liberato and More",
    "Whats in Our Queue? ‘Succession’ and More",
    "Dan Snyder to Proceed With Sale of Washington Commanders to Josh Harris3 min read",
    "In Deposition, Former Prosecutor Rebuffs G.O.P. Questions About Trump Case3 min read",
    "Inquiry Into Senator Menendez Prompts Subpoena Over Stalled N.J. Bill4 min read",
    "Hodding Carter III, Aide to Jimmy Carter During Iran Hostage Crisis, Dies6 min read",
    "Israel Says It Has Struck More Sites Operated by Palestinian Militants4 min read",
    "N.Y.C. Congestion Pricing Plan Could Give Poor Drivers a Discount4 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "A Timeline of Dan Snyder’s Tumultuous Tenure in Washington",
    "As the Nuggets Chase an N.B.A. Title, Nikola Jokic Keeps Raising the Bar",
    "Why Georgia Football Was Wrong for Declining the White House Invitation",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]