[
    "Continue reading the main story",
    "Al Drago for The New York Times",
    "The Colorado River is shrinking. See what’s using all the water.",
    "These maps show how Russia advanced on Bakhmut in its monthslong assault on the city.1 min read",
    "Daniel Berehulak/The New York Times",
    "Anna Watts for The New York Times",
    "Travis Dove for The New York Times",
    "“The Late Americans,” a novel by Brandon Taylor, is full of bad sex, our critic writes.4 min read",
    "Is scraping your tongue beneficial?3 min read",
    "Gail Collins and Bret StephensThe Republican Presidential Plot Is Thickening6 min read",
    "Will LeitchTrump Is Back, to Make Families Fight Again5 min read",
    "Michelle GoldbergRon DeSantis’s Takeover of a Progressive College",
    "Ezra KleinBiden’s Emergency Debt Ceiling Plan Wouldn’t Work4 min read",
    "Peter CoyThe Welfare Debate Stalling the Debt Talks5 min read",
    "Letters From Our ReadersEric Adams and the Migrants in New York4 min read",
    "David FrenchUkraine Needs Those F-16s5 min read",
    "Susan StubsonWhat Christian Nationalism Has Done to My State and My Faith Is a Sin7 min read",
    "Elizabeth SpiersHow ‘Succession’ Busts One of America’s Most Cherished Myths5 min read",
    "Tish Harrison WarrenWe Should Be More ‘Amish’ About Technology6 min read",
    "Daniela J. LamasNot Every Pandemic Needs Someone to Blame4 min read",
    "Gordon WitkinHere’s What We Can Do Now About Gun Violence6 min read",
    "Maureen DowdClassical Crescendo4 min read",
    "Nicholas KristofHow to Change a Life for 50 Cents4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Michael Regan/Getty Images",
    "To Slow Down Base-Stealing, Infielders Might Be Using a Dangerous Maneuver",
    "After a Controversial Hire, Michigan Athletics Continues Its Series of Missteps",
    "The Player on Every N.F.L. Team With the Most to Prove This Offseason",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]