[
    "Continue reading the main story",
    "Ukrainians send a message with their bombs. On them, too.4 min read",
    "“Succession” Recap: It’s election night in America. Stay away from the bodega sushi.6 min read",
    "The U.S., bewitched by pickleball, is late to another sports craze.5 min read",
    "James Gunn knew how “Guardians of the Galaxy” would end.8 min read",
    "Gail Collins and Bret StephensTrump Cannot Be Unseen7 min read",
    "David FrenchWhen the Rule of Law Fails Us5 min read",
    "Farah StockmanThe People Who Stay Behind in a Crisis Decide the Country’s Fate5 min read",
    "Mitchell Abidor and Miguel LagoHow France’s Far Right Became the Adults in the Room5 min read",
    "Margaret RenklAgainst Despair: An Open Letter to Graduates5 min read",
    "Adam GopnikWhat We Lose When We Push Our Kids to ‘Achieve’6 min read",
    "Rachel Louise SnyderWhat Do You Say When the Person You Love Most in the World Returns?7 min read",
    "Michael W. McConnellThe Case for Violating the Debt Limit Is Dangerous Nonsense4 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Tish Harrison WarrenManaging Screen Time Is a Family Matter7 min read",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Letters From Our ReadersSpeeding Up the Update of Our Electrical Grid5 min read",
    "Maureen DowdAs Sun Tzu Says, ‘Know the Enemy.’4 min read",
    "Bill SammonWe’re Asking the Wrong Questions About the Trump Town Hall4 min read",
    "12 Million People Are Under a Heat Advisory in the Pacific Northwest2 min read",
    "China Sentences a U.S. Citizen to Life in Prison for Espionage2 min read",
    "In Blow to Junta, Thai Voters Overwhelmingly Back Opposition Parties5 min read",
    "Owen Davidson, Who Won 8 Grand Slams With Billie Jean King, Dies at 793 min read",
    "Nikki Haley Says Pledging a Federal Abortion Ban Wouldn’t Be ‘Honest’3 min read",
    "‘Chonkosaurus,’ a Thick Snapping Turtle, Has Been Stealing Hearts3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The Worst Job in Soccer: ‘It’s 90 Minutes of Hell’",
    "A Line Drive Fractures an M.L.B. Pitcher’s Skull",
    "LeBron James’s Game 6 Performance Sends a Clear Message",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewDeb Amlen reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]