[
    "A major lender abroad, China is facing a debt bomb at home. Here’s why.5 min read",
    "One reason the U.S. can’t quit China? Chips.4 min read",
    "Pool photo by Mark Schiefelbein",
    "Ukraine’s Counteroffensive",
    "Prigozhin’s 36-Hour Rebellion",
    "Here’s what to know about college admissions now that affirmative action is gone.3 min read",
    "Jordan Gale for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "You can still get that vacation feeling while taking a staycation. Here’s how.4 min read",
    "Going on a trip you can’t afford? These strategies can help control the cost.6 min read",
    "Frank LehmanHave We Been Listening to Movies the Wrong Way?",
    "Peter CoyThe Avoidable Mistake of a UPS Strike6 min read",
    "Jamelle BouieNo One Can Stop Talking About Justice John Marshall Harlan6 min read",
    "Shamus KhanLegacy Admissions Don’t Work the Way You Think They Do4 min read",
    "Bayan AbubakrSudanese People Want Democracy. The World Has Never Listened.5 min read",
    "Gabe Stone ShayerThe American Ballet Theater Does Not See Me as I See Myself5 min read",
    "Farhad ManjooHow Would Harvard Talk About My Kids?5 min read",
    "Tressie McMillan CottomThe Supreme Court Shattered the American Dream",
    "David Wallace-WellsRochelle Walensky on the Rocky Road to Normal22 min read",
    "‘The Ezra Klein Show’The I.R.A. Passed a Year Ago. Here’s a Progress Check.",
    "Letters From Our ReadersThe Power of Community, Religious and Secular5 min read",
    "Paul KrugmanThe Rich Are Crazier Than You and Me4 min read",
    "David BrooksWhy I Still Love the New York Mets4 min read",
    "David FrenchThe Rage and Joy of MAGA America6 min read",
    "Frank BruniRon DeSantis and His Campaign of Contempt9 min read",
    "Don’t Take It From a ‘Thinkboi’",
    "Why Is Apple Getting ‘Spatial’?",
    "M.L.B. Draft Trades Magic for EfficiencyThe days of unlimited picks are over.5 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]