[
    "Continue reading the main story",
    "Here’s how parents can help teenagers navigate social media.6 min read",
    "Leer en español. (Read in Spanish.)9 min read",
    "Charlie Cordero for The New York Times",
    "A new report underscores the increasing chances of a U.S. default in early June.2 min read",
    "Doug Mills/The New York Times",
    "Do New York’s affordable housing lotteries fuel segregation?4 min read",
    "Luca Locatelli for The New York Times",
    "A saber-tooth predator emerged during an extinction crisis in the Permian Period.3 min read",
    "Dave Matthews Band’s 10th album faces troubles and searches for solace.3 min read",
    "Katherine MillerThere’s Another Business Man Who Wants to Run America6 min read",
    "Chouwa LiangMy A.I. Lover Gets Me",
    "Jamelle BouieNeil Gorsuch Has Given Himself Away4 min read",
    "David BrooksTim Keller Was a Guide to a Wonder-Filled Life4 min read",
    "Paul KrugmanWorking From Home and Realizing What Matters4 min read",
    "Scott J. ShapiroThis Is Why I Teach My Law Students How to Hack5 min read",
    "‘The Ezra Klein Show’Why This Psychologist Is Hopeful About Teen Mental Health",
    "Stephen I. VladeckPublic Criticism Might Be the Best Way to Reform the Supreme Court5 min read",
    "Sapna CheryanThe Most Common Graduation Advice Tends to Backfire4 min read",
    "Gail Collins and Bret StephensThe Republican Presidential Plot Is Thickening6 min read",
    "Peter CoyThe Welfare Debate Stalling the Debt Talks5 min read",
    "Letters From Our ReadersEric Adams and the Migrants in New York4 min read",
    "Ezra KleinBiden’s Emergency Debt Ceiling Plan Wouldn’t Work4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Robbie Jay Barratt/Getty Images",
    "Ranking M.L.B. Teams From First to Worst, as the Padres Free Fall",
    "Why Denver’s N.B.A. Finals Berth Is a Salve for 47 Years of Heartbreak",
    "Racist Abuse Leaves Real Madrid’s Star Winger Doubting His Future",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]