[
    "The nuclear power plant in Zaporizhzhia briefly lost power after Russian shelling.",
    "Continue reading the main story",
    "Leer en español. (Read in Spanish.)6 min read",
    "Here are the bills Governor DeSantis signed this year as he pushed Florida to the right.5 min read",
    "Black men don’t do therapy. Or so I thought.6 min read",
    "A new show explores the happiest (and unhappiest) countries.4 min read",
    "Gail Collins and Bret StephensThe Republican Presidential Plot Is Thickening6 min read",
    "Will LeitchTrump Is Back, to Tear Our Families Apart Once More5 min read",
    "Ezra KleinLiberals Are Persuading Themselves of a Debt Ceiling Plan That Won’t Work4 min read",
    "Eric ReinhartProviding Birth Control Over the Counter Should Be Just the Beginning5 min read",
    "Elizabeth SpiersHow ‘Succession’ Busts One of America’s Most Cherished Myths5 min read",
    "Michelle Goldberg and Wyatt OrmeRon DeSantis’s Takeover of a Progressive College",
    "David FrenchUkraine Needs Those F-16s5 min read",
    "Tish Harrison WarrenWe Should Be More ‘Amish’ About Technology6 min read",
    "Susan StubsonWhat Christian Nationalism Has Done to My State and My Faith Is a Sin7 min read",
    "Daniela J. LamasNot Every Pandemic Needs Someone to Blame4 min read",
    "Gordon WitkinHere’s What We Can Do Now About Gun Violence6 min read",
    "Letters From Our ReadersWhen Corporations Take Over Health Care5 min read",
    "Maureen DowdClassical Crescendo4 min read",
    "Nicholas KristofHow to Change a Life for 50 Cents4 min read",
    "Brad StulbergFor People to Really Know Us, We Need to Show Up4 min read",
    "Silicon Valley, Cradle of Computer Chips, Gains Big New Research Center3 min read",
    "With His Party Ahead in Elections, Greek Leader Claims ‘Political Earthquake’5 min read",
    "Koepka Wins P.G.A. Championship, Vanquishing Demons and Boosting LIV6 min read",
    "Fire Guts Manila’s Historic Post Office Building2 min read",
    "Grenade Detonation Kills Father and Injures His Two Children2 min read",
    "Uber’s Diversity Chief Put on Leave After Complaints of Insensitivity4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Soccer’s Equivalent to the Harlem Globetrotters",
    "The Yankees Took Care of a Big Roster Problem. Is Another Change Coming?",
    "On Opening Night, Breanna Stewart Gives New York a Taste of the Future",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]