[
    "Continue reading the main story",
    "Russia Says Mercenary Leader to Leave Country to Ease Crisis",
    "“We will not let this happen again”: Vladimir Putin evoked Russia’s civil war of a century ago.",
    "As Vladimir Putin’s partner, Yevgeny Prigozhin was always willing to do the dirty work.5 min read",
    "Decrease in Legal Abortions",
    "Haiyun Jiang for The New York Times",
    "Bill Sikes/Associated Press",
    "Did you follow the news this week? Take our quiz.",
    "Critic’s NotebookThe second season of “The Bear” adds a little optimism to the menu.4 min read",
    "WirecutterHere’s every Wirecutter pick in Carmy’s kitchen in “The Bear.”",
    "Nicholas KristofThe Real Lesson From the Hunter Biden Saga4 min read",
    "Maureen DowdSave Turner Classic Movies4 min read",
    "Chris VognarI Thought No One Had Felt Grief Like Mine. Then I Saw ‘The Bear.’5 min read",
    "Ross DouthatGo Ahead. Debate Robert F. Kennedy Jr.4 min read",
    "Jamelle BouieIn a Real Crisis, G.O.P. Candidates Have Little to Offer6 min read",
    "Michelle GoldbergHow ‘Backlash’ Explains America",
    "Mikhail ZygarThe Man Challenging Putin for Power6 min read",
    "Zeynep TufekciHow ‘Breaking Bad’ Explains America",
    "Letters From Our ReadersReligious Controversies on Many Fronts in the U.S.4 min read",
    "Linda GreenhouseIs There Any Twinge of Regret Among the Anti-Abortion Justices?5 min read",
    "Farhad ManjooIt’s Not Possible to ‘Win’ an Argument With Robert F. Kennedy Jr.6 min read",
    "‘The Ezra Klein Show’Why This Economist Wants to Give Every Poor Child $50,000",
    "Peter CoyThe Many Minds Behind Biden’s Biggest Economic Idea7 min read",
    "NewsletterRead On TechSee how you can turn your chatbot into a life coach.4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Steph Chambers/Getty Images",
    "Only One M.L.B. Team Doesn’t Host Pride Night. That’s Unlikely to Change.",
    "What Does Steve Kerr Think of the Warriors Trade for Chris Paul?",
    "Here Are This N.F.L. Offseason’s Biggest Winners and Losers",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]