[
    "Continue reading the main story",
    "Andriy Andriyenko/Associated Press",
    "Here are five takeaways from a rocky 2024 debut for Ron DeSantis.6 min read",
    "Still Processing: We, Tina",
    "See Tina Turner’s life in photos.2 min read",
    "Test A.I.’s Literary Skills",
    "What Are the Dangers of A.I.?",
    "How 35 Real People Use A.I.",
    "A.I. demand lifted Nvidia toward a trillion-dollar valuation.2 min read",
    "Jackie Molloy for The New York Times",
    "Gail CollinsNo Time Like the Present, Senator Feinstein4 min read",
    "Pamela PaulThis 1991 Book Was Stunningly Prescient About Affirmative Action6 min read",
    "Molly WorthenWhat College Students Need Is a Taste of the Monk’s Life10 min read",
    "Charles M. BlowUnprepared Republican Presidential Candidates Are Flooding Into the Race4 min read",
    "Nicholas KristofOn the Front Line of an Education Revolution5 min read",
    "David Wallace-WellsAmerica’s ‘Neoliberal’ Consensus Might Finally Be Dead6 min read",
    "Dan MurphyLike It or Not, America Needs Chinese Scientists4 min read",
    "Frank BruniThe DeSantis Delusion6 min read",
    "Rich LowryHe’s Not Dead Yet6 min read",
    "Kate RedburnAll Americans Have the Right to Dress as They Wish5 min read",
    "Lauren KelleyHow Did the End of Roe Alter Your Choices?2 min read",
    "Peter CoyUnemployment Is Low, but So Is the National Mood4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Michael Reaves/Getty Images",
    "A Grade for Every M.L.B. Team So Far This Season",
    "After Losing His Biggest Fans, an N.F.L. ‘Underdog’ Honors His Vow",
    "A Liverpool Player Signed for $65 Million. He’s Now Set to Leave For Free.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]