[
    "Continue reading the main story",
    "Here are four takeaways from Turkey’s nail-biting presidential election.4 min read",
    "These maps show how every province in Turkey has voted so far.",
    "The Wagner leader disputed a report that he offered to betray Russia.2 min read",
    "“Succession” recap: It’s election night in America. Stay away from the bodega sushi.6 min read",
    "Are you on team tennis, pickleball or padel? Or all three?6 min read",
    "There’s something “spooky” about this newly discovered shark species.2 min read",
    "Gail Collins and Bret StephensTrump Cannot Be Unseen7 min read",
    "Adam GopnikWhat We Lose When We Push Our Kids to ‘Achieve’6 min read",
    "Mitchell Abidor and Miguel LagoHow Marine Le Pen Became France’s Voice of Reason5 min read",
    "Letters From Our ReadersRalph Nader and Others Clash Over the Value of Third Parties5 min read",
    "David FrenchWhen the Rule of Law Fails Us5 min read",
    "Farah StockmanLeaders Stay, Others Run5 min read",
    "Rachel Louise SnyderWhat Do You Say When the Person You Love Most in the World Returns?7 min read",
    "Michael W. McConnellThe Case for Violating the Debt Limit Is Dangerous Nonsense4 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Tish Harrison WarrenManaging Screen Time Is a Family Matter7 min read",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Maureen DowdAs Sun Tzu Says, ‘Know the Enemy’4 min read",
    "Bill SammonWe’re Asking the Wrong Questions About the Trump Town Hall4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The Worst Job in Soccer: ‘It’s 90 Minutes of Hell’",
    "College Football Is in an Arms Race. One Storied Program Is Falling Behind.",
    "Could Premier League Punishments Affect the Title Race?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewDeb Amlen reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]