[
    "Continue reading the main story",
    "Details are trickling out about the accord that could avert a debt default.3 min read",
    "Doug Mills/The New York Times",
    "The Texas attorney general is the first statewide officeholder to be impeached in over a century.",
    "Mike Osborne for The New York Times",
    "Kyiv repelled its “largest ever drone attack” from Russia overnight.4 min read",
    "Here’s what to know about complications after delivery.4 min read",
    "Shuran Huang for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "‘Still: A Michael J. Fox Movie’ Review3 min read",
    "‘You Hurt My Feelings’ Review: She Can’t Handle the Truth4 min read",
    "A Cabin in the Woods, Intermittent Wi-Fi and a Dead Landline3 min read",
    "Book Review: ‘For the Love of Mars’5 min read",
    "These 15 side dishes will steal the show at your next barbecue.7 min read",
    "401(k) administrators are seeing an uptick in hardship withdrawals.6 min read",
    "Ezra KleinWe Blew It With the Internet. Let’s Not Blow It With A.I.9 min read",
    "David FrenchThe Right Is All Wrong About Masculinity6 min read",
    "Michelle CottleThe Chris Christie Scenario4 min read",
    "Kayla M. WilliamsWho Should We Honor on Memorial Day?5 min read",
    "Theresa RebeckThe ‘Succession’ Finale Is Almost Here. Will They Get It Right?4 min read",
    "Chouwa LiangMy A.I. LoverChouwa Liang",
    "Adam GrantWhy Frenemies May Be Hazardous to Your Health5 min read",
    "Maureen DowdDon’t Kill ‘Frankenstein’ With Real Frankensteins at Large4 min read",
    "Ross DouthatHow Twitter Shrank Elon Musk and Ron DeSantis4 min read",
    "Nicholas KristofWhen Your Sexuality Is Against the Law4 min read",
    "Jamelle BouieTrump Must Be Pleased With the Way the Republican Race Is Shaping Up4 min read",
    "Ilan StavansThe Newest Immigrants Will Change American Spanish. That’s a Good Thing.4 min read",
    "Paul RudnickWhat Would Happen if a Robot Tried to Write ‘Law & Order’?3 min read",
    "Bret StephensThe ‘Last Jews’ Board a Plane From Ethiopia to Israel10 min read",
    "Letters From Our ReadersApplying D.E.I. to Science4 min read",
    "Higher Food Prices Bring Bigger Profits, but Consumers Start to Resist",
    "Inflation Inched Higher in April, Reflecting Challenge for the Fed",
    "An 11-Year-Old Boy Called 911. The Police Then Shot Him.2 min read",
    "Modi Opens India’s New Parliament Building as Opposition Boycotts4 min read",
    "‘Anatomy of a Fall’ Wins the Palme d’Or at Cannes3 min read",
    "Monaco Grand Prix Is Set to Begin in Monte Carlo3 min read",
    "Kamala Harris Is First Woman to Address Graduates at West Point Commencement3 min read",
    "Student Cannot Wear Sash of Mexican and U.S. Flags at Graduation, Judge Rules3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "How Umpiring Gave a Second Life to a Baseball-Loving Veteran",
    "The French Open’s Youngest Champion Still Resonates at Roland Garros",
    "The Inside Story of Germany’s Day of Glorious Chaos",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]