[
    "Continue reading the main story",
    "Doug Mills/The New York Times",
    "David Guttenfelder for The New York Times",
    "Conversation With Mary Gordon",
    "Lindsey Wasson/Associated Press",
    "Some doctors are using ChatGPT to improve their bedside manner.7 min read",
    "Take a trip to the English countryside to see a 40-foot wedding cake.6 min read",
    "David BrooksI Won’t Let Donald Trump Invade My Brain4 min read",
    "Nick AkermanDon’t Automatically Write Off the Judge in the Trump Documents Case5 min read",
    "Pamela PaulThis May Not Take as Long as You Think It Will5 min read",
    "Ben TerrisWhy Did Washington Fall So Hard for the Bankman-Fried Brothers?5 min read",
    "Frank BruniThe Brotherhood of the Philandering Oligarchs9 min read",
    "Nicholas KristofI Think Trump Is Going Down, and Yet I Keep Having the Same Nightmare4 min read",
    "Letters From Our ReadersCan Judge Cannon Preside Fairly Over the Trump Trial?5 min read",
    "Charles M. BlowL.G.B.T.Q. Americans Could Become a ‘New Class of Political Refugees’5 min read",
    "Gail CollinsYour Spring-Into-Summer Politics Quiz Is Here",
    "Deborah PearlsteinThe Genius of Leaving Trump’s Fate Up to 12 Ordinary Floridians5 min read",
    "Jessica GroseSoon We Won’t Have Enough Kids to Fill Our Schools. That’s a Problem.6 min read",
    "David Wallace-WellsEven in Texas, You Can’t Stop the Green Revolution5 min read",
    "Peter CoyThe Case for Ending Free Parking5 min read",
    "Thomas B. EdsallIf Democrats Win Back the House, They Will Have John Roberts to Thank11 min read",
    "海外华人札记 | 大学录取不再看族裔，教育就能更公平吗Read our Chinese-language Newsletter.1 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Oakland Is Losing the A’s, Thanks to Rob Manfred, Our Columnist Writes",
    "Nikola Jokic Is a Worthy Heir to the Tim Duncan Throne",
    "Lionel Messi’s Penthouse Floor Is Ready, but Is Miami Ready for Him?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]