[
    "Continue reading the main story",
    "Trump Pleads Not Guilty in Classified Documents Case",
    "Saul Martinez for The New York Times",
    "Read our annotated version of the indictment.",
    "A circuslike atmosphere outside the courthouse has drawn activists who want to be seen and heard.",
    "Classified documents in a Mar-a-Lago bathroom? Republicans see nothing wrong with that.",
    "Walt Nauta, Donald Trump’s personal aide and co-defendant, is in court with him.",
    "Donald Trump is facing several investigations. See where they stand.9 min read",
    "The C.I.A. told Ukraine last summer that it should not attack the Nord Stream pipelines.2 min read",
    "Jamelle BouieRepublicans Have Made Their Choice4 min read",
    "Mattia FerraresiFarewell to the Man Who Gave Us Trump4 min read",
    "Julia AngwinOne of the Last Bastions of Digital Privacy Is Under Threat5 min read",
    "‘The Ezra Klein Show’What We Learned Reading Ron DeSantis’s Books",
    "‘He Has Nothing Else’: Our Writers on Trump and the 2024 Election8 min read",
    "Letters From Our ReadersSaving the Flailing Humanities5 min read",
    "Gail Collins and Bret StephensSpeaking of Forest Fires, Let’s Talk About Trump6 min read",
    "Erwin ChemerinskyTime Is Running Out for John Roberts and the Supreme Court4 min read",
    "David FirestoneRon DeSantis Finds a New Set of Laws to Ignore6 min read",
    "Peter CoyThe Woman in Charge of Saving Turkey’s Economy5 min read",
    "Margaret RenklTo Enter This Place Alone Is to Take a Risk5 min read",
    "Robert B. Semple Jr.America Has a Chance to Make Farmers Climate Heroes5 min read",
    "Anjanette DelgadoWhat the Women of the World’s Oldest Colony Know About Violence5 min read",
    "NEWSLETTERRead Climate ForwardWhat America’s love of cars means for the climate.5 min read",
    "Alastair Grant/Associated Press",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Andrew Redington/Getty Images",
    "An N.H.L. Team Is Selling for Close to $1 Billion. Who Is the New Owner?",
    "Nikola Jokic Ushers the N.B.A. Into a New Era and Spurs an Evolution",
    "With Messi on His Way, It Could Be Time for M.L.S. Roster Rules to Change",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]