[
    "What is NATO, and how has the war in Ukraine changed it?5 min read",
    "The Headlines\nAudio\nToday’s top news: Extreme weather sweeps the U.S., and more.\n11 min listen",
    "Staying Cool in a Heat Wave",
    "WirecutterNot every Prime Day deal is great. But our experts found these gems.",
    "The illustrator David Sibley says drawing birds has shaped his entire way of seeing.2 min read",
    "Grey Anderson and Thomas MeaneyNATO Isn’t Really About Defense, and It Never Was5 min read",
    "Paul KrugmanNo, ‘Socialism’ Isn’t Making Americans Lazy4 min read",
    "Gail Collins and Bret StephensRon DeSantis Doesn’t Know Whether He’s Coming or Going7 min read",
    "Total RefusalAll Work, No Play for These Video Game CharactersTotal Refusal",
    "‘The Ezra Klein Show’A.I. Could Solve Some of Humanity’s Hardest Problems. It Already Has.",
    "Samuel WoolleyThe World’s Strongmen Continue to Bend Social Media to Their Will5 min read",
    "Farhad ManjooDon’t Debate Conspiracy Theorists. Trust Me, I Tried.",
    "Peter CoyThe ‘Representative Agent’ Is Always Rational. The Rest of Us Are Not.6 min read",
    "Paul HockenosLet Them Swim4 min read",
    "Margaret RenklThe Turtle Who Came Back From the Dead5 min read",
    "Letters From Our ReadersThe ‘Ethic of Life’ in the Political Arena5 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]