[
    "Continue reading the main story",
    "Kenny Holston/The New York Times",
    "Here’s what to know about the vote to impeach the Texas attorney general, Ken Paxton.5 min read",
    "Mike Osbourne for The New York Times",
    "“Succession” series finale recap: Who won? Who lost?3 min read",
    "Here’s how to make the juiciest, most succulent grilled chicken.2 min read",
    "Ezra KleinBeyond ‘The Matrix’ Theory of the Mind9 min read",
    "David FrenchThe Right Is All Wrong About Masculinity6 min read",
    "Michelle CottleThe Chris Christie Scenario4 min read",
    "Kayla M. WilliamsWho Should We Honor on Memorial Day?5 min read",
    "Theresa RebeckHow the Final Five Minutes of ‘Succession’ Could Change Everything4 min read",
    "Adam GrantYour Most Ambivalent Relationships Are the Most Toxic5 min read",
    "Jassi Pannu and Jacob SwettWhat if There Was Never a Pandemic Again?4 min read",
    "Ross DouthatHow Twitter Shrank Elon Musk and Ron DeSantis4 min read",
    "Maureen DowdDon’t Kill ‘Frankenstein’ With Real Frankensteins at Large4 min read",
    "Nicholas KristofWhen Your Sexuality Is Against the Law4 min read",
    "Jamelle BouieTrump Must Be Pleased With the Way the Republican Race Is Shaping Up4 min read",
    "Ilan StavansThe Newest Immigrants Will Change American Spanish. That’s a Good Thing.4 min read",
    "Paul RudnickWhat Would Happen if a Robot Tried to Write ‘Law & Order’?3 min read",
    "How I Hold It Together: Quiet FaceTimes and More",
    "How I Hold It Together: Cher’s Advice and More",
    "Illustration by Lincoln Agnew",
    "Typhoon Mawar Moves Closer to the Philippines2 min read",
    "George Maharis, TV Heartthrob of ‘Route 66,’ Is Dead at 944 min read",
    "After Death of Girl, 6, Mother Faces Charges Over Surviving Children3 min read",
    "Josef Newgarden Wins Indianapolis 5004 min read",
    "2 Are Dead in Suspected Meningitis Outbreak Linked to Surgeries in Mexico3 min read",
    "Everton Saved Its Premier League Status. But for How Long?4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The French Open’s Youngest Champion Still Resonates at Roland Garros",
    "How a Retired Coach Came Back to Lead the N.H.L.’s Most Surprising Team",
    "The Inside Story of Germany’s Day of Glorious Chaos",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]