[
    "Around Europe, far-right parties are rising to power. Could Spain be next?7 min read",
    "Piroschka Van De Wouw/Reuters",
    "A Visit Amid Deep Divisions",
    "A major lender abroad, China is facing a debt crisis at home. Here’s why.5 min read",
    "On the war’s 500th day, a Russian strike killed at least seven people in Ukraine.6 min read",
    "Highlights From the Ruling",
    "How Admissions Could Change",
    "We answered reader questions about how to pay for college.8 min read",
    "Kayana Szymczak for The New York Times",
    "Gabriella Angotti-Jones for The New York Times",
    "Foods to Keep You Hydrated",
    "The heat in the U.S. is likely to get worse next week.1 min read",
    "Saul Martinez for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "The EthicistA reader asks: Can I use ChatGPT for the tedious parts of my job?6 min read",
    "This “alien” beetle is missing wings, and is posing an evolutionary mystery.3 min read",
    "Kate ShawThe Supreme Court’s Disorienting Elevation of Religion6 min read",
    "Maureen DowdIt’s Seven Grandkids, Mr. President4 min read",
    "Jeff GoodellIn Texas, Dead Fish and Red-Faced Desperation Are Signs of Things to Come5 min read",
    "Jamelle BouieThe John Roberts Two-Step5 min read",
    "David MackGot a Flight? Don’t Even Think About Checking a Bag.4 min read",
    "Paul KrugmanDe-Dollarization Debunked4 min read",
    "Frank LehmanHave We Been Listening to Movies the Wrong Way?",
    "Letters From Our ReadersCan the Republican Party Reverse Course?4 min read",
    "Peter CoyThe Avoidable Mistake of a UPS Strike6 min read",
    "College Admissions Will Not Be the Same. Here’s What 7 Experts Think Should Happen.",
    "‘The Ezra Klein Show’The I.R.A. Passed a Year Ago. Here’s a Progress Check.",
    "Shamus KhanLegacy Admissions Don’t Work the Way You Think They Do4 min read",
    "Bayan AbubakrSudanese People Want Democracy. The World Has Never Listened.5 min read",
    "How Would You Score America’s Progress on Race? We Asked 10 Black Americans.",
    "Gabe Stone ShayerThe American Ballet Theater Does Not See Me as I See Myself5 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]