[
    "Continue reading the main story",
    "Haiyun Jiang/The New York Times",
    "Ukrainian soldiers have begun training on U.S. Abrams tanks, the Pentagon said.2 min read",
    "Turkey is holding a presidential runoff election on Sunday. Here’s what to know.5 min read",
    "Did you follow the news this week? Take our quiz.",
    "‘Sanctuary’ Review: Who’s the Boss?2 min read",
    "‘Master Gardener’ Review: Paul Schrader’s Solitary Man4 min read",
    "The ‘Doughnut Dollies’ of World War II5 min read",
    "Book Review: A Look at the Supreme Court’s ‘Shadow Docket’5 min read",
    "Here’s how to set up a movie theater in your backyard.",
    "Try these crowd-pleasing recipes for Memorial Day weekend.",
    "Bret StephensThe ‘Last Jews’ Board a Plane From Ethiopia to Israel10 min read",
    "Theresa RebeckWhy TV Finales Matter (And Why They Are So Hard to Get Right)4 min read",
    "Dan MurphyClosing the Door on Chinese Academics Weakens America4 min read",
    "Jamelle BouieThe Real Threat to Freedom Is Coming From the States6 min read",
    "‘The Ezra Klein Show’If You’re Reading This, You’re Probably ‘WEIRD’",
    "Dara LindThe U.S. Keeps Telling People to Come the ‘Right Way.’ They’re Listening.5 min read",
    "Ross DouthatMy Fantasy Bookshelf5 min read",
    "Letters From Our ReadersRon DeSantis’s Entry Into the Republican Race5 min read",
    "Michelle GoldbergRon DeSantis vs. the ‘Woke Mind Virus’4 min read",
    "Paul KrugmanDebt: The Bad, the Weak and the Ugly4 min read",
    "The Editorial BoardWho Can Rein In the Supreme Court?6 min read",
    "Boyan SlatReducing Plastic Pollution in Our Oceans Is Simpler Than You Think5 min read",
    "Molly WorthenWhy Universities Should Be More Like Monasteries10 min read",
    "DeSantis Steps Up Attacks on Trump, Hitting Him on Crime and Covid4 min read",
    "Judge Puts South Carolina Abortion Ban on Hold2 min read",
    "Kenneth Anger, 96, Dies; Experimental Filmmaker Left a Pop Culture Legacy6 min read",
    "Hearings in Sept. 11 Case Could Resume Despite Unresolved Issues3 min read",
    "Mary Turner Pattiz, Rock D.J. During FM’s Heyday, Dies at 765 min read",
    "Berlin Police Investigate Roger Waters After He Wore Nazi-Style Costumes4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The Unlikely Speech That Helped Save the Celtics’ Season",
    "The A’s Move to Las Vegas Could Be Finalized Soon. A Serious Pause Is in Order.",
    "Star Women’s Golfer Is Turning Pro After Breaking Tiger Woods’ School Record",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]