[
    "Continue reading the main story",
    "NATO nations started their biggest air force drills since the end of the Cold War.3 min read",
    "Where Documents Were Found",
    "Other Trump Investigations",
    "Here’s what to expect from former President Trump’s court appearance on Tuesday.3 min read",
    "Listen to the full episode.",
    "Are you exposed to too much noise? Here’s how to check.3 min read",
    "Noah Throop/The New York Times",
    "These were the best and worst moments of the Tonys.6 min read",
    "Many pivots that helped businesses survive the pandemic have endured.5 min read",
    "Perimenopause can cause menstrual cycles to get completely out of whack.4 min read",
    "Gail Collins and Bret StephensSpeaking of Forest Fires, Let’s Talk About Trump6 min read",
    "‘He Has Nothing Else’: Our Writers on Trump and the 2024 Election8 min read",
    "David FirestoneRon DeSantis Finds a New Set of Laws to Ignore6 min read",
    "Erwin ChemerinskyTime Is Running Out for John Roberts and the Supreme Court4 min read",
    "Robert B. Semple Jr.America Has a Chance to Make Farming More Climate Friendly5 min read",
    "Margaret RenklTo Enter This Place Alone Is to Take a Risk5 min read",
    "Ezra KleinDeSantis Thinks Trump Didn’t Go Far Enough5 min read",
    "Anjanette DelgadoWhat the Women of the World’s Oldest Colony Know About Violence5 min read",
    "The Editorial BoardTrump Should Never Again Be Trusted With the Nation’s Secrets5 min read",
    "Maureen DowdBathroom Reading at Mar-a-Lago4 min read",
    "Tanya GoldHarry Is a More Interesting Prince Than We Deserved3 min read",
    "Oona A. HathawayThe Company Trump Keeps in Violation of the Espionage Act7 min read",
    "Serge SchmemannWhy Doesn’t Anyone Seem to Care About the Discord Leaks?5 min read",
    "Jill ApplegateTheir Pot Convictions Were Erased, but They Still Face Deportation4 min read",
    "Letters From Our ReadersCloisters U.: The Sounds of Silence in a College Class5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Yasser Bakhsh/Getty Images",
    "How Manchester City Partied After Achieving Soccer Immortality",
    "Conor McGregor Sends Miami’s Mascot to the E.R. During the N.B.A. Finals",
    "Oakland A’s Fans to Take Last Stand Against Relocation With Reverse Boycott",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]