[
    "Continue reading the main story",
    "Trump Faces Multiple Felonies in New Indictment",
    "Sophie Park for The New York Times",
    "These are some of the charges former President Trump faces.3 min read",
    "Donald Trump’s Republican rivals are feeling the pressure to defend him.4 min read",
    "In moving the Trump case to Miami, the prosecutor is avoiding a possible legal fight.2 min read",
    "Republicans in Congress are denouncing the indictment, vowing retaliation.",
    "Here’s how indictments work in the United States’ legal system.2 min read",
    "The Headlines\nAudio\nToday’s top news: Donald Trump is indicted, and more.\n8 min listen",
    "What’s the Air Quality Index?",
    "Did New York’s leaders leave residents unprepared for the air-quality crisis?5 min read",
    "See Our Maps of Air Quality and Smoke ›",
    "Listen to the full episode.",
    "Tyler Hicks/The New York Times",
    "The Supreme Court ruling on voting rights could resound across the South.4 min read",
    "Patrick Semansky/Associated Press",
    "Damon LinkerTrump’s New Indictment Puts Us Into Uncharted Waters5 min read",
    "Richard L. HasenJohn Roberts Throws a Curveball6 min read",
    "David BrooksThis Is Not the Time for a Third Presidential Candidate4 min read",
    "Mara GayOn the Smoke Crisis, New York City’s Mayor Chokes4 min read",
    "Micaela DiamondWhat Starring in ‘Parade’ Taught Me About Hate and Hope6 min read",
    "‘The Ezra Klein Show’What Communes and Other Radical Experiments in Living Together Reveal",
    "Michelle GoldbergI Loved Watching Chris Christie Tear Into Trump. That’s a Problem.6 min read",
    "Paul KrugmanOrange Skies, Red Alerts and the Future4 min read",
    "Daron Acemoglu and Simon JohnsonBig Tech Is Bad. Big A.I. Will Be Worse.5 min read",
    "Frank BruniCasey DeSantis Is Your Obsession. Jill Biden Is Mine.9 min read",
    "David FrenchOklahoma Breaches the Wall Between Church and State5 min read",
    "The Editorial BoardNew York Lawmakers Try to Sabotage Campaign Reform4 min read",
    "Letters From Our ReadersEerie Days: Smoke and Haze, All Around5 min read",
    "The Danish butter cookie tin may be an apt metaphor for the immigrant experience.4 min read",
    "‘Transformers: Rise of the Beasts’ Review: Here Come the Grease Monkeys",
    "‘Flamin’ Hot’ Review: Neon Dust, Hollywood Corn",
    "海外华人札记 | 武汉跳楼母亲悲剧：网暴之恶背后的匿名狂欢Read our Chinese-language Newsletter.1 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Inside the PGA Players’ Fiery Response to the LIV Golf Merger",
    "A Broadcaster Opened Up About Eating Disorders on Air. The Clip Went Viral.",
    "A Pitcher’s Tweets Create a Pride Month Problem for the Red Sox",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]