[
    "Continue reading the main story",
    "Russia-Ukraine WarJune 28, 2023, 1:10 p.m. ET",
    "Wildfire SmokeJune 28, 2023, 1:01 p.m. ET",
    "Ukraine’s counteroffensive is facing an enemy nearly as daunting as the Russians: the terrain.",
    "What’s the Air Quality Index?",
    "See Our Maps of Air Quality and Smoke ›",
    "Here’s what to know about the Canadian wildfires and air quality in the U.S.3 min read",
    "What Are the Dangers of A.I.?",
    "The Biden administration is weighing additional curbs on sales of A.I. chips to China.4 min read",
    "My best friends are taking Ozempic. Can I share my disapproval?6 min read",
    "Here are some simple, satisfying three-ingredient barbecue sauce recipes.3 min read",
    "Thomas B. EdsallThis Is Why Trump Lies Like There’s No Tomorrow11 min read",
    "Thomas L. FriedmanWhat Happens to Putin Now?6 min read",
    "Ross DouthatHow Do You Replace an Elite?7 min read",
    "Bret StephensPutin Forgot the First Rule of the Big Lie4 min read",
    "Naomi OreskesThe Myth That May Have Doomed the Titan4 min read",
    "Jessica GroseWhat Churches Offer That ‘Nones’ Still Long For6 min read",
    "Romaissaa BenzizouneA Tiny, Wonderful Rebellion Against the Tyranny of Time Has Begun4 min read",
    "David FirestoneWho Do Republicans Think Committed a Crime?6 min read",
    "David FrenchThe Supreme Court Just Helped Save American Democracy From Trumpism4 min read",
    "Andrei KolesnikovYesterday’s Putin Is Gone4 min read",
    "Tressie McMillan CottomWhat It Is Like to Teach in the Cross Hairs of Ron DeSantis7 min read",
    "Rochelle P. WalenskyWhat I Need to Tell America Before I Leave the C.D.C.5 min read",
    "Jamelle BouieSamuel Alito Joins the Supreme Court’s Billionaires’ Club5 min read",
    "Salvatore MercoglianoThe Story of the Titan Submersible Has Not Ended5 min read",
    "Listen to the full episode.",
    "Alexandra Hootnick for The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Tom Pennington/Getty Images",
    "Former N.F.L. Quarterback Dies After Drowning in Florida",
    "Manchester United ‘Unprepared’ in Goalkeeper Contract Standoff",
    "Why Oklahoma’s Softball Superstar Left the Glory Behind",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]