[
    "Continue reading the main story",
    "Turkey’s leader showed little sign of supporting Sweden’s NATO membership bid.",
    "Brian Kaiser for The New York Times",
    "Doug Mills/The New York Times",
    "A grim Donald Trump, president no longer, was humbled in the courtroom.4 min read",
    "Here are the likely next steps in the documents case.4 min read",
    "Christiana Botic for The New York Times",
    "A guide to Cormac McCarthy’s books: These seven novels are the best of his work.4 min read",
    "Gilles Peress/Magnum Photos",
    "Ariana Drehsler for The New York Times",
    "Thomas L. FriedmanHow Trump Keeps Getting Away With It5 min read",
    "Jesse WegmanThe Impossible Task of Defending Donald Trump6 min read",
    "Ross DouthatEvery Trump Indictment Tells a Story4 min read",
    "Michelle CottlePresident Don Jr.?5 min read",
    "Bret StephensLock Him Up4 min read",
    "Deborah PearlsteinThe Genius of Leaving Trump’s Fate Up to 12 Ordinary Floridians5 min read",
    "Thomas B. EdsallIf Democrats Win Back the House, They Will Have John Roberts to Thank11 min read",
    "Jessica GroseSoon We Won’t Have Enough Kids to Fill Our Schools. That’s a Problem.6 min read",
    "David French‘Shiny Happy People,’ Fundamentalism and the Toxic Quest for Certainty6 min read",
    "Jamelle BouieRepublicans Have Made Their Choice4 min read",
    "Michelle CottleJust When You Thought There Was Nothing New to Learn About Donald Trump",
    "Letters From Our ReadersSaving the Flailing Humanities5 min read",
    "‘The Ezra Klein Show’What We Learned Reading Ron DeSantis’s Books",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Could Saquon Barkley, the Giants’ Running Back, Sit Out the Season?",
    "Can Denver Win Another N.B.A. Title? It Depends What Happens in the West.",
    "Rory McIlroy Was the Face of the PGA Tour’s ‘War’ on LIV. Now What?",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]