[
    "Northeast FloodingJuly 11, 2023, 5:10 p.m. ET",
    "Russia-Ukraine WarJuly 11, 2023, 5:05 p.m. ET",
    "Staying Cool in a Heat Wave",
    "See where the rainfall was the heaviest.",
    "What if Trump Is Convicted?",
    "Where Documents Were Found",
    "DeSantis Boasts $20 Million Haul, but Full Picture of Money Race Is Still Hazy",
    "Nikki Haley Raises $7.3 Million, With More in an Allied Super PAC",
    "Graphs, maps and data analyses? Now ChatGPT can do even more.2 min read",
    "Dario Amodei, chief executive of Anthropic. Massimo Berruti for The New York Times",
    "WirecutterNot every Prime Day deal is great. But our experts found these gems.",
    "Does sugar actually feed cancer?4 min read",
    "Kathy HochulThe Supreme Court Case That Has Me Worried, for Survivors and for My State4 min read",
    "Samuel WoolleySome of the Worst Troll Armies Are Gaining Ground. Just Look at Cambodia.5 min read",
    "Paul KrugmanDude, Where’s My Recession?4 min read",
    "Jane CoastonThe Republican Governor of Utah Wants to Spare Kids From Their Phones12 min read",
    "Total RefusalThese Video Game Characters Are Programmed to Do One Thing Forever: Work",
    "Grey Anderson and Thomas MeaneyNATO Isn’t Really About Defense, and It Never Was5 min read",
    "‘The Ezra Klein Show’A.I. Could Solve Some of Humanity’s Hardest Problems. It Already Has.",
    "Letters From Our ReadersWeighing the Morality of Giving Ukraine Cluster Munitions4 min read",
    "John McWhorterWhat Justice Ketanji Brown Jackson Meant When She Said ‘Blink’5 min read",
    "Farhad ManjooWhy I Regret Debating Robert F. Kennedy Jr.",
    "Gail CollinsRon DeSantis Doesn’t Know Whether He’s Coming or Going7 min read",
    "Peter CoyThe ‘Representative Agent’ Is Always Rational. The Rest of Us Are Not.6 min read",
    "Paul HockenosLet Them Swim4 min read",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]