[
    "Here’s what to know about Sunday’s vote in Turkey.5 min read",
    "Turkey’s president amassed power. He could still lose the election.6 min read",
    "Continue reading the main story",
    "Migrants’ Pathways Into the U.S.",
    "Did you follow the news this week? Take our quiz.",
    "‘The Mother’ Review: Are You My Sniper?2 min read",
    "The 50 Best Titles to Stream on Disney+20 min read",
    "The Capitalist Generation’s Space Race4 min read",
    "Emma Cline’s Latest Heroine Is a Call Girl on the Run4 min read",
    "This daughter persuaded the U.S. government to cancel her mother’s debt.6 min read",
    "David FrenchWhen the Rule of Law Fails Us5 min read",
    "Rachel Louise SnyderWhat Do You Say When the Person You Love Most in the World Returns?7 min read",
    "Michael W. McConnellThe Case for Violating the Debt Limit Is Dangerous Nonsense4 min read",
    "Maureen DowdAs Sun Tzu Says, ‘Know the Enemy.’4 min read",
    "Bill SammonWe’re Asking the Wrong Questions About the Trump Town Hall4 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Speeding Up the Update of Our Electrical Grid5 min read",
    "Tish Harrison WarrenManaging Screen Time Is a Family Matter7 min read",
    "Nicholas KristofWhen One Almond Gulps 3.2 Gallons of Water4 min read",
    "Ross DouthatTrump’s Lesson for the Media and Ron DeSantis4 min read",
    "David MackSoft Pants: The Post-Pandemic Benefit That’s Here to Stay5 min read",
    "Daniela J. LamasI Know the Pressure of Being a Doctor. Motherhood Is Something Else.5 min read",
    "Paul KrugmanAttack of the Pharma Phantoms4 min read",
    "Jamelle BouieJohn Frankenheimer Pointed His Camera Toward the Things We Cannot Escape6 min read",
    "Jessica GroseDooce and Other ‘Mommy Blogs’ Deserve Credit for Shaping the Internet3 min read",
    "Thailand’s Election: What to Watch and What’s at Stake4 min read",
    "Bill Oesterle, Co-Founder of Angie’s List, Dies at 574 min read",
    "Sweden Wins a Eurovision Song Contest That Showed Solidarity With Ukraine3 min read",
    "North Carolina Governor Vetoes Abortion Ban but Faces Override2 min read",
    "Biden Warns of ‘Sinister Forces’ Trying to Reverse Racial Progress4 min read",
    "In Pacific Northwest, a ‘Heat Dome’ Is Expected to Drive Up Temperatures2 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "After Warriors’ Elimination, Where Does the Dynasty Stand?",
    "LeBron James’s Game 6 Performance Sends a Clear Message",
    "Years After a Stroke, She’s Spending Mother’s Day Cheering Her M.L.B. Son",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewDeb Amlen reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]