[
    "Continue reading the main story",
    "Kenny Holston/The New York Times",
    "A Russian border town is facing the frontline reality of the Kremlin’s war against Ukraine.",
    "At least 20,000 Russian troops died fighting to take Bakhmut, a Western official said.",
    "Mayor Francis Suarez of Miami, a Republican, took office in 2017.  Alex Brandon/Associated Press",
    "Even the gentlest gardeners often disrupt natural habitats. Here’s how to avoid that.6 min read",
    "Carlos LozadaMen Have Lost Their Way. Josh Hawley Has Thoughts About How to Save Them.8 min read",
    "Pamela PaulPolitical Correctness Used to Be Funny. Now It’s No Joke.5 min read",
    "Ron CurrieI Saw What Happened to My Father, So I’m Striking With My Fellow Writers5 min read",
    "John McWhorterForget Nouns. Verbs Are Where the Action Is.7 min read",
    "Andrew SchwartzCalifornia’s Snow Is Melting, and It’s a Beautiful Thing4 min read",
    "David Wallace-WellsThe Ocean Is Looking More Menacing6 min read",
    "Jean W. PapeHaiti Has Overcome Other Crises. This Time, We Can’t Do It Alone.4 min read",
    "Letters From Our ReadersAre the Warnings About A.I. Overblown?4 min read",
    "Jonathan MingleJoe Manchin Wanted a 303-Mile-Long Pipeline, and He’s About to Get One5 min read",
    "Nicholas KristofMississippi Is Offering Lessons for America on Education10 min read",
    "Frank BruniDemocrats Want Trump? They’re Out of Their Minds9 min read",
    "Jessica GroseThe Duggar Family and Reality TV’s Exploitation of Kids6 min read",
    "Ezra KleinWe May Be About to Find Out How This Republican Party Really Works6 min read",
    "Thomas B. EdsallThe Politics of Delusion Have Taken Hold12 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Daniel Knighton/Getty Images",
    "Mike Pence Calls on M.L.B. to Apologize to ‘Catholics Across America’",
    "NASCAR Hands Down Harsh Penalties After Counterfeit Part Is Found on Car",
    "Aaron Rodgers Details What Led to His Divorce With the Packers",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]