[
    "Here’s what to know about Sunday’s vote in Turkey.5 min read",
    "Turkey’s president amassed power. He could still lose the election.6 min read",
    "Continue reading the main story",
    "Here’s why Florida’s governor, Ron DeSantis, is limping to the starting line.9 min read",
    "Migrants’ Pathways Into the U.S.",
    "Did you follow the news this week? Take our quiz.",
    "‘The Mother’ Review: Are You My Sniper?2 min read",
    "The 50 Best Titles to Stream on Disney+20 min read",
    "The Capitalist Generation’s Space Race4 min read",
    "Emma Cline’s Latest Heroine Is a Call Girl on the Run4 min read",
    "Here’s what some American women say about having kids later in life.",
    "A mother finds herself spiritually out of stock at a cosmetics shop.4 min read",
    "David FrenchHow the Law Applies to Jordan Neely and Daniel Penny5 min read",
    "Rachel Louise SnyderWhat Do You Say When the Person You Love Most in the World Returns?7 min read",
    "Michael W. McConnellThe Case for Violating the Debt Limit Is Dangerous Nonsense4 min read",
    "Maureen DowdAs Sun Tzu Says, ‘Know the Enemy.’4 min read",
    "Bill SammonWe’re Asking the Wrong Questions About the Trump Town Hall4 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Ross DouthatTrump’s Lesson for the Media and Ron DeSantis4 min read",
    "Nicholas KristofWhen One Almond Gulps 3.2 Gallons of Water4 min read",
    "David MackSoft Pants: The Post-Pandemic Benefit That’s Here to Stay5 min read",
    "Daniela J. LamasI Know the Pressure of Being a Doctor. Motherhood Is Something Else.5 min read",
    "Paul KrugmanAttack of the Pharma Phantoms4 min read",
    "Jamelle BouieJohn Frankenheimer Pointed His Camera Toward the Things We Cannot Escape6 min read",
    "Jessica GroseDooce and Other ‘Mommy Blogs’ Deserve Credit for Shaping the Internet3 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "David NasawElon Musk Makes Sense. Yes, Really.6 min read",
    "Peter CoyThe Struggle to Explain the ‘Gender Well-Being Gap’4 min read",
    "How an Allergist Gets Through Allergy Season",
    "How a Relationship Coach Resolves Conflict",
    "Israel and Islamic Jihad Agree to Cease-Fire After 5 days of Violence5 min read",
    "Kemal Dervis, Who Eased Turkey’s Economic Crisis, Dies at 743 min read",
    "North Carolina Governor Vetoes Abortion Ban but Faces Override2 min read",
    "Biden Warns of ‘Sinister Forces’ Trying to Reverse Racial Progress4 min read",
    "In Pacific Northwest, a ‘Heat Dome’ Is Expected to Drive Up Temperatures2 min read",
    "Slava Zaitsev, Enduring Soviet-Era Fashion Designer, Dies at 855 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Why There Will Never Be Another Soccer Player Like Sergio Busquets",
    "LeBron James’ Game 6 Performance Sends a Clear Message",
    "The N.F.L. Teams With the Toughest, and Easiest, Schedules This Season",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewDeb Amlen reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]