[
    "Continue reading the main story",
    "Migrants’ Pathways Into the U.S.",
    "Mayor Adams Addresses Killing",
    "Did you follow the news this week? Take our quiz.",
    "Citronella candles don’t really work. Stop buying them.",
    "Gardening experts share tips on how to compost.6 min read",
    "Maureen DowdAs Sun Tzu Says, ‘Know the Enemy.’4 min read",
    "Ross DouthatTrump’s Lesson for the Media and Ron DeSantis4 min read",
    "Nicholas KristofWhen One Almond Gulps 3.2 Gallons of Water4 min read",
    "Daniela J. LamasI Know the Pressure of Being a Doctor. Motherhood Is Something Else.5 min read",
    "David MackSoft Pants: The Post-Pandemic Benefit That’s Here to Stay5 min read",
    "Paul KrugmanAttack of the Pharma Phantoms4 min read",
    "David NasawElon Musk Makes Sense. Yes, Really.6 min read",
    "Peter CoyThe Struggle to Explain the ‘Gender Well-Being Gap’4 min read",
    "Jessica GroseDooce and Other ‘Mommy Blogs’ Deserve Credit for Shaping the Internet3 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Letters From Our ReadersSATs and Measuring Merit in College Admissions5 min read",
    "Zeynep TufekciThe Shockingly Lax Laboratory Standards in the U.S.8 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "Michael E. WebberWill Texas Blow Up Its Energy Miracle to Bolster Fossil Fuels?5 min read",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Read The MorningJason M. Bailey on the cultural impact of the Legend of Zelda franchise.7 min read",
    "Violence Between Israel and Islamic Jihad Outlasts Their Previous Clashes4 min read",
    "A Defeat for Modi’s Party in South India Heartens His Rivals3 min read",
    "Native American Chief Standing Bear Is Honored on Postal Stamp3 min read",
    "CUNY Law School Graduates Turn Their Backs to Mayor Adams3 min read",
    "Cyclone Mocha Moves Toward Myanmar and Bangladesh, Bringing Flood Threats4 min read",
    "Lawyer Who Fled to Cuba After Shooting Girlfriend Is Convicted of Murder3 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "LeBron James’ Game 6 Performance Sends a Clear Message",
    "A Controversial No-Goal Call Will Haunt the Toronto Maple Leafs",
    "The N.F.L. Teams With the Toughest, and Easiest, Schedules This Season",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]