[
    "Continue reading the main story",
    "See the sequence of events as three trains collided in one of India’s deadliest rail accidents.",
    "Nanna Heitmann for The New York Times",
    "Bipartisan collaboration was once a point of pride in Oregon. No longer.6 min read",
    "Emily Elconin for The New York Times",
    "We asked readers to share the contents of their Notes apps. They did not disappoint.4 min read",
    "WirecutterTrying to kill ants the wrong way can make things worse. Here’s the best option.",
    "David FrenchHere’s How We Can End the War in Ukraine1 min read",
    "Michelle CottleTrump Wants to Party Like It’s 17764 min read",
    "Bill SaporitoCould Air Travel Get Even More Miserable? Yes, and Here’s Why.5 min read",
    "Maia SzalavitzWhat Ozempic Reveals About Desire6 min read",
    "Benyamin CohenEinstein and a Theory of Disinformation5 min read",
    "The Editorial BoardStates Are Silencing the Will of Millions of Voters7 min read",
    "Maureen DowdJackie Kennedy on My Mind4 min read",
    "Mara GayThere are Better Ways to Solve a Housing Crisis Than This5 min read",
    "Letters From Our ReadersCollege Grads, Do ‘Follow Your Passions’5 min read",
    "Nicholas KristofThis May Be the Most Important Thing Happening in the World Today4 min read",
    "Ross DouthatKevin McCarthy Has a Rare Quality for a Republican House Speaker4 min read",
    "Lauren KelleyHow Did the End of Roe Alter Your Choices?2 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "Sarah WildmanWhat It Means to Be a Witness Three Generations Later5 min read",
    "Citing Doubt, Officials Free Woman Convicted in 4 Children’s Deaths in 20033 min read",
    "Roger Craig, Teacher of an Era-Defining Pitch, Is Dead at 935 min read",
    "Allstate Is No Longer Offering New Policies in California2 min read",
    "Man Missing in Iowa Building Collapse Is Found Dead2 min read",
    "Immense Crowds Protest Poland’s Governing Conservative Party3 min read",
    "Jacinda Ardern, New Zealand’s Ex-Leader, Is Now Dame Jacinda Ardern2 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Justin Tafoya/NCAA Photos, via Getty Images",
    "An M.L.B. Game Ends After an Umpire Is Hit in the Face",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "Aaron Judge Crashes Through a Wall in a Display of Transcendent Stardom",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]