[
    "Continue reading the main story",
    "Here’s what the end of a pandemic-era order will mean for the southern border.4 min read",
    "In a shift, the Texas House advanced a bill to raise the age to buy assault weapons.6 min read",
    "What Is the Adult Survivors Act?",
    "A father-son duo in Alabama won a Pulitzer, bucking headwinds in local news.3 min read",
    "See a list of the 2023 Pulitzer Prize winners and finalists.5 min read",
    "Astronomers have gained a new understanding of the chaos that wreathes a bright star.3 min read",
    "King Charles’s photographer had just minutes to take the official portraits.3 min read",
    "Robert HockettHow Biden Can Call the G.O.P.’s Bluff on Debt and Protect the Economy6 min read",
    "Michelle GoldbergTimothy McVeigh’s Dreams Are Coming True4 min read",
    "Paul KrugmanThe Cowardice of the Deficit Scolds4 min read",
    "Anna-Lisa CohenI’m Going to Spoil Your Favorite TV Show5 min read",
    "Peter CoyHere’s How Wall Street Is Preparing for a U.S. Debt Default5 min read",
    "Brett ChristophersThe Unfortunate, Unintended Consequence of the Inflation Reduction Act5 min read",
    "Margaret RenklIt’s Been Six Weeks, and We Are Fighting Here in Nashville5 min read",
    "Peter BeinartImagine if Another Bernie Sanders Challenges Joe Biden5 min read",
    "Letters From Our ReadersWhen Mass Shootings Become Almost Daily Events5 min read",
    "Pamela PaulOn ‘Succession,’ Marriage Reveals Its Sting4 min read",
    "David FrenchTucker Carlson’s Dark and Malign Influence Over the Christian Right5 min read",
    "Patricia McCormickMy Book Is Horrifying. My Book Is a Lifeline. My Book Is Banned.4 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "Can You Name the Subjects of These Landmark Biographies?Try this short quiz.",
    "Anatomy of a Scene: ‘Beau Is Afraid’Ari Aster narrates a sequence from his film.",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Nuggets Star Nikola Jokic Won’t Be Suspended for Shoving Suns Owner",
    "With N.H.L.’s No. 1 Pick, Chicago Can Draft a Franchise-Changing Talent",
    "Ranking M.L.B. Teams From First to Worst, as the Mets Slide",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]