[
    "Continue reading the main story",
    "Trump IndictedJune 9, 2023, 2:14 p.m. ET",
    "Wildfire SmokeJune 9, 2023, 2:08 p.m. ET",
    "Justice Dept. Unseals Indictment Against Trump",
    "Read the complete indictment here.",
    "Sophie Park for The New York Times",
    "What’s next in the Trump documents case? A previous indictment offers clues.2 min read",
    "Former President Trump was recorded saying he knew he had a classified document.3 min read",
    "Norman Eisen, Andrew Weissmann and Joyce VanceHow to Convict Trump6 min read",
    "Mara GayIf Apocalyptic Smoke Doesn’t Spur New York City’s Mayor to Act, What Will?4 min read",
    "Micaela DiamondNight After Night, I Perform on Broadway and Tell a Devastating Story6 min read",
    "Ross DouthatDon’t Wear the Goggles. Their Vision Is Bleak.5 min read",
    "‘The Ezra Klein Show’What Communes and Other Radical Experiments in Living Together Reveal",
    "Letters From Our ReadersThe Trump Indictment: A Changed Landscape5 min read",
    "Daron Acemoglu and Simon JohnsonBig Tech Is Bad. Big A.I. Will Be Worse.5 min read",
    "David BrooksThis Is Not the Time for a Third Presidential Candidate4 min read",
    "Richard L. HasenJohn Roberts Throws a Curveball6 min read",
    "Michelle GoldbergI Loved Watching Chris Christie Tear Into Trump. That’s a Problem.6 min read",
    "Paul KrugmanOrange Skies, Red Alerts and the Future4 min read",
    "Frank BruniCasey DeSantis Is Your Obsession. Jill Biden Is Mine.9 min read",
    "Tony AwardsOur reporter talked to one-fifth of Tony voters. Here are his predictions.6 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "A 10-Year-Old Football Player Is a Social Media Sensation. His Dad Is Behind It.",
    "Blue Jays Pitcher Apologizes for Sharing Anti-L.G.B.T.Q. Video",
    "A Broadcaster Opened Up About Eating Disorders on Air. The Clip Went Viral.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]