[
    "Continue reading the main story",
    "Supreme Court Affirmative Action RulingJune 29, 2023, 3:10 p.m. ET",
    "Wildfire SmokeJune 29, 2023, 3:09 p.m. ET",
    "Russia-Ukraine WarJune 29, 2023, 3:06 p.m. ET",
    "Heat WaveJune 29, 2023, 3:00 p.m. ET",
    "France UnrestJune 29, 2023, 2:48 p.m. ET",
    "Supreme Court Rejects Affirmative Action at U.S. Colleges",
    "Read highlights from the affirmative action opinion and dissents.2 min read",
    "“This is not a normal court”: President Biden slammed the ruling on affirmative action.2 min read",
    "The Republicans running for president hailed the dismantling of affirmative action.3 min read",
    "These are the key cases the Supreme Court has yet to decide this term.",
    "What’s the Air Quality Index?",
    "Here’s how to read the Air Quality Index and protect yourself from pollution.4 min read",
    "See Our Maps of Air Quality and Smoke ›",
    "Brittainy Newman for The New York Times",
    "Teen Driver Killed by Police",
    "John Tully for The New York Times",
    "There are now over 100,000 people in homeless shelters in New York.2 min read",
    "Mark Abramson for The New York Times",
    "Michael E. WebberYou Should Be Getting Paid to Prevent Heat Wave Power Outages4 min read",
    "Thomas E. GrahamAleksandr Lukashenko Is Trying to Get Our Attention5 min read",
    "Sara J. WinstonThis Fragile Body: Scenes From My Life With Multiple Sclerosis4 min read",
    "Pamela PaulDo Not Panic. It’s Just a Moral Panic.4 min read",
    "Gail CollinsYou’re So Vain, You Probably Think This Campaign Is About You4 min read",
    "‘Matter of Opinion’Wait, Are There Actually Aliens?",
    "Letters From Our ReadersShould Gay People Seek to Be Seen as ‘Normal’?5 min read",
    "David Wallace-WellsThe Myth of Early Pandemic Polarization9 min read",
    "Nicholas KristofThe Wannabe Putin in Saudi Arabia4 min read",
    "Thomas B. EdsallThis Is Why Trump Lies Like There’s No Tomorrow11 min read",
    "Jessica GroseWhat Churches Offer That ‘Nones’ Still Long For6 min read",
    "Ross DouthatHow Do You Replace an Elite?7 min read",
    "The camouflage of cuttlefish seems almost magical. Here’s how it happens.3 min read",
    "Our columnist reflects on how Richard Ravitch helped save New York in the 1970s.4 min read",
    "Listen to the full episode.",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]