[
    "Continue reading the main story",
    "G.O.P. Rivals See Trump’s Indictment as a Big Problem (for Them)",
    "Vivek Ramaswamy Wants Other 2024 Candidates to Promise Trump a Pardon",
    "Aleksei Navalny, Russia’s jailed opposition leader, is facing new charges of extremism.2 min read",
    "Leer en español. (Read in Spanish.)5 min read",
    "Sarah Pabst for The New York Times",
    "What is Juneteenth, and how is it being celebrated?4 min read",
    "Juan Arredondo for The New York Times",
    "Erik S Lesser/EPA, via Shutterstock",
    "The giant teenager in “I’m a Virgo” is among television’s boldest moves in a while.5 min read",
    "Stressed about traveling? Learn how to stay calm during a bumpy flight.4 min read",
    "Ezra Klein‘What the Hell Happened to the California of the ’50s and ’60s?’7 min read",
    "Anupam B. Jena and Christopher M. WorshamThe Science of What We Eat Is Failing Us6 min read",
    "David FrenchA Supreme Court Ruling That Actually Reflects the Realities of America6 min read",
    "Tiya MilesAs Juneteenth Goes National, We Must Preserve the Local7 min read",
    "Nick TaborThe Homes of Lowndes County, Ala. Are Waiting4 min read",
    "Dan SinykinCormac McCarthy Had a Remarkable Literary Career. It Could Never Happen Now.7 min read",
    "Tish Harrison Warren‘You Can’t Protect Some Life and Not Others’5 min read",
    "Zach GottliebHe Lives in the Double Helix of My Cells, but I Do Not Know Him5 min read",
    "Suzanne Garfinkle-CrowellTaylor Swift Has Rocked My Psychiatric Practice5 min read",
    "Maureen DowdTo Jail or Not to Jail4 min read",
    "Ross DouthatNo Culture for Alienated Men4 min read",
    "Esau McCaulleyMy Father Failed Me. Here’s How I Learned to Forgive Him.5 min read",
    "Kate PickertIs a Revolution in Cancer Treatment Within Reach?13 min read",
    "Letters From Our ReadersMississippi’s Many Education Lessons5 min read",
    "Cormac McCarthy, Riding Into a Bloodred Sunset",
    "Read Your Way Through the U.S.-Mexico Borderlands",
    "Ruth McDowall for The New York Times",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Gareth Copley/Getty Images",
    "The Worst International Soccer Team in the World",
    "The Last Words a 13-Year-Old Boy Heard Were From His N.F.L. Hero",
    "A Hip Hop Legend and Devoted Fan Analyzes M.L.B.’s Juneteenth Efforts",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]