[
    "Continue reading the main story",
    "Doug Mills/The New York Times",
    "What’s Behind the Violence",
    "Amnesty for Illegal Firearms",
    "Many women saw pieces of Tina Turner’s powerful accounts of abuse in their own stories.5 min read",
    "David FrenchTo Watch a Trump Town Hall on Fox Is to Enter an Entirely Different World4 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "Josh ChafetzThe First Name of a Supreme Court Justice Is Not Justice7 min read",
    "David BrooksLet’s Smash the College Admissions Process4 min read",
    "Farhad ManjooIt’s the End of Computer Programming as We Know It. (And I Feel Fine.)5 min read",
    "Jamelle BouieThe Republican Obsession With ‘Work Requirements’ Is Telling4 min read",
    "Daniel BergnerThere’s a Reason So Many People Quit Antipsychotic Drugs5 min read",
    "Vidya KrishnanIn India’s Gang Rape Culture, All Women Are Victims5 min read",
    "Paul KrugmanThe Case of the Disappearing Debt Disaster4 min read",
    "Ross DouthatPut ‘Succession’ in the TV Pantheon9 min read",
    "‘The Ezra Klein Show’Fareed Zakaria on Where Russia’s War in Ukraine Stands — and Much More",
    "Peter CoyHow to Fix the National Drug Shortage6 min read",
    "Letters From Our ReadersThe Great Debt Ceiling Drama’s Finale5 min read",
    "David Wallace-WellsThe Ocean Is Looking More Menacing6 min read",
    "‘Matter of Opinion’What Biden Understands About Negotiating That Obama Never Did",
    "Jalen Wright for The New York Times",
    "Padma Lakshmi Is Leaving ‘Top Chef’ After Its 20th Season3 min read",
    "Tropical Storm Arlene Forms in the Gulf of Mexico3 min read",
    "Ilya Kabakov, Soviet-Born Artist Who Depicted Grimness With Wit, Dies at 896 min read",
    "G.M. and Stellantis Paid $364 Million in Fuel Economy Fines2 min read",
    "Nikki Haley’s Husband Will Deploy to Africa for Year With National Guard2 min read",
    "Group Challenges Arkansas Law That Would Criminalize Access to Some Books4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "Inside Rick Pitino’s Extreme Makeover at St. John’s",
    "Max Scherzer Frustrated by New Rules: ‘We’re Living and Dying by the Clock’",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]