[
    "What would the Republican plan actually do to the budget?",
    "DealBook: Debt ceiling déjà vu is worrying Wall Street.7 min read",
    "Continue reading the main story",
    "What Is the Adult Survivors Act?",
    "Russian evacuation orders caused confusion in some occupied areas of Ukraine.",
    "Fearing attacks and perhaps unrest, Russia is planning muted Victory Day celebrations.4 min read",
    "Here’s a guide to the writers’ strike.4 min read",
    "I asked ChatGPT to be my stylist. Here’s what happened.4 min read",
    "“Succession” recap: The Roys came to their election eve party with agendas.6 min read",
    "Peter BeinartImagine if Another Bernie Sanders Challenges Joe Biden5 min read",
    "Pamela PaulThe Ballad of Shiv and Tom4 min read",
    "Margaret RenklIs Red State Gun Reform in Sight? Tennessee Is About to Find Out.5 min read",
    "Anna-Lisa CohenI’m Going to Spoil Your Favorite TV Show5 min readDusty Deen",
    "Brett ChristophersThe Unfortunate, Unintended Consequence of the Inflation Reduction Act5 min read",
    "David FrenchTucker Carlson’s Dark and Malign Influence Over the Christian Right5 min read",
    "Laurence H. TribeWhy I Changed My Mind on the Debt Limit5 min read",
    "Patricia McCormickMy Book Is Horrifying. My Book Is a Lifeline. My Book Is Banned.4 min read",
    "Tish Harrison WarrenAn Apology for Saying ‘Sorry’5 min read",
    "Elizabeth SpiersThis Drug Can Change the Way People Think About Addiction4 min read",
    "Benjamin KeysYour Homeowners’ Insurance Bill Is the Canary in the Climate Coal Mine6 min read",
    "Tom Inglesby and J. Stephen MorrisonHow to Overhaul the C.D.C.5 min read",
    "Nicholas KristofThe Despair Fueling Our Chronic Pain11 min read",
    "Abraham Verghese’s Sweeping New Fable of Family and Medicine",
    "Tracing the Angry Path From Timothy McVeigh to Trumpism",
    "Virginia Teenager Dies After He Is Buried in Sand From Dune Collapse2 min read",
    "Biden Seeks Compensation for Passengers for Flight Delays and Cancellations2 min read",
    "Adam Brace, Director of Ambitious One-Person Shows, Dies at 434 min read",
    "New Butterflies Are Named for Sauron, ‘Lord of the Rings’ Villain2 min read",
    "At Least 22 Dead After Tourist Boat Capsizes in India2 min read",
    "James Harden Leads the Sixers to a Game 4 Win Over the Celtics5 min read",
    "Weekly cases ›\nApril 20 to 26\n88,210\n14-day change\n–13%\n\n\n\nApril 2022\nApril 2023\n\n\n\n\n88,210",
    "Weekly deaths ›\nApril 20 to 26\n1,052\n14-day change\n–20%\n\n\n\nApril 2022\nApril 2023\n\n\n\n\n1,052",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "After a Confrontation With the Suns Owner, Will Nikola Jokic Be Suspended?",
    "Europe Has a New Goalscoring Superstar. What Is He Really Like?",
    "In Miami, Max Verstappen Pulls Off One of His Best Formula 1 Wins Yet",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]