[
    "Continue reading the main story",
    "The court also narrowed the scope of an aggravated identity theft law.2 min read",
    "What’s the Air Quality Index?",
    "See Our Maps of Air Quality and Smoke ›",
    "WirecutterThese mosquito-thwarting gadgets have been Wirecutter favorites for five years.",
    "Michelle GoldbergI Loved Watching Chris Christie Tear Into Trump. That’s a Problem.6 min read",
    "Paul KrugmanOrange Skies, Red Alerts and the Future4 min read",
    "David FrenchOklahoma Breaches the Wall Between Church and State5 min read",
    "Frank BruniCasey DeSantis Is Your Obsession. Jill Biden Is Mine.9 min read",
    "Clare FrankWe Suffer Too Many Fools Who Start Wildfires5 min read",
    "The Editorial BoardNew York Lawmakers Try to Sabotage Campaign Reform4 min read",
    "Letters From Our ReadersEerie Days: Smoke and Haze, All Around5 min read",
    "Timothy DeneviA Decades-Old Joan Didion Mystery Solved10 min read",
    "Christopher CaldwellTrump’s Justices Didn’t Doom Affirmative Action. Demography Did.5 min read",
    "Gail CollinsThe Republican Silly Season Has Begun4 min read",
    "Charles M. BlowYes, This Is an L.G.B.T.Q. ‘State of Emergency’4 min read",
    "Nicholas KristofRemembering a Massacre That China Keeps Trying to Erase4 min read",
    "Linsey MarrWhat Wildfire Smoke, Gas Stoves and Covid Tell Us About Our Air4 min read",
    "David Wallace-WellsAs Smoke Darkens the Sky, the Future Becomes Clear5 min read",
    "Lionel Messi, Soccer’s Most Coveted Free Agent, Picks Miami",
    "Want a Class in Leadership Styles? Look to the N.B.A. Finals.",
    "Mike Simons/Tulsa World, via Associated Press",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Peter Joneleit/Icon Sportswire, via Getty Images",
    "The N.B.A. Free Agency Is as Chaotic as Ever. Who May Be on the Move?",
    "Reporter Goes Viral After Stiff-Arming Fan at Stanley Cup Final",
    "A Pitcher’s Tweets Create a Pride Month Problem for the Red Sox",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]