[
    "The Times annotated the indictment of George Santos.",
    "Continue reading the main story",
    "A birth control pill may soon be available over the counter. Here’s what to know.4 min read",
    "A 19-year-old pianist electrifies audiences, but he’s unimpressed.5 min read",
    "This illustrator’s home is shamelessly Parisian.5 min read",
    "David FirestoneGeorge Santos’s Spectacularly Dumb Alleged Scheme4 min read",
    "Cihan TugalWhatever Happens Next, Turkey Is in Trouble4 min read",
    "Charles M. BlowThe Panic Over Biden’s Age Is Manufactured4 min read",
    "Thomas B. EdsallWhen Their Idea of Liberty Is Your Idea of Death11 min read",
    "Jessica Grose‘Christianity’s Got a Branding Problem’6 min read",
    "Peter CoyGovernment Budget Deficits Can Pay for Themselves4 min read",
    "David FrenchA Guilty Ex-President4 min read",
    "Michelle CottleDonald Trump Is Ready to Relaunch. Hunker Down, America.5 min read",
    "David Wallace-WellsWe Could Easily Make Risky Virological Research Safer6 min read",
    "Mike LofgrenRepublicans Are Putting Our Standard of Living at Risk5 min read",
    "Gwen Nally and Mary Hamil GilbertCleopatra Would Not Have Identified as White. Or Black.4 min read",
    "Letters From Our ReadersThe Impasse Over Raising the Debt Limit3 min read",
    "Thomas L. FriedmanVladimir Putin Is the World’s Most Dangerous Fool6 min read",
    "Introducing ‘Matter of Opinion’",
    "John McWhorterA Killing on the F Train5 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Indigenous N.H.L. Player Forgives ESPN Anchor for Insensitive Joke",
    "Legendary Duke Coach Mike Krzyzewksi Has a New Job in the N.B.A.",
    "Advice From a Former Red Sox Star Has Helped Fuel Boston’s Turnaround",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]