[
    "Continue reading the main story",
    "Here’s what we know about the train crash.4 min read",
    "Nanna Heitmann for The New York Times",
    "Bipartisan collaboration was once a point of pride in Oregon. No longer.6 min read",
    "Emily Elconin for The New York Times",
    "Jeff Zucker was pushed out as president of CNN last year. Krista Schlueter for The New York Times",
    "Did you follow the news this week? Take our quiz.",
    "Critic’s Pick‘Past Lives’: Longing for a Future4 min read",
    "Book ReviewA Concert Pianist Changes Her Tune in ‘August Blue’5 min read",
    "Movie Review‘Rise’: Step, Repeat, Recover in a Feel-Good Dance Film1 min read",
    "Book ReviewWhen Black Liberation Is the Family Business5 min read",
    "What’s the best way to treat a workout injury: heat or ice?3 min read",
    "Incorporating awe into your daily stroll can bring mental and physical benefits.5 min read",
    "The Editorial BoardStates Are Silencing the Will of Millions of Voters7 min read",
    "Maia SzalavitzWhat Ozempic Reveals About Desire6 min read",
    "Bill SaporitoCould Air Travel Get Even More Miserable? Yes, and Here’s Why.5 min read",
    "David FrenchHere’s How We Can End the War in Ukraine1 min read",
    "Mara GayThere are Better Ways to Solve a Housing Crisis Than This5 min read",
    "Benyamin CohenEinstein and a Theory of Disinformation5 min read",
    "Maureen DowdJackie Kennedy on My Mind4 min read",
    "Lauren KelleyHow Did the End of Roe Alter Your Choices?2 min read",
    "Nicholas KristofThis May Be the Most Important Thing Happening in the World Today4 min read",
    "Letters From Our ReadersCollege Grads, Do ‘Follow Your Passions’5 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "Ross DouthatKevin McCarthy Has a Rare Quality for a Republican House Speaker4 min read",
    "Sarah WildmanWhat It Means to Be a Witness Three Generations Later5 min read",
    "Beth RaymerMy Father Taught Me the Benefits of Delusion6 min read",
    "NEWSLETTERRead The MorningMake your cookout, picnic or beach trip a little easier.6 min read",
    "Charity Rachelle for The New York Times",
    "Hollywood Directors Reach Deal With Studios as Writers’ Strike Continues3 min read",
    "A Weakened Arlene Could Bring Heavy Rain to South Florida3 min read",
    "China and U.S. Lay Out Rival Visions for Asia as Ships Nearly Collide5 min read",
    "Max Verstappen Dominates F1 Grand Prix in Spain2 min read",
    "Harvey Pitt, S.E.C. Chair Who Resigned Amid Scandals, Dies at 784 min read",
    "Robin Wagner, Visionary Set Designer of Broadway Hits, Dies at 895 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Justin Tafoya/NCAA Photos, via Getty Images",
    "Aaron Judge Crashes Through a Wall in a Display of Transcendent Stardom",
    "Adam Silver Hinted at It: The N.B.A.’s Hammer Is About to Fall on Ja Morant",
    "An M.L.B. Game Ends After an Umpire Is Hit in the Face",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]