[
    "Debt Ceiling TalksMay 9, 2023, 5:15 p.m. ET",
    "Trump-Carroll TrialMay 9, 2023, 5:15 p.m. ET",
    "Trump Is Found Liable for Sexual Abuse and Defamation",
    "E. Jean Carroll described an assault in minute detail.",
    "Here’s a closer look at the $5 million in damages that the jury awarded Ms. Carroll.",
    "Continue reading the main story",
    "See photos from this year’s Westminster Dog Show so far, to be held today in New York.2 min read",
    "Can literal mall rats save the mall?5 min read",
    "He saw “greatness” in the Lakers, even when they were at their worst.4 min read",
    "Jamelle BouieA Gun-Filled America Is a World of Fear and Alienation5 min read",
    "Timothy SnyderPutin Is Fighting, and Losing, His Last War5 min read",
    "Ben WilsonLet the Post-Pandemic City Grow Wild5 min readKidfue",
    "David QuammenPlaying the Long Game With a Deadly, Adaptable Virus4 min read",
    "Michelle GoldbergTimothy McVeigh’s Dreams Are Coming True4 min read",
    "The Editorial BoardThe Urgent Question About Republicans and Debt5 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "Letters From Our ReadersRosalind Franklin and Unsung Women in Science5 min read",
    "Peter CoyHere’s How Wall Street Is Preparing for a U.S. Debt Default5 min read",
    "Anna-Lisa CohenI’m Going to Spoil Your Favorite TV Show5 min read",
    "Margaret RenklIt’s Been Six Weeks, and We Are Fighting Here in Nashville5 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "Vida Blue Was a Baseball CometBlue, who died on Saturday, was a star from the start.5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "How a TV Miscue Spoiled an N.H.L. Draft Lottery Surprise",
    "Joel Embiid Was Stuck. Then an N.B.A. Veteran Delivered a Critical Message.",
    "One of England’s Biggest Soccer Clubs Is on the Brink of Disaster",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]