[
    "Andy Wong/Associated Press",
    "Can stress cause hair loss? Experts have thoughts on what might be going on.3 min read",
    "Overlooked no moreHannie Schaft was a resistance fighter during World War II.5 min read",
    "Thomas L. FriedmanNetanyahu and the Degradation of Israel7 min read",
    "Joshua LevkowitzScapegoated by Everyone, Wanted by No One4 min read",
    "Paul KrugmanDude, Where’s My Recession?4 min read",
    "Bret StephensSpeech We Loathe Is Speech We Must Defend4 min read",
    "Kathy HochulThe Supreme Court Case That Has Me Worried, for Survivors and for My State4 min read",
    "Total RefusalThese Video Game Characters Are Programmed to Do One Thing Forever: Work",
    "John McWhorterWhat Justice Ketanji Brown Jackson Meant When She Said ‘Blink’5 min read",
    "Grey Anderson and Thomas MeaneyNATO Isn’t Really About Defense, and It Never Was5 min read",
    "Samuel WoolleySome of the Worst Troll Armies Are Gaining Ground. Just Look at Cambodia.5 min read",
    "Jane CoastonThe Republican Governor of Utah Wants to Spare Kids From Their Phones12 min read",
    "Letters From Our ReadersWeighing the Morality of Giving Ukraine Cluster Munitions4 min read",
    "‘The Ezra Klein Show’A.I. Could Solve Some of Humanity’s Hardest Problems. It Already Has.",
    "Farhad ManjooWhy I Regret Debating Robert F. Kennedy Jr.",
    "Peter CoyThe ‘Representative Agent’ Is Always Rational. The Rest of Us Are Not.6 min read",
    "Genna Martin/San Francisco Chronicle, via Associated Press",
    "The AthleticUnlimited for All Access and The Athletic subscribers.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]