[
    "Continue reading the main story",
    "Here’s how to tell if your child has an unhealthy relationship to social media.4 min read",
    "Matthew Abbott for The New York Times",
    "Russia’s military response was questioned after the rare assault inside the nation’s borders.",
    "A.I. might help gamers design their next characters.6 min read",
    "Here’s how to light an outdoor space without infuriating your neighbors.5 min read",
    "Jamelle BouieNeil Gorsuch Has Given Himself Away4 min read",
    "Farhad ManjooA.I. Photoshopping Is About to Get Very Easy. Maybe Too Easy.6 min read",
    "Paul KrugmanThe Good News on Unemployment for Black Americans4 min read",
    "Katherine MillerThere’s Another Businessman  Who Wants to Run America6 min read",
    "Chouwa LiangMy A.I. Lover Gets MeChouwa Liang",
    "‘A Tim Scott Nomination Would Be a Nightmare for Joe Biden’7 min read",
    "‘The Ezra Klein Show’Our Obsession With Wellness Is Hurting Teens — and Adults",
    "Scott J. ShapiroThis Is Why I Teach My Law Students How to Hack5 min read",
    "David BrooksTim Keller Was a Guide to a Wonder-Filled Life4 min read",
    "Letters From Our ReadersCan Kids Recover From Covid Learning Losses?5 min read",
    "Sapna CheryanThe Most Common Graduation Advice Tends to Backfire4 min read",
    "Gail Collins and Bret StephensThe Republican Presidential Plot Is Thickening6 min read",
    "Peter CoyThe Welfare Debate Stalling the Debt Talks5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Andrew D. Bernstein/NBAE via Getty Images",
    "The Most Scrutinized Shirt in Soccer",
    "One Shot Showcases the Inexplicable Greatness of Nikola Jokic",
    "The Record-Setting Slugger Likely to Be the No. 1 M.L.B. Draft Pick",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]