[
    "Debt Ceiling TalksMay 16, 2023, 12:36 p.m. ET",
    "Cannes Film FestivalMay 16, 2023, 12:35 p.m. ET",
    "Continue reading the main story",
    "Ozempic is hard to find. Some are turning to unauthorized alternatives.5 min read",
    "Chris Messina forced Matt Damon to up his game in “Air.”5 min read",
    "Paul KrugmanWhy Are Americans So Negative About the Economy?4 min read",
    "Michelle GoldbergWhose Version of Christian Nationalism Will Win in 2024?4 min read",
    "Jamelle BouieThe Republican Embrace of Vigilantism Is No Accident5 min read",
    "‘The Ezra Klein Show’How Worried Should We Be About America’s Debt?",
    "Letters From Our ReadersWas CNN Right to Air the Trump Town Hall?5 min read",
    "Adam GopnikWhat We Lose When We Push Our Kids to ‘Achieve’6 min read",
    "Gail Collins and Bret StephensTrump Cannot Be Unseen7 min read",
    "Peter CoyA Look at the Fed’s Likely Next No. 24 min read",
    "Karla Cornejo VillavicencioImmigrants Love America the Way It Needs to Be Loved4 min read",
    "Mitchell Abidor and Miguel LagoHow Marine Le Pen Became France’s Voice of Reason5 min read",
    "Letters From Our ReadersRalph Nader and Others Clash Over the Value of Third Parties5 min read",
    "Listen to ‘The Daily’What happened at the southern U.S. border when Title 42 expired?",
    "Photos From the Red Carpet",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Arsenal’s Rising Star Striker Chooses U.S. Over England. Where Would He Fit?",
    "How the Memory of One of Baseball’s Unforgettable Characters Lives On",
    "College Football Is in an Arms Race. One Storied Program Is Falling Behind.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]