[
    "Continue reading the main story",
    "Senate Passes Debt Limit Deal to Avert Default",
    "See how each senator voted on raising the debt limit.",
    "Jamie Kelter Davis for The New York Times",
    "Finbarr O'Reilly for The New York Times",
    "Greta Lee is winning accolades for trying something new in “Past Lives”: restraint.7 min read",
    "Modern LoveShe tried to laugh off sexual aggression. One slap changed everything.6 min read",
    "David FrenchA Peek Behind the MAGA Curtain4 min read",
    "Josh ChafetzThe Supreme Court Has Earned a Little Contempt7 min read",
    "Megan K. Stack‘The View’ Has Narrowed10 min read",
    "David BrooksLet’s Smash the College Admissions Process4 min read",
    "Vidya KrishnanIn India’s Gang Rape Culture, All Women Are Victims5 min read",
    "Daniel BergnerA Major Problem With Compulsory Mental Health Care Is the Medication5 min read",
    "Jamelle BouieRepublicans Have a Twisted View of the Safety Net4 min read",
    "Farhad ManjooIt’s the End of Computer Programming As We Know It. (And I Feel Fine.)5 min read",
    "Paul KrugmanThe Case of the Disappearing Debt Disaster4 min read",
    "‘The Ezra Klein Show’Fareed Zakaria on Where Russia’s War in Ukraine Stands — and Much More",
    "Frank BruniDemocrats Want Trump? They’re Out of Their Minds9 min read",
    "John McWhorterHow Verbs Shape Our Minds7 min read",
    "Carlos LozadaMen Have Lost Their Way. Josh Hawley Has Thoughts About How to Save Them.8 min read",
    "Pamela PaulPolitical Correctness Used to Be Funny. Now It’s No Joke.5 min read",
    "Michelle CottleWhat Biden Understands About Negotiating That Obama Never Did",
    "‘Spider-Man: Across the Spider-Verse’ Review: Worlds Wide Web",
    "Pride Month in New York Is Back. Here’s How to Celebrate.",
    "海外华人札记 | 邻居“任性“改装让住宅变危楼，你能怎么办？Read our Chinese-language newsletter.1 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "How Budweiser Tried to Win English Soccer’s Biggest Cup Competition",
    "Mike Pence Calls on M.L.B. to Apologize to ‘Catholics Across America’",
    "Max Scherzer Frustrated by New Rules: ‘We’re Living and Dying by the Clock’",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]