[
    "Continue reading the main story",
    "The Supreme Court narrowed the right to confront one’s accuser in joint trials.3 min read",
    "Border Patrol agents search migrants in El Paso. Ivan Pierre Aguirre for The New York Times",
    "Weather warnings can save lives. Here’s what makes them effective.5 min read",
    "Nitashia Johnson for The New York Times",
    "CLIMATE FORWARD NEWSLETTERPower grids across the world are teetering. Here’s why.5 min read",
    "See detailed maps of the latest U.S. heat index.",
    "Stroll under the neon lights of Singapore to find food and flavor.5 min read",
    "This stretch of a boardless boardwalk in Rio de Janeiro crackles with energy.3 min read",
    "Linda GreenhouseIs There Any Twinge of Regret Among the Anti-Abortion Justices?5 min read",
    "‘He’s a Hint of the Future’: Our Writers on Vivek Ramaswamy6 min read",
    "Farhad ManjooIt’s Not Possible to ‘Win’ an Argument With Robert F. Kennedy Jr.6 min read",
    "Jamelle BouieTrump, the Worst Boss You’ve Ever Had4 min read",
    "Jesse WegmanDoes Justice Alito Hear Himself?6 min read",
    "Peter CoyThe Many Minds Behind Biden’s Biggest Economic Idea7 min read",
    "Ross DouthatWhy I’m Not a Liberal Catholic10 min read",
    "David BrooksThe Age of Spectacle Is Upon Us4 min read",
    "‘The Ezra Klein Show’Why This Economist Wants to Give Every Poor Child $50,000",
    "Letters From Our ReadersAssessing Modi’s Leadership of India5 min read",
    "Maya JasanoffNarendra Modi Is Not Who America Thinks He Is6 min read",
    "John McWhorterReparations Should Be an End, Not a Beginning4 min read",
    "The Editorial BoardThe India Quandary6 min read",
    "What Nine Women in Kansas Wish People Realized About Abortion",
    "‘Matter of Opinion’What Happens When You Stop Being a Superpower?",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "For San Antonio, Victor Wembanyama Is a Serendipity From the ‘Hoop Gods’",
    "Why the Mets Should Consider Trading One of Their Best Pitchers",
    "8 Days After Losing the Super Bowl, He Was Back in College Classes",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]