[
    "Continue reading the main story",
    "Trump Documents Case Puts U.S. Justice System to the Test",
    "Doug Mills/The New York Times",
    "See where the classified government files were found at Mar-a-Lago.",
    "Read our annotated version of the indictment.",
    "Leer en español. (Read in Spanish.)19 min read",
    "Christopher Anderson/Magnum, for The New York Times",
    "The A.I. revolution will change jobs. Nobody agrees how.5 min read",
    "A.I. is often compared to nuclear weapons: Can you tell which one these quotes refer to?2 min read",
    "Inter Milan, facing a painful reckoning, is trying to live in the now.6 min read",
    "Shaun Botterill/Getty Images",
    "Did you follow the news this week? Take our quiz.",
    "Maureen DowdBathroom Reading at Mar-a-Lago4 min read",
    "BINYAMIN APPELBAUMCan Federal Investment Persuade Red America to Go Green?8 min read",
    "Nicholas KristofIdeas Change the World — and What You Eat3 min read",
    "Tanya GoldHarry Is a More Interesting Prince Than We Deserved3 min read",
    "Ross DouthatDoes the U.S. Government Want You to Believe in U.F.O.s?4 min read",
    "Jessica GroseIt’s Not Just Men and Boys Who Are Struggling Right Now6 min read",
    "Norman EisenHow to Convict Trump6 min read",
    "David FrenchTrump’s Misconduct Was Too Brazen Not to Charge5 min read",
    "Letters From Our ReadersIs Masculinity in Crisis?5 min read",
    "Paul KrugmanHow Low Must Inflation Go?5 min read",
    "Daron Acemoglu and Simon JohnsonBig Tech Is Bad. Big A.I. Will Be Worse.5 min read",
    "Micaela DiamondNight After Night, I Perform on Broadway and Tell a Devastating Story6 min read",
    "‘The Ezra Klein Show’What Communes and Other Radical Experiments in Living Together Reveal",
    "Here’s how to watch the Tony Awards on Sunday.3 min read",
    "WIRECUTTERRejuvenate a night in with these six delightful card games.",
    "David Zaslav Picked Chris Licht to Revamp CNN. Now What?",
    "CNN Tries to Change the Channel From Wall-to-Wall Chaos",
    "Pool photo by Stefan Rousseau",
    "How to Plan a Dry WeddingAlcohol-free parties have their own unique challenges.5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Bruce Bennett/Getty Images",
    "Why Inter Milan Can’t Be Written Off in the Champions League Final",
    "The Heat Have Tried to Slow Down Nikola Jokic. Nothing Has Worked.",
    "A Broadcaster Opened Up About Eating Disorders on Air. The Clip Went Viral.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]