[
    "While the U.S. is attending the G7 summit, China is hosting its own.3 min read",
    "Continue reading the main story",
    "In a battered Ukrainian city, the war has stolen the normal experiences of teenage life.5 min read",
    "Help! My husband’s children stopped talking to him after they saw his will.4 min read",
    "Gail CollinsRemember When Trump and DeSantis Loved Each Other? Neither Do They.4 min read",
    "Miki Katoni‘It’s Still an Emergency’: The Vulnerability of Queer Orthodox Jews1 min read",
    "Jennifer LindJapan Can’t Pass the Buck Anymore5 min read",
    "Randall D. EliasonWhy the Supreme Court Is Blind to Its Own Corruption5 min read",
    "Pamela PaulThe Decade That Cannot Be Deleted4 min readAlamy Photo",
    "Kevin F. BoehnkeThe Increasingly Absurd Illogic of Workplace Drug Tests3 min read",
    "David Wallace-WellsThere’s No Escape From Wildfire Smoke5 min read",
    "Peter CoyWhat Americans Don’t Understand About China5 min read",
    "Elise LoehnenThe Lies Mothers Tell Themselves and Their Children6 min read",
    "Ross DouthatLegalizing Marijuana Is a Big Mistake5 min read",
    "Jedediah Britton-PurdyThe Fight for Democracy Begins in North Carolina5 min read",
    "Letters From Our ReadersThe Killing on the Subway: Outrage, Fear, Empathy5 min read",
    "Jessica GroseCable News Viewers Aren’t as Extreme as You Might Think5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Blue Jays Pitcher Admits He Was Tipping Pitches Against Aaron Judge",
    "How Manchester City Earned Its Biggest Result in 129 Years",
    "The Architect Behind the Warriors Dynasty Could Walk Away From the Franchise",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewElie Levine reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]