[
    "Continue reading the main story",
    "Ask the Ethicist: Our theater is fighting about diversity. Who’s right?6 min read",
    "In Los Angeles, movie and TV writers are flirting at the picket line.7 min read",
    "Peter CoyWhat Americans Don’t Understand About China5 min read",
    "David Wallace-WellsThere’s No Escape From Wildfire Smoke5 min read",
    "Nadia MarzoukiMy Country Has Been a Dictatorship Before. This Feels Worse.4 min read",
    "Jedediah Britton-PurdyThe Fight for Democracy Begins in North Carolina5 min readIgor Bastidas",
    "Ross DouthatLegalizing Marijuana Is a Big Mistake5 min read",
    "Letters From Our ReadersThe Killing on the Subway: Outrage, Fear, Empathy5 min read",
    "Thomas L. FriedmanOne Good Way Biden Can Out-Trump Trump6 min read",
    "Bret StephensAt 75, Israel Has Plenty to Celebrate4 min read",
    "Jessica GroseCable News Viewers Aren’t as Extreme as You Might Think5 min read",
    "Paul KrugmanBiden Blew It on the Debt Ceiling4 min read",
    "John McWhorterIs Musicology Racist?5 min read",
    "Read the Climate Forward NewsletterThe legal headaches for Big Oil are spreading.5 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The High School Classmates Who Became an N.B.A. Star and an N.H.L. Villain",
    "A Top Premier League Striker Receives an 8-Month Ban for Betting",
    "The N.B.A.’s Nonsensical Coaching Carousel Has Spun Out of Control",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewElie Levine reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]