[
    "Trump Is Found Liable for Sexual Abuse and Defamation",
    "E. Jean Carroll described an assault in minute detail.",
    "Here’s a closer look at the $5 million in damages awarded to E. Jean Carroll.",
    "Jurors were given three types of battery to consider in the case.1 min read",
    "Continue reading the main story",
    "The musician Lewis Capaldi will break your heart, but don’t take him too seriously.7 min read",
    "Thomas L. FriedmanVladimir Putin Is the World’s Most Dangerous Fool6 min read",
    "Michelle GoldbergThe Fury of #MeToo Finally Comes for the Man Who Inspired It3 min read",
    "John McWhorterA Killing on the F Train5 min read",
    "Ben WilsonLet the Post-Pandemic City Grow Wild5 min readKidfue",
    "Timothy SnyderPutin Is Fighting, and Losing, His Last War5 min read",
    "Paul KrugmanHow to Think About Green Industrial Policy4 min read",
    "Letters From Our ReadersE. Jean Carroll v. Donald Trump: He’s Liable2 min read",
    "Jamelle BouieA Gun-Filled America Is a World of Fear and Alienation5 min read",
    "Michelle GoldbergTimothy McVeigh’s Dreams Are Coming True4 min read",
    "David QuammenPlaying the Long Game With a Deadly, Adaptable Virus4 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "The Editorial BoardThe Urgent Question About Republicans and Debt5 min read",
    "Letters From Our ReadersRosalind Franklin and Unsung Women in Science5 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Does the Top Pick in the N.H.L. Draft Justify Chicago’s Miserable Rebuild?",
    "These Players Could Be on the Move Soon as the M.L.B. Trade Season Nears",
    "One of England’s Biggest Soccer Clubs Is on the Brink of Disaster",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!3 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]