[
    "Continue reading the main story",
    "Mayor Adams Addresses Killing",
    "Here’s what to know about the new treatment for hot flashes.4 min readGetty Images",
    "Consumers are running out of reasons to splurge on a “pro” phone, our columnist writes.4 min read",
    "David NasawElon Musk Makes Sense. Yes, Really.6 min readMark Mahaney/Redux",
    "Luis Alberto UrreaMy Mother Returned from World War II a Changed Woman5 min read",
    "Michael E. WebberWill Texas Blow Up Its Energy Miracle to Bolster Fossil Fuels?5 min read",
    "Zeynep TufekciThe Shockingly Lax Laboratory Standards in the U.S.8 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the Kitchen",
    "Ross DouthatConservative Media Has an Audience Problem6 min read",
    "Peter CoyThe Struggle to Explain the ‘Gender Well-Being Gap’4 min read",
    "Cecilia MárquezThe Long and Violent History of Anti-Black Racism in the Latino Community4 min read",
    "Farhad ManjooTucker Carlson on Twitter Could Work Awfully Well5 min read",
    "Letters From Our ReadersBullying, and Suicide, in High School5 min read",
    "Connie WangMy Name Is Connie. Her Name Is Connie. There Are More of Us Out There.",
    "Paul KrugmanAttack of the Pharma Phantoms4 min read",
    "David BrooksThe Second Phase of the Biden Presidency4 min read",
    "Matter of OpinionWhat if We Just Paid Clarence Thomas $1 Million?",
    "Tom Kane and Sean ReardonParents Don’t Understand How Far Behind Their Kids Are in School",
    "Here are some more recent favorites:",
    "What’s in Our Queue? Liberato and More",
    "Whats in Our Queue? ‘Succession’ and More",
    "Flush With Federal Money, a Deep South Factory Votes to Unionize5 min read",
    "Lawyer Who Fled to Cuba After Shooting Girlfriend Is Convicted of Murder3 min read",
    "Some U.S. Solar Makers Criticize Biden’s Tax Credits as Too Lax on China4 min read",
    "Idaho Woman With ‘Doomsday’ Beliefs Found Guilty in Children’s Deaths4 min read",
    "Severe Storms Threaten Midwest and Plains After Tornado Reports3 min read",
    "Dan Snyder to Proceed With Sale of Washington Commanders to Josh Harris3 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "A Timeline of Dan Snyder’s Tumultuous Tenure in Washington",
    "As the Nuggets Chase an N.B.A. Title, Nikola Jokic Keeps Raising the Bar",
    "Why Georgia Football Was Wrong for Declining the White House Invitation",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]