[
    "Continue reading the main story",
    "‘Biden and Me’: DeSantis Privately Tells Donors Trump Can’t Win",
    "Eyeing DeSantis, Trump Readies for a Long Primary Battle",
    "Ruth Fremson/The New York Times",
    "Pro-Ukraine fighters behind a cross-border attack said Russia should brace for more assaults.",
    "Yuri Kochetkov/EPA, via Shutterstock",
    "Thibault Camus/Associated Press",
    "Doug Mills/The New York Times",
    "My father was awful. Do I have to plan his funeral?6 min read",
    "Restaurant review: House Brooklyn serves fluid French-Japanese cuisine.5 min read",
    "Kate RedburnAll Americans Have the Right to Dress Exactly How They Want5 min read",
    "Rich LowryHe’s Not Dead Yet6 min read",
    "Frank BruniThe DeSantis Delusion6 min read",
    "Ross DouthatWhat Has Trump Cost American Christianity?6 min read",
    "Roger LowensteinThe Way Out of the Debt Crisis Could Lead Back Through the Civil War5 min read",
    "Peter CoyUnemployment Is Low, But So Is the National Mood4 min read",
    "Jessica GroseTweens Shouldn’t Be on Social Media. Can Smartwatches Help Keep Them Off?4 min read",
    "Letters From Our ReadersLegalizing Weed: Was It a Harmful Mistake?5 min read",
    "Farhad ManjooA.I. Photoshopping Is About to Get Very Easy. Maybe Too Easy.6 min read",
    "Paul KrugmanThe Good News on Unemployment for Black Americans4 min read",
    "Katherine MillerThere’s Another Businessman  Who Wants to Run America6 min read",
    "Jamelle BouieNeil Gorsuch Has Given Himself Away4 min read",
    "‘A Tim Scott Nomination Would Be a Nightmare for Joe Biden’7 min read",
    "Chouwa LiangMy A.I. Lover Gets Me",
    "‘Ted Lasso,’ Season 3, Episode 10 RecapHow quickly can a story line end? Very quickly.8 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Justin K. Aller/Getty Images",
    "Law Enforcement Visits Ja Morant Following Cryptic Social Media Posts",
    "Why the N.F.L. Is Trending Toward Eliminating Kickoffs",
    "One Shot Showcases the Inexplicable Greatness of Nikola Jokic",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]