[
    "Continue reading the main story",
    "For the first time, out nonbinary performers won Tonys.2 min read",
    "Here’s a list of all the Tony winners.2 min read",
    "Taking a walk with someone can strengthen social connections, research shows.4 min read",
    "Gratitude really is good for you. Here’s what the science says.5 min read",
    "Ezra KleinRon DeSantis Thinks Trump Didn’t Go Far Enough5 min read",
    "Oona A. HathawayThe Company Trump Keeps in Violation of the Espionage Act7 min read",
    "Marie Suul BrobakkeA Couple Returns to the Same Argument. Over and Over Again.",
    "Serge SchmemannWhy Doesn’t Anyone Seem to Care About the Discord Leaks?5 min read",
    "Daron Acemoglu and Simon JohnsonBig Tech Is Bad. Big A.I. Will Be Worse.5 min read",
    "Jennifer AckermanWhat Owls’ Silent Flight Tells Us About the World5 min read",
    "Jill ApplegateTheir Pot Convictions Were Erased, but They Still Face Deportation4 min read",
    "Letters From Our ReadersCloisters U.: The Sounds of Silence in a College Class5 min read",
    "Maureen DowdBathroom Reading at Mar-a-Lago4 min read",
    "The Editorial BoardDonald Trump Should Never Again Be Trusted With the Nation’s Secrets5 min read",
    "Tanya GoldHarry Is a More Interesting Prince Than We Deserved3 min read",
    "Jessica GroseIt’s Not Just Men and Boys Who Are Struggling Right Now6 min read",
    "Ross DouthatDoes the U.S. Government Want You to Believe in U.F.O.s?4 min read",
    "Nicholas KristofTurning the Tide on Animal Suffering3 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Michael Regan/Getty Images",
    "A Tradition Has Fans ‘Armed’ With Plastic Rats at the Stanley Cup Final",
    "Yankees Broadcaster Is Bloodied by Foul Ball",
    "Do the Phillies Have the Fastest Pitch Clock in America? The Data Says Yes.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "Read more about Wirecutter’s recommendations for wildfire smoke",
    "How to Properly Apply Sunscreen",
    "Ask Wirecutter: How Do I Block Out Annoying Sounds?",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]