[
    "Continue reading the main story",
    "Supreme Court Says Alabama Diluted Power of Black Voters",
    "Kenny Holston/The New York Times",
    "See Our Maps of Air Quality and Smoke ›",
    "Just how bad was the pollution in New York?",
    "National Oceanic and Atmospheric Administration",
    "Pence Delivers Strong Rebuke to Trump in Campaign Announcement",
    "Chris Christie Announces ’24 Run, Taking Square Aim at Trump",
    "Listen to the full episode.",
    "Drone video showed a critically endangered porpoise still hanging on in Mexico.3 min read",
    "What can I do about my daughter’s father showing up drunk?4 min read",
    "Linsey MarrWhat Wildfire Smoke, Gas Stoves and Covid Tell Us About Our Air4 min read",
    "Charles M. BlowYes, This Is an L.G.B.T.Q. ‘State of Emergency’4 min read",
    "The Editorial BoardNew York Lawmakers Try to Sabotage Campaign Reform4 min read",
    "Timothy DeneviA Decades-Old Joan Didion Mystery Solved10 min read",
    "Gail CollinsThe Republican Silly Season Has Begun4 min read",
    "Christopher CaldwellTrump’s Justices Didn’t Doom Affirmative Action. Demography Did.5 min read",
    "Nicholas KristofRemembering a Massacre That China Keeps Trying to Erase4 min read",
    "David Wallace-WellsAs Smoke Darkens the Sky, the Future Becomes Clear5 min read",
    "Charles KomanoffThere’s Only One Way to Fix New York’s Traffic Gridlock6 min read",
    "Peter CoyGolf’s Antitrust Problem Just Got Bigger5 min read",
    "Letters From Our ReadersBiden’s Age, and His Achievements5 min read",
    "Matthew YglesiasIt’s Great to Have a President Who Knows When to Shut Up5 min read",
    "10 Movies That Capture New YorkHere are some memorable cinematic depictions of the city.4 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Cliff Hawkins/Getty Images",
    "Reporter Goes Viral After Stiff-Arming Fan at Stanley Cup Final",
    "Can Golf’s Big Merger Survive Antitrust Concerns?",
    "Denver’s Stars Refused to be Stopped. They Made N.B.A. History in the Process.",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Digits | BetaChallenge yourself with a daily numbers puzzle.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]