[
    "Continue reading the main story",
    "Doug Mills/The New York Times",
    "A guide to Cormac McCarthy’s books: These seven novels are the best of his work.4 min read",
    "Here are five Cormac McCarthy film adaptations you can stream.3 min read",
    "Dawn Jones/Professor Productions",
    "Leer en español. (Read in Spanish.)5 min read",
    "Meg Oliphant for The New York Times",
    "Thomas L. FriedmanHow Trump Keeps Getting Away With It5 min read",
    "Bret StephensLock Him Up4 min read",
    "Jamelle BouieRepublicans Have Made Their Choice4 min read",
    "David French‘Shiny Happy People,’ Fundamentalism and the Toxic Quest for Certainty6 min read",
    "Julia AngwinOne of the Last Bastions of Digital Privacy Is Under Threat5 min read",
    "Mattia FerraresiFarewell to the Man Who Gave Us Trump4 min read",
    "Letters From Our ReadersSaving the Flailing Humanities5 min read",
    "‘The Ezra Klein Show’What We Learned Reading Ron DeSantis’s Books",
    "‘He Has Nothing Else’: Our Writers on Trump and the 2024 Election8 min read",
    "Gail Collins and Bret StephensSpeaking of Forest Fires, Let’s Talk About Trump6 min read",
    "Erwin ChemerinskyTime Is Running Out for John Roberts and the Supreme Court4 min read",
    "David FirestoneRon DeSantis Finds a New Set of Laws to Ignore6 min read",
    "Peter CoyThe Woman in Charge of Saving Turkey’s Economy5 min read",
    "Our reporter put an A.I. travel adviser to the test on a trip to Milan.6 min read",
    "Dads are leaving the grills in the dust. So what’s the state of fatherly cooking now?6 min read",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "Richard Heathcote/Getty Images",
    "An N.H.L. Team Is Selling for Close to $1 Billion. Who Is the New Owner?",
    "Nikola Jokic Ushers the N.B.A. Into a New Era and Spurs an Evolution",
    "New York Rangers Legend Henrik Lundqvist Finds a Home on TV",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!",
    "Connections | BetaGroup words that share a common thread.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]