[
    "George Santos CaseMay 10, 2023, 3:12 p.m. ET",
    "U.S. InflationMay 10, 2023, 3:07 p.m. ET",
    "Here’s an overview of the charges against Representative George Santos.2 min read",
    "The Times is annotating the indictment of George Santos.",
    "Continue reading the main story",
    "U.S. Debt Ceiling Standoff",
    "Understand the G.O.P. Plan",
    "These were the nine most stylish dogs at the Westminster Dog Show.2 min read",
    "Here’s why Americans are smuggling Fruit Roll-Ups Into Israel.3 min read",
    "Mike LofgrenRepublicans Are Putting Our Standard of Living at Risk5 min read",
    "Thomas B. EdsallWhen Their Idea of Liberty Is Your Idea of Death11 min read",
    "Michelle CottleDonald Trump Is Ready to Relaunch. Hunker Down, America.5 min read",
    "David FrenchA Guilty Ex-President4 min read",
    "Peter CoyGovernment Budget Deficits Can Pay for Themselves4 min read",
    "Jessica Grose‘Christianity’s Got a Branding Problem’6 min read",
    "David Wallace-WellsWe Could Easily Make Risky Virological Research Safer6 min read",
    "Letters From Our ReadersThe Impasse Over Raising the Debt Limit3 min read",
    "Thomas L. FriedmanVladimir Putin Is the World’s Most Dangerous Fool6 min read",
    "Michelle GoldbergThe Fury of #MeToo Finally Comes for the Man Who Inspired It3 min read",
    "Introducing ‘Matter of Opinion’",
    "John McWhorterA Killing on the F Train5 min read",
    "Timothy SnyderPutin Is Fighting, and Losing, His Last War5 min read",
    "Ben WilsonLet the Post-Pandemic City Grow Wild5 min read",
    "Read The MorningDonald Trump’s legal problems are growing deeper, German Lopez writes.6 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "If the Warriors’ Season Is to Continue, Stephen Curry Needs Help",
    "Legendary Duke Coach Mike Krzyzewksi Has a New Job in the N.B.A.",
    "Advice From a Former Red Sox Star Has Helped Fuel Boston’s Turnaround",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Today’s Wordle ReviewOur columnist reviews the day’s puzzle. Warning: Contains spoilers!2 min read",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]