[
    "Continue reading the main story",
    "The U.S. is running out of cash, and there isn’t much time left to find a solution.3 min read",
    "We want to know what New York City’s reading overhaul means for you.1 min read",
    "What is Islamic Jihad and why is Israel targeting it?2 min read",
    "The Dog Days of Westminster",
    "LinkedIn said it would shut its China app and cut over 700 jobs worldwide.2 min read",
    "These women are taking a summer break from dating apps.4 min read",
    "A study supports active surveillance of low-risk prostate cancer instead of treatment.5 min read",
    "The Editorial BoardThe Urgent Question About Republicans and Debt5 min read",
    "Michelle GoldbergTimothy McVeigh’s Dreams Are Coming True4 min read",
    "Yana PanMy Mother Didn’t Want Me to ‘End Up’ Like Her, but I’m Still in the KitchenYana Pan",
    "Jamelle BouieA Gun-Filled America Is a World of Fear and Alienation5 min read",
    "David QuammenIf the Pandemic Is No Longer a Public Health Emergency, Then What Is It?4 min read",
    "Timothy SnyderWe Forget Nuclear Powers Have Lost Wars5 min read",
    "Ben WilsonLet the Post-Pandemic City Grow Wild5 min read",
    "Paul KrugmanThe Cowardice of the Deficit Scolds4 min read",
    "Peter CoyHere’s How Wall Street Is Preparing for a U.S. Debt Default5 min read",
    "Anna-Lisa CohenI’m Going to Spoil Your Favorite TV Show5 min read",
    "Margaret RenklIt’s Been Six Weeks, and We Are Fighting Here in Nashville5 min read",
    "Letters From Our ReadersWhen Mass Shootings Become Almost Daily Events5 min read",
    "Weekly cases ›\nApril 27 to May 3\n77,263\n14-day change\n–22%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n77,263",
    "Weekly deaths ›\nApril 27 to May 3\n1,109\n14-day change\n–11%\n\n\n\nMay 2022\nMay 2023\n\n\n\n\n1,109",
    "The AthleticIn-depth sports coverage of your favorite teams and leagues.",
    "The Debate Over Next Year’s No. 1 N.F.L. Draft Pick Is Already Heated",
    "College Sports Has a History of Gambling Scandals. It’s Getting Longer.",
    "One of England’s Biggest Soccer Clubs Is on the Brink of Disaster",
    "New York Times CookingRecipes, advice and inspiration for any occasion.",
    "Recommendations From WirecutterIndependent reviews for thousands of products.",
    "WordleGuess the 5-letter word with 6 chances.",
    "Spelling BeeHow many words can you make with 7 letters?",
    "The CrosswordGet clued in with wordplay, every day.",
    "TilesMatch visual elements and keep your chain going.",
    "Letter BoxedCreate words using letters around the square.",
    "© 2023 The New York Times Company"
]