[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Tesla jumps as GM deal makes its charging network closer to US standard",
    "Exclusive: Shell pivots back to oil to win over investors -sources",
    "Netflix sign-ups jump as U.S. password sharing crackdown kicks off - data",
    "UBS, government sign Credit Suisse loss-sharing deal clearing way for deal to close",
    "France strong-arms big food companies into cutting prices",
    "Canada's May unemployment rate rises for first time in nine months to 5.2%",
    "Ex-JPMorgan executive Staley to be questioned under oath about Epstein ties",
    "Trump lawyers quit in documents case; Trump aide indicted",
    "Trump's Republican rivals criticize 'weaponization' of DOJ after indictment",
    "Who is Special Counsel Jack Smith in the Trump documents case?",
    "Graphic: Trump's major legal woes",
    "Russia reports heavy fighting in southern Ukraine, Kyiv says little",
    "Kyiv says it intercepted call showing Russia blew up Kakhovka dam",
    "Maps: Damage from the Nova Kakhovka dam collapse",
    "Russian invasion increases challenges, risks for Ukraine coal mines",
    "S&P, Nasdaq hit fresh 2023 highs as Tesla rallies",
    "French 'backpack hero' says his faith gave him strength to fight knifeman",
    "Wildfires spread in British Columbia, Quebec sees signs of progress",
    "Podcast: What’s next for Trump and crypto’s uncertain future",
    "U.S. Supreme Court ruling brightens electoral map for Democrats in 2024",
    "Voting Rights Act survives at US Supreme Court but more challenges loom",
    "Biden to hold first 2024 campaign event in Pennsylvania",
    "FBI arrests Texas man at center of suspended attorney general Paxton's impeachment",
    "Biden heads to North Carolina while Republicans Trump, DeSantis court state",
    "Serbia's Vucic demands Kosovo concessions on autonomy for local Serbs before new vote",
    "Toddlers stable after Annecy attack, Macron hails emergency responders",
    "Pope 'progressively improving' after surgery, doing some work from armchair",
    "Italy's former PM Berlusconi in hospital for leukaemia scheduled checks",
    "Israeli construction in West Bank no bar to peace, Netanyahu says",
    "Erdogan names Erkan to head Turkey central bank, policy pivot expected",
    "Russia has received hundreds of Iranian drones to attack Ukraine - White House",
    "Saudi Arabia's golf coup highlights Biden's human rights bind",
    "Sudan factions agree day's truce designed to 'break cycle of violence'",
    "One U.N. peacekeeper killed and four injured in north Mali attack",
    "Archbishop of Canterbury urges Ugandan Anglicans to reject anti-gay law",
    "From restaurants to water towers, unrest dents Senegal's economy",
    "Factbox: Jefferies sees AI fuelling next wave of innovation in oil and gas sector",
    "OpenAI CEO encourages South Korea to supply chips in AI boom",
    "U.S. Congress to consider two new bills on artificial intelligence",
    "AI startup Cohere raises funds from Nvidia, valued at $2.2 billion",
    "100 years of Le Mans spans tragedy and triumph",
    "US remain top in FIFA rankings before Women's World Cup",
    "Tennis-Swiatek aiming for third title, Muchova out to spoil the party",
    "Rahane helps India hang tough against Australia onslaught",
    "Ukrainians flee flooding after deadly dam breach",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Travellers gather for the annual Appleby Horse Fair",
    "S.Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Boy George says he still wants to startle people 'a little bit'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]