[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Crunch time in FTC fight against Microsoft deal to buy Activision",
    "US health department, law firms latest hit in wide-ranging hack",
    "Analysis: Dollar drought haunts frontier economies",
    "Rouble hits 15-month low past 87 vs dollar on political risk concerns",
    "Euro zone profits still bigger factor in inflation than wages: ECB",
    "Stocks shrug off inflation angst, yen bows to dollar",
    "How should slavery and its legacy be taught in classrooms?",
    "Explore the specific ties to slavery among U.S. elite",
    "Resources to explore your own family history",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Where are Russian generals Gerasimov and Surovikin after Wagner rebellion?",
    "Russian general Surovikin was sympathetic towards Wagner rebellion, US officials say",
    "As Russia teetered, the elite trembled, and some private jets left",
    "EU leaders to debate Russia mutiny, pledge support for Ukraine",
    "Morning Bid: Fed turns screw, Micron pops",
    "Fed's Powell: Most US policymakers see two or more rate hikes ahead",
    "France unrest: Macron calls crisis meeting after second night of rioting",
    "Healthcare & Pharmaceuticalscategory",
    "Virgin Galactic rocket plane poised for first commercial flight to edge of space",
    "Five doctors backing the US legal case against the abortion pill",
    "Biden tries to flip skeptical Americans on his economic plan",
    "US 2024 hopeful DeSantis targets three federal departments for elimination",
    "Smoke hangs over US Midwest, East, hurting air quality",
    "UK PM Sunak dealt blow as court rules Rwanda deportation plan unlawful",
    "UK panel says Conservatives tried to intimidate members over Boris Johnson ruling",
    "Deep distrust of EU leaves Italy's Meloni in a corner over bailout fund",
    "Spain's potential leftist kingmaker courts voters with shorter workweek pledge",
    "Corruption inquiry in Australia uncovers China links to state lawmaker",
    "Japan, South Korea agree to revive currency swap deal",
    "South Korea picks critic of North's rights record as unification minister",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "Exclusive: U.S. restarts asylum appointments at Mexico border town despite extortion threat",
    "Argentina announces over $1 billion in credit from World Bank, IDB",
    "Mexico's Sheinbaum advances in race for ruling party presidential ticket, polls show",
    "UN expert condemns 'mass deportations' of Haitians fleeing conflict",
    "MLB roundup: Yanks' Domingo German fires perfecto vs. A's",
    "Warner bats through pain to move closer to Sydney farewell",
    "Blackhawks draft Bedard in hopes of turning franchise around",
    "Ageless Djokovic aiming to silence young guns again at Wimbledon",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Muslims around the world celebrate Eid-al-Adha",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Taylor Swift, Ke Huy Quan, Austin Butler join Hollywood's film academy",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]