[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Asian shares slide as traders fret on Fed rates",
    "Bank of Canada hikes rates to 22-year high, more increases expected",
    "Microsoft to offer OpenAI's GPT models to government cloud customers",
    "US trade deficit widens to 6-month high, expected to dent economic growth",
    "Toshiba board recommends shareholders support tender offer by JIP-led consortium",
    "Kim Kardashian, Floyd Mayweather can’t evade EMax crypto investors’ claims, judge says",
    "Lira plunges more than 7% as Turkey edges towards free market",
    "U.S. East Coast blanketed in eerie veil of smoke from Canada fires",
    "Canadian wildfires prompt new evacuations, alarm over air quality",
    "Explainer: What are the health risks from wildfire smoke?",
    "Wildfire smoke from Canada disrupts New York, Philadelphia flights",
    "Ukrainians face homelessness, disease risk as floods crest from burst dam",
    "Frayed nerves and uprooted lives in Russian city close to Ukraine border",
    "Ukraine wary of floating mines, disease spreading after Kakhovka dam collapse",
    "Kakhovka dam breach takes Ukraine war into uncharted territory",
    "Air India says plane carrying passengers stranded in Russia takes off for San Francisco",
    "How Indonesian village aid funds weapons for Papua's rebellion",
    "'I'm going to Miami' - Messi confirms move to MLS",
    "Israeli army mounts rare raid into Palestinian city of Ramallah, clashes ensue",
    "Pence attacks Trump as he challenges his ex-boss in 2024 White House race",
    "Conservative revolt puts US House on pause until next week",
    "Trump lawyers notified that he is the target of classified documents probe",
    "Former JPMorgan executive Staley rejects bank's Jeffrey Epstein accusations",
    "Prince Harry: It would be injustice if court rules I'm not hacking victim",
    "Surgery on pope was successful, doctors say he can travel",
    "UK's Sunak seeks stronger economic ties with U.S. on Washington trip",
    "Head of London's police force apologises to LGBT+ community",
    "Brazil top court justice hands Congress more time to pass bill curtailing Indigenous rights",
    "Mexico foreign minister's departure primed to spark more resignations",
    "El Salvador slashes size of Congress ahead of elections",
    "Chile's conservative assembly begins drafting new constitution",
    "Massive fire as Sudanese factions battle for control of arms factory",
    "Israel considers recognition of Morocco's rule over Western Sahara",
    "Uganda's President Museveni tests positive for COVID -health official",
    "Kenyan police fire tear gas at protesters marching against finance bill",
    "PGA Tour-LIV deal leaves golf world facing plenty of unknowns",
    "Zverev, Swiatek reach French Open semis, heartbreak for Jabeur",
    "MLB, WNBA and NWSL games postponed due to poor air quality in U.S.",
    "Players at Women's World Cup guaranteed at least $30,000 each in FIFA first",
    "Skylines vanish behind wildfire smoke from Canada",
    "Russia evacuates thousands near the Ukraine border",
    "'Transformers': Rise of the Beasts' brings new characters to franchise",
    "Tupac Shakur honored with posthumous star on Hollywood Walk of Fame",
    "Scientists find crocodile 'virgin birth' at Costa Rica zoo",
    "Batman wins EU trademark dispute with Italian designer",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]