[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US consumer spending beats expectations in April; inflation picks up",
    "Analysis: Wall Street prepares for Treasuries mess as default looms",
    "New York City commission votes to halt deposits at Capital One",
    "As US credit risk looms, former S&P officials see 2011 downgrade as vindicated",
    "Global money market funds attract heavy inflows as US debt ceiling looms",
    "Analysis: US airlines gear up for 'Super Bowl' of travel season",
    "Norway targets U.S. oil majors as climate activist resolution boosted at TotalEnergies",
    "Russian attack on Ukrainian clinic kills two and wounds 30, Kyiv says",
    "Japan ramps up Russia sanctions with G7",
    "Russia moves ahead with deployment of tactical nukes in Belarus",
    "Biden, McCarthy looking to close US debt ceiling deal for two years",
    "Morning Bid: Debt deal is near, Fed peak is not",
    "What would happen to a Treasury bill after default? Six key questions",
    "Top US credit rating under watch as debt ceiling talks drag on",
    "Analysis: NATO struggles in the shadows to find new leader",
    "Tear gas taints the air as TotalEnergies annual meeting rejects climate activist resolution",
    "Soaring airline customer complaints push global legislators to act",
    "British cycling federation bars transgender women from competing in female category",
    "Podcast: Who are the Russians fighting Russia?",
    "Far-right Oath Keepers face sentencing over US Capitol attack",
    "DeSantis to stump in early voting states after rocky presidential launch",
    "U.S. warns China could hack infrastructure, including pipelines, rail systems",
    "Biden lauds leadership skills of his pick for top US general",
    "More than 13,000 people in England denied vote due to new ID law, Reuters survey shows",
    "WSJ reporter appeals against extension of detention in Russia",
    "France confirms bird flu vaccination after favourable tests",
    "Killer whales wreck boat in latest attack off Spain",
    "Erdogan defies predictions of political demise ahead of Turkey election runoff",
    "Ten years after Turkey's Gezi protests, some say vote a chance for justice",
    "Turkey election 2023: What's at stake in the runoff?",
    "Kuwait suspends new visas for Philippines workers in rights row",
    "Four dead, suspect arrested in rare shooting in Japan",
    "India gets new parliament building as Modi remakes capital's centre",
    "U.S. mountaineer climbs rare Everest 'triple crown' as death toll reaches 12",
    "South Korea detains passenger after Asiana plane door opened mid-air",
    "In Nadal's absence, new generation set to challenge at wide open Roland Garros",
    "MLB roundup: Braves' Austin Riley belts two 450-foot HRs",
    "Swiatek faces French Open test as new 'Big Three' rivalry emerges",
    "Trial Actually - actor Hugh Grant gets his day in court against Murdoch paper",
    "Beans and violins - orchestra blends classical roots with modern Nigeria",
    "Stars at Cannes take break from red carpet to support AIDS research",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]