[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "India's Go First airline gains bankruptcy protection, moratorium placed on leases",
    "Musk says Twitter to soon allow calls, encrypted messaging",
    "Analysis: Investors' route to post-COVID China is via Europe",
    "Exclusive: CICC Capital bans consulting firm Capvision after China crackdown",
    "Exclusive: Oilfield firm SLB retrenches as Russia sanctions squeeze",
    "Bank of America opens Luxembourg branch in Europe funds push",
    "UBS's future AT1 bond sales could come at a big cost",
    "Trump sexually abused writer E. Jean Carroll, must pay her $5 million, jury says",
    "Six notable moments from Trump's sexual abuse trial",
    "An overview of Donald Trump’s legal troubles",
    "Events leading up to Donald Trump sexual abuse verdict",
    "Yellen heads to G7 with debt ceiling, bank crisis and tax woes in tow",
    "Morning Bid: Markets on hold for US CPI",
    "Supporters of Pakistan ex-PM Khan plan march to capital to protest arrest",
    "How Sudan's paramilitary forces took parts of Khartoum, stormed army chief's quarters",
    "Southeast Asian leaders urge end of Myanmar violence, inclusive talks",
    "Bollywood film on Islamic State recruits sparks debate in India",
    "Toyota sees 10% rise in annual profit after bumper Q4; shares jump",
    "Siemens Healthineers reports lower Q2 profit, discontinues heart surgery robots business",
    "Autos & Transportationcategory",
    "Lackluster results, production target cuts deepen EV start-up gloom",
    "Airbnb forecasts fewer bookings, lower prices in Q2; shares slump",
    "Biden, McCarthy divided over debt ceiling but talks continue",
    "Migrants amass along US-Mexico border as COVID-era restrictions near end",
    "Gunman who killed 8 at Texas shopping mall had 'neo-Nazi ideation,' officials say",
    "Biden's approval rating at 40%, Americans concerned about immigration: Reuters/Ipsos poll",
    "Cooler temperatures offer temporary reprieve for Alberta wildfires",
    "Canada will not be intimidated by China retaliation, PM Trudeau says",
    "Ecuador seals record debt-for-nature swap with Galapagos bond",
    "Pope says Argentina government wanted 'my head' when he was in Buenos Aires",
    "Russia marks Victory Day with new strikes on Ukraine, but pared-back parade",
    "Outbound inspections resume under Black Sea grain deal - UN",
    "UK police express regret over coronation arrest of republican leader",
    "Switzerland holds military drills, its role in European defence in focus",
    "Sudan capital rocked by air strikes, looting",
    "Attack near Tunisia synagogue kills four",
    "Thousands still missing as Congo flood survivors search for relatives",
    "Forest search resumes for Kenyan death cult victims of 'highly organised crime'",
    "Medvedev to focus on more spin, improved sliding on clay",
    "'As long as he's happy', Argentina boss unconcerned about Messi moves",
    "Pegula upset with Madrid organisers after finalists denied speeches",
    "City will be 'unstoppable' at home against Real, says Grealish",
    "Scenes from the coronation of King Charles",
    "Prince Louis at the coronation",
    "In the audience at the coronation",
    "Captagon: the drug fuelling the Gulf party scene - and Syria's finances",
    "You're late on your taxes. Now what?",
    "Factbox: Who qualified in the first Eurovision semi-final?",
    "Halle Bailey 'honored' to play Ariel in 'Little Mermaid' remake",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]