[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "The end of King Dollar? The forces at play in de-dollarisation",
    "US labor market remains tight; profits decline in first quarter",
    "Microsoft chief says deep fakes are biggest AI concern",
    "TikTok tests AI chatbot 'Tako' in the Philippines",
    "OpenAI's Sam Altman raises $115 mln for Worldcoin crypto project",
    "Boeing starts deliveries of reworked 737 jets, flags cash flow goal pressure",
    "Autos & Transportationcategory",
    "Vietnam's VinFast recalls first batch of US-bound EVs over safety risk",
    "Exclusive: From Russia with gold: UAE cashes in as sanctions bite",
    "Russian gold shipments to the UAE, China and Turkey",
    "Ukraine says Russian soldiers replace Wagner in Bakhmut outskirts",
    "Nvidia close to becoming first trillion-dollar chip firm after stellar forecast",
    "Nvidia's results spark nearly $300 billion rally in AI stocks",
    "Nvidia's strong sales forecast attracts attention from retail investors",
    "Nasdaq leads Wall Street rally after Nvidia's bumper forecast",
    "Analysis: Can Ron DeSantis take his Miami miracle national in 2024?",
    "McCarthy says some progress made in US debt ceiling talks with White House",
    "Madeleine McCann search wraps up with slim chance of breakthrough seen",
    "Podcast: Economics 101 - What next for U.S. and Turkey?",
    "US Supreme Court curbs states' property tax 'windfall'",
    "Pfizer's COVID pill Paxlovid gains full FDA approval",
    "Key US Republican Hern says debt-ceiling deal 'likely' by tomorrow afternoon",
    "U.S. Supreme Court rules against EPA in wetlands regulation challenge",
    "Record net arrivals highlight UK's post-Brexit migration dilemma",
    "Spain's mass tourism in candidates' crosshairs in election year",
    "Italy and France look to make amends after political spat",
    "Amsterdam's red light district starts marijuana smoking ban",
    "Taiwan says software problems delaying new F-16 deliveries",
    "North Korea constructing satellite launch pad with 'new urgency' - report",
    "South Korea, US hold largest live-fire drills to respond to 'full-scale' attack",
    "Nepali sherpa with record Everest summits behind him says he'll keep climbing",
    "Analysis: Mexican president ramps up rhetoric, economic intervention as election nears",
    "Ecuador's Lasso seeks 'national agreement' in August elections",
    "Latam 'property tech' startup La Haus to build up digital infrastructure",
    "Bolivia's Catholic Church says it was 'deaf' to sexual abuse victims",
    "Kurds fear Erdogan win amid sharper nationalist rhetoric",
    "Turkey cenbank's net forex reserves negative for first time since 2002",
    "Suez traffic returns to normal after ship briefly stranded",
    "Exclusive: Erdogan party split on economic plan as Turkey runoff looms, sources say",
    "MLB roundup: 8-run inning lifts O's past Yankees",
    "Last of the 'Big Three' standing, Djokovic eyes Grand Slam record",
    "Swiatek braced for tougher path to third Paris title",
    "LaLiga chief Tebas apologises for rant about Vinicius's racism complaint",
    "Mexico's Popocatepetl volcano erupts",
    "Style from the Cannes red carpet",
    "Reflecting on Uvalde: One Year Later",
    "Scientists identify polar cyclone swirling on mysterious Uranus",
    "Tina Turner honoured at lakeside Swiss home where she died",
    "Wim Wenders gets rare Cannes film double bill: 'It will be an experience'",
    "Dubai camel cloning caters to races, beauty pageants",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]