[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Four Colombian children found alive in jungle weeks after plane crash",
    "Annecy knife attack suspect detained, prosecutor says",
    "Sudanese capital quiet as 24-hour ceasefire takes hold",
    "Nine killed in restaurant attack in Somali capital",
    "Pope recovering well from surgery but to skip Sunday blessing",
    "Top Indian wrestler accuses government of silence over sexual harassment probe",
    "Nigeria's security agency detains suspended central bank governor",
    "Trump faces difficult odds in classified-documents case",
    "Trump risked national secrets, prosecutors allege in indictment",
    "Trump documents case: What are the charges and how can he defend against them?",
    "Trump documents case: what happens now after indictment?",
    "Boris Johnson's shock exit reverberates through British ruling party",
    "Decrying 'witch hunt', Boris Johnson resigns from UK parliament",
    "Boris Johnson's honours list includes aides tied to 'Partygate'",
    "UK challenge to COVID inquiry to be heard near the end of June",
    "Ukraine's army reports new gains against Russian forces near Bakhmut",
    "Convicted 'Unabomber' Ted Kaczynski dead at 81",
    "U.S. gives Havana embassy a facelift after years of neglect",
    "Lessons from the original Industrial Revolution",
    "Crispin Odey to leave hedge fund he founded after assault allegations",
    "Activision intervenes in Microsoft challenge to UK regulator's block",
    "Aerospace & Defensecategory",
    "Rheinmetall could be worth 17 billion euros over medium term, CEO says",
    "Analysis: City distances itself from hedge fund boss Odey in tentative #MeToo shift",
    "Wall Street Week Ahead: Investors rethink recession plays, boosting U.S. stock market laggards",
    "Biden administration near deal to preserve preventive care coverage, for now",
    "Biden to hold first 2024 campaign event in Pennsylvania",
    "US Chamber of Commerce sues over government's drug pricing power",
    "Swiatek reigns supreme at French Open by quelling Muchova",
    "Pressure at its peak as Djokovic guns for Major number 23",
    "Factbox: French Open women's singles champion Iga Swiatek",
    "MLB roundup: Pirates win slugfest, extend Mets' skid",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]