[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Nasdaq edges up, S&P 500, Dow decline slightly; more Fed rate hikes in focus",
    "US mulls new export restriction on computing power in AI chips",
    "Activision CEO says gamers would 'revolt' if 'Call of Duty' were made exclusive",
    "Apple stock hits record, on cusp of $3 trillion market value",
    "Exclusive: Nissan installed camera to monitor No. 2's home, sources say",
    "Chocolate-making ingredient cocoa hits highest price in 46 years",
    "Following the George Floyd killing, a Reuters journalist explores his own ties to slavery",
    "Explore the specific ties to slavery among U.S. elite",
    "Learn how to trace your own family history",
    "Exclusive: Wagner mutineers included Russian convicts freed to fight in Ukraine",
    "Exclusive: Top manager at U.S. firm privately sold high-tech in Russia",
    "As Russia teetered, the elite trembled, and some private jets left",
    "Morning Bid: Cold reality of 'higher for longer' sets in",
    "Protester burns Koran at Stockholm mosque on Eid holiday",
    "Pieces of shattered Titanic submersible brought ashore in Canada",
    "Exclusive: Europeans plan to keep ballistic missile sanctions on Iran",
    "Smoke hangs over U.S. Midwest, East, hurting air quality",
    "Biden tries to flip skeptical Americans on his economic plan",
    "Supreme Court of the United Statescategory",
    "For Ketanji Brown Jackson, a self-assured and forceful US Supreme Court debut",
    "US announces charges in $2.5 billion healthcare fraud takedown",
    "In verbal slip, Biden says Putin losing the war in 'Iraq'",
    "Exclusive: U.S. restarts asylum appointments at Mexico border town despite extortion threat",
    "Brazil census shows population growth at its slowest since 1872",
    "Mexico's Sheinbaum advances in race for ruling party presidential ticket -polls",
    "Chile assumes temporary presidency of Pacific Alliance after diplomatic spat",
    "Paris police shooting:  Macron deplores 'inexcusable'  killing of teenager",
    "Twin sisters among 11 killed in Russian attack on Ukraine's Kramatorsk",
    "Harry's phone-hacking lawsuit 'entirely speculative', publisher says",
    "Cheap Russian drone a menace to Ukrainian troops and equipment",
    "US expects more cooperation with India in South China Sea",
    "South Koreans become a year or two younger as traditional way of counting age scrapped",
    "Australian defence minister in Solomon Islands for security talks",
    "Thai protesters acquitted over run-in with queen's motorcade",
    "US women's team to receive courage award for equal pay fight",
    "Miked-up Mourinho handed 10-day suspension for ref criticism",
    "Biles to return to competition in August after two-year hiatus",
    "Brisbane 2032's long lead-in a double-edged sword",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Muslims around the world celebrate Eid-al-Adha",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Taylor Swift, Ke Huy Quan, Austin Butler join Hollywood's film academy",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]