[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall St ends sharply lower on deadlocked debt ceiling talks",
    "After Micron ban, Chinese chip firm CXMT should go on U.S. trade blacklist, top lawmaker says",
    "Purdue Pharma to sell consumer business for $397 mln",
    "Apple inks multi-billion-dollar deal with Broadcom for U.S.-made chips",
    "Analysis: Ford offers investors big bets but finds few takers",
    "U.S. has 'real concern' about Tesla Autopilot driver interaction",
    "EU seeks top court backing in $14 billion tax fight against Apple",
    "Trump criminal trial to start next March, with campaign in full swing",
    "Florida Governor DeSantis to enter 2024 race in Twitter event with Musk",
    "Analysis: To vanquish Trump, DeSantis needs to build an unwieldy coalition",
    "US calls for immediate release of Gershkovich after Russia seeks to extend detention",
    "Ukraine investigating role of Belarus in transfers of children - prosecutor",
    "Russia says it crushes cross-border incursion by 'Ukraine nationalists'",
    "Ukraine launches investigation into Russian commander",
    "Binance commingled customer funds and company revenue, former insiders say",
    "No signs of progress from White House, Republicans in 'tough' debt ceiling talks",
    "From mangoes to luxury watches, Indians look to offload 2,000-rupee notes",
    "Illinois dioceses tolerated decades of abuse by clergy, report finds",
    "After White House truck crash, driver charged with threatening Biden",
    "Justice Thomas' billionaire friend rejects Senate panel over gift list",
    "U.S. House members view Afghanistan cable amid subpoena fight",
    "Exclusive: California seeks EPA approval to ban sales of new gasoline-only vehicles by 2035",
    "Boris Johnson referred to police over possible new COVID rule breaches",
    "Russia extends WSJ reporter's detention by three months, US demands release",
    "Russia's Putin meets Bosnian Serb leader Dodik, hails rise in trade",
    "Belarus leader appears in public, dismisses talk of bad illness",
    "EU, US to seek stopgap standards for AI, EU tech chief says",
    "Google-backed Anthropic raises $450 mln in latest AI funding",
    "Uber partners with Alphabet's Waymo to offer driverless rides",
    "Google to test ads in generative AI search results",
    "New Chinese ambassador to US acknowledges challenges in relations",
    "China opposes trade agreement reached between U.S. and Taiwan",
    "Pakistan's ex-PM Imran Khan questioned on graft charges - lawyer",
    "Last emperor of China's watch sells for record $6.2 mln in Hong Kong auction",
    "Israeli parliament set to approve 2023-24 budget amid protests",
    "Qatar Airways CEO suggests 2050 net-zero goal beyond reach",
    "Turkish opposition calls Erdogan a 'fabricator' over doctored video",
    "Saudi warns speculators of more pain as OPEC+ meeting looms",
    "MLB roundup: Dodgers outslug Braves in series opener",
    "Exclusive: Doping-Education first but drug-testing in gamers' future, says WADA",
    "France prepares its guard against drone strikes, security threats",
    "Spain arrests 7 after racist incidents targeting Vinicius Jr",
    "Battle for Bakhmut: Scenes from the front lines",
    "Man arrested after U-Haul truck crashes near White House",
    "Stars come out for Cannes premiere of Wes Anderson's 'Asteroid City'",
    "HBO's much-hyped 'The Idol' meant to be provocative, says Sam Levinson",
    "Disgraced Australian-born former entertainer Rolf Harris dead at 93",
    "Milan photo exhibition reveals lives of women in Iran",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]