[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Palestinian gunman opens fire at Israeli checkpoint and is shot dead, police say",
    "Blinken called South Korea to discuss China visit; North Korea warns of stronger response",
    "Cathay Pacific flight incident injures 11 in Hong Kong",
    "Pakistan changes FY2024 budget as dictated by IMF to clinch stalled funds",
    "Sierra Leoneans vote in election with cost-of-living centre stage",
    "Argentina political drama heats as election battle lines drawn",
    "Beijing sweats in extreme heat for record third day",
    "Russian helicopters battle Wagner mercenaries rolling toward Moscow",
    "Prigozhin says he and his men won't turn themselves in",
    "Chechen leader offers to help put down Wagner mutiny",
    "Turmoil in Russia: Reactions from foreign governments",
    "US activists rally one year after Supreme Court allowed abortion bans",
    "Republican 2024 hopefuls back abortion limits after Roe v. Wade",
    "Biden slams Republicans on abortion rights a year after Roe repeal",
    "U.S. state abortion legislation to watch in 2023",
    "Canadian safety regulators open probe into fatal loss of Titan submersible",
    "How Christian groups helped parents pull books from some Pennsylvania school libraries",
    "As Canada's wildfires intensify, recruiting firefighters is tougher",
    "Tesla vs. Meta cage fight already has a winner",
    "Special episode: Pride and prejudice – LGBTQ+ around the world",
    "US special counsel seeks delay to start of Trump documents trial until Dec",
    "U.S. attorney general denies allegations that Hunter Biden tax probe was stymied",
    "Hollywood directors ratify labor pact as writers keep picketing",
    "US House panel critical of Twitter probe to question FTC chair at July 13 hearing",
    "Exclusive: Nissan investigates claims CEO put deputy under surveillance",
    "Wall St Week Ahead Lofty valuations on US stocks a growing worry for investors",
    "Forecasts show U.S. earnings decline in second quarter",
    "JPMorgan cuts nearly 40 investment bankers in US",
    "Tsitsipas says comments about Kyrgios 'misinterpreted'",
    "CONCACAF suspends four US, Mexico players after semi-final",
    "MLB roundup: Cycle helps Reds run win streak to 12",
    "Mets to meet Phillies in London in 2024",
    "Our top photos of the week",
    "Fairy-tale return for London ballet company’s ‘Cinderella’",
    "Horses, royals and hats: Britain's Royal Ascot in pictures",
    "Hong Kong's international dragon boat races return after 4-year hiatus",
    "Mexico City holds mass celebration for same-sex weddings, gender ID changes",
    "Officine Generale loosens classic styles at Paris Fashion Week",
    "Dior's Kim Jones sends models rising up from the floor at Paris Fashion Week",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]