[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "North Carolina's Democratic governor to veto 12-week abortion ban, but override likely",
    "Sudan talks to resume in Saudi amid heavy fighting",
    "Israel, Islamic Jihad signal no Gaza truce soon",
    "Cyclone Mocha heads to Bangladesh, Myanmar coasts as thousands flee",
    "Philippine court acquits top critic of ex-president Duterte's 'war on drugs'",
    "Pakistan PM orders those involved in violence tracked down and arrested",
    "Eurovision 2023: Excitement builds for Ukraine-inspired Liverpool final",
    "Podcast: Everything you need to know about Eurovision",
    "A visual guide to Eurovision",
    "EU and US to pledge joint action over China concerns",
    "At G7, a warning about economic outlook as US debt crisis looms",
    "Italy promises full support for Ukraine as Zelenskiy meets pope",
    "How TikTok sensation Squishmallows found Warren Buffett",
    "Podcast: The stakes are high as Turkey votes",
    "Canada's Alberta braces for more wildfires as volatile weather worsens",
    "Russia says Ukraine used Storm Shadow missiles from Britain to attack Luhansk",
    "Ukraine's Zelenskiy to visit Germany on Sunday in bid to shore up support",
    "Rheinmetall and Ukraine's Ukroboronprom form JV to build, repair tanks",
    "Russia's war on Ukraine latest: Ukraine's Zelenskiy visits Italy",
    "Debt ceiling worries deepen as early June U.S. default reinforced",
    "Wendy Sherman, US official who led diplomacy with China and Russia, to retire",
    "U.S. metals magnate Sabin sours on DeSantis, backs Scott in 2024 race",
    "India's opposition Congress set for big win in Karnataka state, defeating BJP",
    "Thai candidates parade through Bangkok before Sunday vote",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "G7 plans new vaccine effort for developing nations, Yomiuri reports",
    "Gaza family flees as home destroyed a second time",
    "US military to bolster defensive posture in Gulf after Iran seizes tankers",
    "Erdogan rival says has evidence of Russia's online campaign ahead of Turkey election",
    "Kenya unearths more bodies in search for death cult followers",
    "A week after Congo floods, volunteers dig through debris for bodies",
    "South Africa rejects U.S. accusations of arms shipment to Russia",
    "Commanders reach agreement to sell franchise to Harris-led group",
    "Real Madrid lose $440 million sponsorship battle with Abu Dhabi fund",
    "Heat become first eighth seed to reach Conference Finals in 24 years",
    "Alcaraz hopes to re-ignite Djokovic rivalry with Rome final meet",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Eurovision 2023: Sweden leads the betting ahead of Finland and Ukraine",
    "BWF approves temporary ban on unplayable 'spin serve'",
    "Filipino priest on mission in Europe to halt fossil fuel financing",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]