[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Washington is determined to govern AI, but how?",
    "Vice Media files for bankruptcy as ad business suffers",
    "Flying car's wind tunnel tests completed by Brazil's upstart Eve",
    "SAP and Microsoft to deepen collaboration on generative AI in recruiting",
    "U.S. Supreme Court spurns dispute over Monsanto class-action settlement",
    "In the Market: Why US regional banks are doomed to a doom loop",
    "Exclusive: Nationalised German energy firms pay traders big bonuses after losing billions",
    "Ukraine hails gains in Bakhmut as Zelenskiy wins more arms in Europe",
    "How Wall Street is preparing for possible US debt default",
    "Biden, Republicans search for outline of debt-limit deal",
    "Biden's budget vs. House debt limit bill on spending, deficits, taxes",
    "Morning Bid: Debt ceiling jitters, Turkey vote, Soros ditches Tesla",
    "For Turkey runoff, potential kingmaker draws red line at concessions to Kurds",
    "Analysis: Tesla’s new car-making process stokes debate among industry experts",
    "Thais cheer poll winner Move Forward as opposition parties agree to coalition",
    "A runoff in Turkey and a rout in Thailand",
    "Pakistan court grants bail to former PM Imran Khan's wife in graft case - lawyer",
    "At least three killed as powerful storm batters Myanmar",
    "Cambodia poll body disqualifies sole opposition party from July election",
    "India's opposition Congress gains key foothold with state election win",
    "U.S. Supreme Court to hear dispute over Democratic bid for Trump hotel documents",
    "Migrant crossings drop at U.S.-Mexico border after Title 42 expires",
    "US Supreme Court takes up bid to revive South Carolina voting map deemed racially biased",
    "Russia says two commanders killed as Kyiv wages Bakhmut offensive",
    "Russia says European armed forces treaty contrary to its security interests",
    "Ukrainian security agency says it suspects tycoon Firtash of embezzlement",
    "Belarus PM replaces Lukashenko at ceremony, sparks speculation",
    "Tractor trailer crash in Mexico kills 26",
    "Argentina's ruling Peronist party wins provincial elections",
    "Ecuador lawmakers re-elect National Assembly president",
    "Argentina plans new rate hike, more FX intervention as inflation soars",
    "Djokovic says 'Big Four' rivalries made him tougher",
    "Fancied Alcaraz stunned by Hungarian qualifier Marozsan in Rome",
    "Korean player held in China in bribery probe - source",
    "MLB roundup: Mets post 8-run inning, whip Nats in Max Scherzer's return",
    "Our top photos of the week",
    "Sweden wins Eurovision song contest",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Zelenskiy collects Charlemagne Prize on behalf of Ukrainian people",
    "Eurovision 2023: Sweden's Loreen wins for a second time",
    "Nepali sherpa becomes world’s second person to scale Everest 26 times",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]