[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Morning Bid: ASIA Slump or recovery in China?",
    "Bridgewater dumps bank stocks amid turmoil in first quarter -filings",
    "Pershing Square unveils new stake in Alphabet",
    "Analysis: Tesla’s new car-making process stokes debate among industry experts",
    "Focus shifts to retailers as U.S. quarterly results hit final leg",
    "Elon Musk loses bid to end SEC 'muzzle' over tweets",
    "Microsoft wins EU antitrust approval for Activision deal vetoed by UK",
    "US on track for June 1 default without debt ceiling hike, Treasury says",
    "Food aid cuts still 'red line' in debt ceiling talks, says Senate farm committee chair",
    "Biden, House Republicans prepare for critical US debt-ceiling talks",
    "How Wall Street is preparing for possible US debt default",
    "Ukraine hails gains in Bakhmut as Zelenskiy wins more weapons in Europe",
    "Ukrainian troops gird for counteroffensive they hope will end war",
    "UN efforts to save Black Sea grain deal to continue in coming days",
    "US sees more indication of Russia, Iran defense cooperation",
    "Turkey's stocks and dollar bonds tumble as Erdogan in pole position for runoff",
    "Elon Musk subpoenaed in Jeffrey Epstein litigation in US Virgin Islands",
    "US special counsel faults FBI's handling of 2016 Trump-Russia probe",
    "DeSantis defunds diversity programs at Florida public colleges",
    "Two staff in U.S. House Democrat's Virginia office attacked with baseball bat",
    "US Supreme Court takes up bid to revive South Carolina voting map deemed racially biased",
    "U.S. Supreme Court to hear dispute over Democratic bid for Trump hotel documents",
    "Rudy Giuliani sued for $10 million by former aide over alleged sexual assault",
    "At least four killed, including suspect, in New Mexico shooting",
    "Canadian PM Trudeau visits Alberta as wildfires rage",
    "Ecuadorean authorities detain former energy minister in bribery probe",
    "Mexico asks Texas to halt costly cargo inspections; will file USMCA complaint",
    "Colombia's ELN guerrilla group warns of peace talks 'crisis'",
    "Ukrainian security agency says it suspects tycoon Firtash of embezzlement",
    "Macron courts Tesla's Musk and others to 'Choose France'",
    "Russia scrambles jet as France, Germany conduct NATO patrols",
    "Air strikes pound Sudan's capital as conflict enters second month",
    "Tunisian judge sentences opposition leader Ghannouchi to year in prison",
    "South Africa can keep coal fired plants running longer, climate committee says",
    "S.Africa's army chief visits Moscow for bilateral talks",
    "MLB roundup: Mets post 8-run inning, whip Nats in Max Scherzer's return",
    "Fancied Alcaraz stunned by Hungarian qualifier Marozsan in Rome",
    "PGA Tour and LIV take feud to PGA Championship",
    "Djokovic says 'Big Four' rivalries made him tougher",
    "In pictures: Turkey faces election runoff",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "'The Time Traveller's Wife' musical to open in London",
    "Cannes director open to letting green activists onto red carpet",
    "Holy cow! Endangered seal draws dozens to Jaffa shore",
    "Kate Winslet, Ben Whishaw win at BAFTA Television Awards",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]