[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall Street ends higher as Powell wraps up testimony",
    "Fracas in Vegas? Musk, Zuckerberg talk cage match in social media bluster",
    "Bankrupt Vice Media plans sale to Fortress Investment-led group",
    "Facebook to end news access in Canada over incoming law on paying publishers",
    "For New Zealand exporters, China both a target and a risk",
    "UPS workers authorize strike, seen as leverage for pay talks",
    "3M reaches tentative $10.3 billion deal over US 'forever chemicals' claims",
    "Titanic sub destroyed in 'catastrophic implosion,' all five aboard dead",
    "Who's on board the missing Titanic sub?",
    "What is the OceanGate Titan submersible and how does it work?",
    "Analysis: Titanic sub victims' families could still sue despite liability waivers",
    "Narendra Modi denies religious discrimination exists in India",
    "Biden, Modi take careful aim at China, Russia in joint statement",
    "US, India agree to terminate six disputes at WTO",
    "Biden, Modi hail new era for US-India ties and tout deals",
    "Morning Bid: Another round of rate hikes, macro data on tap",
    "Ukraine hits bridge linking Crimea to mainland in blow to Russian supply route",
    "Father, aunt helped indicted US Representative George Santos post bail",
    "'Alarming' rise in diabetes expected globally by 2050, study says",
    "Bank of England hikes rates to 5% in surprise move",
    "U.S. House sidelines far-right Republican impeachment vote on Biden",
    "US jobless claims hold at 20-month high, existing home sales tick up in May",
    "'Rust' armorer faces new charge of tampering with evidence",
    "Trump's push for new sex abuse trial is 'magical thinking,' Carroll says",
    "At least 209 Pakistanis were on board migrant boat that sank off Greece, data suggests",
    "Russian Supreme Court rejects Navalny challenge to prison conditions, Mediazona reports",
    "No breakthrough as EU's Borrell holds crisis talks with Kosovo, Serbia leaders",
    "Pope skips speech, blaming breathing difficulties after surgery",
    "Wyoming judge blocks ban on abortion pills -report",
    "Healthcare & Pharmaceuticalscategory",
    "US appeals court vacates travel mask mandate ruling",
    "Regulatory Oversightcategory",
    "Medicare offers details on reimbursement for new Alzheimer's drugs",
    "Bolsonaro clings to his political future as electoral court case begins",
    "Mexico's top court strikes down part of electoral overhaul",
    "Guatemalan ex-first lady Torres polls first in crowded field ahead of Sunday vote",
    "Mexico's heat wave strains energy grid with record demand",
    "Wembanyama era begins as Spurs draft French phenom first overall",
    "International Boxing Association is stripped of its recognition, Olympic Committee says",
    "Alcaraz sails into Queen's Club quarters, Fritz knocked out",
    "Marquez says commitment to Honda is 'maximum' amid exit rumours",
    "Our top photos of the week",
    "India's Prime Minister Modi visits Washington",
    "Horses, royals and hats: Britain's Royal Ascot in pictures",
    "Kesha settles producer Dr. Luke's defamation lawsuit over rape accusation",
    "Givenchy shows dressy tailoring for men at Paris Fashion Week",
    "Study reveals how immune system of astronauts breaks down",
    "Dutch weigh law to ban cruelly overbred pets",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]