[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Vatican chastises bishops who stoke division on social media",
    "Shanghai breaks more than century-old heat record in sweltering May",
    "Polish president signs 'Tusk Law' on undue Russian influence",
    "NATO soldiers deploy in Kosovo clashes with Serb protesters",
    "Spain's Sanchez gambles on snap election after regional ballot rout",
    "Heavy clashes in Sudan's capital as truce set to expire",
    "Teenager charged with 19 murders in Guyana school dormitory fire",
    "Russia hits military facility in Ukraine in new wave of strikes",
    "Dismissing Russian criticism, U.S. Senator Graham praises Ukrainian resistance",
    "Belarus's Lukashenko says there can be 'nuclear weapons for everyone'",
    "Denmark plans $2.6 bln more for Ukraine, Zelenskiy praises 'major contribution'",
    "Analysis: Debt deal welcomed by investors, though risks loom",
    "Explainer: What is the U.S. debt ceiling?",
    "Biden and McCarthy's bumpy journey to a debt ceiling deal",
    "Inside South Korea's race to become one of the world’s biggest arms dealers",
    "Uganda enacts harsh anti-LGBTQ law including death penalty",
    "Japan puts missile defences on alert as North Korea warns of satellite launch",
    "Turkey's Kilicdaroglu faces the heat after election loss to Erdogan",
    "Wildfire in Canada's Halifax leads to evacuation orders for thousands of homes",
    "US House Rules panel to meet Tuesday on debt ceiling bill",
    "Eighth person rescued from collapsed building in Iowa; fatalities unlikely",
    "Man charged with murder after 3 dead in New Mexico biker shootout",
    "IRS funding cut won't hurt near-term tax collection, officials say",
    "Venezuela's Maduro meets Lula on first visit to Brazil since 2015",
    "Alberta heads to the polls with Canada's green agenda in balance",
    "Mexico rulers tipped to win historic state election as presidency race looms",
    "Former Canadian soldier extradited to Thailand over gang killing",
    "In the Market: Amid the calm, the Fed brews the next storm",
    "Aerospace & Defensecategory",
    "India files graft case against BAE Systems, Rolls-Royce",
    "European shares slip, but debt ceiling deal buoys U.S. futures",
    "Musk expected to visit China this week, meet officials - sources",
    "Hong Kong media tycoon Jimmy Lai loses bid to terminate national security trial",
    "Philippines, U.S., Japan to hold first-ever joint coast guard exercise",
    "Japan PM Kishida says his son to quit as aide after 'inappropriate' behaviour",
    "From highs to lows, Everest record breaker sees 'no future' in Nepal",
    "Djokovic canters into French Open round two as Stephens lays down marker",
    "Stephens puts down marker on 'favourite court in the world'",
    "MLB roundup: Rays win shootout, take series from Dodgers",
    "Racist abuse of players is getting worse, says Stephens",
    "Memorial Day across America",
    "Style from the Cannes red carpet",
    "Italy's La Scala to open new season with Verdi classic",
    "NASA looks to spice up astronaut menu with deep space food production",
    "On a culinary homecoming, influencer chefs look to perpetuate Palestinian dishes",
    "Plastic recycling in focus as treaty talks get underway in Paris",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]