[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Foxconn dumps $19.5 bln Vedanta chip plan in blow to India",
    "Analysis: New anti-ESG rule in Missouri offers US Republicans another path away from 'wokeness'",
    "Countries repatriating gold in wake of sanctions against Russia, study finds",
    "Iraq, TotalEnergies sign massive oil, gas, renewables deal",
    "Analysis: U.S. crypto lobbyists court Democrats in fresh legislative push",
    "Standard Chartered bumps up bitcoin forecast to $120,000",
    "Citigroup downgrades US stocks amid recession risks, upgrades Europe",
    "World's war on greenhouse gas emissions has a military blind spot",
    "Exclusive: Accounting for war - Ukraine's climate fallout",
    "Putin held post-mutiny talks with Wagner leader Prigozhin and his fighters - Kremlin",
    "Kremlin says Putin held post-mutiny talks with Wagner leader as top general resurfaces",
    "Ukraine says its troops advance in east and south, make gains near Bakhmut",
    "Poland detains Russian spy, says interior minister",
    "Morning Bid: Bruised bonds relying on disinflation",
    "The manufacturing backlash: No factory in my backyard",
    "EU probes Novo Nordisk drugs after reports of suicidal thoughts",
    "Fresh spending showdown looms as US Congress returns to Washington",
    "Podcast: Cluster bomb disputes as Biden in Europe for NATO summit",
    "Biden meets King Charles and PM Sunak ahead of NATO summit",
    "Erdogan links Sweden's NATO membership to Turkey's EU accession",
    "What would happen if Ukraine joined NATO?",
    "Heavy rains wash across U.S. Northeast, catastrophic flooding possible",
    "Ron DeSantis supports revoking China's trade status",
    "Ex-USA Gymnastics doctor Nassar stabbed in prison, stable -AP",
    "Germany sends troops to Australia in a first as Berlin shifts focus to Indo-Pacific",
    "China kindergarten attack kills six, sparks safety worries",
    "Torrential rain, floods kill 22 across northern India",
    "North Korea warns it may shoot down US spy planes violating its airspace",
    "Western allies fine-tune security assurances for Ukraine as NATO meets",
    "Bucharest declaration: NATO's Ukraine debate still haunted by 2008 summit",
    "Dutch PM Rutte says he won't run for fifth term in office",
    "Kevin Spacey is a sexual 'predator', alleged victim tells UK court",
    "Hunger haunts Ethiopia's Tigray region after years of war",
    "Nigerian President Tinubu chosen as new West Africa bloc chief",
    "Senior US diplomat to travel to Addis Ababa to discuss Sudan conflict",
    "Gabon President Bongo to run for re-election in August",
    "American Keys ends Russian teenager Andreeva's dream run to reach quarters",
    "Azarenka booed off court for failing to offer Svitolina obligatory handshake",
    "Svitolina comes out on top in blockbuster battle with Azarenka",
    "Haute couture week in Paris",
    "Margot Robbie 'shocked' by fan fervour before 'Barbie' film release",
    "Homeless World Cup brings its message of hope to California",
    "U.S. forward Rapinoe to retire after current season",
    "Canadian farmer's thumbs-up emoji leads to $62,000 fine for undelivered flax",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]