[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Air strikes hit Sudanese capital, killing 17 including 5 children",
    "Spanish charity rescues 117 migrants sailing from Libya",
    "Teachers in England to strike for two more days in July",
    "Tunisian judge bars broadcast media from opposition conspiracy cases",
    "Russian missile kills two in Ukraine's Kharkiv region, governor says",
    "Saudi Arabia urges improved maritime security in Gulf as ties with Iran resume",
    "Barcelona gets Socialist mayor in consolation for prime minister Sanchez",
    "Putin lectures African leaders seeking to mediate in Ukraine",
    "Ukraine tells African leaders no peace talks with Russia",
    "Putin says Russia put nuclear bombs in Belarus as warning to West",
    "Russia is highly likely behind Ukraine dam collapse, experts say",
    "For groups fighting U.S. opioid crisis, settlement money can be hard to come by",
    "US drug overdose deaths top 109,000 in the past year",
    "US will 'make every effort' to boost cooperation with China on fentanyl",
    "Purdue Pharma can protect Sackler owners in opioid bankruptcy",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Greece boat disaster: A Pakistani father's anguish over his missing son",
    "Binance, SEC strike deal to keep US customer assets in country",
    "Militants kill 37, abduct six others in attack on Ugandan school",
    "How a Canada Supreme Court ruling could affect U.S.-Canada refugee flows",
    "Exclusive: Blackstone's Horizon head Scott Bommer to leave company",
    "Japan to open up Apple- and Google-dominated phone apps to competition",
    "Wall St Week Ahead Investor skepticism turns to optimism as U.S. stock rally rolls on",
    "Exclusive: Twitter to focus on video, commerce in business revamp",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Abortion remains legal in Iowa as top court refuses to revive ban",
    "ATP roundup: Frances Tiafoe reaches Stuttgart final",
    "WTA roundup: Russian stars to clash in Dutch final",
    "Fowler leads as U.S. Open third round gets underway",
    "Verstappen puts Red Bull back on top in final practice",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Seoul hosts large crowds as BTS fans celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]