[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "China's Micron ban highlights chipmakers' dilemma as Sino-U.S. tensions grow",
    "Judge throws out shareholder lawsuit against Elon Musk over Twitter buyout",
    "Bill Gates says top AI agent will replace search, shopping sites",
    "US will not award $200 mln grant for Microvast battery company -source",
    "Japan's factory activity expands for first time in 7 months - PMI",
    "JPMorgan's Dimon says has same intensity for job, confident in management",
    "OpenAI is exploring collective decisions on AI, like Wikipedia entries",
    "Biden, McCarthy meeting ends with no deal on debt ceiling",
    "Treasury confirms U.S. default as early as June 1 without debt ceiling hike",
    "Podcast: Is a debt ceiling deal possible?",
    "Explainer: What happens if Washington falls behind on its bills?",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Florida restaurant sues DeSantis over drag show restrictions",
    "Florida sued for barring Chinese citizens from owning homes, land",
    "Turkey's third-place candidate endorses Erdogan in runoff",
    "E. Jean Carroll seeks $10 mln in damages from Trump over post-verdict statements",
    "Western states reach 'historic' deal to help save Colorado River",
    "Driver detained after truck crashes into barriers near White House",
    "Russia fights cross-border raid that Ukraine says is Russian opposition",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "TikTok sues Montana after state bans app",
    "Striking Hollywood writers lament residuals slide",
    "Judge tosses out some claims in Abbott baby formula litigation",
    "US FDA approves Opiant's spray for reversing opioid-related overdoses",
    "Novo Nordisk, Pfizer weight-loss pills work as well as shots",
    "South Africans blame city as cholera cases rise",
    "Peru judge orders Kuczynski graft probe to be redone in reprieve for former president",
    "School dormitory fire in Guyana may have been arson, police say",
    "Mexico to announce work visa program for Central Americans",
    "Brazil economists lower inflation forecasts, but still too high for central bank",
    "Exclusive: Paris 2024 hoping for Olympic flame on Eiffel Tower",
    "Woods withdraws from U.S. Open while recovering from surgery",
    "French Open offers players tool to filter out online abuse",
    "Lights go out at Rio's Christ the Redeemer in support of Vinicius Jr",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Director of Cannes' first Sudanese film: I walk red carpet as people flee bullets",
    "South African fossils reveal ancient beast's epic journey to oblivion",
    "The Weeknd, Lily-Rose Depp draw screaming fans to 'The Idol' premiere",
    "'Firebrand' puts spotlight on Henry VIII's sixth wife",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]