[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Tesla raises US prices for all its vehicles except Model 3",
    "UK economy grows in Q1 but March drop underscores fragility",
    "Toyota says more than 2 million face risk of vehicle data leak in Japan",
    "Tesla to recall over 1.1 mln foreign and China-made cars - Chinese regulator",
    "Fed's Bowman calls for external review of Silicon Valley Bank oversight",
    "Audit finds holes in ECB's management of bank credit risk",
    "Fed's Bowman: more policy tightening likely appropriate",
    "Legal challenges threaten Biden's border plan as Title 42 ends",
    "Rights group sues over Biden rule curbing asylum at U.S.-Mexico border",
    "Colombian migrants deported from U.S. tell of disappointment",
    "G7 finance heads face tricky trade-off in debating steps to counter China",
    "Elon Musk says he has found new Twitter CEO",
    "Former Pakistan PM Khan appears in court as supporters clash with police",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: Wegovy, other weight loss drugs ‘no silver bullet’, says WHO amid obesity review",
    "Former NBA star Howard stirs Chinese anger by calling Taiwan a country",
    "US judge strikes down federal law barring handgun sales to those under 21",
    "Erdogan rival accuses Russia of 'deep fake' campaign ahead of presidential vote",
    "Turkey's Erdogan, master campaigner, faces toughest contest yet",
    "Israel kills senior Gaza commanders as rockets cause first death in Israel",
    "Turkey says deal extending Black Sea grain deal nearing",
    "Rise of Thailand’s youth party reflects still potent protest demands",
    "What you need to know about Thailand's election",
    "Election promises of Thailand's major parties",
    "Who are the main contenders for Thailand's next leader?",
    "Liftoff: Modi's space push for India counts on private players",
    "Philippine court acquits top critic of ex-president Duterte's 'war on drugs'",
    "U.S., China look to move beyond balloon incident to stabilize ties",
    "Apple to open first online shop in Vietnam in a push to emerging market",
    "EU plans to tweak China policy but keep balanced approach",
    "'Risky jurisdiction': Aircraft lessors raise alarm over Go First crisis in India",
    "Chinese foreign minister to visit Australia - South China Morning Post",
    "What sparked ethnic clashes in India's Manipur",
    "Biden, McCarthy debt ceiling meeting postponed, spending cuts on table",
    "U.S. House passes Republican bill tightening border security",
    "Former US Marine to be charged in choking death on New York subway",
    "New York sues company that sold accessory for Buffalo mass shooter's gun",
    "Mexico cooperating with U.S. to avoid chaos at border as Title 42 ends",
    "Canadian military deployed to help fight Alberta wildfires",
    "Mexico to launch database of over 100,000 'disappeared' people",
    "In Bakhmut's ruins, Ukraine says intensity of Wagner attacks growing",
    "Switzerland evacuates village threatened by vast rockfall",
    "Russia denies reports of Ukrainian breakthroughs along front lines",
    "EU lawmakers want more talks to strengthen proposed US data transfer pact",
    "Our top photos of the week",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Hollywood writers try to strike a love match while picketing",
    "Mexican artistic team keep Olympic dream alive by selling towels and swimsuits",
    "Eurovision 2023: From flags to food, Liverpool embraces Ukraine",
    "Hobbit houses spring up in Bosnia hills",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]