[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Sudan ceasefire deal raises hopes for relief in Khartoum",
    "Pro-government rally in Moldovan capital draws tens of thousands",
    "Cholera outbreak claims ten more lives in South Africa",
    "Mount Etna eruption halts flights to Sicily's Catania airport",
    "Estonia and Latvia look to purchase mid-range air defence from Germany",
    "Far-right minister says Israel 'in charge' during visit to Jerusalem holy site",
    "Animal health body backs bird flu vaccination to avoid pandemic",
    "At G7, Zelenskiy says Bakhmut destruction has echoes of Hiroshima",
    "Biden unveils new $375 million military aid package for Ukraine",
    "Biden sees shift in ties with China 'shortly'",
    "Jeddah, sleep and a French plane: How Zelenskiy got to Japan",
    "Biden and McCarthy to meet on Monday as debt ceiling talks resume",
    "Yellen says June 1 is 'hard deadline' for raising debt ceiling",
    "White House, Republicans trade barbs as debt talks paused",
    "Could Biden use the 14th Amendment to raise the debt ceiling?",
    "Ukraine aims to encircle Bakhmut as Russia says it captures city",
    "Greece's ruling Conservatives win vote but fall short of majority",
    "Alberta wildfire fighters hope rain, cooling bring relief",
    "AI boom could expose investors’ natural stupidity",
    "China fails Micron's products in security review, bars some purchases",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "'Killers of Flower Moon' star says Native Americans need allies like Scorsese",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Warner Bros Discovery chief booed at Boston University graduation, videos show",
    "Morgan Stanley CEO succession underscores Wall Street's diversity gap",
    "Analysis: Vodafone's new CEO faces tough calls to reconnect with investors",
    "Fed's Kashkari open to holding rates steady in June, WSJ reports",
    "Man City celebrate Premier League title with 1-0 win over Chelsea",
    "Medvedev outclasses Rune in Rome to capture first title on clay",
    "Andy Murray pulls out of French Open",
    "Koepka leads as PGA Championship set for final round shootout",
    "Trevi Fountain water turns black in Rome climate protest",
    "Italy's Meloni vows support for flood-hit Emilia-Romagna",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "'May December' director: women pay higher price than men for breaking rules",
    "Jennifer Lawrence-produced Afghan documentary premieres at Cannes",
    "Cate Blanchett dons habit in Australian director's conversion tale",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]