[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Airbus wins historic 500-plane IndiGo order",
    "Berlin, Intel strike deal on $33 billion chip plant after months of subsidy talks",
    "Exclusive: Japan regulator sounded out top domestic banks about China risks, sources say",
    "Chile's Codelco must kick-start lithium industry while reviving copper output",
    "Stocks rally stalls, eyes on Powell testimony for US rate clues",
    "Goldman Sachs cuts China growth forecast as property slowdown bites",
    "Oil falls amid China growth uncertainties",
    "Xi, Blinken agree to stabilise U.S.-China relations in rare Beijing talks",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Podcast: Blinken meets Xi and Chinese bankers rein it in",
    "Their parents made China the world's factory. Can the kids save the family business?",
    "Ukraine says eight villages retaken from Russian forces in two weeks",
    "Ukraine targets initial $40 billion for 'Green Marshall Plan'",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "How is Ukraine’s counter-offensive going so far?",
    "Israeli troops, backed by helicopter, kill 5 Palestinians in clash",
    "Defence, critical tech on agenda as India's Modi heads to US for landmark visit",
    "With scores missing from shipwreck, family members flock to Greek migrant camp",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Paris air show returns with jets and missiles in demand",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Affirmative action, student debt rulings loom at US Supreme Court",
    "US judge orders Trump lawyers not to release evidence in documents probe",
    "Biden will announce $600 million in climate investments during California trip",
    "UK lawmakers set to back report that Boris Johnson misled them over 'partygate'",
    "Russia bars media from new \"extremism\" case against Navalny",
    "Kerry meets Pope Francis privately, says he's in great form and spirits",
    "Former PM Cameron says Britain was prepared for flu-like pandemic rather than COVID",
    "UN rights chief seeks to establish presence in China and India",
    "Thai parliament to convene soon as poll body endorses election result",
    "Hong Kong tycoon Jimmy Lai loses appeal against phone search",
    "Scores die in northern India as heat wave scorches region",
    "Man City chairman Al Mubarak says he has \"strong views\" on Premier League charges",
    "Verstappen took chequered flag with dead bird on board",
    "Kyrgios pulls out of Halle with knee injury, hopes to play at Wimbledon",
    "Hollywood ending for U.S. Open champion Clark",
    "Americans mark Juneteenth with marches, music and reflection",
    "News junkies turn to TikTok to chart new paths in media",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Coffee research group progresses on naturally decaffeinated varieties",
    "Ticketmaster, others agree to upfront, all-in prices as part of Biden war on junk fees",
    "Saturn's icy moon Enceladus harbors essential elements for life",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]