[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "North Carolina's Democratic governor to veto 12-week abortion ban, but override likely",
    "Israel, Islamic Jihad signal no near-term Gaza truce",
    "Cyclone Mocha heads to Bangladesh, Myanmar coasts as thousands flee",
    "Philippine court acquits top critic of ex-president Duterte's 'war on drugs'",
    "Pakistan PM Sharif orders those involved in violence tracked down and arrested",
    "India's opposition Congress set for big win in Karnataka state, defeating BJP",
    "How TikTok sensation Squishmallows found Warren Buffett",
    "EU and US to pledge joint action over China concerns",
    "At G7, a warning about economic outlook as US debt crisis looms",
    "Italy confirms backing for Ukraine as Zelenskiy prepares to meet pope",
    "Griner plays in WNBA for first time since Russia detention",
    "Podcast: The stakes are high as Turkey votes",
    "Canada's Alberta braces for more wildfires as volatile weather worsens",
    "Thai candidates parade through Bangkok before Sunday vote",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "G7 plans new vaccine effort for developing nations, Yomiuri reports",
    "Debt ceiling worries deepen as early June U.S. default reinforced",
    "Wendy Sherman, US official who led diplomacy with China and Russia, to retire",
    "U.S. metals magnate Sabin sours on DeSantis, backs Scott in 2024 race",
    "Gaza family flees as its home is destroyed a second time",
    "US military to bolster defensive posture in Gulf after Iran seizes tankers",
    "Erdogan rival says has evidence of Russia's online campaign ahead of Turkey election",
    "Sudan talks to resume in Saudi amid heavy fighting",
    "Kenya unearths more bodies in search for death cult followers",
    "A week after Congo floods, volunteers dig through debris for bodies",
    "South Africa rejects U.S. accusations of arms shipment to Russia",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: Wegovy, other weight loss drugs ‘no silver bullet’, says WHO amid obesity review",
    "FDA issues marketing denial for 6,500 flavored e-cigarettes",
    "US FDA advisers narrowly back Sarepta's Duchenne gene therapy for accelerated approval",
    "Commanders reach agreement to sell franchise to Harris-led group",
    "Heat become first eighth seed to reach Conference Finals in 24 years",
    "Alcaraz hopes to re-ignite Djokovic rivalry with Rome final meet",
    "Ten Hag confident top players want to join Man Utd",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Eurovision 2023: Sweden leads the betting ahead of Finland and Ukraine",
    "BWF approves temporary ban on unplayable 'spin serve'",
    "Filipino priest on mission in Europe to halt fossil fuel financing",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]