[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Six questions facing US stock investors as 2023's second half nears",
    "Exclusive: Morgan Stanley board considers next CEO while Gorman clears the decks",
    "Imerys to produce lithium in UK for EV batteries",
    "Fed's Powell: Most US policymakers see two or more rate hikes ahead",
    "Analysis: Dollar drought haunts frontier economies",
    "Crunch time in FTC fight against Microsoft deal to buy Activision",
    "How should slavery and its legacy be taught in classrooms?",
    "Explore the specific ties to slavery among U.S. elite",
    "How to overcome challenges in Black genealogy",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Where are Russian generals Gerasimov and Surovikin after Wagner rebellion?",
    "Russian general Surovikin was sympathetic towards Wagner rebellion, US officials say",
    "As Russia teetered, the elite trembled, and some private jets left",
    "Satellite images appear to show build-up at Wagner base in Belarus",
    "Morning Bid: Fed turns screw, Micron pops",
    "France unrest: Riots spread, police officer charged with shooting teenager dead",
    "Healthcare & Pharmaceuticalscategory",
    "US 2024 hopeful DeSantis targets three federal departments for elimination",
    "Podcast: French police's controversial powers and the Hollywood strike's impact",
    "US abortion pill access could hinge on whether doctors had right to sue",
    "Five doctors backing the US legal case against the abortion pill",
    "Smoke hangs over US Midwest, East, hurting air quality",
    "UNESCO member countries ready to welcome US back to organisation",
    "UK PM Sunak dealt blow as court rules Rwanda deportation plan unlawful",
    "Greek leftist leader Tsipras resigns as Syriza party leader",
    "Deep distrust of EU leaves Italy's Meloni in a corner over bailout fund",
    "Spain's potential leftist kingmaker courts voters with shorter workweek pledge",
    "Meta oversight board urges Cambodia prime minister's suspension from Facebook",
    "Corruption inquiry in Australia uncovers China links to state lawmaker",
    "Japan, South Korea revive currency swaps as icy relations slowly thaw",
    "South Korea picks critic of North's rights record as unification minister",
    "Analysis: Canada pressured by allies to up military spending",
    "Exclusive: U.S. restarts asylum appointments at Mexico border town despite extortion threat",
    "Argentina announces over $1 billion in credit from World Bank, IDB",
    "UN expert condemns 'mass deportations' of Haitians fleeing conflict",
    "MLB roundup: Yanks' Domingo German fires perfecto vs. A's",
    "Warner bats through pain to move closer to Sydney farewell",
    "Blackhawks draft Bedard in hopes of turning franchise around",
    "Ageless Djokovic aiming to silence young guns again at Wimbledon",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Muslims around the world celebrate Eid-al-Adha",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Spanish researchers aim to 'trick nature' with artificial womb",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "Taylor Swift, Ke Huy Quan, Austin Butler join Hollywood's film academy",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]