[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Analysis: Private equity steps up lending as US banks pull back",
    "Regulators dust off rule books to tackle generative AI like ChatGPT",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "House swaps and dog walks: Travelers find cheaper alternatives to lodging",
    "JPMorgan expects $3 bln income boost from First Republic deal",
    "Ford signs battery material supply deals to charge up EV output",
    "Applied Materials to invest $4 bln in Silicon Valley chip research center",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Podcast: Is a debt ceiling deal possible?",
    "Fresh round of debt ceiling talks kick off as US default worries grow",
    "How Wall Street is preparing for possible US debt default",
    "Morning Bid: Tech politics, debt cap brinkmanship",
    "Meta hit with record $1.3 bln fine over data transfers",
    "Ukraine says it advances on Bakhmut's flanks to entrap Russians",
    "China's Micron ban revives US trade tensions, fuels Asian chip rally",
    "Kansas farmers abandon wheat fields after extreme drought",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Republican U.S. Senator Tim Scott poised to make White House bid official",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Could Biden use the 14th Amendment to raise the debt ceiling?",
    "Idaho college murders suspect to appear in court after indictment",
    "Mitsotakis gunning for outright victory in Greek second vote",
    "Belarusian blogger arrested on Ryanair flight pardoned - state media",
    "EU Parliament delays renewable energy vote after late backlash",
    "UK PM Sunak speaks to ethics adviser over minister's speeding offence",
    "Indian court issues summons to BBC in defamation case over Modi documentary",
    "Riding on G7 success, Japan PM Kishida eyes early election",
    "Taiwan excluded from WHO annual assembly following Chinese opposition",
    "Thai alliance aims for ambitious reforms but not on royal insult law - draft",
    "Exclusive: Olympics-Paris 2024 hoping for Olympic flame on Eiffel Tower -source",
    "Real Madrid lodges hate crime complaint over Vinicius incident",
    "MLB roundup: Surging Cardinals down Dodgers for fourth straight series win",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Michelle Yeoh introduces mythological heroes in TV show 'American Born Chinese'",
    "Former tennis pro helps children shine on court in Cameroon",
    "'Firebrand' puts spotlight on Henry VIII's sixth wife",
    "'May December' director: women pay higher price than men for breaking rules",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]