[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "China's Huawei poised to overcome US ban with return of 5G phones - research firms",
    "27% of jobs at high risk from AI revolution, says OECD",
    "Asian shares rise, dollar dips as traders await US inflation data",
    "IBM mulls using its own AI chip in new cloud service to lower costs",
    "World's biggest gallium buyer says clients stockpiling",
    "India's Wipro commits $1 bln investment into AI",
    "Japan's wholesale inflation slows for 6th straight month",
    "Vermont capital submerged in floodwaters with dam on verge of capacity",
    "Canadian lake sediments reveal start of Earth's Anthropocene age, scientists say",
    "Zelenskiy to meet NATO leaders after membership timeline rebuff",
    "What would happen if Ukraine joined NATO?",
    "Russian ex-submarine officer on Ukraine blacklist gunned down",
    "Ukraine, Russia report heavy fighting in east, south",
    "Analysis: Turkey sets new Western tilt in foreign policy as economy weighs",
    "Smart girls don’t marry? Japan rushes to erase stigma for women in science",
    "North Korea fires long-range missile ahead of S.Korea, Japan meeting",
    "US says it no longer deems Donald Trump immune from E. Jean Carroll lawsuit",
    "Manson follower Leslie Van Houten released from California prison",
    "S.Korea opposition lawmakers want more experts to review Fukushima discharge plan",
    "China lashes back at NATO criticism, warns it will protect its rights",
    "Wanted Hong Kong activist's relatives taken for questioning by police",
    "Australia cabinet will soon decide on next RBA governor - treasurer",
    "Senate Republican Tuberville calls white nationalists racist after taking heat",
    "Iowa state House advances six-week abortion ban in special session",
    "Biden's pick for top US general warns on Republican blocking promotions",
    "U.S. students trailing pre-pandemic learning levels, new study shows",
    "NATO summit declaration says \"Ukraine's future is in NATO\"",
    "Russia's Medvedev: NATO's military aid to Ukraine brings World War Three closer",
    "UK to provide $65 mln support package to Ukraine",
    "Spanish coastguard rescues two Nigerian migrants from ship's rudder",
    "Israel protests flare over Netanyahu's new Supreme Court bill",
    "Israel's disputed judicial overhaul is back, what's new?",
    "Iraq's ancient sites, fragile stability spur new trickle of tourists",
    "Dubai property prices surge at fastest pace since 2014",
    "Djokovic relieved to survive Rublev dogfight",
    "Rublev grateful for Wimbledon support, wants end to 'terrible' Ukraine situation",
    "Ukraine's Wimbledon semi-finalist Svitolina has no time to lose",
    "Sinner says improved physicality, top-10 mentality fuels Grand Slam push",
    "Torrential rain floods streets in New Delhi",
    "Ice cream inspired by Thai temple tiles cools admiring tourists",
    "Timothee Chalamet debuts as Wonka in prequel's first trailer",
    "Sibling around-the-world aviators set another youth record",
    "South Korean zoo welcomes giant panda twins",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]