[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Foxconn eyes India chipmaking incentives after quitting $19.5 billion JV",
    "Meta's Twitter rival Threads surges to 100 million users faster than ChatGPT",
    "Credit Suisse crash investigated by Swiss lawmakers",
    "Amazon dangles deeper 'Prime Day' discounts for stressed US shoppers",
    "Cryptoverse: Hungry exchanges fight for slice of American pie",
    "IEA says critical minerals supply could pull close to demand by 2030",
    "Autos & Transportationcategory",
    "Geely, Renault strike deal to develop gasoline engines, hybrid technology",
    "LIVE: World leaders arrive for NATO summitcategory",
    "NATO head eyes 'strong message' on Ukraine's membership bid at summit",
    "Turkey gives green light to Swedish NATO membership bid",
    "Reactions to Turkey backing Sweden's NATO entry",
    "What's on the table for NATO at Vilnius summit?",
    "Russian drones attack Kyiv and Odesa hours before NATO summit",
    "Wagner fighters neared Russian nuclear base during revolt",
    "UK wage growth matches record high, keeping BoE under pressure",
    "China's foreign minister to miss ASEAN meeting for health reason",
    "Protesters block Israel highways over new Supreme Court bill",
    "China gallium curbs raise chip questions for future EV models",
    "Indonesia seizes Iranian-flagged tanker suspected of illegal oil transshipment",
    "ASEAN chair urges unity as top diplomats meet amid Myanmar discord",
    "North Korea accuses U.S. of repeatedly entering its economic zone",
    "Thailand's monarchy looms over battle for prime minister",
    "Taliban halt Swedish activities in Afghanistan after Koran burning",
    "Heavy rain in southern Japan leaves up to six dead, 3 missing",
    "Japan's changing views on price hikes open door for BOJ policy tweak",
    "Hong Kong plans widespread ban of Japanese sea products",
    "Factbox: Troubles of Indian tycoon Anil Agarwal's Vedanta mount as Foxconn ditches JV",
    "Toilet limits for transgender woman 'unacceptable' - Japan's top court",
    "US House hardliners step up spending pressure as showdown looms",
    "Flash floods rage in Vermont, New York; 50 rescued by swift boat",
    "Trump seeks to delay trial in Mar-a-Lago documents case",
    "Judge orders Kansas to stop gender changes on driver's licenses",
    "Spain rescues boat with 86 migrants, hundreds likely still missing",
    "UK government offers concessions over contested immigration plan",
    "BBC sex photo claims are 'rubbish', young person's lawyer tells broadcaster",
    "Spain 2023 election: PM Sanchez and rival Feijoo in chaotic live TV debate",
    "Israel's disputed judicial overhaul is back, what's new?",
    "U.S. says to move forward with transfer of F-16 jets to Turkey",
    "Lebanon PM will not extend central bank governor's mandate",
    "Iraq's ancient sites, fragile stability spur new trickle of tourists",
    "Eubanks soaks in 'whirlwind' run through Wimbledon",
    "Swiatek continues hunt for maiden grasscourt title in Svitolina clash",
    "Hungry Alcaraz powers past Berrettini into quarter-finals",
    "Rune's stature keeps growing as he downs Dimitrov to reach Wimbledon quarters",
    "Johannesburg has first snowfall in over a decade",
    "South Korean zoo welcomes giant panda twins",
    "Alien planet with metallic clouds resembles 'a giant mirror in space'",
    "Margot Robbie 'shocked' by fan fervour before 'Barbie' film release",
    "'Anne of Green Gables' producers end legal fight with author's heirs",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]