[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Wall Street declines after Home Depot outlook, US retail sales",
    "Tesla kicks off annual meeting, where succession, demand in focus",
    "California's cannabis firms band together to address credit woes",
    "U.S. charges Apple ex-employee for trying to steal technology, fleeing to China",
    "Cryptoverse: Every frog has its day as pepe pops 7,000%",
    "EU states approve world's first comprehensive crypto rules",
    "Capital One shares rebound after Warren Buffett makes near $1 bln bet on bank",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "How bats could be the cause of the next global pandemic",
    "We may never know where the COVID pandemic originated",
    "How Reuters pinpointed bat-virus risk zones worldwide",
    "Biden, McCarthy debt ceiling meeting starts as Australia trip in limbo",
    "US default could trigger recession, Yellen says",
    "Biden's budget vs. Republican debt ceiling bill on spending, deficits",
    "Three in four Americans worry default could hurt them",
    "Title 42 dramatically changed who arrived at the border",
    "Kremlin says its spies are watching as CIA urges Russians to get in touch",
    "Kyiv says it shoots down volley of Russian hypersonic missiles",
    "J&J's proposed talc settlement would pay $400 million to US state AGs",
    "Making the four-day week work for Britain",
    "Biden administration announces $11 bln for rural clean energy projects",
    "Kentucky Republicans to choose challenger to Democratic Governor Beshear",
    "US Senate hearing on China draws rare Biden cabinet trio",
    "Ahead of 2024 bid, DeSantis challenges Trump on abortion limits",
    "Hungary blocks next tranche of EU off-budget military support for Ukraine",
    "Five Germans handed jail sentence for Green Vault jewel heist",
    "Ukraine Supreme Court chief dismissed after being detained in bribery case",
    "Burundi-born ex-police officer seeks to be Greece's first Black lawmaker",
    "Cuba announces new migration policies as exodus continues",
    "Ecuador assembly begins impeachment hearing against President Lasso",
    "Brazil's government eyes tax tweaks to boost revenue -sources",
    "Colombia 2022 deforestation forecast to drop by up to 10%",
    "Biden cancels Australia visit as debt ceiling default nears - source",
    "Thailand's Thaksin lauds 'disruptors' Move Forward for election triumph",
    "U.S. to send additional security assistance to Taiwan soon- Pentagon chief",
    "Mixing old and new, Gucci hosts show in 14th century Seoul palace",
    "'No one's safe': Sixers cut Rivers after repeat playoffs disappointment",
    "Flawless Djokovic crushes Norrie to reach Rome quarter-finals",
    "MLB roundup: Cardinals blitz Brewers 18-1",
    "Aces lose 2025 first-round pick, Hammon suspended for WNBA rule violations",
    "In pictures: Turkey faces election runoff",
    "Ukraine forces train for counteroffensive",
    "Johnny Depp marks celebrity comeback with Cannes opening film",
    "Cannes jury president to striking Hollywood writers: 'Yeah, go!'",
    "Ivory Coast entrepreneur pours love and patriotism into fine chocolate",
    "The new Kardashians? Sylvester Stallone and family star in reality TV show",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]