[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "At least 10 people killed, nine injured in shootout in northern Mexico",
    "German police investigate possible poisoning of two Russian exiles",
    "At least 12 dead in stampede at El Salvador stadium",
    "Russian parliament chief proposes Polish truck ban, says Warsaw owes Moscow billions",
    "Animal health body urges bird flu vaccination to avoid pandemic",
    "Iran says 'terrorist' group linked to Israel has been arrested, Nour News reports",
    "Biden invites Kishida, Yoon to meet in Washington",
    "Zelenskiy says Bakhmut still in Ukraine's hands",
    "Russia says Ukrainian city of Bakhmut captured",
    "Explainer: How important is Wagner's claimed capture of Bakhmut?",
    "Biden: Zelenskiy promised Ukraine won't use F-16's in Russia",
    "At G7, Zelenskiy says destruction of Bakhmut has echoes of Hiroshima",
    "Biden unveils new $375 million military aid package for Ukraine",
    "Podcast: What's the G7 to do about China?",
    "Factbox: Key excerpts from G7 leaders' statement on Ukraine",
    "Biden says Republican debt ceiling offer 'unacceptable,' to talk with McCarthy",
    "Alberta wildfire fighters hope rain, cooling bring relief",
    "Morgan Stanley CEO succession underscores Wall Street's diversity gap",
    "AI boom could expose investors’ natural stupidity",
    "Far-right minister says Israel 'in charge' during visit to Jerusalem holy site",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "Biden says he won't agree to bipartisan debt-ceiling deal solely on Republicans' terms",
    "Exploration & Productioncategory",
    "Oil supply won't be affected by stricter price cap enforcement, IEA says",
    "Analysis: Vodafone's new CEO faces tough calls to reconnect with investors",
    "India regulator proposes curbs on derivative-linked share moves",
    "JPMorgan, ex-executive spar in court over responsibility for Epstein",
    "MLB roundup: Aaron Judge helps Yankees stun Reds",
    "Arsenal undone in title race by Guardiola mind games, lack of squad depth",
    "Rybakina targets deep run at Roland Garros after Rome triumph",
    "Arsenal pushed us but we capitalised on their 'hiccups', says Man City's Walker",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Mexico City airport resumes operations after volcanic ash forces shutdown",
    "Villagers evacuated as wildfire ravages woodlands in western Spain",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Cate Blanchett dons habit in Australian director's conversion tale",
    "Julianne Moore, Natalie Portman anchor Cannes competitor 'May December'",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]