[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "S&P 500 ends lower as Microsoft recedes from record high",
    "Exclusive: Twitter to focus on video, commerce in business revamp",
    "Fed officials open post-meeting comments with a hawkish vibe",
    "Explainer: How MOVEit breach shows hackers' interest in corporate file transfer tools",
    "Fear of missing out on stocks' rally drives bullish options trading",
    "No new questioning of JPMorgan CEO Dimon in Epstein case, judge says",
    "Intel to invest $4.6 billion in new chip plant in Poland",
    "African leaders start peace mission in Ukraine despite Russian missile barrage",
    "NATO meeting fails to approve first defence plans since Cold War",
    "Explainer: What is Russia's problem with the Black Sea grain deal?",
    "Ukraine says Russia taking heavy losses in south, resisting near Bakhmut",
    "Xi Jinping meets Bill Gates in China, calls him 'an old friend'",
    "Blinken heads to Beijing hoping to calm fears of a US-China break",
    "China slams EU ban on Huawei, ZTE demands equal treatment",
    "Minneapolis agrees to federal oversight of police after pattern of excessive force",
    "Daniel Ellsberg, who leaked 'Pentagon Papers,' dies at 92",
    "Pittsburgh synagogue attacker found guilty of hate crimes",
    "Inside the race to remake lithium extraction for EV batteries",
    "Greece boat disaster: Emotional reunion for brothers as hopes of finding more survivors fade",
    "Flags lowered, relatives brace for bad news as 15 elders die in Canada crash",
    "Brazil police find plans for military coup on Bolsonaro aide's phone, Veja reports",
    "Mexico swelters as 'atypical' heat wave grips nation",
    "Mexico interior minister steps down to vie for presidential bid",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Protests planned for Modi's US visit over India's human rights",
    "US imposes visa restrictions on Uganda officials after anti-LGBTQ law",
    "U.S. Supreme Court allows Justice Department to toss whistleblower cases",
    "Pope Francis leaves hospital 'in better shape than before'",
    "IAEA's Grossi: Water for cooling a priority at Zaporizhzhia nuclear plant",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "Ethics body accuses UK's Johnson of new breach for taking newspaper job without vetting",
    "India cyclone: casualties averted with early warnings and timely evacuation",
    "Exclusive: Thailand seeking to re-engage Myanmar junta with ASEAN meeting",
    "Taliban's central-bank governor meets Chinese envoy to discuss banking ties",
    "Indian minister's home set ablaze in violence-hit Manipur state",
    "NBA suspends Morant 25 games over alleged firearm video",
    "McIlroy struggles, Clark shines as U.S. Open second round gets underway",
    "MLB roundup: Shohei Ohtani wins, homers in Texas",
    "Monchi leaves Sevilla to become Aston Villa's President of Football Operations",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Grammys bans AI-only music, allows \"only human creators\"",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Valentino returns to Milan Fashion Week with flowery menswear show",
    "Artist paints giant plastic bottle in Swiss park in litter protest",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]