[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "US credit crunch didn't start with SVB collapse, and may not end there",
    "US airlines thrown a curveball as consumer habits change post-pandemic",
    "U.S. prosecutors look at short selling in bank shares - source",
    "Exclusive: Turkey defers $600 million Russian energy payment under deal -sources",
    "Ex-Tesla worker seeks third trial in race bias case after $3.2 mln award",
    "Icahn Enterprises fielding enquiries by U.S. prosecutors",
    "Exclusive: Chevron aims to boost Venezuela oil output to accelerate debt recovery -sources",
    "Embattled US Rep George Santos arrested on fraud, money laundering charges",
    "US inflation edges higher on rents, gasoline but some relief seen",
    "Tech-heavy Nasdaq jumps on signs of easing inflation",
    "Ukraine unit says Russian brigade flees Bakhmut outskirts",
    "Migrants risk life and limb to jump Mexico trains in rush to border",
    "E. Jean Carroll elated by victory over Trump in sexual abuse suit",
    "Pakistan calls in army to quell deadly violence after ex-PM Khan's arrest",
    "Human genome reboot better reflects global population",
    "US debt ceiling standoff talks look at COVID clawbacks, energy permits",
    "Biden restricts asylum access at Mexico border as Title 42 ends",
    "Biden heads to New York to talk debt ceiling, raise funds for re-election",
    "Ohio abortion rights fight highlights Republican electoral vulnerabilities",
    "Britain ditches commitment to remove all EU laws by the end of 2023",
    "Kremlin calls Polish decision to rename Kaliningrad 'hostile act'",
    "Daily Mirror apologises to Prince Harry over unlawful information gathering",
    "Spain to ban some outdoor working during extreme heat conditions",
    "Battles shake Sudan's capital as power struggle escalates",
    "Kenya court denies bail for suspected death cult leader",
    "Ten killed in eastern Congo landslide after more heavy rains",
    "Tunisia synagogue attack toll up to 6, local media says",
    "Sustainable Businesscategory",
    "Honeywell announces tech to turn hydrogen and CO2 into lower-carbon aviation fuel",
    "China reports first arrest over fake news generated by ChatGPT",
    "Google expected to unveil its answer to Microsoft's AI search challenge",
    "Musk says Twitter to soon allow calls, encrypted messaging",
    "Frankfurt Stadium to host Kansas City Chiefs in maiden NFL game",
    "MLB roundup: Yankees blast A's in Aaron Judge's return",
    "Mourinho dismisses PSG talk ahead of Europa League semi-final",
    "Haaland's father removed from Bernabeu seat after City equaliser",
    "Scenes from the Westminster Dog Show",
    "Courtroom sketches from Trump's sexual abuse trial",
    "Reservoirs run dry in drought-hit Spain as summer looms",
    "Dolly Parton reveals starry list of collaborators for first rock album",
    "London's Big Ben fails to bong as clock briefly stops",
    "Rare day at Vatican as two popes share stage",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]