[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US banks push back as regulators prepare international capital hikes",
    "Spirit AeroSystems to halt work at Wichita plant as union votes to strike",
    "Shares ease, dollar steady in central-bank heavy day",
    "Shares of UK online supermarket Ocado soar on talk of Amazon bid interest",
    "Analysis: For EV batteries, lithium iron phosphate narrows the gap with nickel, cobalt",
    "Three former Credit Suisse CEOs accused of excessive risk-taking -court filing",
    "The Africans fighting on Russia's front line in Ukraine",
    "Ukraine hits bridge linking Crimea to mainland",
    "U.S. reporter Gershkovich loses new appeal against pre-trial detention in Russia",
    "Podcast: On the front line of Ukraine's counteroffensive",
    "Missing Titanic sub running out of oxygen",
    "Who's on board the missing Titanic sub?",
    "Why recovering the missing Titanic sub is so challenging",
    "Titanic sub timeline: when did it go missing and key events in search",
    "Bank of England hikes rates to 5% in surprise move",
    "Biden, Modi to strengthen ties with defense, trade agreements",
    "Kenya could follow Uganda as East African nations wage war on LGBT rights",
    "Battle of billionaires: Musk's Starlink eyes India, Ambani resists",
    "At Paris summit, World Bank to unveil debt payment pause for countries hit by disasters",
    "Migrants to Spain's Canary Islands surge, three new boatloads rescued Thursday",
    "Six people in critical condition, one still missing after Paris blast - prosecutor",
    "Pope skips speech, blaming breathing difficulties after surgery",
    "Risk of mosquito-borne diseases rising in Europe - health agency",
    "U.S. court strikes down Florida transgender health rule",
    "U.S. House censures prominent Democrat for work on Trump probes",
    "US announces new visa restriction policy for those who have assisted fugitives",
    "Pentagon leak suspect Teixeira pleads not guilty to US federal charges",
    "Beijing soars above 41 degrees Celsius, smashes June record",
    "New Zealand PM disagrees with Biden, says Xi Jinping not a 'dictator'",
    "Deadly China blast sparks fears about safety at BBQ restaurants",
    "Indonesia moves site of ASEAN military drills away from South China Sea",
    "Honduras hands prison control to military police, expands emergency powers after deadly riot",
    "Canada, Dominican Republic reach agreement over Haitian crisis response",
    "Drought-hit Panama Canal further restricts maximum ship depth",
    "Brazil Senate confirms Lula's ex-lawyer for Supreme Court seat",
    "Ukrainian athletes should have chance to qualify for Paris Games-IOC",
    "Wrexham host MK Dons in fourth-tier opener, Saints at Wednesday in Championship",
    "China's governing body upholds lifetime bans for match-fixing",
    "MLB roundup: Reds sweep Rockies, win 11th straight",
    "Celebrating summer solstice, from Stonehenge to Times Square",
    "On the frontlines of Ukraine's counteroffensive",
    "Britain celebrates 75th anniversary of 'Windrush' arrivals",
    "Blood, sex and a little magic: Tasmania marks a decade of offbeat festival",
    "Tokyo residents find comfort in fluffy, street-strolling alpacas",
    "Zero waste theatre seeks to show we all can act for change",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]