[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "UBS says it was rushed into unwanted Credit Suisse rescue merger",
    "Turkey's market rout deepens after Erdogan's strong election showing",
    "Elon Musk reverses course and says Tesla will advertise its cars",
    "Ex-First Republic CEO blames contagion for bank's collapse",
    "First nuclear fusion plants to need $7 bln supply chain -survey",
    "Shell to use new AI technology in deep sea oil exploration",
    "Smaller consultancies eye opportunities as China crackdown hits sector leader",
    "Patriot missile defense system in Ukraine likely damaged - US sources",
    "Kremlin says its spies are watching as CIA urges Russians to get in touch",
    "Moldovan region headed for clash with pro-European government",
    "Explainer: Can Ukraine use Patriot defense systems to knock out Russian hypersonic missiles?",
    "Biden, McCarthy hopeful on debt ceiling deal, US president cuts Asia trip short",
    "Morning Bid: Are we there yet? Market holds breath for debt ceiling deal",
    "US default could trigger recession, Yellen says",
    "Biden's budget vs. Republican debt ceiling bill on spending, deficits",
    "Asian shares muted, US debt ceiling talks weigh on risk appetite",
    "Australia cancels Quad meeting in Sydney after Biden postponement",
    "Southern Europe braces for climate change-fuelled summer of drought",
    "New Zealand police suspect arson caused hostel fire that killed six",
    "Tyre-makers under pressure as too much rubber hits the road",
    "Wife of Pakistan's Imran Khan, charged with graft, is known for spirituality",
    "Trudeau says Canada ready to partner with South Korea on critical minerals, security",
    "Taiwan's Kuomintang to pick New Taipei City mayor as presidential candidate - source",
    "Japan's prime minister to meet with top chip firms",
    "Nepali sherpa sets Everest record with 27th ascent",
    "North Korea’s Kim Jong Un inspects military satellite station -KCNA",
    "South Korea signs $130 mln aid package with Ukrainian minister",
    "Taiwan speaker hails Japan, South Korea and Philippines for 'crescent of defense'",
    "Japan emerges from recession on post-COVID consumer rebound",
    "North Carolina legislature overrides veto of 12-week abortion ban, making it law",
    "Kentucky Republicans choose Cameron to challenge Democratic Gov. Beshear",
    "Theranos founder Holmes loses bid to stay out of prison, hit with huge restitution bill",
    "Lawmakers in three states consider abortion bans at 12 weeks or less",
    "Kyiv says it shoots down volley of Russian hypersonic missiles",
    "France's Sarkozy, defending his 'honour', awaits corruption appeal verdict",
    "Making the four-day week work for Britain",
    "Two more victims of volcano eruption found in Roman ruins of Pompeii",
    "Erdogan calls Turkish voters to ensure stability in runoff vote",
    "An Israeli missile worsens the adversity of five disabled siblings",
    "Top Russian energy diplomat visits Iran; wants more cooperation in oil, gas",
    "Israel's Netanyahu faces budget test amid economic, political woes",
    "Brazil's Bolsonaro denies tampering of his vaccination records",
    "Cuba announces new migration policies as exodus continues",
    "As US debates abortion pill ban, Argentina expands its use",
    "Ecuador assembly begins impeachment hearing against President Lasso",
    "Morant takes 'full accountability' after allegedly waving gun again on video",
    "Martinez deals knockout blow as Inter reach Champions League final",
    "Flawless Djokovic crushes Norrie to reach Rome quarter-finals",
    "Rahm, Smith and Fitzpatrick form PGA Championship major attraction",
    "Style from the Cannes red carpet",
    "Ukraine forces train for counteroffensive",
    "Ed Sheeran beats second copyright lawsuit over 'Thinking Out Loud'",
    "Prince Harry should not be allowed to pay for police protection, court told",
    "The new Kardashians? Sylvester Stallone and family star in reality TV show",
    "Johnny Depp marks celebrity comeback with Cannes opening film",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]