[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "IKEA bets on remote interior design as AI changes sales strategy",
    "Cryptoverse: Security alert! Altcoins worth $100 billion dropped in hot water",
    "Analysis: Tesla taps brakes on job ads after Musk clamps down on hiring",
    "Bunge, Viterra will merge to form $34 billion agri-trading powerhouse",
    "AMD likely to offer details on AI chip in challenge to Nvidia",
    "China cuts short-term borrowing costs to support recovery",
    "Disney's Pixar seeks return of box office magic with 'Elemental'",
    "Russia kills 11 in strike on Ukraine; Kyiv says troops make gains",
    "Russia releases video of captured German tanks, U.S. fighting vehicles in Ukraine",
    "Belarus to get Russian tactical nuclear weapons 'in days' - Lukashenko",
    "NATO pushes for common standards to tackle shortfalls in artillery munitions",
    "US consumer prices slow in May; core inflation sticky",
    "Trump to face charges in Florida court in classified documents case",
    "Toyota unveils sweeping plans for new battery tech, EV innovation",
    "Autos & Transportationcategory",
    "Analysis: GM could reap billions by building combustion trucks and SUVs through 2035",
    "Neo-Nazi groups multiply in a more conservative Brazil",
    "Podcast: Trump in court, Lebanon’s power vacuum and UAE sex trafficking",
    "UK police arrest murder suspect after three found dead on Nottingham streets",
    "'Goodbye President': Berlusconi fans pay tribute to late leader",
    "Britain's COVID-19 inquiry hears government was under-prepared",
    "Romanian prosecutors change human trafficking charge against Andrew Tate",
    "U.S. officials call spy program key to big cases, but give few details",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "'Speedy trial' promised by special counsel in Trump case may not go so fast",
    "Seven die as cyclone barrels towards western India, Pakistan",
    "Residents in for months-long displacement as Philippine volcano spews lava, gases",
    "Taiwan civil defence handbook includes tips on identifying Chinese soldiers",
    "'Outright lie': India denies Dorsey's claims it threatened to shut down Twitter",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "McIlroy grouped with Koepka as PGA-LIV battle set to continue at US Open",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Brazil to play Spain at Santiago Bernabeu in anti-racism campaign",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "'Last' Beatles record to be released this year thanks to AI - McCartney",
    "Fans celebrate K-Pop supergroup BTS' 10-year anniversary",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]