[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "IKEA bets on remote interior design as AI changes sales strategy",
    "Cryptoverse: Security alert! Altcoins worth $100 billion dropped in hot water",
    "Ryan Cohen scoops up GameStop stock worth $10 mln, shares rise",
    "Analysis: Tesla taps brakes on job ads after Musk clamps down on hiring",
    "EU targets ESG ratings agencies in bid to improve standards",
    "Bunge, Viterra will merge to form $34 billion agri-trading powerhouse",
    "AMD likely to offer details on AI chip in challenge to Nvidia",
    "Ukrainian flag, Russian corpses evidence of Kyiv's advance in south",
    "Russia releases video of captured German tanks, U.S. fighting vehicles in Ukraine",
    "Exclusive: Flag flies over newly liberated village, confirming Ukraine advancing",
    "Dutch intelligence tipped CIA on alleged Ukraine plan to attack Nord Stream -NOS",
    "US consumer prices rise moderately; underlying inflation strong",
    "Cool US May CPI rise supports Fed pause argument",
    "Trump to face charges in Florida court in classified documents case",
    "Toyota unveils sweeping plans for new battery tech, EV innovation",
    "Autos & Transportationcategory",
    "Analysis: GM could reap billions by building combustion trucks and SUVs through 2035",
    "Neo-Nazi groups multiply in a more conservative Brazil",
    "Podcast: Trump in court, Lebanon’s power vacuum and UAE sex trafficking",
    "UK police arrest murder suspect after three found dead on Nottingham streets",
    "'Goodbye President': Berlusconi fans pay tribute to late leader",
    "Britain's COVID-19 inquiry hears government was under-prepared",
    "Kosovo PM presents plan to defuse tensions in Serb-majority area",
    "U.S. officials call spy program key to big cases, but give few details",
    "U.S. suspends asylum appointments in Texas border city after extortion reports",
    "McCarthy, US House hardliners reach deal to allow votes",
    "'Speedy trial' promised by special counsel in Trump case may not go so fast",
    "Nigeria swears in lawmakers, focus shifts to president's cabinet nominees",
    "Titan of Cameroon's opposition politics John Fru Ndi dies at 81",
    "Eritrea rejoins regional East African bloc after 16-year absence",
    "US lawmakers call for S.Africa to lose summit over Russia ties",
    "Seven die as cyclone barrels towards western India, Pakistan",
    "'Outright lie': India denies Dorsey's claims it threatened to shut down Twitter",
    "Taiwan civil defence handbook includes tips on identifying Chinese soldiers",
    "China says US eagerness to engage is an 'illusion'",
    "Job done, says Jokic, as Nuggets beat Heat to win first NBA title",
    "McIlroy grouped with Koepka as PGA-LIV battle set to continue at US Open",
    "Djokovic returns to world number one, Nadal out of top 100",
    "Brazil to play Spain at Santiago Bernabeu in anti-racism campaign",
    "Ukrainian president's hometown hit by deadly Russian missile strike",
    "The art of parkour in 18 surreal photos",
    "Actor Treat Williams killed while riding motorcycle in Vermont, agent says",
    "'Last' Beatles record to be released this year thanks to AI - McCartney",
    "Fans celebrate K-Pop supergroup BTS' 10-year anniversary",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]