[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "BOJ keeps ultra-low rates, focus shifts to Ueda's inflation views",
    "Asian shares near four-month peak as BOJ takes the stage",
    "Google, one of AI’s biggest backers, warns own staff about chatbots",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "Crypto investors step up risk management after last year's meltdowns",
    "JPMorgan fails Jeffrey Epstein stress test",
    "US grand jury indicts Pentagon leak suspect Teixeira, Justice Department says",
    "Russia tries to signal normalcy as Ukraine forces advance",
    "Exclusive: African leaders to propose 'confidence building measures' to Russia, Ukraine",
    "US criticizes Russia in annual human trafficking report",
    "Chechen fighters sent to Russian border with Ukraine, leader Kadyrov says",
    "At least 15 killed in Canada highway crash after truck hits bus in Manitoba",
    "Cheap 'like cabbage' apartments in some Chinese cities draw buyers, and caution",
    "Australia's visa overhaul leaves Chinese millionaires in limbo",
    "US, Iran in talks to cool tensions with a mutual 'understanding'",
    "South Korea recovers part of rocket used in North's failed satellite launch",
    "Trees uprooted, roofs blown off by cyclone in India's Gujarat",
    "Analysis: Japan hopes to shore up Philippines' defence amid Taiwan conflict fears",
    "Australia's top companies back Indigenous Voice as public support wavers",
    "China calls European Parliament's Hong Kong resolutions 'publicity stunt'",
    "Brutal heat wave to scorch US South through holiday weekend",
    "Texas panhandle town hit by tornado, fatalities reported",
    "E. Jean Carroll defamation trial against Donald Trump set for January 2024",
    "Texas governor signs law shutting diversity offices at public universities",
    "How is Ukraine’s counter-offensive going so far?",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "Tourist dies after attack near Germany's Neuschwanstein Castle",
    "Pope Francis orders ex-aide of Pope Benedict to leave Vatican",
    "Exclusive: Brazil forward Vinicius Jr to lead new anti-racism committee, FIFA says",
    "Hamilton expects wins mark to fall to Verstappen",
    "Joselu’s late winner puts Spain into Nations League final",
    "Fowler, Schauffele lead U.S. Open with record 62s, McIlroy in pursuit",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Our top photos of the week",
    "In shadow of war, Ukrainians flee towns submerged by dam burst",
    "New 'Black Mirror' season begins by tackling actors' anxiety about AI",
    "Take That turn 'Greatest Days' film premiere into a performance",
    "Art Basel draws surge in Asian collectors",
    "Mexico says mass bird deaths likely caused by El Niño's hotter waters",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]