[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Chinese company earnings reveal lopsided economic recovery",
    "UK finance bosses press to revive London's allure",
    "Chinese competition, Xinjiang plant loom large for Volkswagen investors at AGM",
    "India's Go First airline gains bankruptcy protection, moratorium placed on leases",
    "Yellen heads to G7 with debt ceiling, bank crisis and tax woes in tow",
    "Exclusive: CICC Capital bans consulting firm Capvision after China crackdown",
    "Zealand, Boehringer's drug meets main weight-loss goal in mid-stage trial",
    "Trump sexually abused writer E. Jean Carroll, must pay her $5 million, jury says",
    "Six notable moments from Trump's sexual abuse trial",
    "An overview of Donald Trump’s legal troubles",
    "Events leading up to Donald Trump sexual abuse verdict",
    "How Sudan's paramilitary forces took parts of Khartoum, stormed army chief's quarters",
    "Battles shake Sudan's capital as power struggle escalates",
    "Morning Bid: Markets on hold for US CPI",
    "Investors' route to post-COVID China is via Europe",
    "Supporters of Pakistan ex-PM Khan plan march to capital to protest arrest",
    "Southeast Asian leaders urge end of Myanmar violence, inclusive talks",
    "Bollywood film on Islamic State recruits sparks debate in India",
    "Toyota targets 10% profit jump, robust EV sales as chip woes recede",
    "Panasonic sees higher profit this year on robust battery demand",
    "Siemens Healthineers Q2 profit falls, quits heart surgery robots business",
    "ASOS reports first-half loss as shoppers cut back",
    "Biden, McCarthy divided over debt ceiling but talks continue",
    "Migrants amass along US-Mexico border as COVID-era restrictions near end",
    "Gunman who killed 8 at Texas shopping mall had 'neo-Nazi ideation,' officials say",
    "Biden's approval rating at 40%, Americans concerned about immigration: Reuters/Ipsos poll",
    "Arabs bring Syria's Assad back into fold but want action on drugs trade",
    "Appetite for change grows in Kurdish heartland as Turkish elections near",
    "Israeli forces kill 2 Islamic Jihad gunmen in West Bank",
    "Erdogan again? Amid rubble of Turkey's quake, voters demand to be heard",
    "No quick deal in sight as EU countries start talks on new Russia sanctions",
    "Russia marks Victory Day with new strikes on Ukraine, but pared-back parade",
    "Outbound inspections resume under Black Sea grain deal - UN",
    "Switzerland holds military drills, its role in European defence in focus",
    "Musk says Twitter to soon allow calls, encrypted messaging",
    "Metaverse could contribute up to 2.4% of US GDP by 2035, study shows",
    "EU draft rules propose tougher cybersecurity labelling rules for Amazon, Google, Microsoft",
    "Porsche, VW Commercial Vehicles partner with Mobileye on automated driving software",
    "Medvedev to focus on more spin, improved sliding on clay",
    "'As long as he's happy', Argentina boss unconcerned about Messi moves",
    "Pegula upset with Madrid organisers after finalists denied speeches",
    "Honda say Marquez fit for French Grand Prix",
    "Scenes from the coronation of King Charles",
    "Prince Louis at the coronation",
    "In the audience at the coronation",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Captagon: the drug fuelling the Gulf party scene - and Syria's finances",
    "You're late on your taxes. Now what?",
    "\"We're being hounded\" - French transgender sprinter decries Olympics ban",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]