[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Morning Bid: RBNZ to hike rates, U.S. default ticks closer",
    "US lawmaker demands action against Chinese chip firm CXMT after Micron",
    "Purdue Pharma to sell consumer business for $397 mln",
    "Tesla to pick location for new factory this year, Musk says",
    "Japan manufacturers' mood turns positive as economy recovers",
    "Virgin Orbit auctions $36 mln in remaining assets as company folds",
    "Palo Alto lifts annual forecasts on resilient cybersecurity spending",
    "Trump criminal trial to start next March, with campaign in full swing",
    "Florida Governor DeSantis to enter 2024 race in Twitter event with Musk",
    "Factbox: 2024 US presidential election: who is in, who is out and who is still thinking about it",
    "US calls for immediate release of Gershkovich after Russia seeks to extend detention",
    "Ukraine investigating role of Belarus in transfers of children, prosecutor says",
    "Russia says it crushes cross-border incursion by 'Ukraine nationalists'",
    "Ukraine launches investigation into Russian commander",
    "Justice Thomas' billionaire friend rejects Senate panel over gift list",
    "From mangoes to luxury watches, Indians look to offload 2,000-rupee notes",
    "Binance commingled customer funds and company revenue, former insiders say",
    "South Carolina lawmakers pass six-week abortion ban, send to governor",
    "Lakers to speak with James in coming days about retirement comment",
    "US lawmakers view Afghanistan 'dissent' cable, dispute continues",
    "After White House truck crash, driver charged with threatening Biden",
    "Abortion pill maker seeks to keep challenge to W. Va. abortion ban alive",
    "EU, US to seek stopgap standards for AI, EU tech chief says",
    "Google-backed Anthropic raises $450 mln in latest AI funding",
    "Uber partners with Alphabet's Waymo to offer driverless rides",
    "Google to test ads in generative AI search results",
    "Student lit deadly fire at Guyana school after phone confiscated - police",
    "Colombia ex-president Uribe could go on trial in witness tampering case",
    "Ecuador's Lasso issues decree to boost investment",
    "Canada did not ignore intelligence on Chinese meddling, report says",
    "Sudan ceasefire brings some respite after weeks of heavy battles",
    "Congo files new complaint to ICC against Rwanda's military and M23 rebels",
    "Sudan ceasefire monitoring group, U.S. discussing alleged violations -State Dept",
    "Congo Red Cross halts search for hundreds of flood victims",
    "Israeli parliament set to approve 2023-24 budget amid protests",
    "Qatar Airways CEO suggests 2050 net-zero goal beyond reach",
    "Turkish opposition calls Erdogan a 'fabricator' over doctored video",
    "Saudi warns speculators of more pain as OPEC+ meeting looms",
    "Exclusive: Doping-Education first but drug-testing in gamers' future, says WADA",
    "Real Madrid's Vinicius Jr has red card rescinded - RFEF",
    "France prepares its guard against drone strikes, security threats",
    "Battle for Bakhmut: Scenes from the front lines",
    "Man arrested after U-Haul truck crashes near White House",
    "Italy's Bellocchio debuts 'Kidnapped' at Cannes, about Church abduction of Jewish boy",
    "Stars come out for Cannes premiere of Wes Anderson's 'Asteroid City'",
    "HBO's much-hyped 'The Idol' meant to be provocative, says Sam Levinson",
    "Disgraced Australian-born former entertainer Rolf Harris dead at 93",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]