[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "China's Micron ban highlights chipmakers' dilemma as Sino-U.S. tensions grow",
    "US will not award $200 million grant for Microvast battery company - source",
    "Judge throws out shareholder lawsuit against Elon Musk over Twitter buyout",
    "Watchdog proposes first set of global rules for crypto sector",
    "Cryptoverse: Busy bitcoin births new breed of crypto",
    "Asian stocks notch two-week peak as focus turns to PMIs",
    "Record number of British firms pessimistic about China business - survey",
    "Biden, McCarthy meeting ends with no deal on debt ceiling",
    "Treasury confirms U.S. default as early as June 1 without debt ceiling hike",
    "What happens if Washington falls behind on its bills?",
    "US debt ceiling crunch threatens to roil complacent stock market",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "Florida restaurant sues DeSantis over drag show restrictions",
    "Florida sued for barring Chinese citizens from owning homes, land",
    "Morning Bid: Can PMIs reprise their April surprise?",
    "Healthcare & Pharmaceuticalscategory",
    "Weight-loss drug pioneers aim to jump on Wegovy bandwagon",
    "Western states reach 'historic' deal to help save Colorado River",
    "Russia fights cross-border raid that Ukraine says is Russian opposition",
    "Truck crashes near White House, driver detained - Secret Service",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "India makes tests mandatory for cough syrup export after overseas deaths",
    "PNG won't be used for 'offensive military operations' - prime minister",
    "Australia welcomes US-Papua New Guinea defence pact",
    "East Timor opposition wins most votes in parliamentary election - state media",
    "E. Jean Carroll seeks $10 mln in damages from Trump over post-verdict statements",
    "Republican U.S. Senator Tim Scott launches presidential bid with optimistic message",
    "TikTok sues Montana after state bans app",
    "Judge tosses out some claims in Abbott baby formula litigation",
    "US FDA approves Opiant's spray for reversing opioid-related overdoses",
    "Government Health Policycategory",
    "Peru judge orders Kuczynski graft probe to be redone in reprieve for former president",
    "School dormitory fire in Guyana may have been arson, police say",
    "Mexico to announce work visa program for Central Americans",
    "Brazil economists lower inflation forecasts, but still too high for central bank",
    "Exclusive: Paris 2024 hoping for Olympic flame on Eiffel Tower",
    "Woods withdraws from U.S. Open while recovering from surgery",
    "French Open offers players tool to filter out online abuse",
    "Lights go out at Rio's Christ the Redeemer in support of Vinicius Jr",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Boxed Out: Why safe deposit boxes are harder to find",
    "Director of Cannes' first Sudanese film: I walk red carpet as people flee bullets",
    "South African fossils reveal ancient beast's epic journey to oblivion",
    "The Weeknd, Lily-Rose Depp draw screaming fans to 'The Idol' premiere",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]