[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Euro zone inflation ticks up in April",
    "Autos & Transportationcategory",
    "Tyre-makers under pressure as too much rubber hits the road",
    "As household budgets tighten, big brands double down in dollar stores",
    "Stellantis tells UK: change Brexit deal or watch car plants close",
    "First nuclear fusion plants to need $7 billion supply chain - survey",
    "Shell to use new AI technology in deep sea oil exploration",
    "Analysis: Amgen's antitrust woes spur wider pharmaceutical deal fears",
    "How a deadly bat virus found new ways to infect people",
    "How bats could be the cause of the next global pandemic",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "We may never know where the COVID pandemic originated",
    "Russia says hypersonic missile scientists face 'very serious' treason accusations",
    "Factbox: What do we know about Kinzhal, Russia's hypersonic missile?",
    "Kyiv says it shoots down volley of Russian hypersonic missiles",
    "Morning bid: Fed rates to stay higher for longer, debt drama goes on",
    "Eight dead and thousands evacuated as floods batter northern Italy",
    "Trump is attacking DeSantis hard on policy, amid the flurry of insults",
    "AI threatens humanity’s future, 61% of Americans say: Reuters/Ipsos poll",
    "Podcast: Saving the planet meets voter resistance in Germany",
    "'More likely than not' world will soon see 1.5C of warming - WMO",
    "Rich nations should step-up support for poorer countries to go green, Japan says",
    "Southern Europe braces for climate change-fuelled summer of drought",
    "Most groundwater still low in France despite spring rainfall",
    "U.S. House Speaker McCarthy says he thinks U.S. will not default",
    "North Carolina legislature overrides veto of 12-week abortion ban, making it law",
    "Man convicted of New York bike path attack to be formally sentenced to life",
    "Theranos founder Holmes loses bid to stay out of prison, hit with huge restitution bill",
    "Ukraine denies Russia destroyed Patriot missile defence system",
    "'Losing our best': activists killed in war seen as blow to Ukraine's future",
    "Last ship leaves Ukraine as fate of Black Sea grain deal in Russia's hands",
    "France's Sarkozy loses corruption appeal, to challenge at highest court",
    "Turkey opposition contests thousands of ballots after election",
    "Top Russian energy diplomat visits Iran; wants more cooperation in oil, gas",
    "Russia and Iran sign rail deal for corridor intended to rival Suez Canal",
    "Israel's Netanyahu faces budget test amid economic, political woes",
    "Missions in China warned over 'propaganda' displays after Ukraine flags raised",
    "Australia cancels Quad meeting in Sydney after Biden postponement",
    "Pakistan official warns ex-PM Khan to hand over riot suspects",
    "Thailand's opposition parties meet for coalition talks",
    "Argentine shoemakers and tailors buckle under 109% inflation",
    "Analysis: Jet-setting Lula risks losing focus on Brazil issues, allies say",
    "Ecuador president dissolves legislature, bringing elections forward",
    "South Korea's Yoon, Canada's Trudeau agree to boost cooperation on critical minerals",
    "MLB roundup: Jorge Soler's walk-off HR pushes Marlins past Nats",
    "Kenya's 10k world record holder Kipruto provisionally suspended",
    "Morant takes 'full accountability' after allegedly waving gun again on video",
    "Four more Soudal Quick-Step riders test positive for COVID at Giro d'Italia",
    "Style from the Cannes red carpet",
    "Ukraine forces train for counteroffensive",
    "At Cannes, independent film firms optimistic as streamers stumble",
    "Nepali sets Everest record with 27 ascents, Briton makes most summits by a foreigner",
    "Ed Sheeran beats second copyright lawsuit over 'Thinking Out Loud'",
    "Neglected Igbo-Ukwu Bronzes get new life at Nigerian museum",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]