[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Obesity fighting success fuels Novo bet on gene-editing tech",
    "Explainer: How could a US debt ceiling default hit regular Americans?",
    "What US Treasury debt payments are at risk of default?",
    "South Korea asks US to review China rule for chip subsidies",
    "Target removing some LGBTQ merchandise following customer backlash",
    "China was reducing Micron chip purchases years before ban",
    "EU court rejects Meta challenge to antitrust information requests",
    "Exclusive: Russian hypersonic scientist accused of betraying secrets to China",
    "Ukraine war: Belgorod incursion may stretch Russia's defences",
    "Mercenary Prigozhin warns Russia could face revolution unless elite gets serious about war",
    "US colleges game out a possible end to race-conscious student admissions",
    "Factbox: Who's who in the Supreme Court's affirmative action cases",
    "Explainer: What happens if the US Supreme Court bans affirmative action?",
    "Morning Bid: Fears of 6% and US debt jam",
    "Ron DeSantis to make 2024 U.S. presidential bid official with Musk on Twitter",
    "Exclusive: Chinese hackers attacked Kenyan government as debt strains grew",
    "Saudi embrace of Assad sends strong signal to US",
    "Madeleine McCann search at Portuguese reservoir resumes with sniffer dogs",
    "Australia, India to seek closer economic ties, critical minerals cooperation",
    "China says NATO's plan for Japan office not welcomed in Asia-Pacific",
    "Pakistan considering banning Imran Khan's party - minister",
    "China prioritising Turkmenistan over Russia in next big pipeline project",
    "Asia water, energy supplies at risk as climate woes mount - research",
    "Australia refers PwC tax document leak scandal to police",
    "Bangladesh PM confident country able to repay IMF loans",
    "Rainbow Swatch watches confiscated in Malaysia-company",
    "As gas reserves wane, Philippines faces rising costs in switch to LNG",
    "Trump criminal trial to start next March, with campaign in full swing",
    "Supreme Court's Roberts says committed to 'highest standards of conduct'",
    "UK's Rishi Sunak says interior minister will not face further probe",
    "Analysis: For Spain's Socialists, regional elections a rehearsal for national vote",
    "Greece to appoint caretaker PM ahead of June repeat election",
    "Ukraine says Russia prevents Black Sea grain deal port operating",
    "AI startup Figure raises $70 million to build humanoid robots",
    "U.S. silicon photonics chip startup Ayar Labs gets AI funding boost",
    "EU, US to seek stopgap standards for AI, EU tech chief says",
    "Google-backed Anthropic raises $450 mln in latest AI funding",
    "Student lit deadly fire at Guyana school after phone confiscated, police say",
    "Colombia ex-president Uribe could go on trial in witness tampering case",
    "Ecuador's Lasso issues decree to boost investment",
    "Canada did not ignore intelligence on Chinese meddling, report says",
    "Honda to power Aston Martin's F1 title ambitions from 2026",
    "Spain arrests 7 after racist incidents targeting Vinicius Jr",
    "France prepares its guard against drone strikes, security threats",
    "No objections to Alonso, says Honda F1 boss",
    "Battle for Bakhmut: Scenes from the front lines",
    "Man arrested after U-Haul truck crashes near White House",
    "Last emperor of China's watch sells for record $6.2 mln in Hong Kong auction",
    "Italy's Bellocchio debuts 'Kidnapped' at Cannes, about Church abduction of Jewish boy",
    "Stars come out for Cannes premiere of Wes Anderson's 'Asteroid City'",
    "HBO's much-hyped 'The Idol' meant to be provocative, says Sam Levinson",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]