[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Bridgewater dumps bank stocks amid turmoil in first quarter -filings",
    "Elon Musk loses bid to end SEC 'muzzle' over tweets",
    "AI in Washington's crosshairs but consensus far from certain",
    "Microsoft wins EU antitrust approval for Activision deal vetoed by UK",
    "Vice Media files for bankruptcy as ad business suffers",
    "Flying car's wind tunnel tests completed by Brazil's upstart Eve",
    "U.S. Supreme Court spurns dispute over Monsanto class-action settlement",
    "Ukraine hails gains in Bakhmut as Zelenskiy wins more weapons in Europe",
    "Ukrainian troops gird for counteroffensive they hope will end war",
    "UN efforts to save Black Sea grain deal to continue in coming days",
    "US sees more indication of Russia, Iran defense cooperation",
    "How Wall Street is preparing for possible US debt default",
    "Biden, House Republicans prepare for critical US debt-ceiling talks",
    "Biden's budget vs. Republican debt ceiling bill on spending, deficits, taxes",
    "Two staffers in U.S. House Democrat's Virginia office attacked with baseball bat",
    "US special counsel faults FBI's handling of 2016 Trump-Russia probe",
    "DeSantis defunds diversity programs at Florida public colleges",
    "Analysis: Tesla’s new car-making process stokes debate among industry experts",
    "U.S. warns against crossing Mexico border illegally as Title 42 ends",
    "US Supreme Court takes up bid to revive South Carolina voting map deemed racially biased",
    "Canada PM Trudeau heads for Alberta as wildfires rage",
    "Ecuadorean authorities detain former energy minister in bribery probe",
    "Mexico asks Texas to halt costly cargo inspections; will file USMCA complaint",
    "Colombia's ELN guerrilla group warns of peace talks 'crisis'",
    "Ukrainian security agency says it suspects tycoon Firtash of embezzlement",
    "Macron courts Tesla's Musk and others to 'Choose France'",
    "Russia scrambles jet as France, Germany conduct NATO patrols",
    "Tunisian judge sentences opposition leader Ghannouchi to a year in absentia",
    "Senegal opposition leader appeals conviction threatening his presidential bid",
    "Islamist insurgents kill three Nigerian, Niger troops, wound 12",
    "Tech lifts Nasdaq, Treasury yields gain as debt ceiling debate plods on",
    "Djokovic says 'Big Four' rivalries made him tougher",
    "Fancied Alcaraz stunned by Hungarian qualifier Marozsan in Rome",
    "PGA Tour and LIV take feud to PGA Championship",
    "Korean player held in China in bribery probe - source",
    "Our top photos of the week",
    "Sweden wins Eurovision song contest",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Cannes director open to letting green activists onto red carpet",
    "Holy cow! Endangered seal draws dozens to Jaffa shore",
    "Zelenskiy collects Charlemagne Prize on behalf of Ukrainian people",
    "Eurovision 2023: Sweden's Loreen wins for a second time",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]