[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Exclusive: Texas to require state-backed charging stations to include Tesla plug",
    "Gannett sues Google, alleges online ad monopoly",
    "US FCC proposes to force cable TV operators to disclose full pricing",
    "Wall Street ends lower, pausing rally as Powell testimony looms",
    "Fed nominees say their focus is on beating inflation",
    "New US home construction surges by most in 3 decades in May",
    "Biden says risks posed by AI to security, economy need addressing",
    "Hunter Biden to plead guilty to tax crimes, reaches deal on gun charge",
    "What are the federal charges against Hunter Biden?",
    "Who is David Weiss, US prosecutor in Hunter Biden case?",
    "Russia strikes Kyiv, Zelenskiy says Moscow's forces being 'destroyed'",
    "Ukraine spy chief accuses Russia of 'mining' cooling pond at Zaporizhzhia nuclear plant",
    "At recovery summit, UK's Sunak to unveil major Ukraine support",
    "UN chief calls for acceleration of Black Sea grain deal exports",
    "Morning Bid: Markets lose steam, central banks not helping",
    "Titanic tourist sub missing for third day as search teams race clock",
    "Modi visits US to deepen ties, says no doubting India's position on Ukraine",
    "Arkansas ban on gender-affirming care for minors blocked by U.S. judge",
    "Prosecutor fights Trump bid to oust judge in New York hush-money case",
    "Ex New York police sergeant convicted of acting as Chinese agent in 'Fox Hunt' trial",
    "U.S. judge sets Aug. 14 trial date for Trump in Florida documents case",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Dimon may have ordered JPMorgan's review of Epstein ties, Virgin Islands says",
    "Suspected smugglers deny charges over migrant shipwreck off Greece",
    "Influencer Andrew Tate indicted in Romania for trafficking women",
    "UK minister says talks to restore Northern Ireland government moving slowly",
    "Estonia becomes first central European country to allow same-sex marriage",
    "Exclusive: Gambia tightens rules for Indian drugs after cough syrup deaths",
    "Sudanese civilians killed and shot at as they flee Darfur city by foot",
    "Rwandan genocide accused abandons South African bail, seeks asylum",
    "Ugandan students' parents submit DNA samples to ID massacre victims",
    "Palestinian gunmen kill four Israelis in West Bank",
    "Two local officials in northeast Syria killed by Turkish drone, Kurdish authorities say",
    "Lawyers elect leader with clout in Israel's judicial crisis",
    "Turkey lifts minimum wage by 34% to address inflation",
    "Cummins the hero as Australia edge England in Ashes thriller",
    "MLB roundup: Joey Votto stars in return for streaking Reds",
    "Kante leaves Chelsea to join Saudi champions Al-Ittihad",
    "Ronaldo gives Portugal late win on 200th international appearance",
    "On the frontlines of Ukraine's counteroffensive",
    "Americans mark Juneteenth with marches, music and reflection",
    "Pharrell Williams stages Louis Vuitton debut on Pont Neuf",
    "'And Just Like That': Carrie Bradshaw is back for spinoff season two",
    "New V&A show 'DIVA' salutes and studies top stars",
    "'Dahmer' producer Ryan Murphy plans to leave Netflix for Disney, Bloomberg reports",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]