[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "U.S. regional bank stocks fall in skittish trading",
    "Exclusive: Iraq does not expect OPEC+ to make further cuts at June meeting",
    "US consumer sentiment drops to six-month low in May",
    "US import prices rebound in April, but trend remains weak",
    "Analysis: Jet orders boom as airlines fear shortage",
    "More than 2 million Toyota users face risk of vehicle data leak in Japan",
    "China regulator says Tesla to update software of more than 1 million cars",
    "Communities torn as Ukraine turns its back on Moscow-linked church",
    "Frontline residents evacuated to Russian-controlled port before expected counter-offensive",
    "Ukraine plays down talk of Bakhmut gains being start of counteroffensive",
    "South Africa hits back at U.S. accusations of arms shipment to Russia",
    "Erdogan rival says has evidence of Russia's online campaign ahead of Turkey election",
    "Erdogan's opponents vow fresh start on Turkish human rights",
    "Turkey's Erdogan, master campaigner, faces toughest contest yet",
    "Doctored video fuels tensions in Turkey's close election race",
    "New Twitter CEO may free Musk to steer Tesla through easing demand",
    "U.S. border city calm as Title 42 lifts and asylum restrictions take effect",
    "G7 finance chiefs debate reducing supply chain reliance on China",
    "Pakistan court orders Imran Khan's release on bail, lawyer says",
    "Podcast: Everything you need to know about Eurovision",
    "Former US Marine surrenders, to be charged in choking death on New York subway",
    "US Vice President Harris fundraises for 2024 in Georgia",
    "U.S. Postal Service cracking down on rising mail theft",
    "US lawmakers seek probe of how Elon Musk's brain chip venture oversees animal experiments",
    "Russia's Black Sea Fleet beefs up defences amid drone strikes -commander",
    "Turkey says Black Sea grain deal extension nearing",
    "Ukraine's anti-graft prosecutor says rule of law trumps trophy convictions",
    "Rise of Thailand’s youth party reflects still potent protest demands",
    "Liftoff: Modi's space push for India counts on private players",
    "Philippine court acquits top critic of ex-president Duterte's 'war on drugs'",
    "Papua foreign minister resigns role over coronation travel cost controversy",
    "Palestinian rockets fired towards Jerusalem, Israel keeps up strikes on Gaza",
    "Erdogan rival accuses Russia of 'deep fake' campaign ahead of presidential vote",
    "US lawmakers introduce bill to combat normalization with Syria's Assad",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Filipino priest on mission in Europe to halt fossil fuel financing",
    "Hollywood writers try to strike a love match while picketing",
    "Mexican artistic team keep Olympic dream alive by selling towels and swimsuits",
    "Eurovision 2023: From flags to food, Liverpool embraces Ukraine",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]