[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Ford Motor Co sues Blue Cross Blue Shield in antitrust case over ‘astronomical’ profit",
    "Explainer: Can a New York state law solve or trigger an emerging markets debt crisis?",
    "Canada commits to backing C$3 bln in new Trans Mountain oil pipeline loans",
    "US Supreme Court hands defeat to organized labor in truckers strike case",
    "Airbnb sues New York City over short-term rental restrictions",
    "Florence seeks to ban Airbnb rentals apartments from city centre, mayor says",
    "SpaceX's Starlink wins Pentagon contract for satellite services to Ukraine",
    "US Senate will stay in session until debt ceiling bill passed, Schumer says",
    "Treasury says further bill auctions depend on raising debt limit",
    "Analysis: US debt-ceiling deal averts disaster, but savings might be less than advertised",
    "Analysis: US debt-ceiling deal dooms Biden's revolutionary tax plans",
    "Russia says it repels border incursion; strikes on Kyiv kill three",
    "'Stop yelling': Top Chechen fighter scolds Russia's Wagner mercenary chief",
    "Newly approved US flights by Chinese airlines avoid Russian airspace",
    "Russia says US hacked thousands of Apple phones in spy plot",
    "Wall Street rises on hopes of Fed pausing hikes, debt ceiling deal cheer",
    "BRICS ministers put on show of strength as Putin arrest warrant looms large",
    "Nations that pledged to fight climate change are sending money to strange places",
    "Biden says Sweden will 'soon' join NATO at U.S. Air Force address",
    "US calls for UN meeting on North Korea's attempted satellite launch",
    "Oath Keeper convicted of sedition in US Capitol attack sentenced to 4.5 years",
    "FTC chair Khan accused of 'abuse of power' in new US House probe",
    "Biden trips and falls during graduation ceremony, recovers quickly",
    "Regulatory Oversightcategory",
    "FDA warns about safety risks of tailored weight-loss drugs",
    "Exclusive: Gambia hires US law firm to consider action on toxic Indian cough syrup, minister says",
    "Pfizer says its experimental antibiotic combo can treat some superbug infections",
    "Biden plans to pick physician Mandy Cohen to lead CDC -WaPo",
    "Chile's Boric to insist on shelved tax reform bill by end of July",
    "Brazil posts record trade surplus in May on surging exports",
    "US lawmakers say Brazil low-carbon fuel program blocks US companies",
    "Air Canada says flights stabilizing as IT system recovers",
    "Crowds clash with riot police as Senegal's Sonko sentenced to jail",
    "US imposes sanctions on companies tied to Sudan forces as fighting rages",
    "Ghana unions request time to mull $2.7 bln pension fund restructuring offer",
    "South Africa mulls options on ICC arrest warrant for potential visitor Putin",
    "Ruud, Swiatek gain momentum at French Open as Sinner punished",
    "Sabalenka, Djokovic hoping to steer clear of controversy",
    "Pulisic spearheads U.S. squad for CONCACAF Nations League title defence",
    "Our top photos from the month of May",
    "Along the brutal front lines of Bakhmut",
    "'The Rock' will return as Luke Hobbs in new 'Fast & Furious' film",
    "US National Spelling Bee finalists vie for championship",
    "What makes us human? Primate genome study offers some clues",
    "Protester turned protector, Ben-Gvir officiates uneasily at Jerusalem Pride",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]