[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Energy sector's COVID recovery turns into massive CEO payday",
    "Oil rises on Saudi plan to deepen output cuts from July",
    "Exclusive: Crypto giant Binance controlled ‘independent’ U.S. affiliate’s bank accounts",
    "Analysis: US hotel developers run out of cash as construction lending dries up",
    "Analysis: Strong economy puts Bank of Canada's 4-month rate hike pause in doubt",
    "Dollar bears bide their time as US economic strength persists",
    "Forever in debt: Why U.S. loans are getting longer",
    "Russia says it thwarted major Ukrainian offensive, Kyiv says Moscow spreads lies",
    "Russian police arrest more than 100 Navalny supporters, group says",
    "Analysis: A crowded 2024 Republican race helps clear the way for a Trump nomination",
    "Analysis: Debt-ceiling deal ignores US debt time bomb",
    "Morning Bid: Jobs glow, crude pops, dollar lifts",
    "Exclusive: Musk's Neuralink valued at about $5 bln despite long road to market",
    "Indian rail disaster probe opens as trains start running",
    "Fighter jets chase small plane in Washington area before it crashes in Virginia",
    "Podcast: Has Ukraine’s counter offensive begun?",
    "United Nations 'alarmed' by Hong Kong June 4 detentions",
    "Support dips for Indigenous recognition referendum in Australia, poll shows",
    "Hong Kong journalist wins appeal over accessing records to research attack on protesters",
    "Republican White House hopeful Nikki Haley attacks Trump, DeSantis over Ukraine",
    "McCarthy lauds U.S. debt ceiling deal, House conservatives divided",
    "Mexico's rulers scoop up opposition bastion ahead of presidency vote",
    "Panama ex-President Martinelli chosen as RM candidate for elections",
    "Mine collapse kills at least 12 in southern Venezuela",
    "Brazil's president Lula to come to Paris on June 22-23-Macron's office",
    "Jabeur swats aside Pera to move into French Open quarter-finals",
    "Exclusive: EXCLUSIVE-Olympics-IBA says has met reform criteria, accuses IOC of intransigence",
    "Gabe Vincent helps Heat beat Nuggets, level Finals at 1-1",
    "Russian Kasatkina feeling bitter after being booed at French Open",
    "Our top photos from the month of May",
    "Peeking into North Korea: Glimpses of daily life from across the border",
    "'Across the Spider-Verse' spins box office with $120.5 million debut",
    "Prince Harry to appear in court on Tuesday, judge 'surprised' by Monday's absence",
    "After rough start, UN plastic treaty talks end with mandate for first draft",
    "Village garbage man helped unearth ancient bronze statues in Tuscany",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]