[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "China's consumer inflation slows to over 2-year low, factory gate deflation deepens",
    "Asian stocks rise as US inflation cools",
    "Disney CEO questions continued Florida investment in clash with DeSantis",
    "China audits littered with deficiencies, US accounting watchdog finds",
    "Blackstone, Apollo were among about 20 bidders for SVB's assets",
    "Autos & Transportationcategory",
    "GM, VW face idled capacity risk in China without faster EV transition -Greenpeace",
    "US annual inflation slows to below 5%, price pressures still strong",
    "China and US debt woes may dominate G7 finance chiefs' talks",
    "US Congress, White House begin tough debt limit, budget negotiations",
    "Biden warns of recession unless Republicans back his debt ceiling plan",
    "Yellen, at G7, to underscore U.S. commitment to Ukraine for 'as long as it takes'",
    "How is the new Google AI search different from Bard chatbot?",
    "Google I/O 2023: Search king adds AI to respond to Microsoft challenge",
    "Google's AI is coming to more companies near you",
    "Trump jokes about sexual abuse verdict, repeats election falsehoods",
    "Chinese baby product firms seek to age up, sell more abroad as population falls",
    "Taiwan's wind industry braves cross-strait risks in clean energy boom",
    "Ukraine says it routs Russian brigade, Kremlin acknowledges 'very difficult' campaign",
    "Thailand's ex-PM Thaksin shakes up election with talk of return",
    "Disney shares slip as streaming losses narrow but some subscribers leave",
    "Beyond Meat expects sharper growth in second half, posts smaller loss",
    "Robinhood beats revenue estimates as rate hikes bolster interest income",
    "U.S. prosecutor query, quarterly loss hit already reeling shares of Icahn's company",
    "Pakistan calls in army to stop protest violence after ex-PM Khan's arrest",
    "China keeps up campaign to pressure critics abroad despite Western backlash",
    "Exclusive: Biden to sign defence pact in Papua New Guinea, with eyes on China",
    "South Korea to drop mandatory 7-day quarantine for COVID patients from June",
    "Embattled US Rep George Santos hit with fraud, money laundering charges",
    "Border crossings top 10,000 daily as migrants seek US entry before Title 42 ends",
    "Trump plays down consequences of a US default: 'Could be maybe nothing'",
    "US Army sergeant sentenced to 25 years for Black Lives Matter protester's murder",
    "The US COVID health emergency is ending. What changes?",
    "Chinese woman fighting for fertility rights hopes to end single mother stigma",
    "Altria agrees to $235 mln settlement to resolve Juul-related cases",
    "Battles shake Sudan's capital, ceasefire talks reported to make progress",
    "In Khartoum, civilians face desperate struggle to survive",
    "Kenya court denies bail for suspected death cult leader",
    "Ten killed in eastern Congo landslide after more heavy rains",
    "Scenes from the Westminster Dog Show",
    "Courtroom sketches from Trump's sexual abuse trial",
    "Reservoirs run dry in drought-hit Spain as summer looms",
    "US bankruptcy judge blocks NBA team Phoenix Suns' new TV deal",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Mothers may know best when it comes to money",
    "Human genome reboot better reflects global population",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]