[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US SEC charges crypto platform Coinbase, one day after suing Binance",
    "Autos & Transportationcategory",
    "Analysis: Ford's EV charging tie-up with Tesla ripples through industry",
    "Merck sues US government to halt Medicare drug price negotiation",
    "Apple to sell Vision Pro AR headset for triple Meta's top-line price",
    "Twitter's new CEO Linda Yaccarino logs first day in role",
    "Subway struggles to get big new franchisees to buy its US sandwich shops",
    "Stocks in limbo as Aussie hike provides rates reminder",
    "Villagers flee floods as huge Kakhovka dam destroyed in Ukraine war zone",
    "Nova Kakhovka dam attack: what do we know so far?",
    "Exclusive: Accounting for war - Ukraine's climate fallout",
    "Russia says U.S.-built F-16s could 'accommodate' nuclear weapons if sent to Ukraine",
    "Binance, US affiliate hit by net outflows of $790 mln in last 24 hours",
    "US sues Binance and founder Zhao over 'web of deception'",
    "Binance charges are a last gasp for crypto",
    "Exclusive: Crypto giant Binance controlled ‘independent’ US affiliate’s bank accounts",
    "Wall St slips as mixed data fuels Fed policy uncertainty",
    "PGA Tour, European Tour and LIV announce merger",
    "Iran presents its first hypersonic ballistic missile, state media reports",
    "Prince Harry tells London court 'vile' press has blood on its hands",
    "Trump backer-turned-critic Chris Christie to make White House run official",
    "U.S. public sees no clear winner in debt ceiling deal -Reuters/Ipsos",
    "White House vows an improved effort against drug overdoses",
    "U.S. House Republicans aim to defend gas-stove owners' 'freedoms'",
    "Ukraine denounces Russia as 'terrorist state' at World Court hearing",
    "French pension plan protesters briefly storm Summer Olympics HQ",
    "Kosovo open to new elections in municipalities hit by unrest, minister says",
    "Breakthrough on stalled EU migration deal coming this week - official",
    "About 83 bodies remain unidentified four days after Indian rail crash",
    "Philippines, Japan, U.S. hold first trilateral coast guard manoeuvres",
    "Thailand's Pita confident of surviving move to thwart his PM bid",
    "Why dangerous encounters by US and Chinese militaries look set to continue",
    "Blinken heads to Saudi Arabia amid strained ties, Israel normalization in mind",
    "Mother of slain Palestinian child calls for justice",
    "Egypt's Sisi and Israel's Netanyahu discuss border shooting, emphasise joint investigation",
    "Short of animals, Gaza Zoo fights to survive",
    "Belarusian Sabalenka fanning the flames, says Ukraine's Svitolina after handshake incident",
    "MLB roundup: Andrew Abbott, Reds blank Brewers",
    "IOC to hold executive board on Wednesday with boxing in focus-sources",
    "Inside the Apple developer's conference",
    "Celebrating Buddha's birthday",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "Austrian Social Democrats feted wrong new leader after ballot mix-up",
    "Japanese get trained in 'Hollywood' smiles as masks slowly come off",
    "For its 2024 Olympics, Paris wants the Seine river swimmable",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]