[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "U.S. Supreme Court preserves California humane pig confinement law",
    "Healthcare & Pharmaceuticalscategory",
    "Pfizer CEO calls US drug price plan 'negotiation with a gun to your head'",
    "'Risky jurisdiction': Aircraft lessors raise alarm over Go First crisis in India",
    "Tesla raises prices for all vehicles except Model 3 in US",
    "Apple to open first online shop in Vietnam in a push to emerging market",
    "Asian shares tentative on global growth concerns, Japan surges",
    "Big US banks to pay billions to replenish failure fund",
    "Live video: La Plaza bus station, Brownsville, Texascategory",
    "U.S. implements new strict asylum rules at Mexico border as Title 42 expires",
    "Podcast: Title 42's final hours",
    "Colombian migrants deported from U.S. tell of disappointment",
    "Rights group sues over Biden rule curbing asylum at U.S.-Mexico border",
    "Elon Musk says he has found new Twitter CEO",
    "Twitter's verified users get early access to encrypted messaging",
    "Elon Musk's bid to end tweet pre-approval faces skeptical court",
    "Biden, McCarthy debt ceiling meeting postponed, spending cuts on table",
    "Rise of Thailand’s youth party reflects still potent protest demands",
    "Liftoff: Modi's space push for India counts on private players",
    "Pakistan authorities gear for Imran Khan's supporters at his court hearing",
    "US judge strikes down federal law barring handgun sales to those under 21",
    "U.S., China look to move beyond balloon incident to stabilize ties",
    "Philippine court acquits top critic of ex-president Duterte's 'war on drugs'",
    "Top Pakistan court rules Imran Khan's arrest unlawful, streets are quiet",
    "EU plans to tweak China policy but keep balanced approach",
    "U.S. House passes Republican bill tightening border security",
    "Former US Marine to be charged in choking death on New York subway",
    "Eisai, Biogen Alzheimer's drug Leqembi would cost US Medicare up to $5 bln a year, study finds",
    "WHO declares end to mpox public health emergency",
    "Teen mental health emergency visits decline in U.S. as pandemic eases, CDC says",
    "US FDA eases restrictions on blood donation",
    "Mexico cooperating with U.S. to avoid chaos at border as Title 42 ends",
    "Canadian military deployed to help fight Alberta wildfires",
    "Mexico to launch database of over 100,000 'disappeared' people",
    "In Bakhmut's ruins, Ukraine says intensity of Wagner attacks growing",
    "Switzerland evacuates village threatened by vast rockfall",
    "Russia denies reports of Ukrainian breakthroughs along front lines",
    "EU lawmakers want more talks to strengthen proposed US data transfer pact",
    "Our top photos of the week",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Hollywood writers try to strike a love match while picketing",
    "Mexican artistic team keep Olympic dream alive by selling towels and swimsuits",
    "Eurovision 2023: From flags to food, Liverpool embraces Ukraine",
    "Hobbit houses spring up in Bosnia hills",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]