[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "EU considering major Tunisia aid package as migration surges",
    "Iran's Khamenei says 'nothing wrong' with a nuclear deal with West",
    "Fighting rages in Sudan's capital after 24-hour truce expires",
    "Annecy gathers in support of knife attack victims",
    "Pope skips Sunday blessing, recovering normally from surgery",
    "Three die, farmland and trees damaged as storms sweep across China",
    "Convicted 'Unabomber' Ted Kaczynski dead at 81",
    "What is the Espionage Act and what might it mean for Donald Trump?",
    "Trump magnifies attacks on Justice Department after his indictment",
    "Trump faces difficult odds in classified-documents case",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "Prigozhin says Wagner will not sign any contract with Russian defence minister",
    "Kherson's unending nightmare: Occupation, shelling and floods",
    "Russia says it hits Leopard tanks, U.S. Bradley vehicles in Ukraine",
    "Ukraine says it retakes village in 'first results' of counterattack",
    "Exclusive: India rail crash probe focuses on manual bypass of track signal",
    "Former Scottish leader Nicola Sturgeon arrested over SNP funding probe",
    "LGBTQ community celebrates Pride in the face of online and offline attacks",
    "Warren Buffett – he invests just like us!",
    "Please take your seats - French Open empty stands disappoint again",
    "Germany refusing Intel's additional demand for subsidies for chip plant, Financial Times reports",
    "Illumina CEO Francis DeSouza resigns after battle with Icahn",
    "Billionaire George Soros hands control of empire to son, Wall Street Journal reports",
    "BioNTech faces first German lawsuit over alleged COVID vaccine side effects",
    "OPEC+ working against 'uncertainities and sentiment,' Saudi energy minister says",
    "EU to try again for renewable energy deal after nuclear row",
    "Iraq to pay $2.76 billion in gas and electricity debt to Iran",
    "Nord Stream sabotage probe turns to clues inside Poland, Wall Street Journal reports",
    "No rush to start clock at changeover, Djokovic argues with umpire",
    "Man City would miss impact of quiet but deadly Gundogan",
    "'We made history': Emotional Man City players hail treble success",
    "MLB roundup: Cubs' Kyle Hendricks takes no-hitter into 8th in win",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]