[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "US annual inflation slows to below 5%, price pressures still strong",
    "US airlines thrown a curveball as consumer habits change post-pandemic",
    "Altria agrees to $235 mln settlement to resolve Juul-related cases",
    "Panasonic delays production of new Tesla battery to improve performance",
    "Lucid losses put Saudi Arabia's EV strategy in the headlamps",
    "Nasdaq rallies as investors cheer inflation data, Alphabet",
    "U.S. prosecutors look at short selling in bank shares - source",
    "Embattled US Rep George Santos hit with fraud, money laundering charges",
    "Google's AI is coming to more companies near you",
    "Google I/O 2023: Search king adds AI to respond to Microsoft challenge",
    "Microsoft skips pay hikes this year amid sharp focus on AI",
    "Explainer: How is the new Google AI search different from Bard chatbot?",
    "Migrants risk life and limb to jump Mexico trains in rush to border",
    "Ukraine says it routs Russia brigade, Kremlin admits campaign 'very difficult'",
    "US Army sergeant sentenced to 25 years for Black Lives Matter protester's murder",
    "U.S. FDA advisers back Perrigo birth control pill for over-the-counter use",
    "Disney shares slip as company loses streaming subscribers",
    "Beyond Meat keeps losses in check with cost cuts; shares rise",
    "Robinhood beats revenue estimates as rate hikes bolster interest income",
    "U.S. prosecutor query, quarterly loss hit already reeling shares of Icahn's company",
    "Italian fashion group Tod's sales jump in Q1, beating expectations",
    "Border crossings top 10,000 daily as migrants seek U.S. entry before Title 42 ends",
    "Explainer: What's next for Trump after civil rape verdict?",
    "US Congress, White House begin tough debt limit, budget negotiations",
    "US appeals court overturns first 'Varsity Blues' scandal convictions",
    "The US COVID health emergency is ending. What changes?",
    "Healthcare & Pharmaceuticalscategory",
    "Insulin makers testify on Capitol Hill over prices",
    "BioNTech, Roche's experimental pancreatic cancer treatment wins Nature plaudit",
    "Martin Shkreli-founded drug company files for bankruptcy",
    "Serbians surrender over 3,000 pieces of weapons after mass shootings",
    "Female murder probe re-examines 22 European cold cases",
    "Spain to ban some outdoor working during extreme heat conditions",
    "Daily Mirror apologises to Prince Harry over unlawful information gathering",
    "Battles shake Sudan's capital as power struggle escalates",
    "Kenya court denies bail for suspected death cult leader",
    "Ten killed in eastern Congo landslide after more heavy rains",
    "Six dead after Tunisia synagogue shooting, president blames 'criminals'",
    "Scenes from the Westminster Dog Show",
    "Courtroom sketches from Trump's sexual abuse trial",
    "Reservoirs run dry in drought-hit Spain as summer looms",
    "US bankruptcy judge blocks NBA team Phoenix Suns' new TV deal",
    "Pop duo Tvorchi to show Ukraine's 'Heart of Steel' at Eurovision",
    "Return of Benin Bronzes delayed after Nigerian president's decree",
    "Dolly Parton reveals starry list of collaborators for first rock album",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]