[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Militants kill 37, abduct six others in attack on Ugandan school",
    "Australian senator quits Liberal Party after allegations of misconduct",
    "Cyclone leaves 11 dead, 20 missing in southern Brazil",
    "'Vucic out': Serbian protesters keep heat on government",
    "Malians vote in referendum paving the way to elections",
    "Mexican officials find 129 migrants in truck amid heat wave",
    "Israel could accept U.S.-Iran nuclear 'understanding', senior lawmaker says",
    "Blinken lands in China on rare trip with hopes low for any breakthrough",
    "Exclusive: Xi Jinping tells Bill Gates he welcomes U.S. AI tech in China",
    "Pentagon chief expresses optimism over eventual China talks",
    "US plays down chance of breakthrough from Blinken's China visit",
    "Putin rebuts key elements of African peace plan for Ukraine",
    "Ukraine tells African leaders no peace talks with Russia",
    "Putin says Russia put nuclear bombs in Belarus as warning to West",
    "Russia is highly likely behind Ukraine dam collapse, experts say",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "For groups fighting U.S. opioid crisis, settlement money can be hard to come by",
    "A dozen French police wounded in clashes with protesters opposing rail link in Alps",
    "Ceasefire agreed as air strikes pummel Sudanese capital, killing 17",
    "Microsoft says early June service outages were cyberattacks",
    "Nidec to form joint venture with Brazil's Embraer to make flying car parts",
    "Binance, SEC strike deal to keep US customer assets in country",
    "Aerospace & Defensecategory",
    "Boeing boosts 20 year outlook for planes due to narrowbody demand",
    "WestJet to shut down Sunwing Airlines",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Verstappen on pole after wild Canadian GP qualifying",
    "ATP roundup: Frances Tiafoe reaches Stuttgart final",
    "WTA roundup: Russian stars to clash in Dutch final",
    "Fowler shares U.S. Open lead heading into final round",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Seoul hosts large crowds as BTS fans celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]