[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall Street rebounds as upbeat economic data allays slowdown fears",
    "Tesla charging technology put on fast track to become US standard",
    "Apple fails to end lawsuit over CEO Tim Cook's China sales comment",
    "Cryptoverse: Bitcoin bounces on BlackRock buzz",
    "US consumer confidence races to 17-month high; housing market regaining strength",
    "Healthcare & Pharmaceuticalscategory",
    "Obesity drug Wegovy's popularity has US employers rethinking insurance coverage",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Explore the specific ties to slavery among U.S. elite",
    "Reparations: Where slavery’s descendants stand",
    "Resources to explore your own family history",
    "US Supreme Court rejects bid to give lawmakers unchecked power over elections",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "Supreme Court leans toward limiting judicial scrutiny of U.S. elections",
    "How the grass plays at Wimbledon",
    "Wagner mutiny exposes risks for China's deep Russian ties",
    "Explainer: The China-U.S. military chill: do they talk at all?",
    "Indictment details plan to steal Samsung secrets for Foxconn China project",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "Trump lawyers to ask federal court to hear NY hush-money case",
    "Trump team lobbying for primary rule changes to boost his 2024 chances",
    "South Carolina top court appears open to upholding new abortion ban",
    "Jan. 6 U.S. Capitol attack preceded by intelligence agency failures - Senate report",
    "Analysis: Mexico's Lopez Obrador has a farm problem",
    "Analysis: Bolivia's creaking big state model rings warning bell in South America",
    "Honduras military takes over prisons after dozens die in riot",
    "Bus of migrants help mother give birth in Mexico before being detained",
    "Analysis: Belarus leader, long the supplicant, feted in Russia after mutiny role",
    "After Wagner mutiny, jailed Kremlin critic Navalny asks who is the real extremist?",
    "More than 30 arrested in latest Italy raid against 'Ndrangheta mafia",
    "Prince Harry should get just 500 pounds in phone-hacking case, London court told",
    "U.N. peacekeeping mission in Mali to end on June 30 - French draft resolution",
    "Over 1 million may flee Sudan conflict, UN refugee agency says",
    "Sudanese in Israel watch in anguish as Darfur violence unfolds",
    "Sierra Leone main opposition party rejects partial presidential poll results",
    "Bedard offers Blackhawks a chance to fast-track the rebuild",
    "WTA tweaks circuit with plans for pay parity in top events by 2027",
    "Manchester United raises annual forecast amid Champions League return",
    "Kovacic joins Man City from Chelsea on four-year deal",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "A Minute With: John Krasinski and 'Jack Ryan' cast on saying goodbye to show",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Lewis Capaldi takes tour break to 'adjust to impact' of Tourette syndrome",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]