[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "India to withdraw 2,000-rupee notes from circulation",
    "Iran says it executes leader of women trafficking network",
    "'War is not an option', Taiwan president says amid China tensions",
    "Alberta on high alert for wildfire upsurge over scorching holiday weekend",
    "Turks abroad begin voting in presidential election runoff",
    "White daisies bloom in Uruguay's streets, in memory of dictatorship missing",
    "After fleeing conflict, displaced women face rape in east Congo",
    "Ukraine's Zelenskiy courts 'Global South' at G7 summit",
    "Podcast: What's the G7 to do about China?",
    "Zelenskiy gets warm welcome at G7 summit",
    "G7 alarms climate activists over support for gas investments",
    "Washington quiet as debt ceiling deadline inches closer",
    "Republican Clay Higgins pushes cuts in US debt ceiling fight but brings home millions",
    "Wall Street closes down, dollar dips as debt ceiling talks stall",
    "Oil slips as debt talks pause, Fed warns of high inflation",
    "Trump or DeSantis? Neither, say Ukrainian-American voters angry at war stance",
    "Russia's Wagner claims Bakhmut; Kyiv says situation critical",
    "Air strikes hit Khartoum's outskirts as Sudan's war enters sixth week",
    "Breakingviews: Disney can play Scrooge with Florida",
    "No joke: China's backlash against stand-up stirs fear of comedy clampdown",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "Brittney Griner greeted by US VP Harris in return to court",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Pentagon leak suspect Jack Teixeira ordered to remain in jail ahead of trial",
    "JPMorgan, ex-executive spar in court over responsibility for Epstein",
    "Morgan Stanley's Aussie CEO Gorman transformed bank, deal by deal",
    "Lawsuit over Trident 'Original Flavor' gum is dismissed",
    "Wall St Week Ahead Artificial intelligence gives real boost to U.S. stock market",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Mexico City airport shuts down operations due to volcanic ash",
    "Villagers evacuated as wildfire ravages woodlands in western Spain",
    "Liverpool top-four hopes hit despite late equaliser, Everton grab vital point",
    "Man United beat Bournemouth to close on Champions League",
    "Firmino scores late goal to keep Liverpool's slim Champions League hopes alive",
    "MLB roundup: Rafael Devers homers twice as Red Sox top Padres",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Soggy Cannes premiere for Turkish director Ceylan's 'About Dry Grasses'",
    "Mick Jagger's daughter Jade fined for attacking police in Spain",
    "'Four Daughters' mixes documentary, fiction to portray Tunisian mother",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]