[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Militants kill 37, abduct six others in attack on Ugandan school",
    "'Vucic out': Serbian protesters keep heat on government",
    "A dozen French police wounded in clashes with protesters opposing rail link in Alps",
    "Israel could accept U.S.-Iran nuclear 'understanding', senior lawmaker says",
    "Spanish charity rescues 117 migrants sailing from Libya",
    "Barcelona gets Socialist mayor in consolation for prime minister Sanchez",
    "New Brazil poll shows President Lula's approval rating \"stable\" at 37%",
    "Putin rebuts key elements of African peace plan for Ukraine",
    "Ukraine tells African leaders no peace talks with Russia",
    "Putin says Russia put nuclear bombs in Belarus as warning to West",
    "Russia is highly likely behind Ukraine dam collapse, experts say",
    "For groups fighting U.S. opioid crisis, settlement money can be hard to come by",
    "US drug overdose deaths top 109,000 in the past year",
    "US will 'make every effort' to boost cooperation with China on fentanyl",
    "Purdue Pharma can protect Sackler owners in opioid bankruptcy",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Blinken set to land in China in rare trip with hopes low for any breakthrough",
    "Mexican officials find 129 migrants in truck amid heat wave",
    "Ceasefire agreed as air strikes pummel Sudanese capital, killing 17",
    "Elon Musk says Twitter video app for smart TVs is 'coming'",
    "Aerospace & Defensecategory",
    "Boeing boosts 20 year outlook for planes due to narrowbody demand",
    "WestJet to shut down Sunwing Airlines",
    "Binance, SEC strike deal to keep US customer assets in country",
    "Exclusive: Blackstone's Horizon head Scott Bommer to leave company",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Biden makes re-election pitch in key swing state Pennsylvania",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Verstappen on pole after wild Canadian GP qualifying",
    "ATP roundup: Frances Tiafoe reaches Stuttgart final",
    "WTA roundup: Russian stars to clash in Dutch final",
    "Fowler leads as U.S. Open third round gets underway",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Seoul hosts large crowds as BTS fans celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]