[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "U.S. regional bank stocks fall as investor fears persist",
    "Tesla owners sue over impact of software update on EV batteries",
    "US consumer sentiment plummets to six-month low on debt ceiling debacle",
    "Yellen: Still uncertainty about when Treasury will run out of cash",
    "Jet orders boom as airlines fear shortage",
    "More than 2 million Toyota users face risk of vehicle data leak in Japan",
    "Tesla raises US prices for all its vehicles except Model 3",
    "Uncertainty clouds U.S. transition at Mexico border as new rules take effect",
    "Rights group sues over Biden rule curbing asylum at U.S.-Mexico border",
    "Title 42: what is the US border policy and what happens when it ends?",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Debt ceiling worries deepen as early June U.S. default reinforced",
    "Biden to meet congressional leaders on debt early next week - White House",
    "Resolve debt limit dispute or no pay for U.S. lawmakers, House Democrat says",
    "US equity funds see massive outflows on debt ceiling worries",
    "Former PM Imran Khan granted bail, leaves court",
    "Musk nabs ex-NBCUniversal ad chief Yaccarino as new Twitter CEO",
    "Erdogan rival says has evidence of Russia's online campaign ahead of Turkey election",
    "G7 finance chiefs debate reducing supply chain reliance on China",
    "Exclusive: Iraq does not expect OPEC+ to make further cuts at June meeting",
    "Former US Marine charged with manslaughter in NYC subway choking death",
    "U.S. metals magnate Sabin sours on DeSantis, backs Scott in 2024 race",
    "U.S. Congressman George Santos agrees to settle lawsuit in Brazil",
    "Ukraine plays down talk of Bakhmut gains being start of counteroffensive",
    "Russia's Black Sea Fleet beefs up defences amid drone strikes -commander",
    "Turkey says Black Sea grain deal extension nearing",
    "Ukraine's anti-graft prosecutor says rule of law trumps trophy convictions",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: Wegovy, other weight loss drugs ‘no silver bullet’, says WHO amid obesity review",
    "FDA issues marketing denial for 6,500 flavored e-cigarettes",
    "Regulatory Oversightcategory",
    "US FDA approves Astellas Pharma's therapy for menopause hot flashes",
    "France tightens bird flu measures in southwest after new outbreaks",
    "Palestinian rockets fired towards Jerusalem, Israel kills militant leader",
    "Erdogan rival accuses Russia of 'deep fake' campaign ahead of presidential vote",
    "Turkey's Erdogan, master campaigner, faces toughest contest yet",
    "US lawmakers introduce bill to combat normalization with Syria's Assad",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Eurovision 2023: Sweden leads the betting ahead of Finland and Ukraine",
    "Filipino priest on mission in Europe to halt fossil fuel financing",
    "Hollywood writers try to strike a love match while picketing",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]