[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Fighting resumes in Sudan's capital after 24-hour truce expires",
    "Taiwanese minister to make rare Britain visit this week",
    "Syria's Kurds to begin trials for IS detainees",
    "Convicted 'Unabomber' Ted Kaczynski dead at 81",
    "U.S. gives Havana embassy a facelift after years of neglect",
    "Rain to help clear Canada's air soon, but days away from Quebec fires",
    "Child plane crash survivors in \"acceptable\" state of health",
    "Trump magnifies attacks on Justice Department after his indictment",
    "Trump faces difficult odds in classified-documents case",
    "Without naming Trump, Ron DeSantis condemns his indictment",
    "Factbox: How secret were the documents found at Mar-a-Lago?",
    "Kherson's unending nightmare through occupation, shelling and now floods",
    "Zelenskiy: Counteroffensive actions taking place in Ukraine",
    "Ukraine says Russia blew up Kakhovka dam to prevent offensive in south",
    "Michigan Republicans to change 2024 nomination process, may boost Trump",
    "Taiwan sends up fighters as Chinese warplanes cross strait's median line",
    "Exclusive: India rail crash probe is focusing on manual bypass of track signal",
    "Moscow court detains U.S. citizen on drug charges",
    "Honduras opens embassy in China after cutting ties to Taiwan",
    "Germany refusing Intel's additional demand for subsidies for chip plant - FT",
    "Activision intervenes in Microsoft challenge to UK regulator's block",
    "Twitter is refusing to pay its Google Cloud bills, Platformer reports",
    "BioNTech faces first German lawsuit over alleged COVID vaccine side effects",
    "PMA says US West Coast port workers shut down Port of Seattle; workers' union denies claim",
    "Bidens offer 'joy' at White House Pride event as LGBTQ attacks mount",
    "U.S. Supreme Court ruling brightens electoral map for Democrats in 2024",
    "Biden administration near deal to preserve preventive care coverage, for now",
    "Nunes retains bantamweight belt, calls time on glittering career",
    "'We made history': Emotional Man City players hail treble success",
    "Swiatek reigns supreme at French Open by quelling Muchova",
    "Taylor and Conners to try and make it Canada Day at national championship",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Ohanian and Williams sisters taking up golf with TGL ownership",
    "South Korea sea salt demand grows ahead of Japan's Fukushima contaminated water release",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]