[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "US weekly jobless claims hit 1-1/2-year high; inflation subsiding",
    "Healthcare & Pharmaceuticalscategory",
    "Pfizer CEO calls US drug price plan 'negotiation with a gun to your head'",
    "Elon Musk's bid to end tweet pre-approval faces skeptical court",
    "PacWest shares plunge after it reports drop in deposits",
    "Big U.S. lenders to pay billions to replenish bank failure fund",
    "Activist investor Elliott pushes for changes at Goodyear, shares jump",
    "Deposit outflows after SVB collapse concentrated among 'super-regionals' - NY Fed study",
    "Migrant detentions at U.S.-Mexico border hit record highs as Title 42 ends",
    "Podcast: Title 42's final hours",
    "Migrants risk their lives life and limb to jump Mexico trains",
    "Republicans ready tough border control bill for U.S. House passage",
    "Erdogan's rival boosted by withdrawal, poll lead ahead of Turkey vote",
    "Turkey's Erdogan, master campaigner, faces toughest contest yet",
    "Wall Street mostly lower with Disney; Alphabet lifts Nasdaq",
    "In Bakhmut's ruins, Ukraine says intensity of Wagner attacks growing",
    "Why the US delayed China sanctions after shooting down a spy balloon",
    "Space startup partners with SpaceX to launch commercial space station",
    "Eurovision 2023: From flags to food, Liverpool embraces Ukraine",
    "In Houston, homelessness volunteers are in a stand-off with city authorities",
    "Trump jokes about sexual abuse verdict, repeats election falsehoods",
    "U.S. Supreme Court tosses former Cuomo aide's bribery conviction",
    "US senators accuse Pentagon of hindering war crimes prosecution of Russia",
    "Wagner boss Prigozhin says situation on Russian flanks near Bakhmut is bad",
    "Shooting at German Mercedes plant kills two; production halted",
    "School children injured in Finland bridge collapse",
    "Swiss prepare to evacuate village threatened by vast landslide",
    "Sleepless Gazans keep children, essentials close as Israeli bombing goes on",
    "A year on, family and friends say no justice for slain Al Jazeera journalist",
    "In southern Israel, Gaza rockets destroy woman's home for the second time",
    "US lawmakers introduce bill to combat normalization with Syria's Assad",
    "Top Pakistan court rules Imran Khan's arrest unlawful, streets are quiet",
    "China completes warship deliveries to Pakistan as military alliance grows",
    "In Malaysia, migrants say they are in limbo after promised jobs fall through",
    "What sparked ethnic clashes in India's Manipur",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Scenes from the Westminster Dog Show",
    "Hobbit houses spring up in Bosnia hills",
    "Michael J. Fox talks Parkinson's and perseverance in documentary 'Still'",
    "Last known speaker fights to preserve South African indigenous language",
    "Rising sol: Peru's currency at year-high after shaking off protest impact",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]