[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Vast China-Russia resources trade shifts to yuan from dollars in Ukraine fallout",
    "China's slow consumer inflation, deepening factory gate deflation to test policy",
    "Disney CEO questions continued Florida investment in clash with DeSantis",
    "China audits littered with deficiencies, US accounting watchdog finds",
    "India tax department searches Mankind Pharma's office - source",
    "EV maker Rivian takes bold bet with higher-priced vehicles amid heating competition",
    "Emirates airline creates $200 mln aviation sustainability fund",
    "How Russians end up in a far-right militia fighting in Ukraine",
    "Ukraine says it routs Russian brigade, Kremlin acknowledges 'very difficult' campaign",
    "US debt standoff overshadows G7 finance leaders' meeting",
    "US Congress, White House begin tough debt limit, budget negotiations",
    "Morning Bid: US debt drama crashes Japan's G7 party",
    "Yellen, at G7, to underscore U.S. commitment to Ukraine for 'as long as it takes'",
    "Trump jokes about sexual abuse verdict, repeats election falsehoods",
    "Why the US delayed China sanctions after shooting down a spy balloon",
    "Taiwan's wind industry braves cross-strait risks in clean energy boom",
    "Pakistan arrests ex-PM Khan's party leaders as protests continue",
    "Chinese baby product firms seek to age up, sell more abroad as population falls",
    "Disney shares slip as streaming losses narrow but some subscribers leave",
    "Beyond Meat expects sharper growth in second half, posts smaller loss",
    "Robinhood beats revenue estimates as rate hikes bolster interest income",
    "U.S. prosecutor query, quarterly loss hit already reeling shares of Icahn's company",
    "Myanmar makes no progress on peace; ASEAN needs unity - Indonesia",
    "Thailand's ex-PM Thaksin shakes up election with talk of return",
    "China keeps up campaign to pressure critics abroad despite Western backlash",
    "Campaigns against Indigenous referendum gather strength in Australia",
    "New Zealand PM Hipkins to visit Papua New Guinea for U.S.–Pacific summit",
    "Embattled US Rep George Santos hit with fraud, money laundering charges",
    "Border crossings top 10,000 daily as migrants seek US entry before Title 42 ends",
    "Trump plays down consequences of a US default: 'Could be maybe nothing'",
    "Chinese woman fighting for fertility rights hopes to end single mother stigma",
    "The US COVID health emergency is ending. What changes?",
    "Altria agrees to $235 mln settlement to resolve Juul-related cases",
    "Healthcare & Pharmaceuticalscategory",
    "Japan's Otsuka Pharma gets FDA approval for Alzheimer's agitation drug",
    "Battles shake Sudan's capital, ceasefire talks reported to make progress",
    "Analysis: North Africa backslides toward swirling debt troubles",
    "In Khartoum, civilians face desperate struggle to survive",
    "Kenya court denies bail for suspected death cult leader",
    "Scenes from the Westminster Dog Show",
    "Courtroom sketches from Trump's sexual abuse trial",
    "Reservoirs run dry in drought-hit Spain as summer looms",
    "US bankruptcy judge blocks NBA team Phoenix Suns' new TV deal",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Mothers may know best when it comes to money",
    "Human genome reboot better reflects global population",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]