[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall Street closes higher as upbeat economic data allays slowdown fears",
    "Tesla charging technology put on fast track to become US standard",
    "Apple fails to end lawsuit over CEO Tim Cook's China sales comment",
    "Italy to crack down on e-scooters after deaths and accidents",
    "Cryptoverse: Bitcoin bounces on BlackRock buzz",
    "Healthcare & Pharmaceuticalscategory",
    "Obesity drug Wegovy's popularity has US employers rethinking insurance coverage",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Explore the specific ties to slavery among U.S. elite",
    "Reparations: Where slavery’s descendants stand",
    "Resources to explore your own family history",
    "US Supreme Court rejects bid to give lawmakers unchecked power over elections",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "Supreme Court leans toward limiting judicial scrutiny of U.S. elections",
    "Analysis: In U.S. Supreme Court elections case, politicians could win either way",
    "How the grass plays at Wimbledon",
    "Wagner mutiny exposes risks for China's deep Russian ties",
    "Explainer: The China-U.S. military chill: do they talk at all?",
    "Indictment details plan to steal Samsung secrets for Foxconn China project",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "Trump lawyers to ask federal court to hear NY hush-money case",
    "South Carolina top court appears open to upholding new abortion ban",
    "Georgia election official Raffensperger to speak with Jan. 6 investigators",
    "Trump team lobbying for primary rule changes to boost his 2024 chances",
    "Maverick Mexican politician Xochitl Galvez throws hat in ring for presidency",
    "Analysis: Mexico's Lopez Obrador has a farm problem",
    "Analysis: Bolivia's creaking big state model rings warning bell in South America",
    "Honduras military takes over prisons after dozens die in riot",
    "Analysis: Belarus leader, long the supplicant, feted in Russia after mutiny role",
    "After Wagner mutiny, jailed Kremlin critic Navalny asks who is the real extremist?",
    "More than 30 arrested in latest Italy raid against 'Ndrangheta mafia",
    "Prince Harry should get just 500 pounds in phone-hacking case, London court told",
    "U.N. peacekeeping mission in Mali to end on June 30 - French draft resolution",
    "Over 1 million may flee Sudan conflict, UN refugee agency says",
    "Sudanese in Israel watch in anguish as Darfur violence unfolds",
    "Sierra Leone main opposition party rejects partial presidential poll results",
    "Bedard offers Blackhawks a chance to fast-track the rebuild",
    "Lopez extends career by a day at least with emotional Mallorca win",
    "WTA roundup: Jessica Pegula, Coco Gauff cruise in England",
    "England's Bright says injury a blessing in disguise ahead of World Cup",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "A Minute With: John Krasinski and 'Jack Ryan' cast on saying goodbye to show",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Lewis Capaldi takes tour break to 'adjust to impact' of Tourette syndrome",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]