[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Dow, S&P 500 fall with Disney; PacWest leads regional banks lower",
    "U.S. Supreme Court preserves California humane pig confinement law",
    "Disney shares fall most since Iger's return after streaming subscriber losses",
    "Healthcare & Pharmaceuticalscategory",
    "Pfizer CEO calls US drug price plan 'negotiation with a gun to your head'",
    "Big U.S. banks to pay billions to replenish failure fund",
    "Aerospace & Defensecategory",
    "Southwest pilots vote to authorize strike",
    "Beyond Meat tumbles to new low after seeking to raise $200 million",
    "Migrant detentions at U.S.-Mexico border hit record highs as Title 42 ends",
    "Podcast: Title 42's final hours",
    "Colombian migrants deported from U.S. tell of disappointment",
    "U.S. House passes Republican bill tightening border security",
    "Elon Musk says he has found new Twitter CEO",
    "Twitter's verified users get early access to encrypted messaging",
    "Elon Musk's bid to end tweet pre-approval faces skeptical court",
    "Biden, McCarthy debt ceiling meeting postponed, spending cuts on table",
    "Israel kills senior Gaza commanders as rockets cause first death in Israel",
    "In Bakhmut's ruins, Ukraine says intensity of Wagner attacks growing",
    "Former US Marine to be charged in choking death on New York subway",
    "US lawmakers introduce bill to combat normalization with Syria's Assad",
    "New York sues company that sold accessory for Buffalo mass shooter's gun",
    "U.S. homeland security chief says border facilities strained by new arrivals",
    "U.S. Supreme Court tosses former Cuomo aide's bribery conviction",
    "Eisai, Biogen Alzheimer's drug Leqembi would cost US Medicare up to $5 bln a year, study finds",
    "WHO declares end to mpox public health emergency",
    "Teen mental health emergency visits decline in U.S. as pandemic eases, CDC says",
    "US FDA eases restrictions on blood donation",
    "Mexico cooperating with U.S. to avoid chaos at border as Title 42 ends",
    "Venezuela, Colombia to increase military presence along shared border",
    "Ecuador's embattled president launches proposal to cut taxes",
    "Haiti conflict puts over 100,000 kids at risk of starving to death, UN says",
    "Sleepless Gazans keep children, essentials close as Israeli bombing goes on",
    "A year on, family and friends say no justice for slain Al Jazeera journalist",
    "In southern Israel, Gaza rockets destroy woman's home for the second time",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Scenes from the Westminster Dog Show",
    "Eurovision 2023: From flags to food, Liverpool embraces Ukraine",
    "Hobbit houses spring up in Bosnia hills",
    "Michael J. Fox talks Parkinson's and perseverance in documentary 'Still'",
    "Last known speaker fights to preserve South African indigenous language",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]