[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Chinese chipmakers' shares rise after China fails Micron in security review",
    "China holds lending rates steady; cautious on weak yuan, capital outflow risk",
    "Australia to regulate buy-now-pay-later sector",
    "Instagram back up after global outage affecting thousands of users",
    "India's note withdrawal to improve liquidity, ease short-term rates - analysts",
    "Oil slips as U.S. debt caution offset supply concerns",
    "Australia gets U.S. backing for critical minerals industry",
    "Ukraine aims to encircle Bakhmut as Russia says it captures city",
    "China summons Japanese ambassador over actions at G7",
    "Russia says F-16 transfer to Ukraine would raise questions of NATO's involvement",
    "Russia launches overnight air attack on Ukraine's Dnipro - governor",
    "Biden and McCarthy to meet on Monday as debt ceiling talks resume",
    "Yellen says June 1 is 'hard deadline' for raising debt ceiling",
    "White House, Republicans trade barbs as debt talks paused",
    "Could Biden use the 14th Amendment to raise the debt ceiling?",
    "Markets edgy as US debt ceiling talks near crunch time",
    "China fails Micron's products in security review, bars some purchases",
    "Modi, Blinken meet Pacific Island leaders in Papua New Guinea",
    "Greece's ruling Conservatives win vote but fall short of majority",
    "Mount Etna eruption halts flights to Sicily's Catania airport",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "'Killers of Flower Moon' star says Native Americans need allies like Scorsese",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "MLB roundup: Surging Cardinals down Dodgers for fourth straight series win",
    "Vinicius Jr calls LaLiga and Spain racist for chants after sending-off",
    "Man City celebrate Premier League title with 1-0 win over Chelsea",
    "Trevi Fountain water turns black in Rome climate protest",
    "Italy's Meloni vows support for flood-hit Emilia-Romagna",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Mexico City airport resumes operations after volcanic ash forces shutdown",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "'Firebrand' puts spotlight on Henry VIII's sixth and final wife",
    "'May December' director: women pay higher price than men for breaking rules",
    "Jennifer Lawrence-produced Afghan documentary premieres at Cannes",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]