[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Tesla to hit record quarterly sales in China even as market share shrinks - analysts",
    "Chinese payment giants revive effort to accept foreign credit cards",
    "Analysis: Contrarians bet U.S. energy shares will shake doldrums in 2023's second half",
    "European shares climb, yen stumbles and euro shines",
    "US banks scramble on research fees as reprieve on European rules runs out",
    "Explore the specific ties to slavery among U.S. elite",
    "Here are some resources for researching your ancestry",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Lukashenko says Putin wanted to 'wipe out' Prigozhin during mutiny attempt",
    "East Europe NATO allies say Wagner troops in Belarus spell trouble",
    "Cheap Russian drone a menace to Ukrainian troops and equipment",
    "Death toll rises to nine in Russian attack on Ukraine's Kramatorsk - mayor",
    "Morning Bid: G4 central bankers speak, chips wars rumble",
    "Youths clash with police near Paris after teenager shot dead in traffic stop",
    "Biden tries to flip skeptical Americans on his economic plan",
    "Exclusive: Islamists wield hidden hand in Sudan conflict, military sources say",
    "Exclusive: Indian firm used toxic industrial-grade ingredient in syrup",
    "Most Americans support US arming Ukraine -Reuters/Ipsos",
    "Trump sues E. Jean Carroll for defamation after jury finds he sexually abused her",
    "Relentless heat wave scorches US South, air quality deteriorates over Midwest",
    "Over $200 billion potentially stolen from U.S. COVID relief programs, watchdog says",
    "Berlin and Paris 'missing in action' as EU lacks leadership in defence - report",
    "Kevin Spacey arrives at London court for sex offence trial",
    "One in seven Britons faced hunger in 2022, says food bank charity",
    "South Korea unveils sanctions on Russian national over North's weapons programmes",
    "Taiwan says it spots two Russian warships off its east coast",
    "Australian defence minister in Solomon Islands for security talks",
    "Thai protesters acquitted over run-in with queen's motorcade",
    "Mexico proposes handing control of capital airport to its navy",
    "After 89 days, Colombia lowers activity alert at Nevado del Ruiz volcano",
    "Maverick Mexican politician Xochitl Galvez throws hat in ring for presidency",
    "MLB roundup: Shohei Ohtani hits two homers, fans 10",
    "ECB calls for 500,000 pounds fine for Yorkshire over Rafiq case",
    "'I'm still cool': US World Cup squad bridges generational divide",
    "Lehmann most influential women's player on Instagram ahead of World Cup",
    "Journey to Mecca: Images from the Haj pilgrimage",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Warner Bros, NetEase launch 'Harry Potter: Magic Awakened' video game",
    "Coming to a US city near you: An 825-pound Alex Morgan statue",
    "Angela Bassett, Mel Brooks to get honorary Oscars",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]