[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Stocks rally stalls, eyes Powell testimony for rate clues",
    "Goldman Sachs cuts China growth forecast as property slowdown bites",
    "JD.com sales during China shopping festival better than expected -analysts",
    "Oil slides more than 1% on China growth uncertainties",
    "Indonesia, SpaceX launch satellite to boost internet connectivity",
    "Ukraine starts 2023 grain harvest",
    "Biman Bangladesh to buy 10 Airbus jets, breaking Boeing reliance -minister",
    "Blinken to meet Xi during pivotal China trip to salvage frosty ties",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Olaf Scholz faces tricky balancing act in Germany-China talks",
    "U.S. Secretary of State Blinken to meet with Chinese President Xi Jinping",
    "Russia reports fierce fighting, Zelenskiy praises troops, counter-offensive",
    "Ukraine targets seeks $40 billion for 'Green Marshall Plan'",
    "EU to accelerate arms shipments to Ukraine",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "China seen cutting key lending benchmarks as economy slows",
    "Their parents made China the world's factory. Can the kids save the family business?",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Trump lacked power to declassify secret nuclear arms document, experts say",
    "UK lawmakers set to back report that Boris Johnson misled them over 'partygate'",
    "Scores die in northern India as heat wave scorches region",
    "Australian Senate paves way for landmark referendum on Indigenous voice in constitution",
    "Cathay Pacific to hire cabin attendants from mainland China from July",
    "Berkshire Hathaway adds to Japan trading company holdings",
    "Spain's conservative PP party widens lead ahead of national election, poll shows",
    "Late push for coal subsidies upsets EU deal on energy reforms",
    "Biden will announce $600 million in climate investments during California trip",
    "Family sues Akron and 8 officers who shot Jayland Walker",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "Judge orders Enbridge to shut down portions of Wisconsin pipeline within three years",
    "Hollywood ending for U.S. Open champion Clark",
    "Defending champions U.S. beat Canada in CONCACAF Nations League final",
    "Alcaraz hopes to quickly adapt to grass after Paris disappointment",
    "McIlroy's major drought goes on after near-miss at U.S. Open",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Coffee research group progresses on naturally decaffeinated varieties",
    "Ticketmaster, others agree to upfront, all-in prices as part of Biden war on junk fees",
    "Saturn's icy moon Enceladus harbors essential elements for life",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]