[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Japan's wholesale inflation eases, goods close to consumers continue to rise",
    "China's Nio cuts prices, ends free battery swapping as sales slide",
    "Fossil fuel company net zero plans 'largely meaningless,' report says",
    "Several Chinese lenders cut yuan deposit rates from Monday",
    "Illumina CEO deSouza resigns after proxy battle with Icahn",
    "Andreessen Horowitz to open its first international office in London",
    "China's installed non-fossil fuel electricity capacity exceeds 50% of total",
    "Ukraine says it retakes village in 'first results' of counterattack",
    "Kherson's unending nightmare: Occupation, shelling and floods",
    "Russia says it hits Leopard tanks, U.S. Bradley vehicles in Ukraine",
    "UN nuclear watchdog concerned over water levels at Ukraine plant",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "Trump is 'toast' if classified records case is proven, ex-attorney general says",
    "What might the Espionage Act mean for Donald Trump?",
    "How secret were the documents found at Mar-a-Lago?",
    "Asia shares near month high ahead of central bank meetings",
    "North Korea's Kim vows to 'hold hands' with Putin for strategic cooperation",
    "Wrestling start-up AEW tags up with New Japan in challenge to WWE behemoth",
    "Bus accident kills 10 wedding guests in Australia",
    "Billionaire George Soros hands control of empire to son Alex",
    "Portion of I-95 in Philadelphia collapses after vehicle engulfed by fire",
    "US House Speaker McCarthy hopes to 'get back on right track' after Conservative revolt",
    "LGBTQ community celebrates Pride in the face of online and offline attacks",
    "Michigan GOP to change 2024 nomination process, may boost Trump",
    "Oil edges lower ahead of Fed meeting",
    "OPEC+ working against 'uncertainities and sentiment,' Saudi energy minister says",
    "Sustainable Marketscategory",
    "EU to try again for renewable energy deal after nuclear row",
    "Grand Slam King Djokovic wins 23rd crown by conquering Ruud at French Open",
    "Shaped by hardship, Djokovic grateful for 'tennis mother' and 'tennis father'",
    "Manchester City's Rodri named Champions League Player of the Season",
    "Cagliari score stoppage-time winner to snatch promotion from Bari",
    "Defining photos from the Trump presidency",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "North American lobster industry confronts 'ropeless' traps after whale entanglements",
    "Scientists document how space travel messes with the human brain",
    "Scientists expand search for signs of intelligent alien life",
    "Village garbage man helped unearth ancient bronze statues in Tuscany",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]