[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Nasdaq to acquire financial software maker Adenza for $10.5 bln",
    "US Supreme Court's dog toy ruling puts parody products on notice",
    "Exclusive: Broadcom set to win EU nod for $61 bln VMware deal, sources say",
    "UBS completes Credit Suisse takeover to become wealth management behemoth",
    "US FTC seeks to block Microsoft's acquisition of Activision -source",
    "YouTube resolves composer's copyright lawsuit one day before trial",
    "UN chief backs idea of global AI watchdog like nuclear agency",
    "How torture, inaction underpin UAE’s thriving sex trafficking industry",
    "Trump flies to Florida to face charges in documents case",
    "Who is Evan Corcoran, Trump lawyer with outsized role in documents case?",
    "What might the Espionage Act mean for Donald Trump?",
    "How secret were the documents found at Mar-a-Lago?",
    "The Post-Pandemic Workforce",
    "Ukraine claims new gains in early phase of counteroffensive",
    "JPMorgan to settle with Epstein victims for $290 million -source",
    "Silvio Berlusconi: former Italian prime minister has died at 86",
    "Analysis: EV charger makers guardedly look to adopt Tesla standard",
    "Biden reschedules meeting with NATO leader after root canal treatment",
    "Philadelphia I-95 highway collapse snarls morning commute",
    "'Livid' US House conservatives poised for next battle with McCarthy",
    "U.S. Supreme Court rejects challenge to Alabama county bail system",
    "Exclusive: Coalition aims to begin Ukrainian F-16 pilot training by summer - Dutch minister",
    "Russia's Putin calls Berlusconi a dear, wise friend and statesman",
    "UK's Sunak faces down critics after Boris Johnson honours row",
    "Scotland's leader won't suspend Nicola Sturgeon from party after arrest",
    "Driver charged after Australia's worst bus accident in decades kills 10 wedding guests",
    "New Zealand's national broadcaster probes 'inappropriate editing' of Ukraine war stories",
    "Indonesia court to rule on voting system change as election nears",
    "Cyclone likely to hit India's west coast, south Pakistan on Thursday",
    "US senator opens probe into PGA Tour, LIV Golf agreement",
    "International Boxing Association to appeal stripping of IOC recognition at CAS",
    "All eyes on Hollywood at U.S. Open drama arrives in LA",
    "Messi will increase MLS popularity, says Neymar",
    "Defining photos from the Trump presidency",
    "Red carpet style at the Tony Awards",
    "Fans celebrate K-Pop supergroup BTS' 10-year anniversary",
    "Gaza graffiti artists bedeck houses destroyed by Israel in war",
    "Amputee surfer making waves in the sport",
    "Prehistoric bird-wing flutes music to the ears of archaeologists in Israel",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]