[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Apple inks multi-billion-dollar deal with Broadcom for U.S.-made chips",
    "Chinese chip firm should go on U.S. trade blacklist, after Micron ban -- lawmaker",
    "Cryptoverse: Busy bitcoin births new breed of crypto",
    "Analysis: Ford offers investors big bets but finds few takers",
    "U.S. has 'real concern' about Tesla Autopilot driver interaction",
    "US new home sales, business activity rise to 13-month highs",
    "EU seeks top court backing in $14 billion tax fight against Apple",
    "Binance commingled customer funds and company revenue, former insiders say",
    "Crypto sector gets its first set of global rules from watchdog",
    "Podcast: DeSantis’ challenge, a Pacific pact and commingling at Binance",
    "Russia says it crushes cross-border incursion by 'Ukraine nationalists'",
    "Mercenary Prigozhin lays bare the strains of Putin's war",
    "Who are the Freedom of Russia Legion and other armed fighters in Belgorod?",
    "Russia extends US reporter's detention to Aug. 30 -RIA news agency",
    "Wall St subdued as deadlocked debt ceiling talks stoke default concerns",
    "Shell CEO shielded by security as climate protesters try to storm shareholder meeting",
    "Analysis: To vanquish Trump, DeSantis needs to build an unwieldy coalition",
    "No signs of progress as White House, Republicans end more debt ceiling talks",
    "Microsoft beefs up ChatGPT and Bing in wide-ranging AI product launch",
    "Trump criminal trial over hush money payment to start next March",
    "Republican Ron DeSantis to announce 2024 presidential run on Wednesday -sources",
    "Justice Thomas' billionaire friend rejects Senate panel over gift list",
    "Driver who crashed truck near White House charged with threatening president",
    "Ukraine investigating role of Belarus in transfers of children - prosecutor",
    "Harry loses court bid over UK police protection",
    "Greek opposition parties unable to form alliance, new election seen",
    "Madeleine McCann search focuses on Portugal reservoir, 16 years on",
    "Google-backed Anthropic raises $450 mln in latest AI funding",
    "Uber partners with Alphabet's Waymo to offer driverless rides",
    "Google to test ads in generative AI search results",
    "Microsoft-backed Indian group aims to bridge language barrier with AI assistant",
    "India makes tests mandatory for cough syrup export after overseas deaths",
    "Overseas Indians flock to Modi's rally in Sydney",
    "Pakistan's ex-PM Imran Khan questioned on graft charges - lawyer",
    "Beer-loving Thai lawmaker takes aim at $14 billion booze industry duopoly",
    "Turkish opposition calls Erdogan a 'fabricator' over doctored video",
    "Exclusive: Lebanon set to be grey-listed by financial crime watchdog",
    "Saudi warns speculators of more pain as OPEC+ meeting looms",
    "Most Gulf markets subdued on weaker Asia, volatile energy prices",
    "MLB roundup: Dodgers outslug Braves in series opener",
    "France prepares its guard against drone strikes, security threats",
    "Spain arrests 7 after racist incidents targeting Vinicius Jr",
    "Almeida wins Giro stage 16, Thomas back in pink",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "HBO's much-hyped 'The Idol' meant to be provocative, says Sam Levinson",
    "Disgraced Australian-born former entertainer Rolf Harris dead at 93",
    "From mangoes to luxury watches, Indians look to offload 2,000-rupee notes",
    "Milan photo exhibition reveals lives of women in Iran",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]