[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Wall St Week Ahead Investor skepticism turns to optimism as U.S. stock rally rolls on",
    "Italy rules Pirelli's Chinese top investor Sinochem cannot choose CEO - source",
    "Japan to open up Apple- and Google-dominated phone apps to competition",
    "Reddit’s golden geese foul up its IPO plans",
    "Exclusive: Ball Corp explores sale of aerospace unit for more than $5 billion",
    "Humana joins UnitedHealth in flagging cost hit from rising surgeries",
    "Exclusive: Twitter to focus on video, commerce in business revamp",
    "Putin says Russia positions nuclear bombs in Belarus as warning to West",
    "African leaders start peace mission in Ukraine despite Russian missile barrage",
    "Ukraine advancing in the south: military chiefs",
    "NATO meeting fails to approve first defense plans since Cold War",
    "Exclusive: Mondelez 'singled out' in boycott over Russia business, exec says",
    "Xi Jinping meets Bill Gates in China, calls him 'an old friend'",
    "Binance, SEC agree to allow only US employees to access customer funds",
    "Explainer: How a Canada Supreme Court ruling could affect U.S.-Canada refugee flows",
    "Militants kill 25, abduct others in attack on Ugandan school",
    "Daniel Ellsberg, who leaked 'Pentagon Papers,' dies at 92",
    "Minneapolis police face federal oversight for excessive force, discrimination",
    "U.S. South faces long, hot holiday weekend after tornadoes",
    "Abortion remains legal in Iowa as top court refuses to revive ban",
    "Sweden to move ahead with 2030 Winter Games bid",
    "MLB roundup: Red Sox thrash Yankees 15-5",
    "Spieth, Thomas headline notable players to miss U.S. Open cut",
    "Fan favorite Fowler seeks to revive career with U.S. Open run",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "News junkies turn to TikTok to chart new paths in media",
    "Our top photos of the week",
    "BTS fans pack Seoul park to celebrate 10-year anniversary",
    "New Grammy Award rules require human input, curb artificial intelligence use",
    "Vogue's Anna Wintour, author Ian McEwan honoured by King Charles",
    "Scientists discover duck-billed dinosaur roamed Chile 72 million years ago",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]