[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Wall Street closes down as focus shifts to inflation data, debt talks",
    "Disney's Iger may have to add slowing growth to his turnaround checklist",
    "PayPal tumbles 12%, eyes lowest close since 2017",
    "UK citizen extradited to US pleads guilty to 2020 Twitter hack",
    "Autos & Transportationcategory",
    "Lackluster results, production target cuts deepen EV start-up gloom",
    "FTX's law firm is back in the cross-hairs as Bankman-Fried kicks off defense",
    "Norfolk Southern to set up home value reimbursement fund after Ohio derailment",
    "Trump sexually abused writer E. Jean Carroll, must pay her $5 million, jury says",
    "Six notable moments from Trump's sexual abuse trial",
    "Factbox: An overview of Donald Trump’s legal troubles",
    "Events leading up to Donald Trump sexual abuse verdict",
    "Biden, McCarthy divided over debt ceiling but still talking",
    "Quotes: What Biden, McCarthy, McConnell said about the US debt ceiling",
    "Morning Bid: Looming U.S. 'X-Date' frays global nerves",
    "Analysis: Erdogan again? Amid rubble of Turkey's quake, voters demand to be heard",
    "Migrants amass along US-Mexico border as COVID-era restrictions near end",
    "How El Chapo’s sons built a fentanyl empire poisoning America",
    "Gunman who killed 8 at Texas shopping mall had 'neo-Nazi ideation,' officials say",
    "Former Pakistan PM Imran Khan arrested, stirring nationwide violence",
    "Biden's approval rating at 40%, Americans concerned about immigration: Reuters/Ipsos poll",
    "Tucker Carlson will bring his show to Twitter after leaving Fox",
    "Dianne Feinstein returning to U.S. Senate after health-related absence",
    "US approves temporary nuclear waste storage in New Mexico",
    "Rivian quarterly revenue beats estimates on higher-priced EV sales",
    "SVB Financial Group says quarterly results filing will be delayed",
    "EA's quarterly bookings beat estimates on 'FIFA' strength",
    "Airbnb forecasts slower bookings in Q2, shares fall",
    "Cooler temperatures offer temporary reprieve for Alberta wildfires",
    "Canada will not be intimidated by China retaliation, PM Trudeau says",
    "Ecuador seals record debt-for-nature swap with Galapagos bond",
    "Pope says Argentina government wanted 'my head' when he was in Buenos Aires",
    "Russia marks Victory Day with new strikes on Ukraine, but pared-back parade",
    "Outbound inspections resume under Black Sea grain deal - UN",
    "UK police express regret over coronation arrest of republican leader",
    "Switzerland holds military drills, its role in European defence in focus",
    "Sudan capital rocked by air strikes, looting",
    "Shots heard on Tunisia's Djerba island, site of a Jewish pilgrimage",
    "Thousands still missing as Congo flood survivors search for relatives",
    "Forest search resumes for Kenyan death cult victims of 'highly organised crime'",
    "Avalanche captain Landeskog to miss entire 2023-24 season",
    "Kenin moves into Rome second round with battling win, Fernandez out",
    "Messi's father dismisses Saudi links",
    "Marquez will not serve penalty for Portugal crash, says FIM",
    "Scenes from the coronation of King Charles",
    "Prince Louis at the coronation",
    "In the audience at the coronation",
    "Iconic Brazilian rock singer Rita Lee dies at 75",
    "Halle Bailey 'honored' to play Ariel in 'Little Mermaid' remake",
    "A Minute With: Jennifer Lopez and 'The Mother' team on 'badass' moms",
    "‘Transformers: Rise of the Beasts’ reconfigures for diverse cast",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]