[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Apple's Vision Pro an impressive headset with few likely buyers, analysts say",
    "Court upholds Musk's win in $13 bln lawsuit over Tesla-SolarCity deal",
    "Merck sues US government to halt Medicare drug price negotiation",
    "Autos & Transportationcategory",
    "Analysis: Ford's EV charging tie-up with Tesla ripples through industry",
    "Twitter's new CEO Linda Yaccarino logs first day in role",
    "Subway struggles to get big new franchisees to buy its US sandwich shops",
    "New York Fed says global supply chain pressures further abated in May",
    "Ukraine war zone villagers flee floods after massive dam destroyed",
    "Nova Kakhovka dam attack: what do we know so far?",
    "Exclusive: Accounting for war - Ukraine's climate fallout",
    "Russia says U.S.-built F-16s could 'accommodate' nuclear weapons if sent to Ukraine",
    "US SEC charges crypto platform Coinbase, one day after suing Binance",
    "Crypto stocks fall after US SEC sues Coinbase over failure to register",
    "US sues Binance and founder Zhao over 'web of deception'",
    "Binance, US affiliate hit by net outflows of $790 mln in last 24 hours",
    "Wall St slips as mixed data fuels Fed policy uncertainty",
    "PGA Tour, European Tour and LIV announce merger",
    "Iran presents its first hypersonic ballistic missile, state media reports",
    "Prince Harry tells London court 'vile' press has blood on its hands",
    "US passenger railroad Amtrak CEO says ridership near pre-pandemic levels",
    "Trump backer-turned-critic Chris Christie to make White House run official",
    "U.S. public sees no clear winner in debt ceiling deal -Reuters/Ipsos",
    "White House vows an improved effort against drug overdoses",
    "Ukraine denounces Russia as 'terrorist state' at World Court hearing",
    "French pension plan protesters briefly storm Summer Olympics HQ",
    "Kosovo open to new elections in municipalities hit by unrest, minister says",
    "Breakthrough on stalled EU migration deal coming this week - official",
    "Mexican president urges unity among ruling party contenders",
    "Toronto, Ottawa covered in smoke from wildfires",
    "At least 42 dead, thousands homeless after floods in Haiti",
    "Mexico president plans public sector pay boost going into election",
    "About 83 bodies remain unidentified four days after Indian rail crash",
    "Philippines, Japan, U.S. hold first trilateral coast guard manoeuvres",
    "Thailand's Pita confident of surviving move to thwart his PM bid",
    "Why dangerous encounters by US and Chinese militaries look set to continue",
    "Sabalenka sets up Muchova clash at French Open, takes stand against war",
    "IBA wants boxing in Olympics but will not be run by third parties - Kremlev",
    "No ticket? No problem for West Ham fans in Prague for Europa Conference final",
    "Inside the Apple developer's conference",
    "Celebrating Buddha's birthday",
    "What it's like to try Apple's new Vision Pro headset",
    "Austrian Social Democrats feted wrong new leader after ballot mix-up",
    "About ducking time: Apple to tweak iPhone autocorrect function",
    "Japanese get trained in 'Hollywood' smiles as masks slowly come off",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]