[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Bank of Canada hikes rates to 22-year high, more increases expected",
    "Microsoft to offer OpenAI's GPT models to government cloud customers",
    "US trade deficit widens to 6-month high, expected to dent economic growth",
    "Coinbase CEO hits back at SEC chair after lawsuit, says user funds are safe",
    "S&P 500, Nasdaq close lower as traders cash in on latest megacap rally",
    "Analysis: For Musk and other foreign CEOs visiting China, silence is golden",
    "Lira plunges more than 7% as Turkey edges towards free market",
    "U.S. East Coast blanketed in eerie veil of smoke from Canada fires",
    "Canadian wildfires prompt new evacuations, alarm over air quality",
    "Explainer: What are the health risks from wildfire smoke?",
    "Wildfire smoke from Canada disrupts New York, Philadelphia flights",
    "Ukrainians face homelessness, disease risk as floods crest from burst dam",
    "Ukraine wary of floating mines, disease spreading after Kakhovka dam collapse",
    "Kakhovka dam breach takes Ukraine war into uncharted territory",
    "Nova Kakhovka dam breach: what do we know so far?",
    "Analysis: Diverted Indian jet lands in middle of Russia airspace dispute",
    "Messi to join Inter Miami after PSG exit",
    "PGA Tour/LIV deal good for golf but rebels must pay, says McIlroy",
    "US Supreme Court's Clarence Thomas delays filing annual financial disclosure",
    "Embattled CEO Chris Licht out at CNN",
    "Gunman shoots two dead, wounds five others at Virginia high school graduation",
    "Ex-US Vice President Mike Pence launches 2024 election bid, attacks Trump over Jan.6",
    "Conservative revolt paralyzes US House for second day",
    "Trial opens for former Florida deputy in Parkland school shooting",
    "Prince Harry: It would be injustice if court rules I'm not hacking victim",
    "Surgery on pope was successful, doctors say he can travel",
    "UK's Sunak seeks stronger economic ties with U.S. on Washington trip",
    "Head of London's police force apologises to LGBT+ community",
    "Mexico foreign minister's departure primed to spark more resignations",
    "El Salvador slashes size of Congress ahead of elections",
    "Chile's conservative assembly begins drafting new constitution",
    "Massive fire as Sudanese factions battle for control of arms factory",
    "U.N. court says elderly Rwandan genocide suspect is unfit for trial",
    "Nigerian parents pay school bills with recyclable waste",
    "Kenyan police fire tear gas at protesters marching against finance bill",
    "PGA Tour-LIV deal leaves golf world facing plenty of unknowns",
    "Zverev, Swiatek reach French Open semis, heartbreak for Jabeur",
    "International Boxing Association to be stripped of recognition -IOC",
    "Haze shrouds Manhattan skyline as Canada wildfire smoke drifts south",
    "Ukrainians flee rising waters after destruction of massive dam",
    "Russia evacuates thousands near the Ukraine border",
    "Batman wins EU trademark dispute with Italian designer",
    "Molecular fossils open window on 'lost world' of primordial life",
    "Italy welcomes baby to parliament for first time",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]