[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Analysis: Private equity steps up lending as US banks pull back",
    "Regulators dust off rule books to tackle generative AI like ChatGPT",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "Applied Materials to invest $4 bln in Silicon Valley chip research center",
    "Cybersecurity firms' earnings set to benefit from growing threat of hacks",
    "Ryanair predicts strong summer after near-record annual profit",
    "India appeals tribunal upholds Go First bankruptcy in setback for lessors",
    "Beijing rebukes Japan, Britain over 'anti-China' G7 summit",
    "Breakingviews: G7 says “de-risking”, China hears “containment”",
    "Podcast: Is a debt ceiling deal possible?",
    "Fresh round of debt ceiling talks kick off as US default worries grow",
    "How Wall Street is preparing for possible US debt default",
    "Morning Bid: Tech politics, debt cap brinkmanship",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "Kansas farmers abandon wheat fields after extreme drought",
    "Greece set for new vote as winning conservatives short of majority",
    "China's Micron ban revives US trade tensions, fuels Asian chip rally",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "Indian court issues summons to BBC in defamation case over Modi documentary",
    "Riding on G7 success, Japan PM Kishida eyes early election",
    "Taiwan excluded from WHO annual assembly following Chinese opposition",
    "Thai alliance aims for ambitious reforms but not on royal insult law - draft",
    "Ukraine says its troops advance around devastated Bakhmut",
    "Ukraine restores power to Russia-occupied nuclear plant",
    "Russia launches air attack on Ukraine's Dnipro, eight hurt - governor",
    "Russia says F-16s to Ukraine would raise question of NATO involvement",
    "Republican U.S. Senator Tim Scott poised to make White House bid official",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "'Killers of Flower Moon' star says Native Americans need allies like Scorsese",
    "Exclusive: Paris 2024 organisers working on putting Olympic flame on Eiffel Tower -source",
    "Vinicius Jr calls LaLiga and Spain racist for chants after sending-off",
    "Infantino offers support to Vinicius Jr after racism row",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "Former tennis pro helps children shine on court in Cameroon",
    "'Firebrand' puts spotlight on Henry VIII's sixth and final wife",
    "'May December' director: women pay higher price than men for breaking rules",
    "Jennifer Lawrence-produced Afghan documentary premieres at Cannes",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]