[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Powell: Half-point of additional hikes a \"good guess\" of policy outcome",
    "Analysis: Auto firms race to secure non-Chinese graphite for EVs as shortages loom",
    "Paris air show: 'Progress' in supply chain as jet orders rack up",
    "How to get better returns on your cash now",
    "Wall Street slips as Powell hints at further rate hikes",
    "Jeffrey Epstein got $300 mln tax breaks, paid US Virgin Islands police, JPMorgan says",
    "Twitter has failed to pay millions in worker bonuses, lawsuit claims",
    "Donor bought pricey golf simulator for Ron DeSantis, raising ethics questions",
    "Exclusive: Texts tie DeSantis closely to Trump insider Lev Parnas in 2018 race",
    "After Roe v. Wade fell, this father-daughter duo left Texas to go on providing abortions",
    "How access to abortion has changed",
    "Amazon duped millions of consumers into enrolling in Prime, US FTC says",
    "Ukraine offensive 'slower than desired', Zelenskiy says; Putin sees 'lull'",
    "Paris blast in Latin Quarter injures about 30 people, cause uncertain",
    "France targets Russian and Wagner disinformation in Africa",
    "Titanic sub: Rescuers race against time after hearing undersea sounds",
    "U.S. Republican hardliners try to force Biden impeachment vote",
    "US Supreme Court's Alito defends private jet trip to Alaska",
    "Challenge to abortion clinic 'buffer zone' law rejected by US court",
    "Founder of US 'orgasmic meditation' group to challenge forced labor charge",
    "Blinken encourages Turkish counterpart to support Sweden's NATO bid",
    "German far-right to nominate chancellor candidate as support soars",
    "Hundreds of labour exploitation victims found near Lisbon",
    "China hits back after Biden calls Xi a 'dictator'",
    "ASEAN must hold Myanmar junta accountable, UN expert says",
    "Taiwan reports Chinese aircraft carrier sailed through strait",
    "Crematorium fills up as heatwave scorches northern Indian town",
    "US Senate panel invites PGA Tour commissioner, LIV CEO to testify on merger",
    "All eyes on projected top pick Wembanyama ahead of NBA Draft",
    "Gamers meet Games in inaugural Olympic Esports Week",
    "MLB roundup: Giants walk it off vs. Padres again",
    "Celebrating summer solstice, from Stonehenge to Times Square",
    "On the frontlines of Ukraine's counteroffensive",
    "Stonehenge-like 4,000-year-old sanctuary discovered in Netherlands",
    "Elated music fans pitch up for Glastonbury, await Elton John",
    "Fossils show ancient long-necked sea beast's 'gruesome' decapitation",
    "'Secret Invasion,' a Marvel mini-series without a 'superhero solution'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]