[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "With apparently fake photos, DeSantis raises AI ante",
    "Britain sets price floor on oil and gas windfall tax",
    "Exclusive: Credit Suisse puts up China brokerage venture for sale",
    "Binance.US suspends US dollar deposits after crackdown by regulators",
    "Exclusive: Taiwan's Acer ships computer hardware to Russia after saying it would suspend business",
    "Disney to offer free mobile streaming of cricket in India like rival JioCinema",
    "GM embraces Tesla's EV charging system, Wall Street cheers",
    "Trump faces federal charges in classified documents case, adding to legal woes",
    "Trump's Republican rivals criticize 'weaponization' of DOJ after indictment",
    "Who is Special Counsel Jack Smith in the Trump documents case?",
    "Washington quiets as Canadian smoke blankets U.S. capital",
    "International help rolls in to fight persistent Canadian wildfires",
    "What health experts say wildfire smoke novices need to know",
    "Amazon, Target modify deliveries in areas with poor air quality",
    "Morning Bid: Fresh lira low, focus on Fed",
    "China's factory deflation steepens as demand wanes",
    "Maps: Damage from the Nova Kakhovka dam collapse",
    "Thousands evacuated in China's Tianjin after cracks appear near high-rises",
    "Archbishop of Canterbury urges Ugandan Anglicans to reject anti-gay law",
    "Watched by IMF, Pakistan to present budget amid economic, political crises",
    "Heavy 'dragon boat water' rains hit southwest China, some cities flooded",
    "China envoy in South Korea warns of 'wrong bets' over Sino-U.S. rivalry",
    "Australia recession risk heightens after RBA warns of bumpy path to low inflation",
    "Japan calls for power saving for Tokyo households, industries during summer",
    "FBI arrests Texas man at center of suspended attorney general Paxton's impeachment",
    "Controlled burn and downed power line sparked Colorado's costliest wildfire",
    "Biden rails against 'prejudiced,' 'unjustified' attacks on LGTBQ+ Americans",
    "Donald Trump legal issues: What charges, lawsuits and investigations is he facing?",
    "Pope had another peaceful night in hospital, Vatican says",
    "NATO may base troops in Sweden before Stockholm joins, government says",
    "One killed in latest Russian air strike on Ukraine, Kyiv says",
    "France stabbing: Four children wounded in Annecy knife attack",
    "Erdogan names Erkan to head Turkey central bank, policy pivot expected",
    "Chinese investors flock to Riyadh conference seeking new markets, capital",
    "Saudi Arabia's golf coup highlights Biden's human rights bind",
    "US and Iran both deny report of nearing interim nuclear deal",
    "U.S. Congress to consider two new bills on artificial intelligence",
    "OpenAI CEO visits South Korea as country seeks to encourage AI development",
    "AI startup Cohere raises funds from Nvidia, valued at $2.2 billion",
    "Autos & Transportationcategory",
    "Mercedes-Benz beats Tesla for California's approval of automated driving tech",
    "Heat forward Butler excited about Messi's impact in Miami",
    "Heat running out of time to find answer to Jokic",
    "MLB roundup: Braves rally, win 10-inning slugfest vs. Mets",
    "Swiatek sets up Muchova showdown for French Open crown",
    "Stunning images from the eruption of Hawaii's Kilauea volcano",
    "Travellers gather for the annual Appleby Horse Fair",
    "Skylines vanish behind wildfire smoke from Canada",
    "Analysis: Kim Kardashian seeks secret of private equity success as  rising rates bite",
    "Scientists document how space travel messes with the human brain",
    "Boy George says he still wants to startle people 'a little bit'",
    "Texas aquarium saves endangered sea turtles stunned by cold water events",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]