[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "In the Market: Why US regional banks are doomed to a doom loop",
    "Washington is determined to govern AI, but how?",
    "Vice Media files for Chapter 11 bankruptcy to facilitate sale",
    "Exclusive: Nationalised German energy firms pay traders big bonuses after losing billions",
    "Consultancy firms in China tested limits before Beijing's crackdown",
    "Macron courts Tesla's Musk and other investors to 'Choose France'",
    "KKR-backed Envision Healthcare files for bankruptcy",
    "Turkey faces election runoff, Erdogan seen with momentum",
    "In Turkey vote, Erdogan defies forecasts of demise",
    "For Turkey runoff, potential kingmaker draws red line at Kurdish concessions",
    "Erdogan's milestones as Turkey faces May 28 runoff vote",
    "How Wall Street is preparing for possible US debt default",
    "Biden, Republicans search for outline of debt-limit deal",
    "Biden's budget vs. House debt limit bill on spending, deficits, taxes",
    "Morning Bid: Debt ceiling jitters, Turkey vote, Soros ditches Tesla",
    "Ukraine hails its first offensive success in defence of Bakhmut",
    "Analysis: Tesla’s new car-making process stokes debate among industry experts",
    "Thai opposition parties agree to coalition after election success",
    "A runoff in Turkey and a rout in Thailand",
    "Pakistan court grants bail to former PM Imran Khan's wife in graft case - lawyer",
    "At least three killed as powerful storm batters Myanmar",
    "Cambodia poll body disqualifies sole opposition party from July election",
    "India's opposition Congress gains key foothold with state election win",
    "Migrant crossings drop at U.S.-Mexico border after Title 42 expiry",
    "Migrants at US-Mexico border face tight controls after Title 42 lapse",
    "North Carolina governor vetoes 12-week abortion ban, override likely",
    "Russia says two commanders killed as Kyiv wages Bakhmut offensive",
    "Russia says European armed forces treaty contrary to its security interests",
    "Ukrainian security agency says it suspects tycoon Firtash of embezzlement",
    "Belarus PM replaces Lukashenko at ceremony, sparks speculation",
    "Tractor trailer crash in Mexico kills 26",
    "Argentina's ruling Peronist party wins provincial elections",
    "Ecuador lawmakers re-elect National Assembly president",
    "Argentina plans new rate hike, more FX intervention as inflation soars",
    "LaLiga in the bag, but Barcelona still face huge problems",
    "Djokovic says 'Big Four' rivalries made him tougher",
    "Korean player held in China in bribery probe - source",
    "MLB roundup: Mets post 8-run inning, whip Nats in Max Scherzer's return",
    "Our top photos of the week",
    "Sweden wins Eurovision song contest",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Zelenskiy collects Charlemagne Prize on behalf of Ukrainian people",
    "Eurovision 2023: Sweden's Loreen wins for a second time",
    "Nepali sherpa becomes world’s second person to scale Everest 26 times",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]