[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Brands focus on stories in refining China livestreaming to boost profits",
    "Apple stock hits record, on cusp of $3 trillion market value",
    "US mulls new export restriction on computing power in AI chips",
    "Microsoft CEO says exclusive Activision games make 'no strategic sense'",
    "Exclusive: Exxon Mobil expands lithium bet with Tetra Technologies deal",
    "Exclusive: Nissan installed camera to monitor No. 2's home, sources say",
    "Following the George Floyd killing, a Reuters journalist explores his own ties to slavery",
    "Learn how to trace your own family history",
    "More than 100 U.S. political leaders have ancestors who were slaveholders",
    "Analysis: Where are Russia's top generals? Rumours swirl after mercenary mutiny",
    "Exclusive: Wagner mutineers included Russian convicts freed to fight in Ukraine",
    "Russian general Surovikin was sympathetic towards Wagner rebellion, US officials say",
    "As Russia teetered, the elite trembled, and some private jets left",
    "Asian shares subdued, yen and yuan hover near 8-mth troughs",
    "Presumed human remains and shattered Titanic submersible returned to shore",
    "Paris shooting: Unrest breaks out for second night after police kill teen",
    "Protester burns Koran at Stockholm mosque on Eid holiday",
    "Smoke hangs over US Midwest, East, hurting air quality",
    "Corruption inquiry in Australia's NSW state uncovers China links to lawmaker",
    "US expects more cooperation with India in South China Sea",
    "South Korea's Yoon names conservative scholar as unification minister",
    "New Zealand business confidence improves in June- ANZ survey",
    "Biden tries to flip skeptical Americans on his economic plan",
    "Supreme Court of the United Statescategory",
    "For Ketanji Brown Jackson, a self-assured and forceful US Supreme Court debut",
    "US announces charges in $2.5 billion healthcare fraud takedown",
    "In verbal slip, Biden says Putin losing the war in 'Iraq'",
    "Exclusive: U.S. restarts asylum appointments at Mexico border town despite extortion threat",
    "Brazil census shows population growth at its slowest since 1872",
    "Mexico's Sheinbaum advances in race for ruling party presidential ticket, polls show",
    "Chile assumes temporary presidency of Pacific Alliance after diplomatic spat",
    "Twin sisters among 11 killed in Russian attack on Ukraine's Kramatorsk",
    "Harry's phone-hacking lawsuit 'entirely speculative', publisher says",
    "Cheap Russian drone a menace to Ukrainian troops and equipment",
    "UK court to rule if plan to relocate asylum seekers to Rwanda is lawful",
    "Biles to return to competition in August after two-year hiatus",
    "Blackhawks draft Bedard in hopes of turning franchise around",
    "US women's team to receive courage award for equal pay fight",
    "Miked-up Mourinho handed 10-day suspension for ref criticism",
    "Life-sized Barbie Malibu Dreamhouse for rent on Airbnb",
    "Muslims around the world celebrate Eid-al-Adha",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Taylor Swift, Ke Huy Quan, Austin Butler join Hollywood's film academy",
    "Harrison Ford hangs up his 'Indiana Jones' hat in 'Dial of Destiny'",
    "Scientists isolate human gene able to fend off most bird flu viruses",
    "The $108 million dollar lady: Klimt portrait sets European auction record",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]