[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Paris air show takes off with historic plane order",
    "Morning Bid: China to cut rates, but by how much?",
    "Intel spends $33 billion in Germany in landmark expansion",
    "'Great Resignation' continues as quarter of workers look to change jobs - PwC",
    "Autos & Transportationcategory",
    "US opens safety probe into Hyundai Ioniq 5 EVs over power loss reports",
    "'Netflix Effect' lifts Korean content but market control worries grow",
    "Pixar's 'Elemental' challenge: Originals aren’t breaking big at the box office",
    "Xi, Blinken agree to stabilize US-China relations in Beijing talks",
    "Blinken urges China's vigilance on its firms providing tech to Russia",
    "Podcast: Blinken meets Xi and Chinese bankers rein it in",
    "Amid US-China rivalry, a landmark science deal faces new scrutiny",
    "Ukraine prepares 'biggest blow' as it claims recapture of eight villages from Russia",
    "Russia rejects U.N. help as death toll from breached dam rises",
    "Ukraine meets 2 of 7 conditions to launch EU membership talks -sources",
    "Inside China's underground market for high-end Nvidia AI chips",
    "Ships, planes search for sub that went missing on trip to Titanic wreckage",
    "US judge orders Trump lawyers not to release evidence in documents probe",
    "Man with axe attacks Chinese restaurants in New Zealand, injuring four",
    "Israeli troops, backed by helicopter, kill 5 Palestinians in clash",
    "North Korea says botched satellite launch was 'gravest failure'",
    "Taliban's treatment of women could be 'gender apartheid' - UN expert",
    "Himalayan glaciers on track to lose up to 75% of ice by 2100 - report",
    "Analysis: New rules set to shake up China's shrinking infant formula market",
    "Abortion rights supporters and opponents mark one year without Roe v. Wade",
    "Affirmative action, student debt rulings loom at US Supreme Court",
    "Biden criticizes U.S. senator's hold on military nominations",
    "Defence, critical tech on agenda as India's Modi heads to US for landmark visit",
    "Greek migrant tragedy death toll rises, suspects detained",
    "UK parliament backs report that Boris Johnson lied over 'partygate'",
    "NATO ready to act to save Kosovo's peace, calls for de-escalation",
    "Germany only has 20,000 high explosive artillery shells left - report",
    "US urges 'orderly, responsible' drawdown of UN peacekeepers from Mali",
    "International donors pledge $1.5 billion in Sudan aid",
    "Nigeria's Tinubu removes security chiefs in major reshuffle",
    "Uganda detains 20 rebel 'collaborators' after student massacre",
    "England's Southgate praises Saka and rest of forward line after rout",
    "Red Bull can win everything but the gap may be closing",
    "Judge who sentenced Nassar calls for national inquiry into Canadian sport",
    "Record-breaker Mbappe leads France to 1-0 win over Greece",
    "Americans mark Juneteenth with marches, music and reflection",
    "News junkies turn to TikTok to chart new paths in media",
    "Two sea turtles nest on Spain's Mediterranean coast as waters warm",
    "Rome to open ancient square where Julius Caesar was killed",
    "Visit a museum, go home inked - pop-up tattoo parlour at Dutch Rembrandt House",
    "Pixar film 'Elemental' opens as studio's second-lowest box office debut",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]