[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "At least 10 people killed, nine injured in shootout in northern Mexico",
    "Sinn Fein sweep past unionist rivals again in N. Ireland local elections",
    "At least 12 dead in stampede at El Salvador soccer stadium",
    "Biden invited Kishida, Yoon to meet in Washington -U.S. official",
    "South Korea's Yoon praises Japan's Kishida for his efforts to mend ties",
    "Ex-British Gurkha hopes Everest climb will change disability perceptions",
    "Tens of thousands protest against planned Israeli judicial overhaul",
    "Zelenskiy says Bakhmut still in Ukraine's hands",
    "Russia says Ukrainian city of Bakhmut captured",
    "Putin says battle for Bakhmut is over, thanks Wagner mercenaries and Russian army",
    "Explainer: How important is Wagner's claimed capture of Bakhmut?",
    "G7 stiffens resolve to thwart Russia, gives Zelenskiy chance to win over fence sitters",
    "Ukraine's Zelenskiy courts 'Global South' at G7 summit",
    "Podcast: What's the G7 to do about China?",
    "Biden will meet Zelenskiy, South Korea and Japan on Sunday",
    "Greeks head to polls, no outright winner seen",
    "UN chief says it's time to reform Security Council and Bretton Woods",
    "Biden, House Speaker McCarthy could speak Sunday on debt limit",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Animal health body urges bird flu vaccination to avoid pandemic",
    "Sandy Hook families seek to reverse payments Alex Jones made to wife",
    "Brittney Griner greeted by US VP Harris in return to court",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Pentagon leak suspect Jack Teixeira ordered to remain in jail ahead of trial",
    "Exploration & Productioncategory",
    "Oil supply won't be affected by stricter price cap enforcement - IEA",
    "Analysis: Vodafone's new CEO faces tough calls to reconnect with investors",
    "JPMorgan, ex-executive spar in court over responsibility for Epstein",
    "Morgan Stanley's Aussie CEO Gorman transformed bank, deal by deal",
    "MLB roundup: Aaron Judge helps Yankees stun Reds",
    "Arsenal must look in the mirror and own up to mistakes, says Ramsdale",
    "Rybakina targets deep run at Roland Garros after Rome triumph",
    "Arsenal pushed us but we capitalised on their 'hiccups', says Man City's Walker",
    "Sick of sewage, Britons protest at water companies' pollution",
    "Elon Musk's SpaceX and Italy's Unipol join forces to help Italians hit by flooding",
    "Mexico City airport resumes operations after volcanic ash forces shutdown",
    "Villagers evacuated as wildfire ravages woodlands in western Spain",
    "Deadly flooding hits Northern Italy",
    "Best of Cannes Film Festival",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Cate Blanchett dons habit in Australian director's conversion tale",
    "Julianne Moore, Natalie Portman anchor Cannes competitor 'May December'",
    "Blur's Alex James on making new album: 'It's exciting and emotional'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]