[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "Morning Bid: After the hawks, here comes the Bank of Japan dove",
    "JPMorgan fails Jeffrey Epstein stress test",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "How the Fed hid a rate hike in its rate 'cuts' for 2024",
    "Bankman-Fried to get second trial on bank fraud, bribery counts",
    "S&P 500 leaps to highest close in 14 months; traders bet US rates near peak",
    "Oracle cuts hundreds of jobs, rescinds job offers in its health unit - Insider",
    "US grand jury indicts Pentagon leak suspect Teixeira, Justice Department says",
    "Russia tries to signal normalcy as Ukraine forces advance",
    "Exclusive: African leaders to propose 'confidence building measures' to Russia, Ukraine",
    "US criticizes Russia in annual human trafficking report",
    "Chechen fighters sent to Russian border with Ukraine, leader Kadyrov says",
    "At least 15 die after truck hits bus carrying elderly people in Manitoba, Canada",
    "US Supreme Court rejects race-based challenge to Native American adoption law",
    "Brutal heat wave to scorch US South through holiday weekend",
    "Google, one of AI’s biggest backers, warns own staff about chatbots",
    "E. Jean Carroll defamation trial against Donald Trump set for January 2024",
    "Miami Mayor Suarez announces 2024 Republican presidential bid",
    "US government agencies hit in global hacking spree",
    "U.S. Senate confirms Nusrat Choudhury as first Muslim female federal judge",
    "How is Ukraine’s counter-offensive going so far?",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "Tourist dies after attack near Germany's Neuschwanstein Castle",
    "Pope Francis orders ex-aide of Pope Benedict to leave Vatican",
    "Sudan war hits two-month mark as peace efforts hit hurdles",
    "Baba Go-fast? Nigeria's Tinubu stuns wary investors with quick reforms",
    "Sierra Leone opposition calls for election chief to resign",
    "Many culprits stole food aid in north Ethiopia, investigation finds",
    "Tropical Cyclone Biparjoy: Pakistan, India evacuate thousands before landfall",
    "UN in talks about possibly handing over Afghan teaching projects to Taliban",
    "Indian police charge lawmaker with sexual harassment in case brought by female wrestlers",
    "Indonesia court rejects petition to change voting system ahead of 2024 poll",
    "Exclusive: Brazil forward Vinicius Jr to lead new anti-racism committee, FIFA says",
    "Hamilton expects wins mark to fall to Verstappen",
    "Joselu’s late winner puts Spain into Nations League final",
    "US Justice Department to investigate PGA Tour-LIV Golf pact - WSJ",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Our top photos of the week",
    "Scores drown after migrant boat capsizes off Greece",
    "New 'Black Mirror' season begins by tackling actors' anxiety about AI",
    "Take That turn 'Greatest Days' film premiere into a performance",
    "Art Basel draws surge in Asian collectors",
    "Mexico says mass bird deaths likely caused by El Niño's hotter waters",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]