[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "S&P 500 leaps to highest close in 14 months; traders bet US rates near peak",
    "JPMorgan fails Jeffrey Epstein stress test",
    "Microsoft notches record high valuation of nearly $2.6 trillion",
    "Analysis: Why Walmart's new bet on fashion brands, home decor threatens specialty chains",
    "Bankman-Fried to get second trial on bank fraud, bribery counts",
    "LinkedIn to test ad product for video streaming services",
    "Motor vehicles, building materials lift US retail sales in May",
    "Russia tries to signal normalcy as Ukraine forces advance",
    "Exclusive: African leaders to propose 'confidence building measures' to Russia, Ukraine",
    "US criticizes Russia in annual human trafficking report",
    "Chechen fighters sent to Russian border with Ukraine, leader Kadyrov says",
    "Greece scours shipwreck site; hundreds feared drowned in boat's hold",
    "How migrant tragedy unfolded on the high seas off Greece",
    "How the Fed hid a rate hike in its rate 'cuts' for 2024",
    "Brutal heat wave to scorch US South through holiday weekend",
    "Google, one of AI’s biggest backers, warns own staff about chatbots",
    "US Supreme Court rejects race-based challenge to Native American adoption law",
    "US government agencies hit in global hacking spree",
    "U.S. Senate confirms Nusrat Choudhury as first Muslim female federal judge",
    "New York grand jury indicts former Marine in killing of Jordan Neely",
    "E. Jean Carroll defamation trial against Donald Trump set for January 2024",
    "How is Ukraine’s counter-offensive going so far?",
    "Tourist dies after attack near Germany's Neuschwanstein Castle",
    "Pope Francis orders ex-aide of Pope Benedict to leave Vatican",
    "Sudan war hits two-month mark as peace efforts hit hurdles",
    "Baba Go-fast? Nigeria's Tinubu stuns wary investors with quick reforms",
    "Sierra Leone opposition calls for election chief to resign",
    "Many culprits stole food aid in north Ethiopia, investigation finds",
    "Tropical Cyclone Biparjoy: Pakistan, India evacuate thousands before landfall",
    "UN in talks about possibly handing over Afghan teaching projects to Taliban",
    "Indian police charge lawmaker with sexual harassment in case brought by female wrestlers",
    "Indonesia court rejects petition to change voting system ahead of 2024 poll",
    "Joselu’s late winner puts Spain into Nations League final",
    "Real's history, not money, motivation for move, says Bellingham",
    "Felix demands better maternity care for Black women following Bowie's death",
    "Warholm and Ingebrigtsen on fire in Oslo",
    "Scenes from the frontlines of Ukraine's counteroffensive",
    "Our top photos of the week",
    "Scores drown after migrant boat capsizes off Greece",
    "New 'Black Mirror' season begins by tackling actors' anxiety about AI",
    "England and Wales get first female top judge in 750-year history",
    "New Spider-Man film will not screen in UAE, as region debates values",
    "Archaeologists in Peru find 3,000 year-old mummy in Lima",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]