[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Morning bid: Eyes on Japan GDP, China losing steam",
    "Elon Musk reverses course and says Tesla will advertise its cars",
    "Ex-Silicon Valley Bank CEO defends record, regulators vow tougher supervision",
    "Elon Musk warns of tough economy, says Tesla not immune",
    "US IRS to launch free tax e-file pilot program in 2024",
    "U.S. charges Apple ex-employee for trying to steal technology, fleeing to China",
    "WeWork CEO Mathrani to step down after joining Sycamore Partners as director",
    "Biden, McCarthy hopeful on debt ceiling deal, US president cuts Asia trip short",
    "US default could trigger recession, Yellen says",
    "Three in four Americans worry default could hurt them",
    "Biden cancels Australia visit as debt ceiling default nears",
    "Kremlin says its spies are watching as CIA urges Russians to get in touch",
    "Kyiv says it shoots down volley of Russian hypersonic missiles",
    "Ukraine and Russia face off in June at World Court over flight MH17",
    "Moldovan region headed for clash with pro-European government",
    "US House Democrat to force vote to expel embattled Republican George Santos",
    "Calgary air quality deteriorates as wildfires rage in Western Canada",
    "The world's bat lands are under attack, seeding risk of a new pandemic. Here's where.",
    "Making the four-day week work for Britain",
    "Cuba announces new migration policies as exodus continues",
    "Kentucky Republicans choose Cameron to challenge Democratic Gov. Beshear",
    "Lawmakers in three states consider abortion bans at 12 weeks or less",
    "New Mexico teen bought AR-style rifle legally before shooting spree, police say",
    "US lawmakers, Biden aides invoke China competition in debt fight",
    "France's Sarkozy, defending his 'honour', awaits corruption appeal verdict",
    "UK accelerates London flood defence plan to counter rising climate risk",
    "Two more victims of volcano eruption found in Roman ruins of Pompeii",
    "Brazil's Bolsonaro denies tampering of his vaccination records",
    "Argentina's Kirchner says she won't run for president, slams IMF",
    "Ecuador assembly begins impeachment hearing against President Lasso",
    "Brazil's Petrobras reworks fuel prices to ease costs, tame volatility",
    "Turkey's market rout deepens after Erdogan's strong election showing",
    "Erdogan calls Turkish voters to ensure stability in runoff vote",
    "Top Russian energy diplomat visits Iran; wants more cooperation in oil, gas",
    "Lebanon strikes deals to get more oil from Iraq",
    "'No one's safe': Sixers cut Rivers after repeat playoffs disappointment",
    "Flawless Djokovic crushes Norrie to reach Rome quarter-finals",
    "MLB roundup: Cardinals blitz Brewers 18-1",
    "Aces lose 2025 first-round pick, Hammon suspended for WNBA rule violations",
    "In pictures: Turkey faces election runoff",
    "Ukraine forces train for counteroffensive",
    "Prince Harry should not be allowed to pay for police protection, court told",
    "The new Kardashians? Sylvester Stallone and family star in reality TV show",
    "Johnny Depp marks celebrity comeback with Cannes opening film",
    "Cannes jury president to striking Hollywood writers: 'Yeah, go!'",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]