[
    "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv",
    "Get real-time market data on Refinitiv",
    "US producer prices fall on declining energy, food costs",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Explainer: Why are Nvidia's shares soaring and what is its role in the AI boom?",
    "Shell boosts dividend, steadies oil output under new CEO's plan",
    "Bud Light loses top US beer spot after Mulvaney ad boycott",
    "Vodafone, Hutchison strike $19 bln deal to create UK mobile leader",
    "Why are other automakers chasing Tesla's 'Gigacasting'?",
    "Belarus starts taking delivery of Russian nuclear weapons",
    "Flag and Russian dead attest to Ukrainian advance in south",
    "Russia now has free hand to destroy undersea communications cables - Putin ally",
    "Trump faces difficult odds in documents case",
    "What happens next for Donald Trump after latest indictment?",
    "E. Jean Carroll can pursue $10 million lawsuit against Trump, judge says",
    "Fed likely to punt rate hike into the summer wind",
    "Exclusive: US pushing India to seal big armed drone buy for Modi visit",
    "Scores drown in Greece's deadliest migrant shipwreck this year",
    "Nigeria boat capsize death toll rises to more than 100",
    "Podcast: Inside a liberated Ukrainian village and Trump’s not guilty plea",
    "Weather office warns of floods as India, Pakistan brace for cyclone",
    "Japanese soldier arrested after fatal gun-range shooting - defence ministry",
    "Hong Kong protest anthem's online presence fades as govt seeks total ban",
    "Explainer: Why Japanese Prime Minister Kishida may call a snap election soon",
    "Ukraine says Russian missile attacks kill three in Odesa, three in Donetsk",
    "Putin ponders: Should Russia try to take Kyiv again?",
    "Italy bids farewell to Berlusconi on contested day of mourning",
    "Germany calls Russia biggest threat in first-ever National Security Strategy",
    "Trump's defense team still taking shape as he appears in court",
    "US House resumes passing bills amid Republican infighting",
    "Biden calls racism 'still too powerful' during Juneteenth concert at White House",
    "Darfur cities under fire as Sudanese war spreads",
    "Ugandan law widens Anglican Church rift over LGBTQ rights",
    "Kenyan president's tax hikes alienate his 'hustler' base",
    "Zimbabweans hit by rising prices as local currency plummets",
    "Golden Knights' Marchessault named Stanley Cup playoffs MVP",
    "'In principle, I'm done', Messi unlikely to play at 2026 World Cup",
    "MLB roundup: A's top Rays on 'reverse boycott' night",
    "I didn't ask to be sold to Real Madrid, says Mbappe",
    "Trump arraigned on federal charges in Miami",
    "Towns submerged after Ukraine dam breach",
    "Cormac McCarthy, dark genius of American literature, dead at 89",
    "Japanese wrestler moves to Senegal to master ancient martial art",
    "'The Flash' dashes to theaters, starting the DC universe reboot",
    "'Horse diapers' keep Gaza streets clean",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]