[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Fed policy on right track, but inflation still too high, officials say",
    "Musk nabs ex-NBCUniversal ad chief Yaccarino as new Twitter CEO",
    "Former ByteDance executive says he was dismissed for flagging illegal activity",
    "Wall St Week Ahead Amid banking woes, faltering US small-caps offer ominous economic sign",
    "Tesla owners sue over impact of software update on EV batteries",
    "Binance pulls out of Canada amid new crypto regulations",
    "JPMorgan opposes class-action status for Epstein accusers",
    "Exclusive: G7 summit statement to target China's 'economic coercion'",
    "G7 to vow diversifying of supply chains, filling bank regulatory gaps -draft",
    "G7 finance chiefs warn of global uncertainty as US debt crisis looms",
    "UK's Hunt says 'absolutely devastating' if US failed to raise debt ceiling",
    "Russia acknowledges retreat north of Bakhmut, Wagner boss calls it a 'rout'",
    "Communities torn as Ukraine turns its back on Moscow-linked church",
    "South Africa rejects U.S. accusations of arms shipment to Russia",
    "U.S. demands recall of 67 million air bag inflators",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "Griner plays in WNBA for first time since Russia detention",
    "US military to bolster defensive posture in Gulf after Iran seizes tankers",
    "Thai candidates parade through Bangkok before Sunday vote",
    "G7 plans new vaccine program for developing nations -Yomiuri",
    "Papua foreign minister resigns role over coronation travel cost controversy",
    "Apple to open first online shop in Vietnam in a push to emerging market",
    "Former NBA star Howard stirs Chinese anger by calling Taiwan a country",
    "Debt ceiling worries deepen as early June U.S. default reinforced",
    "Wendy Sherman, US official who led diplomacy with China and Russia, to retire",
    "U.S. metals magnate Sabin sours on DeSantis, backs Scott in 2024 race",
    "Data of 237,000 US government employees breached",
    "Erdogan rival says has evidence of Russia's online campaign ahead of Turkey election",
    "Palestinian rockets fired towards Jerusalem, Israel kills militant leader",
    "Turkey's Erdogan, master campaigner, faces toughest contest yet",
    "Hezbollah denies links to drug kingpin killed in Syria",
    "Warring Sudanese factions fight on after failing to agree truce",
    "Kenya unearths more bodies in search for death cult followers",
    "A week after Congo floods, volunteers dig through debris for bodies",
    "Healthcare & Pharmaceuticalscategory",
    "Exclusive: Wegovy, other weight loss drugs ‘no silver bullet’, says WHO amid obesity review",
    "FDA issues marketing denial for 6,500 flavored e-cigarettes",
    "US FDA advisers narrowly back Sarepta's Duchenne gene therapy for accelerated approval",
    "Commanders reach agreement to sell franchise to Harris-led group",
    "Heat become first eighth seed to reach Conference Finals in 24 years",
    "Alcaraz hopes to re-ignite Djokovic rivalry with Rome final meet",
    "Panthers move on while Leafs Stanley Cup drought continues",
    "Asylum seekers cross Rio Bravo into U.S. as Title 42 expires",
    "Swiss mountain village ordered to evacuate over landslide fears",
    "Ed Sheeran tops UK charts with 'Subtract' after copyright victory",
    "Eurovision 2023: Sweden leads the betting ahead of Finland and Ukraine",
    "BWF approves temporary ban on unplayable 'spin serve'",
    "Filipino priest on mission in Europe to halt fossil fuel financing",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]