[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "How Wall Street is preparing for possible US debt default",
    "Australia hits buy-now-pay-later sector with consumer credit law",
    "Chip rally drives Asian shares up, but US debt talks caution stays",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "Ryanair posts near record FY profit, summer demand robust",
    "Oil slips as U.S. debt caution offset supply concerns",
    "Europe's business jet industry aims for green rebrand",
    "Ukraine aims to encircle Bakhmut as Russia says it captures city",
    "China summons Japanese ambassador over actions at G7",
    "Russia says F-16s to Ukraine would raise question of NATO involvement",
    "Russia launches air attack on Ukraine's Dnipro, eight hurt - governor",
    "China fails Micron's products in security review, bars some purchases",
    "China's Micron ban revives US trade tensions, fuels Asian chip rally",
    "Morning Bid: Not so fast, debt ceiling bulls!",
    "Modi, Blinken meet Pacific Island leaders in Papua New Guinea",
    "After no outright victory, Greek PM to get mandate for coalition",
    "Biden and McCarthy to meet on Monday as debt ceiling talks resume",
    "Regulators dust off rule books to tackle generative AI like ChatGPT",
    "The Bat LandsThe next pandemic may come from bats. Reuters investigates where.",
    "'Killers of Flower Moon' star says Native Americans need allies like Scorsese",
    "Transgender Mississippi girl misses graduation after judge's ruling",
    "Florida's DeSantis seeks to disqualify judge in Disney case",
    "Tim Scott, lone Black Republican in U.S. Senate, to run for president",
    "Zelenskiy likens Bakhmut's devastation to Hiroshima after World War Two",
    "Russia's Prigozhin says Bakhmut territories captured as promised, will leave zone",
    "Mount Etna eruption halts flights to Sicily's Catania airport",
    "Confidence returning to UK housing market as asking prices jump: Rightmove",
    "Medvedev says 'unbelievable' Rome triumph among his best wins",
    "Koepka wins PGA Championship as magic Block shines at Oak Hill",
    "Vinicius Jr calls LaLiga and Spain racist for chants after sending-off",
    "Former tennis pro helps children shine on court in Cameroon",
    "Battle for Bakhmut: Scenes from the front lines",
    "Style from the Cannes red carpet",
    "Behind the scenes at the G7 summit",
    "'Firebrand' puts spotlight on Henry VIII's sixth and final wife",
    "'May December' director: women pay higher price than men for breaking rules",
    "Jennifer Lawrence-produced Afghan documentary premieres at Cannes",
    "Scorsese's eagerly awaited 'Killers of the Flower Moon' premieres at Cannes",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]