[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "US credit crunch didn't start with SVB collapse, and may not end there",
    "Activists, investors call out Volkswagen on China record",
    "Exclusive: Chevron aims to boost Venezuela oil output to accelerate debt recovery -sources",
    "U.S. prosecutors look at short selling in bank shares - source",
    "UK finance bosses press to revive London's allure",
    "Options investors guard against US stock tumble, despite buoyant markets",
    "Chinese company earnings reveal lopsided economic recovery",
    "Appetite for change grows in Kurdish heartland as Turkish elections near",
    "Erdogan again? Amid rubble of Turkey's quake, voters demand to be heard",
    "Before Turkey votes, factoring companies charge record high rates -sources",
    "US debt ceiling standoff talks look at COVID clawbacks, energy permits",
    "Biden heads to New York to talk debt ceiling, raise funds for re-election",
    "Yellen heads to G7 with debt ceiling, bank crisis and tax woes in tow",
    "Morning Bid: Inflation cloud obscures Fed peak",
    "Ukraine unit says Russian brigade flees Bakhmut outskirts",
    "Trump sexually abused writer E. Jean Carroll, must pay her $5 million, jury says",
    "US airlines thrown a curveball as consumer habits change post-pandemic",
    "What’s at stake for Pakistan with the arrest of Imran Khan",
    "Biden restricts asylum access at Mexico border as Title 42 ends",
    "Ohio abortion rights fight highlights Republican electoral vulnerabilities",
    "Pharma CEOs to testify in U.S. Senate hearing on insulin prices",
    "Gunman who killed 8 at Texas shopping mall had 'neo-Nazi ideation,' officials say",
    "Kremlin calls Polish decision to rename Kaliningrad 'hostile act'",
    "Daily Mirror apologises to Prince Harry over unlawful information gathering",
    "Serbians surrender over 3,000 pieces of weapons after mass shootings",
    "Rare day at Vatican as two popes share stage",
    "Toyota targets 10% profit jump, robust EV sales as chip woes recede",
    "Panasonic sees record profit on robust battery demand, U.S. tax credit",
    "Siemens Healthineers Q2 profit falls, quits heart surgery robots business",
    "ASOS shares slump as sales plummet",
    "Analysis: Pakistan’s deepening political crisis douses hopes for IMF relief",
    "China's aircraft carrier Shandong returns to home port after show of might",
    "Southeast Asian leaders urge end of Myanmar violence, inclusive talks",
    "Hong Kong restricts foreign lawyers from national security cases",
    "Sustainable Businesscategory",
    "Honeywell announces tech to turn hydrogen and CO2 into lower-carbon aviation fuel",
    "China reports first arrest over fake news generated by ChatGPT",
    "Google expected to unveil its answer to Microsoft's AI search challenge",
    "Musk says Twitter to soon allow calls, encrypted messaging",
    "Haaland's father removed from Bernabeu seat after City equaliser",
    "MLB roundup: Yankees blast A's in Aaron Judge's return",
    "Medvedev to focus on more spin, improved sliding on clay",
    "Mets, Phillies set to play series in London next year",
    "Scenes from the coronation of King Charles",
    "Prince Louis at the coronation",
    "In the audience at the coronation",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Captagon: the drug fuelling the Gulf party scene - and Syria's finances",
    "You're late on your taxes. Now what?",
    "\"We're being hounded\" - French transgender sprinter decries Olympics ban",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]