[
    "Exclusive news, data and analytics for financial market professionalsLearn more about",
    "Get real-time market data on Refinitiv",
    "Disney shares slip as streaming losses narrow but some subscribers leave",
    "US annual inflation slows to below 5%, price pressures still strong",
    "US airlines thrown a curveball as consumer habits change post-pandemic",
    "Bank of England poised to raise rates again to tackle stubborn inflation",
    "Altria agrees to $235 mln settlement to resolve Juul-related cases",
    "China audits littered with deficiencies, US accounting watchdog finds",
    "Panasonic delays production of new Tesla battery to improve performance",
    "US Congress, White House begin tough debt limit, budget negotiations",
    "Biden hits Republican debt ceiling plan in swing New York district",
    "US debt ceiling impasse pushes government credit default swaps to record high",
    "Debt ceiling battle delays sweeping annual defense policy bill",
    "Google's AI is coming to more companies near you",
    "Google I/O 2023: Search king adds AI to respond to Microsoft challenge",
    "Explainer: How is the new Google AI search different from Bard chatbot?",
    "Morning Bid: Seeking signs of life in Chinese inflation",
    "Embattled US Rep George Santos hit with fraud, money laundering charges",
    "Border crossings top 10,000 daily as migrants seek U.S. entry before Title 42 ends",
    "US Army sergeant sentenced to 25 years for Black Lives Matter protester's murder",
    "Ukraine says it routs Russia brigade, Kremlin admits campaign 'very difficult'",
    "Beyond Meat expects sharper growth in second half, posts smaller loss",
    "Robinhood beats revenue estimates as rate hikes bolster interest income",
    "U.S. prosecutor query, quarterly loss hit already reeling shares of Icahn's company",
    "Nutrien misses quarterly profit estimates",
    "U.S. FDA advisers back Perrigo birth control pill for over-the-counter use",
    "Explainer: What's next for Trump after civil rape verdict?",
    "US appeals court overturns first 'Varsity Blues' scandal convictions",
    "E. Jean Carroll elated by victory over Trump in sexual abuse suit",
    "The US COVID health emergency is ending. What changes?",
    "Healthcare & Pharmaceuticalscategory",
    "Insulin makers testify on Capitol Hill over prices",
    "BioNTech, Roche's experimental pancreatic cancer treatment wins Nature plaudit",
    "Martin Shkreli-founded drug company files for bankruptcy",
    "Battles shake Sudan's capital, ceasefire talks reported to make progress",
    "In Khartoum, civilians face desperate struggle to survive",
    "Kenya court denies bail for suspected death cult leader",
    "Ten killed in eastern Congo landslide after more heavy rains",
    "Serbians surrender over 3,000 pieces of weapons after mass shootings",
    "Female murder probe re-examines 22 European cold cases",
    "Spain to ban some outdoor working during extreme heat conditions",
    "Daily Mirror apologises to Prince Harry over unlawful information gathering",
    "Scenes from the Westminster Dog Show",
    "Courtroom sketches from Trump's sexual abuse trial",
    "Reservoirs run dry in drought-hit Spain as summer looms",
    "US bankruptcy judge blocks NBA team Phoenix Suns' new TV deal",
    "When is Cannes Film Festival 2023 and what can we expect?",
    "Mothers may know best when it comes to money",
    "Human genome reboot better reflects global population",
    "Investigations, opens new tab",
    "About Reuters, opens new tab",
    "Reuters News Agency, opens new tab",
    "Brand Attribution Guidelines, opens new tab",
    "Reuters Leadership, opens new tab",
    "Reuters Fact Check, opens new tab",
    "Reuters Diversity Report, opens new tab",
    "Download the App, opens new tab",
    "Newsletters, opens new tab",
    "Refinitiv Workspace, opens new tab",
    "Refinitiv Data Catalogue, opens new tab",
    "Refinitiv World-Check, opens new tab",
    "Advertise With Us, opens new tab",
    "Advertising Guidelines, opens new tab",
    "Terms of Use, opens new tab",
    "Digital Accessibility, opens new tab",
    "Corrections, opens new tab",
    "Site Feedback, opens new tab",
    "See here for a complete list of exchanges and delays."
]