[
    "Woman dies after being hit by police motorcycle escorting Duchess of Edinburgh",
    "Police force refers itself to watchdog as CCTV shows its van following e-bike before fatal crash",
    "Johnson blasts 'bizarre and unacceptable' new claims he broke COVID lockdown rules",
    "Artificial intelligence isn't 'necessary for anything', says Musk",
    "Degrees of failure: Universities taken to court by students over disruption to studies",
    "Disgraced entertainer Rolf Harris's cause of death announced",
    "Bags removed by Madeleine McCann police during reservoir search",
    "Killer who murdered seven-year-old Nikki Allan in 1992 jailed",
    "Wednesday's national newspaper front pages",
    "Officials in Madeleine McCann search focusing on concentrated area of reservoir",
    "McCann search: Police scour reservoir area",
    "How events unfolded in the disappearance of Madeleine McCann",
    "People smuggled into UK on worker visas",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "CCTV shows police van following bike in Cardiff",
    "'Trump will not be silenced'",
    "IMF: Cost of living crisis to continue",
    "Moment West Midlands police raid home",
    "'The world has moved on' from partygate",
    "David Boyd's sentence a 'disgrace'",
    "Angry man shoves activist to ground",
    "Rolf Harris's fall from fame to infamy",
    "Drone footage shows McCann search",
    "Alastair Campbell arrives at High Court",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Are  F-16s a game changer for Ukraine?",
    "'You made it': Sunak and Zelenskyy meet",
    "What is the Ministerial Code?",
    "Retracing Nikki Allan's last known steps",
    "McCann reservoir search explained",
    "Kanda family speaks about son's murder",
    "South Wales police refers itself to watchdog",
    "Bailey: 'Very big lessons to learn’",
    "Godmother speaks out over Cardiff teen",
    "How police caught Nikki Allan's killer",
    "Latest Madeleine search will 'take time'",
    "Why China has made its feelings known to UK after G7 summit",
    "Raab's exit at next election shows a clear sense of Tory despondency about their prospects",
    "The close-knit community now trying to stay calm after a night of violence and tragedy",
    "Rolf Harris's greatest fear was not being loved - his depraved crimes ensure he won't be",
    "Revealed: Average age of Tory MPs quitting Commons is 15 years younger than outgoing Labour MPs",
    "Netflix reminds password sharers of the rules as crackdown continues",
    "Family of man shot dead by sheriff's deputy awarded largest settlement in history of US state",
    "Student 'caused fatal school dormitory fire because her phone was confiscated'",
    "Who is Christian B - the main suspect in the Madeleine McCann case?",
    "Call for probe into Chinese genetics company over pregnancy test data",
    "An apple a day can keep frailty away, study suggests",
    "Book returned to library almost 100 years late",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Man stuck on remote cliff rescued after 24 hours",
    "Overseas students to be blocked from bringing family to UK",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "Borrowing, groceries and the avoidance of a UK recession",
    "Suella Braverman and the speeding ticket row",
    "Eight years after lion killing photo shocked the world - the row over trophy hunting rages on",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Pep: I want decision on Man City charges ASAP | 'I'll stay regardless'",
    "Valencia fined €45k, stand closed for Vinicius racism | Red card rescinded",
    "Saka signs new Arsenal deal until 2027 | 'I have everything here to be my best'",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Fake AI-generated image of explosion near Pentagon goes viral"
]