[
    "Desperate parents are stealing baby formula to keep their children fed",
    "The battle for Bakhmut: Ukrainian city a smoking ruin as Russians forced back in disarray",
    "Revealed: Which food items have almost doubled in price compared with a year ago",
    "'A seismic shift': One in five taxpayers face 40% rate by 2027 - with these professions hard hit",
    "Sunak calls for change to international law which experts think government will break",
    "Royal Navy sailor found dead in Stockholm - as four people arrested",
    "Two people found dead - man arrested on suspicion of double murder",
    "Center Parcs owner puts holiday chain up for sale 'for billions'",
    "At least six dead after fire at New Zealand hostel",
    "Fake pregnancy belly 'used to conceal cocaine'",
    "What is a run-off election, how will it work in Turkey and what is a kingmaker?",
    "Turkey's voters are undecided on their next president - a joker in the pack may choose for them",
    "Meet the man who wants to end the Erdogan era and transform Turkey",
    "Candidates cast their votes in Turkey poll",
    "Why Turkey's election may well be the most important in the world this year",
    "Turkey's Erdogan seeks to fire up his supporters as a divisive election draws near",
    "Inside the battle for Bakhmut",
    "Rising cost of baby formula has hidden dangers",
    "'There's no way you'd let them starve'",
    "Khartoum hospital 'targeted'",
    "Hostel fire 'nightmare' in New Zealand",
    "Phone hacking trial explained",
    "Belarus leader appears breathless",
    "Is the Tory Party divided on immigration?",
    "'Are the Tories becoming ungovernable?'",
    "Thieves ram truck into store",
    "Home sec's double interruption",
    "Rees-Mogg speech targeted by protester",
    "Paddington Meets The Queen picks up BAFTA",
    "Tower topples as cyclone hits Myanmar",
    "What happened on Zelenskyy's visit?",
    "Ukraine: What aid has UK provided?",
    "Wallace defends cuts after Sky report",
    "Kremlin reacts to UK Ukraine support",
    "A hug and a pledge from PM to Zelenskyy",
    "Zelenskyy on Ukraine's counteroffensive",
    "Sunak on Zelenskyy and Churchill",
    "Zelenskyy calls Putin a 'despot'",
    "What could happen next in Ukraine?",
    "Pakistan: What we know so far",
    "What is Title 42 and why has it expired?",
    "Khan re-arrest 'poses political risk'",
    "Child killer denies 'involvement' during arrest",
    "How rate rise will affect you",
    "'There is a huge love for NHS'",
    "'Thousands of knives' to be seized",
    "Nurses' pay decision 'confusing'",
    "'Leadership changes impacted election'",
    "'Brexit stopped Ukraine invasion succeeding'",
    "'It was like I was a terrorist' - Khan on arrest",
    "Love Island winner on life after football",
    "Rail workers pay offer 'not acceptable'",
    "Turkey elections: Can Kilicdaroglu win?",
    "Braverman hints at leadership ambitions with unusually personal pitch to Tory right",
    "From hot dog seller to mercenary leader: The rise of Wagner's Yevgeny Prigozhin",
    "All the TV shows and films affected by the Hollywood writers' strike",
    "Why the UK weather has been 'noticeably dull' this year",
    "Tuesday's national newspaper front pages",
    "Musk tells Macron he had to 'sleep in the car' before meeting French president",
    "Four dead and several others wounded in US shooting",
    "FBI lacked 'actual evidence' to probe Trump-Russia links, report finds",
    "Company directors jailed after wall collapse killed five workers",
    "Pregnant woman dies after motorway crash that also injured her sons and nephew",
    "Dog rescued from England's highest mountain after 'refusing to move'",
    "'Cronyism and backroom deals': Labour calls for Teesside development probe",
    "Investigation into whether shoppers being overcharged for food and fuel",
    "WhatsApp announces new locked chats for 'intimate conversations'",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "At least 129 dead due to torrential rainfall in Rwanda",
    "Climate protesters sing Spice Girls to disrupt bank meeting",
    "Could hot water pipes replace traditional gas boilers?",
    "'Flying thermometer' which could save you money pinpoints homes leaking most heat",
    "Heat networks: Is this how your home will get heated in the future?",
    "Bank Holiday mini-heatwave as temperatures set to soar to 21C",
    "Spain believed to have had hottest April day ever",
    "El Nino: What is it and how does it impact the weather closer to home?",
    "Local election results, Brexit and nurses' pay | Grant Shapps, Jacob Rees-Mogg and Jordan Reynolds",
    "Beth Rigby Interviews... Keir Starmer and Russian journalist turned dissident Marina Ovsyannikova",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "'Revelation' Jones deepens Leicester's relegation fears",
    "Webb explains VAR decisions as in-game audio released for first time on MNF",
    "Neville: Klopp sent Man Utd and Newcastle a message: 'He's coming for you!'",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Royals unveil unseen coronation video",
    "Harry and Meghan biographer testifies after Piers Morgan claim | Harry hacking trial latest"
]