[
    "Russia takes 'negative view' of fresh UK aid to Ukraine after Sunak meets Zelenskyy",
    "Talks to be held with supermarket bosses over fuel price rise concerns",
    "'Godfather of poker' who won $6m in his career dies",
    "Harry and Meghan biographer testifying after Piers Morgan claim | Harry hacking trial live",
    "M&S sends letter to man asking him to change name of his gelato",
    "Where is Alexander Lukashenko? Russia refuses to comment on Putin ally's health",
    "British expat accused of wife's murder tells court she 'begged him' to help her die",
    "Hitler speech played on train's loudspeaker",
    "Candidates cast their votes in Turkey poll",
    "Meet the man who wants to end the Erdogan era and transform Turkey",
    "Why Turkey's election may well be the most important in the world this year",
    "Turkey's Erdogan seeks to fire up his supporters as a divisive election draws near",
    "Rees-Mogg speech targeted by protester",
    "Home sec's double interruption",
    "Kremlin reacts to UK Ukraine support",
    "Multiple vehicles set on fire",
    "A hug and a pledge from PM to Zelenskyy",
    "Zelenskyy on Ukraine's counteroffensive",
    "SpaceX launches Starlink satellites",
    "Sunak on Zelenskyy and Churchill",
    "'Thousands of knives' to be seized",
    "Doctor beats record for living under sea",
    "Paddington Meets The Queen picks up BAFTA",
    "Tower topples as cyclone hits Myanmar",
    "'It was like I was a terrorist' - Khan on arrest",
    "Eurovision's memorable moments",
    "Rob Burrow carried over finish line",
    "Pope meets Zelenskyy at Vatican",
    "Horse saved from drowning in New York",
    "Earth glows beneath space station",
    "Zelenskyy calls Putin a 'despot'",
    "Eurovision entry's town Ternopil attacked",
    "Ukrainian troops advance in Bakhmut",
    "What could happen next in Ukraine?",
    "Pakistan: What we know so far",
    "What is Title 42 and why has it expired?",
    "Khan re-arrest 'poses political risk'",
    "Child killer denies 'involvement' during arrest",
    "How rate rise will affect you",
    "What is Ukraine's new counteroffensive?",
    "New protest laws explained",
    "Prince Harry's court case, explained",
    "'There is a huge love for NHS'",
    "Nurses' pay decision 'confusing'",
    "'Leadership changes impacted election'",
    "'Brexit stopped Ukraine invasion succeeding'",
    "Love Island winner on life after football",
    "Rail workers pay offer 'not acceptable'",
    "Turkey elections: Can Kilicdaroglu win?",
    "McAdams being frank on puberty",
    "The lessons that can be learned as Vice joins digital media casualty list",
    "Turkey's voters are undecided on their next president - a joker in the pack may choose for them",
    "From hot dog seller to mercenary leader: The rise of Wagner's Yevgeny Prigozhin",
    "All the TV shows and films affected by the Hollywood writers' strike",
    "Why the UK weather has been 'noticeably dull' this year",
    "Sweeteners do not have long-term effect on weight loss, says WHO",
    "UK will be left 'dangerously exposed' when it cuts fleet of special forces aircraft, sources warn",
    "'The boss level of settling down': Jack Whitehall and girlfriend expecting first baby",
    "'It was like a warzone': Twelve cars set on fire around Dorset",
    "Protester storms stage during Jacob Rees-Mogg speech to warn of 'fascism'",
    "Calls for sunscreen to be VAT-free due to poverty and skin cancer link",
    "Olivia Pratt-Korbel's killer will not get jail term extended, solicitor general says",
    "Rebekah Vardy says she was sexually abused during Jehovah's Witness childhood",
    "S Club 7 renamed as star pulls out of tour after bandmate's death",
    "Starmer says 'it feels wrong' EU citizens can't vote in general elections",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "At least 129 dead due to torrential rainfall in Rwanda",
    "Climate protesters sing Spice Girls to disrupt bank meeting",
    "Could hot water pipes replace traditional gas boilers?",
    "'Flying thermometer' which could save you money pinpoints homes leaking most heat",
    "Heat networks: Is this how your home will get heated in the future?",
    "Bank Holiday mini-heatwave as temperatures set to soar to 21C",
    "Spain believed to have had hottest April day ever",
    "El Nino: What is it and how does it impact the weather closer to home?",
    "King breaks ground for net zero research lab in first official engagement since coronation",
    "Local election results, Brexit and nurses' pay | Grant Shapps, Jacob Rees-Mogg and Jordan Reynolds",
    "Beth Rigby Interviews... Keir Starmer and Russian journalist turned dissident Marina Ovsyannikova",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Leicester City: Champions to Championship in seven years?",
    "Neville: Liverpool must back Klopp in transfer window this summer",
    "Ref Watch: Andersen 'so, so lucky' | Should Martinelli have walked?",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Harry and Meghan biographer in court after Piers Morgan claim | Harry hacking trial live"
]