[
    "Eamonn Holmes claims there was 'total cover-up' over Phillip Schofield's affair with younger man",
    "Government to crack down on vape advertising 'targeted at children'",
    "On board the mission to rescue 600 people from overcrowded fishing boat abandoned by its captain",
    "British man dies in Greece after being 'struck by lightning while paddleboarding'",
    "Tuesday's national newspaper front pages",
    "Djokovic sends political message about Kosovo after violence erupts",
    "Hottest day of the year recorded – but it's about to get cooler for some",
    "Why Phillip Schofield's admission should kill off his career",
    "Timeline of Schofield's ITV departure after colleague affair and Willoughby 'rift'",
    "Phillip Schofield 'took us for fools', says ex-This Morning presenter",
    "Phillip Schofield admits affair with much younger man - and steps down from ITV",
    "Schofield's agent cites 'honesty and integrity' after dropping him - their statements in full",
    "Inside 'most dangerous' motorsport event",
    "Violence breaks out during Kosovo clashes",
    "Rocket debris hits car in Kyiv",
    "Wounded refugees flee Darfur to Chad",
    "What Kyiv attacks can tell us",
    "Mission to rescue hundreds abandoned at sea",
    "Watch Luton Town lift trophy",
    "Kyiv metro becomes shelter amid air strikes",
    "'It's unreal': Luton players on promotion",
    "'Wild celebrations in Istanbul'",
    "Stelling signs off from Soccer Saturday",
    "Woman arrested after driving down beach in US",
    "'Explosive' volcanic activity continues",
    "Tourist boat capsizes on Italian lake",
    "How Sudan ended up in a humanitarian crisis",
    "'No agenda in casting The Little Mermaid'",
    "Dogs defend owner against bear invasion",
    "Kyiv hit by barrage of Russian missiles",
    "Attacks on Kyiv's anniversary",
    "Russia 'invading Belarus by stealth'",
    "Dnipro clinic destroyed in missile strike",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Johnson refutes 'COVID rule breaches'",
    "Praise for Mermaid star Halle Bailey",
    "How The Little Mermaid came to life",
    "'An incredible human' Mead on Wiegman",
    "What makes a good football manager?",
    "'You've been pretty blunt on WhatsApp'",
    "Female gamers face hate 'all the time'",
    "World Cup 'too soon' for Lioness",
    "Why Met chief is confident about plan for cops to stop attending mental health incidents",
    "Erdogan has proved critics wrong and outmanoeuvred his toughest challengers",
    "'Our family have been shot': Wounded refugees stream in from Darfur after violence in Sudan",
    "The 'black gold' that could help fight climate change for centuries to come",
    "Girl, 16, stabbed to death on Delhi street as passers-by watched on",
    "Harry Styles breaks Scottish stadium gig record",
    "Chinese-registered ship detained on suspicion of looting wreckages of British warships",
    "Mother pleads guilty to murder after six-year-old son starves to death",
    "'80 robberies a day' last year had no suspect identified before cases closed",
    "Seven men remanded in custody charged with attempted murder of senior Northern Ireland detective",
    "UK's biggest police force to stop attending mental health 999 calls",
    "Huge crowds as Luton Town celebrate historic rise to Premier League with bus parade",
    "Four dead as boat carrying tourists overturns on Italian lake",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Rice not focused on 'noise' as Bayern step up pursuit",
    "Why Pochettino is the right fit for Chelsea",
    "Last-gasp Windass header sends Sheff Wed into Championship",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Eamonn Holmes trades blows on social media with 'delusional liar' Phillip Schofield",
    "Dani Dyer reveals names of her twin girls"
]