[
    "School in lockdown and teenager arrested in Gloucestershire",
    "Why hasn't the BBC presenter been named publicly?",
    "Jurors in Lucy Letby trial sent out to consider verdicts",
    "I woke up to find Kevin Spacey performing sex act, accuser says | Trial live",
    "EasyJet cancels more than 1,000 summer flights",
    "British man dies after falling 160ft during Mont Blanc hike - reports",
    "Injuries at Pamplona bull runs after protests against 'terrifying mob'",
    "BBC presenter should only be named after 'full' investigation, says justice secretary",
    "Everything we know about claims a BBC presenter paid teen for sexually explicit photos",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "Timeline leading up to suspension of presenter accused in BBC scandal",
    "Culture sec avoids questions on BBC scandal",
    "Questions BBC must answer over presenter accused of paying for explicit photos",
    "BBC statement in full as presenter suspended",
    "BBC presenter scandal is sleazy and depressing - but at the heart of this a family is suffering",
    "What we know about claims against BBC star",
    "BBC needs to 'get a grip' says Rachel Reeves",
    "The King welcomes Biden to Windsor",
    "Dramatic rescue over India flood waters",
    "Biden and Sunak join tea party",
    "General seen for first time since failed mutiny",
    "Injuries at bull run festival",
    "Wrongly named presenter takes legal advice",
    "'Barbie' stars walk the pink carpet",
    "BBC 'may need to be investigated'",
    "Joe Biden arrives in London",
    "Robbie and Gosling on Barbie 'absurdity'",
    "Cars plough through flooded roads in Sheffield",
    "Orange confetti thrown over former chancellor",
    "Divers attend underwater music show in Florida",
    "Pilot asks volunteers to leave 'heavy' plane",
    "Mob storms LGBT event in Georgia",
    "Off-duty police volunteer disarms gunman",
    "Whitehall on Colman accent 'diss'",
    "Palestinian fighter says Israel failed",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "PM on use of cluster munitions",
    "Ukrainian medics fight to keep casualties alive",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "Chesney Hawkes recounts 'horror flight'",
    "MP responds to child mural removal",
    "How UK debt compares to other countries",
    "Mum's anguish at police tweet",
    "Mamoudou Athie on Pixar's Elemental",
    "Why 'steel rain' cluster munitions won't break NATO unity",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Chart shows how England won the third Test and stayed in the Ashes",
    "Why Meta's Twitter rival could finally be the one that catches on",
    "Health board fined £235,000 over death of dad-of-four who took his own life in hospital",
    "'We're all going to die': Chesney Hawkes recalls 'terrifying ordeal' as plane plunged 20,000ft",
    "First of Taylor Swift's UK tour tickets go live today",
    "'Dumbfounded' Johnny Depp visits birthplace of Dylan Thomas",
    "Scottish isles with sharks and minke whales to receive National Trust protection",
    "Putin met with Prigozhin five days after mutiny, Kremlin claims",
    "Transgender woman wins Miss Netherlands for the first time",
    "Three children killed in knife attack at nursery",
    "Second eight-year-old girl dies after Wimbledon school crash",
    "Police name man wanted in connection with serious assault - but warn public not to approach him",
    "Wimbledon crowd boos Victoria Azarenka after her loss to Elina Svitolina",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Thames Water secures cash from shareholders and BT's search for new CEO",
    "Yes to trees, not tree-huggers | Rachel Reeves and Victoria Atkins",
    "Mortgages are going up, why aren’t savings?",
    "Inter holding firm on Man Utd target Onana price | Maguire set for talks",
    "Norris explains key factor in holding off Hamilton in Silverstone battle",
    "Wimbledon LIVE! Rybakina, Djokovic, Jabeur & Alcaraz all in action"
]