[
    "Russia says deadly missile strike which hit busy pizzeria was aimed at 'NATO instructors'",
    "Submersible debris brought ashore after deadly implosion",
    "Thames Water working 'constructively' to secure cash as ministers draw up bailout plan",
    "Riots in Paris after boy shot dead by police",
    "Former NFL star dies aged 35",
    "Man admits murdering father and son",
    "Parents threaten school strike due to 'adults arguing in playground'",
    "Huntsman spider found in Edinburgh",
    "Russia confirms Kramatorsk strike",
    "Protester throws orange powder on Test match pitch",
    "Moment teen shot dead by Paris police",
    "Children injured in deadly attack on Kramatorsk",
    "Drone video of missile aftermath",
    "'Housing crisis: What crisis?'",
    "Victim of Russian missile attack speaks",
    "Business sec 'very concerned' about Thames Water",
    "Clashes in Paris over teen death",
    "The Wagner march on Moscow in videos",
    "Watch Julian Sands in A Room With A View",
    "Watch moment artwork sells for record sum",
    "Prince misses basketball shots then scores",
    "Chimp sees open sky for first time",
    "Listen: Secret recording of Donald Trump",
    "'Curious' whale swims alongside kayaker",
    "King and Queen greet spa guests",
    "'It's a family show...or is it?'",
    "Moment horse airlifted from pit by helicopter",
    "Aftermath of deadly Kramatorsk missile strike",
    "Aftermath of deadly Russian strike",
    "Who is connected to Wagner boss?",
    "Putin gives speech thanking military",
    "'Armed rebellion would have been suppressed'",
    "What is Russia's Wagner group doing in Africa?",
    "What's going on with mortgages?",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Roe v Wade: US abortion rights a year on",
    "'I have hopes things will get better'",
    "'We shouldn't be worried about asteroid'",
    "Bereaved families tell Hancock to go away",
    "'Report shows courage of the 4,000 people'",
    "Rwanda scheme 'difficult to justify'",
    "'Can you please stop smiling?'",
    "Harrison Ford on his return as Indiana Jones",
    "Prigozhin 'not welcome in Belarus'",
    "Ending discrimination in cricket won't be easy - it could take years to level the playing field",
    "Prince's homelessness project pushes his political neutrality to its limits",
    "Pressure on 'rip off' water firms unlikely to go away any time soon",
    "Dramatic footage of Wagner march on Moscow show how events unfolded - and what may happen next",
    "Why is Kevin Spacey in court and what are the allegations against him?",
    "How the experience of drinking a coffee can give you an extra boost",
    "Just Stop Oil disrupts Ashes - before England star takes matters into his own hands",
    "Trump countersues woman jury says he sexually abused",
    "Warning over invasive pink salmon set to arrive in UK waters",
    "No emergency coal-fired power for National Grid to keep lights on this winter",
    "Passenger rescued after fall from 10th deck of cruise ship in Caribbean",
    "Why has everyone in South Korea become younger overnight?",
    "Graham Norton to host revival of 'iconic' 90s game show",
    "'Near billionaire' Sunak asked when he last struggled to pay bill at PMQs | Politics latest",
    "Government progress on net zero 'worryingly slow', report says",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "COVID Inquiry: Why were we not prepared for a pandemic?",
    "Wagner mutiny: What’s next for the war and Putin’s Russia?",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Australia 190-2 at tea as Smith and Labuschagne near century stand LIVE!",
    "Arrests made after Just Stop Oil protesters halt Ashes Test at Lord's",
    "Man City pull out of Rice race after Arsenal submit £105m bid",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Nicole Scherzinger announces engagement to Scottish rugby star"
]