[
    "From journalist to PM - a look back at Boris Johnson's career",
    "Rishi Sunak did not 'intervene' in Johnson's honours list, cabinet minister insists",
    "A treble! Man City win Champions League, FA Cup and Premier League",
    "We could see 32C today as heatwave continues - but there's a catch",
    "Tributes paid to 'loving, dedicated' couple found dead in summer house",
    "'Regulate it before we're all finished': Musicians react to AI songs flooding the internet",
    "Trump tells crowds: 'They're not coming after me, they're coming after you'",
    "Trademark Trump defiant as he tries to set narrative that indictments are political not legal",
    "Sunday's national newspaper front pages",
    "What led to the former PM's shock resignation?",
    "How a bombastic political career came to a bitter end",
    "Boris Johnson quits with parting shot at panel investigating him - and criticises Rishi Sunak",
    "From journalist to prime minister",
    "'Appalled that I can be forced out': Boris Johnson's resignation statement in full",
    "Jack Grealish’s dad: ‘Amazing day son’",
    "Indictment 'ridiculous and baseless'",
    "2019: Disgust at Johnson in Uxbridge",
    "What does Johnson’s resignation mean for PM?",
    "Volodymyr Zelenskyy greets Trudeau in Kyiv",
    "Thousands evacuated as volcano erupts",
    "Guardsmen faint under blazing sun",
    "Annecy stabbing suspect is carried to car",
    "Tory MP pays tribute to Johnson",
    "Man City fans make final predictions",
    "Family rescued after rollover accident",
    "We'll 'do whatever' to defend Israel",
    "Italian special forces storm hijacked ship",
    "Moment children rescued from Colombian jungle",
    "Atmosphere builds ahead of Champions League final",
    "Large fire breaks out in Netherlands",
    "Escalator in South Korea suddenly reverses",
    "Zelenskyy tight-lipped on counteroffensive",
    "Ukraine Leopard tank 'destroyed' by Russia",
    "'Ukraine's counteroffensive failed'",
    "Aid arrives to flooded Kherson city",
    "'99%' sure Russia blew the dam",
    "'Counteroffensive has started'",
    "Roof washes up on Odesa beach",
    "Ukraine war day 470: Zelenskyy visits Kherson",
    "Did Russia 'blow the dam' early?",
    "How to survive when 'hotter then Ibiza'",
    "Why has Trump been indicted again?",
    "What to expect at Trump's court appearance",
    "What did Rishi Sunak get out of his US trip?",
    "Where in Canada are the wildfires?",
    "Prince Harry court case evidence explained",
    "Flooded house collapses after dam attack",
    "This Morning boss's 'ill-judged' remark",
    "Ex-Tory MP: 'Good' if Johnson disappeared",
    "Chris Bryant calls Boris Johnson 'a coward'",
    "Rayner: 'Good riddance' to Johnson",
    "What do Johnson's constituents think?",
    "Dorries speaks to Sky News after resignation",
    "Tributes for boy killed in e-bike crash",
    "Knife attack 'happened in front of my kids'",
    "Zelenskyy faces a difficult call before using the West's modern tanks in a spring offensive",
    "Trump plays golf as indictment unsealed. How worried should he be?",
    "6,000 City fans gathered in Manchester to watch the final - this is what happened when they won",
    "Trouble sleeping during the heatwave? Ten top tips for staying cool",
    "COVID inquiry: Everything you need to know",
    "Ukraine launches counteroffensive action against Russia as troops engage in intense fighting",
    "Man charged with murder after bodies of married couple in their 30s found in Newhaven",
    "Homeowners have been hit with £7,000-a-year 'Tory mortgage penalty', Labour claims",
    "'Unabomber' Ted Kaczynski found dead in US prison cell",
    "Excalibur and Better Call Saul star dies from cancer",
    "Former Met Police officer sexually assaulted colleague while on duty",
    "Teenager charged with attempted murder and GBH over assaults at private school",
    "Amber thunderstorm warning issued as temperatures hit 30C",
    "'Today is technically my last school strike,' says Greta Thunberg",
    "Government wobble on windfall tax may be of political benefit but risks a renewable backlash",
    "Labour U-turn on £28bn green plan a sign of economic limitations for energy revolution",
    "As smoke blankets parts of US, unexpected symptoms of poor air quality revealed",
    "El Nino returns and could bring record hot temperatures",
    "World has lost battle to stop glaciers melting and sea level rising, UN meteorological chief says",
    "Climate change is causing more turbulence on flights, say scientists",
    "What to look out for as 'heat-health alert' issued in England with temperatures set to rise",
    "Canada on course for worst year of wildfires on record",
    "Dramatic changes to polar ice caps revealed on new map of Arctic and Antarctica",
    "Artificial lawns could be banned in Wales, minister says",
    "'Ecological catastrophe': Five environmental impacts of Ukraine dam collapse",
    "Shell hits back at 'misleading' advert ban with warning on renewable energy",
    "Scotland's bottles and cans deposit return scheme 'can't go ahead as planned'",
    "Flamin' Hot's Eva Longoria, The Idol and The Crowded Room",
    "The campaign to close Britain's last open cast coal mine",
    "Windfall tax, a UK GDP forecast and why is the Vodafone-Three merger taking so long?",
    "Years of austerity left UK 'hugely unprepared' for COVID pandemic",
    "People who got used to face masks during COVID attend smiling lessons",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "Pep: Champions League win was written in the stars",
    "Man City-Inter Milan player ratings: Rodri, Dias shine, Lukaku flops",
    "Man Utd, Bayern, but no Real Madrid: The treble winners Man City have joined",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Sniffer dogs and half-eaten fruit: How children lost in the jungle after plane crash were found"
]