[
    "At least 280 killed and hundreds injured after India train crash",
    "Phillip Schofield fears being spat on in the street over affair",
    "Man, 28, arrested after woman stabbed to death",
    "Putin may have made the same mistake as Hitler - and it will be exploited in the months to come",
    "All aboard the new generation of night trains",
    "Man Utd out to protect a legacy by ending City's treble dream",
    "Rail strikes set to impact FA Cup final and Epsom Derby - and even Beyonce isn't safe",
    "Police still searching sightseeing boat at centre of Bournemouth beach deaths",
    "Saturday's national newspaper front pages",
    "Phillip Schofield can 'bounce back', PR expert says",
    "The rise and fall of Phillip Schofield: A timeline of his departure from ITV",
    "'I didn't lie to protect my career': What have we learned from the Phillip Schofield interviews?",
    "Schofield: 'Do you want me to die?'",
    "Hundreds dead after India train crash",
    "Moments after deadly Indian train collision",
    "Survivor describes train crash",
    "Where is Russia being attacked?",
    "'Situation could have been avoided'",
    "Dailey: Schofield 'in a state of crisis'",
    "Spidey star 'optimistic' about future films",
    "'Schofield's situation could have been avoided'",
    "Explained: Schofield's interviews",
    "Windrush passenger on 75th anniversary",
    "Large sandstorm over Suez Canal",
    "'Almost impossible’ rescue from Mt. Everest",
    "Moment terror teen targets police",
    "Referee surrounded by Roma fans",
    "Ghost orchid flowers for first time in UK",
    "Essex teen sentenced for acts of terrorism",
    "Why did 94 people die in Calabria boat crash?",
    "Kyiv missile 'landed in residential area'",
    "Missile debris hits busy Kyiv road",
    "Kyiv mayor: 'It's genocide against Ukraine'",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Why watch thefts are on the rise",
    "Which jobs are overlooked by young people?",
    "US debt ceiling: Why is it important?",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Police evict homeless from shelter",
    "'I could have died that day'",
    "Bournemouth witnesses speak out",
    "Government 'carefully considering next steps'",
    "Wiegman: 'Everyone is welcome in the game'",
    "US court to hear challenge over Prince Harry's visa",
    "If political culture in Westminster is rotten, bad behaviour will continue",
    "Phillip Schofield's side of the story raises more questions - who knew what, and when?",
    "Everything you need to know about Saturday's rail strikes",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Geraint Davies: The suspended Labour MP at the centre of sexual harassment allegations",
    "Diesel prices in record 12p monthly fall",
    "Parent gets the Bible banned from some of US state's schools - and the reason might surprise you",
    "Inside the battle to stop new gold mine in the 'wild west of Europe'",
    "Spider-Verse star teases live-action version of first black Spider-Man",
    "Terminator blamed for public's concerns about AI",
    "One dead and dozens left homeless after fire rips through building in Rome",
    "'The most humiliating time of my life': Veterans sacked during army 'gay ban' tell PM to say sorry",
    "UK ticket-holder wins EuroMillions jackpot",
    "Labour receives second formal complaint against suspended MP",
    "UK's best free day out named - have you been?",
    "Nurse Lucy Letby denies she inflated infant with air",
    "Are sleeper trains a genuine alternative to flying?",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Greedflation: Are businesses profiteering from cost of living crisis?",
    "Cars, cruises and the cost of a house",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Man Utd out to protect 1999 legacy by ending Man City's treble dream",
    "Hamilton fears 'struggle' to make top 10 in Barcelona Qualifying",
    "Pope says entertainment matters as England close on win against Ireland",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Navalny has sarcastic prison requests for pet kangaroo, moonshine and balalaika denied",
    "China drilling hole over 11,000m deep into the desert"
]