[
    "At least 50 dead and hundreds injured after train crash in India",
    "Labour receives second formal complaint against suspended MP",
    "The mystery man who died on flight to UK - who is he?",
    "Navalny has sarcastic prison requests for pet kangaroo, moonshine and balalaika denied",
    "Nurse Lucy Letby denies she inflated infant with air",
    "Champions League final referee to stay after apologising for attending event linked to far-right",
    "Warm weather to hit UK next week",
    "Phillip Schofield can 'bounce back', PR expert says",
    "'I didn't lie to protect my career': What have we learned from the Phillip Schofield interviews?",
    "Schofield: 'Do you want me to die?'",
    "The rise and fall of Phillip Schofield: A timeline of his departure from ITV",
    "Moments after deadly Indian train collision",
    "Where is Russia being attacked?",
    "'Situation could have been avoided'",
    "Dailey: Schofield 'in a state of crisis'",
    "Explained: Schofield's interviews",
    "Windrush passenger on 75th anniversary",
    "Referee surrounded by Roma fans",
    "Moment terror teen targets police",
    "Essex teen sentenced for acts of terrorism",
    "Alison Hammond in tears over Schofield",
    "'Almost impossible’ rescue from Mt. Everest",
    "Ghost orchid flowers for first time in UK",
    "Why did 94 people die in Calabria boat crash?",
    "Dog found after eight month search",
    "Kyiv missile 'landed in residential area'",
    "Missile debris hits busy Kyiv road",
    "Kyiv mayor: 'It's genocide against Ukraine'",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "'Drone attack' hits Russian oil refinery",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Why watch thefts are on the rise",
    "Which jobs are overlooked by young people?",
    "US debt ceiling: Why is it important?",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Police evict homeless from shelter",
    "'I could have died that day'",
    "Bournemouth witnesses speak out",
    "Government 'carefully considering next steps'",
    "Wiegman: 'Everyone is welcome in the game'",
    "US court to hear challenge over Prince Harry's visa",
    "If political culture in Westminster is rotten, bad behaviour will continue",
    "Phillip Schofield's side of the story raises more questions - who knew what, and when?",
    "Rail strikes return today and tomorrow - here's everything you need to know",
    "How the world of work has changed in 10 years: The jobs now dying out as AI advances",
    "Epstein tried to contact disgraced US gymnastics team doctor Larry Nassar while in prison",
    "Anchorman and Don't Look Up director triples donation to Just Stop Oil",
    "20 arrests over Cardiff riots after fatal crash",
    "Blind veteran with terminal cancer fulfils bucket list skydive",
    "CBI chiefs in bizarre gender balance exchange amid battle for survival",
    "Pupils from two schools left needing hospital treatment after vaping",
    "Opposition frontbencher still in post despite being reported to police, Labour MP says",
    "Labour vows to lower monthly student loan repayments after scrapping tuition fee pledge",
    "Dozens of refugees 'left on the street' in Westminster for two nights",
    "England 'not ready' for extreme heat this summer - and resources are at 'breaking point'",
    "Greta Thunberg is returning to Scotland",
    "Electric car transition 'will cost UK £10bn in taxes' - and rich to benefit most",
    "Delta Air Lines faces possible lawsuit over carbon-neutral claims",
    "'Dead animals don't grow on trees': Demand for animal fat in green jet fuel soars",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "Government plans to 'make recycling easier' to stop waste going to landfill",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Greedflation: Are businesses profiteering from cost of living crisis?",
    "Cars, cruises and the cost of a house",
    "'I'm scared': What it's like to be LGBTQ+ in a country where you could be killed",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Pope hits sparkling double ton with England eyeing emphatic win",
    "Tottenham want Postecoglou talks after Scottish Cup final",
    "Verstappen edges out Alonso, Hulkenberg; Mercedes remain off pace in Spain",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Alison Hammond breaks down in tears on This Morning after Schofield interview"
]