[
    "Fourth allegation emerges - as unnamed presenter 'extremely angry' | Live updates",
    "Everything we know about scandal",
    "What have people been searching online?",
    "Fresh allegations made against BBC presenter",
    "A 15-minute encounter illustrates how the 'zombie drug' crisis is spiralling out of control",
    "Oompa, Loompa, doom-pa-dee Hugh! Grant gets a new look in Wonka trailer",
    "Woman who helped Charles Manson kill two people released from jail after 53 years",
    "Almost one million households face £500 a month mortgage hike, Bank of England warns",
    "North Korea fires intercontinental ballistic missile after complaints over US spy planes",
    "Professional Hawaiian surfer dies aged 44 after being injured by own board",
    "What people have been searching online over BBC presenter scandal",
    "There are now four people with claims against unnamed BBC presenter - here's what we know",
    "BBC presenter scandal: New claims as director-general faces questions",
    "How the BBC says it handled complaint into presenter",
    "Timeline of events in BBC presenter scandal",
    "Why hasn't the BBC presenter been named publicly?",
    "What is parliamentary privilege?",
    "Sunak says BBC presenter allegations 'shocking' but confident 'rigorous' investigation under way",
    "BBC presenter scandal: Young person's parents and lawyer at odds",
    "BBC presenter claims: Questions over trust and transparency",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "BBC presenter should only be named after 'full' investigation, says justice secretary",
    "Culture sec avoids questions on BBC scandal",
    "'KKK' flyers afixed to church property",
    "'We want to be on the same page' as NATO",
    "Timeline of BBC presenter allegations",
    "Tourists warned away from Iceland volcano",
    "Rise in deaths linked to 'zombie drug'",
    "Questions BBC haven't answered",
    "'Armed' man barricades himself in Las Vegas hotel",
    "UK and Oz PMs joke about the Ashes",
    "World leaders take photo after NATO dinner",
    "What is happening to mortgage rates?",
    "Notre-Dame roof supports arrive by boat",
    "Irish 'Rambo': Ukraine will 'haunt me'",
    "Deadly flash floods hit India",
    "BBC boss 'not spoken to accused presenter'",
    "Travel through 5,000 galaxies",
    "Ukraine forces 'strike Russian position'",
    "Death of pregnant YouTuber left mum 'numb'",
    "Elevated road collapse in Bangkok",
    "Ukraine will 'make NATO stronger'",
    "Bulgaria PM on cluster bombs in Ukraine",
    "Czech leader warns of 'war fatigue'",
    "Ukraine will be 'relieved' after NATO summit",
    "Return of missing Russian general explained",
    "Kremlin confirms Putin met with Prigozhin",
    "General seen for first time since failed mutiny",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "What happened in Zaporizhzhia?",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "'We were walking over eggshells'",
    "Back from the Ashes - Broad on pub fire",
    "Should MPs name BBC presenter?",
    "PM: BBC allegations are 'shocking'",
    "Oppenheimer film 'puts audience in bunker'",
    "BBC 'may need to be investigated'",
    "Chesney Hawkes recounts 'horror flight'",
    "Why it's becoming more difficult for BBC presenter's identity to remain under wraps",
    "Wage growth figures defy economic gravity - but there are some signs of a labour market slowdown",
    "The man spearheading the fastest growing social media app in history",
    "Ireland's national broadcaster RTE is facing a crisis - and this is why",
    "Rail and Tube strikes: Full list of dates and services affected",
    "'It's slaughter': Irishman dubbed 'Rambo' tells of horror of fighting in Ukraine",
    "G7's new security arrangement with Ukraine could 'return peace to Europe', PM declares",
    "Paramedic struck off after declaring teenage girl dead rather than perform CPR",
    "Wednesday's national newspaper front pages",
    "Note found under Aretha Franklin's sofa is legal will, jury rules",
    "Jeremy Vine urges unnamed BBC presenter to come forward",
    "SWAT called after man takes woman hostage in famous Las Vegas hotel",
    "Stabbed teacher addresses 'misinformation' about incident - as boy charged",
    "Sunak suggests no tax cuts before next election - as he sets out 'overriding priority'",
    "Has Earth reached the Anthropocene epoch?",
    "Heatwave to grip southern Europe until at least end of next week",
    "Rosebank oil field decision will not come before recess, Sky News understands",
    "'Gold rush' warning over plans to mine precious metals in deep sea",
    "Extreme heat 'killed more than 60,000 people in Europe last year'",
    "Landslides, heat warnings and deadly flash floods in week of wild world weather",
    "Daffodil extract fed to cows could be 'game changer' in reducing methane production",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Scottish isles with sharks and minke whales to receive National Trust protection",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Wage inflation, cricket and business and pensions plans",
    "Spurs, Bayern in talks as Kane set for Postecoglou meeting | Valuation an issue",
    "Sky Sports F1 Podcast: Perez worried by Ricciardo return?",
    "Knight: 'Pressure all on Australia' in Women's Ashes",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "BBC chief to face reporters - as parents respond to young person rubbishing story | Live updates",
    "Turkey makes U-turn on Sweden as NATO summit begins | War latest",
    "Olympic champion Caster Semenya wins human rights court appeal over athletics testosterone rules",
    "Tuesday's national newspaper front pages",
    "Alarming rise in 'zombie drug' deaths in America, weeks after first UK fatality",
    "Fixed mortgage rate at 2008 high after exceeding mini-budget peak"
]