[
    "Chancellor comfortable with recession if it brings down inflation",
    "Boy in critical condition after being hit by police van responding to emergency call",
    "'Material collected' in Madeleine McCann reservoir search to be sent for testing",
    "FBI records reveal 'ever-present' threats to Queen Elizabeth II by the IRA",
    "British Airways cancels dozens of flights after 'technical issue'",
    "Watch moment man arrested after car crashes into Downing Street gates",
    "Leader of far-right militia Oath Keepers jailed for 18 years over US Capitol riot",
    "Astronomers on the island of Ireland find common ground under the stars",
    "Friday's national newspaper front pages",
    "Dani Dyer reveals she has given birth to twins",
    "Net migration rises to new record figure for a calendar year",
    "Big new net migration number is like adding a new city to the UK - but it's complicated",
    "'What is the point of her?'",
    "Hunt on 'big task' of inflation",
    "Zelenskyy's surprise graduation speech",
    "Russian mercenary hands over US corpse",
    "'UK in race for green investment'",
    "Tom Hanks gets Harvard degree",
    "'Move back!': Police arrest man after crash",
    "Where were McCann detectives searching?",
    "Watch moment car hits Downing St gates",
    "Drone appears to reach Russian intelligence ship",
    "'How are we going to cope with migration?'",
    "'Police Scotland is institutionally racist'",
    "McCann search enters third day",
    "Ron DeSantis: Making America anti-woke",
    "Brawl at airport in Chicago",
    "Huge flames engulf Sydney building",
    "Wagner 'withdrawing' from Bakhmut",
    "Charles and Camilla meet mini-mes",
    "Kayakers get shark surprise",
    "Trump reacts to DeSantis launch",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "IMF: Cost of living crisis to continue",
    "'Almighty smash at front gate'",
    "Tina Turner 'a kind and gentle lady'",
    "Farage on Brexit: 'I was never dishonest'",
    "'We want to do everything we can'",
    "Tina Turner shares secret of her success",
    "Turner 'massive loss to communities'",
    "People in Cardiff 'angry' at police",
    "King and Queen greet Northern Ireland crowds, but a royal visit always has a subtle undertone",
    "What is security like at Downing Street?",
    "How Tina Turner inspired domestic violence survivors - but never let abuse define her",
    "What is the energy price cap – and how will it affect my bills?",
    "Wagner boss says his mercenaries handing over control of Bakhmut to Russian troops",
    "Artificial intelligence helping scientists in fight against superbug and breast cancer",
    "Teens among nine arrested over riot sparked by fatal Cardiff crash",
    "'Astonishing betrayal': Tories face backlash for scrapping flagship animal welfare bill",
    "Police with Tasers and 'rifles' confront man after car hits gates with 'almighty smash'",
    "'We're in the global race': Chancellor says UK determined to compete for green investment",
    "Navy's 'Bond ship' in first trial of quantum navigation system",
    "Car that crashed into Downing Street towed away as cordon lifted | Politics latest",
    "'We thought he had died in the war': Funeral for WWII pilot brings long-lost family together",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Flying debris hits cars in Guam typhoon",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Migration, energy and AI in the workplace",
    "Migration, Energy and AI in the workplace",
    "Ron DeSantis: The Republican rival who could trump Trump",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Man Utd overpower Chelsea to secure top-four finish",
    "Magnificent MVG wins record-breaking seventh Premier League Darts title",
    "Kane is Man Utd's No 1 target | Rice and Mount on radar",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "The tragic story of Tina Turner's sons",
    "'Queen of Rock 'n' Roll' Tina Turner dies"
]