[
    "Watch: Teen on sub 'had sense this was not okay'",
    "Expert's 2018 warning was 'ignored'",
    "Texts reveal last-minute price ticket offer to billionaire for sub's doomed journey",
    "Government plans to house migrants in marquees across country",
    "Man, 25, guilty of murder after shooting dead police officer Matt Ratana while handcuffed",
    "It was once Europe's second biggest reservoir - now it's nearly empty after 'barbaric act'",
    "Minister demands snap inspection of school at centre of 'cat gender' row",
    "Pensioner jailed for historical killing was caught by DNA match nearly 50 years later",
    "Hottest parts of UK revealed in weekend forecast as country set to meet 'heatwave criteria'",
    "Man pleads guilty to killing 39 people",
    "Mortgage holders to get 12-month grace period before repossessions amid interest rate hike",
    "US Navy detected likely 'catastrophic implosion' of Titan sub soon after it went missing",
    "Titanic director says he 'knew submersible was destroyed' four days before debris found",
    "The tragedy of the Titan submersible and the dangers of diving down to the Titanic",
    "Student, 19, killed in submersible was 'terrified' before trip but went as a Father's Day present",
    "What happened to the Titan sub",
    "Family of British billionaire Hamish Harding pay tribute following implosion of missing sub",
    "'Father Neptune has no patience for humanity': Expert's warning about Titan in 2018 was ignored",
    "What it's like being in a fully-certified submersible - and how it differs from missing Titan",
    "2018: OceanGate CEO christens Titan sub",
    "'Landing frame and rear cover' found at debris field in hunt for missing sub",
    "Marine traffic shows all Titan search vessels now in place - as submersible robot joins hunt",
    "WhatsApp message reveals debris find",
    "Fate of missing Titan submersible's passengers may rest on one man",
    "Major search continues for missing sub as half the rescue boats still on way",
    "Life after Nova Kakhovka Dam breach",
    "Sir Elton 'not chilling out' after farewell tour",
    "Killed CEO: 'I broke rules to make this'",
    "Saudi Arabia 'sportswashing' claims explained",
    "Family flee boat after it bursts into flames",
    "Warning after dingo bites tourist",
    "Rick Astley on being 'Glastonbury virgin'",
    "Cousin: 'Hamish died doing something he loved'",
    "Stars raise climate awareness in Paris",
    "Moments before Matt Ratana's fatal shooting",
    "Has OceanGate followed protocols?",
    "Teen on Titan 'had a sense this was not okay'",
    "Missing sub: US Navy reveal new details",
    "Killed CEO was 'committed to safety'",
    "'Catastrophic loss of pressure chamber'",
    "What will happen to submersible passengers?",
    "Moment expert reveals parts of Titan found",
    "Moment 'debris field' announced",
    "Counteroffensive will be 'slow'",
    "Footage shows Bakhmut devastation",
    "Putin: West wants 'fight with Russia'",
    "Before and after: Ukraine reservoir dries up",
    "Ukraine war: Aftermath of Russian missile",
    "'Protect Ukraine, protect freedom'",
    "Sewage tsunami floods Kherson",
    "Russian diplomat quizzed over dam claims",
    "'Supportive' for Ukraine NATO fast track",
    "Sub search reaches critical point",
    "What is a resignation honours list?",
    "'Sticky' inflation explained",
    "What we know about the Titan vessel",
    "How the missing sub saga unfolded",
    "Cruise on huge Mission Impossible stunt",
    "'Windrush is me, I am part of that generation'",
    "Shortage of 'miracle' weight-loss drug",
    "Labour: 'People want action not words'",
    "Prince Harry 'has taken flak' says Furnish | Beth Rigby interviews",
    "Chancellor's mortgage plan might mitigate against chaos - but it will not prevent the pain",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "The descendants of the Windrush generation who changed Britain",
    "From Ozempic to Wegovy, the weight loss injections taking TikTok by storm",
    "How are political parties performing as an election looms? Find out with Sky's live poll tracker",
    "The stars getting ready for their first appearance on the Glastonbury stage",
    "Steps turn down gig in Dubai over country's 'archaic' LGBT+ laws",
    "Ireland TV boss suspended amid scandal over payments to star",
    "Heathrow security staff vote for pay deal and avert summer of strike action",
    "Teen mother cries in dock after being found guilty of murdering newborn son",
    "Chancellor announces new measures for mortgage holders after meeting top bankers | Politics latest",
    "Lawyers used ChatGPT to help with a case - it backfired massively",
    "Arctic Monkeys will play Glastonbury after all - but who are The Churnups?",
    "Junior doctors to strike 'in longest single walkout in NHS history'",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "How modern tech relies on raw materials",
    "Can National Grid really provide emergency energy this winter?",
    "'Very high' risk of wildfires over England and parts of Wales",
    "Mortgages, interest rates and women in business",
    "Brilliant Beaumont cracks century as England look to reel in Australia",
    "Whyte set to receive contract for Joshua fight",
    "Man Utd will walk away from Mount if £55m offer is rejected",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Navy captain reveals what could have caused sub to implode"
]