[
    "Ukrainian troops 'advance' towards Bakhmut - as Russia denies reports of breakthrough | War latest",
    "Watch: What is Ukraine's counteroffensive?",
    "Thousands of migrants travel to US border as Title 42 restrictions end",
    "Rail passengers and Eurovision fans face significant disruption in fresh strikes",
    "UK economy shrank 0.3% in March",
    "World-leading NHS cancer centre downgraded",
    "YouTuber who staged small plane crash to plead guilty to obstructing investigation",
    "British businessman Lynch extradited to US weeks after losing appeal",
    "'He thinks he's untouchable' - Pakistan minister defends Imran Khan arrest",
    "Chancellor: 'There is much to do'",
    "Imran Khan arrives at court",
    "Migrants rush to US-Mexico border",
    "What is happening on the US-Mexico border?",
    "What is Ukraine's new counteroffensive?",
    "Pakistan minister reacts to Khan arrest",
    "Kalush Orchestra on Eurovision 2023",
    "What are Storm Shadow missiles?",
    "Tornado-like cloud spotted in UK",
    "Motorhome overturns on highway",
    "Dangerous driver runs red light",
    "Trump fans show their support",
    "Storm Shadows already in Ukraine",
    "UK gives long-range missiles to Ukraine",
    "Wagner boss appears to insult Putin",
    "'West encouraging Russophobia'",
    "Russia holds 'scaled back' Victory Day parade",
    "Ukrainian PM on attack preparations",
    "Drones shot down over Kyiv",
    "Ukraine hit by wave of strikes",
    "How rate rise will affect you",
    "Prince Harry's court case, explained",
    "Why the Pakistan unrest matters",
    "New protest laws explained",
    "'The reason I'm dressed like this...'",
    "'This is a big swing' to Labour",
    "UK economy being hit on multiple fronts - and there's little cause for celebration despite growth",
    "Cost of living pain still to come for millions despite Bank of England's rosier outlook",
    "Race to US border: What does the end of Title 42 mean?",
    "Who will win Eurovision and what songs should you look out for?",
    "The View forced to abandon gig after bandmates fight on stage",
    "Taylor Swift not behind bestseller mystery memoir",
    "Zelenskyy blocked from making address at Eurovision - as final qualifiers announced",
    "Royal fan detained for 13 hours after 'wrongful arrest' at King's coronation",
    "Elon Musk appoints new Twitter chief executive - but is yet to officially announce her",
    "Largest cosmic explosion ever spotted by astronomers",
    "Russia threatens 'military response' after UK gives long-range missiles to Ukraine",
    "Friday's national newspaper front pages",
    "US veteran to face manslaughter charge over subway chokehold death of homeless man",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "At least 129 dead due to torrential rainfall in Rwanda",
    "Climate protesters sing Spice Girls to disrupt bank meeting",
    "Could hot water pipes replace traditional gas boilers?",
    "'Flying thermometer' which could save you money pinpoints homes leaking most heat",
    "Heat networks: Is this how your home will get heated in the future?",
    "Bank Holiday mini-heatwave as temperatures set to soar to 21C",
    "Spain believed to have had hottest April day ever",
    "El Nino: What is it and how does it impact the weather closer to home?",
    "King breaks ground for net zero research lab in first official engagement since coronation",
    "East Africa drought would not have happened without humans, new science says",
    "This area of Spain could become too hot for tourists",
    "Public order laws: Are we losing the right to protest?",
    "Eurovision: The Ukrainians who fled to Liverpool",
    "Rachel McAdams, Patricia Arquette, Air and I Kissed a Boy",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Haaland named FWA Men's Footballer of the Year | Kerr wins Women's award",
    "Antonio gives West Ham ECL semi lead | Moyes: I was about to sub him!",
    "Premier League build-up LIVE! Klopp, Howe preview weekend games",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Furious Speaker rebukes minister as Tory MPs line up to criticise EU law U-turn"
]