[
    "Ukraine 'sailing close to the wind' as airborne counteroffensive 'now under way' | Live updates",
    "Reason for Venice canal turning bright green revealed",
    "'Irresponsible' adverts featuring rapper ArrDee banned",
    "The Old Father: Al Pacino expecting fourth child at 83 - with 29-year-old girlfriend",
    "Put fewer things in recycling to cut spoilage, govt to tell UK - reports",
    "Jordan prepares for royal wedding of Crown Prince",
    "Labour defends taking £1.5m given by Just Stop Oil donor",
    "Sweet-toothed bear raids bakery",
    "Man caught slashing speed camera van's tyre",
    "Terrifying shootout aboard moving bus",
    "'A nuclear catastrophe waiting to happen'",
    "'One day our luck will run out' on nuclear plant",
    "Crew parachute back to earth after space mission",
    "Car flies through the air at full speed",
    "'We're not heading to the 1970s'",
    "'AI could put us in a fragile position'",
    "Kathleen Stock controversy explained",
    "'Drone attack' hits Russian oil refinery",
    "Bull charges into crowd at rodeo event",
    "Wildfires spread in Nova Scotia, Canada",
    "Drone seen flying over Moscow suburb",
    "Who could be behind Moscow drone attacks?",
    "Drone 'attack' damages Moscow buildings",
    "Rocket debris hits car in Kyiv",
    "What Kyiv attacks can tell us",
    "Kyiv metro becomes shelter amid air strikes",
    "Kyiv hit by barrage of Russian missiles",
    "This Morning row explained",
    "What is the Geo Barents rescue ship?",
    "Why carbon capture is controversial",
    "How Sudan ended up in a humanitarian crisis",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "'Friendship and love' behind Rob Burrow marathon",
    "PM: Govt 'cooperating with COVID inquiry'",
    "Johnson refutes 'COVID rule breaches'",
    "Praise for Mermaid star Halle Bailey",
    "How The Little Mermaid came to life",
    "'An incredible human' Mead on Wiegman",
    "'No agenda in casting The Little Mermaid'",
    "What makes a good football manager?",
    "Who might be behind the drone attack on Moscow? Look at who has the most to gain",
    "UK government not the first to consider food price cap as poorest hit hardest by inflation",
    "The UK trains impacted by strike action this week",
    "US debt ceiling: What is it and how devastating would a default be?",
    "Timeline of Schofield's ITV departure after colleague affair and Willoughby 'rift'",
    "Ex-Met Police officer appears in court charged with rape",
    "Court to hear challenge over Prince Harry's US visa following drug revelations",
    "ITV bosses to be quizzed by MPs - as Phillip Schofield is dropped by charity founded by the King",
    "Senior Indian official fined for allowing reservoir to be drained in bid to find lost phone",
    "China warns over AI risk as Xi urges national security improvements",
    "NATO-led troops put up barbed wire in Kosovo after clashes in northern towns",
    "'Horror' as girl, 1, left to die in hot car for nine hours while foster mother went to work",
    "'This is my chance at a second life': The dramatic aftermath of mass migrant rescue",
    "Countries divided over global treaty on 'worsening plastic crisis'",
    "River Wye's health status downgraded after reduction in key fish population",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Mars trialling paper wrappers to cut plastic waste",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Labour would 'stop new North Sea oil and gas projects'",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The 'black gold' that could help fight climate change for centuries to come",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Burgers, books and mortgages",
    "Migrant crisis: The people found at sea",
    "The price of food, carbon extraction and bowling",
    "'Don't rule out' COVID-19 lab leak theory, Chinese scientist says",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Toone: Sarina could ruin our holidays with squad announcement",
    "England: The selection dilemmas facing Wiegman as World Cup nears",
    "Stokes: I've given myself 'best opportunity' to bowl in Ashes",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "The Papers: Fears AI 'could wipe out humanity' and 'COVID cover-up' row"
]