[
    "Johnson calls findings 'a lie'",
    "MPs to debate privileges committee report on Monday",
    "'Johnson is a lawbreaker and a liar' - Labour",
    "Johnson ally: 'No evidence at all or proof that he knowingly misled the House'",
    "'It was all a pantomime' - damning new testimony from No 10 official revealed",
    "Boris Johnson has been damned but he may have more grenades to throw",
    "The key findings of privileges committee report that sealed Boris Johnson's fate",
    "Two teenagers charged with murder of a 16-year-old in Bath",
    "'Look out for each other': Fathers of Nottingham victims speak at vigil",
    "Scientists create synthetic human embryos using stem cells in major breakthrough",
    "'Where is my mum?' Families of concert crush victims feel 'greed' played part in 'stampede'",
    "Hundreds feared dead as search continues for missing migrants in boat disaster",
    "Families pay tribute to 'talented' young sport stars and caretaker killed in Nottingham attacks",
    "Timeline of Nottingham early morning attacks",
    "School caretaker stabbed to death was 'great father' who was months away from retirement",
    "Nottingham attacks: What we know so far",
    "Family of teen victim of Nottingham attacks tell of 'devastation' at 'senseless murder'",
    "Nottingham attacks: Witness heard 'bang' and 'scream' as van hit people",
    "Police attend Nottingham scene",
    "'Scary' situation unfolds in Nottingham",
    "Starmer on Nottingham incident",
    "How modern tech relies on raw materials",
    "'The evidence is overwhelming'",
    "'People need to be held accountable'",
    "Homeowners warned of mortgage pain",
    "Explained: ITV bosses quizzed on Schofield",
    "Plane crashes into sea off Welsh coast",
    "Dozens dead after boat capsizes",
    "Explained: Donald Trump's indictment",
    "Vigil held for victims of Nottingham attacks",
    "Italy's final farewell to Berlusconi",
    "Dealer throws drugs out of window",
    "Nottingham suspect on CCTV before attacks",
    "Trump tells Sky News he is feeling 'great'",
    "Johnson waves at reporters",
    "Woman found alive in coffin",
    "Pro golfer tackled by security",
    "'Two women taken away by armed officers'",
    "Watch 30ft Hawaii lava fountains",
    "Russian missile strikes hit Odesa",
    "Ukraine unwrapped: Counteroffensive under way",
    "Sky's Sean Bell on 'sobering' battles in Ukraine",
    "Ukraine's counteroffensive explained",
    "Ukraine: 'No one was on the ground helping'",
    "Ukraine liberators' message to Putin",
    "Ukraine Leopard tank 'destroyed' by Russia",
    "Zelenskyy tight-lipped on counteroffensive",
    "Volodymyr Zelenskyy greets Trudeau in Kyiv",
    "'Ukraine's counteroffensive failed'",
    "What are the abortion laws in the UK?",
    "Wages are going up - but it's not all good news",
    "What happened in Nottingham?",
    "France: What happened to Solaine Thornton?",
    "Trump to appear at Miami courthouse",
    "COVID inquiry: Everything you need to know",
    "Trustee: 'No idea why he chose here'",
    "Junior doctors begin walkout",
    "'Silly and absurd' Sturgeon policies",
    "Michael Morpurgo on dads reading with kids",
    "Johansson returning to Marvel?",
    "NHS: 200,000 appointments to be disrupted",
    "'I saw the police draw their guns at him'",
    "Nottingham witness on police raid",
    "Mortgage payers face largest home loan squeeze since early 1990s housing crash | Ed Conway",
    "Vodafone and Three merger to test how much Johnson era national security law can stop acquisitions",
    "Who wants to be the next US president? From political giants to Oprah's 'spiritual adviser'",
    "Junior doctors on strike today - here's how it will affect NHS care",
    "National Grid to keep blackout prevention scheme for coming winter",
    "Two hurt in fire at block of flats as crews continue to tackle hotspots",
    "Hedge fund takes action as fallout over founder's misconduct scandal deepens",
    "Banksy to reveal iconic stencils 'hidden away for years' at new show",
    "'Missed beyond words': British victim of Egypt dive boat fire named as family pays tribute",
    "Meerkats die at zoo following exposure to unknown toxin from ID dye",
    "Beyonce blamed for surprise rise in inflation in Sweden",
    "Nick Kyrgios reveals he contemplated suicide after 2019 Wimbledon loss",
    "Premier League leads European money stakes but Championship clubs 'living beyond their means'",
    "'Very high' risk of wildfires over England and parts of Wales",
    "Schools forced to close after taps run dry in heatwave",
    "Stop celebrating only hot weather, urges leading environmentalist",
    "UK tech groups win £4.3m to develop space-based solar power",
    "Anglian Water advert banned for omitting sewage record",
    "Don't dig your garden, says B&Q - here's why",
    "Warm weather returns after thunderstorms and flooding",
    "'Today is technically my last school strike,' says Greta Thunberg",
    "Government wobble on windfall tax may be of political benefit but risks a renewable backlash",
    "Labour U-turn on £28bn green plan a sign of economic limitations for energy revolution",
    "As smoke blankets parts of US, unexpected symptoms of poor air quality revealed",
    "El Nino returns and could bring record hot temperatures",
    "World has lost battle to stop glaciers melting and sea level rising, UN meteorological chief says",
    "The challenges of getting to a net zero world",
    "Toxic workplace culture and what to do about it",
    "Johnson, Sturgeon and Trump: Former leaders and the latest fallouts",
    "PL fixtures 2023/24: Man City open season at Kompany's Burnley",
    "Premier League 2023/24 fixtures released LIVE!",
    "West Ham reject Arsenal's opening £80m-plus Rice bid",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Thursday's national newspaper front pages"
]