[
    "BBC presenter 'appeared in underwear in video call' - as MP says corporation 'needs to get a grip'",
    "Analysis: This new scandal is not a good look for BBC",
    "Questions that the BBC must answer",
    "'It's not me': The BBC stars who have denied paying a teenager for explicit photos",
    "Mystery over woman who threw confetti at George Osborne's wedding",
    "Why Sunak and Biden are struggling to keep spark of special relationship alive | Adam Boulton",
    "Radars detect mile-long swarm of flying ants near UK's south coast",
    "Cabinet ministers being sued by asylum seekers 'falsely imprisoned' on remote island",
    "Questions BBC must answer over presenter accused of paying for explicit photos",
    "England chasing 251 to beat Australia and keep Ashes hope alive | Ashes latest",
    "What we know about claims against BBC star",
    "How UK debt compares to other countries",
    "Mob storms LGBT event in Georgia",
    "Orange confetti thrown over former chancellor",
    "Whitehall on Colman accent 'diss'",
    "MP responds to child mural removal",
    "Reeves: 'I wouldn't endorse cluster bombs'",
    "Whitehall on selling Pokemon card for £100",
    "Pilot asks volunteers to leave 'heavy' plane",
    "'Home Office: Wrong plan. Wrong place'",
    "Off-duty police volunteer disarms gunman",
    "Palestinian fighter says Israel failed",
    "'Hopefully he never sees Christmas again'",
    "Russian jets 'harass' US drones again",
    "Smuggler caught after high-speed chase",
    "Police chase pig on the loose",
    "PM on use of cluster munitions",
    "Zelenskyy marks 500 days of conflict",
    "Ukrainian medics fight to keep casualties alive",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "Mum's anguish at police tweet",
    "Mamoudou Athie on Pixar's Elemental",
    "In full: Blair on the future of AI",
    "BBC assured us it had learned from past mistakes - this fresh scandal is not a good look",
    "Ukraine risks losing initiative at war's critical stage - and time may not be on Zelenskyy's side",
    "Everything we know about claims a BBC presenter paid teen for sexually explicit photos",
    "Chart shows who's most likely to win third Test with England chasing 251 to stay in the Ashes",
    "Blue singer Lee Ryan 'physically assaulted' on plane after 'putting feet on seat'",
    "Sunday's national newspaper front pages",
    "Sunak and Biden to meet in UK amid divisions over US plan to send cluster bombs to Ukraine",
    "'You're in my head, heart and soul': Sir Elton John thanks fans at last gig of final tour",
    "Number of homeless people admitted to hospital rises by 60% in four years",
    "Amazon warehouse workers to strike for three days, clashing with Prime Day sales",
    "Anti-LGBT mob storms pride event in Georgia",
    "US football legend Megan Rapinoe announces retirement",
    "England win under-21 Euros with victory over Spain",
    "Big sporting events hit by rain as thunderstorm warning in place for most of UK",
    "UK's favourite European coastal destination revealed - and the worst",
    "British lorry that only emits water starts trials",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "Company flotations, government bonds and online safety",
    "What's the future for the NHS? | Steve Barclay and Wes Streeting",
    "Councillor whose long COVID diagnosis turned out to be cancer dies",
    "England chasing 251 to keep Ashes series alive LIVE!",
    "Edwards: Fearless Capsey amazing in Lord's win | 'Ashes still alive'",
    "Hamilton: McLaren pace a 'wake up call' for Mercedes | Tough race to come"
]