[
    "Mum of teen killed in Cardiff crash says son was 'loving' and not 'how media portrayed him'",
    "Paralysed man walks again thanks to 'digital bridge' that reconnects brain and spinal cord",
    "Paralysis breakthrough is quite astonishing - and AI is the key",
    "Madeleine McCann police use sniffer dogs to comb wooded area during reservoir search",
    "Nurse says 'raw sewage' on hospital floor may have contributed to baby deaths",
    "Facebook urged to 'stand up for babies' over unsafe formula milk ads",
    "'He's a Trump wannabe': Ron DeSantis as president is exciting for some, but frightening for others",
    "When will food prices start to fall?",
    "COVID inquiry issues legal notice to Cabinet Office for not releasing full Johnson messages",
    "Bags removed by Madeleine McCann police during reservoir search",
    "Officials in Madeleine McCann search focusing on concentrated area of reservoir",
    "How events unfolded in the disappearance of Madeleine McCann",
    "McCann search: Police scour reservoir area",
    "CCTV shows seconds before Cardiff crash",
    "Police continue search for McCann",
    "Tributes paid to Cardiff crash victims",
    "People in Cardiff 'angry' at police",
    "Do we have an inflation problem?",
    "'No other vehicles involved in fatal crash'",
    "Thieves wearing burqas raid jewellers",
    "New CCTV before fatal Cardiff crash",
    "Fake families smuggled into the UK",
    "The town with 10,000 sinkholes",
    "Runaway cow caught on Detroit motorway",
    "Angry Speaker asks MP to leave PMQs",
    "Taylor Swift's piano plays itself",
    "Angry man shoves activist to ground",
    "Moment West Midlands police raid home",
    "CCTV shows police van following bike in Cardiff",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Are  F-16s a game changer for Ukraine?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "IMF: Cost of living crisis to continue",
    "What is the Ministerial Code?",
    "Retracing Nikki Allan's last known steps",
    "McCann reservoir search explained",
    "'I've complained about Spotify'",
    "People smuggled into UK on worker visas",
    "'Trump will not be silenced'",
    "'The world has moved on' from partygate",
    "Kanda family speaks about son's murder",
    "South Wales police refers itself to watchdog",
    "Bailey: 'Very big lessons to learn’",
    "David Boyd's sentence a 'disgrace'",
    "Godmother speaks out over Cardiff teen",
    "Some good news, but the inflation figures will deeply worry economists",
    "For Boris the travelling showman, COVID - and rules broken - is the baggage he can't lose",
    "Spending calculator: See which prices have gone up or down",
    "TikTok prankster fined £200 and given social media ban after entering family's home",
    "Microsoft lodges appeal against block on $75bn Call of Duty deal",
    "Love Island contestants will be banned from social media",
    "Jaguar Land Rover owner set to build new gigafactory in UK",
    "95-year-old woman tasered by police dies",
    "Labour MP suspended for harassing assistant and racially abusing journalist has whip restored",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Warmest weather of the year expected in UK over bank holiday weekend",
    "Rapist who 'inflicted pain and misery' on women, children and animals jailed for 12 years",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "The Podcast Show, inflation and special musical guests from The Charlatans and Spandau Ballet",
    "How 'fake' families are smuggled into the UK on skilled worker visas",
    "Borrowing, groceries and the avoidance of a UK recession",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Haaland, De Bruyne back for Man City at Brighton LIVE!",
    "Scottish Premiership LIVE!",
    "Sterling, White left out of England squad | Dunk, Eze called up",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Millions preparing to flee homes as volcano spews ash and rock"
]