[
    "'Any blackmail is doomed to failure,' defiant Putin warns after attempted rebellion",
    "Russian fighter jets scrambled after three UK warplanes detected near border, Moscow claims",
    "Exiled Wagner boss breaks silence in new audio message",
    "'Monster' who murdered five people at LGBT+ nightclub jailed for life",
    "Anger in Italy as tourist filmed carving names into the Colosseum",
    "Tory mayoral hopeful denies groping allegations",
    "Tuesday's national newspaper front pages",
    "BT took three hours to report 999 fault to government",
    "'It's kind of silly': Harrison Ford on playing Indiana Jones for four decades",
    "UK needs plan for 'implosion of Russia', says ex-PM",
    "Putin risks looking weak if he replaces defence minister Shoigu",
    "On streets of Moscow, people seem shaken up by Wagner rebellion",
    "What does the aborted Russian mutiny mean for the war in Ukraine?",
    "Russian defence minister seen for first time since attempted Wagner coup",
    "Hope turns to indifference in Ukraine - but some believe mutiny was only act one of Putin's drama",
    "It doesn't matter the Wagner rebellion failed - what matters is it was allowed to happen at all",
    "Rebel Wagner troops to be absorbed into Russian military as Prigozhin heads to Belarus",
    "Rebellion in Russia: How the revolt led by 'Putin's Chef' unfolded",
    "How does Wagner's strength measure up to the Russian military?",
    "Hot dog seller to mercenary boss: Who is Wagner Group leader Prigozhin?",
    "Dangerous Wagner mercenary boss was disaster waiting to happen for Putin",
    "Russia civil unrest triggered by Wagner mercenary mutiny offers hope to Ukrainians",
    "What is the threat posed by Wagner boss Yevgeny Prigozhin?",
    "Hunt for man who defaced Colosseum",
    "'Armed rebellion would have been suppressed'",
    "Nicola Bulley: Inquest shown dive video",
    "'Can you please stop smiling?'",
    "Harrison Ford on his return as Indiana Jones",
    "RAF jets 'seen near Russian border'",
    "'We had nothing to do with it'",
    "William teams up with Spice Girl",
    "Prigozhin 'didn't want to shed Russian blood'",
    "Myanmar burns drugs worth more than £350m",
    "'The worst hospital I've ever seen!'",
    "Will Murray hang up his racket?",
    "Festival-goers queue for blow-dries",
    "Putin doesn't mention rebellion",
    "NATO on 'fragility of Russian regime'",
    "Prigozhin 'destroyed' Putin's case for war",
    "Russian defence minister 'in Ukraine'",
    "'Cracks' in Russia's 'facade'",
    "Russians react to rebellion",
    "What's going on with mortgages?",
    "Questions remain about Titan's safety issues",
    "What did Putin say and why is it significant?",
    "The rise of ocean heatwaves in Scotland",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Roe v Wade: US abortion rights a year on",
    "What are the pros and cons of electric cars?",
    "Prigozhin 'not welcome in Belarus'",
    "PM wants 'responsible' public sector pay",
    "Minister: Inflation is top priority",
    "Treasury minister stresses inflation impact",
    "Krept & Konan on coping with Glastonbury",
    "Prince's homelessness project pushes his political neutrality to its limits",
    "Chancellor's mortgage plan might mitigate against chaos - but it will not prevent the pain",
    "Three days of rail strikes planned for July - how will train services be affected?",
    "'The end of Wagner as we know it': What happens to Prigozhin and his private army next",
    "Banks aren't passing interest rate hikes on to savers fast enough, chancellor warns",
    "Nicola Bulley was alive when she entered river - and had not been drinking, inquest hears",
    "Cost of sending each migrant to countries such as Rwanda is £169,000",
    "Ginger Spice joins Prince William on mission to end homelessness",
    "Teen mother jailed after murdering newborn son",
    "Woman sexually assaulted at Harry Styles concert",
    "Man, 25, killed in hot air balloon crash named",
    "Woman shot Uber driver dead 'because she believed she was being kidnapped'",
    "Austerity measures hit public health services, COVID inquiry told",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Inflation, interest and independence | John Glen, Lisa Nandy and Humza Yousaf",
    "Scotland legend Craig Brown dies aged 82",
    "England player ratings: Beaumont and Ecclestone excel during defeat",
    "Man Utd's £55m Mount bid still on table | Caicedo, Rabiot among other targets",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime.",
    "Former Scotland manager and one of football's 'great coaches' dies"
]