[
    "Putin and Zelenskyy among world leaders to congratulate Turkey's Erodgan on election victory",
    "This Morning to return today after Phillip Schofield controversy - as presenters announced",
    "Two dead and two missing as boat carrying British tourists overturns on Italian lake",
    "Elton John among tributes to 'total legend' Jeff Stelling during final Soccer Saturday",
    "Leicester and Leeds relegated from Premier League as Everton survive on dramatic final day",
    "'80 robberies a day' last year had no suspect identified before cases closed",
    "What is next for one of the Premier League's newest - and smallest - stadiums?",
    "Monday's national newspaper front pages",
    "'Pretty much a dream come true': Michael Ball returns to West End with musical that made him",
    "Why Phillip Schofield's admission should kill off his career",
    "Phillip Schofield 'took us for fools', says ex-This Morning presenter",
    "Phillip Schofield admits affair with much younger man - and steps down from ITV",
    "Schofield's agent cites 'honesty and integrity' after dropping him - their statements in full",
    "Stelling signs off from Soccer Saturday",
    "Woman arrested after driving down beach in US",
    "Praise for Mermaid star Halle Bailey",
    "'No agenda in casting The Little Mermaid'",
    "How The Little Mermaid came to life",
    "Is Luton's stadium fit for the Premier League?",
    "Attacks on Kyiv's anniversary",
    "Why carbon capture is controversial",
    "Erdogan and Kilicdaroglu vote in Turkey",
    "Erdogan: 'Bye, bye, bye Kemal'",
    "'Explosive' volcanic activity continues",
    "How Sudan ended up in a humanitarian crisis",
    "Dogs defend owner against bear invasion",
    "Dermot O'Leary asked about Phillip Schofield",
    "'You've been pretty blunt on WhatsApp'",
    "Russia 'invading Belarus by stealth'",
    "Dnipro clinic destroyed in missile strike",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Wagner 'withdrawing' from Bakhmut",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Johnson refutes 'COVID rule breaches'",
    "'An incredible human' Mead on Wiegman",
    "What makes a good football manager?",
    "Female gamers face hate 'all the time'",
    "World Cup 'too soon' for Lioness",
    "Erdogan has proved his critics wrong and outmanoeuvred his toughest challengers",
    "Sunak now oversees a government unable to do anything new, complex or difficult",
    "The 'black gold' that could help fight climate change for centuries to come",
    "Boris Johnson failed to answer key question after Sky News 'doorstep'",
    "'They set us on fire and took everything': Inside refugee camps as thousands flee Sudan",
    "Husband unaware pregnant wife and baby killed in Sudan shooting",
    "Man charged with murder after teenager fatally stabbed",
    "Athlete dies while swimming in triathlon, organisers say",
    "Two men in 20s die after being pulled from sea",
    "PSG goalkeeper in intensive care",
    "Venice's famous canal turns fluorescent green",
    "Protest planned against Roger Waters' concert over 'Nazi costume'",
    "Ex-This Morning star criticises 'toxic culture' at ITV show",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Dyche: Time Everton did big-club things | Carra: Don't celebrate, sack the board!",
    "Leicester relegated from Premier League despite beating West Ham",
    "Doucoure stunner fires Everton to Premier League survival",
    "8 dedicated sports channels, including Premier League, F1® & more."
]