[
    "PM 'discourages' use of cluster bombs after Biden agrees to send to Ukraine",
    "New record number of Channel crossings in a single day so far this year",
    "'Household name' BBC presenter 'paid teen for sexually explicit photos'",
    "George Osborne and fiancee 'really upset' by 'poison pen' email on eve of wedding",
    "Licence fee is 'regressive' and wealthier should pay more, says ex-BBC chair",
    "Ukraine risks losing initiative at war's critical stage - and time may not be on Zelenskyy's side",
    "UK's favourite European coastal destination revealed - and the worst",
    "Putin plans to step foot on NATO territory for first time since Ukraine war",
    "'Horrendous' police tweet used Top Gun GIF to celebrate identifying woman's dead daughter",
    "Police scramble to catch runaway goats",
    "Miracle escape as train hits car",
    "Woman tells Trump he's 'gorgeous'",
    "Ukrainian medics fight to keep casualties alive",
    "Top Gun police tweet 'horrendous'",
    "Off-duty police volunteer disarms gunman",
    "Palestinian fighter says Israel failed",
    "Mum's anguish at police tweet",
    "Mamoudou Athie on Pixar's Elemental",
    "'Hopefully he never sees Christmas again'",
    "Russian jets 'harass' US drones again",
    "Smuggler caught after high-speed chase",
    "Police chase pig on the loose",
    "Drones search for sharks after bite reports",
    "Near-extinct African wild donkey born",
    "Rabbit hunt: Police seek bunny burglar",
    "Swimmers flee water after shark spotted",
    "How could cluster bombs impact Ukraine war?",
    "Lukashenko: 'Priogzhin is free'",
    "Wagner chief's home raided",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "How close is Ukraine to a nuclear disaster?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "In full: Blair on the future of AI",
    "'Teachers don't want to strike'",
    "'We want to resolve teachers' strike'",
    "Users react to Meta's launch of Threads",
    "'How will Labour level up schools?'",
    "'Tragic end of term for the girls'",
    "America risks losing moral high ground by supplying Ukraine with controversial bombs",
    "China risks falling further behind US in AI race with 'heavy-handed' regulation",
    "Chart shows who's most likely to win Ashes third Test after another thrilling day",
    "Mysterious shapes spotted in satellite images of Russian-occupied nuclear plant in Ukraine",
    "This is how AI could change the future of journalism",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Watch: Could AI do the job of a news organisation?",
    "British lorry that only emits water starts trials",
    "Paris Hilton accused of 'living under a rock' over 'problematic' new puppy",
    "Man charged with couple's murder on Essex holiday island",
    "China's Xi calls for 'enhanced war planning' as jets sent near Taiwan",
    "Girl killed in Wimbledon school crash named",
    "Andy Murray casts doubt on Wimbledon return after second-round exit",
    "Saturday's national newspaper front pages",
    "Dutch PM resigns after collapse of coalition government",
    "BT Group chief executive Jansen to step down next year",
    "Biden admits 'difficult decision' to send cluster bombs to Ukraine",
    "All aboard: Can hydrogen decarbonise our roads?",
    "Are hydrogen HGVs the future?",
    "Study reveals how hot is too hot for the human body to function",
    "Wet Wet Wet: Festival shelved and fans stranded in terminal due to extreme weather",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "Company flotations, government bonds and online safety",
    "What's the future for the NHS? | Steve Barclay and Wes Streeting",
    "Councillor whose long COVID diagnosis turned out to be cancer dies",
    "Leclerc leads Albon in wet final practice at Silverstone",
    "Wimbledon LIVE! Alcaraz in action before Boulter faces Rybakina",
    "The Ashes: Rain delays start to day three with early lunch taken LIVE!",
    "Ukraine war is at a critical moment - and Zelenskyy needs some good news",
    "Wagner troops leave Central African Republic after 'refusing contracts with Russia'"
]