[
    "'We're not going away': PM delivers 'straightforward' message for Putin at G7 summit",
    "'I'll win next election,' Sunak says",
    "PM unveils ban on Russian diamonds",
    "Brother of Phillip Schofield jailed for 12 years over child sex offences",
    "Man pleads guilty to plotting gun attack at Speakers' Corner in Hyde Park",
    "'A total one-off': Andy Rourke, who played bass for The Smiths, has died",
    "'Arrests may follow' as police investigate footage of attack on West Ham fans",
    "Woman hit by police motorcycle escorting Duchess of Edinburgh remains in 'critical' condition",
    "Two arrested over attempted murder of senior NI police detective",
    "Mass brawls, drunken threats and passengers stripping off: 'Air rage' incidents surge in the UK",
    "A timeline of Harry and Meghan's 'car chase'",
    "Harry & Meghan's 'car chase' route",
    "What have people said about the 'paparazzi chase'?",
    "A hounded couple or a pair of hypocrites? Public opinion on Harry and Meghan as divided as ever",
    "It's impossible not to be reminded of Diana after 'dangerous' pursuit of Harry and Meghan",
    "A history of Harry v the paparazzi",
    "Biden styles out stumble in Japan",
    "G7 leaders plant trees in Hiroshima",
    "'How do you feel when you lose?'",
    "More than 1,000 air rage cases last year",
    "Rishi Sunak: The full interview",
    "Where are England's missing pupils?",
    "Bereaved mother: 'This violence has to stop'",
    "King receives honey from David Beckham",
    "Police ram into car of 'confused' woman",
    "Russia's latest missile attacks",
    "Sofa flies through air in storm",
    "Pregnant woman rescued from flood",
    "E-scooter fire engulfs kitchen in seconds",
    "Kyiv hit by fresh wave of missiles",
    "Ukraine commander rallies Bakhmut troops",
    "Inside the battle for Bakhmut",
    "What happened on Zelenskyy's visit?",
    "'You can't believe a word they say'",
    "Ukraine: What aid has UK provided?",
    "Wallace defends cuts after Sky report",
    "Kremlin reacts to UK Ukraine support",
    "A hug and a pledge from PM to Zelenskyy",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What could happen next in Ukraine?",
    "Pakistan: What we know so far",
    "What is Title 42 and why has it expired?",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "PM building strong ties with Tokyo",
    "UK battery industry 'doomed by govt'",
    "'Government should make sure babies get fed'",
    "Russia 'has to be held accountable'",
    "We're starting to get a clearer idea of what a Labour government would look like",
    "Why addressing sewage spills was not a priority for the water industry or for its regulator",
    "Abandoned camps hint at a far darker next chapter for China's Uyghur people",
    "Why is sewage pumped into rivers and the sea?",
    "'Pain is progress': Jeremy Renner takes first jog since near-fatal accident",
    "15 million excess deaths worldwide were caused by COVID over two years",
    "Paparazzi reject Harry and Meghan's demand to see photos from 'chase' in mocking letter",
    "Former Mirror employees speaking in court | Harry hacking trial live",
    "Absence in schools is now at crisis point. This is Teddy's story",
    "UK rich list revealed - as PM and wife 'lost £500k a day' last year",
    "Doctor, 88, held captive by al Qaeda-linked militants for seven years freed",
    "'Astonishing' rise in Britons with an irregular heartbeat -  these are the main warning signs",
    "95-year-old woman using walking frame tasered by police at care home in Australia",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "At least 129 dead due to torrential rainfall in Rwanda",
    "Could AI really take your job?",
    "Water firms apologise, BT shrinks workforce, and Royal Mail in the red",
    "Cannes Film Festival Special: Johnny Depp, Indiana Jones and Richard Gere",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "West Ham players defend friends and families from violent AZ fans",
    "Premier League press conferences LIVE! Arteta: We're still in title race",
    "Feyenoord fearing manager Slot will move to Tottenham",
    "8 dedicated sports channels, including Premier League, F1® & more."
]