[
    "Sunak to consult ethics adviser over Suella Braverman's speeding fine",
    "Russia warns NATO over F-16 jets - as Zelenskyy insists fight for Bakhmut continues | War latest",
    "Real Madrid star says Spain's top league 'belongs to the racists' after pointing out abusers",
    "Few things spark uproar like trophy hunting photos - now some want to change the narrative",
    "'Pig butchering' and other convincing new scams you should know about",
    "SpaceX launches second private flight - with a history-making passenger",
    "Facebook owner Meta expected to be hit with record privacy breach fine",
    "Monday's national newspaper front pages",
    "England captain says most sportswomen need back-up careers - as she trains to be accountant",
    "Next time you're at the zoo, apparently the elephants will be very happy to see you",
    "Football fans crushed in stadium stampede",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Anti-G7 protesters scuffle with police",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Biden's Ukraine jets pledge",
    "Russians 'destroyed everything' in Bakhmut",
    "'Do you have full confidence' in Home Sec?",
    "Are  F-16s a game changer for Ukraine?",
    "Minister 'pretty fed up' with water firms",
    "Ukraine war: Inside the battle for Bakhmut",
    "Man City win league without playing",
    "Spending accusations cast cloud over City's glory",
    "Testing how bad sheep burps are for the planet",
    "Angry passer-by throws protester to the ground",
    "Suspects try to ditch phones on roof",
    "Musk: 'One hell of a plasma beam!'",
    "G7 leaders plant trees in Hiroshima",
    "Arab League summit: Zelenskyy and Assad speak",
    "More than 1,000 air rage cases last year",
    "Mercenaries: 'Bakhmut is taken'",
    "'You made it': Sunak and Zelenskyy meet",
    "US Security briefing on F-16s to Ukraine",
    "Plane carrying Zelenskyy lands in Japan",
    "How did Royal couple's 'car chase' unfold?",
    "England renting shake-up explained",
    "Why is the prime minister flying to Japan?",
    "Phone hacking trial explained",
    "Is the Tory Party divided on immigration?",
    "What happened on Zelenskyy's visit?",
    "Damon Albarn: Brexit 'diminished value of arts'",
    "Bereaved mother: 'This violence has to stop'",
    "'iSpoof founder led extravagant lifestyle'",
    "'How do you feel when you lose?'",
    "China calls the G7 a 'clique'",
    "Sting: 'We can't be complacent' about AI",
    "'Will transgender criminal move prison?'",
    "Water UK chair 'sorry' for sewage in rivers",
    "Paparazzi 'aggressive' to Sussexes",
    "It's hard to envision Sunak removing Braverman and risking a showdown",
    "Keir Starmer's struggled for visionary policy - a distinct approach to the NHS could change that",
    "13 years of promises to cut immigration - here's how the Tories stack up",
    "How Manchester City became one of football's greatest teams",
    "From Johnny Depp's comeback to Indiana Jones - the biggest moments at Cannes Film Festival",
    "'There is nothing left': Zelenskyy says Bakhmut is destroyed - but denies Russians have control",
    "Father killed and two children injured after grenade exploded in home",
    "Ten in hospital after bus loses roof from hitting railway bridge",
    "This Morning presenters announced after Phillip Schofield exit",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "Flights to Sicily suspended as Mount Etna spews volcanic ash onto runway",
    "Pensioner arrested after elderly woman 'attacked'",
    "AI will get 'crazier and crazier' without controls, start-up founder warns",
    "Barking dogs alert owners as fire tears through house",
    "Minister 'pretty fed up' with sewage spills after water firms issued apology",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Global temperature 'will likely break key limit by 2027'",
    "Celtic rainforest to be revived in Snowdonia with 30,000 saplings a year",
    "Assad invited to COP28 climate summit",
    "COP28 climate summit offering multi-million pound sponsorship packages for exclusive access",
    "Canada wildfires force shutdown of oil and gas production",
    "Deadly Cyclone Mocha hits Bangladesh and Myanmar",
    "Electric vehicle transition 'cannot continue' without Treasury aid, logistics sector warns",
    "Heatwave rumours: What the weather is forecast to be this weekend and looking further ahead",
    "Trophy hunting: The row about conservation and colonialism",
    "Suella Braverman's speeding row, Therese Coffey and Andy Street",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Koepka holds off Hovland and Scheffler to win PGA thriller",
    "Vinicius says LaLiga 'belongs to racists' after crowd chants in Valencia",
    "Man City celebrate title with win over Chelsea before trophy lift",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "The Russians appear to have captured 'kill box' Bakhmut - is this a turning point in the war?"
]