[
    "Thousands of migrants travel to US border as Title 42 restrictions end",
    "What does the end of Title 42 mean?",
    "'He thinks he's untouchable' - Pakistan minister defends Imran Khan arrest",
    "Zelenskyy blocked from making address at Eurovision - as final qualifiers announced",
    "Rail passengers and Eurovision fans face significant disruption in fresh strikes",
    "Russia threatens 'military response' after UK gives long-range missiles to Ukraine",
    "Royal fan detained for 13 hours after 'wrongful arrest' at King's coronation",
    "Elon Musk appoints new Twitter chief executive - but is yet to officially announce her",
    "Starmer risks complacency by suggesting job all but done for Labour I Adam Boulton",
    "Friday's national newspaper front pages",
    "Who will win Eurovision and what songs should you look out for?",
    "America is a place where there's now an 'immunity to the unacceptable'",
    "Trump: 'The most dangerous man I've ever met'",
    "Trump attacks 'biased' judge and will appeal after jury finds he sexually abused writer",
    "Donald Trump's high stakes civil rape trial is adding to his legal baggage",
    "Sexual abuse finding will resonate through Donald Trump's campaign",
    "'I have no idea who she is'",
    "What other investigations is Donald Trump facing?",
    "Jurors begin deliberating in Trump civil trial in New York after rape claim",
    "Pakistan minister reacts to Khan arrest",
    "Kalush Orchestra on Eurovision 2023",
    "What are Storm Shadow missiles?",
    "Tornado-like cloud spotted in UK",
    "How rate rise will affect you",
    "Meet Ukraine's Eurovision contenders",
    "'Shock has reduced our national income'",
    "Firefighters battle wildfires in Russia",
    "William meets elderly royal super fan",
    "PM defends laws used to detain protesters",
    "Royal Family join Big Help Out",
    "Prince Louis joins Big Help Out in Slough",
    "William's tribute to King and late Queen",
    "'Did King request any songs?'",
    "'I'm going to sing my heart out'",
    "'Pressure is on' ahead of Coronation Concert",
    "'Cheers, William!' - Royals greet Windsor crowds",
    "Coronation celebrations continue",
    "Motorhome overturns on highway",
    "Dangerous driver runs red light",
    "Trump fans show their support",
    "Sir Karl Jenkins denies he was Meghan",
    "Rush to US border as law expires",
    "Luxury watch store robbed in daylight",
    "Storm Shadows already in Ukraine",
    "What is Ukraine's new counter-offensive?",
    "UK gives long-range missiles to Ukraine",
    "Wagner boss appears to insult Putin",
    "'West encouraging Russophobia'",
    "Russia holds 'scaled back' Victory Day parade",
    "Ukrainian PM on attack preparations",
    "Drones shot down over Kyiv",
    "Ukraine hit by wave of strikes",
    "Prince Harry's court case, explained",
    "Why the Pakistan unrest matters",
    "New protest laws explained",
    "'The reason I'm dressed like this...'",
    "'This is a big swing' to Labour",
    "Harry and Meghan’s royal relationship",
    "Cost of living pain still to come for millions despite Bank of England's rosier outlook",
    "UK sees giving Ukraine missiles which can punch through concrete as risk worth taking",
    "Race to US border: What does the end of Title 42 mean?",
    "Who is George Santos - the Republican congressman embroiled in controversy",
    "US veteran to face manslaughter charge over subway chokehold death of homeless man",
    "Most young women 'sexually harassed, bullied or abused at work'",
    "Largest cosmic explosion ever spotted by astronomers",
    "Jane Fonda reveals why she's in favour of the Hollywood writer's strike",
    "'My rock': Phillip Schofield praises Holly Willoughby after friendship strain rumours",
    "Funnel clouds spotted across UK as nation lashed by downpours",
    "Inflation to fall 'rapidly' - but worse interest rate pain yet to come, BoE governor warns",
    "New test made with AI could help doctors diagnose heart attacks faster",
    "One dead and five wounded in Israel as Gaza launches more than 600 rockets in 48 hours",
    "South Africa accused of providing arms to Russia",
    "'A bunch of horny teenagers': Warning as 18 stallions released in the New Forest",
    "'Devastating impact': Endangered bird of prey illegally killed on grouse moors, says RSPB",
    "King salmon fishing could be shut down in parts of Alaska",
    "UK at risk of falling behind in race to become green hydrogen global leader, leading firm says",
    "At least 129 dead due to torrential rainfall in Rwanda",
    "Climate protesters sing Spice Girls to disrupt bank meeting",
    "Could hot water pipes replace traditional gas boilers?",
    "'Flying thermometer' which could save you money pinpoints homes leaking most heat",
    "Heat networks: Is this how your home will get heated in the future?",
    "Bank Holiday mini-heatwave as temperatures set to soar to 21C",
    "Spain believed to have had hottest April day ever",
    "El Nino: What is it and how does it impact the weather closer to home?",
    "King breaks ground for net zero research lab in first official engagement since coronation",
    "East Africa drought would not have happened without humans, new science says",
    "This area of Spain could become too hot for tourists",
    "Public order laws: Are we losing the right to protest?",
    "Eurovision: The Ukrainians who fled to Liverpool",
    "Rachel McAdams, Patricia Arquette, Air and I Kissed a Boy",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Antonio gives West Ham ECL semi lead | Moyes: I was about to sub him!",
    "Smith shows his steel with Premier League Darts hat-trick in Sheffield",
    "Fernandes: Man Utd have to get CL | 'Soon we'll be fighting for bigger things'",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "Russia threat to UK after long-range missiles pledge to Ukraine | War latest",
    "Furious Speaker rebukes minister as Tory MPs line up to criticise EU law U-turn",
    "Trump's lies triggered shocking laughs as he turned TV scrutiny on its head",
    "Former Russian state TV journalist claims Putin 'doesn't have enough Novichok' to kill critics",
    "Imran Khan released from custody after arrest ruled illegal"
]