[
    "Admission should kill off career",
    "Holly Willoughby says co-host lied to her",
    "Johnson ally: 'The left got what they want' and need to 'leave Boris alone now' | Politics latest",
    "Luton player who collapsed on pitch gives update on condition",
    "Two million litres of water drained from reservoir in search for phone",
    "Ratcliffe remains lead bidder despite inconclusive Manchester United board meeting",
    "Just Stop Oil activists charged by police over Twickenham protest",
    "Man charged with murder of woman who died from 'multiple injuries'",
    "Plans for supermarket price cap on some foods",
    "The MPs who used expenses to pay for their driving fines",
    "Why Phillip Schofield's admission should kill off his career",
    "Phillip Schofield 'took us for fools', says ex-This Morning presenter",
    "Phillip Schofield admits affair with much younger man - and steps down from ITV",
    "Schofield's agent cites 'honesty and integrity' after dropping him - their statements in full",
    "'Explosive' volcanic activity continues",
    "'This is a pretty historic day for Turkey'",
    "How Sudan ended up in a humanitarian crisis",
    "'You've been pretty blunt on WhatsApp'",
    "Dogs defend owner against bear invasion",
    "Dermot O'Leary asked about Phillip Schofield",
    "Female gamers face hate 'all the time'",
    "Clashes with police in Kosovo",
    "Huge caterpillar cobweb in Shrewsbury",
    "Johnson refutes 'COVID rule breaches'",
    "'An incredible human' Mead on Wiegman",
    "Russia 'invading Belarus by stealth'",
    "Dnipro clinic destroyed in missile strike",
    "Zelenskyy's surprise graduation speech",
    "Drone appears to reach Russian intelligence ship",
    "Russian mercenary hands over US corpse",
    "Wagner 'withdrawing' from Bakhmut",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "Trans cycling rule change explained",
    "Migration: Breakdown of net figures",
    "The new energy price cap, explained",
    "Energy price cap reduction explained",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "World Cup 'too soon' for Lioness",
    "Hunt should be 'applauded'",
    "Hunt: Inflation fall not 'automatic'",
    "Ursula in The Little Mermaid 'based on Divine'",
    "'UK in race for green investment'",
    "Sunak now oversees a government unable to do anything new, complex or difficult",
    "The West will be disappointed with Erdogan's likely electoral success",
    "The 'black gold' that could help fight climate change for centuries to come",
    "Boris Johnson failed to answer key question after Sky News 'doorstep'",
    "'They set us on fire and took everything': Inside refugee camps as thousands flee Sudan",
    "Health secretary rules out new pay offer for nurses",
    "Body found in search for man missing for over two months",
    "Christian curriculum using textbooks that deny climate change and say evolution is impossible",
    "Joe Biden and House Speaker reach 'agreement in principle' on raising US debt ceiling",
    "The Papers: 'ITV to axe This Morning' and how $10bn Captagon trade impacting UK",
    "Turks head to the polls to decide if Erdogan takes rule into third decade",
    "Luton win promotion to Premier League for first time ever in dramatic play-off final",
    "Seven men charged over attempted murder of senior police detective",
    "Can desert algae farms undo some of our damage to the climate? This start-up thinks so",
    "'I always felt like the gym wasn't accessible' - The struggles blind people face to stay active",
    "Government accused of 'sabotage' over Scottish bottle return scheme",
    "Carbon dioxide is the big villain of global warming - so can we imprison it?",
    "The Climate Show with Tom Heap",
    "Killer whales deliberately hitting boats causing some to sink",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Inflation, debt, retail and AI",
    "Little Mermaid's Melissa McCarthy and Javier Bardem",
    "Braverman speeding row, plus Nigel Farage and Yvette Cooper on new net migration record",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Premier League final day: What's still left to play for?",
    "'Immense' Lockyer celebrates Luton promotion from hospital",
    "Billam-Smith stuns Okolie to win wild, three-knockdown world title fight",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "ITV News journalist Emily Morgan dies aged 45"
]