[
    "'Profoundly shocked': Girl, 8, dies after car crashes into school on last day of term",
    "Parents carry limping girl away from Wimbledon school crash scene",
    "Firm that owned submersible Titan suspends commercial operations",
    "Texas man who allegedly disappeared eight years ago was 'living with his mother the whole time'",
    "Man cuffs himself to Buckingham Palace and threatens self-harm",
    "Elle Edwards: Man, 23, guilty of murdering beautician in Christmas Eve shooting",
    "RMT to 'shut down' London Underground during strike action later this month",
    "What needs fixing in Threads – according to people who've just started using it",
    "Starmer hopes to bring state schools up to private standards in first term",
    "A severe money market shift signals worse to come for personal and public finances | Ed Conway",
    "Man guilty of beautician's murder",
    "Man handcuffs himself to Buckingham Palace gates",
    "'How will Labour level up schools?'",
    "Lukashenko: Putin 'won't whack' Prigozhin",
    "Swimmers flee water after shark spotted",
    "Wagner chief's home raided",
    "Gun found after police chase rapper",
    "'Tragic end of term for the girls'",
    "'It's not always about spending more money'",
    "Russian police raid Wagner leader's property",
    "Rabbit hunt: Police seek bunny burglar",
    "Protesters interrupt Starmer speech",
    "Rollercoaster riders trapped upside down",
    "Trapped cows rescued from barn fire",
    "Could AI replace news organisations?",
    "House collapses into China river",
    "Stolen car driven wrong way during chase",
    "Man rescued from train tracks in NY",
    "Aftermath of deadly missile strike",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "The state of the NHS explained",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "How does the NHS compare globally?",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "'Government will appeal Rwanda court decision'",
    "NHS in 'critical condition' at 75 years",
    "Michael Rosen: NHS model 'not wrong'",
    "'We're not being honest about healthcare'",
    "'How high will NHS waiting list go?'",
    "'You can bank at Natwest, Nigel'",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Video: Women at war in Mexico",
    "What we know about the teenager who was shot dead by police",
    "Inside his grand palace, Lukashenko speaks out on Putin, Prigozhin and the Wagner mutiny",
    "Wimbledon latest: Andy Murray in action",
    "'Absolutely shell-shocked' parents carry limping girl away from Wimbledon crash scene",
    "Sunak's costly COVID Inquiry challenge was doomed to failure - and has now been kicked into touch",
    "Government loses legal battle over Boris Johnson's COVID WhatsApp messages",
    "'Not for me': Banking regulator official says it is not for him to set savings rates",
    "NHS charity distances itself from The Captain Tom Foundation",
    "Funeral held for teens who died in crash that sparked riot",
    "Investigation launched after car firebombed outside prison",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Currys results, digital transformation and start-up struggles",
    "Could AI make this podcast?",
    "Top 1,000 World Banks ranking and Leicester City fined",
    "Wimbledon LIVE! Murray in action now after wins for Boulter & Broady",
    "Sizzling Wood shreds Australia after Marsh punishes costly drop",
    "Transfer Centre LIVE! Kane, Rice, De Gea latest",
    "A severe money market shift signals worse to come for personal and public finances",
    "Peaky Blinders makers 'strongly disapprove' of 'homophobic' video shared by DeSantis campaign"
]