[
    "'Willing to do what it takes': Chancellor not ruling out further energy support if bills soar",
    "Police photograph site in Portugal as new Madeleine McCann search to end today",
    "Tories 'betrayed' Brexit and should accept worker shortages to cut immigration - Farage",
    "Schools pay tribute to teenagers who died in Cardiff crash",
    "Mass brawl breaks out at airport baggage claim",
    "The tragic story of Tina Turner's sons",
    "Funeral of black RAF pilot who fought in Second World War attracts hundreds",
    "Three killed in shooting and knife attack by masked man",
    "Net migration rises to new record figure for a calendar year",
    "Big new net migration number is like adding a new city to the UK - but it's complicated",
    "'What is the point of her?'",
    "'Police Scotland is institutionally racist'",
    "Woman hoses down Just Stop Oil activists",
    "Ron DeSantis: Making America anti-woke",
    "Farage on Brexit: 'I was never dishonest'",
    "'We want to do everything we can'",
    "Charles and Camilla meet mini-mes",
    "Tina Turner 'a kind and gentle lady'",
    "McCann search enters third day",
    "Brawl at airport in Chicago",
    "NHS patients should get 'more options'",
    "Huge flames engulf Sydney building",
    "Wagner 'withdrawing' from Bakhmut",
    "Kayakers get shark surprise",
    "Trump reacts to DeSantis launch",
    "DeSantis launch plagued by glitches",
    "Ukrainians deny Russia has taken Bakhmut",
    "Smoke rises from Russian checkpoint",
    "Who is winning battle for Bakhmut?",
    "Mercenaries raise Russian flag in Bakhmut",
    "What's really happening in Bakhmut?",
    "Biden's Ukraine jets pledge",
    "Zelenskyy: 'Our people are in Bakhmut'",
    "Russians 'destroyed everything' in Bakhmut",
    "Mercenaries: 'Bakhmut is taken'",
    "Core inflation worries economists",
    "DeSantis enters presidential race",
    "Do we have an inflation problem?",
    "Cardiff riot: What happened?",
    "Phone-hacking trial: What we learnt today",
    "Why students are suing their universities",
    "IMF: Cost of living crisis to continue",
    "What is the Ministerial Code?",
    "Retracing Nikki Allan's last known steps",
    "McCann reservoir search explained",
    "Tina Turner shares secret of her success",
    "Turner 'massive loss to communities'",
    "People in Cardiff 'angry' at police",
    "How do people feel about immigration?",
    "'I've complained about Spotify'",
    "People smuggled into UK on worker visas",
    "'Everyone deserves help' when it comes to suicide",
    "'Woke warrior' DeSantis's campaign launch showed the topsy-turvy madness of American politics",
    "Why high energy prices are the new normal - despite price cap drop",
    "What is the energy price cap – and how will it affect my bills?",
    "Why Sean Dyche could be the most effective manager in Premier League history",
    "From the Super Bowl to Live Aid - Tina Turner's best performances in pictures",
    "Just Stop Oil protesters throw paint over Chelsea Flower Show garden",
    "Killer whales deliberately hitting boats causing some to sink",
    "Water company to pay over a million customers £10 each",
    "Police Scotland is 'institutionally racist and discriminatory', chief constable admits",
    "Summer 'travel chaos' warning as airport workers back strike action in pay row",
    "William Wallace's sword back where it belongs after casing smashed during climate protest",
    "'Anger and frustration' from Tory MPs after calendar year migration record broken",
    "Lucy Letby's Facebook messages shown in court - as lawyer says she 'cooked the records'",
    "Chris Packham wins libel battle over 'tiger fraud' allegations",
    "France bans short-haul flights",
    "£1.8bn aid package announced for flood-hit areas in northern Italy",
    "Increased profit and shareholder payments at water company amid sewage discharges",
    "Shell boss shielded by security as protesters disrupt AGM",
    "Flying debris hits cars in Guam typhoon",
    "Rolls-Royce jettisons carbon capture plan as new boss clips wings",
    "UK to be hotter than Malaga this week",
    "The honeybee population may have been saved - but now there is a sting in the tail",
    "Italian PM visits flood stricken areas after 36,000 evacuated",
    "'Keep bowel motions out of our oceans': Campaigners stage mass 'paddle out' protest",
    "Man shoves Just Stop Oil activist to the ground during slow march protest",
    "Water firms apologise for sewage discharges and vow to spend £10bn cleaning up their act",
    "Migration, energy and AI in the workplace",
    "Migration, Energy and AI in the workplace",
    "Ron DeSantis: The Republican rival who could trump Trump",
    "COVID may no longer be a global health emergency, but virus hasn't disappeared to the background",
    "COVID 'no longer a global health emergency'",
    "The NHS COVID app is closing down - but is the pandemic really over?",
    "More teenagers unprotected from serious diseases as vaccine uptake falls",
    "'Healthy' doctor, 32, died after 'rare' severe reaction to AstraZeneca COVID jab",
    "Hope for long COVID treatment breakthrough after study's 'really positive' findings",
    "COVID no longer a leading cause of death in England and Wales",
    "Children under five in Britain to receive COVID vaccine for first time",
    "Millions to be offered COVID booster vaccine",
    "Routine COVID testing for symptomatic care home residents in England to end",
    "Ultra-thin sensor 'can detect COVID and flu within 10 seconds'",
    "Vallance takes aim at Johnson as he says COVID rules were 'for everybody'",
    "COVID-19 vaccines do not affect a woman's menstrual cycle, study finds",
    "COVID infections in England at highest level since start of year",
    "Biden vows to 'declassify' information about COVID's origins",
    "Kane is Man Utd's No 1 target | Club also want Rice and Mount",
    "Ferrari boss: No offer for Hamilton but every team would want him",
    "Mercedes unveil new-look sidepods as W14 upgrades are revealed",
    "8 dedicated sports channels, including Premier League, F1® & more.",
    "'Queen of Rock 'n' Roll' Tina Turner dies"
]