[
    "Can AI do my job? After a shock call from my boss, I went to find out",
    "Wigs, guns and gold bars found in Russian raid of palace abandoned by Wagner boss",
    "Meta's Twitter rival attracts 10 million users in first few hours - here's how it works",
    "£130m worth of cannabis, £636,000 in cash and 20 guns seized in UK-wide crackdown",
    "Greta Thunberg could face prison after charge of disobeying police order",
    "Disney star and pop singer dies aged 48",
    "Jigsaw puzzles not being sold at Wimbledon as tournament plays catch up after protests",
    "Degenerative brain disease CTE found in female athlete for first time",
    "What Britons really think about the NHS as UK falls behind other countries",
    "Barclay denies cuts are to blame as he points to three reasons NHS is struggling",
    "NHS honoured at Westminster Abbey",
    "NHS in 'critical condition' at 75 years",
    "First NHS baby says service is 'creaking at the seams'",
    "NHS at 75: Who was founder Aneurin 'Nye' Bevan?",
    "Is life expectancy in your local area higher or lower than average?",
    "NHS at 75: What’s the story for maternity services?",
    "How does the NHS compare globally?",
    "'Government will appeal Rwanda court decision'",
    "Trapped cows rescued from barn fire",
    "Russian jets 'harass' US drones",
    "Aftermath of deadly missile strike",
    "Could AI replace news organisations?",
    "Sky News trials an AI reporter",
    "Israel’s biggest attack on the West Bank in 20 years",
    "'We're not being honest about healthcare'",
    "The state of the NHS explained",
    "House collapses into China river",
    "Stolen car driven wrong way during chase",
    "Man rescued from train tracks in NY",
    "Woman rescued from burning car",
    "King receives Scotland's crown jewels",
    "Protesters drown out national anthem",
    "Counterfeit goods worth record £87m seized",
    "What happened in Zaporizhzhia?",
    "Drone footage of Ukrainian strike",
    "'Only source of danger is Russia'",
    "Russian counter-blow 'ready to go'",
    "How close is Ukraine to a nuclear disaster?",
    "Ukrainian rebuilds home with war debris",
    "'We are preparing for a nuclear explosion'",
    "Russia to increase military salaries by 10.5%",
    "Israel's two-day operation in Jenin",
    "Is your euro holiday in drought area?",
    "Ukraine: When might the war end?",
    "AI, puffins and conservation explained",
    "NHS workforce plan explained",
    "Is the government delivering on climate plans?",
    "Michael Rosen: NHS model 'not wrong'",
    "'How high will NHS waiting list go?'",
    "'You can bank at Natwest, Nigel'",
    "Health secretary: 'The NHS needs to evolve'",
    "75-year-old man rescued after almost a week",
    "Murray 'looking good' for Wimbledon",
    "Why Russia's statements about Ukrainian nuclear plant are deeply worrying",
    "Key questions to the PM were cut short - but that didn't stop Sunak getting skewered",
    "Video: Women at war in Mexico",
    "What we know about the teenager who was shot dead by police",
    "How the junior doctors' strike will affect the NHS and what to do if you need care",
    "Police officer who led Manchester Arena attack response could face criminal charges",
    "Starmer pledges speaking lessons for children as he promises education overhaul",
    "More than a quarter of UK adults have never boiled an egg, survey finds",
    "Toddler among 29 people killed in bus crash",
    "Thursday's national newspaper front pages",
    "At least 16 die in suspected gas leak in South Africa",
    "Man who carved names into Colosseum says he 'didn't know it was old'",
    "How cancer patients receive the most modern care in buildings that are 'not fit for purpose'",
    "'Shock to the system': British number one speaks out after protesters halt Wimbledon play",
    "'Not my king': Four arrested as Charles presented with Scotland's crown jewels",
    "Leaked memo suggests £11.6bn climate pledge to be dropped - but government issues denial",
    "Extinction Rebellion activists block holes on 10 golf courses",
    "Europe is facing drought with more groundwater being lost than replaced by rain",
    "New record set for world's hottest day",
    "Seabirds facing new threat from 'swirling collections of plastic' in feeding grounds",
    "Hottest June ever in UK, Met Office says - but announcement 'invokes something sinister'",
    "New octopus species discovered",
    "Airbus and Tata Steel back push to spark green hydrogen strategy",
    "How AI is acting as nature's defender on an island hosting thousands of puffins",
    "'Incredibly selfish behaviour': Human faeces discovered in UK river",
    "Why is AI keeping an eye on puffins? And reaction to Zac Goldsmith resignation",
    "What does a water cremation involve – and when will they be available in the UK?",
    "Does Lord Goldsmith have a point when he says Sunak is 'uninterested' in environment?",
    "Could AI make this podcast?",
    "Top 1,000 World Banks ranking and Leicester City fined",
    "Stokes backs 'superstar' Bairstow to fire after stumping row",
    "Knight soaks up Oval atmosphere | 'Crowds are 12th person for England'",
    "Ben Sulayem: FIA won't stop 'good kid' Red Bull's dominance",
    "Chesney Hawkes and wife sent tearful voice notes to children as plane plunged 20,000ft"
]