[
    "'Combat measures' in city 300 miles from Moscow; Putin calls rebellion 'treason' | Mutiny latest",
    "Vladimir Putin calls Wagner rebellion 'armed mutiny' and 'stab in the back'",
    "Dangerous Wagner mercenary boss was disaster waiting to happen for Putin",
    "Who is Yevgeny Prigozhin and what is the threat posed by him?",
    "US Coast Guard to lead Titan sub investigation following five-day search 'costing millions'",
    "Foo Fighters will be a hard act to beat after their unexpected Glastonbury performance",
    "'My baby lived for just 93 minutes': The reality of life under the new US abortion laws",
    "Water company boss blames people working from home for hosepipe ban",
    "University friends pay tribute to 'generous and kind person' killed in Titan sub implosion",
    "Saturday's national newspaper front pages",
    "Navy captain reveals what could have caused sub to implode",
    "US Navy detected likely 'catastrophic implosion' of Titan sub soon after it went missing",
    "Titanic director says he 'knew submersible was destroyed' four days before debris found",
    "The tragedy of the Titan submersible and the dangers of diving down to the Titanic",
    "Student, 19, killed in submersible was 'terrified' before trip but went as a Father's Day present",
    "What happened to the Titan sub",
    "Family of British billionaire Hamish Harding pay tribute following implosion of missing sub",
    "'Father Neptune has no patience for humanity': Expert's warning about Titan in 2018 was ignored",
    "What it's like being in a fully-certified submersible - and how it differs from missing Titan",
    "2018: OceanGate CEO christens Titan sub",
    "'Landing frame and rear cover' found at debris field in hunt for missing sub",
    "Marine traffic shows all Titan search vessels now in place - as submersible robot joins hunt",
    "WhatsApp message reveals debris find",
    "Fate of missing Titan submersible's passengers may rest on one man",
    "Putin accuses Prigozhin of treason",
    "Wagner armed troops near Russian military HQ",
    "Russian general: 'Obey Putin and return to bases'",
    "How Prigozhin's rebellion could impact Putin",
    "Putin and Prigozhin's relationship explained",
    "Wagner 'controls' Russian military HQ in city",
    "Roe v Wade: US abortion rights a year on",
    "What are the pros and cons of electric cars?",
    "US senator confronted on abortion rights",
    "Titan victim's stepson 'living a nightmare'",
    "Titan sub victim seen in footage",
    "ROV in sub debris search pictured",
    "Two sub victims voiced 'concerns'",
    "Killed CEO: 'I broke rules to make this'",
    "Has OceanGate followed protocols?",
    "Teen on Titan 'had a sense this was not okay'",
    "Missing sub: US Navy reveal new details",
    "Cousin: 'Hamish died doing something he loved'",
    "Killed CEO was 'committed to safety'",
    "Life after Nova Kakhovka Dam breach",
    "Counteroffensive will be 'slow'",
    "Footage shows Bakhmut devastation",
    "Putin: West wants 'fight with Russia'",
    "Before and after: Ukraine reservoir dries up",
    "Ukraine war: Aftermath of Russian missile",
    "'Protect Ukraine, protect freedom'",
    "Sewage tsunami floods Kherson",
    "Saudi Arabia 'sportswashing' claims explained",
    "Sub search reaches critical point",
    "What is a resignation honours list?",
    "Elton John 'anxious' ahead of Glastonbury",
    "'These people are all so intimidating'",
    "Sir Elton 'not chilling out' after farewell tour",
    "Rick Astley on being 'Glastonbury virgin'",
    "Prigozhin's rebellion triggers Putin's most serious domestic crisis",
    "Chancellor's mortgage plan might mitigate against chaos - but it will not prevent the pain",
    "The descendants of the Windrush generation who changed Britain",
    "From Ozempic to Wegovy, the weight loss injections taking TikTok by storm",
    "Because they're worth it: How salon tents take Glastonbury from grime to glam",
    "Fears graduates may never get degree grades amid university marking boycott",
    "It was once Europe's second biggest reservoir - now it's nearly empty after 'barbaric act'",
    "Backstage With… The stars of Wes Anderson's celebrity packed Asteroid City",
    "'No direct evidence' COVID started in Wuhan lab - US intelligence",
    "Tropical storms form amid forecast of heavy rain and winds in Caribbean",
    "Hottest parts of UK revealed in weekend forecast as country set to meet 'heatwave criteria'",
    "Mortgage holders to get 12-month grace period before repossessions amid interest rate hike",
    "Government plans to house migrants in marquees across country",
    "Heatwaves in Europe 'could lead to more mosquito-borne infections and deaths'",
    "Electric cars: Why aren't more people buying them?",
    "The Paris climate summit was an important moment - but the wait goes on for concrete decisions",
    "London summers 'will be as hot as Nice by 2070' if carbon emissions keep rising, Met Office warns",
    "London-listed SPAC New Energy One in talks about Eni North Sea merger",
    "Goal to decarbonise power system 'jeopardised by lack of plan'",
    "Record-breaking temperatures observed in seas around UK and Ireland",
    "Swiss voters back ambitious plans to save melting glaciers",
    "The legal test case that could threaten new oil and gas extraction in Britain",
    "Foot scans, a gaming engine, and 'Tesla-like' factories - is this really the future of shoes?",
    "Calls for glass to be excluded from deposit return scheme",
    "Parts of the UK could see half a month's worth of rain fall for remainder of day",
    "Hottest ever start to June as global temperatures spike",
    "National Grid to keep blackout prevention scheme for coming winter",
    "Mortgages, interest rates and women in business",
    "Tom Cruise, Scarlett Johansson, Maya Hawke and Jennifer Lawrence",
    "Beaumont looks to add to ton as England resume on 218-2 LIVE!",
    "Chelsea reject Man Utd's third bid of £55m for Mount",
    "'Ashes cricket is about winning, not just the spectacle'",
    "Upgrade to Sky Sports Cricket to watch the Ashes & more. Just £15 extra a month. Cancel anytime."
]