[
    "Live. US PGA Championship first round - McIlroy & Rahm among early starters",
    "Live. Premier League news conferences & Man City reaction",
    "'Moment of greatness from perfectionist Guardiola'",
    "Frost delays start of US PGA Championship - tee-times for R1",
    "Semi-final win banishes last year's 'pain' - Guardiola",
    "Butler shines as Heat win opener against Celtics",
    "'That's it, boys. I'm off' - Gower's 'nightmare' Ashes",
    "Live. County Championship, day one - live text",
    "What are the key US PGA Championship talking points?",
    "Toney banned for eight months over betting",
    "Kyrgios foot injury behind French Open absence - agent",
    "Swiatek awaits update after retiring in Rome",
    "Emilia Romagna GP called off after flooding",
    "Bairstow has 'huge sympathy' for dropped Foakes",
    "Mentor to retire from England duty after 22 years",
    "Fitzpatrick relishing US PGA's 'brute of a course'",
    "Coventry beat Boro to set up play-off final with Luton",
    "McLaren calls for sustainability changes in F1",
    "Djokovic loses in Rome quarter-finals",
    "'Two undefeated champions, two undisputed champions - it doesn't get bigger'",
    "England flanker Ben Curry set to miss World Cup",
    "Chelsea captain Eriksson to leave club in summer",
    "Milner & Firmino among four set to leave Liverpool",
    "Britain's Geoghegan Hart fractures hip in Giro crash",
    "Arsenal prepare £92m Rice bid - Thursday's gossip",
    "'No-one will want to marry you if you're out boxing'",
    "Two mass brawls and four red cards in chaotic final",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "'Wear the right sports bra and you will be in a much better place'",
    "Can you name these Ashes cricketers?",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "From the Ashes podcast: David Gower. AudioFrom the Ashes podcast: David Gower",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Leicester and SA number eight Wiese wins RPA award",
    "South Africa, Fiji, Qatar express World Cup interest",
    "Keita to leave Liverpool at the end of the season",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]