[
    "Where next for Spurs after Slot shuns manager role?",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Roy set to end England deal to play in US",
    "La Liga could reduce racism in six months - Tebas",
    "Chelsea struggles a warning sign, says Ten Hag",
    "Djokovic & Alcaraz could meet in French Open semis",
    "'From wrestling Swann to tears in Melbourne'",
    "'Three world titles in one night a disaster for boxing'",
    "Iniesta to leave Vissel Kobe but vows to play on",
    "Russian Sizikova cleared of match-fixing - lawyer",
    "Real players & fans show support for Vinicius Jr",
    "GB's Norrie reaches Lyon Open semis but Draper out",
    "Mpanzu's remarkable journey to brink of Premier League",
    "Florida Panthers reach Stanley Cup Finals",
    "Man Utd lead race for £55m Mount - Thursday's gossip",
    "Wood turns Lara sombrero into rematch motivator",
    "Inter beat Fiorentina to win Coppa Italia",
    "Mumbai thrash Lucknow by 81 runs in IPL Eliminator",
    "Van Nistelrooy leaves PSV with immediate effect",
    "Dainese wins stage 17 sprint as Thomas retains lead",
    "Alba and Barcelona agree to terminate contract",
    "Kavanagh added to September Bellator Dublin card",
    "Lancashire bowl out Leics for 99 in T20 Blast win",
    "Mercedes upgrade will not be a 'silver bullet' - Wolff",
    "Is India batter Gill cricket's next big thing?",
    "Is it time for French Open to use electronic line calls?",
    "Meet the NFL prospect that has Umenyiora 'afraid'",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "Can you name these Ashes cricketers?",
    "Why one French Open match will get extra scrutiny each day",
    "Hooked on risk - gambling's grip on elite sport",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Mixed martial arts gave me a 'purpose' - Ikeme",
    "URC pondering draft system to help weaker teams",
    "'Desperation' to 'best thing' - Kenya's female caddy",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]