[
    "Live. Champions League semi-final: Build-up as Man City host Real Madrid",
    "Toney banned for eight months over betting",
    "Emilia Romagna GP called off after flooding",
    "Milner & Firmino among four set to leave Liverpool",
    "Djokovic loses in Rome quarter-finals",
    "Britain's Geoghegan Hart crashes out of Giro",
    "Live. WSL: Everton 0-0 Arsenal - first of two crucial games at top",
    "What are the key US PGA Championship talking points?",
    "Bairstow has 'huge sympathy' for dropped Foakes",
    "Italy and Juve captain Bonucci to retire next year",
    "'No-one will want to marry you if you're out boxing'",
    "Two mass brawls and four red cards in chaotic final",
    "'De Bruyne still needs his defining moment'",
    "Fiji, Qatar & South Africa express World Cup interest",
    "'I want to avoid Real' - can 'underdogs' Inter complete 'miracle'?",
    "Morant takes 'full accountability' over gun video",
    "Rugby player in Australia given 96-week ban",
    "My legacy is exceptional already, says Guardiola",
    "What is going on with the Man Utd sale?",
    "'I don't care' - Crawley dismisses selection debate",
    "Aubameyang announces Gabon retirement U-turn",
    "Who will triumph in the WSL title race?",
    "'Wear the right sports bra and you will be in a much better place'",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "Jokic stars as Nuggets beat Lakers",
    "Who will survive Premier League relegation?",
    "Can you name these Ashes cricketers?",
    "'Archer's latest injury is the cruellest of blows'",
    "US PGA Championship tee-times for first two rounds",
    "How The Rock is helping others live his NFL dream",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "All about the PGA Championship 2023. AudioAll about the PGA Championship 2023",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Keita to leave Liverpool at the end of the season",
    "Smart ball tech to trial at U20 World Cup in SA",
    "Kaizer Chiefs coach cut by shield in fan trouble",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]