[
    "'If backed, Mourinho is the manager for PSG'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Roma earn advantage over Bayer Leverkusen",
    "Gatti's late goal leaves Juventus-Sevilla level",
    "DP World Tour hits LIV players with fines and bans",
    "West Ham earn slender semi-final lead over AZ",
    "Sabalenka & Pegula suffer early exits in Rome",
    "I lost seven years to drink and drugs - O'Sullivan",
    "Madrid Open sorry for 'unacceptable' speech decision",
    "Pedersen claims dramatic Giro d'Italia stage-six win",
    "Team parts with director over transgender views",
    "How Elliott scored Ashes century while breastfeeding at lunch and tea",
    "Man Utd fear missing out on Kane - Friday's gossip",
    "How does English rugby exit 'survival mode'?",
    "Golden State keep Conference Finals hopes alive",
    "'This is going to be even better than the Serrano fight'",
    "Edwards weighs in for world-title eliminator",
    "Fear of relegation should motivate Leeds - Allardyce",
    "Johnston airlifted to hospital after NW200 crash",
    "How green are Premier League clubs in 2023?",
    "Lawrence named Premiership player of season",
    "The ultra test in the Welsh mountains",
    "Man Utd captain Zelem's 'rollercoaster' ride to FA Cup final",
    "Murray's clay revival halted by Fognini in Rome",
    "Celtic win to close in on leaders Glasgow City",
    "Follow the unwritten rule - fantasy football tips",
    "How a 'desperation measure' transformed Sevilla",
    "'Worse than AC Milan's wildest dreams' but 'big regrets' for Inter",
    "Barcelona's iconic 2011 team - where are they now?",
    "The Moneyball team threatening West Ham's Euro dream",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "Klopp and Ten Hag time-waste too - Allardyce. VideoKlopp and Ten Hag time-waste too - Allardyce",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'I was scared to lose my life' - football in Sudan",
    "Benrahma penalty helps West Ham take slender lead",
    "Netballer whose family felt Cyclone Freddy's force",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]