[
    "Live. Premier League: Foxes in front, Leeds & Everton down as it stands",
    "Verstappen beats Alonso to win rain-affected Monaco GP",
    "Kostyuk booed after avoiding Sabalenka handshake",
    "Live. Scottish Premiership: United relegation confirmed; County in play-off",
    "Celtics beat Heat in thriller to set up decider",
    "Dundee United down after defeat at Motherwell",
    "Tsitsipas makes winning start at French Open",
    "PSG keeper Rico in intensive care after riding accident",
    "'Deja vu' as Muchova upsets eighth seed Sakkari",
    "Carlisle promoted with shootout win over Stockport",
    "Kilmarnock secure safety & condemn County to play-off",
    "How French Open is using AI to protect players online",
    "Ex-St Helens coach Anderson paralysed in accident",
    "Luton's throwback stadium set to host Premier League football",
    "Antony 'probably will' be fit for FA Cup final",
    "Live. Listen: T20 Blast - Somerset v Glamorgan after wins for Durham & Sussex",
    "Folau booed as Jones' Barbarians beat World XV",
    "'Historic title but the end for PSG boss & stars'",
    "Tahiyra storms to victory in Irish 1,000 Guineas",
    "Celtic beat Rangers to claim Women's Scottish Cup",
    "Live. Chennai Super Kings v Gujarat Titans - IPL final scorecard",
    "GB's Johnson-Thompson second in heptathlon return",
    "GB's Evans 'thrown' after unusual French Open penalty",
    "Wantaway Dupree helps Salford beat Hull FC",
    "Nadal's successor? A new 'big three'? A very open Roland Garros",
    "The English clubs to have done the 'three-peat'",
    "Sutton's Premier League final-day predictions v The National drummer Bryan Devendorf",
    "Isle of Man TT - Six big talking points for 2023",
    "The secrets of Chelsea's success under Hayes",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "Can Everton ever be great again? VideoCan Everton ever be great again?",
    "Johnson & Naismith react in touchline bust-up. VideoJohnson & Naismith react in touchline bust-up",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Salah 'devastated' to miss out on Champions League",
    "Mpanzu's remarkable journey to Premier League",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]