[
    "Live. England remove Warner as nervy first Ashes Test takes another twist",
    "PSG close to appointing ex-Spain boss Luis Enrique",
    "Dutch striker Promes jailed for stabbing cousin",
    "Bournemouth name Iraola as boss after sacking O’Neil",
    "'Ifs, buts & fine margins' - McIlroy's familiar tale of woe",
    "Verstappen 'in the same sentence as the greats'",
    "Norrie marks British grass-court return with win",
    "An overachiever who grew up with Arteta - who is Iraola?",
    "Rodgers returns as Celtic boss on three-year deal",
    "Real Madrid sign ex-Stoke striker Joselu on loan",
    "'I'd go through 100 Sundays like this to win major'",
    "Live. England v Australia - first Test scorecard",
    "Robinson 'does not care' about Khawaja celebration",
    "What is the best moment of the Women's Ashes?",
    "'The 20 minutes when the real Australia turned up'",
    "Doubts over Treble frustrating - Man City chairman",
    "Ireland suffer blow with five-wicket defeat by Oman",
    "Arsenal willing to sell Partey - Monday's gossip",
    "Hassell-Collins dropped from England training squad",
    "Evening Community Shield 'will lead to empty seats'",
    "New research aims to reduce horse racing injuries",
    "Can North Macedonia do it again? Rank these international shocks",
    "'Magic Haaland upstaged by Scotland's act of escapology'",
    "'Winning gold makes the difficult times worthwhile' - Sawyers column",
    "Maguire wins second LPGA Tour title in Michigan",
    "Ferrari 'making our life way too difficult' - Leclerc",
    "'Shock but no surprise as cycling looks for answers'",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sportshour podcast: The clashes for the Ashes. AudioSportshour podcast: The clashes for the Ashes",
    "Football Daily: England cruise past Malta. AudioFootball Daily: England cruise past Malta",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Osimhen scores twice as Nigeria qualify for Afcon",
    "Zimbabwe ready to shake off global 'bad press'",
    "SA20 boosted economies and 'exceeded expectations'",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]