[
    "Chelsea agree terms with ex-Spurs boss Pochettino",
    "Chelsea are in turmoil - why has Pochettino chosen them?",
    "Messi booed by PSG fans in win against Ajaccio",
    "Liverpool to bid £70m for Mac Allister - Sunday's gossip",
    "Much-changed Madrid prepare for Man City with win",
    "Alimkhanuly defends title & calls out Alvarez",
    "Suns fire 2022 NBA Coach of the Year Williams",
    "Spezia dent AC Milan's Champions League hopes",
    "Bayern put six past Schalke to move closer to title",
    "'Huge talent' Garnacho can play key role in run-in",
    "How The Rock is helping others live his NFL dream",
    "Can you name all Chelsea's Premier League managers?",
    "Healy's stunning solo break wins Giro stage eight",
    "Man Utd 'rebels' face serial winners Chelsea in final",
    "Live. County Championship, day four - text",
    "Saracens crush Saints in Premiership semi-final",
    "Evans out of Italian Open in near four-hour marathon",
    "Rangers turn tables to bring calm instead of chaos",
    "'This is a bad time' - why Southampton were relegated",
    "Villa beat Spurs to strengthen European hopes",
    "'We have two cup finals' - two-goal Awoniyi on Forest's task",
    "James leads Lakers to win that eliminates Warriors",
    "'Mesmerising' Eze earns Palace win over Bournemouth",
    "Military Orders wins Lingfield Derby trial",
    "Roby celebrates landmark as Saints stun Salford",
    "Griner plays for first time since release by Russia",
    "Your stories of football academy rejection",
    "Edwards brothers aiming for MMA 'legend' status",
    "Sutton's Premier League predictions v Def Leppard's Joe Elliott",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "NFL's Commanders agree record £4.8bn sale",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "We may not have Rice next season - Moyes. VideoWe may not have Rice next season - Moyes",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Scrum V podcast: At home with Dan Biggar. AudioScrum V podcast: At home with Dan Biggar",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "The Africans who have scored success in Italy",
    "En-Nesyri opener cancelled out by late Gatti goal",
    "Benrahma penalty helps West Ham take slender lead",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]