[
    "Live. Champions League build-up - will Man City reach the final?",
    "'I want to avoid Real' - can 'underdogs' Inter complete 'miracle'?",
    "'De Bruyne still needs his defining moment'",
    "Qatari banker Sheikh Jassim makes improved Man Utd bid",
    "Jokic stars as Nuggets beat Lakers",
    "Djokovic criticises Norrie after body hit",
    "The woman who blazed the way for Taylor",
    "My legacy is exceptional already, says Guardiola",
    "Morant takes 'full accountability' over gun video",
    "Two mass brawls and four red cards in chaotic final",
    "Can you name these Ashes cricketers?",
    "'I don't care' - Crawley dismisses selection debate",
    "'Wear the right sports bra and you will be in a much better place'",
    "Who will triumph in the WSL title race?",
    "Imola flooding concerns before grand prix",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "Cort wins Giro stage 10 as Thomas maintains lead",
    "Swiatek continues dominant streak in Rome",
    "Who will survive Premier League relegation?",
    "Masters 'wake-up call' helping McIlroy's PGA tilt",
    "Kane representatives meet PSG - Wednesday's gossip",
    "Arsenal forward Balogun switches to USA from England",
    "'Remarkable' for Luton to reach play-off final - Pleat",
    "'Obsessed' Parisse wants to go out on a high",
    "Cooper & Kerevi to play for Barbarians v World XV",
    "Who is 'never flustered'? Garth's Team of the Week",
    "The remarkable reinvention of India legend Dhoni at 41",
    "US PGA Championship tee-times for first two rounds",
    "'There was a point I hated everything about football'",
    "How The Rock is helping others live his NFL dream",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "All about the PGA Championship 2023. AudioAll about the PGA Championship 2023",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Once banned, boxing now thrives in this former warzone",
    "Onana clean sheet sees Inter to European showpiece",
    "Women's football 'best opportunity' for Tanzania",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]