[
    "Premier League: Man Utd qualify for Champions League after thrashing Chelsea",
    "Man Utd secure Champions League spot with Chelsea win",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Hamilton and Mercedes close to agreeing new deal",
    "Where next for Spurs after Slot shuns manager role?",
    "Roy ends England deal to play in US",
    "La Liga could reduce racism in six months - Tebas",
    "Djokovic & Alcaraz could meet in French Open semis",
    "Crowds hold no extra Ashes pressure - Sciver-Brunt",
    "Jacobs to miss 100m showdown with Kerly in Rabat",
    "'From wrestling Swann to tears in Melbourne'",
    "'Three world titles in one night a disaster for boxing'",
    "Thomas extends Giro lead as Zana wins stage 18",
    "Crawford and Spence to fight for undisputed title",
    "Iniesta to leave Vissel Kobe but vows to play on",
    "Spurs only club I have no connection with - Mourinho",
    "Russian Sizikova cleared of match-fixing - lawyer",
    "Alonso targets ‘one-off opportunity’ for Monaco win",
    "Collingwood, captained by England's Mentor, to quit top Australian league",
    "GB's Norrie reaches Lyon Open semis but Draper out",
    "Kavanagh added to September Bellator Dublin card",
    "Briton Smith to fight Beterbiev for belts in Canada",
    "Mpanzu's remarkable journey to brink of Premier League",
    "Wood turns Lara sombrero into rematch motivator",
    "Florida Panthers reach Stanley Cup Finals",
    "Is India batter Gill cricket's next big thing?",
    "Is it time for French Open to use electronic line calls?",
    "Meet the NFL prospect that has Umenyiora 'afraid'",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "Can you name these Ashes cricketers?",
    "Hooked on risk - gambling's grip on elite sport",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "My snoring cost Arteta his sleep - Reina. VideoMy snoring cost Arteta his sleep - Reina",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Mixed martial arts gave me a 'purpose' - Ikeme",
    "URC pondering draft system to help weaker teams",
    "'Desperation' to 'best thing' - Kenya's female caddy",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]