[
    "Live. Premier League: Champions Man City 1-0 Chelsea - Alvarez gives champions lead",
    "Live. WSL: Leicester 0-2 West Ham - win for hosts would relegate Reading",
    "Leeds rooted in relegation zone after defeat at West Ham",
    "Green ton helps Mumbai move into IPL play-off spots",
    "Murray withdraws from French Open",
    "At least twelve killed in El Salvador stadium crush",
    "Ferguson hits double as Brighton seal European spot",
    "Live. County Championship, day four - Essex set Notts 219 to win, radio & text",
    "O'Gara targets Ireland job after La Rochelle triumph",
    "Haney beats Lomachenko to retain world titles",
    "Koepka leads US PGA with Rose & McIlroy in touch",
    "Ten moments that defined Premier League title race",
    "Murray puts Nuggets on brink of NBA finals",
    "From snubbed to main spotlight - Cameron emerges as pound-for-pound contender",
    "Farah eighth in penultimate race of career",
    "The man with a blue cap and golden touch - Tipuric",
    "Rangers win delivers Hibs third-place blow",
    "It's a really sad day for Arsenal - Arteta. VideoIt's a really sad day for Arsenal - Arteta",
    "Who will step up to challenge Man City?",
    "Chelsea close in on WSL title with win over Arsenal",
    "Charles-Barclay second in Ironman after visa issue",
    "Tottenham resume talks with Nagelsmann - Sunday's gossip",
    "Bayern's title hopes dealt major blow by Leipzig",
    "Casemiro stunner leaves Man Utd on brink of top four",
    "Rybakina wins Italian Open as Kalinina retires",
    "'Massive decisions to make' - will Kane stay at 'shambolic' Spurs?",
    "'A season I will never forget' - Man City win third title in a row",
    "Firmino's Liverpool farewell will see Reds 'rebuild'",
    "'Devastated' Leinster's drive for five goes on",
    "Why Nadal's French Open absence is hard to imagine",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "Casemiro keeps surprising us - Ten Hag. VideoCasemiro keeps surprising us - Ten Hag",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "5 Live Boxing: Taylor v Cameron - The debrief. Audio5 Live Boxing: Taylor v Cameron - The debrief",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Basketball fan shot dead at Libyan top-flight match",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]