[
    "Champions League was only a dream - Howe",
    "Hooked on risk - gambling's grip on elite sport",
    "'Koepka's PGA win raises awkward Ryder Cup questions'",
    "‘Anxiety everywhere' - Leicester need ‘mad final day’",
    "Tebas comments make my blood boil - Richards",
    "Woods misses US Open to continue recovery",
    "Anthony retires after 20-year NBA career",
    "Who is like prime Hoddle? Garth's Team of the Week",
    "Juve docked 10 points over transfer dealings",
    "Cavendish to retire at end of season",
    "Club pro Block steals show at US PGA Championship",
    "Newcastle in Champions League after 20-year wait with Leicester draw",
    "Bayern to rival Arsenal for Rice - Tuesday's gossip",
    "Liverpool query Villa decisions with refs' body PGMOL",
    "Real report Vinicius Jr racist abuse as hate crime",
    "What next for Wales after Jones and Tipuric retirements?",
    "Everton reach exclusivity agreement with MSP over investment",
    "Quiz! Name Newcastle's last Champions League side",
    "Guardiola 'the difference maker' as City eye Treble",
    "Twenty years on - how Anderson was shaped for greatness",
    "Life is just as important as football - Hayes",
    "Gaston's fine for conduct is bigger than earnings",
    "Can Murray make his mark on Wimbledon anniversary?",
    "Jockey Club applies for injunction against protests",
    "Mumbai reach IPL play-offs as Bangalore beaten",
    "'Special night' - but Man Utd 'need miracle' for title",
    "Mark Cavendish to retire: A career in pictures",
    "'We must win Champions League to be one of best'",
    "'Brighton in Europe bigger than title win for top-six club'",
    "From snubbed to main spotlight - Cameron emerges as pound-for-pound contender",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "It's a really sad day for Arsenal - Arteta. VideoIt's a really sad day for Arsenal - Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "TMS podcast: When Tuffers met Leach. AudioTMS podcast: When Tuffers met Leach",
    "5 Live Boxing: Taylor v Cameron - The debrief. Audio5 Live Boxing: Taylor v Cameron - The debrief",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Bono explains mysterious World Cup absence",
    "Awoniyi keeps Forest up and ends Arsenal title hopes",
    "Mbeumo and Wissa goals give Brentford win at Spurs",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]