[
    "Spurs expected to open talks with Celtic's Postecoglou",
    "Ibrahimovic retires from football at 41",
    "England spinner Leach ruled out of Ashes",
    "Benzema scores on final Real Madrid appearance",
    "'Hamilton eyes 2024 with Verstappen out of reach'",
    "Djokovic 'proud' of surpassing Nadal record",
    "Mum Svitolina 'feels 17 again' as she sets up Sabalenka match",
    "Stoppage-time Alderweireld goal gives Antwerp first title in 66 years",
    "Russian players still waiting for Wimbledon visas",
    "How do Real Madrid prepare for life after Benzema?",
    "Eight-year-old boy with cancer attacked at French game",
    "Man City hope for new Haaland deal - Monday's gossip",
    "Inter game the 'exam' Man City have to pass - Rodri",
    "Swiatek continues title push against Tsurenko",
    "Doubles team disqualified after ball girl is hit",
    "Ashes success can set players up for life - Root",
    "Man City have set the standard - how can Man Utd catch up?",
    "Australia's Hazlewood out of Test against India",
    "The Greek kid who could become Tottenham's main man",
    "McKibbin wins his first title at European Open",
    "River Plate game abandoned after fan falls to death",
    "Untouchable Verstappen powers to Spanish GP win",
    "Man charged over '97' football shirt at FA Cup final",
    "'I saw Man City lose at York... now we can win the Treble'",
    "Dunlop wins TT to go joint second on all-time list",
    "'Gundogan once again the man for the big moments'",
    "Stokes 'on course' to bowl in first Ashes Test",
    "'Postecoglou future ominous as his history Bhoys triumph in present'",
    "Messi and Ramos sign off with PSG defeat",
    "Barcelona come from 2-0 down to win second Champions League title",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Stumped podcast: Is Dhoni the IPL's Tom Brady? AudioStumped podcast: Is Dhoni the IPL's Tom Brady?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Kenya's Faith Kipyegon breaks 1500m world record",
    "Former Olympic champion Cissé focused on Paris",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]