[
    "Tottenham name Postecoglou as new manager",
    "Live. Postecoglou to Spurs reaction, plus Kane, Mac Allister and more",
    "Question marks surround India for World Test final",
    "Moeen considering England Ashes approach",
    "Spurs should 'cash in' on Kane for rebuild - Richards",
    "Alcaraz & Djokovic aim to set up semi-final showdown",
    "Seven punished over racism towards Vinicius Jr",
    "Europa Conference League final - all you need to know",
    "The 41-year-old who became world champion in five fights",
    "Can you name these Ashes cricketers?",
    "Government-backed trial for concussion app",
    "Rune wins thriller to book Ruud last-eight rematch",
    "Singapore to hold final horse race after 180 years",
    "Murray fancies chances against top 10 on grass",
    "Swiatek tees up Gauff rematch in Paris",
    "Four clubs targeting Gundogan - Tuesday's gossip",
    "Emotional Kato struggles to discuss French Open default",
    "Hines, first 100m sprinter to break 10 seconds, dies",
    "The first, most infamous Champions League winners",
    "Whyte offered Joshua rematch - Hearn",
    "Real Madrid want Kane as Benzema replacement",
    "Van Niekerk 'uncomfortable' in cricket kit",
    "Zhang and McKibbin - the 20-year-olds on path to greatness?",
    "What happened in Super League final round?",
    "'I'm actually, deep down, a caring person'",
    "Sabalenka has the right not to do media - Pegula column",
    "Quiz: How well do you know Ibrahimovic?",
    "City Football Group - do all roads lead to Manchester?",
    "'Hamilton eyes 2024 with Verstappen out of reach'",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "TMS podcast: Jack Leach is out, so who's in? AudioTMS podcast: Jack Leach is out, so who's in?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Jabeur beats Pera to reach French Open quarters",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]