[
    "Live. VAR debate and reaction to Liverpool win at Leicester",
    "‘When the cops pull you over, be super nice’",
    "Live. Italian Open last 16 - Djokovic leads Norrie by early break",
    "Archer out for summer as England recall Bairstow",
    "After breast cancer diagnosis and 15 rounds of chemo, cox Kennedy returns",
    "'There was a point I hated everything about football'",
    "Leicester in deep trouble after meek Liverpool defeat",
    "Who is 'never flustered'? Garth's Team of the Week",
    "Ex-Leeds boss Bielsa named Uruguay head coach",
    "Thomas 'turns corner' before PGA title defence",
    "PSG want Silva to replace Messi - Tuesday's gossip",
    "The remarkable reinvention of India legend Dhoni at 41",
    "'One of the greatest final-hole approaches to win a major'",
    "France pulls out of hosting Rugby League World Cup",
    "Titans seal play-off spot as Sunrisers eliminated",
    "Who will survive Premier League relegation?",
    "Release of VAR audio 'small step forward' - Webb",
    "Umpire's 'soft signal' to be scrapped by ICC",
    "Which Premier League teams can qualify for Europe?",
    "Barcelona is Messi's home - Laporta",
    "Glasgow 'have got beating of Toulon' in European final",
    "Thomas ready to prove a point in pink at Giro",
    "AC Milan can reach Champions League final - Pioli",
    "Evans regains two-year World Snooker Tour card",
    "'More questions than answers after Barca title win'",
    "How The Rock is helping others live his NFL dream",
    "When teams have let big leads go in title races",
    "Four wins from greatness - how Man City’s mentality is key to Treble bid",
    "'Victory for the grind' - relentless Chelsea become 'hybrid monsters'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'Wrighty dug me out on Match of the Day' Video'Wrighty dug me out on Match of the Day'",
    "We may not have Rice next season - Moyes. VideoWe may not have Rice next season - Moyes",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Radebe calls for reform in South African football",
    "Minister wants sanctions in anti-homophobia row",
    "Salah assists maintain Liverpool's top-four hopes",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]