[
    "Live. Premier League: Saints relegated, plus wins for Villa, Palace & Man Utd",
    "Live. Scottish Premiership: United bottom after County & Kilmarnock both win",
    "Southampton relegated with whimper by Fulham loss",
    "Intense Rangers earn Beale first Old Firm win",
    "Live. EFL play-offs: Sunderland v Luton after Bolton draw with Barnsley",
    "Live. Premiership semi-final: Saracens v Northampton",
    "Live. County Championship, day three",
    "Live. URC semi-finals: Leinster face Munster after Stormers win 10-try thriller",
    "Live. National League promotion final: Chesterfield lead Notts in extra time",
    "Man Utd beat Wolves to strengthen top-four place",
    "Healy's stunning solo break wins Giro stage eight",
    "How The Rock is helping others live his NFL dream",
    "Vollering extends overall lead at Itzulia Women",
    "James leads Lakers to win that eliminates Warriors",
    "Superb Eze double earns Palace win over Bournemouth",
    "Villa beat Spurs to strengthen European hopes",
    "Forest earn draw at Chelsea to edge towards safety",
    "Bayern put six past Schalke to move closer to title",
    "Man Utd to step up Rice interest - Saturday's gossip",
    "Quiz: Eurovision or European Cup winner?",
    "Leeds keep alive survival hopes with Newcastle draw",
    "Griner plays for first time since release by Russia",
    "Edwards brothers aiming for MMA 'legend' status",
    "Military Orders wins Lingfield Derby trial",
    "Your stories of football academy rejection",
    "Para-canoeist Henshaw wins second gold at World Cup",
    "Sutton's Premier League predictions v Def Leppard's Joe Elliott",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "NFL's Commanders agree record £4.8bn sale",
    "Edwards beats Mousasi to set up Bellator title shot",
    "Many quality players want to join Man Utd - Ten Hag",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "Klopp and Ten Hag time-waste too - Allardyce. VideoKlopp and Ten Hag time-waste too - Allardyce",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Scrum V podcast: At home with Dan Biggar. AudioScrum V podcast: At home with Dan Biggar",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "The Africans who have scored success in Italy",
    "En-Nesyri opener cancelled out by late Gatti goal",
    "Benrahma penalty helps West Ham take slender lead",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]