[
    "Live. La Liga: Lewandowski puts Barcelona in front at Espanyol",
    "Arsenal lose to Brighton to leave Man City on brink",
    "Man City one win from title with victory at Everton",
    "Grizzlies' Morant suspended over another gun video",
    "Chelsea are in turmoil - why has Pochettino chosen them?",
    "Evenepoel edges out Thomas on Giro stage nine",
    "Kerr goal seals Chelsea's third successive FA Cup",
    "Norrie sets up Djokovic meeting in Rome",
    "Feyenoord beat Eagles to win Eredivisie title",
    "Anderson groin injury not 'too serious' - Chapple",
    "Spezia dent AC Milan's Champions League hopes",
    "Sale edge Tigers to reach first final for 17 years",
    "Two from four? Who faces Premier League relegation?",
    "'A celebration of friendship' - Sinfield carries Burrow to marathon finish",
    "Messi booed by PSG fans in win against Ajaccio",
    "Chelsea agree terms with ex-Spurs boss Pochettino",
    "Alimkhanuly defends title & calls out Alvarez",
    "Root out for 10 in first IPL knock as Royals thrashed",
    "Suns fire 2022 NBA Coach of the Year Williams",
    "How The Rock is helping others live his NFL dream",
    "'Huge talent' Garnacho can play key role in run-in",
    "Brentford beat West Ham to seal top-half finish",
    "Much-changed Madrid prepare for Man City with win",
    "Bayern put six past Schalke to move closer to title",
    "Wood wins gold on return after cancer treatment",
    "Bezzecchi triumphs in dramatic French MotoGP",
    "Your stories of football academy rejection",
    "Edwards brothers aiming for MMA 'legend' status",
    "Sutton's Premier League predictions v Def Leppard's Joe Elliott",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "NFL's Commanders agree record £4.8bn sale",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "We may not have Rice next season - Moyes. VideoWe may not have Rice next season - Moyes",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Scrum V podcast: At home with Dan Biggar. AudioScrum V podcast: At home with Dan Biggar",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "The Africans who have scored success in Italy",
    "En-Nesyri opener cancelled out by late Gatti goal",
    "Benrahma penalty helps West Ham take slender lead",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]