[
    "Man City start Premier League defence at Burnley",
    "Live. Bellingham at 'greatest club' Real Madrid & Premier League fixtures",
    "West Ham turn down first Arsenal bid for Rice",
    "Beale pleads not guilty to sexual assault",
    "Croatia stun Dutch to reach Nations League final",
    "Root v Smith - two batting titans, but who is better?",
    "Why Bellingham's Real move makes 'perfect sense'",
    "Chelsea reject £40m Man Utd bid for Mount",
    "Stones in midfield? Eze at 10? England's big calls",
    "Ali's grandson says boxing icon 'would love MMA'",
    "A president, a Playboy mansion and key stories at LA's US Open",
    "England choose Broad for first Ashes Test",
    "Battle Stations: Where the Ashes will be won and lost",
    "'Everyone thought we were the Wags' - England's overlooked 2005 Ashes win",
    "Ashes head-to-head quiz - how do the players compare?",
    "Prolific Smith targets 'bucket list' Ashes win",
    "Man Utd end interest in Kane - Thursday's gossip",
    "'Class act' Eze's rise from reject to England call",
    "Azarenka stunned by American teenager Krueger",
    "Kyrgios considered suicide after 2019 Wimbledon loss",
    "Fifa secretary general Samoura to leave role",
    "Premier League leads European football market",
    "PGA Tour boss Monahan recovering from 'medical situation'",
    "Why Man City's domination provokes questions as well as praise",
    "Facing Messi & co has me ready for Haaland - Hendry",
    "Nations League - who will join Croatia in final?",
    "UFC star lost eight years to illness - now he's back",
    "F1 quiz: How well do you know the Canadian Grand Prix?",
    "Danger, beauty & carbon - why Le Mans is more important than you realise",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "5 Live Rugby League podcast: Tag Rugby. Audio5 Live Rugby League podcast: Tag Rugby",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Oshoala welcomes Women's World Cup money boost",
    "Senegal defender Sarr set for Qatar move",
    "South Africa's Dyantyi signs for Sharks after ban",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]