[
    "Live. World Test Championship final: Australia v India",
    "Live. French Open semis: Sabalenka and Muchova into second-set tie-break",
    "Liverpool complete £35m Mac Allister signing",
    "Jokic and Murray star as Nuggets regain Finals lead",
    "The Jewish star who represented and survived Nazi Germany",
    "'Redemption' for Kato after 'unjust' disqualification",
    "'I've taken the decision' - Messi to join Inter Miami",
    "'Guardiola's voodoo will end Man City's hoodoo'",
    "Scheduling shows women's tennis is undervalued - Pegula column",
    "Shock merger will be 'good for golf' - McIlroy",
    "We promised Rice he could leave West Ham - Sullivan",
    "West Ham 'animals' in final - Fiorentina president",
    "Newcastle and Man Utd want Kim - Thursday's gossip",
    "Ireland's Bannon to make UFC debut in July",
    "Real Madrid agree 103m euro deal to sign Bellingham",
    "Football in Senegal suspended after deadly protests",
    "'He never hides' - new Liverpool signing Mac Allister",
    "‘Golf truce shows how Saudi money is changing world sport’",
    "Four British fighters, three world titles - Wembley's Saturday showdown",
    "Ruud beats Rune to book semi-final against Zverev",
    "Hewett into French Open wheelchair singles final",
    "Quiz: How well do you know Messi?",
    "'No plans' for IRFU to invest in London Irish",
    "'Moments Moyes and West Ham will never forget'",
    "Who could be on move in the WSL transfer window",
    "'Moeen return the best move England could make'",
    "Ferguson's finest? Guardiola's greatest? Who would you pick?",
    "How Kenworthy’s coming out inspired a generation",
    "'He makes you feel invincible' - what will Postecoglou bring to Spurs?",
    "Five things we learned from new BBC Ashes film",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Ex-captain Zakuani takes up DR Congo coaching role",
    "Jabeur beaten in French Open quarter-final",
    "Kenya international Oduor joins Bradford City",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]