[
    "Live. Transfer news and football latest",
    "Celtic's Postecoglou agrees to become Spurs boss",
    "Question marks surround India heading into WTC final",
    "Moeen considering England Ashes approach",
    "Spurs should 'cash in' on Kane for rebuild - Richards",
    "Alcaraz & Djokovic aim to set up semi-final showdown",
    "Seven punished over racism towards Vinicius Jr",
    "Europa Conference League final - all you need to know",
    "Swiatek tees up Gauff rematch in Paris",
    "Rune wins thriller to book Ruud last-eight rematch",
    "Government-backed trial for concussion app",
    "The first, most infamous Champions League winners",
    "Murray fancies chances against top 10 on grass",
    "Whyte offered Joshua rematch - Hearn",
    "Four clubs targeting Gundogan - Tuesday's gossip",
    "Emotional Kato struggles to discuss French Open default",
    "Hines, first 100m sprinter to break 10 seconds, dies",
    "Real Madrid want Kane as Benzema replacement",
    "Van Niekerk 'uncomfortable' in cricket kit",
    "Zhang and McKibbin - the 20-year-olds on path to greatness?",
    "Sabalenka has the right not to do media - Pegula column",
    "City Football Group - do all roads lead to Manchester?",
    "'I'm actually, deep down, a caring person'",
    "What happened in Super League final round?",
    "How well do you know Ibrahimovic?",
    "'Hamilton eyes 2024 with Verstappen out of reach'",
    "How cricket is providing a 'release' for monks in India",
    "How do Real Madrid prepare for life after Benzema?",
    "'Gundogan once again the man for the big moments'",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "TMS podcast: Jack Leach is out, so who's in? AudioTMS podcast: Jack Leach is out, so who's in?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Jabeur beats Pera to reach French Open quarters",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]