[
    "Live. US PGA round two - Scheffler leads with Conners, McIlroy among chasers",
    "Rose makes a run as Block makes waves at US PGA",
    "Halep charged with second anti-doping breach",
    "'He wants to stay' - Ten Hag on Rashford contract saga",
    "Legendary NFL running back Jim Brown dead at 87",
    "'Going for the title like serving for Wimbledon'",
    "Violins & adoring fans - Taylor & Cameron weigh in",
    "Klopp will pay FA fine if it goes to 'good cause'",
    "Rajasthan stay in IPL play-off hunt but Punjab out",
    "Toulon overpower meek Glasgow to win Challenge Cup",
    "Spurs eye Chelsea keeper Mendy - Saturday's gossip",
    "'You fantasise about being like Bobby'",
    "'Born leader' Stokes best captain Anderson has had",
    "Jones and Tipuric announce shock Wales retirements",
    "O'Gara ready to enter Leinster's 'lion's den'",
    "Charles-Barclay to miss race due to visa issues",
    "F1 to donate 1m euros to relief fund for flooding",
    "Rubio wins shortened stage at weather-hit Giro",
    "Why Nadal's French Open absence is hard to imagine",
    "Arsenal have 'made strong steps' this season - Arteta",
    "AZ Alkmaar sorry for 'night to reflect on with shame'",
    "Basketball fan shot dead at Libyan top-flight match",
    "Toney future is with Brentford despite ban - Frank",
    "Swiatek optimistic of being fit for French Open",
    "Roy 'chucked in at the deep end' in Tests",
    "Sutton's Premier League predictions v stars of Woolf Women",
    "'I have had so many pinch-myself moments' - Jill Scott column",
    "Man Utd the team to target - fantasy football tips",
    "The 'squeaky-voiced' boss leading Man Utd's title bid",
    "'Football's literally given me my world' - Wales legend Ward set for her final game",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "Watch Moore's passionate post-match speech. VideoWatch Moore's passionate post-match speech",
    "Toney's future 'is at Brentford' - Frank. VideoToney's future 'is at Brentford' - Frank",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Football Daily: Treble time for Man City? AudioFootball Daily: Treble time for Man City?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "'Pep-lite' targets African Champions League glory",
    "Leicester and SA number eight Wiese wins RPA award",
    "South Africa, Fiji, Qatar express World Cup interest",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]