[
    "Live. Champions League final: Man City complete Treble with win over Inter Milan - reaction",
    "Man City claim Treble with Champions League win",
    "Live. World title triple-header in London - live text",
    "Kohli stands between Australia and Test title",
    "Treble win a dream come true for Man City - Rodri",
    "Swiatek fights off Muchova to win third French Open",
    "Nuggets win to move closer to NBA title",
    "'Hysterical & hated at times - but Guardiola is the greatest'",
    "Griner and team allegedly harassed at airport",
    "Murray beats Thompson to reach Surbiton final",
    "'Swiatek drops trophy but not loosening grip on game'",
    "Djokovic aims to make tennis history against Ruud",
    "How you rated the players: Man City 1-0 Inter Milan",
    "Villa agree deal to sign Leicester midfielder Tielemans",
    "PSG chairman denies role in Man Utd ownership saga",
    "Win would take Taylor to new level in US eyes - Arum",
    "Hatton climbs into contention at Canadian Open",
    "Hickman wins Senior TT to complete four-timer",
    "Man Utd will not pay £60m-plus for Mount - Sunday's gossip",
    "Hodgkinson sets British record in Diamond League win",
    "Leeds chairman agrees £170m deal to sell to 49ers",
    "Gloucester-Hartpury reach first Premier 15s final",
    "Storm forces Charlotte Edwards Cup final abandonment",
    "Murray enters Nottingham Open",
    "Lapthorne, Hewett & Reid win Paris doubles titles",
    "UFC fans will miss me when I retire - Nunes",
    "'I didn't feel like me so I had to step back'",
    "'He never hides' - new Liverpool signing Mac Allister",
    "Four British fighters, three world titles - Wembley's Saturday showdown",
    "Scheduling shows women's tennis is undervalued - Pegula column",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "We've shown up every time - Dias. VideoWe've shown up every time - Dias",
    "De Bruyne on love at first sight with Haaland. VideoDe Bruyne on love at first sight with Haaland",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "How to win the Ashes: Steve Smith on 2019. AudioHow to win the Ashes: Steve Smith on 2019",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Chelsea target says Inter 'have nothing to lose'",
    "Guinea's Keita to join Werder Bremen this summer",
    "'My mind wants to get angry but my body can't back it up'",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]