[
    "Live. Premier League: Haaland doubles Man City lead, Brentford also in front",
    "Chelsea agree terms with ex-Spurs boss Pochettino",
    "Messi booed by PSG fans in win against Ajaccio",
    "Live. Women's FA Cup final: Chelsea v Man Utd - live text",
    "Much-changed Madrid prepare for Man City with win",
    "Chelsea are in turmoil - why has Pochettino chosen them?",
    "Alimkhanuly defends title & calls out Alvarez",
    "Liverpool to bid £70m for Mac Allister - Sunday's gossip",
    "Spezia dent AC Milan's Champions League hopes",
    "Bayern put six past Schalke to move closer to title",
    "Root out for 10 in first IPL knock as Royals thrashed",
    "Suns fire 2022 NBA Coach of the Year Williams",
    "How The Rock is helping others live his NFL dream",
    "'Both Leeds and Newcastle left nursing regrets'",
    "Live. County Championship, day four - text",
    "Can you name all Chelsea's Premier League managers?",
    "'Huge talent' Garnacho can play key role in run-in",
    "Healy's stunning solo break wins Giro stage eight",
    "Saracens crush Saints in Premiership semi-final",
    "Rangers turn tables to bring calm instead of chaos",
    "Villa beat Spurs to strengthen European hopes",
    "Munster pip Leinster in epic to seal Stormers final",
    "Vollering extends overall lead at Itzulia Women",
    "'We have two cup finals' - two-goal Awoniyi on Forest's task",
    "Military Orders wins Lingfield Derby trial",
    "Your stories of football academy rejection",
    "Edwards brothers aiming for MMA 'legend' status",
    "Sutton's Premier League predictions v Def Leppard's Joe Elliott",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "NFL's Commanders agree record £4.8bn sale",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "'The skies will fall' - Naples, a city on the brink",
    "We may not have Rice next season - Moyes. VideoWe may not have Rice next season - Moyes",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Scrum V podcast: At home with Dan Biggar. AudioScrum V podcast: At home with Dan Biggar",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "The Africans who have scored success in Italy",
    "En-Nesyri opener cancelled out by late Gatti goal",
    "Benrahma penalty helps West Ham take slender lead",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]