[
    "Champions League semi-final: Reaction as Inter beat AC Milan to reach final",
    "Inter reach first Champions League final since 2010",
    "Qatari banker Sheikh Jassim makes improved Man Utd bid",
    "Djokovic criticises Norrie after body hit",
    "'I don't care' - Crawley dismisses selection debate",
    "Cort wins Giro stage 10 as Thomas maintains lead",
    "'When the cops pull you over, be super nice'",
    "My legacy is exceptional already, says Guardiola",
    "Swiatek continues dominant streak in Rome",
    "Kane representatives meet PSG - Wednesday's gossip",
    "Masters 'wake-up call' helping McIlroy's PGA tilt",
    "'Archer's latest injury is the cruellest of blows'",
    "Luton overpower Sunderland to reach play-off final",
    "Former UFC champion Ngannou signs PFL deal",
    "Arsenal forward Balogun switches to USA from England",
    "Behaviour towards referees 'not good enough'",
    "Cooper & Kerevi to play for Barbarians v World XV",
    "'Obsessed' Parisse wants to go out on a high",
    "Who will survive Premier League relegation?",
    "Thomas 'turns corner' before PGA title defence",
    "West Ham will not talk to clubs about Rice until end of season",
    "Anderson expects to be fit 'in a couple of weeks'",
    "Toulouse's Aboukhlal training alone after altercation claims",
    "The remarkable reinvention of India legend Dhoni at 41",
    "Women's Champions League final sells out",
    "Who is 'never flustered'? Garth's Team of the Week",
    "US PGA Championship tee-times for first two rounds",
    "'There was a point I hated everything about football'",
    "How The Rock is helping others live his NFL dream",
    "'One of the greatest final-hole approaches to win a major'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "All about the PGA Championship 2023. AudioAll about the PGA Championship 2023",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Women's football 'best opportunity' for Tanzania",
    "Ivorian Zaha may have played final game for Palace",
    "Hat-trick of Salah assists as Reds eye top-four",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]