[
    "Live. French Open: Swiatek beats Haddad Maia to reach final",
    "Liverpool complete £35m Mac Allister signing",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "Devastating bowlers put Australia in command against India",
    "Muchova stuns Sabalenka to reach French Open final",
    "'Guardiola's voodoo will end Man City's hoodoo'",
    "Live. Watch: West Ham's Europa Conference League trophy parade",
    "Canadian Grand Prix 'not at risk' despite wildfires",
    "'Redemption' for Kato after 'unjust' disqualification",
    "Rice '99%' sure to leave West Ham - Sullivan",
    "West Ham 'animals' in final - Fiorentina president",
    "Jokic and Murray star as Nuggets regain Finals lead",
    "Leclerc race helmet breaks record at flood auction",
    "'I've taken the decision' - Messi to join Inter Miami",
    "Scheduling shows women's tennis is undervalued - Pegula column",
    "Shock merger will be 'good for golf' - McIlroy",
    "Female driver programme will have 'huge impact'",
    "‘Golf truce shows how Saudi money is changing world sport’",
    "'He never hides' - new Liverpool signing Mac Allister",
    "Newcastle and Man Utd want Kim - Thursday's gossip",
    "Ireland's Bannon to make UFC debut in July",
    "Real Madrid agree 103m euro deal to sign Bellingham",
    "Football in Senegal suspended after deadly protests",
    "Four British fighters, three world titles - Wembley's Saturday showdown",
    "'Golf merger brings peace, but turmoil lies ahead'",
    "'Moeen return the best move England could make'",
    "Ferguson's finest? Guardiola's greatest? Who would you pick?",
    "'He makes you feel invincible' - what will Postecoglou bring to Spurs?",
    "Teenager Bellingham's rapid rise to football stardom",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Ex-captain Zakuani takes up DR Congo coaching role",
    "Jabeur beaten in French Open quarter-final",
    "Kenya international Oduor joins Bradford City",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]