[
    "Live. Leicester & Leeds relegated as Everton survive - reaction",
    "'Celebration born from failure - Everton need big changes'",
    "'A weekend of illusions, but Alonso entertains'",
    "'Most expensive squad to be relegated' - what went wrong for Leicester?",
    "Ajax's Berghuis apologises for lashing out at fan",
    "GB's Norrie and Draper feature on French Open day two",
    "The inside story of Newcastle's Champions League return",
    "Sackings, drama & controversy - a season to remember",
    "'Ownership needs sorting’ – what next for relegated Leeds?",
    "Gallardo statue sparks mockery over crotch bulge",
    "Brown, 14, wins World Skateboarding Tour opener",
    "Wine & baguettes helping French Open bid - Tsitsipas",
    "Newgarden wins dramatic Indianapolis 500",
    "Barcelona keen on Guimaraes - Monday's gossip",
    "Thomas eyes fresh targets after 'raw' Giro defeat",
    "Taylor to fight on as Cameron rematch planned",
    "Wales to host South Korea in September friendly",
    "Hamburg denied promotion by last-gasp Heidenheim win",
    "Where did it go wrong for Dundee Utd?",
    "Cavendish wins last Giro stage as Roglic takes title",
    "'Deja vu' as Muchova upsets eighth seed Sakkari",
    "Ireland clinch 10-wicket victory over Essex",
    "'Goals are his life' - Haaland & Man City 'perfect match'",
    "Hall misses out as Grillo wins play-off at Colonial",
    "How French Open is using AI to protect players online",
    "IPL final to be played on Monday after heavy rain",
    "Isle of Man TT - Six big talking points for 2023",
    "Kool wins RideLondon Classique with Deignan third",
    "20 teams, 200 questions - the big Premier League quiz",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "We want to be the real deal - Arteta. VideoWe want to be the real deal - Arteta",
    "Can Everton ever be great again? VideoCan Everton ever be great again?",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Dramatic Doucoure goal keeps Everton in Premier League",
    "Awoniyi scores again as Forest draw at Palace",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]