[
    "Live. French Open last 16: Gauff to serve for first set for third time",
    "Real Madrid want Kane as Benzema replacement",
    "Whyte offered Joshua rematch - Hearn",
    "Ruud comes through Jarry test to reach last eight",
    "The first, most infamous Champions League winners",
    "Kasatkina 'feeling bitter' after French Open boos",
    "Van Niekerk 'uncomfortable' in cricket kit",
    "'I'm actually, deep down, a caring person'",
    "City Football Group - do all roads lead to Manchester?",
    "Ibrahimovic retires from football at 41",
    "Zhang and McKibbin - the 20-year-olds on path to greatness?",
    "'Hamilton eyes 2024 with Verstappen out of reach'",
    "Sabalenka has the right not to do media - Pegula column",
    "Spurs expected to open talks with Celtic's Postecoglou",
    "Benzema scores on final Real Madrid appearance",
    "Yorkshire criticise Graves after he ends chair bid",
    "Jabeur beats Pera to reach French Open quarters",
    "Houghton signs new Manchester City contract",
    "Man City hope for new Haaland deal - Monday's gossip",
    "Hovland wins play-off for Memorial victory",
    "Zhang wins on Tour debut nine days after turning pro",
    "Stoppage-time Alderweireld goal gives Antwerp first title in 66 years",
    "Russian players still waiting for Wimbledon visas",
    "Heat level NBA Finals thanks to key road win",
    "River Plate game abandoned after fan falls to death",
    "How cricket is providing a 'release' for monks in India",
    "How do Real Madrid prepare for life after Benzema?",
    "'Gundogan once again the man for the big moments'",
    "'Postecoglou future ominous as his history Bhoys triumph in present'",
    "Messi and Ramos sign off with PSG defeat",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]