[
    "Chelsea appoint Pochettino as new manager",
    "Live. French Open - first-round action from Roland Garros",
    "Sheff Wed beat Barnsley with 123rd-minute winner",
    "McCullum relishing 'formidable' Australia challenge",
    "Nisbet earns Scotland recall as Adams misses out",
    "Live. Sheff Wed score 123rd-minute goal to win League One play-off final",
    "Player abuse getting worse - Stephens",
    "Who were on an upward curve and who were sleepwalking?",
    "Leicester chairman sent 'abusive' messages",
    "How did BBC pundits' predictions turn out?",
    "Who is almost unplayable? Garth's Team of the Season",
    "Goodbye FC Hollywood? Bayern Munich plan rebuild",
    "'Chelsea owners cannot afford for Pochettino to fail'",
    "Bellingham named Bundesliga player of the season",
    "Spalletti to leave Napoli and take time out of game",
    "France to host Ireland in Marseille in Six Nations",
    "Gallardo statue sparks mockery over crotch bulge",
    "Time to tackle our Manchester derby FA Cup quiz",
    "Vote for your Premier League award winners",
    "Norrie unhappy at 'absurd' call in French Open win",
    "Passenger added to Epsom Derby field",
    "The inside story of Newcastle's Champions League return",
    "Ajax's Berghuis apologises for lashing out at fan",
    "'A weekend of illusions, but Alonso entertains'",
    "Sackings, drama & controversy - a season to remember",
    "Wackiest moments of the football season",
    "Brown, 14, wins World Skateboarding Tour opener",
    "20 teams, 200 questions - the big Premier League quiz",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "We want to be the real deal - Arteta. VideoWe want to be the real deal - Arteta",
    "Can Everton ever be great again? VideoCan Everton ever be great again?",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "72+ podcast: Luton Town are Premier League. Audio72+ podcast: Luton Town are Premier League",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Dramatic Doucoure goal keeps Everton in Premier League",
    "Awoniyi scores again as Forest draw at Palace",
    "I’m ‘obsessed’ with tennis – Sherif",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]