[
    "Live. Man City's Treble winners celebrate with a victory parade",
    "AC Milan pay tribute to former owner Berlusconi",
    "Missing World Cup was worse than ban - Toney",
    "'Australia are formidable - but they can be beaten'",
    "'Man down!' - security takes out PGA Tour player",
    "Newcastle sign Gambia winger Minteh from Odense",
    "Mayweather exhibition fight ends in mass brawl",
    "Manager Moyes to stay at West Ham",
    "Chelsea's Colwill trains with senior England side",
    "The ball of the century and more great Ashes images",
    "Three Everton directors leave club's board",
    "Boulter replaces Raducanu as British number one",
    "Taylor sinks 72-foot play-off putt to deny Fleetwood in Canada",
    "Berrettini loses in Stuttgart on injury return",
    "Who will write blockbuster US Open storyline in LA?",
    "Schade joins Brentford for club record fee",
    "Spain recall three players involved in dispute",
    "HMRC lodges winding-up petition against Wigan",
    "Ajax's Berghuis banned for 'throwing punch' at fan",
    "ECB criticises Graves' racism 'banter' claim",
    "Watson 'hard done by' over lack of Wimbledon points",
    "England recall Marler & Care for preparation camp",
    "Cross in Ashes Test squad after parasite infection",
    "Emotional Ranieri leads Cagliari back to Serie A",
    "Snooker gender gap will narrow, says women's chief",
    "Has Djokovic settled the men's GOAT debate?",
    "McGregor 'injures mascot' in half-time stunt",
    "Ferrari make triumphant return to Le Mans",
    "'Man City among the greatest sides I have seen - but who are yours?'",
    "'Tears shed as Man City conquer Champions League mountain'",
    "The Jewish star who survived and shone at the heart of Nazi Germany",
    "The schools where tomorrow’s stars walk the corridors",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "We've shown up every time - Dias. VideoWe've shown up every time - Dias",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "How to win the Ashes: Steve Smith on 2019. AudioHow to win the Ashes: Steve Smith on 2019",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Al Ahly claim 11th African Champions League win",
    "Gambia call-up means 'everything' to Khan",
    "Onana unable to save Inter as Man City net Treble",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]