[
    "Cavendish to retire at end of season",
    "Live. Reaction to Man City title win & latest football news",
    "Koepka wins US PGA Championship to claim fifth major",
    "'La Liga belongs to racists' - Vinicius Jr",
    "Twenty years on - how Anderson was shaped for greatness",
    "Guardiola 'the difference maker' as City eye Treble",
    "Miami beat Boston to move closer to NBA finals",
    "At least twelve killed in El Salvador stadium crush",
    "Murray withdraws from French Open",
    "O'Gara targets Ireland job after La Rochelle triumph",
    "'Special night' - but Man Utd 'need miracle' for title",
    "Club pro Block steals show at US PGA Championship",
    "Mbappe double leaves PSG on verge of title",
    "Mumbai reach IPL play-offs as Bangalore beaten",
    "'A big ask' - Leeds fear 'devastating' relegation",
    "McNulty edges Healy in sprint to win Giro stage",
    "Medvedev wins first clay-court title at Italian Open",
    "Johnson-Thompson wins in two events on return",
    "Mark Cavendish: A career in pictures",
    "Life is just as important as football - Hayes",
    "Chelsea make £70m Vlahovic bid - Monday's gossip",
    "Dortmund go two clear of Bayern heading into final day",
    "'Brighton in Europe bigger than title win for top-six club'",
    "'We must win Champions League to be one of best'",
    "Swift treble helps Hull beat Cas to reach quarters",
    "From snubbed to main spotlight - Cameron emerges as pound-for-pound contender",
    "Farah eighth in penultimate race of career",
    "Can you name all the Premier League-winning captains?",
    "Ten moments that defined Premier League title race",
    "Who will step up to challenge Man City?",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "It's a really sad day for Arsenal - Arteta. VideoIt's a really sad day for Arsenal - Arteta",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "5 Live Boxing: Taylor v Cameron - The debrief. Audio5 Live Boxing: Taylor v Cameron - The debrief",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Awoniyi keeps Forest up and ends Arsenal title hopes",
    "Mbeumo and Wissa goals give Brentford win at Spurs",
    "Basketball fan shot dead at Libyan top-flight match",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]