[
    "Live. Champions League semi-final: Inter Milan v AC Milan - radio & text",
    "'When the cops pull you over, be super nice'",
    "Djokovic criticises Norrie after body hit",
    "Archer out for summer as England recall Bairstow",
    "Cort wins Giro stage 10 as Thomas maintains lead",
    "Live. Championship play-offs: Luton host Sunderland in second leg",
    "Masters 'wake-up call' helping McIlroy's PGA tilt",
    "Behaviour towards referees 'not good enough'",
    "After breast cancer diagnosis and 15 rounds of chemo, cox Kennedy returns",
    "West Ham will not talk to clubs about Rice until end of season",
    "Former UFC champion Ngannou signs PFL deal",
    "'Archer's latest injury is the cruellest of blows'",
    "Who will survive Premier League relegation?",
    "Cooper & Kerevi to play for Barbarians v World XV",
    "Thomas 'turns corner' before PGA title defence",
    "'Obsessed' Parisse wants to go out on a high",
    "Arsenal forward Balogun switches to USA from England",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Who is 'never flustered'? Garth's Team of the Week",
    "Anderson expects to be fit 'in a couple of weeks'",
    "PSG want Silva to replace Messi - Tuesday's gossip",
    "Toulouse's Aboukhlal training alone after altercation claims",
    "The remarkable reinvention of India legend Dhoni at 41",
    "'That's the end of them' - Leicester look 'gone' after Liverpool loss",
    "Women's Champions League final sells out",
    "'One of the greatest final-hole approaches to win a major'",
    "'More questions than answers after Barca title win'",
    "How The Rock is helping others live his NFL dream",
    "All our daily Ashes picture quizzes in one place",
    "When teams have let big leads go in title races",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "'We'll find you and we won't let you live' - a team's fight to exist",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Women's football 'best opportunity' for Tanzania",
    "Ivorian Zaha may have played final game for Palace",
    "Hat-trick of Salah assists as Reds eye top-four",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]