[
    "Emilia Romagna GP called off after flooding",
    "Live. Football latest & build-up to Man City v Real Madrid",
    "'De Bruyne still needs his defining moment'",
    "Italy and Juve captain Bonucci to retire next year",
    "What are the key US PGA Championship talking points?",
    "Britain's Geoghegan Hart crashes out of Giro",
    "'No-one will want to marry you if you're out boxing'",
    "My legacy is exceptional already, says Guardiola",
    "Rugby player in Australia given 96-week ban",
    "Morant takes 'full accountability' over gun video",
    "Fiji, Qatar & South Africa express World Cup interest",
    "Two mass brawls and four red cards in chaotic final",
    "'I want to avoid Real' - can 'underdogs' Inter complete 'miracle'?",
    "What is going on with the Man Utd sale?",
    "Aubameyang announces Gabon retirement U-turn",
    "Can you name these Ashes cricketers?",
    "Jokic stars as Nuggets beat Lakers",
    "Who will triumph in the WSL title race?",
    "'I don't care' - Crawley dismisses selection debate",
    "'Wear the right sports bra and you will be in a much better place'",
    "Djokovic criticises Norrie after body hit",
    "'I've never seen anyone work harder' - new show follows McGregor",
    "Ashes will be 'red-hot contest' - Winfield-Hill",
    "Edwards moves to number one in Bellator rankings",
    "Kane representatives meet PSG - Wednesday's gossip",
    "Who will survive Premier League relegation?",
    "'Archer's latest injury is the cruellest of blows'",
    "Who is 'never flustered'? Garth's Team of the Week",
    "US PGA Championship tee-times for first two rounds",
    "The remarkable reinvention of India legend Dhoni at 41",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "A secret that couldn't be contained - the inside story of Ferguson's exit",
    "A tour of a lost world, before football changed forever",
    "The two-inch error that stopped an Olympic final",
    "The Ironman unbroken by a bomb",
    "My legacy is exceptional - Guardiola. VideoMy legacy is exceptional - Guardiola",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "All about the PGA Championship 2023. AudioAll about the PGA Championship 2023",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Kaizer Chiefs coach cut by shield in fan trouble",
    "Once banned, boxing now thrives in this former warzone",
    "Onana clean sheet sees Inter to European showpiece",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]