[
    "Man City beat Man Utd to win FA Cup with Gundogan double",
    "England break Ireland spirit to record big win",
    "The schools where tomorrow’s stars walk the corridors",
    "Celtic overcome Inverness to complete treble",
    "Hamilton and Alonso rue Spanish qualifying errors",
    "Real Madrid and Hazard agree to end deal early",
    "Barcelona come from 2-0 down to win second Champions League title",
    "Gundogan once again the man for the big moments",
    "Tongue and Bairstow in England Ashes squad",
    "Swiatek through with 51-minute 'double bagel' in Paris",
    "Man Utd optimistic about Mount deal",
    "Stokes 'on course' to bowl in first Ashes Test",
    "I am playing to raise money for Ukraine - Tsurenko",
    "Auguste Rodin wins Derby as Dettori misses out",
    "Nadal out for five more months after surgery",
    "Bordeaux-Rodez abandoned after fan attacks player",
    "Champion Shields ready for 'throw-down in Motown'",
    "Ex-Fenerbahce boss Bulut named Cardiff manager",
    "Verstappen on Spanish pole after dramatic qualifying",
    "Barca close in on Gundogan deal - Saturday's gossip",
    "Rune has 'dreams' of lifting French Open trophy",
    "Leao signs new long-term deal with AC Milan",
    "London Irish served winding-up petition by HMRC",
    "Bautista continues World Superbikes domination",
    "McIlroy back into contention at Memorial Tournament",
    "From body dysmorphia and backyard brawls to UFC",
    "Kipyegon breaks 1500m world record with Muir second",
    "Blue v Red: The battle for Manchester",
    "Djokovic through in Paris with 'long' injury list",
    "Spain great Ramos to leave PSG this summer",
    "The girl in the Gang - being Wimbledon's physio",
    "From shy genius to 'bad boy' leader – Messi’s Qatar transformation",
    "Hooked on risk - gambling's grip on elite sport",
    "'Mikel was born a manager' - the nature and nurture of Arteta",
    "'When the cops pull you over, be super nice'",
    "'It began with an earthquake and a 5-0 loss - then things got worse'",
    "'War' in Milan - an abandoned game, an eternal image",
    "Man Utd's Ten Hag on 'special' FA Cup final. VideoMan Utd's Ten Hag on 'special' FA Cup final",
    "Discover: The BBC's best sports podcasts. AudioDiscover: The BBC's best sports podcasts",
    "Stumped podcast: Is Dhoni the IPL's Tom Brady? AudioStumped podcast: Is Dhoni the IPL's Tom Brady?",
    "Sporting highlights to look forward to in 2023",
    "Where and how to watch BBC World News",
    "Premier League top stories",
    "Find out more about our BBC Sport app",
    "African sport from BBC Africa",
    "Are Al Ahly Africa's version of Real Madrid?",
    "Former Olympic champion Cissé focused on Paris",
    "Newcastle close to signing Odense winger Minteh",
    "Get Personalised Newsletters",
    "Read about our approach to external linking."
]