[
    "Lawyer cites fake cases invented by ChatGPT, judge is not amused",
    "ChatGPT: US lawyer admits using AI for case research",
    "A lawyer used ChatGPT and now has to answer for its ‘bogus’ citations",
    "A lawyer used ChatGPT for legal filing. The chatbot cited nonexistent cases it just made up",
    "Mata v. Avianca, Inc. (1:22-cv-01461)",
    "A Lawyer's Filing “Is Replete with Citations to Non-Existent Cases”—Thanks, ChatGPT?",
    "A lawyer faces sanctions after he used ChatGPT to write a brief riddled with fake citations",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "A lawyer used ChatGPT for legal research, but later found the chatbot created fake cases",
    "Lawyer faces punishment after ChatGPT gave him fake cases to cite on a court-submitted brief",
    "US lawyer penalised for using ChatGPT: Here's why",
    "Lawyer Uses ChatGPT In Federal Court And It Goes Horribly Wrong",
    "ChatGPT's Erroneous Legal Citations Land Lawyer in Trouble",
    "Lawyer ‘Greatly Regrets’ Relying on ChatGPT After Filing Motion Citing Six Non-Existent Cases",
    "@kendraserra@dair-community.social",
    "Now imagine it being used to as a “clinical co-pilot” as promoted https://twitter.com/...",
    "AI will make idiots dumber. https://twitter.com/...",
    "grabbed the funniest bit of that legal case where someone used ChatGPT to write a brief [image]",
    "Dolphin on Steam Indefinitely Postponed",
    "Nintendo has blocked the Steam version of GameCube and Wii emulator Dolphin",
    "Nintendo targets Steam with fresh DMCA strike to remove Dolphin Emulator",
    "Nintendo has blocked the Steam release of Wii emulator Dolphin",
    "Dolphin Emulator release on Steam is “indefinitely postponed”",
    "Dolphin Emulator Steam listing removed following Nintendo DMCA",
    "Nintendo filed a DMCA notice against Dolphin emulator's release on Steam",
    "Dolphin Emulator Steam Release ‘Indefinitely Postponed’ After Cease and Desist From Nintendo",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Buzzkill Nintendo Slams Valve With DMCA Takedown Over Dolphin Wii Emulator",
    "Nintendo Hits Valve With Steam DMCA Takedown Notice",
    "Nintendo Blocks Release of Dolphin Emulator on Steam",
    "Dolphin emulator's Steam launch blocked by Nintendo DMCA notice to Valve",
    "Nintendo serves Valve a takedown notice to remove an emulator from Steam",
    "Nintendo Sends DMCA to Wii/Game Cube Emulator Dolphin Ahead of Steam Launch",
    "Wii emulator Dolphin hit with DMCA notice by Nintendo to block Steam launch",
    "Nintendo Sends Valve DMCA Notice Over Wii Emulator Listing On Steam",
    "Dolphin Emulator Steam release Indefinitely Postponed due to Nintendo DMCA",
    "Quest 3 hands-on confirms Meta's building a ‘far thinner and lighter’ headset",
    "Meta's Quest 3 VR Headset: A Potential Challenger to Apple's Mixed Reality Throne",
    "iPhone 16 Pro screen sizes will be the largest ever, says analyst",
    "Hands-on with Quest 3 headset shows Meta's going all in on mixed reality",
    "Meta's Quest 3 headset could feature color cameras for more lifelike pass-through video",
    "Apple to make changes to iPhone 16 Pro to compete better with Samsung, report says",
    "Gurman: WWDC 2023 to be hardware-focused with less emphasis on new software features",
    "iPhone 16 Pro screen sizes tipped for growth once again",
    "Gurman Corroborates iPhone 16 Pro Display Size Increase Rumor",
    "iPhone 16 Pro Models Again Reported to Feature Bigger 6.3-inch and 6.7-Inch Display Sizes",
    "Meta Quest 3 compared to Apple “Reality” and Quest 2 headsets in new hands-on leak",
    "WWDC 2017 vibes. https://twitter.com/...",
    "Temu Takes on Heavy Losses to Win U.S. Customers",
    "@chockenberry@mastodon.social",
    "Third-party Twitter apps historically accounted for 17% of all engagement, former exec says",
    "Texas Monthly Profiles Tapbots Founders Paul Haddad and Mark Jardine",
    "US 'won't tolerate' China's ban on Micron chips, commerce secretary says",
    "U.S. sends clear message on China's ban of Micron chips",
    "U.S. 'won't tolerate' China's ban on Micron chips-Raimondo",
    "Funny watching the US throw its toys out of the pram. https://www.bnnbloomberg.ca/ ... [image]",
    "what happens when US bans $NVDA and $AMD from selling to china? https://twitter.com/...",
    "China claims semiconductor consensus with South Korea, while Seoul stays quiet",
    "Samsung's $230bn chip hub draws top equipment makers to Seoul area",
    "U.S. 'won't tolerate' China's ban on Micron chips, Raimondo says",
    "Will Apple's Reality Pro signal the beginning of the immersive internet?",
    "I don't think Apple's Reality Pro ambitions are rooted in reality",
    "At WWDC, Apple will lay out the blueprint for mixed-reality ‘killer apps’",
    "Display Supply Chain Consultants",
    "Biannual Augmented and Virtual Reality Display Technologies and Market Report",
    "Inside Apple's secret Zurich Vision Lab",
    "Apple's Mixed Reality Headset - What To Expect",
    "Apple's Mixed-Reality Headset Is Still Virtual. Here's What We May Know About It.",
    "Apple has been openly building technology for its new mixed reality headset for years",
    "Blur Dominates 82% of the NFT Lending Market",
    "Blend's Unprecedented Surge: Dominating 82% of the NFT Lending Market in 22 Days",
    "New Crypto Protocol Captures More Than 80% of the NFT Lending Market in Just One Month: DappRadar",
    "More NFT Holders On Blur Are Taking Loans, Not Trading",
    "Free compensation benchmarking data from 3,000 startups",
    "Elon Musk And Ron DeSantis Prove That Twitter Spaces Is Kind Of A Joke",
    "Twitter Space team narrowed down from 100 to roughly three employees",
    "The GOP girlies are fighting",
    "Platformer: 'Inside Twitter's Failed Space Launch'",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "(IHP) The History Of Google Parts 1 And 2",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Information for Japan Resident Customers of Binance.com About Transition to the New Local Platform",
    "Binance launches compliant platform for users in Japan",
    "Binance begins transition to new platform for Japan",
    "Binance makes return into Japan under a new subsidiary",
    "Binance kicks off transition to new platform in Japan",
    "Breaking: Binance To Suspend Crypto Services For Japan By November 30 | Coingape",
    "AI boom drives gains for chip stocks",
    "BigTech is Dead. Long Live #BigTech https://twitter.com/...",
    "How could Google have ever allowed this to be sold, even for a second? https://www.bbc.com/...",
    "Portugal considers banning Huawei from national 5G networks",
    "Portugal Effectively Bans Chinese Companies From 5G Network",
    "Huawei to build first 5.5G city with 10G ultra large bandwidth",
    "Office of the Arizona Attorney General",
    "Avid Telecom sued by multistate task force for making billions of unauthorized robocalls",
    "Case 4:23-cv-00233-EJM  —  INTRODUCTION 19.  Every day, millions of American consumers receive …",
    "Forty-eight states sue Avid Telecom over robocalls",
    "48 states sue phone company that allegedly catered to needs of robocallers",
    "Company Behind Billions of Robocalls Is Being Sued by Nearly Every State",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Billions of Robocalls and Alleged Scams Gets Telecom Sued by 48 States",
    "Nearly 50 state AGs sue company that allegedly facilitated billions of spam calls",
    "Australian Financial Review",
    "How chipmaker Nvidia struck AI gold",
    "Silicon Valley Business Journal",
    "5 questions for Ampere CEO Renee James",
    "Azure Linux released at Build - where Microsoft revealed why it did not fork Fedora",
    "Introducing the Azure Linux container host for AKS",
    "Update Regarding Shipment Zero"
]