[
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple strikes ‘multibillion-dollar’ deal with Broadcom for 5G parts",
    "Apple inks multibillion-dollar chip deal with Broadcom",
    "Apple boosts its commitment to US manufacturing with a massive Broadcom deal worth billions",
    "Apple signs multi-billion-dollar 5G deal with Broadcom",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple Strikes Multibillion-Dollar Supply Deal With Broadcom",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple in multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple signs deal with Broadcom to ‘deepen investments in the U.S. economy’",
    "Apple strikes big deal with Broadcom for US-made 5G components",
    "Apple inks multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple inks multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple multibillion-dollar Broadcom deal seems mostly for 5G",
    "Apple announces multibillion-dollar Broadcom deal amid rumors of in-house 5G iPhone radio",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple, Broadcom Announce Multibillion-Dollar Deal for Components Made in USA",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "How Meta's Acquisition of Giphy Went South",
    "Shutterstock picks up Giphy for $53 million after UK blocks Meta's acquisition",
    "Shutterstock to Buy Meta's Giphy for $53 Million on UK Antitrust Order",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta sells Giphy to Shutterstock for $53 million to comply with UK regulator order",
    "Meta sells Giphy at a $347m loss to comply with UK regulator",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "Meta Sells Giphy to Shutterstock in $53 Million Deal",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Shutterstock to Acquire GIPHY, the World's Largest GIF Library and Search Engine",
    "Shutterstock buys Giphy from Meta",
    "Shutterstock To Acquire Giphy In $53 Million Deal",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Feels like a steal https://www.reuters.com/...",
    "Anthropic secures $450M in Series C funding from Google, Salesforce and others",
    "AI start-up Anthropic raises $450mn from Google and Spark Capital",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "Anthropic pulls in another $450 million to build safe AI",
    "Ex-OpenAI execs raise $450 million for Anthropic, a rival A.I. venture backed by Google",
    "OpenAI Rival Anthropic Announces $450 Million Funding Round. Chatbot Claude to Be Deployed.",
    "Alphabet-backed AI startup Anthropic raises $450 million as funding freeze thaws",
    "QIA Leads $250-Mn Funding In British-Indian Entrepreneur's Builder.Ai",
    "Builder.ai keeps on building, now with a fresh $250+ million",
    "Microsoft-Backed Builder.ai Raises $250 Mn In Series D Funding Round Led BY QIA",
    "QIA Leads $250 Million Funding Round for App Platform Builder.ai",
    "London AI firm bags $250m injection led by Qatari sovereign wealth fund",
    "London-Based Startup Builder.ai Raises $250 Million",
    "Qatar Investment Authority leads $250m funding in AI startup Builder.ai",
    "Social Media and Youth Mental Health",
    "Surgeon General warns of social media's negative impact on kids' mental health",
    "US Surgeon General says social media may be hazardous to teen health",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "Surgeon general issues advisory about social media risks for kids",
    "8 Social Media Tips for Parents and Teens from the U.S. Surgeon General",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "Car seats and baby formula are regulated. Is social media next?",
    "Surgeon general issues urgent warning about kids and social media",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "Binance reportedly mixed customer funds with company revenue at a US bank",
    "Reports suggest Binance mixed customer and company funds",
    "Binance regularly commingled customer funds with corporate revenue in 2020 and 2021: Reuters",
    "Binance Exchange Allegedly Commingled Customer Funds and Company Revenue",
    "Breaking: Binance Exec Refuses Mixing Users Funds; Debunks Report",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "General Secretariat of the Council of the European Union",
    "@mattburgess@infosec.exchange",
    "A day of bad news for spyware makers",
    "Leaked EU files suggest Spain supports end-to-end encryption ban",
    "Spain Advocated for An All-Out Ban on End-to-End Encryption",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "Here's why Max's new $20-a-month 4K plan is worth it",
    "Max launches as HBO Max and Discovery+ mash-up with even more 4K",
    "How to Download Max App on Roku Devices if HBO Max Didn't Update Automatically",
    "Max Experiencing Launch Day Issues As Streaming Platform Switches From HBO Max",
    "Warner Bros Discovery relaunches HBO Max streamer as ‘Max’ in bid for broader audience",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Max makes its U.S. debut, giving subscribers 35K hours of content",
    "The rebranded HBO Max service launches today, new 4K tier announced",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Warner Bros. reveals Max: Rebranded HBO Max",
    "HBO Max become Max today, 4K content gets major boost.",
    "Here are Max's 220 movies and shows available in 4K at launch",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "why are all the streaming services blue now [image]",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "Adobe to integrate AI into Photoshop amid fears of job losses and mass faking of images",
    "Adobe brings Generative AI to Photoshop",
    "Adobe harnesses Firefly to bring new generative AI features to Photoshop",
    "These generative AI tools coming to Adobe Photoshop will blow your mind",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe is adding its Firefly AI into Photoshop later this year",
    "Adobe Photoshop just got even easier to use with Generative Fill AI edits",
    "Adobe integrates generative AI directly into Photoshop with new Firefly capabilities",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Adobe adds AI features to Photoshop with new Generative Fill feature",
    "Adobe Introduces AI Image Generator Firefly to Photoshop",
    "Photoshop just got a massive upgrade thanks to Adobe Firefly generative AI",
    "Photoshop Now Lets You Use Text to Edit Your Photos Thanks to New AI Tools",
    "Adobe just put generative AI into Photoshop — what you need to know",
    "Photoshop's New ‘Generative Fill’ Uses AI to Expand or Change Photos",
    "Photoshop powered by Firefly's generative AI",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Adobe Firefly turns Photoshop into effortless AI image generator",
    "Waymo and Uber partner to bring Waymo's autonomous driving technology to the Uber platform",
    "Uber To Offer Autonomous Rides Through Alphabet's Waymo",
    "Waymo robotaxis coming to Uber app with new partnership",
    "Waymo's self-driving cars will be available on Uber's app, starting in Phoenix",
    "Uber and Waymo fought in court over self-driving trucks. Now they're teaming up",
    "Waymo's Autonomous Vehicles Are Coming To Uber",
    "Waymo and Uber sign multi-year partnership to provide driverless rides and deliveries",
    "Waymo Partners With Rival Uber In Phoenix For Rides And Food",
    "Uber and Waymo team up to bring autonomous taxis to Phoenix. [ai] https://www.theverge.com/...",
    "A Waymo car stopping to do food delivery seems less than ideal: https://www.theverge.com/...",
    "CEO Sundar Pichai says Google cares deeply about responsible AI",
    "AI threatens Google and Amazon's future - How?",
    "Google boss Sundar Pichai warns AI is ‘too important not to regulate’",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "IOSCO: Crypto Regulators Should ‘Just Push Ahead’",
    "International watchdog launches consultation on crypto regulations",
    "Regulators Should Block Firms From ‘Combining’ Crypto Functions, Says IOSCO",
    "IOSCO Sets the Standard for Global Crypto Regulation",
    "Crypto Regulation Goes Global: Watchdog Presents Landmark Framework For Digital Markets",
    "International securities regulator proposes framework for crypto assets",
    "International securities watchdog IOSCO proposes first set of rules for crypto sector",
    "IOSCO proposes global standard for crypto regulation",
    "Global securities watchdog IOSCO call for crypto regulation standards",
    "IOSCO Urges Global Regulators to Accelerate and Strengthen Oversight of Crypto Markets",
    "FTX filings hint at reboot, OKX exchange picks Paris as hub",
    "International Securities Regulator IOSCO Proposes Policy Recommendations for Crypto",
    "IOSCO Presents Comprehensive Crypto Guidelines for Regulation",
    "Xi's Micron Ban Shows China's Limited Options to Hit Back at US",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "US District Court, District of Montana",
    "TikTok Sues Montana, Calling State Ban Unconstitutional",
    "TikTok sues Montana over new law banning the app",
    "TikTok sues to stop Montana from enforcing its “unconstitutional” ban",
    "TikTok sues Montana to block ban, citing First Amendment",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "What's Trending Today: TikTok Sues Montana, Denver Nuggets Sweep Lakers",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "TikTok Sues Montana After State Bans App",
    "TikTok sues Montana after state passes a law banning app",
    "TikTok sues Montana to reverse state's ban of the app",
    "Leave it to the feds: TikTok sues Montana",
    "Take that: TikTok sues Montana over law banning social media site",
    "TikTok sues Montana to block state-wide ban",
    "TikTok challenges the US state of Montana over ban of its app",
    "TikTok sues Montana in bid to overturn statewide app ban",
    "TikTok files lawsuit against Montana over download ban",
    "TikTok Inc. v. Austin Knudsen",
    "TikTok sues Montana over statewide ban",
    "TikTok Sues State of Montana",
    "TikTok sues US state of Montana over law banning its use",
    "Montana TikTokers Sue Over App Ban",
    "TikTok Sues Montana Over Ban, Cites First Amendment",
    "TikTok sues Montana after state became first to ban its app",
    "International Business Times",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "Please, World, Please, Regulate AI. Oh, Come Now, You Silly Goose",
    "OpenAI calling for AI regulation is a solid step in no direction",
    "OpenAI's Altman Wants International Body Akin To Nuclear Watchdog IAEA To Regulate AI",
    "ChatGPT's parent OpenAI wants humans to regulate AI, proposes a regulatory body",
    "Wangiri phone scam is reportedly back in Kenya",
    "a key feature of the IAEA is that China and Russia are members https://twitter.com/...",
    "The hype game becomes the regulatory capture game. https://openai.com/...",
    "“Open Source is great, as long as it doesn't exceed our latest released capability” 😂",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "Fire Max 11 is Amazon's largest and most powerful tablet yet",
    "Amazon launches its biggest tablet, the $230 Fire Max 11",
    "Amazon Announces Fire Max 11 Tablet With Fingerprint Sensor",
    "Amazon launches the Fire Max 11, its biggest and most powerful tablet ever",
    "Amazon Fire Max 11 is a powerful tablet with stunning display and affordable price",
    "Amazon Fire Max 11 is a $230 Android tablet with keyboard and stylus",
    "Amazon's new Fire Max 11 is its most powerful tablet yet",
    "The 6 best features of Amazon's new Fire Max 11, our biggest and most powerful tablet yet",
    "Amazon's Fire Max 11 wants to dominate the midrange Android tablet market",
    "Amazon's Fire Max 11 seeks to dominate the 11in budget-friendly tablet space",
    "Amazon's new $329 Fire Max 11 productivity bundle looks surprisingly promising",
    "Fire Max 11 Tablet: Amazon's Answer to the Google Pixel Tablet?",
    "Amazon's latest Fire tablet is a $230 Android-powered 2-in-1",
    "The Fire Max 11 Is Amazon's Largest Tablet Yet (and the First With Fingerprint Recognition)",
    "Amazon Launches the Fire Max 11, its Biggest and Most Powerful Tablet Yet",
    "Amazon announces its new Fire Max 11 tablet",
    "Amazon's Fire Max 11 debuts with companion keyboard case, stylus, and $230 price tag",
    "Amazon Fire Max 11 vs Fire HD 10: Amazon's biggest tablets compared",
    "Amazon Fire Max 11 is Amazon's biggest, fastest, (and priciest) tablet",
    "Who needs the Pixel Tablet? Amazon's new Fire Max 11 looks great",
    "reminder: the 11-inch Fire Max 11 is now Max https://twitter.com/...",
    "Good luck getting work done on Android 9 ! https://twitter.com/...",
    "The best TV streaming service 2023",
    "How Fake AI Photo of a Pentagon Blast Went Viral and Briefly Spooked Stocks",
    "‘Verified’ Twitter accounts share fake image of ‘explosion’ near Pentagon, causing confusion",
    "A tweet about a Pentagon explosion was fake.  It still went viral.",
    "Fake viral images of an explosion at the Pentagon were probably created by AI",
    "Fake Pentagon attack hoax shows perils of Twitter's paid verification",
    "Fake picture of explosion at Pentagon spooks Twitter",
    "Fake Image Of Explosion Near Pentagon Went Viral—Even Though It Never Happened",
    "AI photo of Pentagon explosion causes panic and stock market dip",
    "Pentagon Bomb Hoax Highlights Power of Artificial Intelligence - What Could It Mean For Crypto?",
    "No, the Pentagon Didn't Blow Up Monday",
    "‘Verified’ Twitter accounts push Pentagon explosion hoax",
    "Fake AI-generated image of explosion near Pentagon spreads on social media",
    "Large Explosion near The Pentagon Complex in Washington D.C. - Initial Report",
    "pay-to-\"verify\" blue checks... 🥴 https://twitter.com/...",
    "Elon Musk carefully enabled this ⤵️ https://twitter.com/...",
    "New Twitter is fraud-friendly https://twitter.com/...",
    "Ah yes, no-one saw this coming. https://www.vice.com/...",
    "Russian propaganda now running with this lie. https://twitter.com/...",
    "This election season is gonna be hell with AI-assisted disinformation. https://twitter.com/...",
    "BandLab Raises Another $25 Million, Now Valued at $425 Million",
    "TymeBank's parent company gets $77.8 million to drive its South African and Asian expansion plans",
    "Global digital banking group Tyme garners $77.8m, Tencent elevates stake",
    "Tyme Raises $77.8M in Series C Funding",
    "TymeBank sets its eyes on expansion following $77.8 million pre-Series C raise",
    "The first AI navigator for your entire network",
    "Google's AI-enabled flood forecasting goes global",
    "Bitcoin Jumps to Key Price Resistance as Hong Kong Opens Crypto Trading for Retail Investors",
    "New Crypto Rules Suggest Hong Kong Is ‘Testing Ground’ for China, Say Experts",
    "SFC finalises rules for retail cryptocurrency trading in Hong Kong from June 1",
    "Bitcoin climbs back above $27,000 after Hong Kong greenlights some retail crypto trading",
    "Hong Kong to open crypto to retail traders, plans guardrails",
    "Hong Kong's Security and Futures Commission (SFC) to open doors for crypto trading platforms",
    "Hong Kong greenlights retail trading of cryptocurrency",
    "Hong Kong's Crypto Revolution: A New Hub In The Making",
    "Breaking: Hong Kong Allows Retail Investors Trade Bitcoin, ETH, Other Crypto",
    "Hong Kong will not allow retail customers to trade stablecoins",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "The Dire Defect of ‘Multilingual’ AI Content Moderation",
    "MMS: Scaling Speech Technology to 1000+ languages",
    "Introducing speech-to-text, text-to-speech, and more for 1,100+ languages",
    "Preserving the World's Language Diversity Through AI",
    "Open-sourcing Massively Multilingual Speech to preserve language diversity: Meta",
    "Meta's open-source speech AI recognizes over 4,000 spoken languages",
    "Meta's Massively Multilingual Speech to Redefine Boundaries of Language",
    "Meta's open-source speech AI models support over 1,100 languages",
    "Meta's ChatGPT rival could make language barriers a thing of the past",
    "Meta's speech model can recognise over 4000 spoken languages: What this means",
    "1100 languages! And see where their speakers are concentrated https://twitter.com/... [image]",
    "We're open sourcing another new AI model today that we call Massively Multilingual Speech. …",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "TikTok: Inspire creativity and bring joy.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/22 - Meta Hit With Biggest Ever GDPR Fine",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Tech industry coalition launches Stop Scams UK to combat online fraud",
    "Big tech and banks conspire in new scheme to combat fraud",
    "Very confusing country where Schemes are Good but Scams must be Stopped. https://twitter.com/...",
    "Tesla (TSLA) shareholders show overwhelming support for Elon Musk despite controversies",
    "District Court Judge Tosses Shareholder Lawsuit against Musk over Twitter Buyout",
    "Exclusive: Reliance JioMart fires 1,000, a bigger layoff round likely",
    "JioMart layoff: Over 1,000 employees, including 500 executives, asked to resign; says report",
    "JioMart to lay off thousands to improve margins",
    "JioMart Fires 1,000 Employees, More Layoffs Likely",
    "Reliance JioMart cuts 1,000 jobs and to eliminate thousands more, report says",
    "Yelp Jumps Most Since August on Report Activist Urges Sale",
    "Activist Investor Calls on Yelp to Sell Itself",
    "India-based bus platform Chalo raises $57M",
    "Zoom Raises Annual Sales Forecast in Sign Pandemic-Era Customers Here to Stay",
    "Zoom lifts annual forecasts even as growth slows from pandemic peaks",
    "Twitter Bug Sees Deleted Tweets Restored for Some Users",
    "Twitter Bug is Reviving Deleted Tweets Automatically For Some Users",
    "Twitter brings up people's deleted past as another weird bug hits the platform",
    "A Twitter Bug Is Restoring ‘Deleted’ Tweets and Retweets",
    "Everything is going well here at twitter dot com. https://www.theverge.com/...",
    "lol lmao good luck in EU courts Elon https://twitter.com/...",
    "Oh crap! Thanks to @jjvincent for the reporting on this. https://www.theverge.com/...",
    "How soon before our DM end up in our public timeline? https://artifact.news/...",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden picks new FCC nominee to fill seat that's been empty for over two years",
    "Biden FCC nominee Anna Gomez gets initial industry support",
    "Comcast Statement on FCC Nomination and Renominations",
    "President Biden nominates a fresh face to break FCC deadlock",
    "WhatsApp Introduces Message Editing Features and Tests Text-Based AI Tools",
    "Now You Can Edit Your WhatsApp Messages",
    "WhatsApp to allow users to edit messages ... but only for 15 minutes",
    "The Morning After: WhatsApp finally lets you fix your message typos",
    "WhatsApp will now let you edit messages. But there's a catch",
    "Wish you could tweak that text? WhatsApp is letting users edit messages",
    "You can now edit that regrettable WhatsApp message — with one caveat",
    "WhatsApp users are getting another great messaging upgrade",
    "Can I edit a WhatsApp message? How the new edit feature works and when it is being released",
    "WhatsApp now allow you to edit sent messages",
    "WhatsApp Introduces Edit Message Feature to Avoid Sending Wrong Messages",
    "How to edit sent WhatsApp messages",
    "What's that? Oops ... WhatsApp allows users to reword texts",
    "WhatsApp chat typo can now be edited easily in 15 mins: Heres how",
    "How to edit messages in WhatsApp",
    "WhatsApp finally lets you edit messages, but you have to be fast",
    "How to edit sent messages on WhatsApp: Know process, time limit, and more",
    "WhatsApp's message editing feature now rolling out globally!",
    "WhatsApp will let you edit messages within a 15-minute window",
    "WhatsApp finally lets you edit sent messages",
    "Whatsapp message editing adds clarity to chats",
    "WhatsApp finally lets you edit sent messages. Here's how to do it",
    "WhatsApp to allow users to edit messages within 15 minutes",
    "Message Editing feature joins WhatsApp on Android, get it now!",
    "WhatsApp chat edit feature now rolling out, check how to use it",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "Why Stepn NFTs on iOS Are Worth the Extra Apple Tax",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Free Android and iOS Apps of the week",
    "Was Apple really the first with the ChatGPT app on iOS, iPhone?",
    "Stepn Integrates Apple Pay To Enable Direct NFTs Purchase",
    "Stepn launches in-app NFT marketplace with Apple Pay integration",
    "You Can Now Buy Stepn NFTs on iOS—But You'll Have to Pay the Apple Tax",
    "Apple Pivots Toward Greater Acceptance of Web3, Again",
    "STEPN Secures Landmark Integration With Apple, GMT Price Explodes Over 8%",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "European Data Protection Board",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Facebook hit with record €1.2 billion GDPR fine for transferring EU data to US",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "How Meta got caught in tensions between the US and EU",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Meta has a $11 billion reason not to leave the EU",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "Irish watchdog opposed €1.2bn Meta fine, saying it would have no ‘meaningful dissuasive effect’",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "EU hits Meta with record €1.2B privacy fine",
    "TechScape: Warnings of a ‘splinternet’ were greatly exaggerated - until now",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "EU regulators fine Meta $1.3 billion, but some say potential data losses could be even harsher",
    "European regulators signal they are fed up with Facebook",
    "Meta Penalized $1.3B by the Irish DPC for Illegal Data Transfers to the U.S.",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "EU Fines Meta Record €1.2bn; New Twitter CEO Reassures Top Ad Group",
    "How many billions can Meta's Facebook pay the EU? And does it even matter?",
    "Regulatory Agencies Slap Record $1.3 Billion Fine Against Meta Due to Data Transfers",
    "DPC fine should be a wake-up call for government",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Facebook to be fined £648m for mishandling user information",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes.",
    "Tornado Cash coin mixer's governance lets its guard down, loses control",
    "Tornado Cash Sanctions Key to Drop in Crypto Hacks Last Quarter: TRM Labs",
    "‘Not over yet’: Tornado Cash attack rages on with $1m in jeopardy"
]