[
    "@0x00string@infosec.exchange",
    "@JoeUchill@mastodon.social",
    "@santim@social.vivaldi.net",
    "@chrismessina@mastodon.xyz",
    "Google challenger Neeva gives up on consumer search, goes all in on AI and the enterprise",
    "Neeva, the would-be Google competitor, is shutting down its search engine",
    "Neeva shuts down its search engine to focus on AI products",
    "Google search rival Neeva is shutting down its search engine to work on AI products",
    "Neeva, The Ad-Free Search Engine, Announces Closure",
    "Neeva Shut Downs its Search Engine",
    "Neeva Shuts Down Search Engine Ahead of Snowflake Deal",
    "LLMs are a bigger opportunity for startups than search https://twitter.com/...",
    "Startup aims to steal Apple's AR thunder by launching the Spacetop augmented reality laptop",
    "Hidden crypto holdings turn divorce battles into high-stakes cases, attorneys warn",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "The esports world is starting to teeter",
    "Reported offers for TSM's LCS slot fall well short of league's record sale price",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Private debt delivers calm waters in storm of volatility",
    "Personalized wealth management, built for tech people",
    "G7 Hiroshima Leaders' Communiqué",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 leaders unite to regulate generative AI globally under the ‘Hiroshima Process’",
    "G7 countries call to have global technical standards for AI",
    "G7 calls on China to pressure Russia to end Ukraine war",
    "G7 calls for ‘responsible’ use of generative AI",
    "FBI misused surveillance tool on Jan. 6 suspects, BLM arrestees and others",
    "FBI misused intelligence database in 278,000 searches, court says",
    "The FBI Broke The Law Over 278,000 Times With Illegal Searches On Americans",
    "FBI issued 278,000 improper searches in 2021: filings",
    "FBI Searched Jan. 6 Rioters and George Floyd Demonstrators in Spy Database",
    "POV: The FBI will keep abusing personal data until we end Section 702",
    "FBI repeatedly misused surveillance tool, unsealed FISA order reveals",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Clear Street: Today's financial infrastructure.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "(BNS) @BradyDale On SBF, FTX, All The Stuff",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco"
]