[
    "Bard is getting better at logic and reasoning",
    "Google brings superior logic and reasoning skills to its chatbot Bard",
    "Google takes Bard to summer school with new math and coding smarts",
    "Google Enhances Bard's Reasoning Skills",
    "Bard update improves reasoning skills, enables Google Sheets export function",
    "Google Bard Improved with Implicit Code Execution, Sheets Export",
    "Google's AI Chatbot, Bard, Advances its Logical and Mathematical Capabilities",
    "I just used Google Bard's new AI Sheets feature and it's a serious time saver",
    "The Google Bard chatbot is getting better at math and also can import tables to Sheets",
    "Google Bard update improved math and data analysis and Google Sheets exports",
    "Bard gets Google Sheets export, improved logic and reasoning skills",
    "Google's Bard AI is getting better at programming",
    "the 8-month tweet-to-google-release R&D pipeline [image]",
    "Branded Content Guidelines",
    "Twitch reverses overlaid stream sponsor ban after mass creator backlash [Updated]",
    "Twitch rolls back controversial ad guidelines after outcry from creators",
    "Twitch backtracks on branded content changes after streamer backlash",
    "Streamer outrage forces Twitch to drop planned changes to branded ad rules",
    "Twitch Nixes Branded-Content Rule Changes After Backlash",
    "Twitch Abandons Bad Ad Changes After Streamer Freak Out",
    "Twitch has removed their new ad guidelines after streamers threatened to leave platform",
    "Twitch ‘immediately removing’ controversial branded content guidelines within 24 hours",
    "Twitch Is Shafting Streamers, Again",
    "You can read our updated Branded Content Policy here: https://help.twitch.tv/...",
    "This company confuses me https://twitter.com/...",
    "Amazon Prime Video is reportedly planning an ad-supported tier",
    "Amazon plans to add an ad-supported tier to Prime Video",
    "The Real CNN Drama is Cable News' Growing Irrelevance",
    "Amazon Prime Video Planning To Join Ad-Supported Wave",
    "Asia Markets Set to Slide Further as Wall Street Pauses Market Rally",
    "Amazon is considering an ad-supported tier for Prime Video",
    "Breaking: Amazon Reportedly Planning to Launch Ad-Supported Prime Video Tier",
    "Amazon to Launch Prime Video Plan With Ads, Report Says",
    "Amazon is mulling an ad-supported Prime Video tier",
    "Amazon Prime Video is reportedly working on an ad supported tier",
    "Amazon reportedly plans ad-tier for Prime Video streaming service",
    "Amazon Reportedly Plots Ad-Supported Tier For Prime Video",
    "Amazon reportedly considering ad-supported tier for Prime Video",
    "Amazon is reportedly planning an ad-supported tier for Prime Video",
    "Prime Video Planning Ad Tier, Report Says",
    "Amazon is reportedly working on cheaper Prime Video with ads — what we know so far",
    "Amazon is reportedly planning to launch an ad-supported tier on Prime Video",
    "How to cancel Amazon Prime Video channel and app subscriptions",
    "Report: Amazon Considering Ad-Supported Tier for Prime Video",
    "Report: Amazon may bring ad-supported tier to Prime Video",
    "Amazon to Launch Ad-Supported Tier for Prime Video: Report",
    "Every streaming network be like “what if we invented... television” https://twitter.com/...",
    "Everything is an ad network. https://www.wsj.com/...",
    "Stanford Cyber Policy Center",
    "Addressing the distribution of illicit sexual content by minors online",
    "Meta vows to take action after report found Instagram's algorithm promoted pedophilia content",
    "Meta taskforce to combat trade of child sex abuse materials after damning report",
    "New Report Suggests Instagram Has Become a Key Facilitator of Pedophile Networks",
    "Meta under fire for Instagram's recommendation algorithms promoting pedophile networks",
    "Instagram's Algorithms Are Promoting Accounts That Share Child Sex Abuse Content, Researchers Find",
    "Instagram's Vulnerability: A Breeding Ground for Pedophilia Networks",
    "Instagram's Algorithm Promotes and Connects ‘Vast’ Network of Pedophiles",
    "Meta starts task force in fight against child pornography on Instagram",
    "Meta is setting up a taskforce after Instagram was found to guide users to child-sex context",
    "Instagram algorithm boosted ‘vast pedophile network,’ alarming report claims",
    "The negative externalities of bigness https://www.wsj.com/...",
    "Congress must conduct serious oversight and protect our children at all costs.",
    "Well this seems terrible https://www.wsj.com/...",
    "Instagram Connects Vast Pedophile Network $META https://www.wsj.com/...",
    "Apple previews new features coming to Apple services this fall",
    "Apple Podcasts has a slightly refreshed interface in iOS 17",
    "iOS 17: How to download and use offline maps with Apple Maps",
    "WWDC: 25+ new Apple Services features coming this fall",
    "iOS 17 will connect your content subscriptions from apps to Apple Podcasts for exclusive benefits",
    "More features are coming to Apple devices alongside iOS 17",
    "Apple adding new Apple Music Collaborative Playlists with iOS 17",
    "Apple highlights new services features coming later this year",
    "These are all the features coming to Apple services this fall",
    "Apple Highlights the Best New Features Coming to its Services",
    "Apple Highlights New Features Coming to Apple Services This Fall",
    "Apple to expand how digital IDs can be used this fall",
    "Apple Announces Businesses Can Accept iPhone IDs Later This Year",
    "iOS 17 will add support for recurring payments to Apple Cash",
    "Some projects I've worked on are coming soon 🥹 https://www.apple.com/...",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Google Cloud Collaborates with Mayo Clinic to Transform Healthcare with Generative AI",
    "Google Cloud and Mayo Clinic to explore uses of generative AI in healthcare",
    "Google Cloud, Mayo Clinic Strike Generative AI Partnership",
    "Mayo Clinic, Google Cloud partner on generative AI to power enterprise search",
    "Google Cloud and Mayo Clinic to boost healthcare efficiency with genAI",
    "Use AI to regulate AI, Google executive says",
    "Google and Mayo Clinic Partner to Infuse AI Into Health Care",
    "Mayo Clinic to Deploy Google Cloud's Generative AI Capabilities",
    "Google Cloud, Mayo Clinic make generative AI play",
    "Google Cloud teams with Mayo Clinic on generative AI effort",
    "Google Cloud lays out generative AI partnerships, Mayo Clinic deal, customer wins",
    "Google, Mayo Clinic Launch Generative Artificial Intelligence Collab",
    "Google Cloud and Mayo Clinic Developing Generative AI for Healthcare",
    "Binance.US Customers Withdrawing Crypto in Aftermath of SEC Lawsuit",
    "SEC's probe on Binance.US was initiated in 2020, recent court filings reveal",
    "SEC seeks emergency freeze of Binance assets, accusing the exchange of commingling customer funds",
    "United States District Court for the District of Columbia",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Seeks Emergency Relief to Ensure Binance.US Customers' Assets are Protected",
    "SEC granted emergency restraining order to freeze, repatriate Binance.US assets",
    "Elusive Ex-Binance.US CEO Catherine Coley Reemerges in SEC Suit",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "Binance US Delists 101 Trading Pairs Following SEC Freezing Order",
    "Pro-XRP Lawyer Predicts More Trouble For Binance, Potential DOJ Criminal Charges",
    "Binance.US addresses SEC motion amid assets freeze concerns",
    "Binance CEO's trading firm received $11 bln via client deposit company, SEC says",
    "Binance.US To Remove Over 100 Trading Pairs by Thursday Days After SEC Charges",
    "Binance.US Pulls Several Trading Pairs in Wake of SEC Lawsuit",
    "SEC Accuses Binance.US, CZ of Billion-Dollar Investor Fund Risk",
    "SEC seeks freeze on Binance.US assets amid claims",
    "SEC Files Emergency Action Application To Freeze Binance.US Assets",
    "CZ Charges: Will DoJ Charge Binance Chief Changpeng Zhao With Fraud, Other Offences?",
    "Binance.US Says SEC Lawsuit Is Unjustified",
    "SEC Files Motion To Freeze Assets Of Two Binance.US Units",
    "Bitcoin Trades for a Premium on Binance.US Amidst SEC Lawsuit",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "SEC files motion for restraining order to freeze Binance US assets",
    "[DB] SEC Seeks Temporary Restraining Order to Freeze Binance US Assets: Court Filing",
    "OMG OMG OMG OMG OMG [image]",
    "Her name was Catherine Coley",
    "🤔 I wonder if Catherine Coley was an informant? https://www.cnbc.com/...",
    "All users outside of the USA unaffected then 👍🏻 https://twitter.com/...",
    "Withdraw from Binance US if you have any funds on the platform. https://twitter.com/...",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "Reddit users, subreddits going dark next week over third-party app access",
    "Reddit now says it will allow free API access for developers of accessibility apps",
    "Reddit to cut five percent of staff and faces user backlash over API fees",
    "Reddit Blackout Planned In Protest Of API Fee Change, What You Need To Know",
    "Reddit relents, makes first concession in its plans to impair third-party apps",
    "Reddit says some accessibility apps won't have to pay for its API",
    "Reddit insists on being “fairly paid” amid API price protest plans, layoffs",
    "The 12 best third-party Reddit apps for your phone or tablet",
    "Apple's new Proton-like tool can run Windows games on a Mac",
    "Apple hid something AMAZING for Mac gaming at WWDC",
    "Apple's new toolkit makes it easier for developers to bring Windows games to Mac",
    "Wine comes to macOS: Apple's Game Porting Toolkit powered by CrossOver source code",
    "Unleashing the Gaming Revolution: CrossOver Mac's DirectX 12 Support Update!",
    "Apple introduces Proton-like emulation for Windows games on Macs",
    "Play More Windows Games on Mac with Apple's New Toolkit [VIDEO]",
    "Apple's Game Porting Toolkit could be a revolution for Mac gaming — here's the proof",
    "Apple Makes Developer Betas Free for All",
    "Apple Has A Proton-Like Tool To Test Windows Games On MacOS",
    "Cyberpunk 2077, Diablo IV, and more can run on a Mac thanks to this new toolkit",
    "CrossOver announces DirectX 12 support coming to macOS this summer",
    "CyberPunk 2077 is now (unofficially) on Mac thanks to the new macOS Sonoma port tool",
    "Apple unveils new Game Porting Toolkit that runs Windows games on Mac",
    "Apple simplifies porting Windows games to Mac",
    "Apple is stealing a trick from the Steam Deck for macOS gaming",
    "Apple's Game Porting Toolkit Can Run DirectX 12 Games on macOS",
    "Windows games can run on Mac thanks to Apple's Proton-like Game Porting Toolkit",
    "New DirectX 12-to-Metal translation could bring a world of Windows games to macOS",
    "Mac Gaming to Gain DirectX 12 Support via CrossOver 23",
    "GameStop Fires Its CEO, Names Ryan Cohen Executive Chairman",
    "GameStop Removes CEO and Elects Ryan Cohen Executive Chairman",
    "GameStop Shares Fall as It Terminates CEO and Ryan Cohen Becomes Executive Chairman",
    "GameStop fires CEO, names Ryan Cohen executive chairman",
    "GameStop Discloses First Quarter 2023 Results",
    "GameStop Announces Election of Ryan Cohen as Executive Chairman",
    "GameStop Fires CEO Who Oversaw Retailer's NFT Push",
    "GameStop Fires CEO As Meme Stock Plummets",
    "GameStop Fires Its CEO After Two Years",
    "GameStop fires CEO, names Ryan Cohen exec chair",
    "GameStop shares plummet after firing CEO: ‘Like Elon Musk running Twitter’",
    "GameStop Just Fired Its CEO and Named Ryan Cohen Executive Chairman",
    "Lionel Messi to join MLS side Inter Miami after PSG departure",
    "Lionel Messi to join Inter Miami after leaving PSG",
    "Messi Moving to Miami Crowns Beckham's Longshot Bet on US Soccer",
    "Lionel Messi will take soccer in United States to even greater level: ‘Bigger’ than Pele",
    "Lionel Messi says he plans to join Inter Miami, giving MLS a priceless boost",
    "Lionel Messi's Potential MLS Deal Includes Revenue from Apple TV+",
    "Lionel Messi says he will join Major League Soccer's Inter Miami",
    "Messi in Miami is huge for Apple and MLS Season Pass",
    "MLS, Inter Miami Reportedly in Talks to Sign Lionel Messi",
    "Lionel Messi May Receive Cut of Apple TV's MLS Season Pass Revenue",
    "Apple & MLS close deal to bring Lionel Messi to Inter Miami",
    "Lionel Messi Confirms Plan To Join Inter Miami In MLS, Bringing Soccer's GOAT To U.S.",
    "Messi's move to MLS is a big deal for Apple",
    "Lionel Messi Agrees To Join Inter Miami: Reports",
    "Lionel Messi Docuseries Gets Green Light At Apple TV+",
    "Barcelona Paris Saint-Germain Argentina Apple TV+",
    "Messi has decided. His destination: Inter Miami Leo Messi se va al Inter Miami",
    "@mgsiegler Vision Pro custom-camera broadcasts make the economics feel...more interesting.",
    "they're so funny for this [image]",
    "MLS broadcaster Apple TV tweeted about Messi to Miami before deleting the tweet. [image]",
    "so this is what swayed his decision https://twitter.com/...",
    "MLS, Apple, and Adidas preparing the Messi deal https://twitter.com/... [image]",
    "Lionel Messi is to Apple TV as Hulk Hogan was to Time Warner https://twitter.com/...",
    "Apple's ‘Services’ narrative is moving in some wild directions... ⚽️📺🍎 https://twitter.com/...",
    "Is Messi the US soccer moment we've been waiting for https://twitter.com/...",
    "Someone from Apple watched Air https://twitter.com/...",
    "Haven't bought a pass before but likely will to watch him play https://twitter.com/...",
    "SK hynix Begins Mass Production of Industry's Highest 238-Layer 4D NAND",
    "SK hynix Commences Mass Production of 238-Layer 3D NAND, Up To 50% Faster Data Transfers",
    "Meta to introduce new accounts centre after talks -German cartel office",
    "Germany welcomes Meta plan for ‘more transparent’ data use",
    "Meta to finally allow users to turn off cross-site tracking",
    "Meta to give users more control over data following German antitrust order",
    "First on CNN: Pornhub asks users and Big Tech for help as states adopt age verification laws",
    "Payrails on Track to Expand After Raising $14.4 Million",
    "Payrails Raises $14.4M in Seed Funding",
    "Payrails scales FinOps with $14.4m funding led by EQT Ventures",
    "Minecraft officially launches for Chromebooks",
    "Minecraft for Chromebook FAQ",
    "Minecraft hits general availability on Chromebooks",
    "Microsoft Minecraft comes to Chromebooks",
    "Minecraft: Trails and Tales update is live, along with official Chromebook support",
    "Minecraft is Now Officially Available on Chromebooks",
    "Minecraft For Chromebooks Exits Early Access - Here Are The Machines It'll Run On",
    "How to install and play Minecraft on your Chromebook",
    "Chromebooks can now run Minecraft natively, and this is great news",
    "The best Chromebooks for students (and how to choose the right one)",
    "Minecraft arrives on the Play Store for all Chromebook users",
    "Build the world of your dreams: Minecraft officially launches on Chromebooks",
    "Minecraft for Chromebooks officially launches",
    "Minecraft Leaves Early Access, Fully Launches on Chromebooks",
    "Minecraft for Chromebook has finally arrived",
    "Minecraft now available natively on Chromebooks",
    "Minecraft: Bedrock Edition is Now Officially Available for Chromebooks",
    "Minecraft is releasing a new version for Chromebooks",
    "Minecraft is now available on Chromebook",
    "Free compensation benchmarking data from 3,000 startups",
    "WordPress has a new AI tool that will write blog posts for you",
    "Introducing Jetpack AI Assistant in WordPress.com",
    "Meet Your New Creative Writing Partner — The Jetpack AI Assistant",
    "WordPress Is Launching an AI Writing Assistant",
    "I hate WordPress' new generative AI tool - and you should too",
    "Wordpress' New AI Lets You Blog Without Actually Blogging",
    "WordPress is getting an AI assistant that will write blog posts for you",
    "WordPress's New AI Tool Can Write Entire Blog Posts For You",
    "WordPress gets an AI assistant that can write blog posts, correct grammar, translate content",
    "Digibee raises $60M to help companies integrate their software apps",
    "Digibee raises $60M led by Goldman Sachs, bringing total funding to $90M",
    "Digibee Raises $60M in Series B Funding",
    "SEC crypto crackdown: US regulator sues Binance and Coinbase",
    "Washington Isn't Falling for the Crypto Industry's Scam",
    "Will Recent US Crackdown On Crypto Affect Venture?",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "Attack of the 50 Foot Blockchain",
    "The SEC sues Coinbase. It's on.",
    "SEC lawsuits against Binance and Coinbase unify the crypto industry",
    "Binance and Coinbase Show Knives Out for Crypto",
    "‘Stand With Crypto’ NFT Spreads Across Crypto Twitter Amid SEC Crackdown",
    "Coinbase CEO Takes On SEC, Igniting Crypto Community's Passion for Clarity",
    "Bitcoin falls below US$27,000; Ether, all top 10 cryptos slide amid SEC lawsuit fallout",
    "‘Fundamental Difference’ Between SEC's Binance, Coinbase Suits",
    "Crypto industry unites as SEC targets Binance and Coinbase",
    "Breaking Down the SEC's Double Whammy",
    "Billionaire Mike Novogratz Predicts SEC Lawsuits Will Continue Ahead",
    "Binance and Coinbase CEOs lose billions over SEC suit",
    "No More Wild West: SEC Introduces New Era for Crypto",
    "Prices of Some Crypto Coins Drop After SEC Says They're Securities",
    "Crypto Crackdown: Coinbase and Binance Lawsuits Shake Markets",
    "Mark Cuban on Coinbase Crackdown: “No One Trusts” The SEC",
    "Can crypto survive in Biden's America?",
    "Explainer: -What makes a crypto asset a security in the U.S.?",
    "Why did the SEC let Coinbase go public?",
    "The SEC Says These Crypto Assets Are Securities: Their Reasoning Is Wrong",
    "SEC lawsuits against Coinbase and Binance could result in massive payday for lawyers",
    "Coinbase is being sued by the SEC",
    "Coinbase sued by SEC in New York Federal court",
    "Personalized wealth management, built for tech people",
    "Marketing strategies & tips for startups",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/07 - Maybe Apple DOES Want To Get Serious About Mac Gaming",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "TikTok seeks up to $20 bln in e-commerce business this year - Bloomberg News",
    "TikTok-Owner ByteDance Allowed China to Monitor Hong Protestors, Suit Charges",
    "Senators Ask TikTok CEO to Explain ‘Inaccurate’ Statements About How Company Manages U.S. Data",
    "TikTok Shop is struggling to catch on in the West, but it's a hit with some indie authors",
    "Announcing our $20m seed round to build the next generation of language models",
    "Bringing Context to Enterprise AI: Why We Invested in Contextual AI",
    "Contextual AI emerges from stealth with $20M to pursue ‘artificial specialized intelligence’",
    "Introducing Our Latest Investment: Contextual AI",
    "Contextual AI launches with $20M to build more reliable large language models for enterprises",
    "Introducing Blush, the AI that Improves Romantic Intimacy and Gives Real-Life Dating a Boost",
    "The creators of Replika unveil a new AI dating app called Blush",
    "Replika's New AI App Is Like Tinder but With Sexy Chatbots",
    "CEO faces $15 million bill and prison time for counterfeit Cisco hardware scam",
    "Feds: Florida Man Pleads Guilty In Counterfeit Cisco Case",
    "Amazon Pay taps Affirm to be its first buy now, pay later player in the US",
    "Amazon Pay adds Affirm BNPL option",
    "Amazon Pay Adds Affirm, Providing Customers and Merchants with Another Flexible Payment Option",
    "Amazon Pay Adds Affirm's Buy Now, Pay Later Option",
    "Amazon Pay Adds Affirm's Pay-Over-Time Option",
    "Unlock new insights with Azure OpenAI Service for government",
    "Azure Government cloud gets access to OpenAI's generative AI models",
    "Microsoft unveils OpenAI service for government customers",
    "Microsoft will provide the US government agencies with OpenAI's GPT-4 AI model",
    "Microsoft Azure Government customers get secure generative AI API access",
    "The Defense Department Now Has GPT-4 Thanks to Microsoft",
    "Agent-based workflows and waterfall effects",
    "Microsoft Azure OpenAI Service now available for government customers",
    "OpenAI still not training GPT-5, Sam Altman says",
    "Microsoft to offer OpenAI's GPT models to government cloud customers",
    "Microsoft launches generative AI service for government agencies",
    "San Francisco Business Journal",
    "OpenAI's Sam Altman complained chip shortage ‘delaying’ ChatGPT plans: deleted post",
    "This Is How Sam Altman Works the Press and Congress. I Know From Experience.",
    "AI regulations should not apply to smaller startups: OpenAI CEO Sam Altman",
    "Tim Cook reveals he uses ChatGPT and comments on Apple's keen observation of the technology",
    "OpenAI Inc. CEO Sam Altman says company won't compete with its clients",
    "ChatGPT Maker OpenAI Is Staying Private So It Can Make ‘Strange’ Decisions",
    "Sequoia's decision to split China business likely to influence other companies",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "How US-China tensions shattered Sequoia's venture capital empire",
    "Sequoia Capital Announces Upcoming Split amid Growing Brand Confusion and Other Reasons",
    "@dannyjpalmer@infosec.exchange",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "StopRansomware: CL0P Ransomware Gang Exploits CVE-2023-34362 MOVEit Vulnerability",
    "Russian-speaking cyber gang claims credit for hack of BBC and British Airways employee data",
    "US cyber officials offer technical details associated with CL0P ransomware attacks",
    "Ransomware group Clop issues extortion notice to ‘hundreds’ of victims",
    "Hackers Issue ‘Ultimatum’ Over Payroll Data Breach",
    "Clop gang uses MOVEit vulnerability to target BBC, British Airways and Boots",
    "Ransomware gang exploits critical vulnerability in popular file transfer software",
    "Clop ransomware crew sets June extortion deadline for MOVEit victims",
    "Hackers Behind MOVEit Ransomware Attacks Issue Their Ultimatum",
    "Clop extortion gang gives MOVEit exploit victims one week to reach out",
    "Cl0p Cybercrime Gang Delivers Ultimatum After Payroll Breach",
    "BBC, British Airways, Novia Scotia among first big-name victims in global supply-chain hack",
    "@dangillmor@mastodon.social",
    "@metacurity@infosec.exchange",
    "Here's who Salesforce CEO Marc Benioff may have in mind as his successor",
    "Salesforce CEO Benioff shakes up executive team with new hires",
    "Tingo Group: Fake Farmers, Phones, and Financials—The Nigerian Empire That Isn't",
    "With its share price down 55%, Tingo Group will address Hinderburg research allegations today",
    "Fintech Tingo's shares slump as Hindenburg takes short position",
    "Tingo Group Refutes Malicious and Misleading Allegations in Hindenburg Research Report",
    "The Tingo Tangle: Hindenberg Research Alleges Fabricated Figures, An ‘Exceptionally Obvious Scam’",
    "US-Listed Nigerian ‘Agri-Fintech’ Firm Tingo Rocked By Allegations Of Brazen Fraud",
    "Shortseller Hindenburg Research calls Tingo Group an exceptionally obvious scam",
    "Hindenburg Research publishes investigation into fintech Tingo Group claiming financial fraud",
    "That @HindenburgRes report on tingo is devaststing",
    "The Eclectic Light Company",
    "macOS 14 Sonoma Will Support Macs as Early as 2018",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas",
    "Anyone Can Download the iOS 17 Developer Beta on the iPhone for Free. Here's How",
    "iOS 17 developer beta is open to anyone — here's how to download it now",
    "Apple Makes Developer Betas Free to Download and Install",
    "Apple makes Developer Beta updates free for all",
    "How to download the iPadOS 17 beta on your iPad right now",
    "Apple developer betas are now free",
    "How to install the free iOS 17 developer beta",
    "You don't need to pay $99 for a developer account to try iOS 17 or macOS 14 beta",
    "iOS 17, iPadOS 17 Developer Beta Available For Free For All",
    "Apple adds a free tier for its developer program",
    "How to run a macOS beta on Apple silicon",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "Whatever you do, don't download the iOS 17 developer beta - Apple made a huge mistake",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "How to get iOS 17 — Quick! You might get it for free",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "iOS 17 Developer Beta made available to all",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "iOS 17 beta is here, but only for developers",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple macOS Sonoma: Features, compatibility, more"
]