[
    "Opinion: If Threads work, it won't be because it toppled Twitter, but because it toppled Instagram",
    "Online News Act creates ‘moment of reckoning’ for publishers",
    "Meta will soon let you delete your Threads profile without nuking your Instagram account",
    "“Threads app is not for news and politics,” says Instagram CEO Adam Mosseri",
    "Meta Threads doesn't need the ‘negativity’ of hard news and politics, exec says",
    "Is Threads threatening Twitter's reign?",
    "Meta executive claims goal of Threads is to create a ‘less angry place,’ not replace Twitter",
    "Meta's ‘friendly’ Threads collides with unfriendly internet",
    "The Missing Threads Features Adam Mosseri Says Are ‘On The List’",
    "Meta's vision for Threads is more mega-mall than public square",
    "Threads: We Don't Need Hard News or Politics on Our Platform",
    "Meta examining allowing users to delete Threads ‘separately’ from Instagram",
    "Threads Is Working On A Chronological Feed",
    "Head of Instagram reveals what's coming to Threads",
    "Threads Is Breaking Download Records",
    "Threads will soon allow deleting your account separately from Instagram",
    "You can't delete your Threads account if you want to keep Instagram — here's why",
    "Threads is getting a following feed, but not for a while",
    "Threads Will Get a Chronological Feed Option Eventually",
    "good luck with that [embedded post]",
    "The Meta team is low-key roasting politics Twitter over on the other app [image]",
    "sad trombone.mp3 https://twitter.com/...",
    "That's up to the users, surely. https://twitter.com/...",
    "NPR quitting Twitter was a turning point in the story.  Now the news organization is on Threads.",
    "Threads isn't for news and politics, says Instagram's boss",
    "International Business Times",
    "San Francisco Business Journal",
    "Threads already has over 95 million posts",
    "Meta launches Android beta version for Threads, reaches 70 million users",
    "Meta launches Android beta for Threads after it amasses 70 million users",
    "Instagram Threads Hits 70 Million As Tech Stars Join Twitter Clone: Here's Who To Follow",
    "Twitter threatens legal action against Meta over its new rival app Threads",
    "Join Instagram Threads beta program on Play Store to test drive upcoming features",
    "Meta's Threads Might Be the Most Downloaded App on Launch Day in History: Analysts",
    "Instagram Head Says Meta 'Won't Encourage' News on Threads",
    "Elon Musk and Mark Zuckerberg's surprisingly long history of trying to outdo each other",
    "Meta Reports 70 Million Threads Sign-ups in First 2 Days",
    "Meta's new Threads social network reaches 70M users",
    "The Algorithmic Anti-Culture of Scale",
    "Threads poses rare threat to Twitter's political monopoly",
    "Threads is now up to 70 million users, which is “way beyond” Meta's expectations",
    "Mark Zuckerberg touts 70 million sign ups to Threads",
    "Twitter's Desktop App Sees Surge in Outages as Meta's Threads Takes Off",
    "Meta's Threads Has 70 Million Signups, Surprising Zuckerberg",
    "Twitter threatens to sue its new rival, Threads, claiming Meta stole trade secrets",
    "Daily Digest: Threads up to 50 million users; PE firm secures $20B for buyout fund",
    "All these features are on the way to Threads by Instagram",
    "Threads installation touches 55 million mark, 30 million within 24 hours",
    "Instagram Threads hits 30m signups as Twitter threatens to sue",
    "Hours In, Threads Is Already a Big Hit",
    "Twitter sends Mark Zuckerberg a cease-and-desist over Threads",
    "The definition of a mass social network! [embedded post]",
    "'Like Gen Z's Takeover Of Twitter': Creators React To Threads, Meta's New Social App",
    "Threads Is Not an Automatic Win for Meta",
    "A Threadful plot twist in the race to displace Twitter",
    "With Threads, Meta Has Plenty of Opportunity And Underappreciated Risk",
    "Twitter's Final Boss: Zuckerberg Wages War",
    "Elon Musk is the gift that keeps on giving to Mark Zuckerberg",
    "What chances does Musk have of winning the lawsuit against Zuck?",
    "Mr. Zuckerberg, release the Facebook Files",
    "I finally joined Twitter - and Threads - to see what all the fuss was about",
    "Elon Musk Twitter account goes viral by calling Mark Zuckerberg a lizard, ‘see you in the cage’",
    "Meta's Threads now has 70 million signups, says Mark Zuckerberg",
    "Mark Zuckerberg vs Elon Musk: clash of the tech egos",
    "Meta's Threads Passes 70M Signups; Users More Than Double In One Day",
    "Musk files lawsuit against Meta as Threads surpasses 50 million users in one day",
    "Twitter vs Meta: Elon Musk and Jack Dorsey Criticize Zuckerberg's Threads",
    "Twitter vows to sue Meta over new rival Threads app",
    "Elon Musk accuses Mark Zuckerberg of cheating: Twitter vs. Threads",
    "Threads Token Up 4800% Amid Meta-Musk Saga",
    "Musk threatens lawsuit as Twitter rival Threads takes off",
    "Elon Musk hits out at Zuckerberg as Threads seems ‘Threat’ to Twitter after 30 million sign-ups",
    "Threads App Reaches More Than 30 Million Signups",
    "Incredible. Seriously, add this to Musk's list of accomplishments. https://www.wsj.com/...",
    "Threads won't be fun — but it will give brands a refuge from Twitter",
    "YouTuber MrBeast becomes first to get 1 mn followers on Threads",
    "Meta's Threads has hit 70 million signups, Mark Zuckerberg says",
    "Instagram's Threads threatens to destabilize Twitter, enticing users & potential ad spend",
    "‘All aboard the Threads train!’ New York agencies join Instagram's new alternative to Twitter",
    "How Wendy's and 12 other brands jumped on Threads",
    "Threads won't kill Twitter if it's boring",
    "Instagram Head Wants Threads to Be a Sterile, News-Free Environment",
    "Meta's Threads App Sees Early Success, Drawing Advertiser Interest and Twitter's Ire",
    "Who's on Threads? And Who's Sitting Out?",
    "Threads, Meta's Twitter clone, just launched and people are already complaining about it",
    "Who's behind all those weird product ads on Twitter?",
    "Meta's Advertising Backbone Guarantees Threads' Monetization",
    "hey @zuck, you should go to space just to really make him mad lol",
    "Reply with the mood you're in and i'll send you a recco 😌",
    "@jpholbrook@mastodon.online",
    "Great read, well written. And sadly agree. https://twitter.com/...",
    "@falschgold@mastodon.social",
    "How Twitter lost its place as the global town square - Washington Post",
    "How Twitter lost its place as the global town square",
    "@Celeste_pewter@mastodon …",
    "@neurovagrant@masto.deoan.org",
    "Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "Twitter Sues Law Firm Over $90 Million Payment in Elon Musk Deal",
    "Musk sues law firm Wachtell Lipton over $90mn Twitter legal fee",
    "Yep, that's how you'd react to a $90 million legal bill.",
    "Elon Musk's X Corp files lawsuit against Wachtell, Lipton and others. Here's why",
    "Elon Musk goes after Twitter acquisition lawyers",
    "Elon Musk sues law firm over huge fee Twitter paid hours before he took over",
    "Elon Musk's Twitter sues top law firm Wachtell over $90 million fee for work under prior ownership",
    "Musk Claims Lawyers Overbilled in Fight to Make Him Buy Twitter",
    "Musk Sues Wachtell, Lipton To Recover $90 Million Fee",
    "Twitter Sues Wachtell Over $90 Million Payout for Musk's Buyout Deal",
    "there's poking the bear and then there's whatever the hell this is [embedded post]",
    "@Celeste_pewter@mastodon.social",
    "SUPREME COURT OF THE STATE OF NEW YORK",
    "GEMINI TRUST COMPANY, LLC, v. DIGITAL CURRENCY GROUP, INC. and BARRY SILBERT",
    "DCG fraudulently covered up 3AC-induced insolvency: Gemini lawsuit",
    "Gemini Sues Digital Currency Group and Founder Barry Silbert Alleging ‘Fraud’",
    "Crypto firm Gemini sues Genesis-owner DCG",
    "DCG Dismisses Gemini Lawsuit As “Publicity Stunt” By Winklevoss",
    "Crypto Clash: Gemini And Genesis Owner Barry Silbert Go To Court Over Lost Bitcoin",
    "Gemini Sues Barry Silbert, DCG as Genesis Restructuring Stalls",
    "Gemini takes legal action against Digital Currency Group for alleged fraudulent activities",
    "Winklevoss twins sue crypto investor DCG after dispute over restructuring",
    "US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute",
    "Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency",
    "Gemini Files Lawsuit Against Digital Currency Group and Barry Silbert Alleging Fraud and Deception",
    "Gemini Sues Digital Currency Group Founder for Fraud",
    "Gemini Sues Barry Silbert And His Company DCG Alleging Fraud Against Earn Users",
    "Gemini Lawsuit Accuses Barry Silbert and Digital Currency Group of Fraud",
    "Gemini files lawsuit against DCG and Barry Silbert alleging fraudulent activities",
    "Gemini suit accuses DCG, Silbert of ‘aiding and abetting fraud’",
    "Gemini Sues Genesis Owner Over Failure to Recover Customers' Bitcoin",
    "Breaking: Gemini Files A Lawsuit Against Digital Currency Group and Barry Silbert for Fraud",
    "Our whole industry is becoming a novella. https://twitter.com/... [image]",
    "I cannot wait to see discovery https://twitter.com/...",
    "Could have been avoided by doing 15 minutes of due diligence. https://twitter.com/...",
    "Google alleges Indian antitrust authority used its position to protect Amazon",
    "Google alleges India's antitrust agency protecting Amazon in Android case - report",
    "Google ‘accuses’ Competition Commission of India of protecting rival Amazon in anti-trust case",
    "Google Challenges India's Antitrust Body Over Alleged Favoritism Towards Amazon",
    "Google, CCI, Rs 2,200 crore and the Amazon ‘twist’",
    "SC To Hear Google, CCI Pleas In Android Case On July 14",
    "@arstechnica@mastodon.social",
    "Reddit Gives Final Warning to Subreddits Using NSFW Protest Tactic",
    "Reddit demands moderators remove NSFW labels, or else",
    "Cyberpunk 2077 subreddit goes extremely NSFW in Reddit protest",
    "Reddit NSFW protestors now given ‘final warning’ by company",
    "Reddit is forcing moderators to remove NSFW label. Here's why",
    "BotDefense is wrapping up operations",
    "Reddit mods fear spam overload as BotDefense leaves “antagonistic” Reddit",
    "Personalized wealth management, built for tech people",
    "DoorDash, Uber and Grubhub sue New York City over minimum wage for delivery workers",
    "Report: Judge Halts NYC Law Opposed by App-Based Food Delivery Firms",
    "New Minimum Wage Rule for NYC Food Delivery Workers Temporarily Halted by Judge",
    "Doordash, Grubhub and Uber sue New York City over minimum wage law",
    "A DoorDash worker cursed at her over a $5 tip. Then she learned what they're paid",
    "Food delivery companies fight NYC wage law",
    "App makers sue to halt NYC rule setting $18 hourly wage for food delivery",
    "Uber, DoorDash Sue NYC to Stop Delivery Drivers From Getting a Minimum Wage",
    "Uber, DoorDash and Grubhub sue New York City over $18 minimum-wage law",
    "Food delivery apps DoorDash, Grubhub to block driver wage hike: lawsuit",
    "DoorDash, Uber file lawsuits against New York City's minimum wage law",
    "Ant's share buyback values firm at steep 70% discount to IPO",
    "Ant Plans to Spend About $78.5 Billion to Repurchase Shares",
    "Free compensation benchmarking data from 3,000 startups",
    "Make your family time a blast with these activities",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Lightmatter: Next-gen computing built for AI.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "This leaves out more than it reveals, trust me. https://www.washingtonpost.com/ ...",
    "Bangladesh government website leaked data of millions of citizens",
    "Bangladesh Government Website Leaks Citizens' Personal Data",
    "@GossiTheDog@cyberplace.social",
    "@franksting@mastodon.cloud",
    "Threads Barrels to 70 Million Sign-Ups in Just 2 Days",
    "Bluesky Reaches 1 Million Downloads as Threads Topples 70 Million",
    "Ant Group's $6 billion buyback amid regulatory tension",
    "Chinese securities regulator fines Ant Group almost $1 billion for ‘illegal acts’: AFP",
    "Ant Group launches $6bn buyback after regulatory crackdown ends",
    "Chinese Regulators Fine Ant Group $985M in Signal That Tech Crackdown May End",
    "China ends probe of Ma-backed Ant with $984 million fine",
    "China fines Ant Group $984 million",
    "Ant Group, Jack Ma-founded fintech giant, gets fined almost $1 billion by China regulators",
    "China wraps up fintech crackdown with big fines on Tencent, Alibaba",
    "Alibaba Stock Rises As China Concludes Probe Of Affiliate Ant Group",
    "China fines Jack Ma's Ant Group nearly $1 billion",
    "Alibaba Up 3.4% as China Completes Ant Group Probe With a $984M Fine",
    "China hits tech firms with hefty fines as crackdown draws to close",
    "China's financial regulators wrap up makeover of Ant Group and Tencent",
    "China finalises Ant Group's regulatory overhaul with hefty fine",
    "China Fines Ant Group $985 Million, in Sign Crackdown Is Over",
    "China hits Alibaba affiliate Ant Group with $985 million fine for violating various regulations",
    "China fines Ant 7.1 billion yuan",
    "Alibaba Stock Soars After China Fines Ant Group $1 Billion. Here's Why.",
    "Ant Group faces hefty $1.1b fine",
    "China Ends Tech Crackdown With Fines on Tencent, Ant Group",
    "Apple cracks down on lending apps after deepfake nudes threat",
    "Apple Reportedly Removes Predatory Fintech Lending Apps Targeting Unsuspecting Consumers in India",
    "5 iPhone Utility Apps You Should Have Installed At All Times",
    "After Google, now Apple also removes predatory lending apps in India",
    "Apple Removes Predatory Lending Apps from Indian App Store",
    "Apple India Cracks Down On Illegal Digital Lending Operators, Delists Multiple Apps",
    "Apple pulls predatory lending apps from India App Store",
    "Apple's App Store removes predatory lending apps in India",
    "Scam loan apps in the App Store threaten to send fake nudes to contacts",
    "5 Tools to Help You Detect and Stay Safe From Crypto Scams",
    "Circle, Tether freeze over half of the $126M assets stolen from Multichain breach",
    "Multichain shuts down amidst $130 million suspected hack",
    "Mystery $120 Million Outflow Hits Crypto Bridge Multichain Whose CEO Is Missing",
    "Web3 Crypto Project Multichain Hit With $126,000,000 Exploit: PeckShield",
    "Tether freezes USDT addresses linked to the $130 million Multichain exploit",
    "Multichain Breach Forces Circle to Freeze $63 Million in USDC",
    "Circle Intervenes, Freezes $63 Million From Multichain Hack",
    "DeFi Protocol Multichain Hacked For $126 Million, PechShield Confirms",
    "Multichain Halts All Services Following Exploit, Losses Over $126 Million",
    "Circle freezes $63M in USDC after Multichain attack",
    "$63 million in USDC frozen by Circle following Multichain breach",
    "More than $125 million taken from crypto platform Multichain",
    "CZ Says Binance Users' Assets are Not Affected by Multichain Hack",
    "Multichain Fantom Bridge Exploited and Drained of $126M, Aptos Twitter Account Hacked",
    "Multichain Halts Operations, Warning Users of Mysterious $126M Outflow",
    "$130M Worth Of Outflows From Multichain Spark Fears Of Exploit",
    "$126M in Multichain Funds ‘Abnormally’ Moved to Unknown Address, Says Troubled Bridging Project",
    "Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit",
    "Hack or Rugpull? Multichain Sees $126 Million ‘Abnormal’ Outflows",
    "Another bridge hacked. Sleep on $ROUTE https://twitter.com/...",
    "Exploit of Fantom, Moonriver and Dogechain Crypto Bridges Confirmed by Multichain Team",
    "GPT-4 API general availability and deprecation of older models in the Completions API",
    "GPT-4 API is now generally available to paying customers",
    "An AI model deprecation dilemma",
    "OpenAI Releases GPT-4 API, Announces Retirement of Older Models",
    "OpenAI's GPT-4 Language Model Now Available to All Paid API Users",
    "OpenAI announces general availability of GPT-4, depreciation of older models",
    "OpenAI Makes ChatGPT-4 API Publicly Accessible for Developers",
    "OpenAI Upgrades API With GPT-4 and Opens DALL-E and Whisper API Access",
    "GPT-4 API now available to all, as OpenAI goes all-in on chat",
    "OpenAI Announces GPT-4 General Release For Developers",
    "OpenAI announces general availability of GPT-4",
    "OpenAI Expands API Access and Embraces Chat Format for GPT-4",
    "Why OpenAI Expansion Of GPT-4 API Means Apps Will Become More Powerful",
    "OpenAI announces general availability of its GPT-4 API: Here's what it means",
    "OpenAI's GPT-4 is now available to paying developers",
    "OpenAI opens up GPT-4 to all paying customers",
    "Deploying Falcon-7B Into Production",
    "OpenAI launches its GPT-4 API into general availability",
    "Fine-tuning is coming to GPT-4 and GPT-3.5 later this year — huge! https://openai.com/...",
    "GPT-4 API now generally availible"
]