[
    "International Business Times",
    "Cadet Blizzard emerges as a novel and distinct Russian threat actor",
    "Microsoft Warns of New Russian State-Sponsored Hacker Group with Destructive Intent",
    "Microsoft identifies new hacking unit within Russian military intelligence",
    "Ongoing Russian cyberattacks targeting Ukraine",
    "Microsoft Links 2022 WhisperGate Kyiv Attacks to Russia",
    "Microsoft links Cadet Blizzard APT to Russia's military intelligence GRU",
    "Russian APT ‘Cadet Blizzard’ Behind Ukraine Wiper Attacks",
    "Microsoft identifies, names new Russian-sponsored threat group",
    "Microsoft Outs New Russian APT Linked To Wiper Attacks In Ukraine",
    "Microsoft links data wiping attacks to new Russian GRU hacking group",
    "8 ways Google Lens can help make your life easier",
    "Google Lens can detect now certain skin conditions. All you need to know on new feature..",
    "Google Lens can now search for skin conditions",
    "Google Lens can now search for your skin condition: Here's how to use it",
    "Google Lens now helps you to identify your skin condition",
    "Google Lens will now identify that weird rash for you — here's how",
    "Google Lens Now Lets You Search for a Skin Condition. Here's How",
    "Google Lens Can Now Search Skin Conditions With Just a Photo",
    "What's wrong with your skin? Ask Dr. Google Lens",
    "Google Lens can identify skin conditions and is coming soon to Bard",
    "Google Lens is Here to Identify Your Skin Rash",
    "Google Lens will soon work with Bard, will also be able to identify skin conditions like rashes",
    "Google Lens makes it easy to search about skin conditions",
    "Google Lens now uses AI to help you identify that weird rash",
    "Google Lens, Bard, Search AI, and online shopping just got new AI features",
    "Google Search can now help detect skin conditions and show how clothes look on AI models",
    "Virtually try on clothes with a new AI shopping feature",
    "Google's New AI Tool Is About to Make Online Shopping Even Easier",
    "Google Is Weaving Generative AI Into Online Shopping Features",
    "Google Claims Its AI Can Guess How a Shirt Will Fit on Every Body Type",
    "Google introduces AI-based virtual try-on for online shopping",
    "New Google Shopping feature uses AI to model clothing on different body types",
    "Google Shopping AI feature could abolish changing rooms",
    "Let Google AI try on clothes for you with this new tool",
    "Google Try-On Leverages the Power of Generative AI to Let You Preview Clothes",
    "With AI, Google Can Now Shows How Clothes Fit on Different Models",
    "From virtual shopping to skin condition scanning: Google unveils new AI-powered features",
    "Hong Kong govt pressures banking giants to accept crypto clients: Report",
    "Hong Kong Put Pressure on Three Major Banks to Take On Crypto Exchanges as Clients: Report",
    "Hong Kong regulators push HSBC, Standard Chartered to embrace crypto clients: FT",
    "Hong Kong urges major banks to embrace crypto exchanges as clients",
    "Hong Kong Monetary Authority urges banks to service crypto firms: Financial Times",
    "Hong Kong Authorities Urge Three Major Banks to Embrace Crypto Exchanges, Reveals Report",
    "Hong Kong pushes HSBC and Standard Chartered to embrace crypto clients",
    "Hong Kong Urges HSBC, Standard Chartered To Support Crypto Exchanges",
    "Top Banks Reluctant to Accept Crypto Clients Despite Pressure from Hong Kong Regulators",
    "HSBC, Standard Chartered face pressure from Hong Kong to take on crypto clients - FT",
    "Ahead of the curve. https://twitter.com/...",
    "Wow this is how you know HK is serious about becoming a crypto hub https://www.coindesk.com/...",
    "It's too late, we poisoned MTurk https://twitter.com/...",
    "“Rechanical Turk” https://www.techmeme.com/...",
    "There goes every MTurk study... https://twitter.com/...",
    "33-46% of workers on MTurk used LLMs in a text production task",
    "Fake Security Researcher GitHub Repositories Deliver Malicious Implant",
    "Someone is posing as a fake security company to create malicious GitHub repositories",
    "Hackers impersonate security analysts to advertise bogus zero day exploits laced with malware",
    "Attackers set up rogue GitHub repos with malware posing as zero-day exploits",
    "Malicious Actors Exploit GitHub to Distribute Fake Exploits",
    "Fake Researcher Profiles Spread Malware through GitHub Repositories as PoC Exploits",
    "This is the fake account @TwitterSafety https://twitter.com/... [image]",
    "AI ‘godfather’ says fears of existential threat are overblown",
    "It's ridiculous to think AI threatens humanity, says pioneer",
    "US DOJ Concedes to Try SBF on Original Charges",
    "Sam Bankman-Fried to face trial only on 8 initial charges",
    "FTX's Bankman-Fried Slammed With 8 More Allegations!",
    "Sam Bankman-Fried to Face Trial for Only Eight Charges: Here's Why",
    "U.S. Justice Department Agrees to Try Sam Bankman-Fried on Original Charges",
    "Samsung Brings Irregular Heart Rhythm Notification to Galaxy Watch in 13 Markets",
    "Samsung Galaxy Watch's Irregular Heartbeat Monitoring Feature Is Coming This Summer",
    "Galaxy Watch will now tell you your ticker's off with heart rate notifications",
    "Samsung's Irregular Heart Rhythm Notification Feature Coming This Summer to 13 Markets",
    "Samsung brings irregular heart rhythm notification to Galaxy Watches in Canada",
    "Samsung Announces Galaxy Watch Irregular Heart Rhythm Notifications",
    "Samsung Galaxy Watch will get irregular heart rate notifications this summer",
    "This Apple Watch life-saving feature is finally coming to Samsung smartwatches",
    "Samsung's Galaxy Watch Is Picking Up A Key Health Feature Later This Year",
    "Galaxy Watch Devices Getting Irregular Heart Rhythm Notification",
    "Breaking: Samsung confirms Galaxy Watch 6 will get AFib notifications",
    "Galaxy Watches will get IHRN Health feature in 13 markets this summer",
    "Samsung details availability of important Galaxy Watch health feature",
    "Samsung announces a new heart health tracking feature for Galaxy Watch users",
    "Samsung to release Galaxy Watch6 and Galaxy Watch6 Pro with AFib notification technology",
    "ByteDance Chasing WeChat in the Super-App Race With Douyin",
    "Google hosts, profits from fake abortion clinic ads: report",
    "Google Made Millions From Ads for Fake Abortion Clinics",
    "Google earns $10M from ads directing abortion seekers to pregnancy crisis center",
    "Google earned $10m from ads misdirecting abortion seekers",
    "Kim Dotcom's Megaupload Coders Sentenced to Prison, Herald Says",
    "New Zealand court sentences Megaupload coders to prison- report",
    "Former Megaupload Executives Sentenced to 2.5 Years in Prison",
    "Megaupload coders sentenced to prison after home detention bid denied",
    "Megaupload pair jailed for their part in Kim Dotcom's online empire",
    "Megaupload sentencing: Judge asked to consider home detention but Crown wants prison",
    "Two Megaupload executives sentenced to jail",
    "Steam :: Steam News :: Steam Desktop Update",
    "Valve's Steam redesign is finally here",
    "Steam just got a major UI overhaul",
    "Steam just got a massive update on PC, bringing a refreshed UI and new features",
    "Steam Update Makes Big Changes to the User Interface",
    "Steam gets much-needed redesign: It's now more squarish and bolder",
    "Steam Update Looks Nice, Makes Stuff Easier",
    "Starfield Hits Steam's Top Sellers List, Above the Steam Deck",
    "EXCLUSIVE: LVMH Partners With Epic Games on 3D Technology for Immersive Experiences",
    "LVMH Expands Partnership With Epic Games",
    "LVMH Partners With Epic Games to Unleash Immersive Experiences",
    "LVMH Taps Epic Games to Bring New Immersive Experiences to Its Creative Pipeline",
    "Viva Tech: Why LVMH Is Partnering With Epic Games And Apple Tap To Pay",
    "Siemens unveils big investments in China and Singapore factories",
    "Siemens to Make €2 Billion Investment to Boost High-Tech Plants",
    "Siemens presents €2 billion investment strategy to boost future growth, innovation and resilience",
    "Siemens invests $2.2b in high-tech manufacturing projects",
    "Siemens to invest $2.2 bln to ramp up global production",
    "Ecommerce in Southeast Asia 2023",
    "TikTok rises, Alibaba's Lazada falters in ASEAN e-commerce",
    "SE Asia's e-commerce GMV hit $100b in 2022—almost half was from Shopee",
    "Free compensation benchmarking data from 3,000 startups",
    "Apple's Game Porting Toolkit is the first real step to fixing Mac gaming",
    "Does Apple's porting toolkit change the game? ↦",
    "Apple's secret weapon for bringing PC games to Mac",
    "Temu overtakes Shein in US sales amid inflation concerns",
    "5 key highlights of the SEC's lawsuit against Binance",
    "Judge Denies SEC's Request To Freeze Binance.US Assets, Calls For Collaborative Compromise",
    "Binance CEO Rejects Claims of Manipulating Market to Bolster Native Exchange Coin BNB",
    "Now Binance Withdraws as Crypto Service Provider With Cyprus SEC",
    "Binance under fire: accused of using Ethereum account to comingle client funds",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "Binance's Cyprus unit seeks deregistration as crypto service provider",
    "SEC lawsuit sees Binance.US wobble, trading platforms delist cryptos",
    "SEC, Binance Talk Freeze Avoidance, Crypto Daily TV 15/6/2023",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "Binance.US And SEC Seek Middle Ground To Avoid Asset Freeze",
    "Just 6.4% of Bitcoins on Exchanges Amid SEC Crackdown",
    "Judge Postpones Asset Freeze as Binance US and SEC Agree to Work on Deal",
    "Binance.US and SEC Working on a Deal to Avoid Total Asset Freeze - Here's What You Need to Know",
    "Judge Tries To Broker A Compromise In SEC Versus Binance Case",
    "Binance.US Assets Freeze: Judge Urges SEC to Allow Binance to Operate in the U.S.",
    "Binance.US agrees with SEC to avoid full asset freeze",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "SEC vs Binance: Judge Denies Restraining Order, Calls For Negotiation",
    "Court wants Binance.US, SEC to avoid full asset freeze",
    "Binance.US Strives to Prevent Asset Freeze Through Negotiations with SEC",
    "Binance gets more time to protest US exchange asset freeze",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "Personalized wealth management, built for tech people",
    "TechRadar ranks Zoho Recruit as 2023's best recruitment CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/14 - EU Threatens Google With A Breakup",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Bay Area woman is on a crusade to prove Yelp reviews can't be trusted",
    "Canva introduces new developer tools and $50M investment fund",
    "Canva Launches Developer Platform, Eyes Generative AI Apps",
    "So stoked for this https://venturebeat.com/...",
    "Fernride nudges yard trucks toward full autonomy with $31M in new funds",
    "Munich-based FERNRIDE raises €29 million to solve autonomous trucking with human-assisted approach",
    "Twitter Hit With $250M Lawsuit From Music Publishers Over “Massive Copyright Infringement” Claim",
    "Twitter sued for $250 million by music publishers over ‘massive’ copyright infringement",
    "Music Publishers Sue Twitter, Accusing It of Copyright Infringement",
    "Music publishers sue Twitter for $250m+ alleging ‘rampant infringement of copyrighted music’",
    "Music publishers are suing Twitter for $250 million over ‘massive’ copyright infringement",
    "Twitter sued to the tune of $250m over music copyright",
    "Twitter Hit With $250 Million Copyright-Infringement Lawsuit From Music Publishers",
    "Elon Musk's Twitter is being sued for $250 million. Here's why",
    "Songwriters sue Twitter over music copyright violations",
    "Twitter Sued By Music Publishers For Copyright Infringement",
    "17 music publishers sue Twitter, alleging infringement",
    "Elon Musk: Twitter sued by music publishers for $250m",
    "Twitter Hit With $250 Million Lawsuit Over Alleged Music Copyright Violations",
    "Music publishers sue Twitter for $250M for allowing copyrighted songs",
    "Music Publishers Sue Twitter for Copyright Infringement",
    "Music publishers file lawsuit against Twitter for alleged copyright infringement",
    "Twitter Faces Legal Battle Over Copyright Infringement",
    "Music publishers are suing Twitter over copyright violations: Check details",
    "NMPA Sues Twitter for $250 Million in Copyright Lawsuit for Music Publishers",
    "Preparing for more, annoying DMCA takedowns... https://www.wsj.com/...",
    "The New Razer Blade 14 Is the Ultimate Portable Gaming Machine",
    "New Razer Blade 14 arrives with Ryzen 9 7940HS and RTX 4070",
    "One of the most ambitious gaming laptops just got even better",
    "Razer's Blade 14 Promises Extremely Powerful Gaming Laptop With Fancy Chipsets",
    "Razer refreshes Blade 14 with Ryzen 9, NVIDIA RTX 4070, and AMD Ryzen AI",
    "Razer Blade 14 laptop refresh features powerful Ryzen 9 and RTX 4070 chips",
    "You can now Buy Razer's Next-gen Blade 14 Laptop",
    "Razer Blade 14 gets major upgrade with Ryzen 7000 and an Nvidia RTX 4070",
    "Razer Blade 14 gaming laptop now available with Ryzen 9 7940HS and up to RTX 4070",
    "Razer's new Blade 14 gaming laptop is extremely powerful, but there's a catch",
    "Razer debuts new Blade 14 with Ryzen 9 CPU and RTX 40 graphics",
    "Razer's Latest Blade 14 Cuts Deep With Ryzen 7940HS and RTX 4070 Muscle",
    "Razer Blade 14 Laptop Refresh Packs AMD Ryzen 9 7940HS, Ryzen AI And RTX 40 Firepower",
    "AMD's Hardware AI Ryzen ‘Phoenix’ CPUs Set to Soar in Razer's Blade 14 Laptop",
    "Cybersecurity and Infrastructure Security Agency",
    "Cybersecurity agencies published a joint LockBit ransomware advisory",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "U.S. and International Partners Release Comprehensive Cyber Advisory on LockBit Ransomware",
    "LockBit victims in the US alone paid over $90m in ransoms since 2020",
    "LockBit Makes $91m From US Victims in Two Years",
    "LockBit Ransomware Extorts $91 Million from U.S. Companies",
    "CISA: LockBit behind 1 in 6 ransomware attacks on US gov't in 2022",
    "Understanding Ransomware Threat Actors: LockBit",
    "CISA, Partners Release LockBit Ransomware Cybersecurity Advisory",
    "Why the European Antitrust Case Against Google Might or Might Not Matter",
    "@dcseifert@mastodon.social",
    "How to use WhatsApp on your tablet",
    "Best Amazon Fire tablets: Which Amazon tablet should you buy?",
    "The Best Tablets for Taking Notes for School and Work (Plus the Best Deals Right Now)",
    "Amazon Fire Max 11 Review: The Best Roblox Tablet On The Market Today",
    "Amazon Fire Max 11 review: I miss Google apps",
    "Amazon Fire Max 11 review: Easily the best Fire tablet yet",
    "Fire Max 11 Review: Amazon Ups Its Tablet Game",
    "“Amazon Fire Max 11 review: Easily the best Fire tablet yet” Also a really, really low bar.",
    "Evidence for the utility of quantum computing before fault tolerance",
    "IBM compensates for errors, gets usable results out of quantum processor",
    "IBM's Latest Research Paper Signals A New Era Of Quantum Computing Is Here",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "New technique in error-prone quantum computing makes classical computers sweat",
    "Quantum Error Mitigation and the Path to Useful Quantum Computing",
    "What IBM's result means for quantum computing",
    "IBM quantum computer beat a supercomputer in a head-to-head test",
    "IBM Reports Accurate Quantum at 100+ Qubits",
    "It's a big day. https://www.nytimes.com/...",
    "Phil Spencer: ‘I think of Xbox Game Pass as a content fund’",
    "Phil Spencer seems interested in bringing Hexen back",
    "Phil Spencer Wants You To Stop Reading Into His T-Shirt Choices",
    "Phil Spencer talks AI, “living games” and more in new interview",
    "Phil Spencer Teases Multiple Games That Weren't Shown In This Year's Xbox Showcase",
    "It's Not Just You: Many Americans Face Insurance Obstacles Over Medical Care and Bills",
    "Cyber liability insurance vs. data breach insurance: What's the difference?",
    "Senators Introduce Bill to Exempt AI from Section 230 Protections",
    "Senate bill would hold AI companies liable for harmful content",
    "US senators propose bill to eliminate Section 230 protection for AI companies",
    "AI Could Face New Rules in the EU to Address Risks to You",
    "Bipartisan U.S. bill would end Section 230 immunity for generative AI",
    "Bipartisan bill seeks to deny AI companies liability protections",
    "Nobel laureate Maria Ressa says research by Oxford institute can be used against reporters",
    "The Digital News Landscape of 2023: Gen Z, TikTok, and the Decline of Traditional Media",
    "New Report Looks at Social Media Posting and News Consumption Trends in 2023",
    "20% of 18-to-24-year-olds use TikTok as a news source",
    "Influencers overtaking journalists as news source: report",
    "Using TikTok as a news source? Here are 3 ways to identify misinformation",
    "Sharp decline in appetite for news in recent years, Reuters Institute says",
    "Fewer people trust traditional media, more turn to TikTok for news, report says",
    "Publishers enjoy a trust bump as more Australians take up digital subscriptions",
    "TikTok and Instagram influencers top list of trusted news sources for today's youth: report",
    "Leftwing audiences value ABC and SBS much more than rightwing viewers do, survey finds",
    "Social media eclipses publishers as entry point for news: But Facebook fading",
    "TikTok a growing source for news - but from influencers, not journalists",
    "Poor Mastodon https://reutersinstitute.politics.ox.ac .uk/ ... [image]",
    "MEPs ready to negotiate first-ever rules for safe and transparent AI",
    "Europe moves ahead on AI regulation, challenging tech giants' power",
    "EU Lawmakers Vote to Limit AI Use, Ban Public Face-Scanning",
    "Draft AI Act Passes, Banning Police Facial Recognition",
    "Europe votes to regulate AI and ban use of live facial recognition",
    "Euro Parliament green lights its AI safety, privacy law",
    "EU officials pass draft law to regulate AI and ban facial recognition systems",
    "Macron Calls for French AI Innovation as EU Votes to Regulate",
    "Digital euro proposal set for debate as EU advances AI restrictions legislation",
    "EU Lawmakers Pass Landmark AI Regulation Bill",
    "EU lawmakers pass landmark artificial intelligence regulation",
    "EU takes major step toward AI regulation as the AI Act moves into final phase",
    "EU Gets Big Step Closer to Novel AI Regulations",
    "E.U. Takes a Step Closer to Passing the World's Most Comprehensive AI Regulation",
    "The Who, Where, and How of Regulating AI  —  During the past year, perhaps the only thing …",
    "Europe's A.I. Act enters the final stretch",
    "EU lawmakers vote for landmark Artificial Intelligence regulation",
    "European Union AI Act passes in parliament",
    "EU Parliament published its final position on the AI Act",
    "When generative AI lies, who is liable?",
    "Everything You Need to Know About the EU's Game-Changing AI Legislation",
    "EU Parliament approves AI Act, moving it closer to becoming law",
    "AI Regulation Is Here.  Almost.",
    "European Parliament adopts AI Act position",
    "EU moves ahead with draft law to regulate AI",
    "EU Approves Formation of Artificial Intelligence Act",
    "EU lawmakers approve tougher rules as AI Act moves closer to becoming law",
    "Battle over facial recognition as EU makes groundbreaking AI law",
    "EU Parliament approves strengthened protections for consumers on AI",
    "EU moves closer to passing one of world's first laws governing AI",
    "European lawmakers vote to adopt EU AI Act",
    "European Parliament Preps AI Regulation Targeting Apps Like ChatGPT",
    "EU outlines rules aiming to make it clear when content has been generated by an AI",
    "Europe passes landmark AI legislation by overwhelming majority",
    "@profcarroll@federate.social",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Google risks forced breakup of ad business as EU alleges shocking misconduct",
    "Google's Online Advertising Practices Violate Antitrust Laws, E.U. Says",
    "EU charges Google with anti-competitive practices in ad tech business",
    "Today's European Commission announcement about our advertising technology",
    "EC warns Google that it could break up its advertising business",
    "Google gets EU antitrust charges on ad tech business",
    "EU regulator orders Google to sell part of ad-tech business",
    "The European Union threatens to break up Google's ad business",
    "Google should break up digital ad business over competition concerns, European regulators say",
    "European Commission says it may want to break up Google's ad-tech business",
    "European regulators charge Google with breaching antitrust laws",
    "EU Seeks Breakup of Google's Adtech Business",
    "Google should break up digital ad business over antitrust concerns: EU regulator",
    "European Commission: Google Must Divest Part of Its Display-Ads Business",
    "Google Ad business faces breakup after being charged with EU antitrust violations",
    "EPC welcomes SO against Google issued today by the European Commission",
    "EU hits Google with fresh charges over ad technology",
    "European Commission could move to break up Google's ad empire",
    "The EU wants to break up Google's ad business",
    "Europe teases breaking up Google over ad monopoly",
    "Google may be forced to break up its ad business after EU charges",
    "EU suggests breaking up Google's display ad business over antitrust concerns",
    "EU Commission: Google must break up its ad business or face a massive fine",
    "Google's ads business violates antitrust laws, should break up, EU says",
    "EU targets Google's ad business",
    "European Commission says Google is partaking in ‘abusive’ ad tech practices",
    "Google's ads business under threat from EU Commission",
    "European Commission has accused Google of violating anti-trust laws",
    "How the European Commission's new antitrust case against Google could break up its adtech business",
    "European Commission files antitrust complaint against Google's ad business",
    "Europe May Seek Breakup Of Google Digital Advertising Business",
    "The EU Wants to Break Up Google's Biggest Business",
    "EU slaps Google with antitrust charges over ad tech policies",
    "The EU is going after Google's bread and butter",
    "EU officials accuse Google of antitrust violations in its ad tech business",
    "EU orders Google break up digital ad business for ‘abusing dominant position’",
    "Google Ad Business Accused of Breaking EU Antitrust Laws",
    "Google's Ad Tech Dominance Sparks Breakup Threat From EU",
    "Brussels ramps up Google antitrust case with break-up threat",
    "EU Says It Might Seek Breakup of Google's Ad-Tech Business",
    "EU proposes breaking up Google over anti-competition concerns",
    "Google Faces Breakup of Ads Business Over EU Antitrust Concerns",
    "The EU is determined to crush Silicon Valley. https://twitter.com/...",
    "Google response to ⁦@EU_Competition⁩ antitrust charges today. [image]",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling - The Verge",
    "Google Ad Tech May Break Up; Apple Threaten to Ban Damus Over Bitcoin Tipping",
    "Jack Dorsey-Backed Damus Faces Explusion From Apple's App Store Over Bitcoin Tipping Feature",
    "Musk and Dorsey criticize Apple over its treatment of a social media app that allows bitcoin tips",
    "Apple threatens to remove Jack Dorsey-backed Damus app over in-app transactions",
    "Decentralized Social Media App Damus Faces Apple App Store Removal Over Bitcoin Tipping Feature",
    "Elon Musk fires back at Apple over bitcoin app removal",
    "Jack Dorsey-Backed Damus App to Suspend Tipping Feature as App Store Threatens Removal",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/..."
]