[
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Changes to News Availability on Our Platforms in Canada",
    "Facebook and Instagram to restrict news access in Canada",
    "Canada's Online News Act Targets Facebook and Google",
    "Canadian Senate passes bill requiring Google, Meta to pay for news",
    "Meta to end access to news on Facebook, Instagram in Canada",
    "Meta says it will block news from Facebook, Instagram in Canada",
    "Meta is yanking news from Facebook and Instagram in Canada",
    "Meta to halt news on Facebook and Instagram in Canada",
    "Meta will remove news from Facebook and Instagram in Canada",
    "Meta stops serving news to the Canadian users as Bill C-18 gets closer becoming reality",
    "Meta to end news sharing on Facebook and Instagram for all Canadians",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "Canada residents will not be able to access news on Facebook, Instagram; Here's why",
    "Facebook vows to restrict news access in Canada",
    "Meta to end online news access for its users in Canada",
    "Meta to end news sharing in Canada",
    "Meta makes good on promise to remove news from Canadian Facebook",
    "Meta to End News on Facebook and Instagram in Canada",
    "Meta to pull plug on news sharing in Canada",
    "Bill C-18: Liberal Government's Online News Act Becomes Law",
    "News Media Canada Welcomes Passage of Online News Act",
    "Facebook says it will pull Canadian access to news as Bill C-18 heads for Royal Assent",
    "Meta Blocks News on Facebook, Instagram in Canada Over New Law",
    "After Royal Assent of Bill C-18, Meta Reaffirms It Will End News Sharing in Canada",
    "Oh no!! Just kidding. #NoOneCares https://twitter.com/...",
    "The Online News Act is now law! #C18 #CdnPoli https://twitter.com/... [image]",
    "Canadians will no longer have access to news content on Facebook and Instagram",
    "Meta confirms it will block news on Facebook, Instagram as Senate passes Bill C-18",
    "Facebook confirms that all news sharing in Canada will end due to passage of Bill C-18",
    "Apple Vision Pro to Feature ‘Travel Mode’ for Better In-Flight Experience",
    "Apple Vision Pro's Guest Mode will let you share the $3,500 headset with friends",
    "Apple Vision Pro Travel Mode could make economy feel like first class — but is it worth it?",
    "Apple Vision Pro has speed limit, requires Travel Mode for in-flight use",
    "A First Look at Vision Pro's Travel Mode",
    "Apple Vision Pro may have a Travel Mode for plane rides",
    "Apple Vision Pro will have an in-flight Travel Mode - here's what we know",
    "Apples Vision Pro features a Travel Mode designed for the airplane use",
    "Apple's Vision Pro features a ‘Travel Mode’ designed for airplane use",
    "The Apple Vision Pro could come with a ‘travel mode’ for plane rides",
    "Travel Mode for Apple's Vision Pro headset discovered in visionOS code",
    "Travel Mode in visionOS optimizes your Vision Pro experience on airplane flights",
    "Apple Vision Pro to offer ‘Travel Mode’ for airplane flights",
    "Apple's Vision Pro headset will have a special ‘Travel Mode’ for in-flight use",
    "Apple's Vision Pro will have a special mode for using it on an airplane",
    "New Tools and Options Found Within visionOS, Including Guest Mode and Shortcuts",
    "Apple Vision Pro to include ‘Guest Mode’ for sharing headset with others",
    "@jamesthomson@mastodon.social",
    "@JustMeDevin@mastodon.social",
    "@stroughtonsmith@mastodon .social",
    "@_Davidsmith@mastodon.social",
    "@dcseifert@mastodon.social",
    "Apple Vision Pro ‘Visual Search’ Feature Can Identify Items, Copy Printed Text, Translate and More",
    "Apple releases VisionOS SDK, developers can apply for Vision Pro hardware kit",
    "Apple Releases visionOS SDK to Get Developers Amped for Vision Pro",
    "Apple Opens VisionOS Access for Devs to Start Making ‘Spatial’ Apps for Vision Pro Headset",
    "Apple Releases visionOS SDK, Creating Spatial Experiences, Apple's Developer Advantage",
    "visionOS SDK  —  Apple today announced the availability of new software tools and technologies …",
    "6 things we've learned about the Apple Vision Pro from the visionOS beta",
    "See the first third-party Vision Pro apps in action",
    "Apple Unveils Vision Pro SDK and Developer Labs",
    "Oh, wow.  OK.  Apple really is making a $3.5K VR ski-mask.  Dev tools are now out for it",
    "visionOS beta reveals new glimpses of Apple Vision Pro capabilities",
    "Apple Releases The First visionOS Beta To Developers",
    "Apple's Developer Tools For Vision Pro Reveal How Apple Is Thinking About AR, VR, Mixed Reality",
    "Developer tools to create spatial experiences for Apple Vision Pro now available",
    "Here are the Vision Pro apps that Apple won't allow",
    "Apple Vision Pro SDK out now with in-person developer labs coming next month",
    "visionOS includes Guest User mode for sharing your Vision Pro headset with others",
    "Apple releases visionOS software development kit (SDK) for developers",
    "Apple Vision Pro Unveiled Exciting Opportunities for Developers",
    "Apple Vision Pro will identify items, text, and more before your very eyes",
    "Apple releases visionOS SDK for crafting ‘all-new experiences’",
    "Apple Vision Pro Developer Lab Opens to test MR/VR glasses",
    "Apple's first visionOS beta outlines 13 VR ‘Environments,’ app limitations",
    "Apple releases visionOS SDK tools for devs",
    "Here's a Walkthrough of visionOS, Apple Vision Pro Software [VIDEO]",
    "Vision Pro developer guidelines give more clues as to what to expect",
    "Apple Vision Pro SDK now available for developers",
    "visionOS 1.0: Was uns das SDK über Apple Vision Pro verrät",
    "Apple releases official design kit with visionOS resources for Figma",
    "visionOS gives us a closer look at what we'll see with Apple Vision Pro [Gallery]",
    "Apple announces availability of developer tools for Apple Vision Pro and more",
    "Here Are All the ‘Environments’ You Can Experience in visionOS",
    "First Look at Early VisionOS Apps",
    "Apple's Vision Pro SDK is now available, in-person developer labs launch next month",
    "Apple Releases First Ever visionOS Beta",
    "Apple Vision Pro Developer Tools Now Available With New visionOS SDK",
    "@matthewbischoff@mastodon.social",
    "🥽 Start your (neural) engines...  https://www.apple.com/...",
    "Crouton running on visionOS!  🥳 now the UI just needs a lot of attention",
    "visionOS bringup so far: painful",
    "visionOS: No navigation apps, no photography apps 👀",
    "so  —  who's making a vision pro fart app",
    "The visionOS runtime for Xcode is still called xrOS 😄",
    "@mattontech@mastodon.sdf.org",
    "Microsoft Says It Could Abandon Activision Deal if Judge Delays It",
    "Microsoft says Xbox has 'lost the console wars",
    "PlayStation Boss Jim Ryan ‘Pretty Sure’ Call of Duty Will Remain on PlayStation in Bombshell Email",
    "FTC: Xbox-exclusive Starfield is “powerful evidence” against Activision deal",
    "The Outer Worlds 2 might end up on PlayStation",
    "Microsoft Reckons The Next Console Generation Will Kick Off In 2028",
    "Microsoft and the FTC's fight over Activision reveals secret deals, bombshell emails, and more",
    "Microsoft Expects New Xbox, PlayStation 6 in 2028 Says Court Filings",
    "Microsoft Says Xbox Has Been Losing The Console Wars Since 2001",
    "Microsoft Acknowledges Defeat in the Console Wars Amid Activision Blizzard Acquisition Controversy",
    "Microsoft May Have Inadvertently Revealed When The PS6 Will Arrive",
    "Xbox's Indiana Jones Game Was Originally Set To Launch On PlayStation Too",
    "Microsoft Filing Claims That Xbox Lost the Console Wars",
    "Microsoft Says Xbox Lost the Console Wars",
    "“We've Lost the Console Wars,” Says Trillion Dollar Underdog Xbox",
    "Next Console Generation May Start In 2028, Xbox Court Docs Say",
    "Xbox admits defeat in ‘console wars’",
    "‘Xbox has lost the console wars’ says Microsoft as court case begins",
    "“Xbox Has Lost the Console Wars” Admits Microsoft, Next-Gen Consoles Expected in 2028",
    "Sony: Future PlayStation info won't be given to Activision Blizzard if Microsoft buys it",
    "Microsoft Claims That Xbox Has “Lost The Console Wars”?",
    "Microsoft Says it “Lost the Console Wars” in New Statement to the FTC",
    "Xbox opens FTC defence by claiming it's ‘lost the console wars’",
    "Microsoft Is Literally Now Saying That Xbox Has ‘Lost The Console Wars’",
    "Xbox is actually a small indie game company... https://twitter.com/...",
    "Sony Says It Couldn't Reveal PS6 Info To Activision After Microsoft Deal, Which Is A Trap",
    "Microsoft Claims Bobby Kotick Demanded Bigger Revenue Share to Put Call of Duty on Xbox",
    "The FTC's case against Microsoft could quickly turn into Xbox vs. PlayStation",
    "Sony says it wouldn't share PS6 details with Microsoft-owned Activision",
    "Microsoft Says Even Rival Sony Had No Concern Over Activision Deal",
    "Activision CEO Threatened to Skip Call of Duty on Xbox Over Higher Than ‘Standard’ Revenue Share",
    "Is PlayStation Really Worried About Losing Call of Duty To Microsoft? Private Emails Say No",
    "Jim Ryan Wasn't Overly Concerned About Call Of Duty Xbox Exclusivity",
    "Can a Hollywood Operator Help TikTok? That Didn't Go So Well the First Time",
    "Activision Threatened To Remove Call Of Duty From Xbox Over Revenue Share",
    "Microsoft claims Activision almost prevented COD from coming to Xbox",
    "Sony's PlayStation Chief Privately Denies Microsoft's Activision Deal is About Xbox Exclusivity",
    "Xbox's Phil Spencer has final say on game exclusivity",
    "The view from day one: Microsoft challenges FTC in court over acquisition of Activision Blizzard",
    "Activision Blizzard demanded special treatment to keep Call of Duty on Xbox",
    "PlayStation boss' private email said he wasn't worried about Xbox-Activision deal",
    "Microsoft says it could abandon the Activision deal if it is delayed by federal judges",
    "Hearing Over Microsoft's Takeover of Activision Blizzard Begins, With Bigwigs Set to Testify",
    "PlayStation Boss Admitted Xbox/Activision Deal Isn't About CoD Exclusivity In Private Email",
    "Sony is prepared to cut Activision Blizzard from PlayStation 6 plans",
    "To Clear Activision Deal, Microsoft Says: We've Lost The Console Wars",
    "“Xbox has lost the console wars,” says Microsoft",
    "Microsoft paints Sony as ‘complainer-in-chief’ against $75bn Activision deal",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple Card will launch in India next, report claims",
    "Will Apple Card arrive in India before it reaches Europe?",
    "Apple reportedly back in talks to launch Apple Pay in India",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple in talks to launch Apple Pay in India",
    "Why Credit Card Adoption Is Rising In India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "TikTok COO, who defended firm against China fears, quits after 5 years",
    "TikTok COO V Pappas departs to pursue ‘entrepreneurial passions’",
    "TikTok's senior U.S. executive steps down, signaling major change",
    "Top TikTok exec and public face of company in US is stepping down",
    "TikTok COO V Pappas steps down but takes on advisory role",
    "TikTok looks to challenge Amazon and Shein with new e-commerce initiative",
    "TikTok expands ecommerce efforts with ‘Project S’",
    "TikTok's Top U.S. Executive to Leave the Company After Nearly Five Years",
    "Former Disney Executive Zenia Mucha Joins TikTok as Chief Brand and Communications Officer",
    "TikTok COO Pappas has quit - The Information",
    "TikTok Shakes Up Leadership Amid Questions About Its Future",
    "TikTok chief operating officer V Pappas steps down after five years",
    "TikTok's COO Vanessa Pappas Steps Down Amid Security Concerns",
    "Ex-Disney powerhouse Zenia Mucha hired by TikTok amid political pressure",
    "Vanessa Pappas Steps Down as TikTok COO",
    "TikTok operating chief Pappas to step down after five years",
    "TikTok's COO to step down after nearly 5 years at the popular social media company",
    "TikTok's #2 Exec Bails as Company Fights for Its Life",
    "TikTok COO Pappas Steps Down; Disney Veteran Joins as Communications Chief",
    "TikTok chief operating officer to step down",
    "V. Pappas, the COO of TikTok, has resigned",
    "V Pappas is leaving TikTok.",
    "TikTok COO V Pappas departs as the app faces more congressional battles",
    "TikTok COO Pappas Steps Down",
    "TikTok COO V Pappas steps down after five years in the role",
    "TikTok COO V. Pappas Steps Down",
    "TikTok's most visible U.S. exec steps down",
    "TikTok's top U.S. executive to leave",
    "TikTok Shake-Up: COO V Pappas to Step Down, Ex-Disney Exec Zenia Mucha to Lead Comms",
    "What is TikTok and how does it work? Everything you need to know",
    "Here's the note I sent to all TikTok employees this morning [image]",
    "Argonne National Laboratory",
    "Argonne Aurora Supercomputer Intel Max Blade Installation is Complete",
    "Aurora Supercomputer Blade Installation Complete",
    "Aurora's 10,624 Blades in Place as Exascale System Nears Completion",
    "2 ExaFLOPS Aurora Supercomputer Is Ready: Intel Max Series CPUs and GPUs Inside",
    "Intel, HPE Load Aurora Supercomputer With Over 63,000 GPUs, 21,000 CPUs",
    "Argonne installs final components of Aurora supercomputer",
    "Intel and HPE complete assembly of record-breaking Aurora supercomputer",
    "Intel Aurora Supercomputer Ready To Break Records With Nearly 64K GPUs Across 10K Blades",
    "Intel & HPE Declare Aurora Supercomputer Blade Installation Complete",
    "Awesome to see this!  It took a village!  Congratulations!!",
    "Amazon Pledges $100 Million for Generative AI Startups",
    "Amazon invests $100M in new Generative AI Innovation Center to accelerate solution development",
    "Amazon is putting up $100m to battle Microsoft and Google for the next generation of AI",
    "Amazon Invests $100M in AWS Generative AI Innovation Center",
    "Generative AI: Amazon's US$100M Challenge",
    "Amazon “Sabataged” User Attempts to Cancel Prime, FTC Alleges",
    "What generative AI means for businesses and how AWS can help",
    "AWS Investing $100M in Generative AI Center",
    "AWS pledges $100M to launch generative AI innovation center",
    "Amazon's AWS Invests $100 Million in Generative AI Innovation Center",
    "Amazon looks to boost generative AI projects with new $100M cloud initiative",
    "AWS Launches New $100M Generative AI Innovation Center",
    "AWS Invests $100 Million In Its Generative AI Innovation Center",
    "AWS invests $100 million in new Generative AI Innovation Center",
    "AWS invests $100 million to help customers succeed with generative AI",
    "Amazon Is Spending $100 Million to Teach Cloud Customers About AI",
    "AWS is putting $100 million into a center to help companies use generative AI.",
    "Google Takes Aim at Microsoft's Azure Cloud Practices",
    "Russia tells Amazon Web Services to set up local representation or face restrictions",
    "They will Spinoff AWS. Trust me. $AMZN https://twitter.com/...",
    "Twitter agrees to comply with tough EU disinformation laws",
    "Twitter faces ‘stress test’ of Europe's tough new Big Tech rules",
    "EU Warns Twitter Must Focus on Disinformation Ahead of Elections",
    "Musk Continues to Skirt Controversy as Twitter Works to Reassure Regulatory Groups and Ad Partners",
    "International Business Times",
    "Sam Altman says he'd go watch Elon Musk cage fight Mark Zuckerberg",
    "Musk-Zuckerberg cage fight ‘cancelled’; Tesla CEO's mother gets final say [details]",
    "Europe takes its fight against Big Tech to CEOs' turf: San Francisco",
    "Elon Musk vs. Mark Zuckerberg in MMA? Rival tech billionaires say they're serious in ‘cage’ fight",
    "Why Mark Zuckerberg Can't Quit Twitter",
    "Mark Zuckerberg and Elon Musk Want to Fight Each Other Apparently",
    "EU's industry chief defends data rules criticised by Big Tech",
    "Here's everything about the Elon Musk vs Mark Zuckerberg cage fight",
    "Elon Musk and Mark Zuckerberg agree to cage fight: ‘Send me location’",
    "Dana White says Elon Musk and Mark Zuckerberg are ‘dead serious’ about fighting in UFC match",
    "Dana White insists Musk vs. Zuckerberg is real: ‘Biggest fight ever!’",
    "Dana White Talking to Elon Musk and Mark Zuckerberg About UFC Fight",
    "How the Musk v. Zuckerberg cage fight could save the world",
    "Elon Musk, Mark Zuckerberg agree to a ‘cage match.’ How did we get here?",
    "Elon Musk and Mark Zuckerberg say they're ready for a cage fight",
    "Mark Zuckerberg Accepts Elon Musk's Offer To Fight In A Cage",
    "EU ‘enforcer’ visits Twitter, Meta as new rules loom",
    "Personalized wealth management, built for tech people",
    "US campaign against facial recognition in venues ramps up",
    "100 artists and venues sign pledge against facial recognition",
    "Over 100 artists boycott venues that employ face-scanning tech",
    "YouTube now requires users to declare if they are fan accounts",
    "YouTube is going after fan channels that impersonate others",
    "YouTube updates its policy for Fan Channels: Here's how it will impact creators",
    "YouTuber's channel terminated after the platform mistakenly identifies “graphic nudity”",
    "Lithuania to host Europe's largest tech campus following €100M investment",
    "‘The G-spot of Europe’: how Vilnius is trying to attract international tech talent",
    "Check out this $110 million tech campus being built in Lithuania — the largest in Europe",
    "€100 million tech campus planned for Vilnius - Tech Zity to create ‘largest tech campus in Europe’",
    "Free compensation benchmarking data from 3,000 startups",
    "Data-driven customer experience on a unified platform",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/22 - So, Elon And Zuck Are Gonna Fight, I Guess",
    "Jun 19-23Cannes LionsCannes",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "JPMorgan launches euro blockchain payments for corporate clients",
    "JPMorgan expands its JPM Coin system to include euro payments: Bloomberg",
    "Film Forum Union Ratifies First Contract",
    "Micron, Applied Materials, make big investments in India",
    "Micron plans its first India facility, will invest up to $825 million in the initiative",
    "India confirms Micron's ATMP plant in Gujarat",
    "India will pay for 70% of Micron's $2.75 billion packaging plant",
    "PM Modi invites Micron to boost chip making in India: Key things to know",
    "Micron to invest up to $825 mn in chip assembly plant in Gujarat",
    "Micron announces new India chip facility with investment up to nearly $2.8B",
    "PM Modi US visit: Micron to invest $800 million-plus for chip facility in India",
    "Micron to invest $825 mn in Gujarat semiconductor facility",
    "Micron announces $2.75bn chip testing project amid PM Modi's US visit",
    "Micron to set up $2.75 billion India chip assembly facility",
    "Micron Unveils UFS 4.0 Mobile Storage Using 232-Layer NAND For Huge Bandwidth Gains",
    "Micron to invest $825m for building chip assembly plant in India",
    "Micron and Applied Materials to Invest in India as Chip Makers Diversify",
    "Micron to invest $2.7B to set up chip packaging unit in India",
    "Micron to set up a $2.75 billion semiconductor assembly, test facility in India: Check details",
    "Chipmakers Applied Materials, Micron To Invest Over $1.2 Bn In India",
    "Captions Raises $25M in Series B Funding",
    "Captions Announces A $25 Million Series B for Our AI-Powered Creative Studio",
    "Antitrust Threat to Figma-Adobe Deal Thwarts Hopes for VC Rebound",
    "AI video creation app Captions bags $25M from top VCs",
    "Video editing app Captions raises $25 million to build on its 100,000 daily active users",
    "Investing in Captions  —  As an investor, one of the most rewarding aspects of my job …",
    "Prime Trust Has ‘Shortfall of Customer Funds,’ Nevada Regulator Says",
    "Nevada regulator says Prime Trust can't meet withdrawal requests",
    "Prime Trust Unable to Meet Customer Withdrawals, Says State Regulator",
    "Prime Trust halts withdrawals and deposits as acquisition fails",
    "BitGo Cancels Prime Trust Acquisition, Users Report Frozen Withdrawals",
    "Crypto Custodian BitGo Cancels Acquisition of Prime Trust",
    "Nevada regulator says Prime Trust can't meet all client withdrawals",
    "Prime Trust Suspends Withdrawals After BitGo Terminates Acquisition Deal",
    "Stably pauses withdrawals, minting after Prime Trust halts deposits",
    "BitGo cancels acquisition of Prime Trust amid uncertainty in crypto custodian landscape",
    "Prime Trust halts withdrawals as acquisition falls through",
    "In another blow to crypto, Stably halts withdrawals",
    "(Stably) Prime Trust Halting Deposit/Withdrawal (USDS, BTCS, ETHS)",
    "Robinhood Signs Agreement to Acquire X1",
    "The 10 AI Startups Leading the Pack",
    "Robinhood acquires credit card startup X1",
    "Robinhood Acquires FinTech Firm X1 to Offer No-Fee Credit Card",
    "Robinhood Ventures into Credit Card Market with Acquisition of Fintech X1",
    "Robinhood to Acquire Credit Card Startup X1 for $95 Million",
    "Robinhood buys credit card fintech X1 for $95M",
    "Robinhood Eyes Banking Market With $95M Credit Card Acquisition",
    "Robinhood Acquiring Credit Card Startup X1",
    "Tuma raises the largest round for a Congolese fintech startup",
    "No Cash? No Problem: Robinhood Prepares To Offer Credit To Its Users",
    "Robinhood buys credit card startup X1",
    "Robinhood Announces $95 Million Acquisition of Credit Card Startup X1",
    "Robinhood agrees to acquire credit card startup X1",
    "Google announces $20 million investment for cyber clinics",
    "Support for cybersecurity clinics across the U.S.",
    "Acryl Data Raises $21M in Series A Funding",
    "Europe and the States Are United Against Google's Alleged Ad Monopoly",
    "Monopolistic company Google accuses Microsoft of monopolistic behavior",
    "Midjourney 5.2 and Stable Diffusion SDXL 0.9 Updates for Creative Text-to-Image Generation",
    "Stability AI launches SDXL 0.9: A Leap Forward in AI Image Generation",
    "The next version of Stable Diffusion won't produce spaghetti hands",
    "Stability AI SDXL 0.9 will help you get rid of spaghetti hands",
    "Stable Diffusion aims to fix its problem with generating fingers",
    "Stability AI releases Stable Diffusion XL 0.9, a “leap forward” in AI image generation",
    "The next version of Stable Diffusion won't produce spaghetti hands |  Engadget",
    "Stability AI Launches Stable Diffusion XL 0.9",
    "Stability AI launches SDXL 0.9: A Leap Forward in AI Image Generation — Stability AI",
    "@LokiTheCat@toot.community",
    "@BobRobertsonXI@hachyderm.io",
    "DuckDuckGo Windows browser now available in public beta",
    "DuckDuckGo's privacy-focused browser is available for Windows now",
    "DuckDuckGo's Windows browser is now available in open beta",
    "DuckDuckGo is bringing its browser to Windows",
    "DuckDuckGo's Windows browser is here to protect your privacy",
    "DuckDuckGo's Privacy-Focused Web Browser Now Available for Windows",
    "DuckDuckGo browser for Windows available for everyone as public beta",
    "DuckDuckGo launches privacy-first Windows browser in beta",
    "DuckDuckGo's Privacy-Enhanced Browser Waddles Into Windows, How It Compares To Chrome",
    "DuckDuckGo's Privacy Focused Web Browser Is Finally Available for Windows",
    "DuckDuckGo's Privacy Browser Enters Open Beta On Windows - Here's How To Try It Out",
    "You Can Try DuckDuckGo's Windows Browser Now",
    "DuckDuckGo browser comes to Windows with a ton of privacy and security features",
    "DuckDuckGo Releases Beta Privacy Browser for Windows",
    "DuckDuckGo launches privacy-focused Windows web browser",
    "DuckDuckGo Launches Privacy-Centric Browser for Windows",
    "Protect your privacy with public beta of DuckDuckGo web browser for Windows",
    "DuckDuckGo Browser Beta Now Available to All Windows Users",
    "DuckDuckGo's privacy-focused web browser now available for Windows (in beta)",
    "Hands-On with DuckDuckGo Browser for Windows",
    "DuckDuckGo privacy-focused browser ships to Windows in open beta",
    "The DuckDuckGo Windows web browser has launched in open beta for more privacy while surfing",
    "DuckDuckGo's Windows browser is now available as a public beta release",
    "DuckDuckGo's privacy-focused browser is now available for Windows",
    "Hands-On with DuckDuckGo Browser for Windows https://www.thurrott.com/...",
    "Good news for #privacy. #WindowsInsiders https://www.theverge.com/...",
    "DuckDuckGo browser beta for Windows bakes in a lot of privacy tools",
    "DuckDuckGo Browser Beta for Windows Bakes in a Lot of Privacy Tools",
    "DuckDuckGo offers its privacy-centered browser in a Windows open beta",
    "Twitter CEO starts fighting Musk's battles, paying Musk's overdue bills",
    "Twitter CEO Intervened to Mend Google Relationship After Cloud Payment Issue",
    "Google Cloud with a chance of Musk balls.",
    "New Twitter CEO Steps In to Repair Relationship with Google",
    "Elon continues to drag Twitter through the mud - and could face fines as a result",
    "Twitter pays Google Cloud bill, fixes relationship - report",
    "Twitter resumes paying Google Cloud",
    "Twitter resumes paying for Google Cloud",
    "Apple fixes 0-day kernel and WebKit security flaws in iOS, macOS, watchOS, and more",
    "Apple fixes iPhone software flaws used in widespread hacks of Russians",
    "Apple releases patch for iMessage bug",
    "Apple issues fix for ‘Triangulation’ spyware vulnerability",
    "Apple Fixes Multiple 4-Year-Old Zero-Days",
    "About the security content of iOS 15.7.7 and iPadOS 15.7.7",
    "Apple Addresses Exploited Security Flaws in iOS, macOS and Safari",
    "Apple fixes zero-day security flaws in iOS, macOS, watchOS, and more",
    "Apple issues fix for zero-day flaws used in spy attacks against Kaspersky. Patch now!",
    "Zero-Day Alert: Apple Releases Patches for Actively Exploited Flaws in iOS, macOS, and Safari",
    "Apple addressed actively exploited zero-day flaws in iOS, macOS, and Safari",
    "If you're reading this on an Apple device, go update it right now",
    "Dissecting TriangleDB, a Triangulation spyware implant",
    "Apple addresses two zero-days exploited in Operation Triangulation spyware campaign",
    "Apple fixes zero-day vulnerabilities used to covertly deliver spyware (CVE-2023-32435)",
    "Apple issues emergency patch to address alleged spyware vulnerability",
    "Apple squashes kernel bug used by TriangleDB spyware",
    "iOS 16.5.1 and macOS 13.4.1 Address Actively Exploited Vulnerabilities, Make Sure to Update",
    "Apple Patches iOS Flaws Used in Kaspersky ‘Operation Triangulation’",
    "@FirewallDragons@mastodon.social",
    "Important Apple updates, install soon.  —  https://www.macrumors.com/...",
    "@lorenzofb has there been evidence that this is related to the Kaspersky claims?",
    "Rocking horse shit and hen's teeth rarity value here I reckon... https://twitter.com/...",
    "“The developers refer to string decryption as ‘unmunging’” https://twitter.com/...",
    "More details about the iOS spyware targeting employees at @kaspersky. https://twitter.com/...",
    "...so there is (very likely) a macOS version too 👀 https://twitter.com/... [image]",
    "Apple fixes zero-days used to deploy Triangulation spyware via iMessage",
    "iOS 16.5.1, macOS 13.4.1, and a slew of updates fix “actively exploited” security bugs"
]