[
    "Reddit stands firm in clash with users as blackout on forums escalates",
    "Reddit's golden geese foul up its IPO plans",
    "There is no moral high ground for Reddit as it seeks to capitalise on user data",
    "Two of the biggest Reddit communities reopened in the funniest way possible",
    "People are starting to place bets on Reddit's civil war",
    "Reddit threatens to take over blacked-out subreddits by replacing moderators",
    "Reddit is in crisis as prominent moderators loudly protest the company's treatment of developers",
    "Apple subreddit reopens after moderation team threatened with removal",
    "Reddit has a terrible plan to end blackout: ask you to vote out protesting mods",
    "Reddit CEO Threatens to Boot Moderators Who Back Blackout Protest",
    "Reddit May Replace Moderators If They Don't Open Their Pages, Report Says",
    "Protests fizzle as Reddit refuses to back down and many subreddits come back online",
    "Reddit's fight with its most powerful users enters new phase as blackout continues",
    "Despite widespread protest, Reddit CEO says company is ‘not negotiating’ on 3rd-party app charges",
    "Reddit CEO Plans to Pursue Changes to Company's Moderator Removal Policy",
    "Reddit CEO compares moderators to aristocracy as blackout stretches on",
    "Reddit CEO Flames Protesting Moderators, Calls Them ‘Landed Gentry’",
    "Reddit CEO Suggests User Votes to Remove Moderators",
    "Reddit Allegedly Threatens to Remove Moderators in Response to Blackout",
    "Reddit warns moderators of the blacked-out subreddits",
    "Reddit CEO lashes out on protests, moderators and third-party apps",
    "This is a freaking case study on how to mess up a viable community.",
    "POLL: Decide on the future of /r/GIFs!",
    "The subreddit protests may have had a small yet significant impact on Reddit's traffic …",
    "Reddit's average daily traffic fell during blackout, according to third-party data",
    "Announcing a Global Partnership with Block's Bitkey Wallet",
    "Bitcoin Price Rebounds $1,000 From $25,000 Support Level - What Are Whales Up To?",
    "Jack Dorsey-Backed Bitcoin Wallet Bitkey To Integrate With Coinbase and Cash App",
    "Top US Crypto Exchange Coinbase Partners With Jack Dorsey's Self-Custody Wallet Bitkey",
    "Coinbase partners with Block's self-custody wallet Bitkey",
    "buy bitcoin from an exchange and move it to a hardware key you control https://twitter.com/...",
    "Quant collaborates with BIS and the Bank of England on Project Rosalind",
    "Bank of England's Project Rosalind results out, digital pound plans in progress",
    "Bank of England clears path for digital pound backed by Project Rosalind study",
    "Just-In: Bank of England May Soon Launch CBDC",
    "Bank of England (BoE) Concludes CBDC Test Project towards Potential Official Launch",
    "UK's Bank of England Moves Closer to Launching its CBDC",
    "BIS and Bank of England complete CBDC project",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Secures Emergency Relief to Protect Binance.US Customers' Assets",
    "Notice Of Proposed Stipulation and Consent Order",
    "Binance Reaches Deal With Government to Avert U.S. Shutdown",
    "US court approves SEC-Binance.US agreement",
    "Court rejects SEC request to freeze Binance.US assets, approves agreement to expedite case",
    "Binance, CZ Agree to Repatriate US Customer Assets, SEC Secures Court Order",
    "Binance.US Reaches Agreement With SEC to Avoid Full Asset Freeze",
    "Breaking: US District Court Approves Binance And US SEC Proposed Deal",
    "Binance to lose access to Binance.US's cryptocurrency under proposed SEC deal",
    "Binance and SEC Settle: U.S. Customer Funds and Wallet Keys Return Onshore",
    "Binance, SEC strike deal to move all US customer funds, wallet keys back onshore - CoinDesk",
    "Deal made to Move All U.S. Customer Funds, Wallet Keys Back Onshore",
    "Genetic testing firm accused by FTC of violating customers' privacy",
    "FTC Claims Genetic Testing Company Publicly Exposed Health Data",
    "In a first, FTC charges genetic testing firm over failure to protect data",
    "FTC Orders 1Health.io to Improve DNA Data Privacy, Security",
    "DNA Testing Startup Lied To Customers About Deleting Their Data, FTC Alleges",
    "Pull rich data from apps directly into Google Docs with third-party smart chips",
    "Microsoft says early June service outages were cyberattacks",
    "Microsoft Security Response Center",
    "Microsoft Response to Layer 7 Distributed Denial of Service (DDoS) Attacks",
    "Microsoft says Azure disrupted after a week of repeated service outages",
    "Microsoft says Azure outage was caused by ‘anomalous’ traffic spike",
    "Personalized wealth management, built for tech people",
    "@unrealfred@mastodon.online",
    "Elon Musk says Twitter video app for smart TVs is ‘coming’",
    "Elon Musk, Bernard Arnault to Share Power Lunch in Paris Friday",
    "Twitter's transformation strategy is not that impressive",
    "Elon Musk 'didn't think anyone would actually agree' to the A.I. pause he called for",
    "Linda Yaccarino and the new era of Twitter",
    "Elon Musk Says He Has Improved ‘Corrosive’ Twitter for Most Users",
    "Elon Musk says the Twitter advertiser exodus is all but over",
    "Why the New Twitter CEO's Plans for Twitter 2.0 Left Us Cold",
    "Elon Musk Says Twitter Advertisers Are Coming Back",
    "Ad Buyers Question UGC and Moderation Policies Ahead of Twitter's Muted Cannes Appearance",
    "Musk woos ad giants in Paris to fix Twitter's woes",
    "It's incredible, but in 2023, Musk's only idea left is “pivot to video.”",
    "Ok, maybe he does understand how the ad business works https://twitter.com/...",
    "PIVOT TO VIDEOOOOO https://twitter.com/...",
    "I'm sure this will work out well. https://twitter.com/...",
    "Huawei protests EU's phase-out guideline targeting vendor status",
    "Time to rebrand as “https://meet.ai/ , bitch”? https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Top 5 tips for establishing your next attendance policy",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/16 - Google Does it Again",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Jack Ma conducts first class as visiting professor at University of Tokyo",
    "Alibaba Co-Founder Jack Ma Appears at Company Event in Hangzhou",
    "Jack Ma Has Recently Been Teaching at A University in Tokyo",
    "Office of the General Counsel | Federal Trade Commission",
    "Federal Ethics Response to Meta Petition for Chair Khan's Recusal",
    "she should be recused from her job https://twitter.com/...",
    "Lina Khan is behaving like a dictator at the FTC. Sad 😟 https://twitter.com/... [image]",
    "New from me: https://www.bloomberg.com/...",
    "ByteDance Buys Enough Nvidia GPUs for All of China in Order to Secure Its Future",
    "China's ByteDance Has Gobbled Up $1 Billion of Nvidia GPUs for AI This Year",
    "Nvidia is selling your GPUs to China",
    "One-Minute Daily AI News 6/16/2023",
    "San Francisco Business Journal",
    "Crypto payments platform Wyre shutters, citing bear market conditions",
    "Crypto Infrastructure Provider Wyre to Wind Down Operations Due to Extended Bear Market",
    "Wyre Bows Out: Crypto Platform Succumbs to Bear Market",
    "Crypto Payments Firm Wyre is Shutting Down",
    "Crypto startup Wyre, once valued at $1.5 billion, officially shuts down",
    "Louisiana Office of Motor Vehicles",
    "MOVEit Data Breach Impacts OMV",
    "Millions of Americans' personal DMV data exposed in massive MOVEit hack",
    "Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "A Russia-Based Hacking Rampage Hits US Agencies and Exposes Millions",
    "Millions of Oregon, Louisiana state IDs stolen in MOVEit breach",
    "Third MOVEit vulnerability raises alarms as US Agriculture Department says it may be impacted",
    "Missouri Office of Administration",
    "State of Missouri Issues Statement on Recent Global Cyberattack",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "Explainer: How MOVEit breach shows hackers' interest in corporate file transfer tools",
    "Oregon Department of Transportation",
    "ODOT Data Accessed as Part of Global MOVEit Hack",
    "Massive Data Breach Affecting Millions Could Have Broader Impact",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "More state governments report MOVEit vulnerability exposure",
    "Louisiana driver's licenses, auto registrations targeted in massive data breach",
    "Hackers Steal Data on Millions of Oregon, Louisiana Driver's License Holders",
    "Hackers Stole Millions of Driver's Licenses and IDs from U.S. States",
    "Oregon DMV, Louisiana OMV warn residents of MOVEit data breach",
    "Moveit hack: US agencies, banks and universities among latest victims",
    "Ransomware Group Starts Naming Victims of MOVEit Zero-Day Attacks",
    "Every Louisiana driver's license holder exposed in cyberattack",
    "MOVEit: Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "Millions of Americans' Personal Data Exposed in Global Hack",
    "Meta Unveils Speech Generation Model Voicebox",
    "Introducing Voicebox: The Most Versatile AI for Speech Generation",
    "Meta's Voicebox AI Tech Could Give Your Digital Assistant a Familiar Voice",
    "Meta's New AI Speech Tool Is Ready-Made for Deepfakes—So It's Not Being Released",
    "Voicebox is Meta's new speech-related AI model",
    "Meta Unveils Voicebox Generative AI for Text-to-Speech",
    "Meta Unveils Voicebox: The Future of AI-Driven Speech Generation",
    "Voicebox: Text-Guided Multilingual Universal Speech Generation at Scale",
    "Meta Showcases New ‘Voicebox’ Speech-to-Text Translation Tool",
    "Meta's new AI app is both for patients with vocal cord damage and in-game NPCs",
    "Everything you need to know about Meta's AI Voicebox",
    "Meta's new ‘Voicebox’ AI is a text-to-speech tool that learns like ChatGPT",
    "Meta AI Unveils ‘Voicebox’ Speech Generation Model",
    "Meta unveils speech generation AI: Voicebox",
    "Meta to Help People Craft More Zuck Deepfakes With ‘Voicebox’ AI",
    "Meta's New Voicebox AI Serves Up Generative Text-To-Speech",
    "Meta's reveals new text-to-speech Voicebox AI but you can't have it",
    "Meta introduces Voicebox, a generative AI model for speech",
    "Meta reveals AI tool that lets you edit audio, speak in six languages, and more",
    "Meta announces Voicebox, its generative AI model for audio",
    "Let's supercharge personalized voice scams! Thanks Meta! https://twitter.com/...",
    "FRONT PAGE TECH on YouTube",
    "Apple Vision Pro Introduction Is Now the Most Watched Video on YouTube",
    "How the Apple Vision Pro compares to Meta's headsets",
    "Vision Pro from a Developer's Perspective",
    "Vision Pro Introduction Now Apple's Most Watched YouTube Video",
    "this is NOT the future — Apple Vision Pro",
    "Apple's Growth Vision Is Getting Hard for Some to See",
    "Apple's Vision Pro headset is a hobby. Why won't Tim Cook say that?",
    "Vision Pro: Apple assembles manufacturing partners for first-gen headset",
    "I've been informed that an OTA update for VisionOS 1.0 has surfaced. Borealis 21N5165g for N301.",
    "Tether responds to account deactivation controversy, raises compliance checks",
    "Everything You Need To Know About What We Shared With NYAG",
    "NYAG releases documents detailing Tether's exposure to Chinese securities in 2021",
    "Tether Lambasts Media Outlets For False Chinese Securities Tie-Up Claims",
    "A Look at the Reserve Statements That Tether Tried to Conceal",
    "Here's what new Tether documents reveal about its reserves",
    "Tether Counted Securities Issued by Chinese Firms Among Its Reserves: Bloomberg News",
    "Tether responds to reports on Chinese securities backing USDT reserves",
    "Documents reveal USDT was once backed by Chinese securities",
    "Tether did back USDT with Chinese securities, documents show: Bloomberg",
    "FUD Alert: Tether (USDT) Depegging Signals the Beginning of Uncertainty",
    "Tether Allows Access to Reserves Post Depegging Fiasco",
    "@mostlyharmlessz@muskless.social",
    "@Techmeme this was always suspected but never confirmed, glad to see some truth coming out.",
    "tether getting ahead of the news with cascading short sells https://tether.to/...",
    "Pweeeeass don't write the newsss 👉👈🥺 https://tether.to/... [image]"
]