[
    "Nintendo World Report Updates",
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft's takeover of Activision Blizzard",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "EU Greenlights Microsoft's Massive $69B Acquisition Of Activision-Blizzard",
    "EU approves Microsoft-Activision merger with tasty freebies for gamers",
    "European Commission approves Microsoft-Activision Blizzard deal",
    "EU Approves Microsoft's Acquisition of Activision Blizzard",
    "EU Approves Microsoft's $69 Billion Acquisition of Activision",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "Microsoft gets EU approval for Activision acquisition. But the $69B deal is still at risk",
    "EU antitrust regulators clear $69 billion Microsoft, Activision deal",
    "European Union clears Microsoft's acquisition of Activision Blizzard",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "European Union approves Microsoft's $69 billion bid for Activision",
    "EU approves Microsoft's Activision Blizzard acquisition",
    "Microsoft's $68.7 Billion Takeover of Activision Cleared by European Commission, With Conditions",
    "EU approves Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "Microsoft's Activison Blizzard Acquisition Approved By EU",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "EU Approves Microsoft's Activision Acquisition, But Big Questions Still Remain",
    "UK's regulator says EU is wrong to approve Microsoft's Activision deal",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "Microsoft and Activision Blizzard clear major hurdle in acquisition saga, but deal isn't done",
    "Microsoft Activision Deal Might Not Be Dead After All, Approved In Europe",
    "Xbox's Acquisition Of Activision Blizzard Has Been Approved By EU Regulators",
    "Microsoft wins EU approval for $69B deal to buy Activision",
    "EU approves Microsoft's $68.7bn Activision Blizzard bid",
    "EU Regulators Have Approved Microsoft's Activision Blizzard Acquisition",
    "Microsoft's Activision Blizzard acquisition approved by European regulators",
    "European Commission Approves Microsoft Activision-Blizzard $68.7 Billion Megadeal",
    "The EU officially approves Microsoft's acquisition of Activision Blizzard",
    "Microsoft/Activision: EU Goes Against The Grain By Waving Through $69B Takeover",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "European Union Approves Microsoft Acquisition Of Activision Blizzard King UPDATED With UK Response",
    "Microsoft's $69 Billion Activision Deal Approved by the EU Commission",
    "Microsoft's $69 Billion Activision Deal Approved by the EU",
    "EU AI Act To Target US Open Source Software",
    "First the cookie bullshit, and now this. https://technomancers.ai/... [image]",
    "US Justice Department on the hunt for DeFi hackers and thieves: Report",
    "DOJ Crypto Chief Signals Crackdown on Exchanges",
    "US DOJ Ramps Up Efforts to Crack Down on DeFi Hacks and Thefts",
    "US DoJ crypto enforcement team head says they're coming after mixers and tumblers",
    "U.S. DOJ Vows To Beef Up Scrutiny Of Crypto Exchanges To Curb Illicit Behavior",
    "DOJ's Crypto Chief: No Exchange is ‘Too Big to Fail’",
    "U.S. DOJ's Crypto Enforcement Director Promises Crackdown on Illicit Behavior on Exchanges: FT",
    "US DOJ to suppress illicit crypto exchange activity, official says",
    "US DoJ Goes After Rogue Exchanges As Crypto Crimes Grow ‘Significantly’",
    "Breaking: US DOJ To Intensify Crackdown Against Crypto Exchange, DeFi, Mixers",
    "US DOJ ramps up crypto scrutiny: targets crypto exchanges, DeFi hackers",
    "U.S. DOJ is Targeting Crypto Exchanges, Mixers: Official",
    "Head of U.S. DOJ crypto enforcement eyes crackdown on non-compliant crypto exchanges: FT",
    "This free TV comes with two screens",
    "Pluto TV Co-Founder Launches Telly, the Ultimate Free Television Upgrade for the Living Room",
    "You Can Now Join the Waitlist for Telly's Free Data-Harvesting TVs",
    "Hardware startup Telly launches a free smart TV entirely supported by ads",
    "Your Next TV Could Be Free (If You Don't Mind a Second Screen Dedicated to Ads)",
    "Telly reveals its free dual-screen TV, complete with ads",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "There's a way to get a free flatscreen TV — but with a catch",
    "This Company Will Give You A Free TV In Exchange For Your Data",
    "This 55-Inch 4K TV Is Free And Has Two Screens—But There Is A Catch",
    "A new company wants to give you a free TV, in exchange for always showing you ads",
    "First Free, Ad-Supported Television Set Readies for Primetime",
    "Dual-screen ‘Telly’ is a crazy new TV that's free, but the second screen constantly shows ads",
    "You can reserve your free 55-inch ad-supported TV from Telly now, to ship later this year",
    "A Startup From the Co-Founder of Pluto TV Thinks America Is Ready for Free TVs",
    "Telly is looking to give away a half-million free TVs — but there's a catch",
    "Whys there a camera and mic attached to this tv? FED WORK!!!!! https://twitter.com/...",
    "Really enjoyed this @BigMeanInternet profile of Douglas Rushkoff https://www.wired.com/...",
    "New TSA Tech Assesses If ‘You Are Who You Say You Are’",
    "Expectations remain high as Sea Group is set to deliver Q1 2023 results",
    "Only half of top 60 crypto companies have an external auditor",
    "Kenyan Fintech M-Kopa Raises $250 Million To Fund Expansion Plans",
    "M-KOPA Raises $255M in Funding",
    "African fintech M-Kopa raises $250 million",
    "M-KOPA closes one of Africa's biggest rounds at $250m",
    "African digital credit company M-Kopa signs $255 million in new funding",
    "Kenya's M-KOPA Secures USD 250 M+ Debt, Equity Funding",
    "Turn product data into revenue without engineers",
    "Australian Financial Review",
    "NeoGames acquired by Australia's Aristocrat in $1.2 billion deal",
    "Aristocrat Leisure to buy software firm NeoGames for US$1 billion",
    "Aristocrat acquires NeoGames with office in Kyiv for $1.8B",
    "Aristocrat to buy gaming software firm NeoGames",
    "Aristocrat agrees to pay $1.2 billion for Nasdaq-listed NeoGames",
    "Aristocrat to acquire European RMG platform provider NeoGames in US$1.2 billion deal",
    "These Stocks Are Moving the Most Today: Newmont, Oneok, Magellan Midstream, NeoGames, and More",
    "North Korean hacking groups stole $721m in crypto from Japan",
    "North Korean Crypto Thefts Surpass $2.5 Billion",
    "North Korean hackers steal $497M in crypto from US businesses",
    "North Korean hackers stole $721 million in cryptocurrency from Japan - Nikkei",
    "Free compensation benchmarking data from 3,000 startups",
    "The better way to manage your contacts and deepen relationships",
    "Trends you should look out for the rest of 2023",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "TikTok: Inspire creativity and bring joy.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Yelp: Connect people with great local business.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "(IHP Bonus) Tesla Cofounder Marc Tarpenning (Corrected)",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "The biggest startup flameouts of the last decade",
    "UK's fintech firm Smart secures €87.3M to make pension auto-enrolment simple; here's how",
    "Pension savings platform Smart secures £75m funding injection",
    "Smart Raises $95M in Series E Funding",
    "Smart Raises $95m in Series E Funding",
    "OpenAI CEO Sam Altman in Talks for $100M Worldcoin Funding",
    "Pensions fintech Smart gets wise to $95 million",
    "Digital pension provider Smart nets £76m",
    "Fanatics to buy PointsBet's U.S. assets for about $150 million",
    "Fanatics is making a $150 million bet on online sports betting",
    "Fanatics to Buy PointsBet's US Business in Sports Betting Push",
    "Fanatics Buying PointsBet US Sports Betting Business For $150 Million",
    "Fanatics to Buy PointsBet's U.S. Arm for $150M, to Boost Betting Push",
    "A joint statement from Fanatics Betting & Gaming and PointsBet: [image]",
    "It is insane how many ventures @Fanatics has their hands in. https://twitter.com/...",
    "US DoT Suspends Commuting Cost Benefits Following Data Breach",
    "Apple Books Nearly 90% of TSMC's 3nm Production Capacity for This Year",
    "Here's how Apple's upcoming M3 Pro could compare to its M2 counterpart",
    "Apple is Reportedly Testing First M3 Pro Macs With 12 CPU Cores",
    "Apple's super-fast M3 chip looks to spur a ‘Mac comeback’ after sales dip",
    "M3 Pro MacBook Pro is a huge upgrade over M2 Pro — here's why (report)",
    "Apple's M3 Pro said to sport 12 CPU cores, 18 graphics cores, 36GB of memory",
    "Apple M3 Pro specifications leak out",
    "Apple already testing M3 chips while we're awaiting M2-based MacBook Air",
    "M3 Pro MacBook Pro could be much more powerful, but it won't launch in 2023",
    "Apple's ‘M3 Pro’ chipset could feature 12 CPU cores",
    "First M3 Macs may launch by end of the year, chip has more CPU/GPU cores compared to M2",
    "MacBook Pro M3 Pro specs leak with incredible power",
    "Rumor: Apple currently testing “M3 Pro” chip for release in next-gen MacBook Pro notebooks",
    "Here's why Apple's M3 MacBook chip could destroy its rivals",
    "Apple M3 Mac models with over 108 cores may launch by year-end",
    "Apple M3 Pro chipset could have 12 CPU cores",
    "Future AirPods Pro with built-in thermometer still on Apple's roadmap, but timing remains unclear",
    "Apple is testing an M3 Pro chip for a MacBook Pro upgrade coming in 2024",
    "Apple Reportedly Testing Powerful M3 Chip, Outpacing the Yet Unreleased M2",
    "Apple M3 Mac Chip Specs and Features Revealed, Says Report",
    "Apple's M3 Pro reportedly coming with 12 CPU cores, 36 GB of memory",
    "Apple Is Already Testing The M3 And M3 Pro Chips, New Leak Reveals",
    "Apple M3 chip's specs revealed as testing starts",
    "Apple's next-gen M3 Pro chip could pack even more CPU and GPU cores",
    "Report: Apple Testing M3 Pro Chips With 12 CPU and 18 GPU Cores",
    "Apple Begins Testing Speedy M3 Chips That Could Feature 12 CPU Cores",
    "First M3 Macs to arrive in late 2023 with improved CPU/GPU cores",
    "Rumored next-generation Apple Silicon processor expected in fall 2023 at the earliest",
    "Apple Testing ‘M3 Pro’ Chip With 12 CPU Cores, 18 GPU Cores [Gurman]",
    "The Apple headset is so good.",
    "@CixLiv a lot of rich folk now claiming the metaverse is hot. not dead. lol so sad.",
    "Well... this would change everything. https://twitter.com/..."
]