[
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "EU approves Microsoft's Activision Blizzard takeover, but the deal is still in jeopardy",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "Microsoft's regulatory concessions in Activision deal may tamper Xbox ecosystem growth",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "EU approves Microsoft's takeover of Activision Blizzard",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "European Union approves Microsoft's $69 billion bid for Activision",
    "Xbox's Activision Blizzard Deal Approved by European Commission",
    "EU approves Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "EU Approves Microsoft's Acquisition of Activision Blizzard",
    "The EU approves Microsoft/Activision takeover as long as xCloud does not benefit unfairly",
    "Microsoft and Activision Blizzard clear major hurdle in acquisition saga, but deal isn't done",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard",
    "Microsoft & Activision Blizzard merger is a go with conditions, says EU regulators",
    "Microsoft Activision Deal Might Not Be Dead After All, Approved In Europe",
    "Microsoft's Activison Blizzard Acquisition Approved By EU",
    "Boss fight cleared: Europe approves Microsoft's Activision takeover",
    "Microsoft Activision Deal Has Been Approved By The EU Regulator",
    "UK regulator “stands by its decision” to block Activision deal after EU ruling",
    "Xbox's Acquisition Of Activision Blizzard Has Been Approved By EU Regulators",
    "EU regulators approve Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "EU Regulators Approve Microsoft's Activision Blizzard Acquisition",
    "What's next for the Microsoft-Activision deal after receiving EU approval?",
    "EU Greenlights Microsoft's Massive $69B Acquisition Of Activision-Blizzard",
    "EU approves Microsoft's $69 billion acquisition of Activision, clearing a major hurdle",
    "EU Surprises by Approving Microsoft Activision Merger After UK Shut It Down",
    "Restart game? EU approves Microsoft's $69bn Activision bid weeks after UK rejected deal",
    "Activision Blizzard EU Approval Doesn't Impress the UK's CMA, Which is Sticking to its Guns",
    "EU approves Microsoft's Activision Blizzard acquisition",
    "EU Approves Microsoft's $69 Billion Acquisition of Activision",
    "CMA decries EU's Microsoft-Activision approval, stands by rejection",
    "EU approves Microsoft's $68.7bn Activision Blizzard bid",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "The EU officially approves Microsoft's acquisition of Activision Blizzard",
    "E.U. breaks with Britain and U.S. to clear Microsoft's Activision deal",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "European Commission approves Microsoft's Activision Blizzard purchase for Xbox",
    "Microsoft wins EU approval for $69bn Activision Deal",
    "Microsoft-Activision Buyout Approved By European Commission",
    "EU Makes Microsoft ‘Automatically License’ ActiBlizz Cloud Games Post-Merger",
    "European Union approves Microsoft's purchase of Activision Blizzard King",
    "Microsoft's Activision Purchase Receives Green Light From EU",
    "Microsoft's $69 Billion Activision Deal Approved by the EU",
    "EU Commission Approves Microsoft's $69B Activision Acquisition",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]",
    "How Vice Media Became a Money Pit",
    "Microsoft's big video game merger just got an extra life",
    "Microsoft Azure Cloud Services Under Scrutiny from EU Antitrust Regulators",
    "The European Union's antitrust watchdog launches an investigation into Microsoft Azure",
    "EU Starts Antitrust Investigation of Microsoft Azure",
    "EU approves Microsoft's Activision Blizzard acquisition as Azure reportedly faces scrutiny",
    "EU Regulators Have Approved Microsoft's Activision Blizzard Acquisition",
    "Microsoft wins EU antitrust nod for Activision deal after UK veto",
    "Microsoft Cloud Service Under Scrutiny From EU Antitrust Arm",
    "Chat Lock: Making your most intimate conversations even more private",
    "Introducing Chat Lock on WhatsApp",
    "WhatsApp launches password-protected folder to hide confidential chats",
    "WhatsApp's Chat Lock lets you secure conversations behind a password or biometrics",
    "WhatsApp now lets you lock chats with a password or fingerprint ID",
    "All WhatsApp users gain a brand new feature to stop nosy friends once and for all",
    "WhatsApp Chat Lock: Making Your Most Intimate Conversation Even More Private",
    "WhatsApp Introduces Chat Lock Feature, Empowering Users with Enhanced Privacy and Security",
    "WhatsApp announces Lock Chat feature for Android, iOS apps: Check details",
    "WhatsApp will allow users to lock and hide conversations, Meta announces",
    "WhatsApp Adds New “Chat Lock” For More Private Conversations",
    "WhatsApp Launches ‘Chat Lock’ Privacy Feature",
    "WhatsApp now lets you lock your saucy chats so that no one reads your personal messages",
    "WhatsApp now lets you lock and hide individual chats",
    "WhatsApp adds chat lock feature to safeguard private conversations",
    "WhatsApp Chat Lock introduces extra security for your most private conversations",
    "New WhatsApp feature lets you lock away your super-sensitive chats",
    "WhatsApp's new privacy feature locks sensitive chats and hides them from notifications",
    "WhatsApp Now Lets You Lock Chats Behind Passwords Or Biometrics",
    "WhatsApp's Chat Lock feature will let users password protect their private conversations",
    "WhatsApp Introduces ‘Chat Lock’ Feature To Protect Your Intimate Conversations",
    "WhatsApp launches feature to lock chats",
    "WhatsApp Introduces “Chat Lock” Feature To Hide Conversations",
    "WhatsApp launches Chat Lock feature, allows sender, messages to be hidden",
    "WhatsApp launches Chat Lock feature, what it is, how to use and more",
    "WhatsApp Chat Lock feature launched for private conversations",
    "Latest Odisha News, Breaking News Today",
    "Mark Zuckerberg announces new WhatsApp feature ‘Chat Lock’ to safeguard intimate chats",
    "Mark Zuckerberg announced chat lock feature on WhatsApp for iOS and Android",
    "WhatsApp's new Chat Lock feature will allow you to protect your intimate conversations",
    "WhatsApp now lets you lock chats with a password or fingerprint",
    "“No message preview for added privacy.” Let the chaos begin",
    "@wcathcart @WhatsApp With that feature, all private chat apps are dead",
    "New locked chats in WhatsApp make your conversations more private. …",
    "IRS Weighs Creating a Government-Run Tax-Prep Option",
    "IRS is building a government-run system for tax preparation",
    "The IRS reportedly has a free TurboTax alternative in the works",
    "Watch Out, TurboTax: IRS to Test Free, Online Tax-Filing System",
    "IRS could create government-run tax prep option",
    "Don't let politicians punt the political football on tax reform again",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "This is awesome. Glad it's finally happening. https://twitter.com/...",
    "excited to discover why this is unconstitutional https://twitter.com/...",
    "Another reminder of how behind the curve US fintech is https://twitter.com/...",
    "International Business Times",
    "Online Search To Make Up Lost Time With AI",
    "Amazon Reportedly Planning to Add Generative AI to Search Function",
    "Amazon job listings hint at ChatGPT-like conversational AI for online store",
    "Amazon planning conversational AI chatbot for website search",
    "Amazon's conversational AI search plans sound like a nightmare",
    "Amazon's online store could be turbo-charged with generative AI features",
    "Google search will be led by generative AI only in the US",
    "Amazon is hiring AI engineers to build a ChatGPT-like search interface",
    "Amazon is building an AI-powered ‘conversational experience’ for search",
    "Maybe Amazon will launch a voice assistant. https://twitter.com/...",
    "Amazon on AI-search... https://twitter.com/...",
    "John Battelle's Search Blog",
    "EU AI Act To Target US Open Source Software",
    "Google Splits the Web Into “Commercial” and “Non Commercial” Search",
    "First the cookie bullshit, and now this. https://technomancers.ai/... [image]",
    "With its silence, Google may have quietly announced the Assistant's demise",
    "Is Google's Bard better than OpenAI's ChatGPT? We find out",
    "Together's $20M seed funding to build open-source AI and cloud platform",
    "Together raises $20M to decentralize and open-source AI model creation",
    "Together raises $20M to build open source generative AI models",
    "The AI Startup Together Successfully Secures Funding for Open-Source AI and Cloud Platform",
    "@rodhilton@mastodon.social",
    "This free TV comes with two screens",
    "Pluto TV Co-Founder Launches Telly, the Ultimate Free Television Upgrade for the Living Room",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "Double-screen ‘free’ TV will show you ads, even when not in use",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "A Startup From the Co-Founder of Pluto TV Thinks America Is Ready for Free TVs",
    "‘Free’ TV Costs Only Your Constant Attention",
    "Telly Offers Free 4K TVs, But with 24/7 Ads Built-In",
    "You Can Now Join the Waitlist for Telly's Free Data-Harvesting TVs",
    "Hardware startup Telly launches a free smart TV entirely supported by ads",
    "Want a free TV? Telly will give you one, but there are a couple of stipulations",
    "‘Telly’ is a free dual-screen TV powered by ads, includes free Android TV dongle",
    "Telly Launches Dual-Screen, Ad-Supported TV For Free: Here's How To Get One",
    "Startup Telly Offers You a Free 55-inch TV in Exchange For Constant Ads",
    "This startup will give you a 4K TV for free if you watch nonstop ads",
    "You can get a 4K TV for free, with a very creative new catch",
    "New company giving away free TVs. Here's how to get one",
    "Your Next TV Could Be Free (If You Don't Mind a Second Screen Dedicated to Ads)",
    "Telly reveals its free dual-screen TV, complete with ads",
    "This 55-Inch 4K TV Is Free And Has Two Screens—But There Is A Catch",
    "A new company wants to give you a free TV, in exchange for always showing you ads",
    "Dual-screen ‘Telly’ is a crazy new TV that's free, but the second screen constantly shows ads",
    "This Company Will Give You A Free TV In Exchange For Your Data",
    "There's a way to get a free flatscreen TV — but with a catch",
    "You can reserve your free 55-inch ad-supported TV from Telly now, to ship later this year",
    "First Free, Ad-Supported Television Set Readies for Primetime",
    "Telly is looking to give away a half-million free TVs — but there's a catch",
    "Whys there a camera and mic attached to this tv? FED WORK!!!!! https://twitter.com/...",
    "hey guys, free hackable TV https://variety.com/...",
    "YouTube TV hits 6.3 million subscribers as all other live TV services shrink",
    "A small cable company is going all-in on YouTube TV for video",
    "Cable TV has fewest subscribers since 1992, YouTube TV is the only riser",
    "YouTube TV passes 6 million subscribers https://9to5google.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "OpenAI preps release of open source AI model: Report",
    "OpenAI readies new open-source AI model - The Information",
    "Open-source AI continues to celebrate as Big Tech mulls over moats",
    "Open-Source AI Is Gaining on Google and ChatGPT",
    "Zip Raises $100 Million Series C at $1.5 Billion Valuation to Revolutionize Procurement",
    "Procurement startup Zip secures $100M funding round",
    "Procurement Startup Zip Lands $100M — Ups Valuation To $1.5B",
    "Cloudflare adds AI scanning coverage to protect intellectual property and customer data",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "Trends you should look out for the rest of 2023",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/15 - Media Day On The Podcast",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "TSMC added by Macquarie, Fidelity and Coatue after Buffett cut stake -filings",
    "Ethernovia Raises $64 Million to Accelerate the Revolution of Vehicle Networks",
    "Ethernovia Raises $64M To Boost Electric Vehicle Manufacturing",
    "Ethernovia, an Automotive Ethernet Startup, Receives $64 Million Investment",
    "Ethernovia Raises $64M in Series A Funding",
    "PharMerica data breach impacts more than 5.8 million individuals",
    "Pharmacy giant PharMerica says medical info of nearly 6 million patients leaked",
    "5.8M records stolen in ransomware attack on pharmacy company PharMerica",
    "PharMerica Leaks 5.8M Deceased Users' PII, Health Information",
    "PharMerica Reports Breach Affecting Nearly 6 Million People",
    "Data of 5.82M PharMerica patients stolen, accessed during cyberattack",
    "PharMerica Notifies 5.8M Individuals of Healthcare Data Breach",
    "PharMerica Discloses Data Breach Impacting 5.8 Million Individuals",
    "With Phone Link for iOS, You Can Use iMessage on a PC (But There's a Catch)",
    "Microsoft Completes Rollout of Basic iMessage Support on Windows 11",
    "Microsoft Bridges the Gap Between iPhone and Windows 11 with Phone Link",
    "Microsoft launches app for iPhone users to use iMessage on PC",
    "Windows 11 Now Has Its Own Version of Airdrop for iPhone to PC Transfers",
    "All Windows 11 users can now use iMessage on their PCs",
    "Phone Link for iOS is now available to all Windows 11 users, bringing iMessage and more to PCs",
    "Windows 11 PCs can now send and receive iMessages",
    "iPhone syncing for Windows 11 is now available for everyone",
    "Microsoft iMessage on Windows 11, here are the pros and cons [U: Fully rolled out]",
    "Phone Link for iOS is now available to all Windows 11 users",
    "Phone Link for iOS is now available to all Windows 11 customers",
    "Microsoft releases update that allows iPhone users to text from Windows",
    "Microsoft's ‘Phone Link’ app for iOS is now rolling out to all Windows 11 customers",
    "Windows 11 just gained one of the primary reasons to buy a Mac",
    "Microsoft Phone Link for iOS Now Available to All Windows 11 Users",
    "ZestMoney founders to exit troubled fintech; Amazon hikes seller fee, lays off staff in India",
    "ZestMoney sees founder exits, uncertain future",
    "Founders Quit ZestMoney After Acquisition Deal Falls Through: Report",
    "After Failed Acquisition Talks, ZestMoney Founders Quit",
    "ZestMoney founders resign two months after PhonePe deal falls through",
    "ZestMoney founders resign in wake of failed sale",
    "North Korean hackers stole $721 million in cryptocurrency from Japan - Nikkei",
    "G7 Nations Must Do More to Stop North Korea Crypto Hacks, Japan Suggests",
    "Japan leads world in losses from North Korean crypto hacking with 30% of total: Report",
    "North Korean Crypto Thefts Surpass $2.5 Billion",
    "North Korean hackers steal $497M in crypto from US businesses",
    "Only half of top 60 crypto companies have an external auditor",
    "M-KOPA Raises $250 Million to Improve Financial Inclusion in Africa",
    "M-KOPA Raises $255M in Funding",
    "M-KOPA closes one of Africa's biggest rounds at $250m",
    "African fintech M-Kopa raises $250 million",
    "Kenya's M-KOPA Secures USD 250 M+ Debt, Equity Funding",
    "TSA is testing facial recognition at U.S. airports. Here's what that means for you",
    "New TSA Tech Assesses If ‘You Are Who You Say You Are’",
    "US Justice Department on the hunt for DeFi hackers and thieves: Report",
    "DOJ crypto enforcement director calls for crackdown on illicit behavior by exchanges",
    "NCET Director: DOJ Will Crackdown On Crypto Exchanges",
    "US DOJ launches manhunt for DeFi hackers and thieves",
    "US DOJ Ramps Up Efforts to Crack Down on DeFi Hacks and Thefts",
    "US DoJ crypto enforcement team head says they're coming after mixers and tumblers",
    "U.S. DOJ Vows To Beef Up Scrutiny Of Crypto Exchanges To Curb Illicit Behavior",
    "DOJ Crypto Chief Signals Crackdown on Exchanges",
    "DOJ's Crypto Chief: No Exchange is ‘Too Big to Fail’",
    "US DoJ Goes After Rogue Exchanges As Crypto Crimes Grow ‘Significantly’",
    "U.S. DOJ's Crypto Enforcement Director Promises Crackdown on Illicit Behavior on Exchanges: FT",
    "US DOJ ramps up crypto scrutiny: targets crypto exchanges, DeFi hackers",
    "Breaking: US DOJ To Intensify Crackdown Against Crypto Exchange, DeFi, Mixers",
    "US DOJ to suppress illicit crypto exchange activity, official says",
    "Head of U.S. DOJ crypto enforcement eyes crackdown on non-compliant crypto exchanges: FT",
    "U.S. DOJ is Targeting Crypto Exchanges, Mixers: Official",
    "Larry Ellison cleared of forcing Oracle to overpay for NetSuite",
    "Delaware judge sides with Larry Ellison, Safra Catz over Oracle-NetSuite deal lawsuit",
    "Really enjoyed this @BigMeanInternet profile of Douglas Rushkoff https://www.wired.com/...",
    "Expectations remain high as Sea Group is set to deliver Q1 2023 results"
]