[
    "Here's how Apple's upcoming M3 Pro could compare to its M2 counterpart",
    "Apple Books Nearly 90% of TSMC's 3nm Production Capacity for This Year",
    "Gurman: First M3 Macs may launch by end of the year, chip has more CPU/GPU cores compared to M2",
    "Apple's ‘M3 Pro’ chipset could feature 12 CPU cores",
    "MacBook Pro M3 Pro specs leak with incredible power",
    "Here's why Apple's M3 MacBook chip could destroy its rivals",
    "Apple M3 chip: all the news, announcements, and rumors so far",
    "High-powered M3 Pro chip for Apple MacBook Pro now in testing, report claims",
    "Apple M3 Mac models with over 108 cores may launch by year-end",
    "Apple M3 Mac Chip Specs and Features Revealed, Says Report",
    "Apple is testing an M3 Pro chip for a MacBook Pro upgrade coming in 2024",
    "Apple Reportedly Testing Powerful M3 Chip, Outpacing the Yet Unreleased M2",
    "Apple M3 Pro chipset could have 12 CPU cores",
    "Future AirPods Pro with built-in thermometer still on Apple's roadmap, but timing remains unclear",
    "Apple Is Already Testing The M3 And M3 Pro Chips, New Leak Reveals",
    "Apple M3 chip's specs revealed as testing starts",
    "Apple's next-gen M3 Pro chip could pack even more CPU and GPU cores",
    "Apple's M3 Pro reportedly coming with 12 CPU cores, 36 GB of memory",
    "Report: Apple Testing M3 Pro Chips With 12 CPU and 18 GPU Cores",
    "First M3 Macs to arrive in late 2023 with improved CPU/GPU cores",
    "Rumored next-generation Apple Silicon processor expected in fall 2023 at the earliest",
    "Apple Testing ‘M3 Pro’ Chip With 12 CPU Cores, 18 GPU Cores [Gurman]",
    "Apple Begins Testing Speedy M3 Chips That Could Feature 12 CPU Cores",
    "The Apple headset is so good.",
    "@CixLiv a lot of rich folk now claiming the metaverse is hot. not dead. lol so sad.",
    "Well... this would change everything. https://twitter.com/...",
    "DOJ's Crypto Chief: No Exchange is ‘Too Big to Fail’",
    "U.S. DOJ's Crypto Enforcement Director Promises Crackdown on Illicit Behavior on Exchanges: FT",
    "US DOJ to crackdown on crypto exchanges, NCET director says",
    "US DOJ ramps up crypto scrutiny: targets crypto exchanges, DeFi hackers",
    "US DoJ Goes After Rogue Exchanges As Crypto Crimes Grow ‘Significantly’",
    "US Justice Department on the hunt for DeFi hackers and thieves: Report",
    "US DOJ to suppress illicit crypto exchange activity, official says",
    "Breaking: US DOJ To Intensify Crackdown Against Crypto Exchange, DeFi, Mixers",
    "Head of U.S. DOJ crypto enforcement eyes crackdown on non-compliant crypto exchanges: FT",
    "U.S. DOJ is Targeting Crypto Exchanges, Mixers: Official",
    "Really enjoyed this @BigMeanInternet profile of Douglas Rushkoff https://www.wired.com/...",
    "I am finally in Wired: https://www.wired.com/...",
    "Expectations remain high as Sea Group is set to deliver Q1 2023 results",
    "Top AI Email Assistants in 2023",
    "Forget ChatGPT. These Are the Best AI-Powered Apps.",
    "Australian Financial Review",
    "NeoGames acquired by Australia's Aristocrat in $1.2 billion deal",
    "Aristocrat Leisure to buy software firm NeoGames for US$1 billion",
    "Aristocrat acquires NeoGames with office in Kyiv for $1.8B",
    "These Stocks Are Moving the Most Today: Newmont, Oneok, Magellan Midstream, NeoGames, and More",
    "Aristocrat to buy gaming software firm NeoGames",
    "Aristocrat agrees to pay $1.2 billion for Nasdaq-listed NeoGames",
    "Aristocrat to acquire European RMG platform provider NeoGames in US$1.2 billion deal",
    "First Free, Ad-Supported Television Set Readies for Primetime",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "This free TV comes with two screens",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "Telly is looking to give away a half-million free TVs — but there's a catch",
    "A Startup From the Co-Founder of Pluto TV Thinks America Is Ready for Free TVs",
    "Google I/O and the Coming AI Battles",
    "Is Google's Bard better than OpenAI's ChatGPT? We find out",
    "Turn product data into revenue without engineers",
    "Kenyan Fintech M-Kopa Raises $250 Million To Fund Expansion Plans",
    "M-KOPA Raises $255M in Funding",
    "African fintech M-Kopa raises $250 million",
    "African digital credit company M-Kopa signs $255 million in new funding",
    "M-KOPA closes one of Africa's biggest rounds at $250m",
    "Kenya's M-KOPA Secures USD 250 M+ Debt, Equity Funding",
    "Free compensation benchmarking data from 3,000 startups",
    "The better way to manage your contacts and deepen relationships",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Yelp: Connect people with great local business.",
    "Techmeme: You might have heard of us...",
    "(IHP Bonus) Tesla Cofounder Marc Tarpenning (Corrected)",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Smart Raises $95M in Series E Funding",
    "OpenAI CEO Sam Altman in Talks for $100M Worldcoin Funding",
    "Digital pension provider Smart nets £76m",
    "Pension savings platform Smart secures £75m funding injection",
    "Pensions fintech Smart gets wise to $95 million",
    "Fanatics to buy PointsBet's U.S. assets for about $150 million",
    "Fanatics is making a $150 million bet on online sports betting",
    "Fanatics to Buy PointsBet's US Business in Sports Betting Push",
    "Fanatics to Buy PointsBet's U.S. Arm for $150M, to Boost Betting Push",
    "Fanatics Buying PointsBet US Sports Betting Business For $150 Million",
    "A joint statement from Fanatics Betting & Gaming and PointsBet: [image]",
    "It is insane how many ventures @Fanatics has their hands in. https://twitter.com/...",
    "@AnnemarieBridy@mastodon …",
    "New York AG fines companies that spammed FCC with fake anti-net neutrality comments",
    "Three Companies Faked Millions of Comments Supporting 2017 Repeal of ‘Net Neutrality’ Rules",
    "International Business Times",
    "Pakistan Ex-PM Khan Due Back In Court After Week Of Unrest",
    "Pakistan's political turmoil over Imran Khan's arrest, explained",
    "Pakistan Ex-PM Imran Khan Calls For Nationwide Protests",
    "Imran Khan alleges Pak Army's plan to keep him in jail for 10 yrs",
    "@thomasapowell@fosstodon.org",
    "Privacy and civil rights groups warn against rapidly growing mass-surveillance network",
    "Biometric data is the new oil. https://www.context.news/...",
    "Amazon is focusing on using A.I. to get stuff delivered to you faster",
    "Amazon takes logistics to the next level with AI",
    "Amazon implements AI to enhance logistics and delivery speeds",
    "Amazon optimizes delivery network for speedier delivery, lower costs",
    "@ampersarnie@mastodon.social",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election",
    "Twitter under fire for perceived censorship ahead of election in Turkey",
    "Twitter joins Turkey's presidential debate, censoring posts ahead of election",
    "Twitter says it will restrict access to some tweets before Turkey's election",
    "Twitter succumbs to Erdoğan's pressure, silences key voices in Turkey on election eve",
    "Twitter blocks content in Turkey ahead of pivotal elections after threat to ban platform",
    "Twitter Restricts Content in Turkey Ahead of Elections",
    "Four Takeaways from Turkey's Nail-Biting Presidential Election",
    "Erdogan appears headed for a runoff in race keep his job as president of Turkey",
    "Elon Musk faces backlash for content restrictions in Turkey ahead of presidential election",
    "Results start trickling in for fiercely fought elections that could unseat Turkey's Erdogan",
    "Erdogan leads in Turkey's election, but opposition disputes numbers",
    "Turkey Quake City 'Won't Vote For Erdogan Again'",
    "Turkey Latest: Erdogan's Future at Stake in a Sharply Split Vote",
    "Turkey election 2023 live news: Voting ends in tight race",
    "@Techmeme There's nothing fishy about that, at all.",
    "Freedom of speech vs. just a figure of speech. https://twitter.com/...",
    "Elon got pwned here. https://twitter.com/...",
    "Lend Twitter some of that donation money so they can fight it too then 🤗 https://twitter.com/...",
    "Free speech absolutist seems super sensitive today https://twitter.com/...",
    "Free speech king Elon Musk strikes again! https://twitter.com/...",
    "this whole Twitter free speech thing is going just as you might expect https://twitter.com/...",
    "Elon Musk, free speech champion https://www.forbes.com/...",
    "Major CEX Joins Crypto Businesses' Canada Exodus; Cites ‘No Longer Tenable’ Market Condition",
    "Binance: Canadian Market ‘No Longer Tenable’ After New Regulations",
    "Binance exits Canada amid increased regulation in North America",
    "Binance Faces Regulatory Obstacles in Canada, Decision to Exit Announced",
    "Binance exits Canadian market",
    "Binance leaves Canada due to stricter crypto rules",
    "Binance Pulls Out of Canada Amid Tougher Crypto Regulation",
    "I remember when Binance “exited” the United States https://twitter.com/... https://twitter.com/..."
]