[
    "WSJ News Exclusive | FTX Begins Talks on Reboot as Managers Uncover Past Misconduct",
    "FTX begins talks to relaunch international cryptocurrency exchange, Wall Street Journal reports",
    "FTX seeks final submissions this week from interested parties for revival plans: WSJ",
    "FTX Halts Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX Stops Sale of $500 Million Stake in AI Firm Anthropic: Report",
    "FTX Suspends Sale of $500M Stake in Anthropic",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX's $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "FTX Freezes Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange",
    "Kroll Restructuring Administration",
    "FTX Sues Former Compliance Chief Who Allegedly Silenced Whistleblowers",
    "FTX troubles double with $500 AI sale suspension and hush money accusations",
    "Senior Attorney Helped FTX Founder Misuse Customer Funds, Report Says",
    "FTX management details new allegations on misuse of customer funds",
    "FTX Senior Attorney Helped Cover Up Misuse of Funds",
    "FTX sues Dan Friedberg alleging he used ‘hush money’ to silence whistleblowers",
    "International Business Times",
    "Sam Bankman-Fried fails to dismiss criminal charges related to FTX",
    "Judge Rejects Sam Bankman-Fried's Bid to Dismiss Criminal Charges Over FTX, Confirms Trial",
    "Sam Bankman-Fried Hits A Blank Wall As Judge Denies Motions To Dismiss Criminal Charges",
    "Judge's Decision on Sam Bankman-Fried's Motion to Dismiss Charges in FTX Case",
    "Judge Rejects SBF Motion as New FTX Fraud Details Emerge",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "@joshsternberg.bsky.social",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google could lose billions due to alleged violations of its own video ad standards",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "Google Is Placing Ads for Top Brands on Spammy, Chatbot-Generated Blogs",
    "Transparency and brand safety on Google Video Partners",
    "Google lied about ad metrics: report",
    "Google fires back after study claims “80%” of video ads violate its own terms of service",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "This is amazing contextual advertising.  —  https://www.wsj.com/...  [image]",
    "omg this is such a good read if you have ever been an ad or media nerd https://adalytics.io/...",
    "holy fudge I did NOT KNOW YouTube does audience extension campaigns https://www.wsj.com/...",
    "This report if confirmed impacts the entire media industry. https://www.wsj.com/...",
    "WSJ News Exclusive |  Google Violated Its Standards in Ad Deals, Research Finds",
    "US mulls tightening ban on AI chips to China",
    "Nasdaq slides after big gain as Nvidia shares decline: Live updates",
    "US weighs tougher restrictions on AI chip exports to China",
    "Nvidia and AMD shares fall as US considers tightening restrictions on AI chip exports to China",
    "White House Reportedly Weighs New A.I. Export Limits",
    "U.S.-China AI Race Heats Up as Washington Mulls New Chip Restrictions",
    "China's AI firms might further lose chip access in new US ban",
    "These Stocks Are Moving the Most Today: Nvidia, AMD, AeroVironment, Micron, and More",
    "Nvidia Drops on Report US Plans More AI Chip Curbs for China",
    "European Markets Expected to Open Higher After Tentatively Breaking Losing Streak",
    "U.S. considers curbs on AI chip exports to China",
    "U.S. Mulls New Restrictions on AI Chip Exports to China",
    "US considering new restrictions on AI chip exports to China: report",
    "Biden may restrict AI chip exports to China, impact Nvidia",
    "US to impose new regulations limiting AI chip exports to China: report",
    "Yellen Plans July China Trip While US Preps Investment Curbs",
    "Asia Markets Mixed as Australia Inflation Slows and China Industrial Profits Sink",
    "This is obviously why we need to build Skynet first. https://twitter.com/...",
    "Two major energy corporations added to growing MOVEit victim list",
    "Extortion Group Clop's MOVEit Attacks Hit Over 130 Victims",
    "Alert Regarding Data Incident",
    "Siemens Energy confirms data breach after MOVEit data-theft attack",
    "Schneider Electric Probing MOVEit Claim By Cybercrime Group",
    "UCLA, Siemens Among Latest Victims of Relentless MOVEit Attacks",
    "Extortion Group Clop's MOVEit Attacks Hit 108 Victims",
    "UCLA, Siemens Energy latest MOVEit victims to confirm breaches",
    "Casualties keep growing in this month's mass exploitation of MOVEit 0-day",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT Plus Subscribers Can Now Surf the Web Via Bing",
    "ChatGPT app on iOS now allows users to access information from the web: Here's how to use it",
    "ChatGPT iOS app gets Bing integration to access data beyond its cutoff date",
    "OpenAI's ChatGPT iOS app can now browse the web",
    "ChatGPT iOS app now supports “Browse with Bing” feature",
    "Chat-GPT Could Be Changing The Way You Think, And You Might Not Even Realize It",
    "ChatGPT on iOS adds support for Bing, but locks it behind a subscription",
    "ChatGPT's iPhone app now has Bing built-in",
    "ChatGPT for iOS now lets paid subscribers use Bing right from the app",
    "China's Baidu Ernie Chatbot Update Outperforms OpenAI's ChatGPT on Key AI Tests",
    "Google DeepMind CEO takes aim at ChatGPT with next version of AI",
    "What Shein Influencer Backlash Can Teach Us About Taking On Opportunities",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "How much money Instagram influencers make",
    "Shein's charm offensive is off to a rocky start",
    "Shein sent American influencers to China. Social media users are furious",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "How Shein's influencer trip to a Chinese factory backfired",
    "Shein exploited marginalized women for their influencer trip. It worked.",
    "What Are Social Media Influencers (and Why Does Everyone Want to Become One)",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "Apple Glasses won't face competition from Google Iris smart glasses",
    "Google Kills ‘Project Iris’ Augmented Reality Glasses Project",
    "Google reportedly gave up on its own augmented reality headset",
    "Google has apparently killed its AR glasses - and that's good news for Apple",
    "Report: Google killed Iris smart glasses, going all-in on Android OEM model for XR",
    "Google's next-gen AR glasses join the Google graveyard",
    "Google won't be rivalling Apple Vision Pro as it scraps plans for Iris AR glasses",
    "Google's “Project Iris” goes to the graveyard",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google is no longer building its own augmented reality glasses",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Google kills off the latest iteration of its AR glasses",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Looks like Google might have canceled its new AR glasses",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project",
    "European Commission aims for universal acceptance with digital euro proposal",
    "ECB welcomes European Commission legislative proposals on digital euro and cash",
    "The case for a digital euro",
    "Mairead McGuinness: EU must win people's trust for digital euro",
    "EU proposes payments sector shake-up, legal backing for digital euro",
    "EU to take next step towards digital euro",
    "EU Moves Ahead With Push to Create Digital Euro for Payments",
    "EU publishes draft bill for digital euro and cash payments",
    "Y Combinator sees huge jump in AI-focused start-ups",
    "Wave is the only African startup on Y Combinator's list of top 50 companies by revenue",
    "One-third of new Y Combinator startups focused on AI, CEO says",
    "Hedge Fund Davidson Kempner Reviews $250 Million Byju's Loan as Crisis Grows",
    "Nothing raises $96 mn to expand product and technology portfolio: Details",
    "Nothing is coming for Apple with fresh funding and the Phone 2",
    "Smartphone Startup Nothing Raises $100 Million To Build The Apple Of Android",
    "Nothing Closes $96M Financing Round to Scale Product and Technology Portfolio",
    "Nothing to launch new Glyph Composer with the Phone (2) for cool, personalized ringtones",
    "Nothing Phone (2) is getting an awesome ringtone upgrade",
    "Supreme Court of the United States",
    "Supreme Court Raises Bar on Prosecuting Online Stalkers",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "Supreme Court says a conviction for online threats violated 1st Amendment",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "The Supreme Court Made It Harder — Again — For Women to Get Justice",
    "Supreme Court Puts First Amendment Limits on Laws Banning Online Threats",
    "Supreme Court rules for online stalker convicted of making ‘true threats’",
    "Supreme Court makes it more difficult to convict someone of making a threat",
    "U.S. Supreme Court rejects Colorado's standard for criminal threats",
    "@craigmaloney@octodon.social",
    "Microsoft wants to bring Windows 11 to the cloud for ALL users, including you",
    "Microsoft Reportedly Working on Windows 365 Cloud PC Offering for Consumers",
    "Microsoft plan to Move Windows Fully to the Cloud for Consumers",
    "Microsoft hints that Windows 11 could become a fully cloud-based subscription service",
    "Microsoft has plans to make Windows an operating system streamed from the cloud to any device",
    "Microsoft plans to move Windows to the Cloud: Here's what this means for users",
    "Is Microsoft shoving Windows 11 cloud PC down our throats?",
    "Windows could soon live in the cloud, if Microsoft gets its way",
    "Windows 11 Cloud PC subscription is coming to consumers",
    "Jim Ryan Says Publishers “Unanimously” Hate Xbox Game Pass",
    "Microsoft Sees Cloud-Based Windows 11 as a Long-Term Goal",
    "Microsoft's Long-Term Vision: Windows Transition to Cloud-based Experience",
    "Microsoft Plots Cloud-Based Windows 11",
    "Microsoft wants to put Windows PCs fully in the cloud - but what will that mean for you?",
    "I wouldn't mind streaming Windows 11 from the cloud to my Vision Pro",
    "Microsoft is working on a full cloud-based Windows OS",
    "Microsoft Wants to Shoot Windows 11 Into the Cloud",
    "Windows 11's Potential Subscription-Based Cloud Future Revealed by FTC",
    "Microsoft's looking into offering a version of cloud-based Windows 365 for consumers",
    "Microsoft is planning to put Windows in the cloud for consumers",
    "Report: Microsoft Wants to Bring Windows 365 Cloud PCs to Consumers",
    "Microsoft Plans to Turn Windows into Cloud-Streamed Operating System",
    "Microsoft wants to move Windows fully to the cloud",
    "Astrix Raises $25 Million to Help Enterprises Secure App-to-App Connections",
    "Astrix Security Raises $25M to Protect Nonhuman Identities",
    "Astrix Security Raises $25M in Series A Funding",
    "Free compensation benchmarking data from 3,000 startups",
    "Roblox Trying To Describe Adult Poop Is Very Funny",
    "What Roblox wants to build next with CEO David Baszucki | Decoder",
    "Moving data from iCloud may need to be made easier under upcoming EU law",
    "EU lawmakers agree to make non-consensual sex a criminal offense",
    "EU advances rules that wrestle control of user data away from Big Tech",
    "Data act: Council and Parliament strike a deal on fair access to and use of data",
    "EU a step closer to Data Act that will take on Big Tech",
    "EU strikes deal to give users more control over data",
    "EU finalizes controversial smart contract kill switch rules under Data Act",
    "EU reach data rule deal targeting Big Tech",
    "EU's Controversial Smart Contract Kill-Switch Rules Finalized by Negotiators",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "@danilo.redeem-tomorrow.com",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "DoorDash introduces a slew of new features, including an ‘Earn by Time’ option for delivery people",
    "Doordash just announced its ‘biggest app update ever.’ Here's what's new",
    "DoorDash, Shifting Business Model, Will Offer Drivers Hourly Pay",
    "Introducing DoorDash's Biggest App Updates in a Decade",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Lightmatter: Next-gen computing built for AI.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/27 - What If OpenAI Did Its Own Copilot?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Major League Baseball scouts use two iPhones and AI to identify player potential",
    "AI could help pick Major League Baseball's next big star",
    "Announcing our $58M funding to Build Generative Models and Advance AI Research",
    "Singaporean ex-Googler's startup raises $58m for enterprise AI endeavor",
    "Generative AI startup Reka emerges from stealth with $58 million in its pocket",
    "AI model startup Reka raises $50 million led by DST Global Partners",
    "@ravirockks@infosec.exchange",
    "Singapore AI-Powered AR Wearable Startup Scores $3 Million From Oculus And Siri Cofounders",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Google Kills Augmented Reality Glasses Project",
    "Augmedics closes $82.5M Series D, marks 4,000 U.S. patients treated with Xvision",
    "Augmedics raises $82.5 million to accelerate adoption of augmented reality spine surgery",
    "Augmedics Raises $82.5 Million to Boost Adoption of Augmented Reality Spine Surgery",
    "Augmedics gets $82.5 million in funding round for AR spinal surgery tool",
    "Augmedics Raises $82.5M for Augmented Reality Spine Surgery Platform",
    "Augmedics Raises $82.5M in Series D Funding",
    "Augmedics raises $82.5 million amid Series D decline",
    "TikTok is opening its own online U.S. store",
    "TikTok updates: Creative Challenge, Youth Council, Montana lawsuit...",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok Is Funding Montana Users' Lawsuit After Ban: Report",
    "After Montana banned TikTok, users sued.  TikTok is footing their bill",
    "Anzu completes $48 million Series B for in-game advertising solution",
    "Anzu Completes $48 Million Series B Funding Round Led by Emmis to Accelerate In-Game Advertising",
    "Deal of the day: SanDisk 64GB Extreme PRO CFexpress Type B memory card now only $60",
    "In-game Ads solution Anzu raises $48M in Series B funding",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok connects brands to user-generated ads with new feature",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "TikTok Launches ‘Creative Challenge’ to Provide More Income Opportunities for Creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "Personal Data About Paid U.S. TikTok Creators Is Probably Stored in China",
    "Introducing Unity Muse and Unity Sentis, AI-powered creativity",
    "Unity wants you to make games with AI",
    "Unity (U) Stock Price Jumps Over 15% as Company Announces Its AI Marketplace",
    "Unity has launched new AI tools for game developers",
    "Gaming industry puts generative AI to the test",
    "Unity Announces Big ‘AI’ Plans, Developers Have Concerns",
    "Unity goes deeper into AI as it announces two new tools",
    "Unity Launches New AI Marketplace as Premier Destination for AI Solutions",
    "Why Unity is using its new AI platforms to become more accessible to brands and agencies",
    "@overcastfm@mastodon.social",
    "@numbercrow@techhub.social",
    "So Long, Stitcher: SiriusXM to Shut Down Podcast App, Website",
    "Stitcher podcast app is shutting down in August after 15 years",
    "STITCHER FAREWELL … Need more help?",
    "SiriusXM shutting down podcast app it bought in 2020 for $325M",
    "The Stitcher podcast app is to close",
    "Bad news for all Stitcher followers: the podcast app is shutting down",
    "SiriusXM to Shut Down Stitcher App in Revamp of Its Podcast Business",
    "Popular podcast app Stitcher is shutting down August 29th",
    "SiriusXM is shutting down its Stitcher podcast app to emphasize its flagship app",
    "Why Brad Pitt's Plan B is looking to do audio as others pull out",
    "SiriusXM to Shut Down Stitcher Podcast App",
    "Podcast app Stitcher is shutting down in August",
    "One of the biggest podcast apps is shutting down in August",
    "Patriarchy Hurts All Of Us — Including Men",
    "@Techmeme Say it with me: enshittification.",
    "Three Arrows Capital Liquidators Demand $1.3B from Bankrupt VC Fund's Co-Founders",
    "Three Arrows Capital Liquidators Seek $1.3B From Bankrupt Hedge Fund's Founders: Bloomberg",
    "3AC liquidators seek $1.3 billion from Zhu, Davies: Bloomberg",
    "Bankrupt Crypto Hedge Fund Three Arrows Capital Pursued by Liquidators for $1,300,000,000: Report",
    "Three Arrows Capital Founders In Legal Battle Over $1.3 Billion In Funds",
    "Bankrupt Three Arrows' liquidators seek $1.3 billion from fund's founders",
    "Three Arrows Capital Liquidators Seek a Staggering $1.3B from Founders of Insolvent Hedge Fund",
    "3AC liquidators look to recoup $1.3B from founders",
    "@konstantin@digitalcourage …",
    "Apple warns that UK's Online Safety Bill puts people at ‘greater risk’",
    "An encryption exodus looms over UK's Online Safety Bill",
    "Why are Apple and WhatsApp unhappy with the UK's online safety bill?",
    "Apple Warns the UK's Online Safety Bill Threatens Citizens' Privacy and Security",
    "Apple opposes UK's Online Safety Bill, citing risks to privacy and security",
    "Apple opposes UK bill that could mandate backdoor scanning in iMessage",
    "Apple speaks out against bill that could mandate CSAM scanning in iMessage",
    "Apple says proposed UK law ‘poses a serious threat’ to end-to-end encryption",
    "Apple Joins Opposition Against Message Scanning in Online Safety Bill",
    "Apple urges UK to rethink anti-encryption Online Safety Bill",
    "Apple officially opposes proposed UK law that would weaken iMessage encryption",
    "Apple Joins Opposition to U.K. ‘Online Safety Bill’",
    "@konstantin@digitalcourage.social",
    "Apple joins opposition to encrypted message app scanning",
    "Apple Joins Opposition in UK To Encrypted Message App Scanning",
    "@SloanStudio@mastodon.social",
    "@danielfgom@social.vivaldi.net",
    "Creating fully immersive experiences in your app",
    "What is the Difference Between VR, AR, MR and XR?",
    "Apple documentation hints at 10′ x 10′ safe arena space for Apple Vision Pro VR use",
    "The integration of virtual reality technology in online crypto casinos",
    "Vision Pro may stop working entirely when moving too fast",
    "Why the Meta Quest 2 Is Better Than the Apple Vision Pro for Fitness",
    "Multiple new Vision Pro headsets are already being developed at Apple",
    "Meta launches Quest+ subscription for its VR headsets as Apple Vision Pro debut nears",
    "So much for any New Yorkers having sufficient space in their apartment to use one [embedded post]",
    "@SloanStudio Pretty wild limitation considering the Oculus Quest is $400 and supports 50x50 ft.",
    "@SloanStudio I would suspect it is not a hardware limitation.  Then again, why do it otherwise?",
    "Possibly to limit the potential for Vision Pro fail videos ... https://twitter.com/...",
    "Vision Pro safe area limited to 10x10 feet for VR experiences",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram tests feature to block explicit images in direct message requests",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Instagram and Messenger get more parental supervision tools",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Meta Announces New Teen Safety Tools, Including Updated Parental Oversight and Messaging Controls",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Both TikTok and Meta introduce new parental controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Facebook Messenger launches “parental control” mode",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Parents can now see more of what their kids are up to on Messenger and Instagram",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Meta guardrails: More safeguards, monitoring tools for teens launch across social platforms",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Facebook adds parental control tools to Messenger",
    "Meta launches parental controls for Messenger. Here's how to use them.",
    "@tetherpoint@mastodon.social",
    "Has Apple Overshot the Market with the New Mac Pro?",
    "Mac Pro market even smaller than expected, as high-end pros choose 16-inch MBP",
    "Did Apple accidentally make Mac Pro unnecessary?",
    "M2 Ultra Mac Pro review shows Apple's powerhouse hasn't left the worst of the Intel era",
    "@macstories@mastodon.macstories.net",
    "Has Apple Overshot the Market with the New Mac Pro? https://www.macstories.net/...",
    "The Mac Pro's biggest problem is the MacBook"
]