[
    "@rwaddilove@techhub.social",
    "Threads Supplemental Privacy Policy",
    "Threads' Instagram ‘Trap’ Shows Why Facebook Should Have Been Broken Up Years Ago",
    "Instagram flooded Threads with celebrities and brands at launch",
    "How to add and manage multiple accounts in Threads, Meta's new Twitter rival",
    "How to use Threads, Facebook's new Twitter alternative, without sacrificing your privacy",
    "Meta's ‘Twitter Killer’ Threads Onboards Millions, But They Could Lose Their Instagram Accounts",
    "How to Delete or Deactivate Your Threads Account",
    "If You Want to Delete Threads, You'll Need to Delete Your Entire Instagram Account",
    "To delete your Threads account, you have to forfeit Instagram",
    "Want to delete your Threads profile? Then you have to delete Instagram too, Meta says",
    "How Meta's New Platform Threads Compares to Twitter",
    "5 things to know about Threads, Twitter's newest rival",
    "Data Capture in the New Social Media Age",
    "Deleting your Threads profile will also kill your Instagram account",
    "Instagram Threads had 10 million sign ups in just 7 hours",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "Twitter competitor Threads won't let you delete your account unless you also delete Instagram",
    "Want To Delete Your Threads Account?  Say Goodbye To Instagram",
    "Meta: You can't delete your Threads profile without deleting Instagram",
    "What is Threads? How to sign up and how it differs from Twitter",
    "Meta says Instagram users will lose their account if they delete Threads",
    "Threads vs. Twitter: 5 Ways Instagram's New App Comes Up Short (for Now)",
    "Don't be so quick to jump on Meta's Threads hype train: read this first!",
    "Threads feed of people you follow ‘on the list’; can't delete your profile; more",
    "Meta launches Instagram Threads to dethrone Twitter",
    "WATCH: How to set up Instagram Threads",
    "Explainer: Understanding the ‘ticket’ for Threads on Instagram and how users can sign up",
    "How to Delete a Discord Account and the Best Discord Alternatives to Use Instead",
    "A guide to getting started on Threads, plus tips and tricks",
    "@Techmeme This is similar to Google, Microsoft and others.  One account for multiple services.",
    "I'm muting this but here's a screenshot [image]",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "https://techcrunch.com/... *laughs maniacally*",
    "Guess I'm stuck with this app...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads profile can only be deleted by deleting Instagram account, Meta says",
    "@javahippie@freiburg.social",
    "@chris@mstdn.chrisalemany.ca",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Adam Mosseri says Meta's Threads app won't have ActivityPub support at launch",
    "Threads won't be fun — but it will give brands a home away from Twitter",
    "Meta's Twitter-Like Threads is Here",
    "Meta's New Threads App Is Terrible. It Just Might Bury Twitter.",
    "How Threads Features Differ From Instagram and Twitter",
    "Ten million join Meta's new app Threads - Zuckerberg",
    "Explained: What is Threads? Is Twitter in danger?",
    "Meta Launches Threads, its Twitter Competitor",
    "How to use the Threads app explained: Making posts, sharing, & more",
    "Threads Hands-On: Instagram's New App Might Just Be Dull Enough to Beat Twitter",
    "Why has Threads, Meta's answer to Twitter, not launched in the EU?",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "I tried Threads and I think Twitter is in trouble",
    "Threads goes live, new social platform could rival Twitter",
    "Threads, Meta's Replacement For Twitter, Sucks By The Way",
    "How to use Threads, the new (new (new)) Twitter replacement",
    "What is Threads on Instagram? All about Mark Zuckerberg's Twitter alternative",
    "Instagram Will Now Let You Add Up to Three Collaborators on Posts and Reels",
    "Meta Launches Threads “Twitter-Killer” App with 10mn People Signing up for the Start",
    "How To Download And Join Threads: Meta's New Twitter Alternative",
    "We tried Instagram's Threads app, and this is the experience",
    "Meta launches Twitter rival Threads but faces delays in Europe over privacy concerns",
    "Everything you need to know about Meta's new ‘Twitter killer’ app, Threads",
    "Threads: 7 things you need to know about Instagram's Twitter killer",
    "Threads is here — live updates and first impressions of Instagram's Twitter rival",
    "Dead on arrival  —  https://www.platformer.news/ ...  [image]",
    "On threads with the burner. Come find me",
    "threads is like twitter for people whose criterion channel is netflix",
    "IG famous people posting on threads like “morning coffee ❤️” I can't do this??????????",
    "@georgebsocial @TimSweeneyEpic yea, I agree. I don't like typing / sharing things on a mobile app",
    "lol Zuck just can't help himself [image]",
    "A well executed animation like this pull to refresh in Threads just feels sooooo good. 😚 [video]",
    "threads quite quickly giving linkedin energy [video]",
    "first post i seen on threads. already wanna kms [image]",
    "threads feels corporate. all the brands came in with tons of followers",
    "lol threads currently using the “you have no control over what you see model” [image]",
    "If you needed a reason to join threads, this is it [image]",
    "Zuck is salivating as he waits to drop the ads on all his new Threads users 🤣",
    "Lots of work on basic capabilities this morning.",
    "The most surprising thing about the Threads launch to me is still that you can pre-order an app.",
    "Not knowing what app you're on:",
    "Hi guys!  I'm on time for once",
    "With great power comes great responsibility.",
    "Need a ‘Following’ page ASAP",
    "That @ logo animation when you pull down to refresh js pretty nifty.  👏👏👏",
    "Excellent threads, @lewishamilton.",
    "please help make this the first viral threads tweet",
    "good morning to everyone except for da bomb",
    "Wait so Rabois, Marc and everyone else are going to have to re-block me 😂😂😂",
    "Like this if @zuck should make me CEO",
    "Sorry I'm late, I was threading",
    "Okay this app is pretty cool but WHY IS THE TEXT SO SMALL",
    "How do you work this fuckin thing",
    "More engagement from 3k followers on here than 5m on Twitter.  Hmmmm",
    "Oh look.  The drama of Twitter is already here.  Hahahah.",
    "Someone check on the bird app 😈",
    "me opening any other app right now...",
    "Great job with this app @zuck !  Love how well it works and how simple it is.",
    "I know it's called threads but can we please leave the spool emoji on twitter 🧵",
    "I feel like I'm cheating on twitter 😅",
    "Our boss: What's your social strategy for Threads?  Us:",
    "Can't get enough of your threads 🎶",
    "Me trying to navigate my Threads feed of people I don't follow on Instagram.",
    "Threads hits 5M signups in the first four hours",
    "@luis_in_brief@social.coop",
    "Introducing Threads: A New Way to Share with Text",
    "Zuckerberg-Musk fight is on: Meta launches ‘Twitter Killer’ Threads app",
    "To Delete a Threads Account, You'll Need to Nuke Your Instagram Account Too",
    "What is Instagram's Threads app? All your questions answered",
    "Meta has launched Twitter rival Threads, snagged 10M signups in hours",
    "What is Threads? Here's what you need to know about the potential ‘Twitter Killer’",
    "Here's how Twitter's leadership is responding to Instagram Threads. …",
    "Meta Made Clear Quest Pros For Some Employees Who Worked On It",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "Zuckerberg uses Threads to say Twitter has missed its chance",
    "Zuckerberg's Twitter clone Threads is live.  Here's what you need to know.",
    "How to Use Instagram Threads: A Comprehensive Guide",
    "Threads, Meta's Twitter competitor, is now live",
    "Meta's Threads App Draws Millions Seeking a Twitter Alternative",
    "Meta's new Twitter rival app Threads gets 10 million sign-ups within hours of launch",
    "The Morning After: Meta's Twitter rival, Threads, is finally here",
    "5 Things to Know Before the Stock Market Opens Thursday",
    "Meta's Threads app launches in 100 countries, hitting 10 million users in 7 hours",
    "Head of Instagram says placing ads within Threads is “not a priority right now”",
    "Mark Zuckerberg's Twitter Killer Is Shockingly Viable. Oh No.",
    "What you need to know about Threads, Instagram's new Twitter killer app",
    "Zuckerberg Under Fire in China After Report of Quest Sale Talks",
    "Mark Zuckerberg's Sneak Attack: Twitter Rival Threads Launches Earlier Than Expected",
    "Meta's Threads Is Here. What It Is and How to Use It",
    "Mark Zuckerberg just released Threads, Meta's new rival to Twitter. Here's how to sign up",
    "Meta Launches Instagram Threads, its Twitter Killer",
    "Instagram's Twitter competitor, Threads, is available now",
    "Meta's Threads app is here to challenge Twitter",
    "Instagram Launches Threads, a Text-Based ‘Conversation’ App, in Challenge to Elon Musk's Twitter",
    "The Instagram Threads launch countdown jumped forward and is now targeting 7PM ET",
    "i hope every body finds the social media home they truly deserve",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "Must confess to a deep love of fashion & architecture",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Threads is exciting because it's just your classic underdog story",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "Meta's new app was built entirely using this keyboard: [image]",
    "Threads has been available for 30 minutes and people are already roasting Zuckerberg [image]",
    "Zuck is already using his new app to pitch himself on podcasts [image]",
    "the fact that it will eventually work with decentralized social media apps is really intriguing.",
    "Threads will 100% only be a thing people use for maybe a month",
    "This is getting ridiculous [image]",
    "Did Meta just launch a new social media website without a website?",
    "It turns out, building an Instagram account is now 100x more valuable",
    "threads first impressions It's good Really good Elons in trouble",
    "This and how you have to give it access to your contacts means NFW. https://twitter.com/...",
    "Folks, Instagram images preview on Threads [image]",
    "Users in EU can view threads on Threads, but can't sign up. https://www.threads.net/...",
    "Sad to inform the social media interns at brands are at it already [image]",
    "threads feels like for designers, by designers so far https://www.threads.net/...",
    "this is how you return from an 11-year twitter hiatus. https://twitter.com/...",
    "Mark Zuckerberg's first tweet in 11 years and he's trolling Twitter 🙃 https://twitter.com/...",
    "Gosh. Yuk. Hmmmm. Really, Threads? [image]",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "Seeing former Twitter employees use Threads is chefs kiss.",
    "We are definitely focusing on kindness and making this a friendly place.",
    "Let's do this. Welcome to Threads. 🔥",
    "the priority is the mobile apps, but we are working on www",
    "Anyone think this can become bigger than twitter!?",
    "I'm excited to jump into @threadsapp",
    "Zuck you need to be actively shitposting on here to make that happen.  LFG!",
    "what if @zuck decides to make an electric car next lol",
    "Bosses joining Threads like:",
    "Excited about my buddy @zuck 's new venture.  Threads...happy to be here.",
    "Not my style personally, but I'm sure there will be plenty of entertaining content here...",
    "Not followers 10k FRIENDS 🥹",
    "Credit where it's due, they pioneered the format and have done great work",
    "It's so over, we're so back",
    "You can start with @rourkery and @briansw but theres more folks ❤️",
    "Congrats on the launch @zuck!  Needed this space.",
    "Elon Musk excited that the load on Twitter's servers is going down until he realizes why.",
    "Hope your shoulder is healing.  Can't wait for your next fight!",
    "There are so many great little design touches in threads.  Really great.",
    "Ugh I'm ALWAYS a very early adopter and 2303439 feels way late 🥺🥺",
    "Twitter = tweets Mastodon = toots Bluesky = skeets Threads = threats",
    "At this rate Twitter will be reduced to just a bunch of...threads",
    "So is each post a ‘Stitch’?",
    "Meta launches Instagram Threads in a direct challenge to Twitter",
    "Threads: Thirty million join Meta's Twitter rival, Zuckerberg says",
    "Threads app: Instagram owner's Twitter rival logs 5 million users in first hours",
    "Instagram's Threads bursts out of the gate with more than 30 million sign-ups",
    "More than 30 million people signed up for Meta's new Threads app",
    "Meta's Threads passed 20 million users within 12 hours, and it's not slowing down",
    "How to manage your Meta Threads notifications on Android",
    "Millions Join Meta Threads On Its First Day, Is Twitter Doomed?",
    "Meta Launches Threads, Betting Instagram Mojo Can Take on Twitter With New App",
    "Threads Already Has 10 Million Users in Just 7 Hours",
    "Threads app surges to 30M users, Zuckerberg says of Twitter rival",
    "Mark Zuckerberg gloats over Threads' 10 million signups",
    "10 million users joined Meta's Threads in just 7 hours. It took Twitter 780 days to do that",
    "Threads, Meta's answer to Twitter, surpasses 10 Million users in just seven hours",
    "Zuckerberg's Twitter rival Threads reaches 10M users in 7 hours",
    "10 million join Threads in under 10 hours, boosted by Instagram integration",
    "Meta Up 1.86% Premarket as Threads Gathers 10M Users in 7 Hours",
    "Millions flock to Instagram Threads, Elon Musk laughs at it",
    "Threads: Five million join new Meta app in matter of hours",
    "Instagram's Twitter Copycat Threads Meets Pent-Up Demand",
    "Twitter Competitor Threads Hits 5 Million Sign-Ups In 4 Hours, Meta CEO Mark Zuckerberg Says",
    "As Twitter Falters, Threads Surpasses 5 Million Sign Ups on Day One",
    "Threads at 30M users is legit insane Regardless of who you want to “win” That's nuts",
    "Welp, @FabrizioRomano is on Threads. It's for real [image]",
    "Just passed 5 million sign ups in the first four hours...",
    "Threads just passed 2 million sign ups in the first two hours.",
    "we haven't even launched the cool stuff yet!",
    "And here I was just a few hours ago putting rocket ship emojis on the 5 million post ...",
    "Arriving on Threads like...",
    "Threads Surpasses 30M Signups",
    "Threads: Ten million join Meta's Twitter rival, Zuckerberg says",
    "Meta on the Fediverse: Thread or Opportunity",
    "Standard protocol: In a post-Twitter world, Mastodon and Bluesky need to get on the same page",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "Threads: the best and worst features, and whether you should jump ship from Twitter",
    "Does Threads work on desktop? Web app explained",
    "Threads using decentralised protocol clear victory for our cause: Mastodon CEO",
    "honestly shocking to see how hard some people are shilling for meta after the launch of threads",
    "Hey @mosseri, quick question.  What button do I press so I only see the people I follow?",
    "Zuck doing this to Elon during Cancer season is top shelf petty.",
    "Mastodon CEO: What to know about Threads",
    "What to know about Threads - Eugen Rochko",
    "What to know about Threads",
    "@amethyst@haunted.computer",
    "@jaredwhite@indieweb.social",
    "What to know about Threads, Meta's Twitter rival app",
    "Instagram's Threads: ‘Almost every influencer will be hopping on it’",
    "Instagram head says a Threads ‘Following’ feed is ‘on the list’ of upcoming features",
    "Special Episode: Meta's Twitter Rival Arrives, with Adam Mosseri",
    "Users Join Threads in Droves",
    "Meta's Threads is a true threat to Musk-owned Twitter, analysts say",
    "Who to follow on Instagram Threads? Biggest streamers and influencers on Twitter rival",
    "How Brexit allowed UK to get Instagram Threads before EU",
    "Threads, Meta's Twitter competitor, is not yet available in the EU due to regulatory concerns",
    "Instagram Threads Is a Huge Hit! Here's Why That Should Worry You",
    "Threads/Twitter: copycat app hits Elon Musk where it hurts",
    "Threads Feed With Only People You Follow Is On The Way",
    "Everything you need to know about the new Twitter-like app called ‘Threads’",
    "Interoperability Will Be Key To Meta's Threads Success",
    "Meta Threads hands on: A cleaner, friendlier Twitter",
    "Here are 4 things you can't do on Threads, an Instagram app",
    "Instagram Threads memes are so funny it will make Elon Musk cry",
    "Download Threads by Instagram app for Android and iOS",
    "Threads, Meta's Twitter rival, is tracking you in all sorts of ways",
    "How to sign up for Threads - the new social media app on the block",
    "Is NFT Twitter Dead? Influencers Swarm Over to Zuckerberg's Twitter Rival - Threads",
    "Twitter rival Threads crosses 10 mn users within hours of launch",
    "Threads and Bluesky. [video]",
    "John Battelle's Search Blog",
    "International Business Times",
    "Just call them tweets … July 6, 2023 … Instagram Threads launched last night …",
    "Mark Zuckerberg claims Threads will succeed by being more “friendly” than Twitter",
    "3 Ways Instagram Threads Can Improve The Weather - Climate Social Media Experience",
    "Twitter rival Threads sees 23 million signups overnight",
    "Tech enthusiasts laud Zuckerberg on launch of Threads",
    "Threads, Koo, Bluesky: best Twitter alternatives you can try",
    "‘Goodbye Twitter’: Users say they're ditching the app for Mark Zuckerberg's Threads",
    "Meta's new Twitter clone, Threads, is now out in the wild",
    "Why Meta Platforms Was Rising Today",
    "Threads: We Don't Want to “Hang Out With Everybody.” Sometimes, We Want To Leave.",
    "Threads vs. Twitter: What's the Difference?",
    "Threads App Trending On Twitter: Hilarious Meme Fest Begins; Elon Musk Joins Fun [Reactions]",
    "Threads Had Big Launch Energy. Twitter Is Under Pressure",
    "in case there's anyone still here, here's what it's like over there https://www.ft.com/...",
    "I'm a mofuckin thread head bitch",
    "Which one cooler?  🧵🪡 A. Threader B. Threadist C. Threadhead D. Threadmate",
    "is this a place where we capitalize words y/n",
    "The pitch meeting for Threads: “It's Twitter but swap nazis for brands.”",
    "If threads is all about discussion, let's jump right in... Pizza Vs Pasta?  😎",
    "lol remember when we all hated meta / facebook and now we're back at it with the new shiny toy",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Taylor Swift might not have shaken off deal with FTX",
    "Tom Brady's NFT Startup Autograph Shifts Strategy Amid Struggles: NYT",
    "Should've Said No: Taylor Swift Reportedly Did Sign a Deal With FTX",
    "Taylor Swift's $100M FTX Deal Dashed by Sam Bankman-Fried, Leaving Her ‘Frustrated’",
    "Taylor Swift and Crypto: Sam Bankman-Fried Walked Away from FTX Deal",
    "turns out taylor swift wasn't as savvy as we all thought huh [image]",
    "Yes...a tiger and a lion. Right. https://www.nytimes.com/... [image]",
    "Is there tape of this https://twitter.com/... [image]",
    "Nobody can say no to Sam money https://twitter.com/...",
    "TAYLOR SWIFT AGREED TO FTX PARTNERSHIP, DESPITE CONTRARY PUBLIC CLAIMS -CNBC CITING SOURCE",
    "A Too Good To Check classic. [image]",
    "Great story on Tom Brady & FTX https://www.nytimes.com/...",
    "Cryptocurrencies went from the future of finance to the future of celebrity lawsuits",
    "How Tom Brady's Crypto Ambitions Collided With Reality",
    "@DrYohanJohn@fediscience.org",
    "@timnitGebru@dair-community.social",
    "@emilymbender@dair-community.social",
    "CFTC Concludes Former Celsius CEO Mashinsky Broke Rules Before Firm's Collapse: Report",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "Celsius and former CEO Mashinsky broke US rules, CFTC concludes: Bloomberg",
    "CFTC Investigators Conclude Celsius And Former CEO Violated Rules, Potential Case Looms",
    "Celsius And Ex-CEO Mashinsky Violated US Regulations, CFTC Rules",
    "CFTC Concludes Bankrupt Crypto Lender Celsius Broke Rules, Lawsuit Coming?",
    "Celsius ex-CEO ‘broke rules’, Valkyrie refiles for Bitcoin ETF, Fink backs crypto",
    "CFTC to find Celsius and Former CEO Mashinsky violated US rules, Bloomberg reports",
    "CFTC Finds Former Celsius CEO Mashinsky Broke Number Of US Rules",
    "CFTC Mulls Filing Fresh Case Against Celsius Network, Former CEO Mashinsky: Report",
    "CFTC investigators conclude ex-Celsius CEO Mashinsky broke US rules: Report",
    "CFTC Investigators Conclude Crypto Lender Celsius, Ex-CEO Broke Rules",
    "Our Plan for a Sustainably Open Social Network",
    "Twitter rival Bluesky launches custom domain names as first paid service",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "Purchase and Manage Domains Directly Through Bluesky",
    "Decentralized Twitter Rival Bluesky Announces $8M Fundraise, Paid Services",
    "Bluesky shares seed round, Threads launches, Twitter becomes money transmitter",
    "Bluesky starts selling domains to avoid advertising",
    "This is a pretty reasonable and inoffensive first paid service.  [embedded post]",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Samsung will unveil its new foldables on July 26th",
    "A new Samsung Galaxy device is coming—reserve now and get $50 off",
    "Don't miss your chance to save $50 off a Z Fold 5, Flip 5, Tab S9, or Watch 6!",
    "Samsung Galaxy Z Flip 5: Everything you need to know",
    "Samsung to Hold Next Galaxy Unpacked Event on July 26",
    "Get $50 in Samsung Credit when you preorder the next Galaxy Z Series phone, reserve now!",
    "More Samsung Galaxy foldable phone renders leak",
    "You can get $50 just for reserving a Samsung Galaxy Z Fold 5 or Z Flip 5",
    "Samsung to introduce its Galaxy Z Fold 5 and Z Flip 5 on July 26 to global markets",
    "Galaxy Unpacked 2023 Set for July 26: Join The New Flip Side",
    "Galaxy Z Fold 5 and Z Flip 5: Samsung confirms unveiling date, official images leak",
    "Reserve a Samsung Galaxy Z Fold 5 or Z Flip 5 and get $50 in credit for free",
    "Samsung Galaxy Z Fold 5 and Flip 5 preorder reservations are live: book yours now!",
    "Samsung Electronics to hold Galaxy Unpacked event on July 26",
    "Where to watch Samsung's July 26 Galaxy Unpacked event",
    "Samsung's summer foldable event officially streams on July 26th",
    "Samsung Unpacked Confirmed for July 26: ‘Join the Flip Side’",
    "Report: Google's first fully custom Pixel chip, Tensor G5, coming 2025 from TSMC",
    "We might not see a proper Google chip until the Pixel 10, but there's good news",
    "Google delays release of fully custom phone chip until 2025 - The Information",
    "Google reportedly delays release of fully custom phone chip until 2025",
    "Google to bring fully custom chipset for its Android phones",
    "Global VC deals slipped further in Q2 | Pitchbook",
    "So hard to believe it's just -50% [embedded post]",
    "DigitalOcean Acquires Paperspace to Expand AI Offerings",
    "DigitalOcean ramps up AI offerings via Paperspace deal for $111M",
    "DigitalOcean Buys Paperspace for $111m to Add AI Offerings",
    "DigitalOcean Buys Paperspace To Boost AI Capabilities",
    "Paperspace Joins DigitalOcean",
    "DigitalOcean acquires Paperspace (YC W15) for $111M in cash",
    "Free compensation benchmarking data from 3,000 startups",
    "Spotify is booting legacy subscribers still paying via Apple's App Store",
    "Spotify Flips The Finger At Apple By Killing App Store Payments",
    "Spotify to Boot Legacy Subscribers Who Still Pay Through Apple's App Store",
    "Spotify Premium Members Can No Longer Pay Via Apple's App Store",
    "Spotify Premium users on iPhone are in line for some bad news — here's why",
    "Spotify stops accepting payments that were set up through Apple's App Store",
    "Spotify kicks off legacy subscribers still paying through the App Store",
    "Spotify drops Apple's in-app payment system entirely: Here's what it means for users",
    "Spotify is removing App Store payment option for legacy subscribers",
    "Spotify cutting off Premium subscribers who still use Apple's payments system",
    "Spotify Stops Accepting Payments Set Up Via Apple's App Store",
    "Spotify Subscribers No Longer Allowed to Pay Through App Store",
    "@fawfulfan@mastodon.social",
    "@twwilliams@curmudgeon.cafe",
    "State Department cancels Facebook meetings after court order: report",
    "Ruling Puts Social Media at Crossroads of Disinformation and Free Speech",
    "What could go wrong? [embedded post]",
    "@danielschuman@mastodon.social",
    "Personalized wealth management, built for tech people",
    "Talent redeployment: Ensure good talent grows with your company's needs",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Lightmatter: Next-gen computing built for AI.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Thu. 07/06 - Uh, Did Threads Just Win?",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Big Banks, NY Fed's Innovation Group See Merit in Digital Ledgers for Global Payments",
    "NY Fed and financial firms report success with early digital assets payments",
    "SoftBank, Foxconn buy into Japan shelf-stocking robot startup",
    "Telexistence Raises USD 170M (JPY 23Bn) Series B",
    "SoftBank joins Japanese robotics startup's $170m round",
    "Clair Secures $175 Million Investment for on-Demand Pay Solution",
    "Clair, scoops $175m for a novel, on-demand payment solution",
    "Clair Raises $175M in Funding",
    "Payment processor Worldpay sells to private equity firm GTCR at valuation of $18.5 billion",
    "Payments processor FIS to cut debt with $11.7 billion stake sale in merchant unit",
    "FIS to sell Worldpay stake to GTCR",
    "FIS Sells Worldpay Stake to GTCR For $18.5 Billion",
    "FIS agrees sale of majority stake in Worldpay at $18.5bn valuation",
    "GTCR agrees to buy Worldpay at an $18.5 billion valuation",
    "Fidelity National to Sell Majority Stake in Worldpay for $12 Billion",
    "TSMC: Chinese Curbs on Rare Metal Exports Will Not Have Immediate Effect",
    "Apple chip production unaffected by Chinese sanctions, but things could get much worse",
    "China says it told the U.S. and Europe about the export controls in advance",
    "Asian chipmakers' nightmare is China's export curbs",
    "GT Voice: US, its allies need to listen to China's warning on key materials exports",
    "China Says Critical Metals Curbs ‘Not Targeting’ Any Country",
    "Taiwan chip giant sees no production hit from China curb on rare metals",
    "@mikedewar@mastodon.online",
    "Mastercard Employs AI to Help UK Banks Battle Fraud",
    "Mastercard leverages its AI capabilities to fight  real-time payment scams",
    "Mastercard AI-powered tool to help banks fight fraud",
    "@Techmeme @KatrinaManson 😂",
    "Blur founder defends platform amid NFT market slump",
    "Ethereum NFT royalties hit 2-year low as Bored Ape floor price falls below 30 ETH",
    "Declining Royalty Payments: Nansen Study Highlights NFT Creator's Concerns",
    "It gets funnier by the day that they tried to brand this shit “web3” [embedded post]",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "NYC law governing AI-based hiring tools goes live",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "New York employers must now tell applicants when they encounter AI",
    "America's first law regulating AI bias in hiring takes effect this week",
    "NYC law requires companies to prove A.I. hiring software is not racist or sexist",
    "New York City Targets AI Use in Hiring: Anti-Bias Law Explained",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "Twitter receives money transmitter licenses in three US states",
    "US Navy researchers expose Microsoft Teams security flaws",
    "Microsoft on TeamsPhisher: ‘Nothing to see here’",
    "A member of the US Navy created a tool made to exploit a Microsoft Teams flaw",
    "The US Navy has hacked Microsoft Teams to send malware",
    "Microsoft Teams Exploit Tool Auto-Delivers Malware",
    "New tool exploits Microsoft Teams bug to send malware to users",
    "BREAKING: Vimeo is still around https://twitter.com/...",
    "Introducing Superalignment  —  We need scientific and technical breakthroughs to steer …",
    "OpenAI Launches Alignment Initiative Aimed at Mitigating ‘Superintelligent’ AI",
    "OpenAI commits to ‘superalignment’ research",
    "OpenAI Launches New “Superalignment” Team to Protect against Rogue AI",
    "OpenAI forms a new team to ensure safe development of Superintelligent AI",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/...",
    "so many grandiose sounding yet vacuous words in one blog post https://twitter.com/...",
    "I had to read the mind-numbing word “superalignment” and now so do you. https://twitter.com/...",
    "My alignment is bigger than yours. https://twitter.com/...",
    "Guys, time to drop a new buzzword https://twitter.com/...",
    "Four years to save humanity from its own creation... the race is on... https://twitter.com/...",
    "“we aim to make sure god has good morals” https://twitter.com/...",
    "OpenAI has gone off the deep end. https://openai.com/...",
    "How droll. What we really need is a superduperalignment team. https://twitter.com/...",
    "openai: Superintelligence is coming in 10 years.",
    "OpenAI is forming a team to rein in superintelligent AI",
    "ChatGPT sees its first monthly drop in traffic since launch",
    "Booming traffic to OpenAI's ChatGPT posts first ever monthly dip in June -Similarweb"
]