[
    "Tether Says It Will Buy Bitcoin for Stablecoin Reserves Using Realized Profits",
    "Tether's Latest Investment Strategy: Make Profits, Buy Bitcoin",
    "Tether Pledges to Plow 15% of Profits into Bitcoin",
    "Tether to Purchase Bitcoin as Part of Reserves Strategy Shift",
    "Tether bets big on Bitcoin plans to invest up to 15% of profits in BTC",
    "Tether to spend profits on growing its mysterious bitcoin reserves",
    "Tether to Use 15% of Profits to Grow Bitcoin Holdings",
    "Tether uses Bitcoin to strengthen its reserves",
    "Tether Bought $1.5 Billion Bitcoin, Will Buy More",
    "Tether Plans 15% of Its Net Profits Into Bitcoin in Move of Confidence",
    "New survey says Bitcoin is safer than the US dollar — Watch The Market Report",
    "Tether buys $222 million worth of bitcoin to back its USDT stablecoin",
    "Tether Will Buy Bitcoin: Allocating 15% of Net Realized Operating Profits Regularly in BTC",
    "Breaking: Tether To Invest Monthly Net Profit Into Bitcoin",
    "Tether USDT to strengthen reserves with Bitcoin purchase",
    "Tether Reveals Strategy to Invest up to 15% of Profits in Bitcoin",
    "Tether to Allocate up to 15% of its Profits Towards Purchasing Bitcoin",
    "The Dangers of Google's .zip TLD",
    "New TLDs: Not Bad, Actually",
    "Don't panic.  Google offering scary .zip and .mov domains is not the end of the world",
    "Hackers are using a devious new trick to infect your devices",
    "Want a new Google zip domain? It could be a serious security risk",
    "Is the new .zip top-level domain a cyber security risk?",
    "Some recently registered .ZIP domains 🤭 [image]",
    "There's no way this will go badly https://twitter.com/...",
    "whose idea was this? https://twitter.com/...",
    "coming out with a .zip TLD seems like a real chaos move",
    "lol dont go to https://42.zip/ https://twitter.com/...",
    "Ripple Takes on the Crypto Custody Market with Metaco",
    "Ripple Buys Crypto Custody Firm Metaco for $250 Million and Expands to Tokenization",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for $250M",
    "Ripple Buys Crypto Custody Firm Metaco for $250M",
    "Ripple buys crypto custody firm Metaco for $250 million",
    "Crypto firm Ripple acquires custody provider Metaco for $250m",
    "Ripple buys crypto custody provider Metaco",
    "Ripple Purchases Metaco Amid Ongoing Battle With SEC",
    "Ripple acquires crypto custody startup Metaco for $250 million",
    "Ripple buys controlling interest in Metaco, a digital technology company",
    "Ripple Acquires Crypto Custody Firm Metaco for $250M in Tokenization Push",
    "Ripple shells out $250 million as it acquires crypto custody firm Metaco",
    "Ripple acquires crypto custody firm Metaco in $250M deal",
    "Crypto firm Ripple buys Swiss startup as SEC crackdown forces companies to consider overseas moves",
    "Ripple Acquires Swiss-based Digital Asset Custody Provider Metaco",
    "Ripple acquires crypto custodian Metaco for $250 million",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for US$250M",
    "Ripple Acquires Metaco in $250M Crypto Custody Deal, XRP Price Surge Nearly 6%",
    "Ripple acquires Switzerland-based crypto custody startup Metaco for $250 million",
    "Ripple Buys Crypto Custody Firm Metaco for $250 Million",
    "Ripple Labs acquires digital asset custody provider Metaco for US$250 mln",
    "Ripple Acquires Metaco: “Ripple Wouldn't Be Acquiring Companies, If They Had Any Worries”",
    "Breaking: Court victory for Ripple as judge denies SEC motion to seal Hinman docs",
    "Judge in SEC v Ripple denies motion to seal Hinman communications",
    "Judge denies SEC motion to seal Hinman speech documents in Ripple case",
    "Win for Ripple as Judge Torres Denies The SEC's Motion To Seal The Hinman Speech Documents",
    "Major win for Ripple as judge denies SEC's motion to seal Hinman documents",
    "Waves founder denies Russian mafia links, Ripple judge denies SEC motion to seal crypto speech",
    "Ripple XRP rises 7% after judge denies SEC's motion to seal Hinman documents",
    "Hinman documents to be made public in Ripple vs SEC lawsuit",
    "Pro-XRP Attorney Praises Judge Torres as “The People's Judge” in Landmark Ruling",
    "SEC's Request to Seal Hinman Documents Denied by Court",
    "Ripple CEO Celebrates Key Milestone in SEC Lawsuit",
    "Ripple Vs. SEC: Judge Denies The Sealing of Hinman's Speech Once Again",
    "XRP lawsuit: Judge denies SEC motion to seal documents in win for Ripple",
    "Court Denies SEC's Request To Seal Hinman Documents In Ripple Lawsuit",
    "CNBC Television on YouTube",
    "@MikeElgan@mastodon.social",
    "@malwaretech@infosec.exchange",
    "@jsrailton@mastodon.social",
    "@Jonathanglick@mstdn.social",
    "Elon Musk doubles-down on Tesla robotaxis in TV interview",
    "Elon Musk Criticizes OpenAI for Its for-Profit Move After $50M Investment",
    "CNBC Exclusive: CNBC Transcript: Elon Musk Sits Down with CNBC's David Faber Live on CNBC Tonight",
    "Elon Musk keeps insisting the Texas shooter with a swastika tattoo is not a white supremacist",
    "Israeli government blasts Musk attack on Soros for ‘reeking of antisemitism’",
    "Elon Musk reveals Tesla's plans to experiment with ads",
    "Remote CEO Elon Musk Slams People Who Work From Home: ‘The Laptop Class Is Living in La La Land’",
    "Musks says ‘so be it’ to consequences of his tweeting",
    "Tesla may reverse its stance and start advertising",
    "Musk says ‘laptop class’ should stop ‘the work-from-home’ BS",
    "Facebook verification comes to UK; Musk says working from home ‘morally wrong’",
    "I will tweet what I want even if it loses me money",
    "Elon Musk teases two new EVs, says Tesla is already building one",
    "Elon Musk says work from home is ‘bull**it’ and ‘morally wrong’",
    "Musk Criticizes Working From Home as Morally Dubious Practice",
    "Elon Musk on Sam Altman and ChatGPT: I am the reason OpenAI exists",
    "Tesla is going to try advertising says Elon Musk who ‘hates’ it",
    "Elon Musk: Working from home is ‘morally wrong’ when service workers still have to show up",
    "Tesla will ‘try a little advertising’, Elon Musk says",
    "Elon Musk: I will say what I want even if it loses me money",
    "Elon Musk is asked about his Tweet saying George Soros reminds him of Magneto 🤣 [video]",
    "The Self-Destruction of Elon Musk https://twitter.com/... [video]",
    "@Techmeme @rogoswami Those who live in la la land glass houses shouldn't throw ephemeral stones",
    "Texas police have confirmed the shooter had Nazi tattoos. https://twitter.com/...",
    "Spaces interview with @davidfaber starting now",
    "“the laptop class is living in la la land” - elon musk in a live cnbc interview right now",
    "Absolute nonsense all the way down https://twitter.com/...",
    "he's so fucked up lol https://twitter.com/...",
    "the shooter literally had a swastika tattoo https://twitter.com/...",
    "@campuscodi@mastodon.social",
    "Lancefly: Group Uses Custom Backdoor to Target Orgs in Government, Aviation, Other Sectors",
    "Sophisticated Merdoor backdoor long used in Lancefly APT attacks",
    "New APT targets South and Southeast Asia with custom-written backdoor",
    "Stealthy MerDoor malware uncovered after five years of attacks",
    "Lancefly APT uses powerful Merdoor backdoor in attacks on Asian orgs",
    "Researchers Uncover Powerful Backdoor and Custom Implant in Year-Long Cyber Campaign",
    "Lancefly APT Custom Backdoor Targets Government and Aviation Sectors",
    "Threat Actor Uses Merdoor Backdoor to Hit Asian Orgs",
    "Lancefly APT Targeting Asian Government Organizations for Years",
    "‘FriendlyName’ Buffer Overflow Vulnerability in Wemo Smart Plug V2",
    "PSA: time to recycle your old Wemo smart plugs (if you haven't already)",
    "Critical security flaw is exposing older Wemo Smart Plugs to hackers",
    "Serious Unpatched Vulnerability Uncovered in Popular Belkin Wemo Smart Plugs",
    "PSA: Older Wemo Smart Plugs Have Vulnerability That Leaves Them Open to Attack",
    "Researchers find exploit in Belkin's Wemo Mini Smart Plug V2",
    "Ministers looking at body-worn facial recognition technology for police",
    "One of the many reasons I quit my job in facial recognition. https://twitter.com/...",
    "YouTube's recommendations are leading kids to gun videos, report says",
    "YouTube's recommendations send violent and graphic gun videos to 9-year-olds, study finds",
    "Okay, Google, How Are Your Fancy Math Recommendation Procedures Working? Just Great, You Say",
    "YouTube Accused Of Pushing Violent Content To Children",
    "Study shows YouTube is recommending gun videos to young gamers",
    "Disturbing Results: YouTube's Algorithm Recommends Harmful Content to Young Viewers",
    "Study finds YouTube algorithm can push violent, graphic videos to young children",
    "Stability AI Releases StableStudio, the Open-Source Future of DreamStudio",
    "Stability AI releases StableStudio to become an open-source platform for AI",
    "Stability AI's StableStudio Wants to Be the One-Stop-Shop for ‘Open Source’ AI",
    "Latest moves show Stability AI is fully committed to open source — well, mostly",
    "Stability-AI / StableStudio Public",
    "Volkswagen China Responds to Talks with Huawei Over the Use of Its Software",
    "German Volkswagen met Huawei for car software",
    "Ex-Apple Engineer Indicted in Crackdown on Flow of Restricted Tech to China, Russia",
    "Canada, South Korea sign critical minerals deal in bid to reduce China dependence",
    "@briankrebs@infosec.exchange",
    "Amazon pops out a new Echo smart speaker",
    "Amazon undercuts the Echo Dot with the $40 Echo Pop",
    "Amazon unveils Echo Pop, new Echo Buds; reports >500M Alexa device sales as AI upends market",
    "Amazon unveils a new lineup of Echo devices—here's your first look",
    "Amazon Goes After Apple's AirPods With a $50 Set of Wireless Earbuds",
    "Amazon Announces New Alexa-Powered Echo Devices",
    "Amazon's new Echo Pop speaker looks cheap and cheerful at $40",
    "Amazon Echo News (2023): Echo Show 5, Echo Buds, Echo Pop",
    "Amazon's latest Echo Buds have an all-new design and much cheaper price",
    "A fresh batch of Amazon Echo devices is here and one of them is brand new!",
    "Amazon's 2023 Echo Show is faster and offers improved audio",
    "Amazon's redesigned Echo Buds are only $50",
    "Amazon unveils the $40 Echo Pop, a semi-spherical smart speaker",
    "Amazon Launches $40 Eero-Equipped Echo Pop Speaker, $50 Echo Buds",
    "Amazon expands its Echo portfolio with a new speaker and a few hardware upgrades",
    "Amazon Refreshes Echo Lineup With New Echo Pop, Redesigned Echo Show 5, and More",
    "Amazon Unveils New Gadgets as AI Race Heats Up",
    "Amazon Echo Lineup Expands With Next-Gen Buds, Pop, And Show 5",
    "Amazon Introduces Four All-New Echo Devices",
    "Amazon announces new Echo with funky design and revamped earbuds",
    "Uber is adding new features to make group rides and activities cheaper and easier to split",
    "Uber will now let teens ride in cars alone",
    "Uber puts family (even teens) at the center of its new products and features",
    "You can now call an Uber like a normal taxi",
    "Uber Wants to Be Your Kids' Chauffeur",
    "You can now hail an Uber by calling a number",
    "Minnesota bill regulating Uber and Lyft advances",
    "Here's everything Uber just announced at its annual Go/Get product event",
    "Uber to allow Canadian teens to set up ride-share accounts this summer",
    "Uber Taps New User Base With Ride, Delivery Option For Teens",
    "Uber rolls out updates, including a way for teens to book rides",
    "New paid family, medical leave law for rideshare drivers could increase fares",
    "Parents can now stalk their kids with new Uber features",
    "Instagram comments can now be overrun by GIFs",
    "Instagram users can finally comment on posts with GIFs",
    "Introducing New Features to Make the Most of Your Instagram Experience",
    "Instagram Adds GIFs in Comments",
    "Instagram will soon support GIF comments on posts and Reels",
    "Instagram rolls out new features - gif comments, edit tools",
    "You can now comment with GIFs on Instagram, here's how",
    "Instagram will Now Let Users Post GIFs in Comments",
    "Commenting gets animated with GIFs on Instagram",
    "Instagram enables GIF comments on posts, Reels; previews Gifts, Reels editing, more",
    "Instagram enables the ability to comment using GIFs",
    "*checks date* Welcome to 2023 https://twitter.com/...",
    "Beats Studio Buds Plus review: A worthy upgrade",
    "Beats Studio Buds Plus Review: Transparently Special",
    "Beats is back with new Studio Buds Plus that are made by Apple but work with Android",
    "Steve Jobs unveils Apple Computer Corporation's new Macintosh February 6, 1984 in California.",
    "Beats Studio Buds + review: A little bit better in every way",
    "The Beats Studio Buds + Are Apple's Best Wireless Headphones Bargain",
    "Beats launches $169 Studio Buds + with a transparent option",
    "Beats Studio Buds + Deliver Improved Performance and a Transparent Design Option for $169.99",
    "Beats Studio Buds+ now available to order with better ANC, transparent option",
    "Hands-on: Beats Studio Buds+ are the transparent AirPods we wish Apple would make",
    "Apple Unveils Beats Studios Buds+",
    "Beats Studio Buds+ vs Apple AirPods Pro 2: Which should you buy?",
    "Beats Studio Buds+ Review: A Snug-Fitting Sweet Spot For ANC Earbuds",
    "Beats Studio Buds+ review: clearly better buds",
    "Beats Studio Buds+ review: Immersive soundscapes",
    "Beats Studio Buds + Review",
    "Beats Studio Buds+ hands-on review",
    "Beats Studio Buds+ vs Studio Buds: what's the difference?",
    "Can't beat Verge photography. So good. Clear all the gadgets again. https://twitter.com/...",
    "Ledger Recover by Coincover",
    "‘Backdoor’ for Seed Phrases? Ledger's New Recovery Feature Spooks Users",
    "Ledger Faces Backlash for Controversial Backup Tool as Crypto Community Expresses Discontent",
    "Ledger Comes Under Fire Over Seed Phrase Recovery Service Fiasco",
    "Hardware wallet manufacturer Ledger faces backlash over new feature",
    "Crypto hardware maker's recovery feature draws ire",
    "‘There Is No Backdoor,’ Ledger Says in Response to Recover Reactions",
    "teenage engineering has the opportunity to do something incredibly funny https://twitter.com/...",
    "Stupidest idea you can make as a hardware wallet manufacturer.... https://twitter.com/... [image]",
    "India introduces a $2B program to boost local IT hardware production",
    "iPad production in India likely to start soon, as Apple gets tax deal",
    "India devises bumper scheme for laptop, tablet makers with four-fold jump in incentives",
    "India expands production incentive plan for IT products to $2 bln",
    "India launches $2 billion incentive plan to court laptop, tablet makers like Apple",
    "India Launches $2 Billion Drive To Woo Laptop Makers Like Apple",
    "International Business Times",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple: App Store Blocked $2+ Billion in Fraud in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "Apple blocked over $2B of fraudulent App Store transactions in 2022",
    "Record $2 billion in fraudulent App Store transactions blocked in 2022, Apple says",
    "Apple Blocked 1.7 Million Applications From App Store in 2022",
    "App Store stopped over $2 billion in fraudulent transactions in 2022, Apple claims",
    "App Store's anti-fraud measures halt more than $2 billion in 2022",
    "Apple's App Store is a fortress; over $2 bn in fraudulent transactions in 2022 [details]",
    "Apple's App Store stopped over $2 billion in fraudulent transactions last year",
    "Apple Touts Fraud and Abuse Prevention in the App Store",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "What's more important for training AI — data or compute?",
    "From “you are the product” to “you are the input into a LLM” https://twitter.com/...",
    "ProTips: 4 reasons why integrating your CRM and sales engagement tool is crucial for sales success",
    "Report: Shein Raises $2 Billion but Slashes Valuation by 1/3",
    "Fashion giant Shein raises $2 billion but lowers valuation by a third",
    "International insurtech bolttech valued at $1.6 billion in Series B up-round",
    "SG insurtech unicorn bolttech raises $196m Series B round at $1.6b valuation",
    "Insurtech Unicorn Bolttech Raises $196 Million, Nudging Up Valuation",
    "Insurtech Unicorn Bolttech Raises $196 Million",
    "Japanese security integration company Secom invests $192M into Eagle Eye and Brivio",
    "Bethesda's Brivo just raised $92.5M in a dual investment round",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/17 - Open Source Vs. Centralized AI, Part II",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "70% of Trump Voters Think AI Threatens Humanity, Poll Finds",
    "Most Americans Fear AI Is A Threat To Humanity And This Poll Proves It",
    "6 in 10 view AI as threat to humanity's future: poll",
    "China's Tencent marks return to revenue growth in first quarter",
    "Tencent posts strong quarterly result on China's COVID reopening",
    "Tencent posts 11 per cent rise in first-quarter revenue",
    "Tencent Q1 2023 Earnings Statement Rides High on Increased Payment Volumes, Ad Sales, Gaming",
    "TENCENT ANNOUNCES 2023 FIRST QUARTER RESULTS",
    "Tencent posts fastest jump in quarterly revenue in more than a year after China reopens",
    "Google Cloud Press Releases",
    "Google's latest AI tackles long and costly drug discovery",
    "Google Cloud unveils AI suites for faster and cheaper drug development",
    "How HPC and generative AI will accelerate drug discovery and precision medicine",
    "Baltimore Business Journal",
    "Cybersecurity firm Huntress raises $60M as it eyes international expansion",
    "Huntress Adds $60 Million in Funding to Expand Managed Security Business",
    "Huntress Raises $60M Series C for Its Cybersecurity Tech",
    "New Investment Fuels Our Mission To Enable SMBs to Better Protect Their Business Assets",
    "Cybersecurity startup Huntress raises $60M Series C round",
    "Huntress Lands $60M, Eyes Potential IPO In Coming Years",
    "CORRECTION: Rumble Acquires Podcasting and Live Streaming Platform Callin",
    "IBM to Help Automate Cloud Data Protection with Acquisition of Polar Security",
    "IBM snaps up Israeli cloud data security start-up Polar Security",
    "IBM boosts cloud data security portfolio with Polar Security acquisition",
    "IBM acquires Israeli co Polar Security",
    "IBM Snaps up DSPM Startup Polar Security",
    "IBM snags Polar Security to boost cloud data practice",
    "@kevincollier@mastodon.social",
    "IPVM Physical Security Technology Information",
    "Ring Founder Taking Over Latch (Latch / HDW Merger)",
    "Latch to Acquire Ring Founder Jamie Siminoff's Latest Company, Honest Day's Work",
    "Ring founder takes over as Latch CEO shortly after leaving Amazon",
    "Ring founder to become CEO of commercial smart home company Latch",
    "Yet Another Bug in Facebook Ads",
    "These glitches never seem to benefit the buyer https://twitter.com/...",
    "Updating our inactive account policies",
    "How to keep your Gmail account active so Google doesn't delete it",
    "Haven't Checked Your Gmail in a While? Google May Delete Your Account.",
    "Google will start deleting inactive accounts: Gmail, Docs, YouTube at risk",
    "It's not just Gmail, Apple will delete your inactive iCloud account faster than Google",
    "Google will delete accounts that have been inactive for two years, tech giant announced",
    "Google targeting Aunt Edna for deletion",
    "Google Will Delete Inactive Accounts to Improve Security",
    "Google will delete your account for this simple reason: Heres why",
    "Warning: Google will delete inactive accounts!",
    "Google says it will start deleting inactive accounts later this year",
    "Got an old Google account you want to keep? It may be in danger of permanent deletion",
    "Google is Deleting Accounts That Have Not Been Used in The Past Two Years",
    "Google to delete accounts that have been inactive for two years",
    "Google will purge inactive accounts as a security measure",
    "How to set up Google Inactive Account Manager: A step-by-step guide",
    "Google will start deleting inactive accounts and wiping out user data later this year",
    "Google will delete these accounts starting December this year: Should you worry?",
    "Here's why your Gmail account may be at risk of being deleted",
    "Google will start hacking away at inactive accounts later this year",
    "Google may delete your Gmail account if it's been inactive for too long",
    "Google's coming for your old accounts",
    "If you haven't logged into your Google account in over 2 years, it will be deleted",
    "Use it or lose it: Google says it will delete inactive accounts",
    "Google warning: Inactive accounts, all their content may be deleted",
    "Google will start deleting inactive accounts later this year",
    "Google will start deleting inactive accounts after two years",
    "In December, Google's Deleting a Ton of Inactive Accounts",
    "Google Will Delete Accounts That Have Been Inactive For Two Years",
    "Google to delete inactive accounts starting December",
    "This is smart, assuming deletion really means deletion. https://blog.google/...",
    "Zoom Partners with Anthropic to Expand Federated Approach to AI",
    "Zoom makes a big bet on AI with investment in Anthropic",
    "AI monetization! https://twitter.com/...",
    "United States District Court for the Northern District of California",
    "U.S. Tech Espionage Team Unveils First Cases Involving China and Russia",
    "Baidu boss charged with stealing Apple's self-driving car tech",
    "DOJ charges former Apple engineer with theft of autonomous car tech for China",
    "Indictment  —  At all times relevant to this Indictment: 1.  Apple, Inc. (\"Apple\") …",
    "DoJ charges former Apple engineer with stealing autonomous car secrets",
    "Another Apple employee allegedly caught stealing self-driving car tech for China",
    "Ex-Apple engineer accused of stealing self-driving cars technology for China. Details",
    "Former Apple engineer charged for selling AppleCar tech to China",
    "Ex-Apple Employee Accused of Stealing Trade Secrets for Baidu's Autonomous Car Project",
    "Another Former Apple Employee Charged With Stealing Car Secrets for China",
    "DOJ charges former Apple engineer with stealing self-driving car technology for China",
    "US charges former Apple engineer with attempt to steal self-driving car tech",
    "US ‘strike force’ charges Chinese and Russian nationals with stealing sensitive tech",
    "they stole the apple car! 😂 that never launched",
    "HealthcareInfoSecurity.com",
    "Russian ransomware affiliate charged with attacks on critical infrastructure",
    "Russian National Charged with Ransomware Attacks Against Critical Infrastructure",
    "U.S. Department of the Treasury",
    "Alleged Russian Hacker Charged and Sanctioned for Role in $200 Million Ransomware Rampage",
    "Office of Foreign Assets Control",
    "Cyber-related Designation  —  SPECIALLY DESIGNATED NATIONALS LIST UPDATE",
    "US Formally Charges Russian Hacker Behind Global Ransomware Attacks",
    "U.S. Targets Russian Mastermind Behind Dominant Ransomware Landscape, Offers $10 Million Reward",
    "Alleged Russian Hacker Charged in $200 Million Ransomware Spree",
    "Russian man charged over ransomware attacks, including against D.C. police",
    "US Offering $10M Reward For Russian Man Charged With Ransomware Attacks",
    "US CHARGES, SANCTIONS RUSSIAN RANSOMWARE OPERATOR WHO LEAKED STOLEN DC POLICE DATA",
    "US puts $10 million bounty on Russian hacker's head",
    "Alleged Babuk Ransomware Hacker ‘Wazawaka’ Indicted in US",
    "Alleged Babuk ransomware gang leader ‘Wazawaka’ indicted, sanctioned by US",
    "US sanctions Russian accused of being a ‘central figure’ in major ransomware attacks",
    "@DavidNielsen@mastodon.social",
    "Apple accessibility improvements welcomed by disabled people, with more opportunities ahead",
    "iPhones will be able to speak in your voice with 15 minutes of training",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple Previews Major New Accessibility Features for iOS",
    "Your iPhone will soon be able to speak with your voice",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple Adds Live Speech and AI-Based Voice Generation in iOS 17",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Apple to Expand Accessibility Options in 2023",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "@viticci@mastodon.macstories.net",
    "@blakereid@mastodon.lawprofs.org",
    "@johnvoorhees@mastodon.macstories.net",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2"
]