[
    "Gurman: First M3 Macs may launch by end of the year, chip has more CPU/GPU cores compared to M2",
    "Apple's ‘M3 Pro’ chipset could feature 12 CPU cores",
    "Apple M3 chip: all the news, announcements, and rumors so far",
    "Apple M3 Pro chipset could have 12 CPU cores",
    "Apple M3 Mac models with over 108 cores may launch by year-end",
    "Apple's next-gen M3 Pro chip could pack even more CPU and GPU cores",
    "Report: Apple Testing M3 Pro Chips With 12 CPU and 18 GPU Cores",
    "Apple Is Already Testing The M3 And M3 Pro Chips, New Leak Reveals",
    "Apple M3 Mac Chip Specs and Features Revealed, Says Report",
    "Apple is testing an M3 Pro chip for a MacBook Pro upgrade coming in 2024",
    "Apple Reportedly Testing Powerful M3 Chip, Outpacing the Yet Unreleased M2",
    "First M3 Macs to arrive in late 2023 with improved CPU/GPU cores",
    "Future AirPods Pro with built-in thermometer still on Apple's roadmap, but timing remains unclear",
    "Rumored next-generation Apple Silicon processor expected in fall 2023 at the earliest",
    "Gurman: Apple Testing ‘M3 Pro’ Chip for MacBook Pro With 12-Core CPU and 18-Core GPU",
    "Apple Testing ‘M3 Pro’ Chip With 12 CPU Cores, 18 GPU Cores [Gurman]",
    "Apple's M3 Pro reportedly coming with 12 CPU cores, 36 GB of memory",
    "Apple Begins Testing Speedy M3 Chips That Could Feature 12 CPU Cores",
    "The Apple headset is so good.",
    "@CixLiv a lot of rich folk now claiming the metaverse is hot. not dead. lol so sad.",
    "Well... this would change everything. https://twitter.com/...",
    "Top AI Email Assistants in 2023",
    "Forget ChatGPT. These Are the Best AI-Powered Apps.",
    "Co-Writing with Opinionated Language Models Affects Users' Views",
    "Australian Financial Review",
    "Aristocrat Leisure to buy software firm NeoGames for US$1 billion",
    "Aristocrat to buy gaming software firm NeoGames",
    "Aristocrat agrees to pay $1.2 billion for Nasdaq-listed NeoGames",
    "Aristocrat to acquire European RMG platform provider NeoGames in US$1.2 billion deal",
    "@AnnemarieBridy@mastodon …",
    "New York AG fines companies that spammed FCC with fake anti-net neutrality comments",
    "Three Companies Faked Millions of Comments Supporting 2017 Repeal of ‘Net Neutrality’ Rules",
    "Free compensation benchmarking data from 3,000 startups",
    "International Business Times",
    "@ampersarnie@mastodon.social",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election",
    "Twitter says it will restrict access to some tweets before Turkey's election",
    "Twitter under fire for perceived censorship ahead of election in Turkey",
    "Twitter succumbs to Erdoğan's pressure, silences key voices in Turkey on election eve",
    "Twitter joins Turkey's presidential debate, censoring posts ahead of election",
    "Twitter blocks content in Turkey ahead of pivotal elections after threat to ban platform",
    "Twitter Restricts Content in Turkey Ahead of Elections",
    "Erdogan appears headed for a runoff in race keep his job as president of Turkey",
    "Elon Musk faces backlash for content restrictions in Turkey ahead of presidential election",
    "Why Turkey's Election Is All About the Economy",
    "Erdogan Faces Runoff in Turkish Presidential Election",
    "Results start trickling in for fiercely fought elections that could unseat Turkey's Erdogan",
    "Turkey Quake City 'Won't Vote For Erdogan Again'",
    "Erdogan leads in Turkey's election, but opposition disputes numbers",
    "Turkey election 2023 live news: Voting ends in tight race",
    "@Techmeme There's nothing fishy about that, at all.",
    "Freedom of speech vs. just a figure of speech. https://twitter.com/...",
    "Elon got pwned here. https://twitter.com/...",
    "Lend Twitter some of that donation money so they can fight it too then 🤗 https://twitter.com/...",
    "Free speech absolutist seems super sensitive today https://twitter.com/...",
    "Free speech king Elon Musk strikes again! https://twitter.com/...",
    "this whole Twitter free speech thing is going just as you might expect https://twitter.com/...",
    "Elon Musk, free speech champion https://www.forbes.com/...",
    "Fanatics to buy PointsBet's U.S. assets for about $150 million",
    "Fanatics to Buy PointsBet's US Business in Sports Betting Push",
    "Fanatics to Buy PointsBet's U.S. Arm for $150M, to Boost Betting Push",
    "Fanatics Buying PointsBet US Sports Betting Business For $150 Million",
    "A joint statement from Fanatics Betting & Gaming and PointsBet: [image]",
    "It is insane how many ventures @Fanatics has their hands in. https://twitter.com/...",
    "@thomasapowell@fosstodon.org",
    "Privacy and civil rights groups warn against rapidly growing mass-surveillance network",
    "Biometric data is the new oil. https://www.context.news/...",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Yelp: Connect people with great local business.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "TikTok: Inspire creativity and bring joy.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "(IHP Bonus) Tesla Cofounder Marc Tarpenning",
    "Vice Media files for bankruptcy; the filing will not interrupt daily business operations",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Pakistan's political turmoil over Imran Khan's arrest, explained",
    "Pakistan Ex-PM Imran Khan Calls For Nationwide Protests",
    "Imran Khan alleges Pak Army's plan to keep him in jail for 10 yrs",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "Amazon is focusing on using A.I. to get stuff delivered to you faster",
    "Amazon optimizes delivery network for speedier delivery, lower costs",
    "‘Virtual Girlfriend’ Chatbot Trained on Conversations With Men Starts Talking Mostly About Sex",
    "This AI girlfriend made $72k in a week",
    "Snapchat influencer launches an AI-powered ‘virtual girlfriend’ to help ‘cure loneliness’",
    "AI is about to take parasocial influencer relationships to the next level",
    "JioCinema vs Hotstar and other OTTs compared: Which to subscribe and which to skip",
    "JioCinema Unveils Subscription Plan For Premium Content To Take On Netflix, Other OTT Rivals",
    "JioCinema Premium subscription plan launched: Here's everything about it",
    "Indian billionaire Ambani's JioCinema unveils pricing in fight with Netflix, Disney",
    "No more freebies: Ambani's JioCinema to now charge premium subscription for HBO and other content",
    "JioCinema Premium subscription plan launched in India: check out price, list of HBO shows and more",
    "JioCinema makes SVoD debut with HBO, WB shows",
    "JioCinema Premium subscription plan launched as HBO shows arrive on the platform",
    "How much is ChatGPT Plus and what does the ChatGPT subscription get you?",
    "OpenAI rolls out ChatGPT plugins for paid subscribers",
    "OpenAI rolling out ChatGPT plugins to Plus users",
    "OpenAI rolls out web browsing and plugins to all ChatGPT Plus users",
    "OpenAI brings 70+ ChatGPT plugins and web search to all ChatGPT Plus users",
    "How to Turn on ChatGPT's New Beta Web Browsing and Plugins Features",
    "Introducing New Features in ChatGPT",
    "Major CEX Joins Crypto Businesses' Canada Exodus; Cites ‘No Longer Tenable’ Market Condition",
    "Binance Faces Regulatory Obstacles in Canada, Decision to Exit Announced",
    "Binance: Canadian Market ‘No Longer Tenable’ After New Regulations",
    "Binance exits Canada amid increased regulation in North America",
    "Binance leaves Canada due to stricter crypto rules",
    "Binance Pulls Out of Canada Amid Tougher Crypto Regulation",
    "Binance pulls out of Canada amid new crypto regulations",
    "World's Biggest Crypto Exchange Binance is Leaving Canada",
    "Binance to Exit Canada After Country Imposes New Crypto Rules",
    "Binance pulls out of Canada amid tightening crypto regulations",
    "Binance Set To Leave Canadian Market Due To Unfavorable Regulatory Landscape",
    "Binance pulls out of Canada, cites incompatibility with local market conditions",
    "Breaking: Binance Will Proactively Withdraw From The Canadian Crypto Marketplace",
    "Binance Exits Canadian Market Due to New Regulations",
    "I remember when Binance “exited” the United States https://twitter.com/... https://twitter.com/..."
]