[
    "Reddit CEO Steve Huffman has been taking lessons from Elon Musk's “violent changes” …",
    "More Reddit layoffs incoming?",
    "Dude might be taking the wrong lessons from the last few months",
    "So the Reddit CEO sees this as a success story. Wild stuff. https://twitter.com/... [image]",
    "Reddit CEO praises Elon Musk's cost-cutting as protests rock the platform",
    "Reddit CEO praises Elon Musk's cost-cutting as protests rock platform",
    "Reddit CEO praises Elon Musk as protests rock the platform",
    "Reddit tyrant-in-chief finds more fuel for the dumpster fire with threat to replace moderators",
    "Reddit CEO Threatens to Boot Moderators Who Back Blackout Protest",
    "Reddit CEO Plans to Pursue Changes to Company's Moderator Removal Policy",
    "Reddit May Replace Moderators If They Don't Open Their Pages, Report Says",
    "Some Reddit communities end blackout protest as tensions remain high",
    "Many Subreddits Still Out of Action as Reddit's API Pricing Protest Continues",
    "Reddit Reportedly Begins Telling Mods To Reopen Shuttered Subreddits Or Face Replacement",
    "Reddit CEO Suggests User Votes to Remove Moderators",
    "Reddit Allegedly Threatens to Remove Moderators in Response to Blackout",
    "Reddit CEO Flames Protesting Moderators, Calls Them ‘Landed Gentry’",
    "Another misstep in a comically badly executed policy change",
    "we are at farkcon 2 here folks https://www.theverge.com/...",
    "The note Reddit sent to moderators threatening them if they don't reopen",
    "Reddit, Inc. is intentionally killing off 3rd-party apps with exorbitant API call prices. …",
    "Here's the note Reddit sent to moderators threatening them if they don't reopen",
    "Reddit CEO slams protest leaders, saying he'll change rules that favor ‘landed gentry’",
    "Subreddits need a land value tax. https://twitter.com/...",
    "Steve Huffman really asked Elon Musk to hold his beer... https://www.nbcnews.com/...",
    "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Who art thou landed gentry :-)",
    "Apple subreddit reopens after moderation team threatened with removal",
    "Protests fizzle as Reddit refuses to back down and many subreddits come back online",
    "Reddit Threatens to Remove Moderators if They Don't Reopen Subreddits",
    "Some of the Biggest Subreddits Are Retreating From the API War",
    "Reddit warns moderators of the blacked-out subreddits",
    "Reddit says it won't force subreddits back open (but will it?)",
    "Reddit says it won't overrule mods and force subreddits back open",
    "Reddit CEO Steve Huffman: 'It's time we grow up and behave like an adult company'",
    "Reddit has a terrible plan to end blackout: ask you to vote out protesting mods",
    "RIF developer counters Reddit CEO's claims that he didn't want to work with Reddit",
    "Reddit is in crisis as prominent moderators loudly protest the company's treatment of developers",
    "Reddit's CEO really wants you to know that he doesn't care about your feedback",
    "Key Facts to Understanding Reddit's Recent API Updates",
    "Reddit CEO compares moderators to aristocracy as blackout stretches on",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts",
    "Despite widespread protest, Reddit CEO says company is ‘not negotiating’ on 3rd-party app charges",
    "Amid protests, Reddit seeks to force subreddits to reopen",
    "The Reddit blackout is already forcing unexpected changes",
    "Reddit's fight with its most powerful users enters new phase as blackout continues",
    "Jay Peters Interviews Reddit CEO Steve Huffman for The Verge",
    "Reddit CEO lashes out on protests, moderators and third-party apps",
    "Reddit CEO boldly says API fees are here to stay, blackout or not",
    "Reddit CEO Steve Huffman: Third-Party Apps Aren't Adding Much Value",
    "Reddit CEO Pushes Back Against Blackout—Will Consider Letting Users Vote Out Moderators",
    "Reddit's CEO Is Just Making Everything Worse",
    "Reddit CEO Stands Firm Amidst Protests: 'It's Time We Grow Up'",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’",
    "Oh man.  He's doing the CEO equivalent of posting through it.",
    "this may be one of the greatest ceo meltdowns we'll ever witness https://twitter.com/... [image]",
    "‘Reddit is fighting for its soul.’ TIL vampires have souls. Who knew https://twitter.com/...",
    "the reddit ceo looks like someone who posts in alt-right subreddits https://twitter.com/...",
    "Spez is a little bitch and I hope his IPO fails and he gets shitcanned. https://twitter.com/...",
    "Gorilla mindset, baby. https://twitter.com/...",
    "never go full elon https://twitter.com/...",
    "Yeah well users should be able to vote out executives https://twitter.com/...",
    "Lol Reddit is only going to get more fun over the next two weeks https://twitter.com/...",
    "It also wasn't designed to pay dividends to shareholders https://twitter.com/...",
    "Reddit CEO slams protesters, calls them “landed gentry”",
    "Reddit's CEO really wants you to know he doesn't care about your feedback",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Blackouts",
    "The landed gentry on ToS...",
    "Reddit CEO slams protest leaders, calls them ‘landed gentry’",
    "Reddit CEO Steve Huffman isn't backing down: our full interview",
    "“Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts”",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’ - The Verge",
    "Louisiana Office of Motor Vehicles",
    "Millions of Americans' personal DMV data exposed in massive MOVEit hack",
    "MOVEit Data Breach Impacts OMV",
    "Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "A Russia-Based Hacking Rampage Hits US Agencies and Exposes Millions",
    "Missouri Office of Administration",
    "State of Missouri Issues Statement on Recent Global Cyberattack",
    "Third MOVEit vulnerability raises alarms as US Agriculture Department says it may be impacted",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "Oregon Department of Transportation",
    "ODOT Data Accessed as Part of Global MOVEit Hack",
    "Millions of Oregon, Louisiana state IDs stolen in MOVEit breach",
    "Explainer: How MOVEit breach shows hackers' interest in corporate file transfer tools",
    "More state governments report MOVEit vulnerability exposure",
    "Louisiana driver's licenses, auto registrations targeted in massive data breach",
    "Hackers Steal Data on Millions of Oregon, Louisiana Driver's License Holders",
    "Hackers Stole Millions of Driver's Licenses and IDs from U.S. States",
    "Oregon DMV, Louisiana OMV warn residents of MOVEit data breach",
    "Every Louisiana driver's license holder exposed in cyberattack",
    "Millions of Americans' Personal Data Exposed in Global Hack",
    "Top Twitch Star xQc Moves To Kick In ‘Largest Streaming Deal Ever’",
    "Gaming, streaming communities left in shock of xQc's Kick mega-deal: 'You can't make this s**t up'",
    "Top streamers are saying “Twitch is done” after xQc Kick deal",
    "xQc Is Ditching Twitch For Kick After Signing $100 Million Deal",
    "xQc scores unbelievable $100 million deal to start streaming on Kick",
    "Twitch Mega Streamer xQc Signed By Gambling Company For $100 Million",
    "xQc Signs Massive Deal with Kick Streaming Platform",
    "xQc signs $100 million deal with Kick, a new fledgling Twitch competitor",
    "Twitch Star xQc Signs $70 Million+ Deal With Rival Platform Kick",
    "Felix Lengyel, aka xQC signe un contrat de 100M$ pour aller streamer sur Kick à la place de Twitch",
    "xQc unterzeichnet 100 Millionen Dollar Deal mit Streaming-Plattform Kick",
    "xQc signs $100 million non-exclusive contract with Kick",
    "xQc signs $100 million deal to stream *non-exclusively* on Kick",
    "@unrealfred@mastodon.online",
    "Elon Musk, Bernard Arnault to Share Power Lunch in Paris Friday",
    "Elon Musk Says He Has Improved ‘Corrosive’ Twitter for Most Users",
    "Elon Musk says the Twitter advertiser exodus is all but over",
    "Why the New Twitter CEO's Plans for Twitter 2.0 Left Us Cold",
    "Elon Musk Says Twitter Advertisers Are Coming Back",
    "Ad Buyers Question UGC and Moderation Policies Ahead of Twitter's Muted Cannes Appearance",
    "Musk woos ad giants in Paris to fix Twitter's woes",
    "It's incredible, but in 2023, Musk's only idea left is “pivot to video.”",
    "PIVOT TO VIDEOOOOO https://twitter.com/...",
    "I'm sure this will work out well. https://twitter.com/...",
    "Notice Of Proposed Stipulation and Consent Order",
    "Binance, SEC strike deal to move all US customer funds, wallet keys back onshore - CoinDesk",
    "Binance and SEC Settle: U.S. Customer Funds and Wallet Keys Return Onshore",
    "Breaking: Binance, Binance.US Reaches Deal With The US SEC",
    "Report: Binance.US Cuts Jobs Following SEC Charges",
    "Introducing New Parent-Managed Meta Accounts for Families",
    "Meta Lowers Age Requirement for Quest VR Headsets to Allow Preteens",
    "Meta to Lower Age for Users of Virtual Reality Headset to 10 From 13",
    "Meta allows 10-year-old kids to use its Quest VR headset",
    "Meta will lower the Quest headset's recommended age from 13 to 10",
    "Meta lowers the minimum age for its Quest headsets from 13 to 10",
    "10-year-olds are finally allowed to use the Quest. Here's why that's good",
    "Meta says it's totally fine for 10-year-olds to wear its VR headset, probably",
    "Trying to tap into the only market that thinks VR is cool https://twitter.com/...",
    "Introducing New Parent-Managed Meta Accounts for Families |  Meta Quest Blog",
    "owen wilson saying wow [embedded post]",
    "Stack Broverflow. https://twitter.com/...",
    "FTC Orders 1Health.io to Improve DNA Data Privacy, Security",
    "DNA Testing Startup Lied To Customers About Deleting Their Data, FTC Alleges",
    "In a first, FTC charges genetic testing firm over failure to protect data",
    "San Francisco Business Journal",
    "Crypto Payments Firm Wyre is Shutting Down",
    "Crypto payments platform Wyre shutters citing bear market conditions",
    "Wyre To Shut Down As Crypto Winter Claims Another Casualty",
    "Crypto startup Wyre, once valued at $1.5 billion, officially shuts down",
    "Free Figma template of onboarding & activation designs",
    "Samsung Galaxy Z Flip 5 leaked press render highlights phone's exciting new cover display",
    "Galaxy Z Flip 4's collector box signed by Samsung and SCH limited to 19 copies",
    "Galaxy Watch 6 Smiles For The Camera In Leaked Images",
    "Samsung Galaxy Z Fold 5 and Flip 5 Could Lie Flat When Folded",
    "Samsung Galaxy Z Flip 5 Leaked Press Photo Reveals Major Updates",
    "Samsung Galaxy Z Fold 5 needs to prioritize durability over features — here's why",
    "Leaked Samsung Galaxy Z Fold 5 renders reveal thinner bezels",
    "Samsung Galaxy Z Flip5 could have a bigger cover display (like the Motorola Razr+)",
    "Leaked Z Fold 5 renders show it could solve a major foldable phone issue",
    "Samsung Galaxy Watch 6: Everything you need to know",
    "Samsung Galaxy Z Flip 5 Render Shows the Big Cover Screen in Action",
    "New Samsung Z Flip 5 leak highlights a gloriously big cover screen",
    "This is the Galaxy Z Flip 5 leak we've been waiting for",
    "The New Galaxy Z Flip 5 leak shows a bigger cover display",
    "Samsung Galaxy Z Fold 5 Flaunts A Sweet Hinge Upgrade In Leaked Renders",
    "Leaked Galaxy Z Flip 5 press render shows off the new cover screen",
    "Samsung Galaxy Z Flip 5 shows off its huge outer display in official-looking image",
    "Samsung Galaxy Z Flip 5 showcased in leaked promotional images",
    "Introducing Voicebox: The Most Versatile AI for Speech Generation",
    "Voicebox: Text-Guided Multilingual Universal Speech Generation at Scale",
    "Meta Unveils Voicebox: The Future of AI-Driven Speech Generation",
    "Meta Showcases New ‘Voicebox’ Speech-to-Text Translation Tool",
    "Meta's new AI app is both for patients with vocal cord damage and in-game NPCs",
    "Everything you need to know about Meta's AI Voicebox",
    "Meta's new ‘Voicebox’ AI is a text-to-speech tool that learns like ChatGPT",
    "Meta AI Unveils ‘Voicebox’ Speech Generation Model",
    "Meta to Help People Craft More Zuck Deepfakes With ‘Voicebox’ AI",
    "Meta's New Voicebox AI Serves Up Generative Text-To-Speech",
    "Meta's reveals new text-to-speech Voicebox AI but you can't have it",
    "Meta introduces Voicebox, a generative AI model for speech",
    "Meta reveals AI tool that lets you edit audio, speak in six languages, and more",
    "Meta unveils speech generation AI: Voicebox",
    "Meta announces Voicebox, its generative AI model for audio",
    "Let's supercharge personalized voice scams! Thanks Meta! https://twitter.com/...",
    "Tiger Global raises $2.7 Bn, falls short of target by more than 50%",
    "Tiger Global Raises $2.7 Billion, 55% Less Than Target Set Last Fall",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Top 5 tips for establishing your next attendance policy",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/16 - Google Does it Again",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Office of the General Counsel | Federal Trade Commission",
    "Federal Ethics Response to Meta Petition for Chair Khan's Recusal",
    "New from me: https://www.bloomberg.com/...",
    "she should be recused from her job https://twitter.com/...",
    "Lina Khan is behaving like a dictator at the FTC. Sad 😟 https://twitter.com/... [image]",
    "Micron Vows $600 Million China Investment Weeks After Chip Ban",
    "One-Minute Daily AI News 6/16/2023",
    "Now I think it's definitely because the budget was cut",
    "year of efficiency? https://www.cnbc.com/...",
    "FRONT PAGE TECH on YouTube",
    "Vision Pro from a Developer's Perspective",
    "this is NOT the future — Apple Vision Pro",
    "Apple's Growth Vision Is Getting Hard for Some to See",
    "Vision Pro Introduction Now Apple's Most Watched YouTube Video",
    "Apple's Vision Pro headset is a hobby. Why won't Tim Cook say that?",
    "Vision Pro: Apple assembles manufacturing partners for first-gen headset",
    "I've been informed that an OTA update for VisionOS 1.0 has surfaced. Borealis 21N5165g for N301.",
    "Meta rolls back COVID-19 misinformation rules in many countries",
    "Facebook just made it easier to spread COVID misinformation. Here's how",
    "Meta Is The Latest Platform To Scale Back Its COVID-19 Misinformation Policy",
    "Meta Will Stop Removing COVID-19 Misinformation on Facebook, Instagram",
    "Meta Is Abandoning Their COVID-19 Misinformation Policy on Facebook and Instagram",
    "Meta Finally Scraps Censorship Policies For COVID ‘Misinformation’",
    "Meta Rolls Back Policy to Curb COVID-19 Misinformation on Facebook, Instagram",
    "Bakkt delists Solana, Polygon and Cardano amid regulatory uncertainty: Fortune",
    "Bakkt follows Robinhood, eToro in delisting major altcoins: Report",
    "Bakkt delists SOL, MATIC, and ADA amid regulatory uncertainty",
    "Bakkt Becomes Latest Exchange to Drop Solana, Polygon and Cardano",
    "Cardano Continues Decentralization Growth As SEC Targets ADA",
    "Bakkt Is Delisting Solana, Polygon and Cardano Citing Regulatory Uncertainty: Fortune",
    "Bakkt Takes Proactive Measures, Delists Polygon, Solana, and Cardano Amid Regulatory Crackdowns",
    "Bakkt delists Solana, Polygon, and Cardano amid regulatory uncertainty",
    "Bakkt's Crypto Cleanup: SOL, MATIC, And ADA Get The Boot Pending ‘Further Clarity’ From SEC",
    "Bakkt to Delist Solana, Cardano and Polygon Following SEC Lawsuits",
    "Bakkt Bids Adieu to Solana, Polygon, and Cardano Amid Regulatory Whirlwinds",
    "Bakkt Delists Cardano, Polygon and Solana on Regulatory Grounds",
    "Breaking: Bakkt Exchange Delists ADA, MATIC, and SOL",
    "Polygon, Cardano, Solana delisted from Bakkt, 1 week after Robinhood",
    "Texas State Securities Board",
    "Abra Earn and Abra Boost Warning",
    "Texas regulator accuses lending firm Abra of committing fraud",
    "Texas state regulators say crypto lender Abra has been insolvent for months",
    "Crypto Trading Platform Abra In Hot Water: Texas Regulator Accuses It Of Fraud",
    "Widow of slain Saudi journalist Jamal Khashoggi files suit against Pegasus spyware maker",
    "Jamal Khashoggi's Widow Says Notorious Spyware Left Her ‘Irrevocably Altered’",
    "Khashoggi's widow sues Israeli spyware company NSO over phone hacking",
    "Media companies meet AI companies to talk about this",
    "OpenAI, Google and Microsoft negotiate the future of journalism",
    "Selling islands for seashells https://www.ft.com/...",
    "Everything You Need To Know About What We Shared With NYAG",
    "Tether on FOIL and Continued Commitment to Transparency",
    "A Look at the Reserve Statements That Tether Tried to Conceal",
    "Here's what new Tether documents reveal about its reserves",
    "Tether responds to reports on Chinese securities backing USDT reserves",
    "Tether Counted Securities Issued by Chinese Firms Among Its Reserves: Bloomberg News",
    "USDT issuer Tether responds to Chinese securities exposure reports",
    "Documents reveal USDT was once backed by Chinese securities",
    "Tether says New York handed over financial documents to CoinDesk",
    "Tether did back USDT with Chinese securities, documents show: Bloomberg",
    "@mostlyharmlessz@muskless.social",
    "@Techmeme this was always suspected but never confirmed, glad to see some truth coming out.",
    "tether getting ahead of the news with cascading short sells https://tether.to/...",
    "Pweeeeass don't write the newsss 👉👈🥺 https://tether.to/... [image]",
    "Tether: Please don't panic when CoinDesk publishes an upcoming article about our us!!!",
    "Notice on Changes of Services in the Netherlands",
    "Binance under investigation in France for money-laundering",
    "Binance to Quit Netherlands After Failing to Acquire License",
    "Binance's French arm says money laundering raid was ‘regulatory obligation’",
    "Crypto Exchange Binance Probed by France for Alleged Illegal Practices",
    "Binance to leave Netherlands",
    "Binance Under Investigation in France",
    "Binance Exits Netherlands After Failed Registration Attempt",
    "French Authorities Are Investigating Binance's Local Arm: Report",
    "Binance exits Netherlands and faces France probe",
    "Binance Exits the Netherlands Market",
    "Binance France chief brushed off concerns days before police visit",
    "Binance Under Investigation in France for Alleged Money Laundering",
    "Binance Lays Off 50 U.S. Staff, Faces Investigation in Europe",
    "Binance CEO Refutes Reports of Investigation into French Branch",
    "French authorities have been investigating Binance since February 2022",
    "Binance Faces Allegations Of ‘Aggravated’ Money Laundering In France",
    "French Investigation Targets Binance: Allegations of Money Laundering and Regulatory Violations",
    "France's AMF Turns On Binance: Investigations Underway Since 2022",
    "France Probes Binance Exchange for Suspected Money Laundering",
    "Just-In: Binance Confirms On-Site Visit In France's Money Laundering Investigation",
    "France investigates Binance for money laundering as Netherlands shuts door on exchange",
    "French Authorities Investigating Binance for ‘Aggravated Money Laundering’",
    "Binance under investigation in France since February 2022: Report",
    "Binance Under Investigation In France, Company Exits Dutch Market After Cyprus Decision: Report",
    "Binance is getting nuked from all directions. https://twitter.com/...",
    "Binance Under Investigation in France, Accused of ‘Aggravated’ Money Laundering",
    "U.S. Securities and Exchange Commission",
    "BlackRock May Have Found Way to Get SEC Approval for Spot Bitcoin ETF",
    "BlackRock's iShares Files Paperwork for Spot Bitcoin ETF",
    "BlackRock files for spot bitcoin ETF, with Coinbase as a crypto custodian",
    "Crypto News : Bitwise Follows BlackRock's Lead, Reapplies for Bitcoin Spot ETF",
    "Cardano Founder Finds Fault With Blackrock Bitcoin ETF",
    "Blackrock Files for Bitcoin Trust — Analyst Calls It a ‘Real Deal’ Spot Bitcoin ETF Filing",
    "BlackRock's New Strategy: This Could Be The Key To Securing Bitcoin ETF Approval",
    "Is BlackRock's clout enough to get its bitcoin ETF past the SEC?",
    "BlackRock Bitcoin ETF Is the ‘Real Deal’—Is This Finally the One?",
    "Cryptocurrencies climb to end the week as investors digest BlackRock's bitcoin ETF plans",
    "Bitwise refiles for Bitcoin spot ETF following BlackRock",
    "BlackRock Could Get SEC Approval for Bitcoin ETF With Included New Agreement",
    "BTC Primed For Trillion-Dollar Boost As BlackRock Expects Landmark Bitcoin ETF Approval",
    "Cardano Founder Hoskinson Slams Bitcoin Maxis Who Support BlockRock",
    "BlackRock's Bitcoin ETF surprise sets up battle with Gensler's SEC",
    "BlackRock's record of ETFs approved by the SEC is 575-1",
    "BlackRock Files Bitcoin ETF Application With the SEC",
    "Crypto community divided: BlackRock ETF's impact on DeFi remains uncertain",
    "Can BlackRock's Bitcoin ETF Help Bitcoin Price Turn Around?",
    "Bitcoin Jumps Past $25.7K After BlackRock iShares ETF Filing",
    "BlackRock files application for spot bitcoin ETF",
    "Bitcoin climbs as BlackRock files for ETF backed by the cryptocurrency",
    "BlackRock files for bitcoin ETF; Coinbase as custodian",
    "BlackRock delves deeper into crypto with push for bitcoin ETF",
    "BlackRock applies for spot Bitcoin ETF — a US first if approved",
    "BlackRock joins ranks of US bitcoin ETF hopefuls",
    "BlackRock files for Bitcoin ETF, Coinbase and Nasdaq listed as partners",
    "How it started: How it's going: [image]",
    "I thought Coinbase was an exchange, how can they be the custodian? https://www.cnbc.com/...",
    "Thirtieth time is the charm? https://twitter.com/...",
    "A Russian national charged for committing LockBit Ransomware attacks",
    "LockBit suspect's arrest sheds more light on ‘trustworthy’ gang",
    "Russian National Arrested in Connection With LockBit Ransomware",
    "Russian National Arrested, Charged in US Over Role in LockBit Ransomware Attacks",
    "Latest arrest places LockBit firmly in the crosshairs of international cyber police",
    "Russian national arrested in Arizona, charged for alleged role in LockBit ransomware attacks",
    "Introducing the Partner Plus Program",
    "New Twitch program boosts higher payouts, but there's a catch",
    "Twitch announces a new program to help streamers make more money",
    "Twitch streamer fires back at new Partner Plus program's “unobtainable” requirements",
    "Twitch to improve revenue splits, but only when certain conditions are met",
    "Twitch Is Starting To Feel Like A Failed State",
    "Twitch's new Partner Plus program offers some streamers a 70/30 revenue split",
    "Twitch will give smaller streamers a bigger cut of subscriptions",
    "Twitch introduces the Partner Plus Program with a 70/30 spit."
]