[
    "@ChanceHMiller@mastodon.social",
    "@Aaron@social.aaroncrocco.com",
    "@dcseifert@mastodon.social",
    "Reddit CEO warns employees not to wear Reddit swag in public as users revolt",
    "Reddit CEO Tells Employees To Ignore Blowback",
    "Reddit's largest Apple community will stay dark, as CEO promises to ride out shutdowns",
    "Internal memo from Reddit CEO leaks, shows company will not back down",
    "Reddit CEO digs in on API tomfoolery, warns employees of wearing logo in public",
    "Reddit's CEO reportedly told staff that the community's API protest will blow over",
    "Reddit CEO: Apollo-Related Subreddit Blackouts ‘Will Pass,’ No Significant Revenue Impact So Far",
    "Reddit CEO says like all other blowups this too will pass to employees in an internal memo",
    "Reddit Blackout Crashes The Site As Reddit Users Realize They're In The Power Position",
    "What is Reddit blackout protest: Explained",
    "Reddit blackout: Here's why thousands of subreddits are going dark?",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "Reddit blackout: What, why and how it is impacting users",
    "my usage of reddit shall too pass https://www.theverge.com/...",
    "Reddit CEO tells employees that subreddit blackout ‘will pass’",
    "The Reddit blackout has improved the overall state of Reddit and should remain permanent",
    "Reddit CEO is not negotiating with the hostage takers lmao what will the nerds do now?",
    "Reddit CEO tells employees that subreddit blackout “will pass”",
    "Reddit CEO Tells Employees That Subreddit Blackout ‘Will Pass’",
    "Photography Subreddits Go Dark as Redditors Protest Against the Company",
    "Over 8,000 subreddits go dark in protest against Reddit's API fees",
    "Nearly 8,000 Reddit communities join protest against API changes",
    "Reddit sees more than 6,000 communities ‘go dark’ in protest over API changes",
    "Reddit communities go dark in protest at changes",
    "Reddit Blackout Begins as Forums Protest Charges for Developers",
    "Apple Subreddit Goes Dark in Protest of Reddit's API Pricing Changes",
    "Reddit Goes Down As Communities Protest Wildly Unpopular Changes [UPDATE]",
    "48-hour Reddit user blackout kicks off, affecting 8K subreddits",
    "Reddit down amid major protest",
    "Reddit Blackout darkens popular Windows and Microsoft subreddits",
    "“Will pass” .... Maybe not https://t.co/mTERSe2VTx",
    "International Business Times",
    "@MikeRiverso@mastodon.social",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "Thousands Of Reddit Communities Go Private To Protest Platform's New Price Policy For Apps",
    "Reddit faces backlash as thousands of communities ‘black out’ over new API pricing",
    "Reddit goes dark over API price changes that'll kill third-party apps and NSFW content",
    "Reddit says protesting communities crashed the site",
    "This third-party Reddit app may survive — but only with a paid subscription",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Reddit API charges spark community outrage, dayslong blackout",
    "You're making money while increasing interest in our site?  Bad third party apps, bad.",
    "“The adventure that is the end of free money continues!” https://twitter.com/...",
    "won't be anything left to take public. https://twitter.com/...",
    "@christianselig@mastodon …",
    "@christianselig@mastodon.social",
    "Apollo's Christian Selig explains his fight with Reddit - and why users revolted",
    "OpenAI reportedly warned Microsoft about rushing GPT-4 integration into Bing",
    "Microsoft CEO Satya Nadella discusses his “eureka moment” with AI in new interview",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Paul McCartney: “Final” Beatles song out this year, thanks to AI",
    "Paul McCartney Says New Beatles Song Finished With Help From Artificial Intelligence",
    "Paul McCartney Uses AI to Complete Unfinished Beatles Song with John Lennon's Vocals",
    "The Beatles will release a final record, using John Lennon's voice via an AI assist",
    "Paul McCartney got a little help from AI to create one last Beatles song",
    "Paul McCartney Says ‘Final’ Beatles Song Coming Soon—Thanks to AI",
    "The Beatles are dropping one last track with the help of AI",
    "Paul McCartney uses AI to resurrect old John Lennon demo for “final Beatles record”",
    "The Beatles Come Together for ‘Last Record’ Using AI, Paul McCartney Says",
    "A ‘new’ Beatles song is coming, with a little help from AI",
    "Paul McCartney says AI helped him finish one last Beatles song - here's what I think is coming",
    "How much are tickets to see Paul McCartney at NYC's Tribeca Film Fest?",
    "Paul McCartney Says A.I. Helped Complete ‘Last’ Beatles Song",
    "Paul McCartney Says “Final Beatles Record” In Works With AI-Assisted John Lennon Vocal",
    "Paul McCartney Is Using AI To Complete ‘Final’ Beatles Song",
    "Paul McCartney Says He Used AI to Produce a “Final” Beatles Song",
    "Paul McCartney is using AI to create a final song for The Beatles",
    "The Beatles Used AI to Create Their ‘Final Song’ With John Lennon's Voice",
    "Interviewer: And what do you think about efforts that have been made through technology …",
    "Paul McCartney says A.I. got John Lennon's voice on ‘last Beatles record’",
    "AI helped make a song on ‘the last Beatles record’, McCartney says",
    "Paul McCartney: AI helps create ‘the last Beatle record’",
    "How Paul McCartney Used AI to Create the ‘Final Beatles Record’",
    "The Beatles are releasing their ‘final’ record. AI helped make it possible",
    "Paul McCartney Says He's Using AI to Build the ‘Final’ Beatles Song",
    "Paul McCartney Used AI to Make a Final Beatles Song — But Not In a Creepy Way",
    "‘Last Beatles record’ is on the way (with a little help from AI friends)",
    "Paul McCartney Confirms The Beatles Will Release ‘Final’ Song Using AI",
    "Paul McCartney Used AI to Finish an Unreleased Beatles Song",
    "Paul McCartney Used AI to Create a New and ‘Final’ Beatles Song",
    "The Beatles are over. Why can't McCartney just let it be?https://www.bbc.com/...",
    "Paul McCartney says artificial intelligence has enabled a ‘final’ Beatles song",
    "AI-powered “final” Beatles song due this year, says Paul McCartney",
    "AI Video Creation Pioneer Synthesia Raises $90 Million Series C Led by Accel",
    "AI-Generated Video Platform Synthesia Receives Nvidia Backing At Unicorn Valuation",
    "Generative AI Video Platform Synthesia Raises $90 Million at $1 Billion Valuation",
    "Synthesia Raises $90M in Series C Funding",
    "Generative AI firm Synthesia raises £71.4m at unicorn valuation",
    "UK's Synthesia raises $90 million valuing the AI video creation platform at $1 billion",
    "AI startup Synthesia gains unicorn status after Nvidia-backed fundraise",
    "The Hinman Documents Reveal a Deceitful SEC",
    "What's in the SEC's Hinman Emails and Do They Really Help Ripple?",
    "SEC officials pushed Hinman to clarify ETH wasn't a security: Court docs",
    "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials",
    "XRP price surges 7.4% as traders anticipate Ripple's legal outcome",
    "Hinman Ignored All Warnings, Split Up Howey Test: Ripple Legal Chief",
    "SEC emails show multiple officials examining ethereum in 2018",
    "XRP Price Prediction as Hinman Documents Go Public - Can XRP Reach $10 in 2023?",
    "Hinman docs unsealed: SEC concerned over ‘Ether is not a security’ statement",
    "SEC Emails Reveal: Hinman Wasn't Only Official Deliberating ETH Security",
    "In Response to Hinman Docs, Ripple CEO Slams SEC's “Politically-Motivated Overreach”",
    "Ripple CEO Believes Hinman Documents Release Is Worth the Wait",
    "Dissecting the ‘Hinman Emails’: Adam Cochran on SEC Staff's Concerns over Comments About Ethereum",
    "Hinman Doc. Release: Ripple Garlinghouse says it is Worth the Wait",
    "Ripple's chief legal officer calls for investigation after release of Hinman docs",
    "Hinman speech contained “made-up analysis”, Ripple's Chief legal officer says",
    "Next 24 Hours Will Be Critical For Crypto - Here's Why",
    "Ripple-SEC Lawsuit: Hinman Documents To Be Released Today",
    "Full document 👇🏼 https://www.dropbox.com/...?",
    "Hinman details very clearly saying ETH is not a security https://twitter.com/...",
    "Four-week-old AI start-up raises record €105mn in European push",
    "France's Mistral AI Raises $113 Million in Big EU Startup Debut",
    "French company Mistral AI raises 105 mln euros shortly after being set up",
    "Larry Ellison edges past Bill Gates as world's fourth-richest person, Bloomberg says",
    "Larry Ellison passes Bill Gates to become world's fourth richest person",
    "Bill Gates falls another notch on the world's billionaire list, as AI takes Larry Ellison higher",
    "From Fan Funding to Shopping: More ways for creators to earn on YouTube",
    "YouTube is lowering the eligibility requirements for creators to make money",
    "YouTube Partner Program overview & eligibility",
    "Earning Money on YouTube Just Got Easier",
    "YouTube lowers the criteria to join its partner program, adds more benefits for US creators",
    "YouTube's new Partner Program standards are tailored to live-streaming creators",
    "Making Money On YouTube Just Got Easier",
    "YouTube is making it easier for creators to make money — here's how",
    "YouTube drastically lowers requirements for video monetization",
    "YouTube makes it much easier for everyone to earn money from making videos",
    "YouTube Just Made It Even Easier To Make Money Through Its Monetization Program",
    "ICYMI Alert: YouTube Gives Smaller Creators Earlier Access to YPP",
    "It's now easier to get your YouTube channel monetized",
    "Read the new Twitter CEO's first email to employees",
    "Twitter boss Linda Yaccarino gives first hint on shake-up plans",
    "Twitter's new boss wants it to become 'the world's most accurate real-time information source'",
    "Twitter's new CEO is here to transform Elon Musk's vision into a LinkedIn post",
    "Twitter's New CEO Makes It Clear: This Is Elon's Ship, She's Just Running It,",
    "Twitter 2.0 explained by the new CEO",
    "New Twitter CEO outlines her plans for the social media platform",
    "Twitter CEO Linda Yaccarino Says Twitter Will Be World's Most Accurate Information Source",
    "Twitter CEO Linda Yaccarino Outlines “Twitter 2.0” Vision",
    "Twitter 2.0: New CEO's Vision for the World's Most Accurate Information Source",
    "People are getting fired up about Twitter CEO Linda Yaccarino's ‘Enter Twitter 2.0’ announcement",
    "New Twitter CEO wants to create ‘global town square’: report",
    "Twitter Sends First Comms Email Since Takeover",
    "Twitter's new CEO has shared her first email to employees",
    "Twitter's new CEO wants to turn it into the 'world's most accurate real-time information source'",
    "Elon Musk Successor Reveals Real Reason She Chose Twitter",
    "Twitter CEO Linda Yaccarino echoes Musk in emphasizing freedom of speech in debut tweet thread",
    "Twitter's new CEO just sent her first email to employees, then posted it on Twitter",
    "excruitiatingly hollowed words.  the glass cliff is real.",
    "Hello Twitter. People keep asking me: Why Twitter? So, I'll tell you. 👇",
    "Good luck but extremely skeptical it'll go as she envisions https://www.theverge.com/...",
    "never on this app lol https://twitter.com/...",
    "Has she told Elmo this? https://twitter.com/...",
    "Fire your ghostwriter, Linda https://twitter.com/...",
    "Breaking Points on YouTube",
    "EXCLUSIVE: Jack Dorsey On RFK Jr. Elon Musk, AI Regulation | Breaking Points",
    "Jack Dorsey Says Indian Officials Raided Twitter Employees' Homes",
    "Why Twitter Co-Founder Jack Dorsey Is Clashing with India's Government",
    "Jack Dorsey saga: How Elon Musk learnt fast to respect strict Indian laws [details]",
    "India denies Dorsey's claims it threatened to shut down Twitter",
    "India slams ex-Twitter chief's claims of pressure as ‘outright lie’",
    "Jack Dorsey Says that He Hopes Twitter would Adopt Bitcoin Technology",
    "Ex-Twitter CEO Says Indian Govt. Threatened To Shut Down Twitter During Farmer Protest",
    "India threatened to shut Twitter and raid employees",
    "'That's why they banned Rahul Gandhi': Congress after Jack Dorsey claims ‘govt pressure’",
    "India Clashes With Twitter Ex-CEO Dorsey Over Removal of Posts",
    "India Refutes Jack Dorsey's Allegations On Pressure During Farmers' Protests",
    "Centre dismisses Jack Dorsey's claims of Twitter shutdown over farmer protests",
    "India threatened to shut down Twitter, says ex-CEO Jack Dorsey; govt says ‘outright lie’",
    "Government rejects ex-Twitter CEO Dorsey's ‘Shut Down’ claim as ‘outright lie’",
    "India threatened to block Twitter, raid employees: former CEO Jack Dorsey",
    "Outright lie, no one was raided or sent to jail: Rajeev Chandrasekhar to Dorsey",
    "Murder of democracy...: BJP, Congress spat over Twitter co-founder Jack Dorsey's claim. Watch",
    "Microsoft CFO Says OpenAI and Other AI Products Will Add $10 Billion in Revenue",
    "OpenAI reportedly warned Microsoft about Bing's bizarre AI responses",
    "Microsoft's complicated relationship with OpenAI",
    "Microsoft was reportedly warned about putting GPT-4 in Bing Chat too early by OpenAI",
    "Microsoft and OpenAI have an open partnership - and it's complicated",
    "Microsoft may have ignored warnings about Bing Chat's unhinged responses",
    "Uniswap Labs releases draft code for ‘entirely new’ version of Uniswap",
    "Uniswap Unveils Game-Changing Version 4 With Customizable Liquidity Pools via Innovative Hooks",
    "Uniswap releases version 4 code, allowing for new types of liquidity pools",
    "Uniswap Update Means ‘The Possibilities Are Pretty Endless,’ Says Developer",
    "Uniswap v4: Customizable And Cost-Effective Solution For DEXs?",
    "Uniswap V4 code draft features custom liquidity pools plugins",
    "Uniswap Labs Shares Roadmap for Uniswap v4",
    "Uniswap v4 code now available on GitHub",
    "Uniswap Unveils v4 Upgrade, Aims to Foster Community Feedback",
    "Congrats to the team on Uni v4 https://github.com/...",
    "Hands-free photos, SpO2 and more for the Pixel family",
    "Google Issues the June 2023 Pixel Feature Drop, and It's a Big One",
    "The Google Pixel Watch's long-overdue blood oxygen tracking is finally here",
    "June 2023 Pixel feature drop for Pixel Watch and Fitbits is massive",
    "Google's Pixel Watch now offers overnight blood oxygen tracking",
    "Google's latest Pixel feature drop is here. Check out what's new",
    "Google Pixel Watch just got huge health and fitness upgrades to challenge Apple Watch",
    "Google Launches Pixel Watch Metal Bands, Delivers A Slew Of Updates For Fitbit, Pixel Phones",
    "Google's June 2023 Pixel feature drop doubles down on personal safety",
    "Leak suggests Google Pixel Watch SpO2 update could be imminent",
    "Netflix Planning Its First Live Sports Event, Report Says",
    "Netflix reportedly plans first live sports event with celebrities playing golf",
    "Netflix Explores Live-Streaming Sports with Celebrity Golf Tournament",
    "Netflix Could Stream its First Live Sports Event This Fall",
    "Netflix's first live sports stream could have Apple TV Plus and Paramount Plus worried",
    "Netflix in talks to live stream its first sports event later this year, says report",
    "Netflix to stream celebrity golf tournament",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Netflix weighs live broadcast of golf tournament, its first foray into live sports, WSJ says",
    "Netflix is reportedly getting ready to stream its first-ever sporting event",
    "I feel like the professional golfers have an edge here",
    "Lolwut  —  Not sure what the opposite of clickbait is (click repellent?) but this qualifies",
    "I'm going to put my money on the professional golfers https://twitter.com/...",
    "Together at last: the two dullest non-sports on the planet https://twitter.com/...",
    "I would very much watch this please and thank you https://twitter.com/...",
    "Meta releases ‘human-like’ AI image creation model",
    "I-JEPA: The first AI model based on Yann LeCun's vision for more human-like AI",
    "Method  —  I-JEPA is a method for self-supervised learning.  At a high level …",
    "Self-Supervised Learning from Images with a Joint-Embedding Predictive Architecture",
    "Well if LLM's dont give us AGI, Yann's other projects will xD https://twitter.com/...",
    "Meta Releases ‘Human-Like’ AI Image Creation Model",
    "MrBeast's Latest Video Breaks His Own View Record in 24 Hours",
    "This is worth your time and moral dilemma. https://www.nytimes.com/...",
    "MrBeast has become a viral sensation for his acts of altruism",
    "The Download: inaccurate welfare algorithms, and training AI for free",
    "How the US is Pushing China Out of the Internet's Plumbing",
    "Google suggests a hub and spoke framework towards regulating AI",
    "Google challenges OpenAI's calls for government A.I. czar",
    "AI-powered Google Search could affect web information ecosystem",
    "Office of the Director of National Intelligence",
    "US intelligence confirms it buys Americans' personal data",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data, U.S. Says",
    "U.S. intelligence can snoop on Americans too easily—even the spy agency's oversight body says so",
    "US intelligence agencies buy Americans' personal data, new report says",
    "U.S. Government Buying ‘Intimate’ Data About Americans, Report Finds",
    "Confirmed: US Intelligence agencies are buying personal data, raising privacy concerns",
    "Report: FBI buys your phone data, just like everyone else",
    "FBI Pays for Your Phone Data and There's Nothing You Can Do to Stop It",
    "US government admits to buying Americans' personal data",
    "US Government Has Secretly Used Data Brokers to Amass Information on Citizens",
    "ODNI Declassified Report on CAI",
    "This is a huge story and should be blasted all over the place. https://twitter.com/...",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data",
    "The US Is Openly Stockpiling Dirt on All Its Citizens",
    "ZertES-compliant qualified electronic signatures (QES) for the European Union and Switzerland",
    "Accenture to Invest $3 Billion in AI to Accelerate Clients' Reinvention",
    "Accenture Commits $3 Billion Investment in AI to Increase Efficiency for Enterprise Clients",
    "Accenture announced a $3 billion investment in AI",
    "Accenture Commits $3B To AI",
    "Accenture bets big on AI with $3bn investment",
    "Accenture Will Invest $3 Billion to Expand Its A.I. Offerings",
    "Accenture to invest $3 billion in AI, double talent workforce to 80,000",
    "Accenture's AI practice to have 80,000 employees",
    "@davidgerard@circumstances.run",
    "Emmer, Davidson Introduce ‘SEC Stabilization Act’ to Remove Chair Gary Gensler",
    "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "Congressmen Introduces Bill to Fire Gensler: Here's What it Would Mean for Crypto",
    "Gary Gensler hasn't always believed everything but bitcoin is a security",
    "US Lawmakers Float New Bill to Sack SEC Chair Gary Gensler",
    "Maybe Coinbase Should Never Have Gone Public",
    "U.S. Congressman Officially Files Bill to Fire SEC Chair Gary Gensler",
    "“But the SEC let us go public” and other flawed arguments in Coinbase's defense",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/13 - New Beatles Song Thanks To AI",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "At Meta, Everything Old Is New Again",
    "Meta Horizon Worlds v114 Release Notes",
    "Meta Horizon Worlds Introduces World Chat in v114 Update",
    "Nothing can go wrong with resurrecting Barrens chat.",
    "AMD extends Ryzen 7000 range to enterprise with Pro chips",
    "AMD Launches New Ryzen Pro 7040 Series for Business Laptops",
    "AMD Intros Ryzen 7000 Pro Mobile and Desktop Chips, AI Comes to Pro Series",
    "AMD Ryzen 7000 Pro CPU takes aim at Apple's M2 Pro but fails to impress",
    "AMD Ryzen Pro 7000 processors now available for desktop workstations",
    "AMD Ryzen PRO 7000 Series CPUs: The future of AI-powered business for laptops and (maybe) desktops",
    "AMD Announces Ryzen Pro CPUs for Laptops and Desktops",
    "AMD introduces new processors for Windows 11 PCs geared toward professionals",
    "AMD Ryzen Pro 7000 Series CPUs Launched",
    "AMD Ryzen Pro 7040 Series heralds Zen 4 and RDNA 3 technology",
    "AMD launches Zen 4-powered Ryzen 7000 PRO Series for laptops and desktops",
    "AMD Introduces Ryzen 7000 PRO Family Of Zen 4 CPUs For Enterprise Laptops And Desktops",
    "AMD Announces Ryzen PRO 7040 Series “Zen 4” Processors for Commercial Notebooks",
    "AMD launches Ryzen PRO 7000 series processors for laptops and desktops",
    "AMD launches Ryzen PRO 7000 65W desktop series, Ryzen 9 PRO 7945 features 12 Zen4 cores",
    "AMD Ryzen 7000 Goes Pro For Desktops & Laptops: Phoenix & Raphael With Zen 4 CPU Cores",
    "Striveworks raises $33M for its machine learning operations platform",
    "Nothing confirms that Phone 2's software will quickly come to Phone 1",
    "Nothing Phone 2 launches on July 11",
    "The Nothing Phone 2 Finally Has a Launch Date",
    "Nothing Phone (2) Launch Date Confirmed for July 11th",
    "The Nothing Phone 2 gets a July 11 launch date",
    "Nothing Phone (2) to launch on July 11",
    "It's official — Nothing Phone (2) is launching July 11 and it's coming to the US",
    "Nothing Phone (2) Has a Release Date, But We Still Don't Know Its Price",
    "Nothing Phone 2 Launch Date is Finally Confirmed, Releasing Earlier Than Expected",
    "Nothing Phone 2 official launch date revealed: Check details",
    "Nothing Phone 2 to launch on July 11: Here's what you need to know",
    "Nothing will reveal the Phone 2 on July 11th",
    "One of 2023's most hyped phones will launch on July 11",
    "Here's Where you can Watch the Nothing Phone 2 Launch Event",
    "How Silicon Valley Can Stretch Its Dollars",
    "A deep-tech fund for the Nordics and Baltics - Voima Ventures launches €90 million fund",
    "Embracer announces restructuring program, studio closures expected",
    "Salesforce CEO Marc Benioff voices A.I. privacy concerns, says it can be ‘the ultimate liar’",
    "Nobody is happy with NYC's $18 delivery worker minimum wage",
    "Food delivery workers in New York City now earn $18 per hour",
    "Insight Partners Slows Dealmaking Amid Tech Funding ‘Bloodbath’",
    "Amazon asks industry and government to help fight fake reviews, as AI adds a new wrinkle",
    "A blueprint for private and public sector partnership to stop fake reviews",
    "Amazon is trying to make it simpler to sift through thousands of user reviews",
    "Would you trust AI-generated reviews? The next Amazon product you buy may have them",
    "Amazon is Testing AI-Generated Review Summaries",
    "Amazon is testing an AI feature that summarizes reviews",
    "There's something interesting happening with Amazon's product reviews — and yes, it's about AI",
    "CloudZero nabs $32m investment in new era for cloud cost management",
    "CloudZero raises $32M to nearly double size of team",
    "CloudZero Raises $32 Million To Transform Cloud Cost Management",
    "Cloud cost intelligence platform CloudZero raises $32M",
    "CloudZero Raises $32M in Series B Funding",
    "United States District Court, Northern District of California",
    "FTC files to block Microsoft from buying Activision Blizzard",
    "FTC pulls emergency brake on Microsoft's marriage to Activision Blizzard",
    "Federal Trade Commission v. Microsoft Corp. and Activision Blizzard, Inc.",
    "FTC sues to block Microsoft's takeover of video game maker Activision Blizzard",
    "US FTC seeks court order to block Microsoft acquisition of Activision -source",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC asks court to prevent Microsoft closing Activision Blizzard deal early",
    "FTC to seek federal court order temporarily blocking Microsoft-Activision deal",
    "FTC Moves to Block Microsoft's Activision Blizzard Acquisition",
    "FTC sues to prevent Microsoft's acquisition of Activision Blizzard",
    "Microsoft's acquisition of Activision Blizzard sued by FTC",
    "FTC Files Suit Aiming To Block Microsoft's $69B Activision-Blizzard Acquisition",
    "FTC Motions for an Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "The FTC has asked a US court to temporarily block Microsoft's acquisition of Activision Blizzard",
    "Microsoft's Acquisition of Activision Blizzard in Jeopardy After FTC Files Injunction",
    "FTC files restraining order to block Microsoft's Activision Blizzard deal",
    "FTC Files for Temporary Restraining Order against Acquisition of Activision Blizzard by Microsoft",
    "FTC Sues Microsoft to Block Activision Blizzard Acquisition",
    "FTC requests injunction to prevent Microsoft/Activision sale from closing early",
    "US FTC moves to block Microsoft-Activision deal",
    "FTC files to temporarily block the Microsoft-Activision deal",
    "FTC asks federal judge to block Microsoft's $69 billion Activision deal",
    "The FTC can change the venue, but not the facts. https://twitter.com/...",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft, Activision Deal",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "New 15-inch MacBook Air, Mac Studio, and Mac Pro are available today",
    "Geekbench reveals M2 Ultra chip's massive performance leap in 2023 Mac Pro",
    "First Benchmark Result Surfaces for Mac Pro With M2 Ultra Chip",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "The M2 Ultra Mac Pro is benchmarked with predictably awesome results",
    "Early M2 Ultra Mac Pro Benchmarks Make The Intel Model Look Terrible",
    "The new M2 Ultra Mac Pro is insanely fast and destroys the old Intel one",
    "M2 Ultra Mac Studio review: Top of the line",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "Apple's New 15-Inch M2 MacBook Air, Macs Studio & Pro Available Today",
    "New 15-inch MacBook Air, Mac Studio, Mac Pro Available Today",
    "Apple Mac Studio vs. Mac Pro: M2 Ultra desktops, compared",
    "Apple's 15-inch MacBook Air, M2 Mac Studio and Mac Pro Now Available in Canada",
    "New Mac Studio and M2 Ultra Mac Pro now available to pick up in store as deliveries begin today",
    "M2 Mac Studio Review: This is the New Pro Mac",
    "First 15-Inch MacBook Air, M2 Ultra Mac Studio and Mac Pro Orders Begin Arriving to Customers",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Mac Studio review roundup: The Pro's choice",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Why the head of Xbox isn't worried about its future",
    "Xbox Series X isn't getting an upgrade anytime soon — but it doesn't need one",
    "Xbox boss insists there's no demand for a more powerful console yet",
    "Xbox head Phil Spencer doesn't see the need for an upgraded Xbox Series X yet",
    "Giant Bomb at Nite: Night 3",
    "Starfield PC System Requirements Revealed, Stuck at 30 FPS on Xbox",
    "Why Microsoft wants to upend the video game industry",
    "Microsoft Will Absolutely Make Money On Starfield, Phil Spencer Says",
    "Xbox Isn't Working On A More Powerful Console Yet",
    "Phil Spencer Says Xbox Series X Doesn't Need An Upgrade, Is That True?",
    "Phil Spencer Claims Starfield Will Be Profitable Thanks To Game Pass",
    "A PS5 PRO WITHOUT COMPETITION?  MICROSOFT DOESN'T SEE THE NEED FOR A NEW XBOX",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "Xbox's Bright Future, and How We'll Get There",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition"
]