[
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "EU Surprises by Approving Microsoft Activision Merger After UK Shut It Down",
    "Boss fight cleared: Europe approves Microsoft's Activision takeover",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "EU approves Microsoft's takeover of Activision Blizzard",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "CMA decries EU's Microsoft-Activision approval, stands by rejection",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard",
    "UK Regulator Responds to EU's Decision on Microsoft's Activision Blizzard Deal",
    "EU approves Microsoft's $69B Activision acquisition",
    "European Commission approves Microsoft-Activision Blizzard deal",
    "EU Greenlights Microsoft's Massive $69B Acquisition Of Activision-Blizzard",
    "Microsoft wins EU approval for $69bn Activision Deal",
    "What's next for the Microsoft-Activision deal after receiving EU approval?",
    "Microsoft & Activision Blizzard merger is a go with conditions, says EU regulators",
    "European Union approves Microsoft's $69 billion bid for Activision",
    "Microsoft Activision Deal Has Been Approved By The EU Regulator",
    "EU Approves Microsoft's $69 Billion Acquisition of Activision",
    "EU approves Microsoft's $69 billion acquisition of Activision, clearing a major hurdle",
    "E.U. breaks with Britain and U.S. to clear Microsoft's Activision deal",
    "Restart game? EU approves Microsoft's $69bn Activision bid weeks after UK rejected deal",
    "EU approves Microsoft's Activision Blizzard acquisition",
    "European Commission approves Microsoft's Activision Blizzard purchase for Xbox",
    "EU approves Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft's Activison Blizzard Acquisition Approved By EU",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "Rumor: EU Will Announce Decision On Microsoft - Activision Deal Today",
    "Microsoft and Activision Blizzard clear major hurdle in acquisition saga, but deal isn't done",
    "UK regulator “stands by its decision” to block Activision deal after EU ruling",
    "Xbox's Acquisition Of Activision Blizzard Has Been Approved By EU Regulators",
    "EU Regulators Approve Microsoft's Activision Blizzard Acquisition",
    "EU approves Microsoft's $68.7bn Activision Blizzard bid",
    "European Commission Approves Microsoft Activision-Blizzard $68.7 Billion Megadeal",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "The EU officially approves Microsoft's acquisition of Activision Blizzard",
    "Microsoft's Activision Purchase Receives Green Light From EU",
    "Microsoft-Activision Buyout Approved By European Commission",
    "EU Makes Microsoft ‘Automatically License’ ActiBlizz Cloud Games Post-Merger",
    "European Union approves Microsoft's purchase of Activision Blizzard King",
    "EU Commission Approves Microsoft's $69B Activision Acquisition",
    "Microsoft's $69 Billion Activision Deal Approved by the EU",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]",
    "EU approves Microsoft's Activision Blizzard acquisition as Azure reportedly faces scrutiny",
    "EU Starts Antitrust Investigation of Microsoft Azure",
    "Microsoft wins EU antitrust nod for Activision deal after UK veto",
    "Microsoft Cloud Service Under Scrutiny From EU Antitrust Arm",
    "IRS Weighs Creating a Government-Run Tax-Prep Option",
    "Watch Out, TurboTax: IRS to Test Free, Online Tax-Filing System",
    "The IRS reportedly has a free TurboTax alternative in the works",
    "Black Americans likely audited at higher rates, IRS says",
    "IRS could create government-run tax prep option",
    "What are the strategies to maximize tax refunds after submitting an income tax return (ITR)?",
    "excited to discover why this is unconstitutional https://twitter.com/...",
    "Another reminder of how behind the curve US fintech is https://twitter.com/...",
    "John Battelle's Search Blog",
    "EU AI Act To Target US Open Source Software",
    "Google Splits the Web Into “Commercial” and “Non Commercial” Search",
    "First the cookie bullshit, and now this. https://technomancers.ai/... [image]",
    "With its silence, Google may have quietly announced the Assistant's demise",
    "Is Google's Bard better than OpenAI's ChatGPT? We find out",
    "@rodhilton@mastodon.social",
    "This free TV comes with two screens",
    "Pluto TV Co-Founder Launches Telly, the Ultimate Free Television Upgrade for the Living Room",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "‘Telly’ is a free dual-screen TV powered by ads, includes free Android TV dongle",
    "You can get a 4K TV for free, with a very creative new catch",
    "New company giving away free TVs. Here's how to get one",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "Startup Telly Offers You a Free 55-inch TV in Exchange For Constant Ads",
    "‘Free’ TV Costs Only Your Constant Attention",
    "This startup will give you a 4K TV for free if you'll watch nonstop ads",
    "You Can Now Join the Waitlist for Telly's Free Data-Harvesting TVs",
    "A Startup From the Co-Founder of Pluto TV Thinks America Is Ready for Free TVs",
    "Hardware startup Telly launches a free smart TV entirely supported by ads",
    "Telly Launches Dual-Screen, Ad-Supported TV For Free: Here's How To Get One",
    "Your Next TV Could Be Free (If You Don't Mind a Second Screen Dedicated to Ads)",
    "Telly reveals its free dual-screen TV, complete with ads",
    "Dual-screen ‘Telly’ is a crazy new TV that's free, but the second screen constantly shows ads",
    "There's a way to get a free flatscreen TV — but with a catch",
    "A new company wants to give you a free TV, in exchange for always showing you ads",
    "First Free, Ad-Supported Television Set Readies for Primetime",
    "Telly is looking to give away a half-million free TVs — but there's a catch",
    "This Company Will Give You A Free TV In Exchange For Your Data",
    "This 55-Inch 4K TV Is Free And Has Two Screens—But There Is A Catch",
    "You can reserve your free 55-inch ad-supported TV from Telly now, to ship later this year",
    "hey guys, free hackable TV https://variety.com/...",
    "Whys there a camera and mic attached to this tv? FED WORK!!!!! https://twitter.com/...",
    "DOJ crypto enforcement director calls for crackdown on illicit behavior by exchanges",
    "US Justice Department on the hunt for DeFi hackers and thieves: Report",
    "NCET Director: DOJ Will Crackdown On Crypto Exchanges",
    "US DOJ launches manhunt for DeFi hackers and thieves",
    "US DoJ crypto enforcement team head says they're coming after mixers and tumblers",
    "U.S. DOJ Vows To Beef Up Scrutiny Of Crypto Exchanges To Curb Illicit Behavior",
    "U.S. DOJ's Crypto Enforcement Director Promises Crackdown on Illicit Behavior on Exchanges: FT",
    "DOJ Crypto Chief Signals Crackdown on Exchanges",
    "US DoJ Goes After Rogue Exchanges As Crypto Crimes Grow ‘Significantly’",
    "US DOJ Ramps Up Efforts to Crack Down on DeFi Hacks and Thefts",
    "DOJ's Crypto Chief: No Exchange is ‘Too Big to Fail’",
    "Breaking: US DOJ To Intensify Crackdown Against Crypto Exchange, DeFi, Mixers",
    "US DOJ to suppress illicit crypto exchange activity, official says",
    "US DOJ ramps up crypto scrutiny: targets crypto exchanges, DeFi hackers",
    "U.S. DOJ is Targeting Crypto Exchanges, Mixers: Official",
    "Head of U.S. DOJ crypto enforcement eyes crackdown on non-compliant crypto exchanges: FT",
    "Open-source AI continues to celebrate as Big Tech mulls over moats",
    "Open-Source AI Is Gaining on Google and ChatGPT",
    "Amazon is building an AI-powered ‘conversational experience’ for search",
    "Google search will be led by generative AI only in the US",
    "Amazon Using AI to Drive Faster Delivery",
    "Remove search-location.com virus from Chrome, Safari, Firefox on Mac",
    "Amazon on AI-search... https://twitter.com/...",
    "YouTube TV hits 6.3 million subscribers as all other live TV services shrink",
    "YouTube TV passes 6 million subscribers https://9to5google.com/...",
    "Procurement Startup Zip Lands $100M — Ups Valuation To $1.5B",
    "Zip Introduces Intake-to-Pay, the World's First Unified Platform for Procurement",
    "Zip Raises $100 Million Series C at $1.5 Billion Valuation to Revolutionize Procurement",
    "Free compensation benchmarking data from 3,000 startups",
    "New TSA Tech Assesses If ‘You Are Who You Say You Are’",
    "Really enjoyed this @BigMeanInternet profile of Douglas Rushkoff https://www.wired.com/...",
    "ZestMoney founders leaving troubled fintech firm post PhonePe deal collapse",
    "ZestMoney sees founder exits, uncertain future",
    "ZestMoney founders resign in wake of failed sale",
    "Founders Quit ZestMoney After Acquisition Deal Falls Through: Report",
    "ZestMoney founders resign two months after PhonePe deal falls through",
    "After Failed Acquisition Talks, ZestMoney Founders Quit",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "Trends you should look out for the rest of 2023",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Yelp: Connect people with great local business.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Mon. 05/15 - Media Day On The Podcast",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Japan leads world in losses from North Korean crypto hacking with 30% of total: Report",
    "North Korean Crypto Thefts Surpass $2.5 Billion",
    "North Korean hackers steal $497M in crypto from US businesses",
    "North Korean hackers stole $721 million in cryptocurrency from Japan - Nikkei",
    "Smart raises $95M for its pension management platform",
    "Smart Raises $95m in Series E Funding",
    "Pension savings platform Smart secures £75m funding injection",
    "UK's fintech firm Smart secures €87.3M to make pension auto-enrolment simple; here's how",
    "Smart Raises $95M in Series E Funding",
    "OpenAI CEO Sam Altman in Talks for $100M Worldcoin Funding",
    "Pensions fintech Smart gets wise to $95 million",
    "Digital pension provider Smart nets £76m",
    "Only half of top 60 crypto companies have an external auditor",
    "African fintech M-Kopa raises $250 million",
    "M-KOPA closes one of Africa's biggest rounds at $250m",
    "M-KOPA Raises $255M in Funding",
    "Kenya's M-KOPA Secures USD 250 M+ Debt, Equity Funding",
    "Delaware judge sides with Larry Ellison, Safra Catz over Oracle-NetSuite deal lawsuit",
    "Australian Financial Review",
    "NeoGames acquired by Australia's Aristocrat in $1.2 billion deal",
    "Aristocrat Leisure to buy software firm NeoGames for US$1 billion",
    "Aristocrat acquires NeoGames with office in Kyiv for $1.8B",
    "Aristocrat to buy gaming software firm NeoGames",
    "Aristocrat agrees to pay $1.2 billion for Nasdaq-listed NeoGames",
    "Aristocrat to acquire European RMG platform provider NeoGames in US$1.2 billion deal",
    "These Stocks Are Moving the Most Today: Newmont, Oneok, Magellan Midstream, NeoGames, and More",
    "Fanatics to buy PointsBet's U.S. assets for about $150 million",
    "Fanatics is making a $150 million bet on online sports betting",
    "Fanatics to Buy PointsBet's US Business in Sports Betting Push",
    "Fanatics Buying PointsBet US Sports Betting Business For $150 Million",
    "Fanatics to Buy PointsBet's U.S. Arm for $150M, to Boost Betting Push",
    "A joint statement from Fanatics Betting & Gaming and PointsBet: [image]",
    "It is insane how many ventures @Fanatics has their hands in. https://twitter.com/...",
    "Expectations remain high as Sea Group is set to deliver Q1 2023 results",
    "US DoT Suspends Commuting Cost Benefits Following Data Breach"
]