[
    "Microsoft Security Response Center",
    "Microsoft Response to Layer 7 Distributed Denial of Service (DDoS) Attacks",
    "Microsoft says early June service outages were cyberattacks",
    "Microsoft says the early June outage to its services was due to a DDoS cyberattack",
    "DDoS Attacks Culprit of Recent Azure, Microsoft 365 Outages",
    "Microsoft says Azure disrupted after a week of repeated service outages",
    "Microsoft says Azure outage was caused by ‘anomalous’ traffic spike",
    "The recommendations section is odd when this impacted the provider https://msrc.microsoft.com/...",
    "There is no moral high ground for Reddit as it seeks to capitalise on user data",
    "Reddit stands firm in clash with users as blackout on forums escalates",
    "Report: Reddit admins are forcing moderators to reopen subreddits to the public",
    "Reddit's golden geese foul up its IPO plans",
    "Two of the biggest Reddit communities reopened in the funniest way possible",
    "How To Use The Reddit App's Hidden, Anonymous Browsing Mode",
    "Reddit threatens to take over blacked-out subreddits by replacing moderators",
    "Despite widespread protest, Reddit CEO says company is ‘not negotiating’ on 3rd-party app charges",
    "Many Subreddits Still Out of Action as Reddit's API Pricing Protest Continues",
    "Reddit May Replace Moderators If They Don't Open Their Pages, Report Says",
    "Protests fizzle as Reddit refuses to back down and many subreddits come back online",
    "What's Going On With Reddit?  —  Thousands of subreddits have gone dark in protest.",
    "This is a freaking case study on how to mess up a viable community.",
    "The subreddit protests may have had a small yet significant impact on Reddit's traffic …",
    "Reddit's average daily traffic fell during blackout, according to third-party data",
    "A Huawei bid turned into a hunt for a corporate mole",
    "Quant collaborates with BIS and the Bank of England on Project Rosalind",
    "Bank of England's Project Rosalind results out, digital pound plans in progress",
    "Bank of England clears path for digital pound backed by Project Rosalind study",
    "Announcing a Global Partnership with Block's Bitkey Wallet",
    "Bitcoin Price Rebounds $1,000 From $25,000 Support Level - What Are Whales Up To?",
    "Top US Crypto Exchange Coinbase Partners With Jack Dorsey's Self-Custody Wallet Bitkey",
    "Jack Dorsey-Backed Bitcoin Wallet Bitkey To Integrate With Coinbase and Cash App",
    "Coinbase partners with Block's self-custody wallet Bitkey",
    "buy bitcoin from an exchange and move it to a hardware key you control https://twitter.com/...",
    "Huawei wants patent royalties from 30 Japanese companies",
    "Huawei Demands Royalties From Japanese Companies, Nikkei Says",
    "Pull rich data from apps directly into Google Docs with third-party smart chips",
    "Free Figma template of onboarding & activation designs",
    "San Francisco Business Journal",
    "Crypto payments platform Wyre shutters, citing bear market conditions",
    "Crypto Payments Firm Wyre Shuts Down — Users Told to Remove Assets From Platform",
    "Crypto Infrastructure Provider Wyre to Wind Down Operations Due to Extended Bear Market",
    "Wyre Bows Out: Crypto Platform Succumbs to Bear Market",
    "Wyre To Shut Down As Crypto Winter Claims Another Casualty",
    "Crypto startup Wyre, once valued at $1.5 billion, officially shuts down",
    "Crypto Payments Firm Wyre is Shutting Down",
    "OpenAI's Mira Murati: the woman charged with pushing generative AI into the real world",
    "Meta's Voicebox AI Tech Could Give Your Digital Assistant a Familiar Voice",
    "Huawei protests EU's phase-out guideline targeting vendor status",
    "Time to rebrand as “https://meet.ai/ , bitch”? https://twitter.com/...",
    "Louisiana Office of Motor Vehicles",
    "Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "A Russia-Based Hacking Rampage Hits US Agencies and Exposes Millions",
    "MOVEit Data Breach Impacts OMV",
    "More state governments report MOVEit vulnerability exposure",
    "Every Louisiana driver's license holder exposed in cyberattack",
    "MOVEit: Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "Millions of Americans' Personal Data Exposed in Global Hack",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Top 5 tips for establishing your next attendance policy",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/16 - Google Does it Again",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA"
]