[
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 12%",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker",
    "US SEC sues crypto exchange Coinbase, one day after suing Binance",
    "SEC sues Coinbase, continues major crackdown on cryptocurrency exchanges",
    "Crypto Firms Start Looking Abroad as U.S. Cracks Down",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "The SEC is finally making good on its threats to rein in crypto",
    "Cathie Wood's ARK Buys $21.6M Coinbase Shares as SEC Suit Sends COIN Prices Tumbling",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "SEC's Gensler claims ‘parallels’ between Binance and FTX, yet one wasn't sued",
    "SEC sues Coinbase in widening crackdown on crypto exchanges",
    "Coinbase is being sued by the SEC",
    "Coinbase Violated Securities Laws With Staking Program, Multiple U.S. State Regulators Allege",
    "Ark Invest Buys $21.6 Million Worth Coinbase Shares, Despite Legal Drama",
    "SEC Sues Coinbase for Unregistered Crypto Brokering; Spotify Redirects Podcast Division",
    "Coinbase sued by SEC in New York Federal court",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "CNBC Daily Open: New Highs for the S&P and Nasdaq",
    "Former Twitter CEO Claims Ethereum Is A Security, Will This Affect Prices?",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "SEC Lawsuits Against Binance, Coinbase Critiqued By Crypto Lawyer and Former Employee",
    "Coinbase responds to SEC lawsuit - Here is what they said",
    "Coinbase short sellers set to rake in $307m on stock crash",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "mission driven company, where the mission is failure",
    "How are the “we take a long view of crypto” people doing today",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "Yes. https://twitter.com/...",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "They didn't sue FTX. https://twitter.com/...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC is going crazy https://twitter.com/...",
    "Mistakes were apparently made... https://twitter.com/...",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "BREAKING WE'RE ALL CRIMINALS",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "Gary upping the ante this week. https://twitter.com/...",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "SEC lawsuits: 67 cryptocurrencies are now seen as securities by the SEC",
    "Doubling Down: SEC Charges Coinbase For Operating Illegally, A Day After Charging Binance",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "Seven bombshells from the SEC's Coinbase suit",
    "This Is What the Government Strangling Crypto Looks Like",
    "Coinbase and Binance Lawsuits Put Crypto on Ice",
    "Coinbase, don't feel left out. SEC has a lawsuit for you, too",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "New Jersey Office of Attorney General",
    "Secretary of State Giannoulias Charges Coinbase in Groundbreaking Suit",
    "SEC Crackdown Spurs Robinhood to Review Its Crypto Operations",
    "Coinbase Crackdown Widens as US States Push to Halt Staking Product",
    "The Department of Financial Protection …",
    "DFPI Issues Action Against Coinbase Citing Staking Rewards Program Violates Securities Law",
    "The 3 Takeaways From the Lawsuit Between the SEC and Coinbase",
    "US States Are Going After Coinbase Following SEC Lawsuit — Here's How",
    "Coinbase Hit With Pending Cease and Desist Orders From 11 States",
    "The Eclectic Light Company",
    "Apple Makes Developer Betas Free to Download and Install",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Apple will let you install its newest developer betas right now — for free",
    "Now anyone can download the iOS 17 Developer Beta 1 for free",
    "Apple makes it easier for you to check out what it takes to be an AppStore dev",
    "How to run a macOS beta on Apple silicon",
    "It wasn't a mistake — Apple betas are now free",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple's iOS 17 developer beta is available for free",
    "Anyone Can Install iOS 17 Beta Right Now, But You Shouldn't",
    "How to download the watchOS 10 beta on your Apple Watch",
    "Apple's iOS 17 developer beta is now free to install",
    "Apple makes OS betas free for all users",
    "Rare bug allows non-developer iPhone users to download and install iOS 17 beta",
    "Apple made the iOS 17 developer beta available to everyone — but you probably shouldn't install it",
    "Apple briefly made the iOS 17 Developer Beta available to all",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "How to get iOS 17 — Quick! You might get it for free",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "Whatever you do, don't download the iOS 17 developer beta - Apple made a huge mistake",
    "iOS 17 Developer Beta made available to all",
    "iOS 17 beta is here, but only for developers",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "@williamgunn@mastodon.social",
    "iOS 17 beta brings changes to SMS texting, including ability to edit messages and more",
    "iMessage group chats with Android users are better, but also worse in iOS 17",
    "iOS 17 and iPadOS 17 beta 1 now available",
    "United States District Court for the District of Columbia",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "Press Release SEC Seeks Emergency Relief to Ensure Binance.US Customers' Assets are Protected",
    "SEC seeks to freeze $2bn in Binance.US assets, Coinbase vows to take legal fight to Supreme Court",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "SEC files motion to freeze cryptocurrency held by Binance.US",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "Crypto Crackdown: Coinbase and Binance Lawsuits Shake Markets",
    "SEC Goes to War With Crypto: Bitcoin Pumps!",
    "SEC files motion for restraining order to freeze Binance US assets",
    "SEC Seeks to Freeze Binance.US Assets, Files Temporary Restraining Order",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "SEC Seeks Court Approval to Freeze Binance US Crypto Assets, Citing Customer Safety Concerns",
    "U.S. SEC Files Emergency Motion To Freeze Binance US' Assets",
    "Binance says US users' crypto is safe after SEC files to freeze assets",
    "SEC Wants to Freeze Binance Assets to Protect US Customers",
    "SEC requests asset freeze on Binance.US amidst lawsuit alleging compliance failures",
    "SEC Asks Court to Freeze Binance.US Assets",
    "SEC Strikes: Seeks Temporary Restraining Order To Freeze Binance.US Assets",
    "SEC Files Motion to Freeze Crypto Held by Binance.US",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "Apple confirms acquisition of AR startup Mira: What this means for its spatial computing dreams",
    "Apple confirms acquisition of AR startup Mira following Vision Pro launch: Report",
    "Apple acquires B2B AR startup Mira",
    "Report: Apple Acquires AR Headset Maker Mira",
    "Apple acquires Mira, a startup building lightweight AR hardware",
    "Apple bought the AR company behind the tech in Nintendo's ‘Mario Kart’ ride",
    "Apple reportedly acquired AR start-up Mira as it pushes new headset vision",
    "Mira made AR headsets for the US Military — and Apple owns the company now",
    "Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World",
    "Apple buys AR headset startup Mira - The Verge",
    "@RichLightShed ... Funny part there is Apple looked at buying Within first!",
    "@metacurity@infosec.exchange",
    "@dangillmor@mastodon.social",
    "Big Tech rolls back misinformation measures ahead of 2024",
    "Possible Reasons Why YouTube Has Given Up Trying To Police 2020 Election Misinfo",
    "Reddit to lay off about 5% of workforce: Report",
    "Reddit Laying Off 5% Of Workforce, Joining Tech Sector Contraction",
    "Reddit to lay off about 5% of its workforce as tech job cuts top 200,000",
    "Reddit to cut 5% of workforce, slow hiring in restructuring move: report",
    "What's Behind the Redditor API Strike",
    "Reddit is the latest tech company to announce layoffs, affecting 5 percent of its workers",
    "Reddit Laying Off 5% of Workforce, Trims Hiring Plans",
    "Deepwater Asset Management",
    "My ten takeaways from WWDC 2023",
    "Apple's Vision Pro Is A Technical Tour De Force, But Accessibility Fascinates Most",
    "Apple launches Vision Pro mixed reality headset into unproven niche market",
    "Apple's Vision Pro sets up a clash with Valve, Sony, Meta over future of VR/AR",
    "Apple Reveals the Metaverse",
    "Apple's Vision Pro Is A New Spatial Computing Device — Not A Headset",
    "Apple's Vision Pro AR/VR Headset: Bold, Innovative, and Ridiculously Expensive",
    "Apple's Vision Pro is an incredible machine. Now to find out what it is for",
    "Vision Pro could be Apple's biggest hit since iPhone, but that won't be known for years",
    "Eyes (and head) on with the Apple Vision Pro",
    "Apple Vision Pro's Spatial Computing Is a Big Deal",
    "My first encounter with Apple Vision Pro completely changed by opinion on VR",
    "Apple Vision Pro AR Headset: 5 Reasons We're Excited",
    "Apple is going out of its way to make sure Vision Pro doesn't look dorky",
    "Apple Vision Pro Will Compete with Meta Quest 3, Here's Difference",
    "Apple's AR headset is a game-changer for startups",
    "Everything We Dislike About Apple's Vision Pro AR/VR Headset",
    "Apple's new headset still has more potential than any wearable Google ever built",
    "Apple and the two-track future for the metaverse",
    "Apple's Vision Pro AR headset cheat sheet: Release date, price and more",
    "Apple will make dev kits available to help developers build and test apps for Vision Pro headset",
    "Why I Can't Bet Against Apple's Mixed-Reality Prowess",
    "Apple Vision Pro Headset: News, Pricing, Release Date, and Specs",
    "How Apple Vision Pro Works With the Mac",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "Marques Brownlee on YouTube",
    "Adam Savage's Tested on YouTube",
    "Apple Vision Pro Impressions!",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "3 things I learned by trying Apple's Vision Pro headset (and 3 I didn't)",
    "Hands on: Apple Vision Pro: I just wore the future",
    "Hands-on with Apple Vision Pro: This is not a VR headset",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Even with so many demonstrated use cases, Apple Vision Pro might not yet have a purpose",
    "I tried Apple Vision Pro and it's far ahead of where I expected",
    "We tried Apple Vision Pro: Intuitive as a touch screen but awkward to wear",
    "The Engadget Podcast  —  227 Episodes  —  We've survived day one of Apple's WWDC '23 …",
    "Apple Vision Pro Hands-On Impressions!",
    "Vision Pro: I just tried Apple's first spatial computer, and here's what I think",
    "Here's what it's like typing with Vision Pro and visionOS",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "Here's what wearing Apple's Vision Pro virtual reality goggles is really like",
    "Vision Pro: BBC editor tries out Apple's $3,499 headset",
    "Everything you need to know about Apple's $3,499 Vision Pro AR/VR headset",
    "Apple Vision Pro doesn't solve my biggest problem with VR headsets",
    "Engadget Podcast: Trying out Apple's Vision Pro headset",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Apple's AR headset suffers from a lack of vision",
    "What Resolution Is Apple's New Vision Pro AR/VR Headset?",
    "What it's like to try Apple's new Vision Pro headset",
    "Vice wag: Apple's Vision Pro ‘is a $3,500 ticket to nowhere’",
    "Generative Fill Hands-On and Apple VisionPro Hands-Off",
    "First Hands-On Demos with Apple Vision Pro [VIDEOS]",
    "I tried the Apple Vision Pro mixed-reality headset — here's what it's like",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Apple Vision Pro Hands-On: This Is the Headset I'd Use to Watch 3D ‘Avatar’",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple Vision Pro first look",
    "One More Screen for Your Face  —  A man approaches his children in a dim room.",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "wow this is a way better demo than what Apple showed during its keynote https://twitter.com/...",
    "Renewed shall be the headset that was broken, And shirtless once again shall be the king. [image]",
    "Incredibly clear and lifelike. Best I've seen yet. https://twitter.com/...",
    "These are the people you are up against if you think the Apple Vision Pro will fail [image]",
    "This is not the final form https://9to5mac.com/...",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "Now in beta: Save and sign in with passkeys using 1Password in the browser",
    "Are we heading towards a future without passwords?",
    "1Password's latest beta rolls out Chrome passkeys",
    "Google unlocks passkeys support for Workspace",
    "How to use passkeys with 1Password and ditch your passwords for good",
    "1Password passkey support for the web launches in public beta on the Mac",
    "Google Workspace Now Supports Passkey Login",
    "1Password rolls out Chrome passkeys with latest beta, how to use it",
    "1Password rolls out support for Passkeys in beta for browsers, with limited support on mobile",
    "Google launches passkeys for Workspace",
    "EU considers mandatory ban on using Huawei to build 5G - FT",
    "Everyone points to Huawei.  But ZTE is still all over the place",
    "Louis Vuitton Selling $41K NFTs That Can't Be Resold",
    "Louis Vuitton embraces Web3, launches its iconic trunk as a digital collectible",
    "Louis Vuitton Set to Launch $42,000 Physical-Backed NFT Trunks",
    "Louis Vuitton Vends $41k NFTs to Elite Customers",
    "Louis Vuitton Launches Treasure Trunk Digital Collectible Priced at €39,000",
    "Louis Vuitton introduces NFT collection featuring $42k ‘VIA Treasure Trunk’",
    "Instagram is apparently testing an AI chatbot that lets you choose from 30 personalities",
    "Instagram may be looking into ways of thinking instead of its users",
    "Instagram may soon announce its own AI chatbot",
    "Instagram May Be The Next Social Media App To Get An AI Chatbot",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Instagram works on AI Chatbots in DMs",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response",
    "Free Figma template of onboarding & activation designs",
    "Tingo Group: Fake Farmers, Phones, and Financials—The Nigerian Empire That Isn't",
    "Fintech Tingo's shares slump as Hindenburg takes short position",
    "The Tingo Tangle: Hindenberg Research Alleges Fabricated Figures, An ‘Exceptionally Obvious Scam’",
    "👨🏿‍🚀TechCabal Daily - An “exceptionally obvious” Bingo play?",
    "Tingo Group Refutes Malicious and Misleading Allegations in Hindenburg Research Report",
    "US-Listed Nigerian ‘Agri-Fintech’ Firm Tingo Rocked By Allegations Of Brazen Fraud",
    "Hindenburg Research publishes investigation into fintech Tingo Group claiming financial fraud",
    "Shortseller Hindenburg Research calls Tingo Group an exceptionally obvious scam",
    "That @HindenburgRes report on tingo is devaststing",
    "A16z's Marc Andreessen speaks out against AI doomer cults",
    "Andreessen Horowitz Co-Founder Marc Andreessen on ‘Why AI Will Save the World’",
    "Veteran VC Marc Andreessen defends AI, including music uses",
    "Actually, AI will save the world, not destroy it, says venture capitalist Marc Andreessen",
    "A.I. doomers are a ‘cult’ — here's the real threat, according to Marc Andreessen",
    "You may remember him from such previous op-eds as “Why crypto will save the world” [embedded post]",
    "@Techmeme Uh, yeah, I'm not taking anything that Andreesen says seriously.",
    "Every decade or so, @pmarca takes a view that defines the decade(s) ahead. https://twitter.com/...",
    "Why AI will save @a16z bags https://a16z.com/...",
    "I enjoyed this optimistic take on AI from @pmarca https://pmarca.substack.com/ ...",
    "I hope it's ok that I do not want infinite love from an AI. https://a16z.com/...",
    "Why AI Will Save The World Screenshots edition! 🧵 https://twitter.com/... [image]",
    "Important new post from @pmarca https://a16z.com/...",
    "GetHarley raises £42m for digital dermatological platform",
    "GetHarley Closes $52 Million Funding Round Led by Index Ventures",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Beyond data collection: Exploring the uses for online forms - Part II (Approvals)",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Salesforce CEO Benioff shakes up top ranks - source",
    "Priceline Partnering with Google on New AI Tools",
    "Priceline joins A.I. chatbot race, signing on with Google to help ease travel booking",
    "Priceline partners with Google to deploy generative AI",
    "Priceline Charts Businesswide Generative AI Deployments with Google Cloud",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Google Brings AI to Priceline to Help Plan Your Vacations",
    "Priceline Aims to Offer ‘Personal Concierge’ via Google AI",
    "e-Conomy India 2023  —  Executive Summary A continued shift in consumer and merchant behaviour …",
    "India's internet economy to reach US$1 trillion by 2030: Google, Temasek and Bain & Company report",
    "India's digital economy to register 6x growth, reach $1 trillion by 2030",
    "'India's Internet economy to reach $1 trillion by 2030'",
    "India's Internet Economy To Grow Sixfold To $1 Trillion By 2030, Says Google-Temasek-Bain Report",
    "India's internet economy to reach $1T by 2030, contribute 12-13% to GDP: Report",
    "Smaller cities key to India's digital decade",
    "India's Internet economy to grow six-fold to $1 trillion by 2030",
    "e-Conomy India 2023: Strategies for growth in India's digital decade",
    "GSoft announces CA$125 million investment from CDPQ to accelerate growth strategy",
    "Caisse Invests $93 Million in GSoft to Fund Global Acquisitions",
    "International Business Times",
    "Samsung will focus on foldables in its upcoming July Unpacked event",
    "The Galaxy Z Flip 5, Fold 5 are officially coming earlier than expected",
    "Samsung will unpack Galaxy Z Fold 5 and Z Flip 5 in Seoul: 3 reasons why this is significant",
    "Samsung Galaxy Unpacked 2023: New foldables launching in Seoul next month [details]",
    "Samsung confirms Galaxy Unpacked 2023 event in July: What to expect",
    "Samsung to Unfold the Galaxy Z Fold 5 and Flip 5 in July",
    "Samsung to hold Galaxy Unpacked event next month in S. Korea",
    "Samsung's next-generation foldables will be revealed at Galaxy Unpacked in July",
    "BREAKING: Samsung confirms Galaxy Z Flip 5, Z Fold 5 will launch in July",
    "Samsung to Host Galaxy Unpacked Event in Seoul for First Time",
    "Its official: Samsung Galaxy Z Fold 5 launching on July 26 in Korea",
    "Official: Samsung confirms first Korea Unpacked, Galaxy Z Fold 5 launch on July 27",
    "Samsung's next Unpacked event is all about foldables - and it's happening sooner than usual",
    "Samsung's next foldable-focused Galaxy Unpacked will take place in late July",
    "Samsung Galaxy Z Fold 5 and Flip 5 launching late July at Unpacked in South Korea",
    "Samsung confirms Galaxy Z Flip 5, Fold 5 launch details",
    "Samsung Confirms Galaxy Unpacked for Galaxy Fold 5 Happening in July",
    "The press release (archived): [image]",
    "Actor Leonardo DiCaprio Invests in NUVIEW's LiDAR Satellite Constellation",
    "GitLab Reports First Quarter Fiscal Year 2024 Financial Results",
    "Meanwhile, the crypto-native life insurer, bags $19m seed funding",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Bitcoin Life Insurance Startup Raises $19M in Seed Rounds Led by Sam Altman and Gradient Ventures",
    "Microsoft to pay $20m for child privacy violations",
    "Recent Privacy Fines Remind Us Why We Need Web3",
    "Xbox hit with a $20 million fine for 'illegally retaining children's personal information'",
    "CNET Backpedals On AI-Generated Content; FTC Fines Microsoft $20M For Collecting Kids' Data",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "Xbox fined $20M for child privacy violations by FTC",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "That fine is 49 minutes of Microsoft's revenue."
]