[
    "@dcseifert@mastodon.social",
    "What is Reddit blackout protest: Explained",
    "Reddit blackout: Here's why thousands of subreddits are going dark?",
    "Thousands of subreddits go dark to protest Reddit's API pricing",
    "Reddit's massive ‘blackout’ protest, explained",
    "Reddit Crashed Because Too Many Users Are Protesting Site Changes",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "Reddit blackout: What, why and how it is impacting users",
    "my usage of reddit shall too pass https://www.theverge.com/...",
    "Reddit CEO tells employees that subreddit blackout ‘will pass’",
    "Reddit CEO Tells Employees That Subreddit Blackout ‘Will Pass’",
    "International Business Times",
    "@MikeRiverso@mastodon.social",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "Reddit says protesting communities crashed the site",
    "Thousands Of Reddit Communities Go Private To Protest Platform's New Price Policy For Apps",
    "Reddit faces backlash as thousands of communities ‘black out’ over new API pricing",
    "Over 8,000 subreddits go dark in protest against Reddit's API fees",
    "Reddit goes dark over API price changes that'll kill third-party apps and NSFW content",
    "Over 7k Subreddits Go Private in Protest Over API Pricing Increase",
    "Reddit's Crypto Communities Go Dark In Support of Protest Against API Changes",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Reddit API charges spark community outrage, dayslong blackout",
    "You're making money while increasing interest in our site?  Bad third party apps, bad.",
    "“The adventure that is the end of free money continues!” https://twitter.com/...",
    "won't be anything left to take public. https://twitter.com/...",
    "Four-week-old AI start-up raises record €105mn in European push",
    "French company Mistral AI raises 105 mln euros shortly after being set up",
    "AI Video Creation Pioneer Synthesia Raises $90 Million Series C Led by Accel",
    "AI-Generated Video Platform Synthesia Receives Nvidia Backing At Unicorn Valuation",
    "Synthesia Raises $90M in Series C Funding",
    "AI startup Synthesia gains unicorn status after Nvidia-backed fundraise",
    "Generative AI Video Platform Synthesia Raises $90 Million at $1 Billion Valuation",
    "Generative AI firm Synthesia raises £71.4m at unicorn valuation",
    "UK's Synthesia raises $90 million valuing the AI video creation platform at $1 billion",
    "AI firm Synthesia hits $1B valuation with Nvidia support",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Paul McCartney says AI tools helped rescue John Lennon vocals for ‘last Beatles record’",
    "Paul McCartney: AI has enabled a “final” Beatles song",
    "The Beatles will release a final record, using John Lennon's voice via an AI assist",
    "Paul McCartney Says ‘Final’ Beatles Song Coming Soon—Thanks to AI",
    "Paul McCartney used AI to make a new Beatles song",
    "The Beatles are dropping one last track with the help of AI",
    "Paul McCartney uses AI to resurrect old John Lennon demo for “final Beatles record”",
    "Paul McCartney is using AI to create a final song for The Beatles",
    "Paul McCartney says AI helped him finish one last Beatles song - here's what I think is coming",
    "Paul McCartney Says A.I. Helped Complete ‘Last’ Beatles Song",
    "Paul McCartney Says “Final Beatles Record” In Works With AI-Assisted John Lennon Vocal",
    "How Paul McCartney Used AI to Create the ‘Final Beatles Record’",
    "Paul McCartney Used AI to Create a New and ‘Final’ Beatles Song",
    "Paul McCartney Confirms The Beatles Will Release ‘Final’ Song Using AI",
    "The Beatles releasing ‘final’ album this year — with a little help from AI",
    "The Beatles Used AI to Create Their ‘Final Song’ With John Lennon's Voice",
    "Paul McCartney: AI helps create ‘the last Beatle record’",
    "Paul McCartney Is Using AI To Complete ‘Final’ Beatles Song",
    "Paul McCartney Says He Used AI to Produce a “Final” Beatles Song",
    "‘Last Beatles record’ is on the way (with a little help from AI friends)",
    "The Beatles Come Together for ‘Last Record’ Using AI, Paul McCartney Says",
    "Paul McCartney says A.I. got John Lennon's voice on ‘last Beatles record’",
    "AI helped make a song on ‘the last Beatles record’, McCartney says",
    "The Beatles are releasing their ‘final’ record. AI helped make it possible",
    "Paul McCartney Says He's Using AI to Build the ‘Final’ Beatles Song",
    "Paul McCartney Used AI to Make a Final Beatles Song — But Not In a Creepy Way",
    "Paul McCartney Used AI to Finish an Unreleased Beatles Song",
    "Paul McCartney says ‘final’ Beatles song coming thanks to artificial intelligence",
    "The Beatles are over. Why can't McCartney just let it be?https://www.bbc.com/...",
    "Paul McCartney says artificial intelligence has enabled a ‘final’ Beatles song",
    "XRP Jumps After Highly Anticipated Hinman Docs Are Unsealed",
    "SEC officials pushed Hinman to clarify ETH wasn't a security: Court docs",
    "The Hinman Documents Reveal a Deceitful SEC",
    "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials",
    "SEC emails show multiple officials examining ethereum in 2018",
    "XRP Price Prediction as Hinman Documents Go Public - Can XRP Reach $10 in 2023?",
    "Ripple CEO: US SEC May Be Bluffing About Crypto Enforcement",
    "SEC Emails Reveal: Hinman Wasn't Only Official Deliberating ETH Security",
    "Ripple v. SEC and the Hinman Speech: What Happened Behind the Scenes",
    "In Response to Hinman Docs, Ripple CEO Slams SEC's “Politically-Motivated Overreach”",
    "Hinman docs unsealed: SEC concerned over ‘Ether is not a security’ statement",
    "Ripple's chief legal officer calls for investigation after release of Hinman docs",
    "Dissecting the ‘Hinman Emails’: Adam Cochran on SEC Staff's Concerns over Comments About Ethereum",
    "Hinman Doc. Release: Ripple Garlinghouse says it is Worth the Wait",
    "Next 24 Hours Will Be Critical For Crypto - Here's Why",
    "Ripple-SEC Lawsuit: Hinman Documents To Be Released Today",
    "Hinman speech contained “made-up analysis”, Ripple's Chief legal officer says",
    "Ripple Vs SEC Lawsuit Update: What To Expect Next With Hinman Document Release Today?",
    "Full document 👇🏼 https://www.dropbox.com/...?",
    "Hinman details very clearly saying ETH is not a security https://twitter.com/...",
    "Larry Ellison edges past Bill Gates as world's fourth-richest person, Bloomberg says",
    "Bill Gates falls another notch on the world's billionaire list, as AI takes Larry Ellison higher",
    "Larry Ellison passes Bill Gates to become world's fourth richest person",
    "Microsoft CEO Satya Nadella discusses his “eureka moment” with AI in new interview",
    "Read the new Twitter CEO's first email to employees",
    "Twitter 2.0 is an empty promise unless it exterminates the bots",
    "Twitter's new boss wants it to become 'the world's most accurate real-time information source'",
    "Twitter boss Linda Yaccarino gives first hint on shake-up plans",
    "Twitter's New CEO Makes It Clear: This Is Elon's Ship, She's Just Running It,",
    "Twitter 2.0 explained by the new CEO",
    "New Twitter CEO outlines her plans for the social media platform",
    "Twitter CEO Linda Yaccarino Says Twitter Will Be World's Most Accurate Information Source",
    "Twitter CEO Linda Yaccarino Outlines “Twitter 2.0” Vision",
    "Twitter 2.0: New CEO's Vision for the World's Most Accurate Information Source",
    "New Twitter CEO wants to create ‘global town square’: report",
    "Twitter CEO Linda Yaccarino pens downs a letter for employees: Here's what the letter says",
    "Twitter Sends First Comms Email Since Takeover",
    "Twitter's new CEO has shared her first email to employees",
    "Twitter's new CEO wants to turn it into the 'world's most accurate real-time information source'",
    "Elon Musk Successor Reveals Real Reason She Chose Twitter",
    "Twitter CEO Linda Yaccarino echoes Musk in emphasizing freedom of speech in debut tweet thread",
    "Twitter's new CEO just sent her first email to employees, then posted it on Twitter",
    "excruitiatingly hollowed words.  the glass cliff is real.",
    "Hello Twitter. People keep asking me: Why Twitter? So, I'll tell you. 👇",
    "Fire your ghostwriter, Linda https://twitter.com/...",
    "Good luck but extremely skeptical it'll go as she envisions https://www.theverge.com/...",
    "never on this app lol https://twitter.com/...",
    "Has she told Elmo this? https://twitter.com/...",
    "Breaking Points on YouTube",
    "EXCLUSIVE: Jack Dorsey On RFK Jr. Elon Musk, AI Regulation | Breaking Points",
    "Jack Dorsey saga: How Elon Musk learnt fast to respect strict Indian laws [details]",
    "Jack Dorsey Says that He Hopes Twitter would Adopt Bitcoin Technology",
    "'That's why they banned Rahul Gandhi': Congress after Jack Dorsey claims ‘govt pressure’",
    "India threatened to block Twitter, raid employees: former CEO Jack Dorsey",
    "Outright lie, no one was raided or sent to jail: Rajeev Chandrasekhar to Dorsey",
    "India denies Dorsey's claims it threatened to shut down Twitter",
    "India slams ex-Twitter chief's claims of pressure as ‘outright lie’",
    "India threatened to shut down Twitter, says ex-CEO Jack Dorsey; govt says ‘outright lie’",
    "Breaking: Jack Dorsey Alleges Indian Govt Threatened To Shut Down Twitter, Raid Employees",
    "Centre dismisses Jack Dorsey's claims of Twitter shutdown over farmer protests",
    "Government rejects ex-Twitter CEO Dorsey's ‘Shut Down’ claim as ‘outright lie’",
    "India Refutes Jack Dorsey's Allegations On Pressure During Farmers' Protests",
    "India threatened to shut Twitter and raid employees",
    "Murder of democracy...: BJP, Congress spat over Twitter co-founder Jack Dorsey's claim. Watch",
    "India Clashes With Twitter Ex-CEO Dorsey Over Removal of Posts",
    "India threatened to shut down Twitter and raid employees' homes, Jack Dorsey says",
    "From Fan Funding to Shopping: More ways for creators to earn on YouTube",
    "YouTube is lowering the eligibility requirements for creators to make money",
    "Earning Money on YouTube Just Got Easier",
    "YouTube drastically lowers requirements for video monetization",
    "YouTube Partner Program overview & eligibility",
    "YouTube is making it easier for creators to make money — here's how",
    "Making Money On YouTube Just Got Easier",
    "YouTube Just Made It Even Easier To Make Money Through Its Monetization Program",
    "It's now easier to get your YouTube channel monetized",
    "YouTube makes it much easier for everyone to earn money from making videos",
    "ICYMI Alert: YouTube Gives Smaller Creators Earlier Access to YPP",
    "Earning with YouTube Becomes Easy with New Monetization Rules",
    "OpenAI reportedly warned Microsoft about Bing's bizarre AI responses",
    "Microsoft's complicated relationship with OpenAI",
    "Microsoft may have ignored warnings about Bing Chat's unhinged responses",
    "Hands-free photos, SpO2 and more for the Pixel family",
    "Latest Google Pixel Drop Adds Emoji, Emergency, and Other Features",
    "June 2023 Pixel feature drop for Pixel Watch and Fitbits is massive",
    "Google's Pixel Watch now offers overnight blood oxygen tracking",
    "Google's latest Pixel feature drop is here. Check out what's new",
    "The Google Pixel Watch's long-overdue blood oxygen tracking is finally here",
    "Google's rolling out a confusing array of Pixel Watch and Fitbit updates",
    "Google Pixel feature drop includes safety check and macro video — here's everything new",
    "Google's June 2023 Pixel feature drop doubles down on personal safety",
    "Google Launches Pixel Watch Metal Bands, Delivers A Slew Of Updates For Fitbit, Pixel Phones",
    "Leak suggests Google Pixel Watch SpO2 update could be imminent",
    "Uniswap Labs releases draft code for ‘entirely new’ version of Uniswap",
    "Uniswap Unveils v4 Upgrade, Aims to Foster Community Feedback",
    "Uniswap v4 code now available on GitHub",
    "Uniswap Update Means ‘The Possibilities Are Pretty Endless,’ Says Developer",
    "Uniswap Labs Shares Roadmap for Uniswap v4",
    "Uniswap releases version 4 code, allowing for new types of liquidity pools",
    "Uniswap v4: Customizable And Cost-Effective Solution For DEXs?",
    "Uniswap V4 code draft features custom liquidity pools plugins",
    "Congrats to the team on Uni v4 https://github.com/...",
    "Netflix reportedly plans first live sports event with celebrities playing golf",
    "Netflix Could Stream its First Live Sports Event This Fall",
    "Netflix Explores Live-Streaming Sports with Celebrity Golf Tournament",
    "Netflix's first live sports stream could have Apple TV Plus and Paramount Plus worried",
    "Netflix in talks to live stream its first sports event later this year, says report",
    "Netflix to stream celebrity golf tournament",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Netflix weighs live broadcast of golf tournament, its first foray into live sports, WSJ says",
    "Netflix is reportedly getting ready to stream its first-ever sporting event",
    "I feel like the professional golfers have an edge here",
    "Lolwut  —  Not sure what the opposite of clickbait is (click repellent?) but this qualifies",
    "I'm going to put my money on the professional golfers https://twitter.com/...",
    "I would very much watch this please and thank you https://twitter.com/...",
    "Together at last: the two dullest non-sports on the planet https://twitter.com/...",
    "The Download: inaccurate welfare algorithms, and training AI for free",
    "Google suggests a hub and spoke framework towards regulating AI",
    "Google challenges OpenAI's calls for government A.I. czar",
    "@davidgerard@circumstances.run",
    "Emmer, Davidson Introduce ‘SEC Stabilization Act’ to Remove Chair Gary Gensler",
    "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "Maybe Coinbase Should Never Have Gone Public",
    "Congressmen Introduces Bill to Fire Gensler: Here's What it Would Mean for Crypto",
    "Gary Gensler hasn't always believed everything but bitcoin is a security",
    "U.S. Congressman Officially Files Bill to Fire SEC Chair Gary Gensler",
    "US Lawmakers Float New Bill to Sack SEC Chair Gary Gensler",
    "The SEC has spoken: The future of finance is not in America",
    "“But the SEC let us go public” and other flawed arguments in Coinbase's defense",
    "MrBeast's Latest Video Breaks His Own View Record in 24 Hours",
    "This is worth your time and moral dilemma. https://www.nytimes.com/...",
    "MrBeast has become a viral sensation for his acts of altruism",
    "United States District Court, Northern District of California",
    "FTC files to block Microsoft from buying Activision Blizzard",
    "Federal Trade Commission v. Microsoft Corp. and Activision Blizzard, Inc.",
    "FTC sues to block Microsoft's takeover of video game maker Activision Blizzard",
    "FTC Seeks Injunction to Stop Microsoft From Closing Activision Deal",
    "US FTC seeks court order to block Microsoft acquisition of Activision -source",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC sues to prevent Microsoft's acquisition of Activision Blizzard",
    "FTC to seek federal court order temporarily blocking Microsoft-Activision deal",
    "US FTC moves to block Microsoft-Activision deal",
    "FTC Files Suit Aiming To Block Microsoft's $69B Activision-Blizzard Acquisition",
    "FTC asks court to prevent Microsoft closing Activision Blizzard deal early",
    "FTC requests injunction to prevent Microsoft/Activision sale from closing early",
    "FTC asks federal judge to block Microsoft's $69 billion Activision deal",
    "Microsoft's acquisition of Activision Blizzard sued by FTC",
    "FTC Motions for an Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "The FTC has asked a US court to temporarily block Microsoft's acquisition of Activision Blizzard",
    "Microsoft's Acquisition of Activision Blizzard in Jeopardy After FTC Files Injunction",
    "FTC files restraining order to block Microsoft's Activision Blizzard deal",
    "FTC Files for Temporary Restraining Order against Acquisition of Activision Blizzard by Microsoft",
    "FTC Sues Microsoft to Block Activision Blizzard Acquisition",
    "FTC files to temporarily block the Microsoft-Activision deal",
    "US regulators move to block Microsoft's acquisition of Activision Blizzard",
    "The FTC is filing an injunction to block Microsoft's Activision acquisition",
    "FTC Files Injunction to Block Microsoft's Activision Deal: What to Know",
    "The FTC files an injunction to block the Activision Blizzard deal",
    "FTC files injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC Officially Moves To Block Microsoft's Activision Blizzard Acquisition",
    "FTC files lawsuit to block Microsoft deal to buy Activision Blizzard",
    "Microsoft Welcomes FTC's Injunction on Xbox's Activision Blizzard Buyout",
    "FTC tries to block Microsoft Activision deal",
    "FTC Files Temporary Restraining Order and Preliminary Injunction Against Microsoft",
    "The FTC can change the venue, but not the facts. https://twitter.com/...",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft, Activision Deal",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "AI-powered Google Search could affect web information ecosystem",
    "Temu accused of selling US-banned Xinjiang products",
    "Personalized wealth management, built for tech people",
    "Accenture announces jaw-dropping $3 billion investment in AI",
    "Accenture Commits $3 Billion Investment in AI to Increase Efficiency for Enterprise Clients",
    "Accenture to Invest $3 Billion in AI to Accelerate Clients' Reinvention",
    "Accenture Commits $3B To AI",
    "Accenture to invest $3 billion in AI, double talent workforce to 80,000",
    "Accenture's AI practice to have 80,000 employees",
    "Accenture Will Invest $3 Billion to Expand Its A.I. Offerings",
    "Accenture announced a $3 billion investment in AI",
    "Embracer announces restructuring program, studio closures expected",
    "Nothing Phone (1) will get the software from its sequel in August",
    "Nothing Phone 2 launches on July 11",
    "The Nothing Phone 2 Finally Has a Launch Date",
    "Nothing Phone (2) Has a Release Date, But We Still Don't Know Its Price",
    "The Nothing Phone 2 gets a July 11 launch date",
    "Nothing Phone (2) Has an Official Launch Date",
    "Nothing Phone (2) to launch on July 11",
    "It's official — Nothing Phone (2) is launching July 11 and it's coming to the US",
    "Nothing Phone 2 launch date confirmed, here's the info you need",
    "Nothing Phone 2 Launch Date is Finally Confirmed, Releasing Earlier Than Expected",
    "Nothing Phone (2) Launch Date Confirmed with a US Release",
    "Nothing Phone 2 official launch date revealed: Check details",
    "Nothing Phone 2 to launch on July 11: Here's what you need to know",
    "Nothing will reveal the Phone 2 on July 11th",
    "One of 2023's most hyped phones will launch on July 11",
    "Here's Where you can Watch the Nothing Phone 2 Launch Event",
    "Nothing Phone (2) announcement set for July 11",
    "Free compensation benchmarking data from 3,000 startups",
    "ZertES-compliant qualified electronic signatures (QES) for the European Union and Switzerland",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Tue. 06/13 - New Beatles Song Thanks To AI",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta Horizon Worlds v114 Release Notes",
    "Nothing can go wrong with resurrecting Barrens chat.",
    "AMD extends Ryzen 7000 range to enterprise with Pro chips",
    "AMD Launches New Ryzen Pro 7040 Series for Business Laptops",
    "AMD Intros Ryzen 7000 Pro Mobile and Desktop Chips, AI Comes to Pro Series",
    "AMD Ryzen Pro 7040 Series heralds Zen 4 and RDNA 3 technology",
    "AMD Ryzen 7000 Pro CPU takes aim at Apple's M2 Pro but fails to impress",
    "AMD launches Zen 4-powered Ryzen 7000 PRO Series for laptops and desktops",
    "AMD introduces new processors for Windows 11 PCs geared toward professionals",
    "AMD Introduces Ryzen 7000 PRO Family Of Zen 4 CPUs For Enterprise Laptops And Desktops",
    "AMD Ryzen PRO 7000 Series CPUs: The future of AI-powered business for laptops and (maybe) desktops",
    "AMD Announces Ryzen Pro CPUs for Laptops and Desktops",
    "AMD Ryzen Pro 7000 processors now available for desktop workstations",
    "AMD Ryzen Pro 7000 Series CPUs Launched",
    "AMD Announces Ryzen PRO 7040 Series “Zen 4” Processors for Commercial Notebooks",
    "AMD launches Ryzen PRO 7000 series processors for laptops and desktops",
    "AMD launches Ryzen PRO 7000 65W desktop series, Ryzen 9 PRO 7945 features 12 Zen4 cores",
    "AMD Ryzen 7000 Goes Pro For Desktops & Laptops: Phoenix & Raphael With Zen 4 CPU Cores",
    "SoftBank's Vision Fund to cut up to 30% of staff",
    "SoftBank Group prepares new round of layoffs at Vision Fund: Report",
    "How Silicon Valley Can Stretch Its Dollars",
    "A deep-tech fund for the Nordics and Baltics - Voima Ventures launches €90 million fund",
    "Nobody is happy with NYC's $18 delivery worker minimum wage",
    "NYC food delivery gig workers score a big minimum wage victory",
    "Food delivery workers in New York City now earn $18 per hour",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "EU countries amend draft proposal on gig workers' rights, companies unhappy",
    "NYC mandates minimum wage for app-based delivery workers",
    "NYC Food Delivery Workers Secure Landmark Minimum Pay Rate",
    "NYC establishes first minimum wage for food delivery workers",
    "New York City Sets New Minimum Wage for Food Delivery Workers",
    "Uber, DoorDash, and Other Delivery Apps Will Now Have to Pay Workers a Minimum Wage in NYC",
    "Insight Partners Slows Dealmaking Amid Tech Funding ‘Bloodbath’",
    "TCV Misses $5.5 Billion Fundraising Goal, Filings Show",
    "Amazon is Testing AI-Generated Review Summaries",
    "Would you trust AI-generated reviews? The next Amazon product you buy may have them",
    "A blueprint for private and public sector partnership to stop fake reviews",
    "There's something interesting happening with Amazon's product reviews — and yes, it's about AI",
    "Amazon cracks down on fake reviews with AI",
    "CloudZero nabs $32m investment in new era for cloud cost management",
    "CloudZero raises $32M to nearly double size of team",
    "CloudZero Raises $32 Million To Transform Cloud Cost Management",
    "Cloud cost intelligence platform CloudZero raises $32M",
    "CloudZero Raises $32M in Series B Funding",
    "Oracle Announces Fiscal 2023 Fourth Quarter and Fiscal Full Year Financial Results",
    "Oracle's Ellison: Cloud Revenue Grew Because We're ‘Faster Than Competitors’ Clouds'",
    "ORCL Stock Jumps 6% as Oracle Beats Estimates for Revenue and Profit in Q4 2023",
    "Oracle cloud revenue up 54 percent in fourth quarter",
    "Oracle Reports Record Revenue of $50 Billion in FY23, Driven by Cloud Growth",
    "Oracle beats quarterly revenue estimates on cloud services demand",
    "Oracle 4Q Revenue, Net Income Beat Estimates — Earnings Review",
    "Oracle Pushes to Record High as AI-Frenzy Spurs Cloud Demand",
    "Oracle beats on top and bottom lines as cloud revenue jumps",
    "Oracle Earnings Day Is Here. The Focus is on Cloud and AI.",
    "Seems nobody gets fired for buying Oracle. Sadly. https://twitter.com/...",
    "Crypto Lender Genesis Amends Reorganization Plan as Mediated Talks Continue",
    "Office of the Director of National Intelligence",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data, U.S. Says",
    "US intelligence confirms it buys Americans' personal data",
    "Report: FBI buys your phone data, just like everyone else",
    "FBI Pays for Your Phone Data and There's Nothing You Can Do to Stop It",
    "Confirmed: US Intelligence agencies are buying personal data, raising privacy concerns",
    "U.S. Government Buying ‘Intimate’ Data About Americans, Report Finds",
    "US government admits to buying Americans' personal data",
    "US Government Has Secretly Used Data Brokers to Amass Information on Citizens",
    "US intelligence agencies buy Americans' personal data, new report says",
    "The U.S. Is Openly Stockpiling Dirt on All Its Citizens Thanks to Commercial Data Brokers",
    "ODNI Declassified Report on CAI",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data",
    "The US Is Openly Stockpiling Dirt on All Its Citizens",
    "New 15-inch MacBook Air, Mac Studio, and Mac Pro are available today",
    "Geekbench reveals M2 Ultra chip's massive performance leap in 2023 Mac Pro",
    "First Benchmark Result Surfaces for Mac Pro With M2 Ultra Chip",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "Your M2 Ultra Mac Pro is a ‘product of Thailand’ but is still assembled in the USA, Apple says",
    "M2 Ultra Mac Studio review: Top of the line",
    "The New 15-Inch MacBook Air, Mac Studio, And Mac Pro Are Now Available",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "New Mac Studio, Mac Pro, and 15-inch MacBook Air now available, but should you buy them?",
    "Apple's New 15-Inch M2 MacBook Air, Macs Studio & Pro Available Today",
    "New 15-inch MacBook Air, Mac Studio, Mac Pro Available Today",
    "Your M2 Ultra Mac Studio and 15-inch MacBook Air is waiting at your local Apple Store",
    "Apple Mac Studio vs. Mac Pro: M2 Ultra desktops, compared",
    "New Mac Studio and M2 Ultra Mac Pro now available to pick up in store as deliveries begin today",
    "Apple's 15-inch MacBook Air, M2 Mac Studio and Mac Pro Now Available in Canada",
    "Apple Mac Studio (M2 Max) review: Re-filling the need for speed",
    "M2 Mac Studio Review: This is the New Pro Mac",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "First 15-Inch MacBook Air, M2 Ultra Mac Studio and Mac Pro Orders Begin Arriving to Customers",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Mac Studio review roundup: The Pro's choice",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "Bethesda Softworks on YouTube",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Phil Spencer Says Xbox Series X Doesn't Need An Upgrade, Is That True?",
    "Xbox Series X isn't getting an upgrade anytime soon — but it doesn't need one",
    "Xbox boss insists there's no demand for a more powerful console yet",
    "Giant Bomb at Nite: Night 3",
    "Xbox head Phil Spencer doesn't see the need for an upgraded Xbox Series X yet",
    "Phil Spencer Claims Starfield Will Be Profitable Thanks To Game Pass",
    "Xbox Isn't Working On A More Powerful Console Yet",
    "Starfield PC System Requirements Revealed, Stuck at 30 FPS on Xbox",
    "Why Microsoft wants to upend the video game industry",
    "A PS5 PRO WITHOUT COMPETITION?  MICROSOFT DOESN'T SEE THE NEED FOR A NEW XBOX",
    "Microsoft Will Absolutely Make Money On Starfield, Phil Spencer Says",
    "Starfield has “fewest bugs that any game from Bethesda has ever shipped with”, Microsoft says",
    "Why Microsoft Is Excited About the Future of Gaming on the Xbox",
    "Xbox's Bright Future, and How We'll Get There",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "Microsoft exec says Starfield has ‘the fewest bugs any Bethesda game ever shipped with’",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition",
    "Starfield Direct - Gameplay Deep Dive"
]