[
    "International Business Times",
    "Twitter value keeps falling under Musk, now worth a third of what he paid",
    "Fidelity marks down value of Twitter stake again",
    "Twitter now worth just a third of what Musk paid for it",
    "Twitter's value down two-thirds since Musk takeover, says investor",
    "Twitter may be worth only a third of its pre-Musk value, Fidelity says",
    "Twitter only worth 33% of what Musk-led investors paid, Fidelity says",
    "Twitter has lost 66% of its value since Elon Musk bought it",
    "Elon Musk's most controversial moments",
    "Twitter Is Now Worth a Third of What Musk Paid For It, Fidelity Says",
    "Twitter is only worth a third of what Elon Musk paid for it, major asset manager says",
    "Twitter is Approving Far More Government Censorship Requests Under Elon Musk",
    "Twitter may be worth one-third what Musk paid for it last fall as Fidelity marks down investment",
    "Fidelity Values Twitter At Roughly $15 Billion—A Third Of The Sticker Price Paid By Musk",
    "Twitter is now worth one-third what Elon Musk paid",
    "Report: Twitter Now Worth a Third of $44B Purchase Price",
    "Twitter valuation fell massively; Pentagon explosion hoax; anti-harrassment app closing",
    "Twitter's worth down to just $15 bn under Musk: Report",
    "Fidelity Slashes Value of Its Twitter Stake Once Again",
    "Why AI Scientists Are Freaking Us Out",
    "Twitter's Value Dives Again. Elon Musk's Purchase Is Looking Even Worse.",
    "Fidelity: Twitter is Now Only Worth a Third of What Elon Musk Paid for It",
    "Twitter now worth just 33% of Elon Musk's purchase price",
    "how many D is this chess? https://www.bloomberg.com/...",
    "Yikes. This means Fidelity values Twitter around ~$15 billion [image]",
    "Only took seven months, too. https://www.bloomberg.com/... [image]",
    "The idea that billionaires can run things better than anyone else is dumb https://twitter.com/...",
    "Destroying that much value in such a short period isn't easy to do. https://twitter.com/...",
    "Elon took on $13bn of debt to buy Twitter https://twitter.com/...",
    "Supply Chain Risk from Gigabyte App Center Backdoor",
    "Gigabyte brought new top-tier motherboards and more to Computex 2023",
    "Tons of Gigabyte motherboards come with a hidden firmware backdoor",
    "Millions of PCs could be targeted by hackers in firmware blunder",
    "Gigabyte shipped hundreds of models of motherboards with a hidden firmware backdoor",
    "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
    "Organizations Warned of Backdoor Feature in Hundreds of Gigabyte Motherboards",
    "Definitely be aware if your mobo is on the list. https://www.wired.com/...",
    "Scream in supply chain security... https://twitter.com/...",
    "Kotick blames scandals on “a very aggressive labor movement”",
    "Activision almost bought Time Warner: 'We'd turn their IP into games'",
    "Bobby Kotick Denies All Allegations Of Activision's “Systemic Issue With Harassment”",
    "Bobby Kotick blames Activision toxicity on ‘outside forces’ - but he's pro-union",
    "Activision Boss Hyped About AI, Suggests It Could Be Used In A New Guitar Hero [Update]",
    "Activision never had “systemic issue with harassment”, says CEO Bobby Kotick",
    "https://twitter.com/... [image]",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Apple App Commerce Climbed 29% Last Year to $1.1 Trillion",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "Twitter Extends Community Notes to Images After Pentagon Explosion Tweet",
    "Twitter Expands Community Notes to Attached Visuals in Tweets",
    "Twitter launches Community Notes to tackle the spread of misleading media",
    "Twitter Community Notes for images is currently in the testing stage",
    "Twitter launches Community Notes for images",
    "Twitter starts testing Community Notes for Images: What it does, how it will benefit users",
    "Twitter to expand crowdsourced fact-checking tool after Pentagon explosion deepfake video",
    "Twitter is testing Community Notes for images",
    "Twitter's Community Notes Feature Expands To Misleading Images",
    "Twitter Expands Crowdsourced Fact-Checking Following Phony Viral Photo",
    "BabyLM Challenge  —  Summary: This shared task challenges community members to train …",
    "Four LLM trends since ChatGPT and their implications for AI builders",
    "Magic announces $52M Strategic Funding Round led by PayPal Ventures",
    "Magic Raises $52M in Strategic Funding",
    "Web3 Firm Magic Summons $52 Million With PayPal Ventures' Help",
    "PayPal Ventures invests in web3 onboarding startup Magic",
    "PayPal Ventures Leads $52M Round for Crypto Firm Magic",
    "Crypto wallet Magic raises $52M to expand ‘wallet-as-a-service’ solution",
    "Magic raises $52m despite crypto bear market",
    "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "Web3 Infrastructure Company Magic Raises $52M in a Round Led By PayPal Ventures",
    "ChatGPT Risks Divide Biden Administration Over AI Rules in EU",
    "Stories like this get my ears ringing https://twitter.com/...",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Popular Torrent Site RARBG Shuts Down",
    "U.S. Manufacturers Seek China Alternatives as Tensions Rise",
    "Taiwan invasion in 2025 gaining credibility; no time for Apple and others to prepare",
    "The interactive is also beautifully produced. https://twitter.com/...",
    "Hostaway's $175M Raise Is A Rarity In The Travel Industry",
    "PSG makes investment in Hostaway to expand its vacation-rental software amid travel rebound",
    "Hostaway raises $175M for vacation rental tech expansion",
    "Finnish founded Hostaway secures $175 million to take its vacation rental platform global",
    "Garmin's new epix Pro and fenix 7 Pro want to pull me away from my Apple Watch Ultra",
    "Garmin Epix 2 Pro & Fenix 7 Pro are official: here's what's new & different",
    "Epix 2 Pro: Garmin announces new smartwatches in three sizes with flashlight and improved sensors",
    "Amazon Echo Pop review: The latest Echo flops rather than pops",
    "Amazon Echo Pop review: A portable smart speaker for small spaces",
    "Amazon Echo Pop Review: An Alexa Speaker That Looks Nice And Talks Back",
    "Amazon Echo Pop Review: a perfectly priced Alexa",
    "Unlock a new pipeline channel: your existing customers",
    "Talis Capital Holds First Close of $175M Fund III",
    "British digital bank Monzo hits monthly profitability for the first time after spike in lending",
    "Neobanks should take heart from Monzo's performance in 2022",
    "Monzo hits monthly profitability",
    "Monzo Narrows Losses as Customer Numbers and Staff Costs Grow",
    "The best Reddit client app is in danger due to price demands",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "Reddit Slaps Apollo with Hefty $20 Million Annual Fee",
    "API Extortion Era https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "What is Generative AI and how does AI improve customer experience?",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Bybit follows Binance in departure from Canadian market",
    "Ah. So that's why it has barred Canadians. https://twitter.com/...",
    "Dublin fintech NomuPay raises $53.6m for payments platform",
    "Dublin-Headquartered NomuPay Raises $53.6 Million to Expand X-Border Payment Platform",
    "Dublin-based fintech NomuPay raises €50m from backers",
    "Ireland-based fintech platform NomuPay secures €50.1M for cross-border payments; Know more",
    "Removing the multiples, Ireland's NomuPay nomz nomz on $53.6 million",
    "NomuPay Raises $53.6M in Funding",
    "Unified payments platform NomuPay raises $53.6M in Series A round",
    "‘All access pass’ payments platform NomuPay raises $53.6 million",
    "Foxconn's Young Liu says AI demand to boost server business",
    "Taiwan's Foxconn predicts huge growth in AI server business",
    "Apple's iPhone Maker Expects to More Than Double AI Server Sales",
    "Foxconn sees AI driving strong server demand, but full year to be flat",
    "Twitter Alternative Bluesky Hits 100k Members Before Exiting Beta",
    "Cool article about @fiatjaf, @arcbtc and the beginnings of nostr https://www.forbes.com/...",
    "Purdue Pharma's Bankruptcy Works Now",
    "Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges",
    "The Download: meet the longevity obsessives, and how China's regulating AI",
    "A new verb. https://www.reuters.com/...",
    "Block Party Resource Center",
    "Block Party's Twitter product is on indefinite hiatus as of May 31",
    "Anti-harassment service Block Party leaves Twitter amid API changes",
    "You Do It: Twitter Outsources AI Image Detection to Its Users",
    "Twitter moderation is about to get much worse - and its all Elon Musk's fault",
    "Popular anti-troll tool Block Party shuts down",
    "Product FAQ  —  Twitter Product Hiatus Why is Block Party's Twitter product on indefinite hiatus?",
    "just fell to my knees. this app has been so vital to my safety on here https://twitter.com/...",
    "Baidu to Launch $145M VC Fund for AI-focused Startups in China",
    "Baidu Launches $145 Million VC Fund to Back AI Startups",
    "Chinese organisations launched 79 LLMs since 2020",
    "Google Pixel Watch 2 May Use More Power-Efficient Qualcomm Chip",
    "Google Will Fix The Worst Thing About The Pixel Watch",
    "Google's Pixel Watch 2 could drop Samsung's processors for better battery life",
    "The Pixel Watch 2 will reportedly get a significant upgrade this year",
    "Google's next Pixel Watch could sport better battery life",
    "Google Pixel Watch 2: Rumoured battery life leap set to impress",
    "Pixel Watch 2 key specifications leaked, a more powerful chipset expected",
    "Google Pixel Watch 2 rumours: Everything we have heard so far",
    "Report: Google may use Qualcomm Snapdragon processor for Pixel Watch 2 to improve battery life",
    "Pixel Watch 2 to have a better battery life and chip",
    "Google Pixel Watch 2 could fix its predecessors' biggest flaw",
    "Google Pixel Watch could get a massive battery life upgrade",
    "The Pixel Watch 2 might have much better battery life",
    "Google to say goodbye to Exynos chips with Pixel Watch 2",
    "Google Pixel Watch 2 to ditch Samsung-made Exynos processor",
    "Google's Pixel Watch 2 May Have Insane Battery Life",
    "Report: Pixel Watch 2 ditches Exynos for Snapdragon",
    "Google Pixel Watch 2 Specs Include Big Upgrades, Says Report",
    "The Pixel Watch 2 might kiss Samsung chips goodbye to improve battery",
    "Pixel Watch 2 Rumored to Feature the Snapdragon W5 Chipset",
    "This Pixel Watch 2 leak just made it the 2023 smartwatch I can't wait for",
    "Pixel Watch 2 could feature improved processor, more health sensors",
    "The Pixel Watch 2 will reportedly get a major bump in performance and battery life",
    "Google's Pixel Watch 2 will reportedly have significantly improved battery life",
    "New Pixel Watch 2 Processor Boosts Battery in a Big Way, Leaked Specs Suggest",
    "Pixel Watch 2 could ditch Exynos for Snapdragon and gain more battery life",
    "This Google Pixel Watch 2 upgrade could solve the first model's biggest problem",
    "Pixel Watch 2 tipped to gain increased battery life thanks to a new chip",
    "Google's Pixel Watch 2 could vastly improve its predecessor's battery life, power, and sensors",
    "Google Pixel Watch 2: News and Expected Price, Release Date, Specs; and More Rumors",
    "Google Rumored to Switch to Snapdragon Chip in Pixel Watch 2",
    "Thought the first one would get W5 but it makes sense here https://twitter.com/...",
    "MoonPay executives pocketed $150 million raised from Series A",
    "MoonPay executives cashed out $150 million in equity just months before crypto crash",
    "This was among the biggest secondary share sales *ever* for such a young company.",
    "ChatGPT should include inline tips",
    "How I finally learned to love ChatGPT",
    "A lawyer used ChatGPT to prepare a court filing. It went horribly awry.",
    "Aggressive PC discounts might not be here for long, says HP",
    "HP Sales Decline Worse Than Expected as PC Slump Continues",
    "HP revenues plummet as printers, PC sales all fall",
    "HP Revenues Fall 22 Percent on Lower PC Sales",
    "HP: AI can change the role of PCs",
    "HP slips as Q2 earnings top expectations, keeps full-year cash flow forecast",
    "Apple Reality Pro VR Headset: New Report Claims Massive Leak",
    "Data about Apple's AR headset screens has been leaked",
    "Apple Reality Pro VR Headset Could Be 50X Brighter Than The Quest 2 And Support HDR",
    "Curved Apple headset design is manufacturing's worst nightmare",
    "Apple mixed reality headset specs leak right before WWDC 2023 — here's what you get",
    "Apple's Reality Pro headset specs just leaked",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Display analyst Ross Young tweets out possible specs for Apple's AR headset",
    "Apple's Reality Pro headset could be the sharpest and brightest by a mile",
    "Apple VR display specs have leaked, and the future looks to be around 5000 nits bright",
    "Rumored 4K screens could let Apple VR/AR headset offer real world-like clarity",
    "Apple's mixed reality headset will reportedly have some insane brightness levels",
    "Apple AR/VR headset details appear online days ahead of WWDC 2023 event",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Apple Reality Pro leak reveals a seriously high-res display—4K for each eye",
    "Here are the specs for Apple's ‘Reality One’ XR headset displays",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "Apple's mixed reality headset: Everything we know so far",
    "HoloLens was less than 500 nits. Just for comparison.",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "@9to5mac @apollozac Just not the resolution or refresh rate",
    "@yaeleisenstat.bsky.social",
    "AI ‘godfather’ Yoshua Bengio feels ‘lost’ over life's work",
    "AI Poses ‘Risk of Extinction’ on Par With Pandemics and Nuclear War, Tech Executives Warn",
    "Artificial intelligence could lead to extinction, experts warn",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in 22-word statement",
    "‘Extinction risk’: Could code-writing AI wipe out humans via software backdoors?",
    "OpenAI's Altman and other AI giants back warning of advanced AI as ‘extinction’ risk",
    "A.I. poses human extinction risk on par with nuclear war, Sam Altman and other tech leaders warn",
    "Microsoft President Brad Smith Calls for Generative AI Regulations",
    "AI poses existential risk, warn tech leaders in open letter",
    "AI poses “risk of extinction,” leading researchers and CEOs warn in 22-word statement",
    "Researchers and industry leaders warn about AI and a ‘risk of extinction’",
    "Experts and CEOs warn of extinction risk posed by AI, compare dangers to nuclear war",
    "The Morning After: Industry leaders say AI presents ‘risk of extinction’ on par with nuclear war",
    "AI leaders warn about ‘risk of extinction’ in open letter",
    "Top AI titans unite to sign a letter against AI dangers",
    "Next generation arms race could cause ‘extinction’ event akin to nuclear war, pandemic: tech chief",
    "AI, extinction, nuclear war, pandemics ... That's expert open letter bingo",
    "What is the real point of all these letters warning about AI?",
    "Runaway AI Is an Extinction Risk, Experts Warn",
    "Industry leaders warn ‘AI poses risk of extinction’",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "Leading experts warn of a risk of extinction from AI",
    "Prominent AI leaders warn of ‘risk of extinction’ from new technology",
    "The AI hallucinations intensify",
    "AI is an ‘extinction risk’ for humanity, say tech industry leaders",
    "Eminent AI experts and corporate heads caution about the probability of ‘extinction risk’",
    "Artificial Intelligence leaders warn of ‘risk of extinction’ from AI",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in joint statement",
    "‘The Risk of Extinction:’ AI Leaders Agree on One-Sentence Warning About Technology's Future",
    "AI experts sign doc comparing risk of ‘extinction from AI’ to pandemics, nuclear war",
    "Artificial intelligence could lead to ‘extinction’ of humanity, warn dozens of AI experts",
    "ChatGPT creators and others plead to reduce risk of global extinction from their tech",
    "Mitigating risk of ‘extinction’ from AI technology should be ‘global priority’, experts say",
    "In 22 Words, Tech Leaders Warn of Colossal AI Risks",
    "Are AI execs worried there's a dark future looming for AI?",
    "OpenAI execs warn of “risk of extinction” from artificial intelligence in new open letter",
    "Coalition of AI leaders sees ‘societal-scale risks’ from the technology's misuse",
    "Geoffrey Hinton, Yoshua Bengio warn “risk of extinction from AI” in public letter",
    "Risk of extinction by AI should be global priority, say experts",
    "AI Is as Risky as Pandemics and Nuclear War, Top CEOs Say, Urging Global Cooperation",
    "Top AI CEOs, experts warn that humans may face risk of extinction from AI",
    "AI experts and industry leaders issue warning on AI risks",
    "AI poses ‘extinction’ risk comparable to nuclear war, pandemics: experts",
    "Top AI experts warn of tech's ‘risk of extinction’ — similar to nuclear weapons, pandemics",
    "We can't put the ChatGPT AI genie back in the bottle, even if it means risking extinction",
    "AI Experts From Google, OpenAI And Elsewhere Issue Dire Extinction Warning",
    "‘Extinction event’ from AI? Yes, tech leaders warn in call for controls",
    "Artificial intelligence poses ‘risk of extinction,’ tech execs and experts warn",
    "Artificial intelligence threatens extinction, experts say in new warning",
    "AI Could Cause Human ‘Extinction,’ Tech Leaders Warn",
    "Scientists, experts saying mitigating ‘extinction’ risk of AI should be global priority",
    "AI executives warn its threat to humanity rivals ‘pandemics and nuclear war’",
    "The hotdog guy in this instance is the New York Times lol https://twitter.com/...",
    "Couldn't buy better PR if you tried https://twitter.com/...",
    "This has quickly become the self aggrandizement super bowl https://twitter.com/...",
    "They're not warning they're bragging https://www.nytimes.com/...",
    "Panicky or visionary? https://twitter.com/...",
    "This seems promising https://www.safe.ai/... (organized by @ai_risks) [image]",
    "I was proud to sign this statement alongside a remarkable list of experts https://twitter.com/..."
]