[
    "@yaeleisenstat.bsky.social",
    "ChatGPT launched six months ago. Its impact — and fallout — is just beginning | The AI Beat",
    "Artificial intelligence could lead to extinction, experts warn",
    "OpenAI's Altman and other AI giants back warning of advanced AI as ‘extinction’ risk",
    "AI could make humans extinct, say top experts and CEOs in stark warning",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in 22-word statement",
    "Eminent AI experts and corporate heads caution about the probability of ‘extinction risk’",
    "AI poses ‘extinction’ risk comparable to nuclear war, pandemics: experts",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "AI poses ‘extinction’ risk comparable to nuclear war, CEOs of OpenAI, DeepMind, and Anthropic say",
    "Scientists, experts saying mitigating ‘extinction’ risk of AI should be global priority",
    "AI executives warn its threat to humanity rivals ‘pandemics and nuclear war’",
    "AI presents ‘risk of extinction’ on par with nuclear war, industry leaders say",
    "AI Threat Is on Par With Pandemics, Nuclear War, Tech Executives Warn",
    "The Download: how to talk about AI, and Montana's TikTok ban",
    "AI experts and industry leaders issue warning on AI risks",
    "Top AI experts warn of tech's ‘risk of extinction’ — similar to nuclear weapons, pandemics",
    "Runaway AI Is an Extinction Risk, Experts Warn",
    "We can't put the ChatGPT AI genie back in the bottle, even if it means risking extinction",
    "‘Extinction event’ from AI? Yes, tech leaders warn in call for controls",
    "OpenAI and Google DeepMind CEOs Sign Statement Warning That AI Poses “Risk of Extinction”",
    "The hotdog guy in this instance is the New York Times lol https://twitter.com/...",
    "Couldn't buy better PR if you tried https://twitter.com/...",
    "This has quickly become the self aggrandizement super bowl https://twitter.com/...",
    "They're not warning they're bragging https://www.nytimes.com/...",
    "Panicky or visionary? https://twitter.com/...",
    "This seems promising https://www.safe.ai/... (organized by @ai_risks) [image]",
    "I was proud to sign this statement alongside a remarkable list of experts https://twitter.com/...",
    "Nvidia Breaks The $1 Trillion Market Cap Barrier",
    "Nvidia set to become first chipmaker valued at over $1 trillion",
    "Nvidia is now a $1 trillion company thanks to the AI boom",
    "Nvidia becomes first US chipmaker valued at over $1 trillion; joins exclusive FAANG group",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Nvidia hits $1tn market cap as chipmaker rides AI wave",
    "NVIDIA is now worth 1 trillion dollars",
    "Wall Street's AI obsession pushes Nvidia valuation past $1 trillion mark",
    "Nvidia stock set to hit $1 trillion market cap for the first time",
    "Nvidia Surge Results in Historic $1 Trillion Market Valuation",
    "Nvidia joins the trillion-dollar club",
    "Nvidia Hits $1 Trillion Market Value—Becoming 6th Ever To Hit Milestone",
    "Nvidia Set for $1 Trillion Market Cap",
    "Nvidia Surpasses $1 Trillion Market Capitalization",
    "Nvidia hits $1T market cap as market opens",
    "Nvidia Surpasses $1 Trillion Market Valuation in Massive AI Bet",
    "Nvidia set to become first US chipmaker valued at over $1 trillion",
    "Nvidia set to become the world's first $1 trillion chipmaker as the AI boom rages on",
    "Nvidia Trades Above $1 Trillion Market Valuation",
    "Nvidia CEO Gets Rock Star Reception in Taiwan With AI Stock Surge",
    "View: Nvidia isn't the only one getting a massive AI boost",
    "Nvidia Hits $1 Trillion in Market Value on Booming AI Demand",
    "Intel inside? Tests show Chinese firm's ‘home-grown’ chip was a rebadged device",
    "NVIDIA Could Possibly Switch to Intel For Its Next-Gen GPUs, Hints Jensen Huang",
    "Gemini's market share declines as regulatory, financial challenges mount",
    "TikTok CEO Expands Purview to Include ByteDance's New App Lemon8",
    "Chinese apps remain hugely popular in the U.S. despite efforts to ban TikTok",
    "The game programming flex of all time. [video]",
    "This is the 2023 version of the Last of Us Part 2 rope physics https://twitter.com/...",
    "Binance Names Richard Teng Head of All Regional Markets",
    "Binance appoints former Singapore exec as head of regional markets",
    "Binance Crypto Exchange Appoints Richard Teng to Lead All Regional Markets Outside US",
    "Binance Appoints Richard Teng as Head of Regional Markets Amid Regulatory Scrutiny",
    "Binance eyes Global leadership with New Power Player - Richard Teng",
    "Binance Appoints Former MAS Exec as Head of Regional Markets Outside US",
    "Binance names Richard Teng as head of regional markets outside US",
    "Binance Appoints New Head For Regional Markets Amid Regulatory Scrutiny | Coingape",
    "Windows 11, version 22H2 known issues and notifications",
    "Microsoft issues temporary fix for buggy Surface Pro X cameras",
    "Microsoft Disables Features to Get Surface Pro X Cameras Working Again",
    "Microsoft issues temporary fix for Surface Pro X camera bug",
    "Microsoft temporarily fixed broken webcams on ARM PCs by lowering their image quality",
    "US govt banned NSO's Pegasus, but said to buy rival spyware Paragon Graphite",
    "Really interesting story that speaks to the limitations of the spyware EO https://www.ft.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "AI can do everything, but can crypto do something?",
    "Office of the Maine Attorney General",
    "Dental Data Breach Exposes Private Details Of 8.9M Patients And That Really Bites",
    "Personal Information of 9 Million Individuals Stolen in MCNA Ransomware Attack",
    "US dental provider suffers data breach with 9m affected",
    "Nine Million MCNA Dental Customers Hit by Breach",
    "Lockbit ransomware attack on MCNA Dental impacts 8.9M individuals",
    "MCNA Admits LockBit Ransomware Stole Data of 8.9M People",
    "Dental Health Insurer Hack Affects Nearly 9 Million",
    "Data Breach at MCNA Dental Insurer Impacts 9 Million Users",
    "Personalized wealth management, built for tech people",
    "How can recruiters bring balance to the talent landscape in the IT industry?",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) Gary Flake On The Search Wars",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Tenstorrent Scores Big Win At LG",
    "Tenstorrent Partners with LG to Build AI and RISC-V Chiplets for Smart TVs of the Future",
    "Proposed European SEP Regulation Would Undermine Efficiency, Innovation and Economic Growth",
    "Big Tech's latest bit of astroturfing on EU digital policy https://twitter.com/... [image]",
    "JioCinema Claims Simultaneous Viewership Record During IPL Final - Global Bulletin",
    "JioCinema Sets New World Record With 32 Mn Viewers Tuning In For IPL Final",
    "Ambani's Big Cricket Bet Captures Record Viewers for IPL Final",
    "JioCinema breaks world record with over 3.2 crore viewers during IPL final",
    "Introducing ApeMax, a new token with staking rewards that could outperform ETH staking returns.",
    "Your First Robot Butler Will Need Human Eyes",
    "Gitai Raises US$30M in Funding",
    "Space Robotics Startup GITAI Raises US$30 Million in Funding",
    "Japan Startup Raises $30 Million to Build Space Robot Workforce",
    "Japan's GITAI raises $29 million for space robotics business",
    "Gitai Raises $30 Million to Expand Manufacturing Footprint in Los Angeles",
    "Gitai raises $30 million to lead space robotics industry",
    "We might see a flagship processor without little cores later this year",
    "Total Compute Solutions (TCS23) provide the complete platform for mobile computing",
    "Arm Unveils Cortex-X4 And Immortalis GPU For Big Mobile Performance And Efficiency Gains",
    "ARM's latest CPUs push Android phone makers toward 64-bit only devices",
    "Arm Cortex-X4 advances frontiers of CPU performance",
    "Arm GPUs built on new 5th Generation GPU architecture to redefine visual computing",
    "Arm launches new chips for faster smartphone performance during Computex",
    "Arm's new CPU and GPU cores promise increased performance with improved power-efficiency",
    "COMPUTEX 2023: Arm Unveils Total Compute Solutions 2023",
    "Arm Launches the Cortex-X4, A720 and A520, Immortalis-G715 GPU",
    "ARM unveils new CPU cores for Exynos chips",
    "Arm Rolls Out Next-Gen Smartphone Chip Tech",
    "ARM shows Cortex-X4 core, DSU for laptop chips",
    "ARM Cortex-X4, A720 and A520 CPUs, Immortalis-G720 GPU with Ray-tracing announced",
    "Arm Cortex-X4, A720, and A520: 2024 smartphone CPUs deep dive",
    "Arm debuts Cortex-X4 with better performance, coming to MediaTek's next flagship",
    "Arm Cortex-A720 and Cortex-A520 CPUs extend Armv9 benefits to all consumer device markets",
    "Arm's new Immortalis G720 should yield big gains in performance and efficiency",
    "Arm unveils Cortex-X4: Fastest so far",
    "Arm's new Total Complete Solution means your next phone will be stronger while using less battery",
    "Arm's new GPU promises big gains for mobile gaming",
    "Arm announce new mobile CPUs and GPUs for Qualcomm Snapdragon 8 Gen 3, other next-gen chips",
    "ARM unveils the Cortex-X4, its fastest CPU yet, Cortex-A720 and A520 and 5th gen GPUs join it",
    "Arm launches Cortex-X4, billing it as the first CPU built on TSMC's N3E process",
    "Arm announces Cortex-X4 among latest CPU and GPU designs",
    "Arm Details The Cortex-X4 With +15% Performance, Armv9.2 ISA",
    "Arm's new design could result in chipsets that take up way less energy",
    "Arm Unveils New CPU Cores for Next-Gen Smartphone Processors",
    "Arm's New CPU, GPU Cores to Deliver Next-Gen AI Experiences on Phones",
    "ARM unveils new CPU cores to be used in future Exynos chips",
    "Arm's next-gen mobile computing platform to deliver improved AI, 3D and gaming to 2024 phones",
    "Arm unveils TCS23, driving immersive experiences and new-generation AI applications",
    "5 things you must know about next-gen smartphone processors",
    "Arm's new Cortex X4, A720, and A520 are 64-bit only cores with a big focus on efficiency",
    "Arm rolls out new smartphone tech and MediaTek signs up to use",
    "Arm unveils 5th generation GPUs with Immortalis-G720",
    "Arm unveils Cortex-X4, Cortex-A720, Cortex-A520 CPUs, Immortalis-720 GPU",
    "Arm Launches Next-Gen Efficiency Core; Cortex-A520",
    "Nvidia CEO Says Intel's Test Chip Results For Next-Gen Process Are Good",
    "Don't underrate China's ability to catch up in chips: Nvidia CEO",
    "Nvidia Says Its New Supercomputer Officially ‘Closes the Digital Divide’",
    "Inside Nvidia's new AI supercomputer",
    "MediaTek Partners With NVIDIA to Transform Automobiles With AI and Accelerated Computing",
    "AI means everyone can now be a programmer, Nvidia chief says",
    "Nvidia launches GPU-first server platform as its value soars past $1 trillion",
    "Nvidia Overtakes Meta, Tesla by Market Cap as Firm Captures AI Hype",
    "Nvidia Announces Four Supercomputers, with Two in Taiwan",
    "Live From Taipei: NVIDIA CEO Unveils Gen AI Platforms for Every Industry",
    "Nvidia to build Israeli supercomputer as AI demand soars",
    "NVIDIA Announces DGX GH200 AI Supercomputer",
    "Nvidia Partners with WPP to Transform Commerical Content with Generative AI",
    "Nvidia CEO unveils flurry of AI projects, products in Taiwan",
    "MediaTek & Nvidia partner on intelligent, software-defined cabin solutions",
    "Generative AI Sparks Life into Virtual Characters with NVIDIA ACE for Games",
    "NVIDIA: Grace Hopper Has Entered Full Production & Announcing DGX GH200 AI Supercomputer",
    "NVIDIA Keynote at COMPUTEX 2023",
    "WPP teams up with Nvidia to use generative AI in advertising",
    "Watch this Nvidia demo and imagine actually speaking to AI game characters",
    "Nvidia's new supercomputer is coming for programmers' jobs",
    "Nvidia Unveils New Supercomputer for its Largest Customers",
    "Nvidia creates open server spec to house its own chips - and the occasional x86",
    "NVIDIA ACE for Games Sparks Life Into Virtual Characters With Generative AI",
    "Nvidia and MediaTek partner to advance in-car technology",
    "WPP Partners With NVIDIA to Build Generative AI-Enabled Content Engine for Digital Advertising",
    "Nvidia Unveils DGX GH200 Next-Generation AI Supercomputer at Computex 2023",
    "Nvidia unveils GH200 super chip and DGX GH200 computing platform for AI",
    "Nvidia unveils more AI products after $184 billion rally",
    "Nvidia unveils DGX GH200, supercharges AI development and gaming industry",
    "NVIDIA Launches Accelerated Ethernet Platform for Hyperscale Generative AI",
    "NVIDIA's Quantum Leap: Unleashing the Power of Generative AI, NVDA Up 172% in YTD Period",
    "Nvidia ACE Brings AI to Game Characters, Allows Lifelike Conversations",
    "Nvidia unveils latest supercomputer for generative AI",
    "NVIDIA CEO jokes about if its new and powerful AI supercomputer can run Crysis",
    "Nvidia Unveils DGX GH200 Supercomputer, Grace Hopper Superchips in Production",
    "Nvidia chief Jensen Huang says AI is creating a ‘new computing era’",
    "NVIDIA's next DGX supercomputer is all about generative AI",
    "Nvidia unveils a new engine for enterprise AI",
    "NVIDIA Unveils Powerful NVIDIA DGX GH200 AI Supercomputer for Next-Gen AI Applications",
    "Nvidia unveils new products and services as it heads for $1 trillion valuation",
    "All the Nvidia news announced by Jensen Huang at Computex",
    "World's most valuable chipmaker Nvidia unveils more AI products after $184-billion rally",
    "Nvidia's supercomputer may bring on a new era of ChatGPT",
    "Nvidia CEO highlights chips for the historic wave of generative AI at Computex",
    "Nvidia launches GH200 Superchip to accelerate generative AI workloads",
    "Nvidia CEO reveals groundbreaking generative AI innovations for industries at COMPUTEX Taipei",
    "At Computex @nvidia's Huang highlights the role of AI in graphics development, esp games. [image]",
    "The H100 is in full production. Cost: $200k Weight: 65lbs Needs robots to install [image]",
    "Grace Hopper is in production. 200 billion transistors. [image]",
    "Jensen Huang (co-founder and CEO of NVIDIA) [image]",
    "Makes one giant DGX GH200 which is essentially “one GPU.” [image]"
]