[
    "Reddit CEO slams protest leaders, saying he'll change rules that favor ‘landed gentry’",
    "Reddit CEO Steve Huffman: 'It's time we grow up and behave like an adult company'",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts",
    "Key Facts to Understanding Reddit's Recent API Updates",
    "Reddit's CEO really wants you to know that he doesn't care about your feedback",
    "Reddit CEO lashes out on protests, moderators and third-party apps",
    "The Reddit blackout is already forcing unexpected changes",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’",
    "iMore Show #846: How Reddit is Killing Apollo - we chat to Christian Selig",
    "Reddit CEO doubles down on API changes",
    "Reddit CEO gives update on API changes while showing he really doesn't care about your feedback",
    "Reddit's CEO Is Just Making Everything Worse",
    "Reddit CEO Pushes Back Against Blackout—Will Consider Letting Users Vote Out Moderators",
    "Reddit CEO Stands Firm Amidst Protests: 'It's Time We Grow Up'",
    "Oh man.  He's doing the CEO equivalent of posting through it.",
    "Spez is a little bitch and I hope his IPO fails and he gets shitcanned. https://twitter.com/...",
    "Lol Reddit is only going to get more fun over the next two weeks https://twitter.com/...",
    "Yeah well users should be able to vote out executives https://twitter.com/...",
    "It also wasn't designed to pay dividends to shareholders https://twitter.com/...",
    "Gorilla mindset, baby. https://twitter.com/...",
    "the reddit ceo looks like someone who posts in alt-right subreddits https://twitter.com/...",
    "never go full elon https://twitter.com/...",
    "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "Reddit CEO slams protesters, calls them “landed gentry”",
    "Reddit CEO Steve Huffman isn't backing down: our full interview",
    "The landed gentry on ToS...",
    "Reddit CEO slams protest leaders, calls them ‘landed gentry’",
    "“Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts”",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’ - The Verge",
    "The Official Squarespace …",
    "Google Domains shutting down, assets sold and being migrated to Squarespace",
    "The Official Squarespace Newsroom",
    "Squarespace Enters Definitive Agreement to Acquire Google Domains Assets",
    "Squarespace to Acquire Google Domains Assets",
    "Google just killed Google Domains: Just kidding, it got sold",
    "Google Domains set to shut down as assets get sold to Squarespace",
    "Google Domains Agrees To Be Acquired By Squarespace",
    "About the Squarespace purchase of Google Domains registrations",
    "Squarespace buys Google Domains for $180 million",
    "Squarespace Says It Will Acquire Google Domains Assets From Alphabet",
    "Google is selling its Domains business to Squarespace",
    "Google Sells Google Domains as Part of ongoing Cost-Cutting Efforts",
    "Squarespace to acquire Google Domains assets",
    "I am absolutely shocked. lmao https://9to5google.com/...",
    "that's what you get for using a Google product 🫡 https://twitter.com/...",
    "Goodbye Google Domains https://twitter.com/...",
    "This season of Killed by Google sucks https://twitter.com/...",
    "At this point why would anyone use Google for anything other than search 🤡 https://twitter.com/...",
    "so long, google domains 🫡 https://twitter.com/... [image]",
    "Alphabet selling Google Domains assets to Squarespace",
    "Alphabet Selling Google Domains Assets to Squarespace",
    "Squarespace acquires Google Domains",
    "U.S. government says several agencies hacked as part of broader cyberattack",
    "US energy department, other agencies hit in global hacking spree",
    "‘Several’ US federal agencies affected by MOVEit breach",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "Energy Department among ‘several’ federal agencies hit by MOVEit breach",
    "Moveit hack: US agencies, banks and universities among latest victims",
    "Missouri Office of Administration",
    "State of Missouri Issues Statement on Recent Global Cyberattack",
    "CISA Director tells MSNBC several federal agencies hit in cyberattack",
    "Two Energy Department entities breached as part of massive MOVEit compromise",
    "No ‘systemic risk’ to government networks from latest breach, CISA says",
    "Energy Department was one of the U.S. federal agencies breached by a Russian ransomware gang",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "Russian cybercriminals attack US government agencies",
    "Ransomware Group Starts Naming Victims of MOVEit Zero-Day Attacks",
    "US Energy Dept., Other Agencies Hacked",
    "Clop has stepped up MOVEit attacks: here are five ways to manage the situation",
    "US Government Targeted in Widespread Cyberattack",
    "Third Flaw Uncovered in MOVEit Transfer App Amidst Cl0p Ransomware Mass Attack",
    "Several US government agencies were targeted in a global cyberattack",
    "Reports: Progress MOVEit Hacks Hit Federal Government, State Agencies, Companies",
    "Russian cybercrime gang hacks federal agencies",
    "Multiple federal agencies hit in cyberattack: report",
    "US Government Agencies Breached In Global Cyber Attack Incident",
    "Global Cyberattack Hits Several US Federal Agencies",
    "US Agencies Hit in MOVEit Hacks as Victim List Grows",
    "for the record - it was cl0p. https://www.cnn.com/...",
    "U.S. Securities and Exchange Commission",
    "BlackRock files for spot bitcoin ETF, with Coinbase as a crypto custodian",
    "BlackRock Files Bitcoin ETF Application With the SEC",
    "Cardano founder slams Bitcoiners for defending BlackRock",
    "Bitcoin Jumps Past $25.7K After BlackRock iShares ETF Filing",
    "BlackRock's iShares Files Paperwork for Spot Bitcoin ETF",
    "BlackRock Files Application For Bitcoin Spot Exchange Traded Fund",
    "Further evidence that Bitcoin is a commodity, and falls outside the securities issue",
    "Why Is Bitcoin Up Today?  —  The Bitcoin price has risen 3.2% since yesterday's low of $24,827.",
    "Here's The Impact Of BlackRock's Bitcoin ETF Application On The Cryptocurrency Industry?",
    "BlackRock Joins Race for Spot Bitcoin ETF, Submits Application to SEC",
    "BlackRock aims to launch Bitcoin ETF, BUSD stablecoin falls, Binance.US cuts jobs",
    "BlackRock Bitcoin ETF: Good Or Bad? What Are The Chances? Experts React",
    "BlackRock takes giant leap toward spot bitcoin ETF with SEC filing",
    "BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian",
    "BlackRock files paperwork for spot bitcoin ETF: Report",
    "BlackRock files for bitcoin ETF; Coinbase as custodian",
    "BlackRock Choses Coinbase Custody for Spot-Bitcoin ETF, SEC Lawsuit Ending Soon?",
    "BlackRock Tries for Spot-Bitcoin ETF With Fresh SEC Filing",
    "BlackRock files application for spot bitcoin ETF",
    "BlackRock Files for Bitcoin Spot ETF",
    "BlackRock's Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?",
    "Bitcoin climbs as BlackRock files for ETF backed by the cryptocurrency",
    "BlackRock delves deeper into crypto with push for bitcoin ETF",
    "BlackRock applies for spot Bitcoin ETF — a US first if approved",
    "BlackRock joins ranks of US bitcoin ETF hopefuls",
    "BlackRock files for spot Bitcoin ETF; Coinbase to serve as custodian for BTC holdings",
    "BlackRock Files Bitcoin Spot ETF Application, Taps Coinbase",
    "BlackRock files for Bitcoin ETF, Coinbase and Nasdaq listed as partners",
    "BlackRock Subsidiary Files S-1 for Bitcoin ETF",
    "BlackRock Files Spot Bitcoin ETF",
    "BlackRock set to file Bitcoin ETF application in partnership with Coinbase",
    "BlackRock nears bitcoin ETF filing, partnering with Coinbase custody",
    "BlackRock Close to Filing an Application for a Bitcoin ETF: CoinDesk",
    "Good luck, kids!  —  Hot on the heels of the SEC regulatory crackdown on crypto …",
    "BlackRock close to filing for a bitcoin ETF: Report",
    "How it started: How it's going: [image]",
    "Thirtieth time is the charm? https://twitter.com/...",
    "Intel to start shipping a quantum processor",
    "Intel Announce ‘Tunnel Falls’ Quantum Research Chip",
    "Tunnel Falls: Intel reveals 12-qubit quantum chip for research",
    "Intel Announces Release of ‘Tunnel Falls,’ 12-Qubit Silicon Chip",
    "Next generation quantum computing takes a step forward thanks to Intel's new chip",
    "Intel Debuts Tunnel Falls Quantum Chip and LQC Program to Work with It",
    "Intel's New Chip to Advance Silicon Spin Qubit Research for Quantum Computing",
    "Week In Review: Design, Low Power",
    "Partnerships bring together UW-Madison quantum computing research, industry leaders",
    "Intel Tunnel Falls Into Quantum Computing",
    "Intel Comes Out of Quantum Stealth with their 12 Qubit Tunnel Falls Chip",
    "Intel launches groundbreaking quantum computing chip ‘Tunnel Falls’",
    "Intel launches quantum chip Tunnel Falls",
    "Intel shows mass produced 12qbit CMOS quantum chip",
    "Intel continues to pave its own quantum path with Tunnel Falls",
    "Intel unveils Tunnel Falls 12-qubit quantum chip",
    "IBM quantum computer passes calculation milestone",
    "IBM touts error mitigation for greater quantum computing performance",
    "Intel Announces Its Newest Silicon-Based Quantum Chip",
    "Intel sprinkles 12-qubit quantum test chips into the hands of researchers",
    "We got a new contender in quantum computing",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "Intel Announces Major Brand Update Ahead of Upcoming Meteor Lake Launch",
    "Intel is officially killing off the ‘i’ in Core i7 — as it goes Ultra",
    "Intel announces biggest processor brand update in 15 years",
    "Intel is ditching the ‘i’ in its CPU branding for a simpler Intel Core and Core Ultra naming",
    "Intel just admitted defeat",
    "Intel Meteor Lake chips will drop the i branding and add an Ultra tier",
    "Intel's new processor branding drops the ‘i’ - and the ball",
    "Intel Rebrands its Processors into Intel Core, Intel Core Ultra",
    "Can A New Name Save Intel?",
    "Intel shakes up mainstream CPU branding, introduces Core Ultra line",
    "Say bye to the ‘i’ — Intel details new Core, Core Ultra chip branding",
    "Intel's new Core CPU branding is official: “i” is out, Ultra is in",
    "Intel responds to the Apple silicon Mac Pro with its own ‘Ultra’ chips",
    "Intel Details New Branding Changes Coming With its Meteor Lake CPUs",
    "The last generation: Intel has new labels for its next major CPU architecture",
    "Intel Just Made Its Biggest Brand Change To Processors In 15 Years",
    "Intel Shakes Up Core Processor Lineup with Significant Rebranding Initiative",
    "Weird way for Intel to acknowledge the end of its partnership with Apple",
    "Rolls off the tongue https://twitter.com/...",
    "They just made it more confusing... https://twitter.com/...",
    "They should have just brought back the pentium brand. https://www.anandtech.com/...",
    "Intel is officially killing off the ‘i’ in Core i5/i7/i9 - as it goes Ultra",
    "Intel To Launch New Core Processor Branding for Meteor Lake: Drop the i, Add Ultra Tier",
    "Intel now has “Ultra” chips",
    "Russian national arrested in Arizona, charged for alleged role in LockBit ransomware attacks",
    "20-Year-Old Russian LockBit Ransomware Affiliate Arrested in Arizona",
    "Russian National Charged With Carrying Out 4 LockBit Attacks",
    "LockBit Affiliate Arrested, as Extortion Totals Reach $91M Since 2020",
    "Russian ransomware hacker extorted millions from U.S. businesses, prosecutors say",
    "Russian national charged in ransomware attacks against businesses in US",
    "Russian national arrested in US for deploying LockBit ransomware",
    "FEDS ARREST, CHARGE RUSSIAN NATIONAL IN ARIZONA FOR LOCKBIT ATTACKS",
    "Amazon's purchase of Roomba maker cleared by CMA",
    "UK clears Amazon's $1.7 bln deal for Roomba-maker iRobot",
    "Amazon's iRobot acquisition gets UK green light.",
    "Australian Financial Review",
    "Xi wants tech ties with ‘old friend’ Bill Gates",
    "Chinese President Xi, Bill Gates meet on Friday in Beijing during latter's visit to China",
    "Xi Jinping meets ‘old friend’ Bill Gates ahead of Antony Blinken's China visit",
    "Bill Gates, in First Visit to China Since 2019, Meets With Xi",
    "China leader's latest tech meet-and-greet: Bill Gates",
    "Bill Gates meets with President Xi Jinping in Beijing",
    "Bill Gates meets Xi Jinping to discuss global challenges, cooperation",
    "Micron to invest US$600 million on China plant despite Beijing's ban",
    "Micron invests $600m in China amid chip sanctions, eyes $1bn India factory",
    "Micron, Blacklisted by Beijing, to Pump $600 Million Into China Expansion",
    "Micron Vows $600 Million China Investment Weeks After Chip Ban",
    "Micron may invest up to $2b in Indian semiconductor factory",
    "Micron to invest $600mn in Chinese factory despite Beijing chip ban",
    "Micron says committed to China, invests $602 mln in existing plant",
    "Introducing the Partner Plus Program",
    "Twitch introduces 70/30 revenue split in new Partner Plus program",
    "Trainwreck slams Twitch for “pure greed” over 70/30 sub-split loophole",
    "Twitch introduces new revenue split for Partners, but there's a catch",
    "Twitch Reveals What It Will Take for Partners to Get 70% of Subscription Revenue",
    "Twitch execs hold Q&A on new Partner Plus program",
    "Twitch Introduces 70/30 Revenue Split For Some Streamers Through New Program—With Some Caveats",
    "Twitch Introduces 70-30 Revenue Split, But There's A Catch",
    "Twitch's new partner program aims to increase creators' revenue split",
    "Twitch Enrages Streamers Again With Convoluted New Revenue Share Program",
    "Twitch's new Partner Plus program offers some streamers a 70/30 revenue split",
    "Twitch will give smaller streamers a bigger cut of subscriptions",
    "Twitch's New Partner Program Will Finally Give Streamers A 70/30 Cut Of The Revenue Pie",
    "Twitch introduces 70/30 revenue split for partners with new program—but there's a catch",
    "Twitch introduces the Partner Plus Program with a 70/30 spit.",
    "Southeast Asia to craft AI governance, ethics guidelines",
    "Planning for an “ASEAN Guide on AI Governance and Ethics” is underway https://twitter.com/...",
    "The word ‘guardrails’ is quite à la mode these days https://twitter.com/...",
    "4D chess... https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Inhuman Writing for Google Is Eating the Web",
    "Elon Musk's electric car chargers are squeezing out Washington's favorite",
    "Much speech very free https://twitter.com/...",
    "Personalized wealth management, built for tech people",
    "10 reasons why Zoho Sign is a better alternative to DocuSign",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/15 - Everbody Does Ads Now",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Intel plans €4.6B microchips factory in Poland",
    "Intel to invest $4.6 bln in new chip plant in Poland",
    "US chipmaker Intel to build $4.6bn plant in Poland",
    "Intel Plans $4.6 Billion Plant in Poland to Meet Europe Chip Demand",
    "Amazon's second headquarters comes to life in 21 photos from the official opening",
    "Amazon debuts its headquarters complex in Virginia as it brings workers back to office",
    "Amazon officially opens first phase of HQ2 in Virginia with room for 14k employees",
    "As Amazon HQ2 opens its doors, neighbors brace for a transformation",
    "Adobe Reports Record Revenue in Q2 Fiscal 2023",
    "Adobe Beats Quarterly Goals On Record Cloud Software Demand",
    "Adobe Raises Sales Forecast as Company Rolls Out New AI Features",
    "Adobe Q2 strong, aims to gain generative AI momentum, monetize",
    "VICE: YouTube Tells Open-Source Privacy Software ‘Invidious’ to Shut Down",
    "Why is the crypto market down today? June 2023 industry failure",
    "Cruz, Graham, Grassley join Democrats to advance journalism antitrust bill",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Senate Judiciary Committee Passes Journalism Competition And Preservation Act",
    "Senate Judiciary Committee Passes the Journalism Competition and Preservation Act",
    "American Economic Liberties Project",
    "Saving the News from Big Tech: The Journalism Competition and Preservation Act",
    "Ticketmaster and Seat Geek to dump “junk fees” after White House pressure",
    "Watch Out for ‘Junk’ Fees When Booking Travel Online",
    "Ticketmaster parent Live Nation, others agree to show ‘junk fees’ after Biden pressure",
    "Live Nation-Ticketmaster to disclose full ticket prices upfront",
    "Remarks by President Biden on Protecting Consumers from Hidden Junk Fees",
    "Ticket Giants, Under Pressure From Biden, Promise Transparency on Fees",
    "Ticketmaster says it will now institute ‘all-in pricing,’ but here's what that really means",
    "Live Nation and Ticketmaster are pledging to President Biden to show fees up front",
    "Biden praises companies for ending hidden fees",
    "Biden Applauds Ticketmaster's Plans for Fee Transparency After Taylor Swift Debacle",
    "Biden hauls in Live Nation, Airbnb, other execs to White House amid crackdown over junk fees",
    "Live Nation and Ticketmaster to start showing hidden ticket costs",
    "Ticketmaster, Others Agree to All-In Pricing as White House Cracks Down on Hidden Junk Fees",
    "Ticketmaster, SeatGeek pledge to show all-in pricing for customers up front: White House",
    "Live Nation and SeatGeek will stop hiding junk fees",
    "Ticketmaster to Announce Transparency on Fees at Biden Meeting",
    "Biden announces Live Nation and Ticketmaster will allow consumers to see all fees up front",
    "Ticketmaster, SeatGeek agree to show ‘all-in’ prices after Biden's junk fee crackdown",
    "Ticketmaster, SeatGeek to Show Ticket Buyers ‘All In’ Pricing That Includes Fees",
    "Ticketmaster To Offer “All-In” Pricing As Joe Biden Promotes Progress On Eliminating “Hidden Fees”",
    "Ticketmaster, SeatGeek Commit to All-In Pricing After “Junk Fees” Criticism",
    "Oh the junk fees will be there, this is just a new way to hide them",
    "This is great news. https://twitter.com/...",
    "Ticket giants promise fee transparency, under pressure from Biden https://www.nytimes.com/...",
    "Cava Is No Cure for IPO Indigestion",
    "Alibaba to Bring Tmall eCommerce Site to Europe",
    "Instagram Broadcast Channels: New Features and Popular Channels in India",
    "Meta introduces Broadcast Channel feature for Instagram users",
    "Instagram broadcast channels feature to start its global rollout",
    "Instagram starts rolling new ‘Channels’ feature out globally",
    "Instagram is rolling out its Telegram-like broadcast channels worldwide",
    "Following WhatsApp, Instagram is now rolling out its ‘Channels’ feature globally",
    "Instagram Broadcast Channels is now available globally",
    "Meta Platforms' Instagram Expands Broadcast Channels Globally",
    "Instagram Expands Broadcast Channels to All Creators, Tests New Channel Options",
    "Instagram Broadcast Channels Roll Out Globally: What You Need To Know",
    "Instagram's One-Way Broadcast Channels Roll Out Globally",
    "Instagram expands broadcast channels feature globally. Here's how to use it",
    "Instagram update: Zuck just announced the roll out of global Broadcast Channels [image]",
    "Huawei slams new EU restrictions",
    "EU boss Breton: There's no Huawei that Chinese comms kit is safe to use in Europe",
    "Twitter's inability to pay its rent is more urgent than building ‘Twitter 2.0’",
    "Huawei Is Not Getting 5G Chips From Qualcomm; the Rumors Are Fake!",
    "@williamgunn@mastodon.social",
    "Epic Games Releases MetaHuman Animator, Requires Just an iPhone to Capture Actor's Performance",
    "You can now animate Epic's ultra realistic MetaHumans with an iPhone camera capture",
    "Delivering high-quality facial animation in minutes, MetaHuman Animator is now available!",
    "Blue Dot: A 3Lateral Showcase of MetaHuman Animator",
    "@Techmeme Are we all just going to ignore how much this is going to empower disinformation agents?",
    "Amazon and Disney announce Hey Disney! launch for Echo devices",
    "‘Hey Disney!’ voice assistant is now available on US Echo devices",
    "‘Hey Disney’ Brings Mickey and Crew to Your Amazon Echo",
    "‘Hey Disney:’ Dory and Mickey Can Now Respond to Your Kids on Amazon Echo",
    "Amazon Echo Devices Get Their First Custom Alexa-Based Assistant",
    "Amazon's ‘Hey Disney’ assistant finally arrives for U.S. Echo users",
    "‘Hey Disney’ Custom Alexa Assistant Arrives",
    "Mandiant says China-backed hackers exploited Barracuda zero-day to spy on governments",
    "Barracuda ESG zero-day exploited by China-linked APT",
    "Chinese spies blamed for data-harvesting raids on Barracuda email gateways",
    "Critical Barracuda ESG Zero-Day Linked to Novel Chinese APT",
    "Barracuda ESG zero-day attacks linked to suspected Chinese hackers",
    "Chinese hackers ‘breached hundreds of public, private networks’ globally",
    "Chinese UNC4841 Group Exploits Zero-Day Flaw in Barracuda Email Security Gateway",
    "Barracuda ESG devices actively exploited in broad, ongoing espionage campaign",
    "Mandiant attributes Barracuda Networks malware campaign to China-linked hackers",
    "Attacks on Barracuda Networks linked to China-backed hacking group",
    "CISA Order Highlights Persistent Risk at Network Edge",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "Barracuda Networks Releases Update to Address ESG Vulnerability",
    "China Behind ‘Wide-Ranging’ Barracuda Attacks, Mandiant Says",
    "Chinese Hackers Exploit Barracuda ESG Zero-Day",
    "Mandiant Says China-backed Hackers Exploited Barracuda Zero-Day To Spy on Governments",
    "Megaupload coders sentenced to prison after home detention bid denied",
    "Megaupload programmers cop a plea in New Zealand to avoid extradition",
    "Kim Dotcom's Megaupload Coders Sentenced to Prison, Herald Says",
    "New Zealand court sentences Megaupload coders to prison",
    "Megaupload coders avoid 10-year sentences by testifying against Kim Dotcom",
    "Megaupload pair jailed for their part in Kim Dotcom's online empire",
    "Megaupload sentencing: Judge asked to consider home detention but Crown wants prison",
    "Two Megaupload executives sentenced to jail",
    "Former Megaupload Executives Sentenced to 2.5 Years in Prison",
    "We are coming for you, Kim. https://twitter.com/...",
    "Men who helped run Megaupload sentenced to prison in New Zealand",
    "2 men who helped run popular pirating website Megaupload sentenced to prison in New Zealand",
    "Steam Update: In-game overlay, notifications, and a fresh coat of paint",
    "Steam update brings new features & Mac hardware acceleration",
    "Steam :: Steam News :: Steam Desktop Update",
    "Steam app for macOS updated with hardware acceleration for better performance",
    "Steam Gets Massive Update with Refreshed UI, New In-Game Overlay",
    "Steam's Big Desktop Update Out of Beta, Tons of Improvements",
    "New Steam Update Enhances UI, Revamps Overlay, And Adds Notes",
    "Steam's Massive Overhaul Is Here With A Fresh Look And New Capabilities For Gamers",
    "Steam gets massive overhaul that brings updated visuals and exciting new features",
    "Steam update overhauls desktop client, brings notes and pinned windows",
    "The new Steam client update looks funky, comes with new features",
    "The biggest Steam update in years just arrived. Here's what's new",
    "How to add non-Steam games on Steam Deck",
    "Valve's Steam redesign is finally here",
    "Microsoft: Russia sent its B team to wipe Ukrainian hard drives",
    "Russia-backed hackers unleash new USB-based malware on Ukraine's military",
    "Microsoft Warns of New Russian State-Sponsored Hacker Group with Destructive Intent",
    "Microsoft Names Russian Threat Actor “Cadet Blizzard”",
    "Cyberattack wave in Ukraine linked to Russia's GRU, Microsoft says",
    "Microsoft identifies new hacking group controlled by Russian intelligence",
    "Cadet Blizzard emerges as a novel and distinct Russian threat actor",
    "Microsoft links Cadet Blizzard APT to Russia's military intelligence GRU",
    "Russian APT ‘Cadet Blizzard’ Behind Ukraine Wiper Attacks",
    "Microsoft identifies, names new Russian-sponsored threat group",
    "Microsoft links data wiping attacks to new Russian GRU hacking group"
]