[
    "OpenAI may leave the EU if regulations bite - CEO",
    "Sam Altman Says OpenAI Will Leave the EU if There's Any Real AI Regulation",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "OpenAI Could Quit Europe Over New AI Rules, CEO Sam Altman Warns",
    "ChatGPT Could Leave Europe, OpenAI CEO Warns, Days After Urging U.S. Congress For AI Regulations",
    "Why Does Sam Altman Like Poland for OpenAI?",
    "AI could grow so powerful it replaces experienced professionals within 10 years, Sam Altman warns",
    "ChatGPT might quit the EU rather than comply with regulations",
    "ChatGPT could “cease operating” in the EU after proposed AI regulations",
    "OpenAI could ‘cease operating’ in Europe over AI laws: Sam Altman",
    "AI regulation might prompt OpenAI to remove ChatGPT from Europe",
    "ChatGPT-maker warns it might leave EU over planned AI law",
    "OpenAI may quit Europe If AI regulation proves ‘challenging’: CEO Sam Altman",
    "Sam Altman Wants The Government To Build Him A Moat",
    "Sam Altman sells superintelligent sunshine as protestors call for AGI pause",
    "No 10 acknowledges ‘existential’ risk of AI for first time",
    "OpenAI Considers Exit From Europe - Faces Planned Legislation from Regulators",
    "A conversation with OpenAI CEO Sam Altman | Hosted by Elevate",
    "The official ChatGPT app is now available in 11 more countries",
    "Sam Altman's big European tour",
    "Why OpenAI's Sam Altman was just in Lagos",
    "Mike had a good post on Altman's recent performance before Congress: https://www.techdirt.com/...",
    "@paulo170595 @SimonFounder flew to paris, took the eurostar to london",
    "Wow, gpt4 even making physical travel way more efficient too 👏 https://twitter.com/...",
    "Microsoft urges lawmakers to adopt new guidelines for responsible AI",
    "Microsoft leaps into the AI regulation debate, calling for a new US agency and executive order",
    "Microsoft Calls for a New US Agency and Licensing for AI",
    "Microsoft Calls for A.I. Rules to Minimize the Technology's Risks",
    "Microsoft's President Backs New Agency to Regulate ChatGPT, Other AI Systems",
    "Microsoft calls for ‘safety brakes,’ licensing, and a new federal agency to avoid AI pitfalls",
    "Deepfakes are biggest AI concern, says Microsoft president",
    "Microsoft president backs regulatory agency for AI",
    "Microsoft releases its blueprint on how it believes AI should be governed",
    "Microsoft outlines its vision for keeping A.I. in check",
    "Microsoft provides AI governance principles following ChatGPT popularity",
    "TikTok testing AI chatbot called ‘Tako’, research firm says",
    "TikTok is testing an AI chatbot called Tako",
    "TikTok's new AI Chatbot in Testing Could Revolutionize User Experience",
    "TikTok tests AI chatbot for search and discovery",
    "An AI Chatbot Is Coming to TikTok for Some Reason",
    "TikTok is testing an AI chatbot for content discovery",
    "TikTok is also making an AI chatbot, for some reason",
    "TikTok Tests AI Chatbot Called Tako",
    "TikTok Tests an AI Chatbot Called ‘Tako’",
    "TikTok Is Testing Its Own AI Chatbot Called Tako",
    "TikTok Testing AI-Powered Chatbot That Searches for Content",
    "TikTok AI chatbot “Tako” help users discover more interesting videos",
    "TikTok Is Testing an AI Chatbot Named Tako",
    "TikTok Begins Testing Tako, Its Own AI ChatBot",
    "TikTok, Like Everyone Else, Is Testing Its Own AI Chatbot",
    "TikTok is toying with an in-app AI chatbot",
    "TikTok's AI Chatbot Spotted in the Wild",
    "Fahrenheit Wins Bid to Acquire Assets of Insolvent Crypto Lender Celsius",
    "Arrington Capital-backed group to acquire Celsius assets",
    "Arrington Capital-led group to acquire bankrupt Celsius Network assets",
    "PNCNX Bankruptcy Claim Product To Be Available For Celsius Users in a Week",
    "Fahrenheit Wins Bid for Bankrupt Celsius, Will Acquire up to $500M in Liquid Crypto",
    "Fahrenheit Chosen As Winning Bid in Celsius Bankruptcy",
    "Michael Arrington-Backed Fahrenheit LLC Wins Bid to Buy Bankrupt Celsius",
    "Arrington Led Consortium Featuring Coinbase Acquires Celsius' Assets",
    "Celsius turns to Fahrenheit to oversee bankruptcy exit",
    "Celsius Network's bold bid selection revealed",
    "Fahrenheit Consortium acquires bankrupt Celsius Network",
    "Celsius Bankruptcy Struggles Coming to an End as Fahrenheit Clinches Win in Auction",
    "Fahrenheit To Acquire Assets of Bankrupt Crypto Lender Celsius",
    "Crypto Consortium Fahrenheit Wins Bid to Acquire Bankrupt Celsius' Assets",
    "Fahrenheit Consortium Wins Bid to Acquire Celsius Network",
    "Fahrenheit Emerges Victorious, Acquires Celsius' Assets In A Bidding War",
    "Fahrenheit buying Celsius? You can't make this up",
    "This is just outstanding https://www.coindesk.com/... via @coindesk",
    "3 new ways generative AI can help you search",
    "Google Search starts rolling out ChatGPT-style generative AI results",
    "Google Now Testing Generative AI for Search",
    "Google begins opening access to generative AI in search",
    "Google starts opening up access to its new generative AI capabilities in Search",
    "Google is now opening Search Labs to the public, bringing AI to Search",
    "Google is starting to let users into its AI search experiment",
    "Google opens Search Generative Experience to US Search Labs users",
    "Google opens access to Search Generative Experience today",
    "Google opens access to Search Labs to further test its generative AI",
    "Quinnipiac University Poll",
    "@sandofsky@mastodon.social",
    "Glitches, echoes and ‘melting the servers’ crash DeSantis' campaign launch on Twitter",
    "Elon Musk's Event With Ron DeSantis Exposes Twitter's Weaknesses",
    "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’",
    "Twitter technical issues crash Ron DeSantis's 2024 campaign announcement",
    "Elon Musk fails to launch Ron DeSantis in disastrous Twitter Space",
    "Twitter's Flaws Snag Elon Musk's Media Ambitions",
    "DeSantis/Musk event didn't break the Internet, but it did break Twitter",
    "Twitter is removing view count metrics from videos",
    "Twitter Will Drive Conservatives Mad — and Further Right",
    "Outages, garbled audio: DeSantis's 2024 launch marred by Twitter tech meltdown",
    "Twitter repeatedly crashes as DeSantis tries to make presidential announcement",
    "Twitter Spaces groans under weight of Ron DeSantis and Elon Musk's egos",
    "Florida Gov. Ron DeSantis' presidential announcement on Twitter plagued by technical problems",
    "Governor DeSantis Reveals Plan To Safeguard Bitcoin And Other Crypto",
    "Ron DeSantis's very online and very disastrous 2024 campaign announcement",
    "DeSantis Campaign Debut on Twitter Faces Technical Glitches",
    "Ron DeSantis gambled on Elon Musk and went bust",
    "Ron DeSantis' Twitter Spaces Conversation With Elon Musk Kicks Off With Major Glitches",
    "Elon Musk Turns Ron DeSantis' Presidential Run Announcement Into a Twitter ‘DeSaster’",
    "The Hill's Morning Report — Shaky start: DeSantis's 2024 launch marred by glitches",
    "Elon Musk and Ron DeSantis' fiasco shows they didn't realize Twitter needs TV",
    "Candidate for President Ron DeSantis Believes in Bitcoin, But Not CBDCs",
    "Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point",
    "Twitter Spaces crashes repeatedly during DeSantis 2024 announcement",
    "Florida Gov. Ron DeSantis announces he's running for president in 2024",
    "Start of Ron DeSantis presidential campaign melts down in Twitter problems",
    "Elon Musk's Twitter Event With Ron DeSantis Hits Technical Issues",
    "Biden capitalizes on DeSantis Twitter Spaces failure",
    "Ron DeSantis Disastrous Presidential Announcement with Elon Musk, Servers Crash",
    "DeSantis Campaign Sputters to Launch as Twitter Spaces Livestream Crashes",
    "DeSantis' 2024 Announcement Delayed By Twitter Glitches",
    "DeSantis' Twitter Campaign Launch Was a Glitch-Filled Disaster",
    "Ron DeSantis ‘Disastrous’ 2024 Launch Marred by Twitter Glitches",
    "Twitter glitches disrupt Ron DeSantis' presidential run announcement",
    "Ron DeSantis Twitter Spaces Event Experiences ‘Rapid Unscheduled Disassembly’",
    "Biden trolls DeSantis over glitchy 2024 launch on Twitter Spaces",
    "Twitter crashes in Ron DeSantis U.S. presidential run announcement",
    "Elon Musk ushers in DeSantis's 2024 campaign, signaling a new era for Twitter",
    "@lauren@mastodon.laurenweinstein.org",
    "Sounds like DeSantis and Musk should have hosted their show on Truth Social servers.",
    "This link works: [Donate to reelect Joe Biden and Kamala Harris]",
    "I wonder if this is a DDOS attack",
    "I'm running for president to lead our Great American Comeback. [video]",
    "We had more people join when I played Among Us 👾 https://twitter.com/...",
    "It'd be like if the escalator had just stopped halfway down...",
    "BuzzFeed exploding the watermelon hit 820,000 concurrent viewers in 2016 https://twitter.com/...",
    "All Presidential candidates are most welcome on this platform",
    "https://twitter.com/... [video]",
    "Ron DeSantis' campaign launch: [image]",
    "What a small, grumpy claque of incels and whiners.",
    "Musk's talent for fucking over everyone he partners with is by far his most redeeming quality.",
    "one of the worst websites I've ever seen [image]",
    "everyone: wow, he shit his pants elon: yes, but everybody saw it [image]",
    "Trump was a political mastermind for his Twitter use, but DeSantis is “way too online.”",
    "Today in “The important thing is that the rocket cleared the launchpad!” [image]",
    "10 million views. https://twitter.com/...",
    "This is the full video of DeSantis with Hitler and the devil posted on Trump's Instagram [video]",
    "Man what https://twitter.com/... [image]",
    "Live look at Tucker Carlson, who decided to broadcast his new show on Twitter [image]",
    "I think she might be leaving something out https://twitter.com/...",
    "The Jungle Cat, keeping it real. https://twitter.com/...",
    "he just destroyed ron and elon [video]",
    "Against all odds we could actually have a funny campaign season [image]",
    "Wait, I'm listening now. Is....is he...reading a speech into a Twitter Spaces? omg",
    "can't believe this is how he announced [image]",
    "Ron DeSantis sitting somewhere in a swivel chair 10 out of 10 raging",
    "Ron DeSantis learning what happens when you launch things with Elon Musk [image]",
    "“Before you can be president, unmute yourself”",
    "https://twitter.com/... [image]",
    "If only there were some kind of audio/visual medium already installed in every American household.",
    "LOL. TFG https://twitter.com/...",
    "holy fucking shit, Ron DeSantis's campaign launch crashed and burned faster than a Tesla",
    "Launching my presidential campaign on ham radio",
    "Sean Spicer vibes here https://twitter.com/...",
    "Well you do want these things to be memorable. 🤷‍♂️ https://twitter.com/...",
    "Fantastic job all around https://twitter.com/...",
    "No advance prep? Idiot. https://twitter.com/...",
    "Ok now Joe from Scranton has entered the room with an epic dunk. https://twitter.com/...",
    "Biden is trolling Musk and DeSantis in real time. https://twitter.com/...",
    "OpenAI's ChatGPT app tops 500k downloads in just 6 days",
    "OpenAI launches ChatGPT for iOS in 11 more nations except India",
    "ChatGPT iOS App Launches in the UK and 10 More Countries",
    "OpenAI makes its ChatGPT app for iOS available in 11 more countries",
    "The official ChatGPT app on iOS is now available in 11 more countries",
    "ChatGPT for iOS is now available in 11 more countries",
    "ChatGPT app expands to 11 more countries",
    "ChatGPT for iPhone now available in the UK and 10 other countries; unfair Apple criticism",
    "Microsoft appeals UK's block on Activision deal",
    "The EU explains why it approved Microsoft's Activision Blizzard deal.",
    "EU defends split with UK on Microsoft, Activision Blizzard bid",
    "The EU's antitrust chief defends its approval of Microsoft's purchase of Activision Blizzard",
    "Microsoft to lodge appeal against UK regulator's block of Activision deal - Sky News",
    "Microsoft's appeal over UK's Activision veto is ‘chance to find a third way,’ say legal experts",
    "Microsoft Officially Appeals UK CMA Decision to Block the Activision Blizzard Merger",
    "Microsoft Has Officially Appealed The CMA Decision On Their Activision Deal",
    "YouTube is killing Stories",
    "YouTube Stories, which are not Shorts, are going away",
    "YouTube Axes Stories Feature and Encourages Creators to Make Shorts",
    "YouTube is getting rid of YouTube Stories",
    "YouTube Stories are going away starting June 26",
    "Sam Altman's Crypto Project Worldcoin Raises $115M, Led By Blockchain Capital",
    "OpenAI's Sam Altman raises $115 mln for Worldcoin crypto project",
    "Sam Altman says OpenAI could leave EU over proposed AI law",
    "Tools for Humanity Secures $115 Million in Funding Round Led by Blockchain Capital",
    "Sam Altman's crypto project Worldcoin got more coin in latest $115M raise",
    "Worldcoin Creator Tools for Humanity Raises $115M in Series C Round Led by Blockchain Capital",
    "Sam Altman's Crypto Startup Tools For Humanity Locks Up $115M",
    "Worldcoin developer nets $115 million fundraise led by Blockchain Capital",
    "OpenAI CEO Sam Altman Raises $115M for Worldcoin Crypto Project",
    "Sam Altman's Worldcoin raises $115M in Series C round",
    "Worldcoin Developer Raises $115M For A Series C Funding Round",
    "Sam Altman's Worldcoin Project Receives $115 Million Investment",
    "Sam Altman Co-Founder of Worldcoin Raises $115 Million for Unique Cryptocurrency",
    "United Nations official and others in Armenia hacked by NSO Group spyware",
    "Researchers say they found spyware used in war for the first time",
    "Apple alerted Pegasus spyware victims during first known use in a military conflict",
    "Pegasus iPhone spyware is now a tool of war",
    "‘Despicable’ iPhone Hacks In Armenia Find NSO Spyware ‘In Active Warzone’",
    "Confirmation & Research Note 1: Pegasus infections in Armenian Civil Society",
    "Pegasus Spyware Is Detected in a War Zone for the First Time",
    "Armenia asks UN Court to order Azerbaijan to open the Lachin corridor",
    "Armenia/Azerbaijan: Pegasus spyware targeted Armenian public figures amid conflict",
    "NSO Spyware Used to Target Prominent Armenians, Researchers Say",
    "NSO spyware used in Armenia-Azerbaijan conflict, report finds",
    "Committee to Protect Journalists",
    "Radio Free Europe/Radio Liberty",
    "Probe Reveals Dozens Targeted By Pegasus Spyware In Armenia, Including Two RFE/RL Journalists",
    "Researchers find Israeli-made spyware deployed across Armenia",
    "Armenians hacked with Pegasus spyware during war: NGO",
    "Azerbaijan Suspected in Hacking of Armenian Officials With Israeli NSO Spyware",
    "Walking naturally after spinal cord injury using a brain-spine interface",
    "Man with paralysis walks naturally after brain, spine implants",
    "AI is the key to astonishing breakthrough that allowed paralysed man to walk again",
    "Paralyzed man walks again after brain and spinal computerized implants",
    "Mind-reading AI allows paralyzed man to walk again",
    "Brain implants help paralysed man to walk again",
    "Paralyzed man walks for first time in over a decade with electronic brain implants",
    "Motorcycle crash victim can walk and do chores thanks to brain, spine implants",
    "AI-based ‘digital bridge’ enables paraplegic patient to walk",
    "Full paper here: https://www.nature.com/...",
    "These guys can't go a month without trying to knife each other [image]",
    "Twitch is raising prices for its ad-free Turbo service",
    "Musk's Twitter wants academics to delete data in “book burning” scheme",
    "Boss of Goldman-backed digital bank Starling to step down next month",
    "Iconic Fintech Founder Anne Boden Announces Exit as CEO of Starling Bank",
    "Anne Boden to step down as chief of Starling as bank reports record profits",
    "Anne Boden to step down as Starling chief executive",
    "Starling founder Anne Boden steps down",
    "UK's Starling Bank CEO departs months after it pulled out of Ireland launch",
    "Starling Bank chief Anne Boden to step down amid record profit",
    "One of Britain's Only Female Bank Bosses Is Stepping Down",
    "Breaking: Anne Boden to step down as Starling Bank CEO, as bank reports record profits of £195m",
    "She going to YC too? https://twitter.com/...",
    "Working together with YouTube",
    "Binance Launching NFT Loan Feature",
    "Binance enters the NFT lending market with loan service",
    "Binance Jumps on the NFT Lending Frenzy with ETH Loans",
    "Binance NFT Debuts Ethereum Loans Backed by NFT Collateral",
    "US banking tech provider Nymbus bags $70m Series D funding",
    "Only 25% of Consumers Have Used a Neobank, Digital Bank or Bank-Like FinTech",
    "NYMBUS Raises $70 Million in Series D Funding, Bolstered by New and Returning Investors",
    "Free compensation benchmarking data from 3,000 startups",
    "Alibaba moves to quash job cut ‘rumours’, pledging 15,000 hires in 2023",
    "Alibaba says to hire this year, refuting layoff rumours",
    "Motorola Edge+ 2023 review: Boring design aside, this is a flagship worth considering",
    "The best Android phones in 2023",
    "Motorola Edge Plus (2023) review: a Pixel 7 Pro and Galaxy S23 killer",
    "Motorola Edge Plus Review: Refined Style and Specs, but Still Lost in the Crowd",
    "Score! The Samsung Galaxy S23 just crashed to lowest price ever",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Thu. 05/25 - Even Presidential Candidates Suffer From Twitter Glitches",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "5 Artificial Intelligence Use Cases More Promising Than ChatGPT",
    "Nasdaq's Surprisingly Tough Fight for the Year's Marquee IPO",
    "eFishery's $108M Raise And Unicorn Status Proves Aquaculture Is Swimming Upstream",
    "eFishery becomes Indonesia's latest unicorn with 42XFund-led $108m Series D funding",
    "Grab co-founder Tan Hooi Ling to step down from operational roles",
    "GRIMES REVIEWS A.I. GRIMES SONGS https://www.nytimes.com/... [image]",
    "SEC Filing Unveils OpenAI's Raise of $175M for Startup Fund",
    "OpenAI Raises $175 Million For Startup Investment Fund",
    "OpenAI: profits cap will no longer fit as capital surges in",
    "OpenAI Closes $175 Million Startup Investment Fund",
    "OpenAI raises $175m in funding to invest in AI start-ups",
    "Because every AI driven YC company needs follow on. https://twitter.com/...",
    "Amazon to Stop Providing App Store Services in China",
    "Amazon suspends Appstore services",
    "Amazon to Shut Down App Store Service in China, Succumbing to Local Competition",
    "Amazon China Will No Longer Provide App Store Services Starting July 17",
    "Amazon to stop providing app store services in China",
    "Amazon's Appstore to Shut Down in China",
    "Minnesota enacts right-to-repair law that covers more devices than any other state",
    "Minnesota Passes Right to Repair",
    "Minnesota passes a right to repair bill that actually matters",
    "Minnesota passes broadest Right to Repair measure to date",
    "Right-to-repair rules are now the law in Minnesota",
    "Another win for the new Minnesota Vikings https://prospect.org/... https://twitter.com/...",
    "Right to repair is now the law of the land in Minnesota! https://www.ifixit.com/...",
    "Supreme Court of the United States",
    "Google never agreed it wouldn't copy Genius' song lyrics, US official says",
    "ML Genius Holdings LLC v. Google LLC",
    "Google Play Games for PC Beta Launches in Europe and New Zealand",
    "Google Play Games adds UK and New Zealand to PC beta",
    "Google Play Games for PC is now available in Europe and New Zealand",
    "Google Play Games Beta arrives for Samsung Galaxy laptops in Europe",
    "Google Play Games for PC Beta are now accessible to Europe",
    "Google Play Games for PC levels up with availability spreading to Europe",
    "Google Play Games on PC is now available in Europe and New Zealand",
    "Play Games for PC Beta opens up to Europe and New Zealand",
    "PlayStation Showcase 2023 - Accessories Sneak Peek",
    "PlayStation Showcase recap: everything announced at today's show",
    "Sony's ‘Project Q’ Handheld Streams PS5 Games, But Only When You're Home",
    "Sony announces Project Q handheld for local streaming of PlayStation 5 games",
    "Sony's PS5 streaming Project Q handheld will launch this year",
    "Sony Teases Project Q, A Mobile PS5 Streaming Game Console With An 8-Inch Display",
    "Sony's new Project Q handheld looks great, but I still miss my PSP",
    "Best Remote Play Alternatives to the New PlayStation Handheld ‘Project Q’",
    "PlayStation handheld may release just in time for the holidays",
    "Sony's ‘Project Q’ Handheld Streams Games From Your PS5",
    "Sony's Project Q is a handheld without the portability",
    "Sony launches its first PlayStation earbuds for gamers",
    "PlayStation's Handheld Project Q Reportedly Launching In November",
    "Sony launches PlayStation earbuds with lossless, low-latency audio for PC and PS5",
    "Sony's PlayStation handheld reportedly arriving in November",
    "PlayStation Handheld Project Q Will Launch In November - Report",
    "What is PlayStation Project Q and how does it work?",
    "Sony's Next Handheld Project Q Reportedly Releasing This November",
    "Sony PlayStation Project Q: Everything you need to know",
    "Sony Project Q handheld console will fundamentally change how PS5 users game",
    "PlayStation ‘Project Q’ Streaming Device Launches Later This Year",
    "I want Apple to steal this unexpected PlayStation Earbuds feature",
    "PlayStation Showcase 2023: Spider-Man 2 impresses, Project Q confuses",
    "Sony's Project Q PlayStation 5 Handheld May Launch In November",
    "Sony unveiled a new Q handheld; Streams PS5 games",
    "PlayStation to release a new streaming handheld Project Q",
    "PlayStation Officially Unveils The Handheld Project Q",
    "Sony's making a new handheld to stream PS5 games",
    "Currently scheduled to release mid-late November 2023.",
    "Cannot wait to play Square Enix's Splatoon on my Sony Wii U [image]",
    "wii u did this 11 years ago and you all laughed https://twitter.com/...",
    "Snowflake acquires Neeva to bring intelligent search to its cloud data management solution",
    "Snowflake acquires Neeva to accelerate search in the Data Cloud through generative AI",
    "Silicon Valley Business Journal",
    "Snowflake acquires Neeva, sees stock get hammered following Q1 earnings report",
    "SNOW Shares Plunge 14% as Snowflake Shares Posts Revenue Guidance",
    "Neeva joins Snowflake to bring the power of search and generative AI to Snowflake Customers",
    "Snowflake slashes forecast, stock slumps after earnings",
    "Joint Cybersecurity Advisory",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "Chinese hackers behind Guam breach have been spying on US military for years",
    "People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection",
    "Chinese state hackers infect critical infrastructure throughout the US and Guam",
    "Chinese hackers breach US critical infrastructure in stealthy attacks",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?",
    "China rejects claim it is spying on Western critical infrastructure",
    "Factbox: What is Volt Typhoon, the alleged China-backed hacking group?",
    "National Security Agency/Central Security Service",
    "Chinese hacking campaign targeting US infrastructure: Microsoft report",
    "Broad campaign underway to access US critical infrastructure using small, home office devices",
    "China hits back over Five Eyes blame for US infrastructure cyber attack",
    "Chinese hackers hit critical U.S. infrastructure, intelligence agencies warn",
    "‘Stay vigilant,’ U.S. warns amid Chinese cyber espionage operation",
    "China's Stealthy Hackers Infiltrate U.S. and Guam Critical Infrastructure Undetected",
    "Microsoft: Chinese hackers hit key US bases on Guam",
    "China hits back after Microsoft says state-sponsored group hacked critical US infrastructure",
    "‘Volt Typhoon’ China-Backed APT Infiltrates US Critical Infrastructure Orgs",
    "Why are Chinese hackers targeting Guam?",
    "Microsoft links attacks on American critical infrastructure systems to China",
    "Chinese Hacker Group Volt Typhoon Targets US Critical Infrastructure",
    "Beware, Volt Typhoon: Chinese hackers pose clear, present danger to US, says Microsoft",
    "China-backed hacker group spying on US critical systems, warns Microsoft",
    "Five Eyes and Microsoft accuse China of attacking US infrastructure again"
]