[
    "International Business Times",
    "San Francisco Business Journal",
    "@themountaingoats.bsky.social",
    "@lordbusinessman.bsky.social",
    "@brandonleblanc.bsky.social",
    "Musk's X Corp. threatens to sue Meta over Twitter “copycat” Threads",
    "Twitter threatens legal action over Threads app",
    "Twitter Warns Meta Not to Scrape User Data",
    "Google wants a robots.txt equivalent for AI training",
    "Threads App Reaches More Than 30 Million Signups",
    "Twitter threatens Meta with lawsuit over rival Threads app",
    "Twitter threatens to sue Facebook's owner Meta over its new Threads platform",
    "From cage fight to page fight: Twitter threatens to sue Meta after Threads app launch",
    "Meta delivered ‘a major blow’ to Twitter. Will it flip the flailing firm's fortunes?",
    "‘Competition is fine, cheating is not’: Elon Musk after Threads launch",
    "Twitter threatens to sue Meta over rival Threads app, report says",
    "What We Know About Threads, Meta's ‘Twitter Killer’",
    "Twitter Hits Meta With Lawsuit Threat Over Stolen ‘Trade Secrets’",
    "Twitter Accuses Meta of Stealing Trade Secrets for Threads App",
    "Twitter Threatens to Sue Meta Over Alleged Trade Secret Theft With Threads",
    "Twitter threatens to sue Meta after rival app Threads gains traction",
    "Twitter accuses Meta of stealing trade secrets for its new Threads app",
    "Twitter threatens legal action against Meta over Threads",
    "Twitter Accuses Meta of Poaching Employees to Build Threads",
    "Twitter threatens to sue Meta over the new Threads app",
    "Twitter threatens to sue Meta over new app Threads",
    "This Week In XR: Meta, Twitter Tangle Over Threads, New Xreal, Varjo, Bigscreen And BCI XR",
    "Meta responds to Twitter's threat to sue after Threads launch",
    "Twitter Threatens Legal Action Against Meta Over New App ‘Threads’",
    "Musk vs. Zuckerberg Threads throwdown: Twitter threatening to sue over Twitter ‘killer’",
    "Report: Twitter threatens legal action against Meta over Threads",
    "Twitter threatens lawsuit against Meta over Threads",
    "Twitter Threatens Meta With Lawsuit Over Threads",
    "Twitter lawyers threaten Meta with lawsuit over “misappropriated” trade secrets",
    "Threads Becomes Most Rapidly Downloaded App, Raising Twitter's Ire",
    "Twitter warns it could sue Meta over ‘copycat’ Threads app",
    "Twitter sends Mark Zuckerberg a cease-and-desist over Threads",
    "Twitter threatens trade secrets lawsuit over Meta's Threads app",
    "Twitter has reportedly threatened to sue Meta over Threads",
    "Twitter Threatens to Sue Meta's ‘Copycat’ Threads App",
    "The Zuckerberg-Musk rivalry continues with the launch of Meta's ‘Twitter killer’ app",
    "Twitter claims it may file a lawsuit against Meta over the launch of the “copycat” Threads",
    "Meta's pull with Threads may be Twitter's unraveling",
    "Twitter threatens to sue Meta over rival Threads app",
    "How To Download And Join Threads: Meta's New Twitter Alternative",
    "Elon Musk threatens to sue Mark Zuckerberg over Threads",
    "What is Threads on Instagram? All about Mark Zuckerberg's Twitter alternative",
    "Twitter Threatening to Sue Meta Over New Threads App",
    "Twitter spooked by Threads, threatens to sue Meta for hiring employees after Musk fired everyone",
    "I'm not a patent lawyer but I don't think Twitter invented the internet forum.  [embedded post]",
    "Your honor, they owned me.  It's against the law for me to get owned [embedded post]",
    "Is “everyone using our platform sucks” really a “trade secret,” though? [embedded post]",
    "Trade secrets such as “what if there was an app where you could post text” [embedded post]",
    "The Elon-Zuck cage match stakes just went up.  [embedded post]",
    "Threads stole Elon Musk's idea, a social media platform that sucks",
    "When all else fails, sue.  [embedded post]",
    "@AbandonedAmerica@mastodon.social",
    "@TitterDaily Competition is fine, cheating is not",
    "no following tab on threads? uninstalled",
    "🤡 https://www.semafor.com/...",
    "BWA HA HA!! Surprised he didn't use the Winklevoss twins law firm. https://www.semafor.com/...",
    "CAGE FIGHT https://twitter.com/...",
    "Life comes at you fast. https://twitter.com/...",
    "Threads is *definitely* an existential threat for Twitter. https://twitter.com/...",
    "Elon vs. Zuck - Round 1 🥊 [image]",
    "lmao, pay ur twitter vendor bills first elon https://twitter.com/...",
    "how it started, etc [image]",
    "when you're mad that all the employees you fired got new jobs https://twitter.com/...",
    "@RMac18 did the ceo of twitter not get cc'd on the letter. sad.",
    "Twitter has famously never copied any other company. https://twitter.com/...",
    "Maybe Clubhouse should sue over Spaces",
    "@Techmeme @maxwelltani Can you poach employees if they were all let go? 🤔",
    "Twitter is threatening to sue Meta over Threads |  Semafor",
    "Twitter is threatening to sue Meta over Threads",
    "Musk can't compete, threatens to sue Meta over Threads",
    "Twitter threatens to sue Meta over Threads app - report",
    "Musk and Zuck may fight in court: Twitter threatens to sue Meta over Threads",
    "Threads Supplemental Privacy Policy",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "Threads attracts 30M users in 24 hours despite design flaws, privacy concerns",
    "Hands On With Instagram Threads: Does Meta's Twitter Killer Deliver?",
    "Threads accounts are impossible to delete without erasing your Instagram presence",
    "Threads profiles can't be deleted without removing your entire Instagram account",
    "To Delete Threads Account Permanently, You Will Need To Delete Your Instagram Account",
    "How to delete Threads account",
    "Threads' Instagram ‘Trap’ Shows Why Facebook Should Have Been Broken Up Years Ago",
    "Threads account can't be deleted without wiping Instagram too",
    "Deleting your Threads profile will also kill your Instagram account",
    "What Is Threads?  Everything You Need To Know About Meta's New Twitter Alternative",
    "Twitter competitor Threads won't let you delete your account unless you also delete Instagram",
    "Instagram flooded Threads with celebrities and brands at launch",
    "Meta: You can't delete your Threads profile without deleting Instagram",
    "5 things to know about Threads, Twitter's newest rival",
    "Threads already has over 30 million users. But I'm not one of them",
    "PSA: You can not delete Threads profile without deleting Instagram account",
    "Threads already has 30 million users",
    "Threads called a ‘trap,’ must delete Instagram to leave new Meta app",
    "Data Capture in the New Social Media Age",
    "Meta says Instagram users will lose their account if they delete Threads",
    "Want to delete your Threads account? Say goodbye to your Instagram too",
    "How to deactivate your Threads account",
    "The 10 big ways that Threads is totally different from Twitter",
    "Threads feed of people you follow ‘on the list’; can't delete your profile; more",
    "I'm muting this but here's a screenshot [image]",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "https://techcrunch.com/... *laughs maniacally*",
    "Guess I'm stuck with this app...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads profile can only be deleted by deleting Instagram account, Meta says",
    "Threads: Thirty million join Meta's Twitter rival, Zuckerberg says",
    "Instagram's Threads bursts out of the gate with more than 30 million sign-ups",
    "Threads app: Instagram owner's Twitter rival logs 5 million users in first hours",
    "More than 30 million people signed up for Meta's new Threads app",
    "Meta's Threads passed 20 million users within 12 hours, and it's not slowing down",
    "Day After Threads Launches, Twitter Accuses Meta of Using Its Trade Secrets",
    "Threads app: 5 important questions about new Twitter rival answered",
    "Meta launches Twitter rival Threads; gaining 30 million users in just one day",
    "Twitter rival Threads already has 30 million users, Zuckerberg says",
    "Meta's ‘Twitter Killer’ Threads Onboards Millions, But They Could Lose Their Instagram Accounts",
    "Mark Zuckerberg claims Threads will succeed by being more “friendly” than Twitter",
    "Mark Zuckerberg gloats over Threads' 10 million signups",
    "With Threads signups surging past 30M, Zuckerberg notches a win",
    "Threads, Meta's answer to Twitter, surpasses 10 Million users in just seven hours",
    "Instagram's Twitter Copycat Threads Meets Pent-Up Demand",
    "“We wanted flying cars, instead we got 7 Twitter clones.” https://twitter.com/...",
    "Zuck's so openly insanely competitive [image]",
    "Threads at 30M users is legit insane Regardless of who you want to “win” That's nuts",
    "Welp, @FabrizioRomano is on Threads. It's for real [image]",
    "🟡 SCOOP: Twitter is threatening to sue Meta over Threads, @maxwelltani reports.  Read the letter:",
    "we haven't even launched the cool stuff yet!",
    "Arriving on Threads like...",
    "Threads Surpasses 30M Signups",
    "Threads: Ten million join Meta's Twitter rival, Zuckerberg says",
    "Don't Join Threads—Make Threads Join You",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "Meta on the Fediverse: Thread or Opportunity",
    "Meta Says Threads Will Be Part Of The Fediverse: Here's What That Means",
    "Instagram Threads Is a Huge Hit! Here's Why That Should Worry You",
    "honestly shocking to see how hard some people are shilling for meta after the launch of threads",
    "Hey @mosseri, quick question.  What button do I press so I only see the people I follow?",
    "Zuck doing this to Elon during Cancer season is top shelf petty.",
    "Mastodon CEO: What to know about Threads",
    "Zuckerberg-Musk fight is on: Meta launches ‘Twitter Killer’ Threads app",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Threads Does Not Have a Delete Option (Yet), But You Can ‘Deactivate’ a Profile",
    "Threads won't be fun — but it will give brands a refuge from Twitter",
    "Meta Launches Threads, And It's Important For Reasons That Most People Won't Care About",
    "Users Join Threads in Droves",
    "Instagram boss reveals list of “missing” features coming to Threads",
    "Mark Zuckerberg Hard-Launched Threads, and It Worked",
    "How Threads' Privacy Policy Compares to Twitter's (and Its Rivals')",
    "Tens of millions sign up to Twitter rival Threads",
    "Meta's Threads App Surpasses 30 Million Signups #1679",
    "How to use Threads, Instagram's new rival to Twitter",
    "Meta's Threads is a Hot Mess Right Now, but You Should Still Try It",
    "Threads' early hours marked by internet nostalgia as users feel out Twitter rival",
    "Threads, Meta's Twitter competitor, is not yet available in the EU due to regulatory concerns",
    "What is Threads? Here's what you need to know about the potential ‘Twitter Killer’",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "Meta's New Threads App Is Terrible. It Just Might Bury Twitter.",
    "Meta's New Twitter Competitor, Threads, Boasts Tens of Millions of Sign-Ups",
    "Spill Is a New Black-Owned Twitter Alternative. Here's What to Know About the App",
    "Meta's New Twitter Alternative: 5 Things To Know About Threads Before You Sign Up",
    "On threads with the burner. Come find me",
    "IG famous people posting on threads like “morning coffee ❤️” I can't do this??????????",
    "threads is like twitter for people whose criterion channel is netflix",
    "lol Zuck just can't help himself [image]",
    "threads quite quickly giving linkedin energy [video]",
    "first post i seen on threads. already wanna kms [image]",
    "threads feels corporate. all the brands came in with tons of followers",
    "If you needed a reason to join threads, this is it [image]",
    "With great power comes great responsibility.",
    "Lots of work on basic capabilities this morning.",
    "Hi guys!  I'm on time for once",
    "Zuck is salivating as he waits to drop the ads on all his new Threads users 🤣",
    "That @ logo animation when you pull down to refresh js pretty nifty.  👏👏👏",
    "The most surprising thing about the Threads launch to me is still that you can pre-order an app.",
    "Not knowing what app you're on:",
    "Need a ‘Following’ page ASAP",
    "Like this if @zuck should make me CEO",
    "I feel like I'm cheating on twitter 😅",
    "good morning to everyone except for da bomb",
    "Wait so Rabois, Marc and everyone else are going to have to re-block me 😂😂😂",
    "Okay this app is pretty cool but WHY IS THE TEXT SO SMALL",
    "Oh look.  The drama of Twitter is already here.  Hahahah.",
    "Can't get enough of your threads 🎶",
    "How do you work this fuckin thing",
    "Our boss: What's your social strategy for Threads?  Us:",
    "Excellent threads, @lewishamilton.",
    "Great job with this app @zuck !  Love how well it works and how simple it is.",
    "Someone check on the bird app 😈",
    "Me trying to navigate my Threads feed of people I don't follow on Instagram.",
    "me opening any other app right now...",
    "please help make this the first viral threads tweet",
    "I know it's called threads but can we please leave the spool emoji on twitter 🧵",
    "More engagement from 3k followers on here than 5m on Twitter.  Hmmmm",
    "Sorry I'm late, I was threading",
    "@brooklynmarie.bsky.social",
    "You can't post ass, Threads is doomed",
    "Why Threads Is Bad for the News Business",
    "Just call them tweets … July 6, 2023 … Instagram Threads launched last night …",
    "Threads, Meta's Twitter rival, is tracking you in all sorts of ways",
    "Meta launches Twitter rival Threads but faces delays in Europe over privacy concerns",
    "Meta's Advertising Backbone Guarantees Threads' Monetization",
    "Threads vs. Twitter: What's the Difference?",
    "July 6: Meta's New Threads App Is Annoying To Use, But It's Still a Nightmare for Elon Musk",
    "New Twitter CEO takes swipe at new Meta rival Threads",
    "Threads vs. Twitter: 9 biggest differences you need to know",
    "Westminster's tweeters flock to Threads ... as the EU misses out",
    "How to get verified on Instagram Threads",
    "30M People Joined Threads Overnight. Will Advisors Get on Board?",
    "Twitter Threatens To Sue Meta Over Its Threads Competitor",
    "Meta's Threads is a true threat to Musk-owned Twitter, analysts say",
    "in case there's anyone still here, here's what it's like over there https://www.ft.com/...",
    "I'm a mofuckin thread head bitch",
    "If threads is all about discussion, let's jump right in... Pizza Vs Pasta?  😎",
    "is this a place where we capitalize words y/n",
    "lol remember when we all hated meta / facebook and now we're back at it with the new shiny toy",
    "Which one cooler?  🧵🪡 A. Threader B. Threadist C. Threadhead D. Threadmate",
    "The pitch meeting for Threads: “It's Twitter but swap nazis for brands.”",
    "What we love and hate about Threads, Meta's new Twitter clone",
    "Introducing Threads: A New Way to Share With Text",
    "Zuckerberg uses Threads to say Twitter has missed its chance",
    "To Delete a Threads Account, You'll Need to Nuke Your Instagram Account Too",
    "Threads, Meta's Twitter competitor, is now live",
    "Threads app hits Top 5 on Apple's China App Store despite ban",
    "Threads debuts in top 5 spot on App Store in China before inevitable ejection",
    "How to download and get started with Meta's Threads app",
    "Threads already has over 95 million posts",
    "Meta's Threads swiftly signs up 30m users",
    "Buckle up, Reddit: Closed APIs cost more than you'd expect",
    "How to sign up for Threads account from Meta",
    "Meta has launched Twitter rival Threads, snagged 10M signups in hours",
    "Zuckerberg trolls Musk with Spider-Man meme as Threads launches",
    "Threads Privacy Policy Is Already Drawing Criticism",
    "Head of Instagram says placing ads within Threads is “not a priority right now”",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "Must confess to a deep love of fashion & architecture",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "This is getting ridiculous [image]",
    "This and how you have to give it access to your contacts means NFW. https://twitter.com/...",
    "Users in EU can view threads on Threads, but can't sign up. https://www.threads.net/...",
    "Threads is exciting because it's just your classic underdog story",
    "Gosh. Yuk. Hmmmm. Really, Threads? [image]",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "the priority is the mobile apps, but we are working on www",
    "what if @zuck decides to make an electric car next lol",
    "Not followers 10k FRIENDS 🥹",
    "Elon Musk excited that the load on Twitter's servers is going down until he realizes why.",
    "I'm excited to jump into @threadsapp",
    "Zuck you need to be actively shitposting on here to make that happen.  LFG!",
    "Not my style personally, but I'm sure there will be plenty of entertaining content here...",
    "Hope your shoulder is healing.  Can't wait for your next fight!",
    "Excited about my buddy @zuck 's new venture.  Threads...happy to be here.",
    "Bosses joining Threads like:",
    "Ugh I'm ALWAYS a very early adopter and 2303439 feels way late 🥺🥺",
    "Credit where it's due, they pioneered the format and have done great work",
    "There are so many great little design touches in threads.  Really great.",
    "You can start with @rourkery and @briansw but theres more folks ❤️",
    "It's so over, we're so back",
    "Taylor Swift agreed to FTX partnership, but the crypto exchange bailed, source tells CNBC",
    "Taylor Swift reportedly signed $100M deal with FTX but SBF pulled the plug",
    "Taylor Swift Approved Sponsorship Deal With FTX, Despite Previous Reports: NYT",
    "Bad Blood? FTX Called It Off With Taylor Swift, Not the Other Way Around: Reports",
    "Taylor Swift's $100M FTX Deal Dashed by Sam Bankman-Fried, Leaving Her ‘Frustrated’",
    "Crypto Exchange FTX Breaks Taylor Swift's Heart And $100 Million Partnership",
    "Small Banks Don't Like High Rates",
    "turns out taylor swift wasn't as savvy as we all thought huh [image]",
    "Nobody can say no to Sam money https://twitter.com/...",
    "A Too Good To Check classic. [image]",
    "Great story on Tom Brady & FTX https://www.nytimes.com/...",
    "Celebrity Crypto Shilling Is a Moral Disaster https://www.nytimes.com/...",
    "Yes...a tiger and a lion. Right. https://www.nytimes.com/... [image]",
    "TAYLOR SWIFT AGREED TO FTX PARTNERSHIP, DESPITE CONTRARY PUBLIC CLAIMS -CNBC CITING SOURCE",
    "Is there tape of this https://twitter.com/... [image]",
    "Cryptocurrencies went from the future of finance to the future of celebrity lawsuits",
    "NYT: “In reality, Ms. Swift's side signed the sponsorship agreement with FTX”",
    "How Tom Brady's Crypto Ambitions Collided With Reality",
    "Former FTX Lawyer Sued for ‘Wide-Ranging Con Game’",
    "FBI searched former Kraken CEO's home: The New York Times",
    "FBI searched Kraken co-founder's home in March: Report",
    "Feds search crypto exec's home amidst stalking, hacking allegations: NYT",
    "Sounds like they're really Kraken down on him [embedded post]",
    "Hey? Now it's just getting ridiculous. https://twitter.com/...",
    "its all going to ZERO. criminals, grifters, fraudsters. huckers. ZERO. 🧸🎯 https://twitter.com/...",
    "F.B.I. Searched the Home of Crypto Exchange Founder Jesse Powell ( Ex-CEO of Kraken ) [NOMOONS]",
    "Top Binance Executives Quit",
    "Top Binance Execs Leave Company Over CZ's Handling of DOJ Investigation: Report",
    "Binance Crisis Manager, US Employees Leaving Crypto Exchange",
    "Multiple Binance Executives Resign Amid CZ's Handling Of DOJ Probe: Report",
    "Binance's top strategist confirms departure amid reports of US resignations",
    "Multiple senior executives at Binance resign amid ongoing regulatory challenges",
    "Binance's Senior Executives Quit Over Changpeng Zhao's Handling Of Investigations",
    "Binance is in full-on turmoil. https://fortune.com/...",
    "Right when we expect things to slow it just gets busy. Not a great look! https://twitter.com/...",
    "@MilkRoadDaily Definitely false, only one this week. They exaggerate everything.",
    "“what justice department investigation?” https://fortune.com/...",
    "$COIN trading at $16.4B market cap https://twitter.com/...",
    "hahah NOW Patrick quits? https://twitter.com/...",
    "14) How did Binance fall apart ? Slowly and then all at once. https://twitter.com/...",
    "Rats, ship https://twitter.com/...",
    "Why can't they just say 4? https://twitter.com/...",
    "Hey @cz_binance - 4 or is this legit? https://twitter.com/...",
    "Heading 4 the door https://twitter.com/...",
    "be pretty fun to see SBF and CZ sharing a cell https://twitter.com/... [image]",
    "Probably nothing https://twitter.com/...",
    "GPT-4 API general availability and deprecation of older models in the Completions API",
    "OpenAI launches its GPT-4 API into general availability",
    "OpenAI makes GPT-4 generally available to all paid API customers",
    "Fine-tuning is coming to GPT-4 and GPT-3.5 later this year — huge! https://openai.com/...",
    "OpenAI Makes GPT-4 Generally Available",
    "DigitalOcean Acquires Paperspace to Expand AI Offerings",
    "DigitalOcean Buys Paperspace To Boost AI Capabilities",
    "DigitalOcean Buys Paperspace for $111m to Add AI Offerings",
    "Paperspace Joins DigitalOcean",
    "DigitalOcean ramps up AI offerings via Paperspace deal for $111M",
    "DigitalOcean acquires Paperspace (YC W15) for $111M in cash",
    "DigitalOcean Acquires Cloud Computing Startup Paperspace For $111M",
    "Volkswagen will test its driverless vehicles in Austin",
    "Volkswagen to launch self-driving vehicles in Texas by 2026",
    "Volkswagen will start testing self-driving cars in Austin as it moves on from Argo AI",
    "VW selects Austin as U.S. hub for self-driving tests; ID Buzz electric vans to hit city streets",
    "VW to start autonomous ride-hailing tests this month in Austin, Texas",
    "Volkswagen bringing self-driving vehicle tech to Austin",
    "VW launches ID. Buzz autonomous test program in Austin",
    "VW kicks off its first US autonomous driving pilot with ID. Buzz EVs",
    "Volkswagen's Self-Driving Cars Begin Testing In Texas",
    "First U.S. Volkswagen ID Buzz EVs Arrive in Austin, With a Catch",
    "Volkswagen to start testing self-driving ID Buzz vans in Austin",
    "Volkswagen is launching its own self-driving car testing program in the U.S.",
    "Volkswagen will start testing its driverless ID. Buzz in Austin, Texas",
    "VW will test its autonomous ID Buzz in the US starting this month",
    "Report: Google's first fully custom Pixel chip, Tensor G5, coming 2025 from TSMC",
    "Google's first truly custom chip for Pixel devices won't arrive until 2025",
    "Google's first fully-custom Pixel smartphone chip delayed until 2025",
    "Google delays release of fully custom phone chip until 2025 - The Information",
    "Google's first fully custom Pixel chip has been delayed to 2025: report",
    "Google's Custom Pixel Chip Development Delayed Until 2025, Switching Production to TSMC",
    "Report says when we can expect the first fully customized Google Tensor chip for the Pixel",
    "Google will reportedly use TSMC to make its first custom Pixel chip; delayed to 2025",
    "Google might not go full-custom with its Tensor chips until 2025",
    "Google reportedly delays release of fully custom phone chip until 2025",
    "Mergers: Commission opens in-depth investigation into the proposed acquisition of iRobot by Amazon",
    "EC Opens Investigation of Amazon's Planned Acquisition of iRobot",
    "European Commission launches investigation into Amazon's acquisition of iRobot",
    "Amazon's iRobot Roomba acquisition under formal EU investigation",
    "EU Launches “In-Depth” Investigation of Amazon's iRobot Acquisition",
    "OpenAI is still banging on about defeating rogue superhuman intelligence",
    "Free compensation benchmarking data from 3,000 startups",
    "US Spies Are Buying Americans' Private Data.  Congress Has a New Chance to Stop It",
    "TikTok Music streaming service goes live in Brazil and Indonesia",
    "TikTok Announces Its Streaming Music Platform, TikTok Music",
    "TikTok Launches New Music Streaming Service in Brazil, Indonesia",
    "TikTok Launches Music-Streaming Service in Brazil and Indonesia",
    "Mastercard leverages its AI capabilities to fight  real-time payment scams",
    "Mastercard has developed a new AI tool to prevent scams",
    "MasterCard empowers UK banks to combat payment fraud with AI-powered solution",
    "Mastercard launches new AI real-time anti-fraud tool in UK",
    "Personalized wealth management, built for tech people",
    "Talent redeployment: Ensure good talent grows with your company's needs",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Lightmatter: Next-gen computing built for AI.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Thu. 07/06 - Uh, Did Threads Just Win?",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "NY Fed, big banks report success with centralized blockchain payments",
    "NY Fed: Digital Dollar Could Improve Cross-Border Payments",
    "Big Banks, NY Fed's Innovation Group See Merit in Digital Ledgers for Global Payments",
    "NY Fed and financial firms report success with early digital assets payments",
    "NY Fed Says Months-Long Test on Digital Dollar Shows Speed Advantage 1",
    "Telexistence Raises USD 170M (JPY 23Bn) Series B",
    "Japanese robotics startup Telexistence raises $170m from SoftBank, others",
    "Telexistence Raises $170M in Series B Funding",
    "SoftBank, Foxconn buy into Japan shelf-stocking robot startup",
    "Retail robotics startup Telexistence raises $170M",
    "Clair, scoops $175m for a novel, on-demand payment solution",
    "PE Firm Buys Controlling Stake in Worldpay at $18.5 Billion Valuation",
    "Worldpay by FIS adds eftpos capabilities",
    "Private equity firm GTCR buys majority stake valuing Worldpay at $18.5B",
    "FIS sells majority stake of Worldpay to GTCR for $18.5 billion",
    "FIS to sell Worldpay stake to GTCR",
    "Venture capital exits have plummeted in 2023 despite hopes for a rise",
    "So hard to believe it's just -50% [embedded post]",
    "TSMC: Chinese Curbs on Rare Metal Exports Will Not Have Immediate Effect",
    "China says it told the U.S. and Europe about the export controls in advance",
    "TSMC says China's raw material export restrictions won't hurt — for now",
    "Asian chipmakers' nightmare is China's export curbs",
    "China export ban on Galium and Germanium changes the course of the tech war",
    "China plays a trump card in the chip war, but Apple chip production unaffected so far",
    "US opposes China's export controls, saying they justify supply chain moves",
    "US Military Is Training AI to Give Orders and Handle State Secrets",
    "@Techmeme @KatrinaManson 😂",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "New York employers must now tell applicants when they encounter AI",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "@nitashatiku@mastodon.social",
    "How elite schools like Stanford became fixated on the AI apocalypse",
    "CFTC Finds Celsius Network and Former CEO Alex Mashinsky Violated US Rules",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "Celsius CEO Found Guilty — Should Creditors be Worried About Getting Funds Back?",
    "CFTC Investigators Conclude Celsius And Former CEO Violated Rules, Potential Case Looms",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Samsung Announces Galaxy Unpacked 2023 Event: Expect New Flagships and Smartwatches",
    "Samsung teases the Galaxy Z Flip 5's best feature",
    "Enjoy the Samsung Unpacked lineup from all angles and in all colors ahead of launch",
    "Samsung's folding phones will be Unpacked on 26 July",
    "Samsung's upcoming Unpacked lineup leaked in renders",
    "Our Plan for a Sustainably Open Social Network",
    "Purchase and Manage Domains Directly Through Bluesky",
    "Custom Domain Names as Bluesky Handles — Fun Feature, and Now a Business Model",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "Twitter competitor Bluesky raises $8M; launches paid custom domains in a bid to remain sustainable",
    "Decentralized social network Bluesky announces $8M seed round and paid service",
    "Bluesky shares seed round, Threads launches, Twitter becomes money transmitter",
    "Superintelligence got you down? Open AI is on the case",
    "OpenAI Launches New “Superalignment” Team to Protect against Rogue AI",
    "AI firms should face prison over creation of fake humans, says Yuval Noah Harari",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/..."
]