[
    "@securopean@infosec.exchange",
    "Zuck thinks Vision Pro is for rich, lonely people",
    "Why Mark Zuckerberg Isn't Sold On Apple's Vision Pro Headset",
    "Zuckerberg Gives His First Reaction to Apple's Vision Pro",
    "Apple's pitch for the Vision Pro couldn't be more different than the Meta Quest",
    "Apple Headset Debut Has Potential To Make Meta's More Desirable",
    "Here's What Zuckerberg Told Meta Staff He Thinks Of Apple Vision Pro",
    "Mark Zuckerberg does not feel intimidated by Apple Vision Pro",
    "Mark Zuckerberg shares his thoughts on the Apple's Vision Pro",
    "‘Already explored’ — Apple Vision Pro fails to impress Mark Zuckerberg",
    "Apple Vision Pro is unsociable and expensive... says Meta's Mark Zuckerberg",
    "Meta CEO Mark Zuckerberg says Apple Vision Pro is too expensive and anti-social",
    "Mark Zuckerberg is not impressed with Apple Vision Pro",
    "Mark Zuckerberg says new Apple Vision Pro headset doesn't have any ‘magical solutions’",
    "“$3,500?!  For a headset?!”  —  Mark Zuckerberg makes the Steve Ballmer iPhone mistake...",
    "Mark Zuckerberg isn't impressed with Apple's Vision Pro: Here's what Meta's CEO said",
    "Zuckerberg: So what's so hot about Apple's counter to Meta's much cheaper Quest?",
    "Mark Zuckerberg reportedly not impressed with Apple Vision Pro: ‘Not the future that I want’",
    "Zuckerberg: Apple Vision Pro is not my idea of VR, gen AI is coming to Instagram",
    "Here's how Meta's Mark Zuckerberg reacted to Apple's Vision Pro",
    "Mark Zuckerberg Gave His Opinion On Apple's Vision Pro, And It's Not Very Flattering",
    "Mark Zuckerberg Says Apple Vision Pro Has No ‘Magical Solutions’",
    "Mark Zuckerberg Jabs at Apple's Mixed Reality Headset",
    "Zuckerberg on Vision Pro: Could be the ‘future of computing’ but ‘not the one that I want’",
    "@SupBagholder This is a really good take from Zuck. Different visions, different products.",
    "Strong Ballmer vibes https://twitter.com/...",
    "Facebook owner to push ahead with plans to launch Twitter rival",
    "Meta's Twitter Alternative Will Probably Be Called ‘Threads’",
    "Meta Reveals Twitter Competitor It Plans to Launch as Stand-Alone App",
    "Meta jabs Elon Musk as it reveals new, Twitter-like app: a platform that is sanely run'",
    "Instagram's future Twitter competitor leaked, but does it stand a chance?",
    "Meta unveils what Instagram's Twitter rival will look like",
    "Instagram is serious and its Twitter rival app is ready!",
    "Instagram's Twitter rival will be ‘sanely run,’ and here's what it looks like",
    "Meta's Twitter Alternative is Coming Soon, According to a New Internal Briefing on the App",
    "Meta may soon reveal Threads, its Twitter competitor built on ActivityPub",
    "Here's A Look At Instagram's Upcoming Twitter Competitor",
    "Screenshots of Instagram's answer to Twitter leak online",
    "Meta's Twitter alternative app leaks in screenshots",
    "New leak gives us another look at what Instagram's Twitter competitor will look like",
    "Meta's version of Twitter is just the comments section from Instagram",
    "Pretty stoked for this. https://twitter.com/...",
    "After a Rocky Year, Zuckerberg Lays Out Meta's Road Map to Employees",
    "Struggling Meta showcases new AI tools at company meeting",
    "Meta's first generative AI feature will be AI stickers in Messenger",
    "Mark Zuckerberg plans to put AI features into Facebook, Instagram, and WhatsApp",
    "Zuckerberg shares AI products to reassure employees of strategy",
    "Meta previews generative AI chatbot planned for Whatsapp and Messenger at company all-hands",
    "Meta huddle: Zuckerberg unveils AI tools and snubs Apple headset",
    "Mark Zuckerberg plans to integrate AI technology ‘into every single’ Meta platform",
    "#383 Mark Zuckerberg: Future of AI at Meta, Facebook, Instagram, and WhatsApp",
    "Mark Zuckerberg lays out Meta's grand ambitions for generative AI",
    "Mark Zuckerberg Shares AI Products to Reassure Workers of Strategy",
    "Silicon Valley Business Journal",
    "Meta has seen some ‘incredible breakthroughs’ in AI, CEO Mark Zuckerberg said",
    "Zuckerberg shows off AI products in bid to reassure staff",
    "Mark Zuckerberg says generative AI is coming to ‘every single one of our products’",
    "Mark Zuckerberg reveals plans to add AI into Facebook & Instagram",
    "Zuckerberg says Meta building generative AI into all its products, recommits to ‘open science’",
    "that's not going to cause any issues, not at all https://twitter.com/...",
    "Binance.US Set to Be Cut Off From Banking System After SEC Suit",
    "Binance.US Halts USD Deposits, Blames SEC's ‘Witch-hunt’",
    "Binance.US To Suspend All USD Deposits And Withdrawals",
    "Binance US Shifts to ‘Crypto-Only’ Operations Amid Intensified SEC Scrutiny",
    "BinanceUS suspends USD deposits and withdrawals",
    "Binance.US Suspends All USD Deposits Following SEC Lawsuit",
    "Binance.US Suspends All USD Deposits Following SEC lawsuit",
    "Binance.US Suspends Use of Fiat as Legal Troubles Mount",
    "Breaking: Binance.US suspends USD deposits, warns of fiat withdrawal pause",
    "Bitcoin is showing great resilience as it enters a new era",
    "Binance.US to halt all fiat withdrawals ‘as early as June 13’",
    "Binance.US Suspends USD Deposits Amidst SEC Lawsuit",
    "Binance Halts Trading in Dollars on Its U.S. Exchange",
    "Binance Withdrawals: Exchange Suspends USD Deposits as Banking Partners Mull Fiat Pause",
    "Game Over: Binance US Loses Access to the USD Banking Network, Halts US Dollar Deposits",
    "Banks Abandoning Binance.US as SEC Legal Battle to Begin",
    "Binance.US suspends USD deposits following SEC pressures",
    "Binance.US Signals Cutting Off From Banking Partners, Liquidity Crisis Ahead?",
    "Binance US Stops All USD Transfers As SEC Intimidates Bank Partners",
    "Binance US' Banking Partners To Suspend USD Withdrawals By June 13",
    "Banks cut fiat on-ramps for Binance US, dollar deposits suspended",
    "BinanceUS suspends USD deposits, says bank partners will pause dollar payments next week",
    "Binance.US announces USD deposits suspension, pauses fiat withdrawal channels",
    "Binance.US faces cut from banks amid SEC lawsuit",
    "Binance.US to go ‘crypto-only’ as banking partners cut ties",
    "Binance.US suspends U.S. dollar deposits, to pause fiat withdrawal channels",
    "Binance.US suspends USD deposits, halting fiat withdrawal channels",
    "The crackdown continues. The walls are closing in. https://www.reuters.com/...",
    "Ed Zitron's Where's Your Ed At",
    "Cryptogeddon  —  If you are wilfully violating securities law, I have some advice: do not put …",
    "Elizabeth Warren Says Binance Appears to Have Lied to Lawmakers",
    "Binance.US Was Deeply Unprofitable in 2022, Documents Show",
    "SEC homes in on secretive trading arms controlled by Binance chief",
    "How US SEC And Court To Deliver Legal Papers To Binance And CEO “CZ”?",
    "BinanceUS to suspend dollar deposits, Vitalik pledges $100m to Covid relief",
    "Bitcoin, Ether rise amid ‘swoon-soar’ trading after SEC lawsuits against Binance, Coinbase",
    "Binance.US clarifies CoinDesk claim about user funds and platform security",
    "Binance Redirected $12B to Firms Controlled by CEO Changpeng Zhao, SEC Says",
    "CZ denies holding firms received $12B of Binance.US user funds",
    "Documents Reveal Binance.US Suffered a $181 Million Loss in 2022",
    "SEC Seeks To Freeze Binance.US Assets Hours After Filing Lawsuit Against the Crypto Exchange",
    "SEC Report Exposes Binance CEO's $12 Billion Money Trail to Personally Controlled Firms",
    "SEC summons CZ, more Binance dirty laundry exposed",
    "Binance Money Trail Reveals $70 Billion Flowing Through Silvergate, Signature",
    "Binance Moved Billions Through Two U.S. Banks, Regulators Say",
    "Statement from Paxos spox: https://twitter.com/... [image]",
    "@jonkeegan@mastodon.social",
    "How to maintain targeting capabilities even without Google Ads similar audiences",
    "How do advertisers love thee?  Let us count the 650,000 ways.We all probably …",
    "Examining LGBTQ+ representation in media and advertising",
    "Meta Provides Tips on Effective Audience Creation for Your Campaigns [Infographic]",
    "CVE-2023-2868: Total Compromise of Physical Barracuda ESG Appliances",
    "Barracuda tells customers to rip out vulnerable hardware as experts size up the damage",
    "Barracuda urges customers to remove and replace vulnerable hardware exploited by hackers",
    "Barracuda: Immediately rip out and replace our security hardware",
    "Barracuda ESG users told to throw away their hardware",
    "Barracuda says hacked ESG appliances must be replaced immediately",
    "ACT government falls victim to Barracuda's ESG vulnerability",
    "Barracuda tells its ESG owners to ‘immediately’ junk buggy kit",
    "Breach Roundup: Barracuda Networks Recalls Hacked Appliances",
    "Barracuda Warns All ESG Appliances Need Urgent Rip & Replace",
    "Barracuda: Customers Must Replace Impacted Email Security Devices ‘Immediately’",
    "Barracuda Networks says hacked devices “must be immediately replaced” despite patches",
    "Barracuda now says you'll have to replace your ESG device right away",
    "Spotify is testing an ‘offline mix’ that downloads recently played songs",
    "Feature Request: Apple Music downloaded music should be automatically restored",
    "Spotify is officially testing an offline mix",
    "Apple Music should steal this upcoming Spotify feature",
    "Youtube Music has this since years https://twitter.com/...",
    "📣 Apollo will close down on June 30th. …",
    "Reddit's API changes kill Android's best third-party apps, including RIF and Sync",
    "Apollo to shut down; developer has receipts",
    "Apollo for Reddit is shutting down",
    "Reddit's new API pricing will kill off Apollo on June 30",
    "3rd-Party Reddit App Apollo Forced to Shut Down Due to API Charges",
    "Apollo service to shut down on June 30 following Reddit's change of API policy",
    "christianselig/reddit-call-may-31- transcript-end.md  —  You must be signed in to fork a gist",
    "Reddit CEO will host an AMA on API changes as thousands of subreddits plan to ‘go dark’",
    "Apollo shutting down due to Reddit's unaffordable API",
    "It's not just Apollo: other Reddit apps are shutting down, too",
    "iOS app Apollo shuts down on June 30, and it's all Reddit's fault",
    "Reddit's absurd API price forcing Apollo to shut down on June 30",
    "Third-Party Reddit App to Shut Down",
    "Apollo Shutting Down June 30th",
    "It's time to say goodbye to your favorite Reddit apps",
    "Following in Apollo's footsteps, Reddit is Fun will be shutting down on June 30",
    "Apollo app to shut down as Reddit API dispute somehow gets uglier",
    "Reddit is Fun, Sync for Reddit to Shutdown Because of reddit API Changes",
    "Apollo, a Reddit app featured during WWDC, is being shuttered",
    "Reddit API change kills fan favorite third-party client Apollo",
    "Reddit App Apollo to Shut Down Amid $20 Million API Spat",
    "Popular Third-Party Reddit App Apollo Will Shut Down June 30",
    "Reddit's Greed Just Killed The Site's Best Third-Party App",
    "Popular Reddit App Apollo Is Shutting Down on June 30",
    "Reddit app Apollo will officially shut down June 30 (Update: more apps)",
    "Apollo for Reddit is shutting down later this month due to new API pricing",
    "Apollo, the Best Reddit App, Is Shutting Down Because of Reddit's New Fees",
    "Reddit app ‘Apollo’ is shutting down over Reddit's expensive API prices",
    "Popular third-party Reddit app Apollo is shutting down as a result of Reddit's new API pricing",
    "Apollo, Popular Reddit App, To Shut Down June 30 Following API Price Surge 1",
    "Apollo to Shut Down on June 30 Because of Reddit API Changes",
    "Whoa.  I hadn't heard about this.  It sounds like Reddit is going Muskian.  —  Concerning.",
    "First Tweetbot and now Apollo. 😢 https://twitter.com/...",
    "Finally I am free from Reddit https://twitter.com/...",
    "After being a daily user since 2008, I'm just about done with Reddit https://twitter.com/...",
    "In a shocking turn of events, Netflix subscriptions rise after password-sharing crackdown",
    "Netflix Added Subscribers After Password Crackdown, Research Firm Says",
    "The Netflix password-sharing crackdown we all hate is actually working",
    "Is Netflix's Anti-Password Sharing Too Unpopular?",
    "U.S. Senator Christopher Coons …",
    "Stanford Cyber Policy Center",
    "@justinhendrix@mastodon.social",
    "Platform Accountability and Transparency Act",
    "Romney, Colleagues Introduce Legislation to Increase Transparency Around Social Media Platforms",
    "U.S. Senator Christopher Coons of Delaware",
    "CPC Experts Submit Comments in Response to Digital Services Act Call",
    "To Close the Math Achievement Gap, We Must Recognize What Students Bring to the Classroom",
    "Not Just Math Quizzes: Khan Academy's Tutoring Bot Offers Playful Features",
    "TikTok owner ByteDance is testing AI chatbot to challenge ChatGPT",
    "TikTok bans explained: Everything you need to know",
    "U.S. Senators Think TikTok's CEO Lied to Congress",
    "yes it is just not dialed in quite right that is the issue  —  jfc",
    "Effortless transactions, effortless approvals: Integrating Zoho Sign with Zoho Finance apps",
    "Ex-SEC attorney says to ‘get out of crypto now’ amid regulatory offensive",
    "Bitcoin Price and Ethereum Prediction: US SEC Lawsuit, FTX Bankruptcy, and BitGo Updates Unveiled",
    "Crypto Industry Faces Regulatory Turmoil as SEC Chairman Gary Gensler Files Lawsuits",
    "Disney's Hotstar to offer free mobile cricket streaming in India to take on Reliance's JioCinema",
    "Disney+ Hotstar Follows JioCinema, To Stream Asia Cup, Cricket World Cup For Free",
    "Disney+ Hotstar to offer free mobile live stream of World Cup, Asia Cup",
    "Disney+ Hotstar to Give Free Access to Cricket Tournaments",
    "FTX's US Judge Vows to Keep Control of Crypto in Blow to Bahamas",
    "US Judge Asserts Control over FTX's Crypto Assets, Challenging Bahamas' Liquidators",
    "FTX U.S. judge expresses doubts about parallel Bahamian bankruptcy",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/08 - The Gloves Come Off In The Binance Case",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "DOCU Shares Up 5% as DocuSign Beats Q1 2024 Earnings Estimate with Strong Guidance",
    "DocuSign shares rise on earnings beat and strong guidance",
    "DocuSign Announces First Quarter Fiscal 2024 Financial Results",
    "DocuSign Says It's an AI Winner. Why ChatGPT Isn't a Threat.",
    "Why DocuSign Stock Is Surging After Hours",
    "DocuSign Shares Climb With Turnaround Efforts Under Way",
    "DocuSign 1Q Revenue Tops Estimates, Swings to Profit — Earnings Review",
    "DocuSign Shares Soar on Strong Revenue and Billings",
    "Granica launches from stealth with AI efficiency platform and $45M in funding",
    "More Google Contract Workers Seek to Unionize",
    "We are unionizing. https://www.bloomberg.com/...",
    "Announcing EvenUp's $50.5M Series B, Litify Integration, and our new AI Litty.",
    "Legal AI company EvenUp raises $50 mln at $325 mln valuation",
    "EvenUp Raises $50.5M in Series B Funding",
    "Blackpoint Raises $190 Million to Help MSPs Combat Cyber Threats",
    "How AI can help India's healthcare system in cybersecurity? Experts say this",
    "Blackpoint Gets $190M from Bain Capital to Boost MSP Defense",
    "Blackpoint Cyber raised $190M in Bain Capital-supported Series C",
    "Blackpoint Cyber raises $190 million to fund further development of its security technology",
    "Taiko Alpha-3 Testnet is Live",
    "Taiko Labs raises $22 million in funding to build an Ethereum-equivalent (Type 1) ZK-EVM",
    "Mercedes becomes the first automaker to sell Level 3 self-driving vehicles in California",
    "California certified as next US state to allow Mercedes' Level 3 autonomous DRIVE PILOT",
    "Mercedes achieves SAE Level 3 self-driving certification in California, but there's a catch",
    "Mercedes-Benz is first to get approval to sell partially autonomous vehicles in California",
    "California DMV conditionally approves Mercedes-Benz's automated driving tech",
    "Introducing Google's Secure AI Framework",
    "Google launches Secure AI Framework to help secure AI technology",
    "Google Launches Framework to Secure Generative AI",
    "Google Introduces SAIF, a Framework for Secure AI Development and Use",
    "AI: Google seeks to regain lost ground",
    "Google lays out its vision of securing AI",
    "Google releases plan to protect you from AI threats",
    "Google releases Secure AI Framework to help companies protect AI models from hacking",
    "What Are Security Automation Systems and Why Do You Need Them?",
    "New ways Google is helping local news",
    "Google to launch News Showcase product in U.S.",
    "Google to Launch Long-Delayed News Showcase Product in U.S. This Summer",
    "US To Get Google News Showcase & Updated Google News Follow Tab",
    "Google News Showcase coming to the US and updates to follow tab on Google News",
    "Google News Showcase Lands in US, Lowering Some Paywalls in the Process",
    "Google News Showcase Is Coming to the US This Summer",
    "Google Bringing Program That Pays News Publishers to the US",
    "Google promises more money and more exposure for local news",
    "Snowden Warns Today's Surveillance Technology Makes 2013 Look Like 'Child's Play'",
    "10 years after Snowden's first leak, what have we learned?",
    "Ten Years Ago, Edward Snowden Warned Us About State Surveillance",
    "Techtris - Edward Snowen ten-year anniversary edition",
    "What's really changed 10 years after the Snowden revelations?",
    "Rishi Sunak's AI summit: what is its aim, and is it really necessary?",
    "UK to host first global summit on Artificial Intelligence",
    "UK's plans for global AI safety summit draw criticism",
    "UK announces global summit to discuss safety measures for AI",
    "UK to Lead Global Discussions on AI Safety with First Major Summit",
    "UK not too small to be centre of AI regulation, says Rishi Sunak",
    "The world must not wait for one more Hiroshima to regulate AI",
    "Britain, U.S. to work together on AI safety, says Sunak",
    "UK will host global AI summit to address potential risks",
    "UK's AI safety summit gets thumbs up from tech giants",
    "Sunak Seeks Biden's Backing on AI After UK Left Out of Key Talks",
    "Stay ahead in AI race, tech boss urges West",
    "Britain to host first global AI regulation summit in autumn",
    "Britain to host first global summit on artificial intelligence safety",
    "Introducing WhatsApp Channels",
    "Introducing WhatsApp Channels. A Private Way to Follow What Matters",
    "WhatsApp now has channels like Telegram: Heres all you need to know",
    "WhatsApp Launches One-to-Many Channels Feature",
    "WhatsApp Channels could be a new way for artists to ping fans",
    "WhatsApp Launches Channels Feature Officially",
    "WhatsApp Launches Channels To Streamline Information Exchange",
    "WhatsApp is rolling out Telegram-like Channels",
    "WhatsApp Channels feature might be attempt to become the new Twitter",
    "WhatsApp Announces One-Way Broadcast ‘Channels’ for Following People and Organizations",
    "WhatsApp Update: Check Out These Two Upcoming Features",
    "WhatsApp Launches Broadcast Channels to Capitalize on Rising DM Engagement",
    "Did WhatsApp just eat Twitter's lunch with a new Channels feature?",
    "WhatsApp is adding a Channels feature to let you broadcast messages",
    "WhatsApp unveils ‘Channels’ to help you stay on top of important updates",
    "WhatsApp Introduces Channels Feature to Take on Twitter With One-Way Broadcast",
    "WhatsApp's Channels Brings Social Media to the Popular Messaging App",
    "Meta's WhatsApp aims to build ‘the most private broadcast service’ in the world",
    "WhatsApp Rolls Out Channels, Taking One More Step Toward Traditional Social Media",
    "WhatsApp Introduces Channels [Video]",
    "WhatsApp is getting a new Twitter-style feed that it really doesn't need",
    "WhatsApp's New Channels Let Users Follow Updates From Organizations",
    "WhatsApp Debuts ‘Private Broadcasting’ Feature ‘Channels’",
    "WhatsApp announces new feature to broadcast your messages",
    "Meta Soon to Bring Broadcasting Tool ‘Channels’ for WhatsApp",
    "WhatsApp launches ‘Channels’; expected to roll out in India in coming months",
    "WhatsApp Introduces Channels That Allow You to Follow Important Updates",
    "WhatsApp launches Channels feature for broadcast messages",
    "Meta introduces broadcast tool Channels on WhatsApp",
    "WhatsApp Channels feature starts rolling out: What it is, 30-day expiry, admin controls and more",
    "WhatsApp introduces Channels: what is it, how it works",
    "WhatsApp announces ‘Channels’, one-way tool to share updates with followers",
    "WhatsApp introduces Channels, calls it a private way to follow what matters",
    "WhatsApp Adds Channels Where You Can Follow Teams, People, Groups",
    "WhatsApp adding Twitter-like ability to follow with new ‘channels’ feature",
    "WhatsApp announced channels, a new one-way broadcast private tool",
    "Today we're announcing WhatsApp Channels — a private way to follow people and organizations …",
    "OpenAI sued for defamation after ChatGPT fabricates legal accusations against radio host",
    "Man sues OpenAI claiming ChatGPT ‘hallucination’ said he embezzled money",
    "Another defamation case against OpenAI in US, complainant claims to be victim of AI hallucination",
    "OpenAI Sued For Defamation Over ChatGPT ‘Hallucination’; But Who Should Actually Be Liable?",
    "Man Sues OpenAI Claiming ChatGPT ‘Hallucination’ Said He Embezzled Money",
    "OpenAI Sued for Libel After ChatGPT Allegedly Accuses Man of Embezzlement",
    "OpenAI sued for defamation after ChatGPT allegedly fabricated fake embezzlement claims",
    "OpenAI's ChatGPT Gets Sued: A Landmark Case in AI Litigation",
    "Financial Conduct Authority",
    "FCA introduces tough new rules for marketing cryptoassets",
    "FCA introduces stricter rules for digital currency promotions",
    "U.K. financial watchdog to ban promotional incentives",
    "Crypto ads will need to carry risk warnings under new UK rules",
    "Free Promotional Crypto & NFT Airdrops to be Banned in UK",
    "Crypto ads face stricter rules, referral bonus ban by UK FCA",
    "FCA Debuts ‘Significant Change’ to Crypto Marketing Rules",
    "New crypto traders need ‘cooling-off’ period rules UK watchdog",
    "UK Financial Conduct Authority Clamps Down on Crypto Marketing",
    "New UK Regulations Require Crypto Ads to Carry Risk Warnings",
    "UK gets new rules to regulate crypto sector",
    "UK FCA Proposes Ban on Crypto Incentives in Tough New Marketing Rules",
    "UK's FCA Releases New Crypto Marketing Rules",
    "UK plans to force ‘high risk’ warnings on crypto adverts",
    "Zumo Founder Comments on FCA Crypto Marketing Rules",
    "New UK Crypto Investors Face ‘Cooling-Off Period’ Under FCA Rules",
    "UK clamps down on cryptocurrency sector",
    "FCA's new crypto advertising rules met with mixed industry response",
    "GC23/1 Cryptoasset financial promotions: Guidance for firms",
    "Google employees rally against three-day office mandate, citing disregard for professionalism",
    "Google makes office attendance part of performance reviews",
    "Google to crack down on office attendance, asks remote workers to reconsider",
    "Google Says Office Attendance Will Count in Performance Reviews",
    "Google reveals stricter new measures in drawn-out crackdown on hybrid work",
    "Google Cracks Down On Work From Home, Tells Workers To Return To The Office",
    "Google is tightening its remote-work policies and plans to monitor employees' in-office attendance",
    "Google Union Pushes Back on Three-Day Return-to-Office Mandate",
    "Google to start factoring office attendance into performance reviews",
    "Google HR hounds threaten ‘next steps’ for slackers not coming in 3 days a week",
    "Google to Employees: Get Your Butts Into the Office",
    "Google Says It's Time to Come Back to the Office",
    "Google warns hybrid workers about attendance, asks remote staff to consider coming back",
    "Google cracks down on hybrid working - and will track staff attendance",
    "To fill offices, Google issues ultimatum while Salesforce tries charity",
    "Unfortunately this is going to set a bad precedent.  Watch other companies follow this pattern :-("
]