[
    "Introducing the ChatGPT app for iOS",
    "OpenAI ChatGPT 12+  —  iPhone Screenshots",
    "OpenAI launches an official ChatGPT app for iOS",
    "ChatGPT gets first official app on iOS, Android app not far behind",
    "ChatGPT launches iPhone app for iOS; Android coming soon",
    "A Look Inside The New ChatGPT iPhone App From OpenAI",
    "OpenAI introduces ChatGPT app for iOS, bringing most popular AI chatbot to iPhones",
    "OpenAI launches official ChatGPT app for iOS, Android coming ‘soon’",
    "How to force restart an app on iPhone",
    "OpenAI releases iPhone version of ChatGPT",
    "OpenAI launches free ChatGPT app for iOS",
    "OpenAI launches ChatGPT app for iOS, Android coming soon",
    "OpenAI releases official ChatGPT app for iOS; coming soon to Android",
    "OpenAI to introduce ChatGPT app for iOS",
    "OpenAI's new ChatGPT app is free for iPhone and iPad",
    "OpenAI Releases ChatGPT App for iOS",
    "OpenAI launches a ChatGPT app for iOS, with an Android version coming soon",
    "ChatGPT now has an official iPhone app",
    "ChatGPT Now available as an iPhone App",
    "ChatGPT makes its debut as a smartphone app on iPhones",
    "The U.S. is getting a ChatGPT app on iOS devices",
    "ChatGPT creator releases iPhone app in step toward broader consumer appeal",
    "ChatGPT Goes Mobile With iOS App",
    "OpenAI launches an iOS app for ChatGPT",
    "OpenAI Releases Official ChatGPT App for iPhone",
    "OpenAI's ChatGPT has an app now, and it lets you speak prompts",
    "OpenAI's new ChatGPT app for iOS got here just in time",
    "OpenAI launches ChatGPT app for iPhone users",
    "OpenAI's ChatGPT now has an official iPhone app with an Android version coming soon",
    "Now Available for iPhones: ChatGPT App",
    "OpenAI Has Announced “ChatGPT” For iOS, Includes Several New Features",
    "OpenAI launches ChatGPT app for iOS that accepts voice prompts, Android coming soon",
    "A standalone ChatGPT app lands on iOS, and Android users are next in line",
    "ChatGPT just got an official iPhone app — how to try it now",
    "OpenAI just released an official ChatGPT app for the iPhone",
    "OpenAI Releases Official ChatGPT App for iOS, Syncs Your Conversations and Supports Voice Input",
    "OpenAI debuts ChatGPT app for iPhone, Android version coming soon",
    "Here's the best way to access ChatGPT on your iPhone",
    "The official ChatGPT app for iPhones is here",
    "You can download ChatGPT on iOS for free right now",
    "ChatGPT's Official App For iPhone Arrives In The App Store",
    "OpenAI Launches ChatGPT App for Apple iOS",
    "ChatGPT will get an official Android app ‘soon’",
    "OpenAI Launches ChatGPT Mobile App for iOS",
    "OpenAI launches free ChatGPT app for iPhone users",
    "OpenAI Launches ChatGPT iPhone App",
    "OpenAI Debuts ChatGPT App for Apple iPhone, Says Android Coming Soon",
    "OpenAI launches a free ChatGPT app for iOS",
    "The OFFICIAL ChatGPT App Launches On iOS",
    "ChatGPT Launches First-Ever App On IPhones",
    "ChatGPT iPhone app puts AI ‘at your fingertips’",
    "AI in Your Pocket: OpenAI Rolls Out ChatGPT App for iOS Users",
    "OpenAI's ChatGPT Finally Comes to Smartphones With iOS App",
    "OpenAI Launches Official ChatGPT App for iPhone and iPad",
    "How to get the official ChatGPT app for iPhone",
    "OpenAI now has an official ChatGPT app for iOS",
    "Open AI Announces New ChatGPT App for iOS",
    "OpenAI releases its official ChatGPT app for iOS devices in the US",
    "OpenAI Brings ChatGPT App to Your Smartphone",
    "OpenAI launches ChatGPT on Apple's app store",
    "OpenAI launches free ChatGPT for iPhone app with Whisper support and more",
    "ChatGPT Now Has an iPhone App",
    "OpenAI launches ChatGPT for iPhones in US",
    "ChatGPT for iPhone is here, and it's pretty incredible 🙌",
    "US users can download the app here: https://apps.apple.com/...",
    "ChatGPT on iOS live in the US and rolling out to other countries soon! https://apps.apple.com/...",
    "It's like having a media ceo in your pocket. https://twitter.com/...",
    "RIP to all the ChatGPT apps 😅. https://twitter.com/...",
    "App looks much better than the website. https://twitter.com/...",
    "RIP those AI Chatbot apps https://openai.com/...",
    "Finally all those scammy apps can disappear https://twitter.com/...",
    "It's 2023 and they are still treating Android as a second class citizen https://twitter.com/...",
    "International Business Times",
    "San Francisco Business Journal",
    "Twitter, Google win big at Supreme Court",
    "Supreme Court rules for Google, Twitter on terror-related content",
    "Supreme Court rules against reexamining Section 230",
    "Supreme Court hands tech companies a win, and not just about Section 230",
    "SCOTUS spares Section 230, rules Google, Twitter not liable for aiding ISIS",
    "Supreme Court ruling continues to protect Google, Facebook and Twitter from what users post",
    "Supreme Court Sidesteps Ruling on Scope of Internet Liability Shield",
    "Technology & Marketing Law Blog",
    "The Internet Survives SCOTUS Review (This Time)-Twitter v. Taamneh and Gonzalez v. Google",
    "US Supreme Court leaves protections for internet companies unscathed",
    "Supreme Court Wisely Declines to Rewrite Section 230",
    "Supreme Court hands Twitter, Google wins in internet liability cases",
    "Supreme Court Sides With Tech Companies in Liability Cases",
    "US Top Court Back Big Tech In Terror Cases",
    "The Supreme Court decides not to break the internet",
    "Supreme Court rules in favor of Twitter and Google, avoiding the issue of Section 230 for now",
    "The Supreme Court Just Handed Google and Twitter a New Line of Defense",
    "Supreme Court Declines to Make It Easier to Sue Social Media Companies",
    "Supreme Court sides with Twitter, Google over tech platform liability",
    "Section 230 Just Survived a Brush with Death",
    "Legal experts say Google, Twitter and other tech companies dodged a bullet at the Supreme Court",
    "Google & Other Tech Giants Not Liable For Terrorist Content",
    "Supreme Court unanimously sides with Twitter in ISIS attack case",
    "Supreme Court: Lazy Content-Moderation Doesn't Mean Platforms Aided Terrorists",
    "Supreme Court bolsters Section 230, shielding tech platforms from liability for harmful posts",
    "Twitter and Google survived a Supreme Court challenge—and so did Section 230",
    "Supreme Court sides with tech giants over legal shield for content",
    "Supreme Court overturns ruling holding platforms responsible for users' criminal activity",
    "SCOTUS Says It Won't Mess With Section 230, for Now",
    "Supreme Court Rightly Maintains Critical Internet Free-Speech Liability Protections",
    "Q&A: Section 230 is at the Supreme Court. Here's Why that Matters for Free Expression",
    "Supreme Court Rules in Favor of Twitter in Taaamneh, Remands Gonzalez",
    "Supreme Court Leaves Intact Social Media Liability Shield",
    "@lauren@mastodon.laurenweinstein.org",
    "Section 230 was ready for its SCOTUS Close Up https://twitter.com/... [image]",
    "SCOTUS scoreboard for today: Section 230 survived. Fair use, not so much.",
    "Electronic Frontier Foundation",
    "The Internet Dodges Censorship by the Supreme Court",
    "Tech keeps liability shield in Supreme Court win",
    "Supreme Court Hands Tech Industry Win by Leaving Section 230 Internet Shield in Place",
    "GeForce RTX 4060 & RTX 4060 Ti Announced: Available From May 24th, Starting At $299",
    "First Xbox Title Joins GeForce NOW",
    "NVIDIA announces GeForce RTX 4060 Ti at $399, RTX 4060 to launch in July at $299",
    "Nvidia debuts GeForce RTX 4060 family, GeForce Now teams with Xbox",
    "Nvidia Reveals RTX 4060 Ti, 4060 with Prices Starting at $299",
    "Nvidia stock rises after company announces new graphics cards in GeForce RTX 4060 family",
    "NVIDIA GeForce RTX 4060 Ti and RTX 4060 Final Specs, Performance, and Prices Leaked",
    "Nvidia announces GeForce RTX 4060 series starting at $299",
    "NVIDIA Announces Latest Ada Lovelace Additions: GeForce RTX 4060 Ti & RTX 4060",
    "Nvidia's huge RTX 4060 Ti and RTX 4060 GPU giveaway will make this a sweet summer",
    "Nvidia RTX 4060 Ti vs. RTX 4060: here's how they stack up",
    "DLSS3 Technology on a Budget: NVIDIA's RTX 4060 Series",
    "Nvidia Reveals RTX 4060 Family, The ‘Ultimate’ GPUs For 1080p Gaming",
    "Colorful Introduces the NVIDIA GeForce RTX 4060 Ti and RTX 4060",
    "Nvidia to Give Away Hundreds of RTX 4060, 4060 Ti Cards This Summer",
    "NVIDIA GeForce RTX 4060 Ti and RTX 4060 Launched",
    "Nvidia's RTX 4060 series is official & it's good news for budget gamers",
    "Nvidia unveils 3 GeForce RTX 4060s starting at $299: DLSS 3 goes mainstream",
    "Nvidia Tips GeForce RTX 4060 Ti for Fast 1080p Play, With RTX 4060 Close Behind",
    "NVIDIA's $299 GeForce RTX 4060 is the cheapest 40-series card yet",
    "DLSS 3 + AV1 + Super low power consumption = 👍👍👍 https://twitter.com/...",
    "TikTok Creators Sue Montana Over State's Ban of Short-Video Platform",
    "TikTok creators sue Montana over statewide ban of the app",
    "TikTok users sue Montana over first-in-nation law banning app",
    "TikTok content creators file lawsuit against Montana over first-in-nation law banning app",
    "US TikTok users file lawsuit to block Montana ban",
    "TikTok Ban in Montana Draws Suit From Ranch Mom, Marine, Student",
    "TikTok creators sue to block Montana's ban on the platform",
    "Montana TikTok ban faces First Amendment legal challenge",
    "TikTok creators sue Montana over app ban",
    "He's the ‘unofficial ambassador’ of Montana — and isn't buying its TikTok ban",
    "Critics Say Montana's TikTok Ban Is a Violation of Free Speech. Here's What to Know",
    "9 questions about the attempts to ban TikTok, answered",
    "Montana governor bans TikTok",
    "Montana to become first US state to ban TikTok",
    "Montana becomes the first state to ban TikTok",
    "Montana governor bans TikTok. But can the state enforce the law?",
    "Montana Governor Signs Total Ban of TikTok in the State",
    "Montana becomes 1st state to ban TikTok; law likely to be challenged",
    "Montana TikTok ban unrealistic and misguided: experts",
    "TikTok is now banned in Montana",
    "A Montana TikTok Star, 20, Has Some Thoughts About This “Ban” Business",
    "Montana Sets Itself Up for First Amendment Lawsuits With TikTok Ban",
    "Montana becomes first US state to ban TikTok",
    "Montana's TikTok Ban Is Unconstitutional Twice Over",
    "In Montana, a TikTok Ban Could Be a ‘Kick in the Face’",
    "Montana's TikTok Ban Uses Chinese Tactics To Guard Against China",
    "TikTok users sue to overturn Montana's statewide ban of app",
    "You can still use TikTok even if it's banned",
    "In a stand against authoritarianism, Montana bans TikTok downloads",
    "First U.S. state bans TikTok app; $10,000 fine per violation",
    "What Montana's TikTok Ban Means For Content Creators And Users",
    "Should governments ban TikTok?  Can they?",
    "Montana governor defends decision to ban TikTok from state: ‘I wish it was broader’",
    "Montana just banned TikTok. Will it actually work?",
    "Montana isn't banning TikTok: It's putting on a show and you won't be affected",
    "Montana TikTok Ban Sparks First Amendment Debate While Apple And Google Are Silent",
    "TikTok Faces State-Level Ban In Montana",
    "Montana becomes first state to ban TikTok after governor signs bill into law",
    "Montana legislature passes TikTok ban (Update: Ban is now law)",
    "Montana Governor Signs TikTok Ban Into Law",
    "Is the US banning TikTok? Montana governor signs bill to ban app",
    "Montana bans TikTok for all residents",
    "First US state officially bans TikTok, $10,000 fine per violation",
    "Montana governor signs ban on second trimester abortion procedure",
    "Treat guns like this instead of a social media platform. https://www.wsj.com/...",
    "Very curious how they plan to enforce this https://www.cnn.com/...",
    "Love how every kid in Montana is about to learn how to use a vpn https://twitter.com/...",
    "Seriously though- this is absurd: https://www.nytimes.com/...",
    "is this in any way enforceable - or just pure GOP theatre? https://www.nytimes.com/...",
    "Way to waste everyone's time with dumb stunt politics, Montana. https://www.nytimes.com/...",
    "A professor accused his class of using ChatGPT, putting diplomas in jeopardy",
    "New York City rescinds ban on ChatGPT use in public schools",
    "New York City public schools remove ChatGPT ban",
    "Professor attempts to fail students after falsely accusing them of using ChatGPT to cheat",
    "Twitter reportedly accuses Microsoft of violating its data use policy",
    "Twitter Says Microsoft May Have Violated API Policies",
    "Musk's Lawyer Sends Letter to Microsoft on Twitter Data Misuse",
    "Twitter Says Microsoft Broke Its Rules For Developers",
    "Twitter accuses Microsoft of misusing its data, foreshadowing a possible fight over AI",
    "Twitter accuses Microsoft of improperly using its data - NYT",
    "Read the letter: Twitter accuses Microsoft of using its data in unauthorized ways",
    "Twitter has sent a letter to Microsoft claiming it used data without paying for it",
    "Twitter Accuses Microsoft Of Data Violations Following Musk's Lawsuit Tweet",
    "Elon Musk's lawyer accuses Microsoft of abusing its access to Twitter data",
    "Mark Cuban says Elon Musk's AI company could create a ‘virtual Elon’ and calls it ‘pretty scary’",
    "AI War Just Warming Up. Winners Will Be Data Owners. https://twitter.com/...",
    "@MikeElgan@mastodon.social",
    "About longer videos for Twitter Blue subscribers",
    "Twitter Blue subscribers can now upload videos as long as two hours",
    "Twitter Blue Subscribers Can Now Upload 2-Hour Videos in the App",
    "Piracy-loving Twitter Blue users exploit new 2-hour video limit",
    "Twitter Blue benefits now include two-hour video uploads, says Elon Musk",
    "Twitter Blue Verified Subscribers Can Now Upload 2-Hour Videos",
    "Twitter will now let you upload 2-hour videos, but why would you?",
    "Twitter Blue Debuts 2-Hour Long Video Uploads",
    "Twitter Blue subscribers can add up to two hour long videos, says Elon Musk",
    "Twitter Blue users get another perk: two-hour video uploads",
    "Twitter now lets Blue subscribers upload two-hour videos",
    "Twitter Videos Go Feature-Length With Support For Two-Hour Uploads",
    "Twitter Blue Subscribers Can Now Post Full-Length Videos up to Two Hours Long",
    "Twitter Adds New Video Playback Speed Controls, Flags Coming Video Updates",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "this entire platform was made with brevity in mind https://twitter.com/...",
    "More movies coming to Twitter https://twitter.com/...",
    "Just what the blue checks need https://twitter.com/...",
    "Feels like the current owner of this app doesn't know what made it good. https://twitter.com/...",
    "“We wanted flying cars, instead we got two-hour-long tweets” https://twitter.com/...",
    "Apple VR/AR Headset Manufacturing Costs Estimated at $1500",
    "Report: Apple Executives Cautious of Mixed-Reality Headset Amid Compromises",
    "Apple AR Glasses Reportedly Still at Least Four Years Away From Launch",
    "No one can agree on what the Apple VR Headset will cost to make",
    "Apple Engineers Reportedly Got To Build A Headset By Promising Tim Cook Glasses",
    "Manufacturing cost of Apple's mixed reality headset exceeds $1500 per unit",
    "Don't Dismiss Apple's Mixed-Reality Headset Just Yet",
    "Apple execs were reportedly skeptical on headset, with one likening it to a ‘science project’",
    "4 reasons why the Apple VR headset could be a flop (and 4 reasons why it might not be)",
    "Even Apple executives reportedly have doubts about its upcoming mixed reality headset",
    "Apple Reality Pro AR Headset: Eye-Watering Price And Brilliant Unique Feature Leaked In New Report",
    "Apple AR/VR headset got snubbed behind the scenes — 3 reasons why execs gave it the cold shoulder",
    "Would you wear Apple VR to a party? Nope, didn't think so — so why does Apple think you will?",
    "Apple's upcoming AR headset is the riskiest product it's ever launched",
    "Apple Headset is Far from Tim Cook's Original Vision, Says Report",
    "Apple's New Mixed-Reality Headset Is The Gamble We Never Expected From Tim Cook",
    "Report reveals senior Apple executives' casual involvement in mixed-reality headset development",
    "Reality Pro headset significantly compromised; top execs skeptical; Apple selling it at cost",
    "Oh god no https://www.bloomberg.com/... [image]",
    "Apple bans its employees from using ChatGPT and other generative AI platforms for work",
    "Apple bans internal use of ChatGPT-like tech over fear of leaks, according to leaked document",
    "Apple tells employees not to use generative AI tools over confidential data leak fears",
    "Apple Has Restricted Employees From Using ChatGPT, Bard, Others, Over Fear Of Future Product Leaks",
    "Apple Restricts Internal Use of ChatGPT",
    "Apple limits use of ChatGPT for employees",
    "Apple restricts use of ChatGPT for its employees",
    "Pretty much guarantees that Siri won't get better now 😂😂😂 https://twitter.com/...",
    "AmpereOne with 192 Cores 128x PCIe Gen5 Lanes and DDR5 in 2023",
    "Ampere Gets Out In Front Of X86 With 192-Core “Siryn” AmpereOne",
    "Ampere Launches Next-Generation 192-Core Server Processor",
    "Silicon Valley Business Journal",
    "Ampere spent more than $1 billion on developing its chips",
    "AI Data-Center Boom Will Spur Energy Crisis, Chip CEO Warns",
    "Meta Platforms Crafts Homegrown AI Inference Chip, AI Training Next",
    "Reimagining Meta's infrastructure for the AI age",
    "Meta built a code-generating AI model similar to Copilot",
    "Reimagining Our Infrastructure for the AI Age",
    "Meta unveils its first custom AI chip",
    "Meta announces AI training and inference chip project",
    "Meta is working on a new chip for AI",
    "Meta pulls the curtain back on its A.I. chips for the first time",
    "Meta Discloses Its Second Custom Processor, And This Should Interest Investors",
    "Meta Completes Research SuperCluster, Announces Next-Gen Datacenter",
    "Meta's Pricey Bet on AI Comes With New Custom Chips, Coder Tools",
    "Meta Platforms unveils next-generation AI infrastructure and data center designs",
    "@aphysicist @ArturTanona Nope",
    "@ylecun @ArturTanona Did you get an invite to testify in front of congress yet?",
    "Spacetop Is A New Kind Of Laptop With Tethered AR Glasses Instead Of A Screen",
    "I used the world's first augmented reality laptop",
    "This Augmented Reality Laptop Can Beam a 100-Inch Screen to Your Eyes",
    "Take Your Ultrawide Monitors Everywhere With an AR Laptop",
    "Spacetop is the World's First Augmented Reality Laptop, Offers 100-inch Virtual Canvas",
    "This new laptop replaces the physical screen with a 100-inch virtual display",
    "Spacetop: The Groundbreaking Screenless Laptop Revolutionizing the Future of AR Technology",
    "Sightful's AR Laptop Promises a Portable 100-inch Screen",
    "Startup founded by Magic Leap execs introduces the world's first AR laptop",
    "New Spacetop Laptop Puts Your Workspace in the Air",
    "An AR Laptop Is Not as Crazy an Idea as You Might Think",
    "@JsonCulverhouse@flipboard.social",
    "Disney explores ditching cable for streaming-only version of ESPN",
    "We've Been Hearing About Cord-Cutting For Years, But Is Cable Finally Dying For Real?",
    "ESPN is preparing for its “flagship” streaming future.",
    "Disney Plans to Launch ESPN Streaming Service: Report",
    "Breaking: Disney Reportedly Has Begun Negotiations to Roll Out Streaming-Only Version of ESPN",
    "Let me know when the bricks show up. https://twitter.com/...",
    "Turn product data into revenue without engineers",
    "Australian Financial Review",
    "Westpac places immediate ban on payments to Binance crypto exchange",
    "Westpac trials new cryptocurrency blocks to prevent scam losses",
    "World's biggest crypto exchange banned by Westpac, cut off by provider",
    "Binance Australia Halts Australian Dollar Bank Transfers",
    "Australian ‘Big 4’ bank begins trial for cryptocurrency payment blocks",
    "Westpac bans transfers to world's largest crypto exchange Binance",
    "Executive team  —  BEc, FCA.  —  Managing Director and Chief Executive Officer, Westpac Group",
    "Binance Australia Suspends Cash Withdrawals, Loses Banking Partner Due to Compliance Shortcomings",
    "Westpac Enforces Urgent Prohibition On Payments To Binance Crypto Exchange",
    "Binance Australia suspends AUD services",
    "Binance Australia says banking disrupted as payment provider cuts service",
    "Binance Australia halts Aussie dollar deposits, citing third-party issues",
    "Binance just got de-banked in Australia 📣 which country is next? [image]",
    "Oh no, Binance fraud cut off from Australia. [image]",
    "Location Data About Abortion Provider Visitors Is Still Being Stored and Exploited",
    "This is so evil https://www.wsj.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Thu. 05/18 - Montana Bans TikTok",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Course5 Intelligence raises $28 mn to boost investments in generative AI",
    "New £1bn UK semiconductor strategy finally unveiled",
    "UK plays catch-up in chips war with £1B semiconductor strategy",
    "UK Unveils £1 Bn Semiconductor Strategy",
    "Critics say £1bn for UK chip industry not enough",
    "UK government reveals long-awaited £1bn semiconductor strategy",
    "Britain launches $1.2 billion semiconductor plan after U.S. and EU splurge on chips",
    "San Francisco staffing startup Instawork raises millions for push into AI",
    "Coinbase Finally Launches Subscription Service Overseas, Focuses on Staking",
    "Coinbase Expands Coinbase One Subscription Offering to UK, Germany, Ireland",
    "Coinbase unveils its global zero-trading subscription service ‘Coinbase One’",
    "Coinbase's Premium Service Expands, Offers Gift To New Members",
    "Coinbase launches zero trading fee subscription service",
    "Coinbase Announces New Updates to its Subscription Service",
    "Coinbase Officially Opens Subscription Service; Expands Reach Outside U.S.",
    "Breaking: Coinbase Rolls Out Zero Fee Trading Program, Expands Outside US",
    "Coinbase One launches amid regulatory challenges",
    "Coinbase One Upgrade: Increased Staking Rewards and Expanded Global Access",
    "Coinbase Launches Subscription Service With Zero Trading Fees & Higher Staking Rewards",
    "Coinbase expands subscription service to UK, Germany and Ireland",
    "Coinbase One Opens Subscriptions For Fee-Free Trades",
    "Coinbase's zero-fee subscription service out of beta and expanded outside the US",
    "Amazon Prime Air hoped for 10,000 drone deliveries this year — it's only done 100",
    "Google's turning off third-party cookies for 1 percent of Chrome users early next year",
    "Preparing to ship the Privacy Sandbox relevance and measurement APIs",
    "Privacy Sandbox APIs set to launch in Chrome from July",
    "Google's Privacy Sandbox updates are met with both skepticism and a little more optimism",
    "Google will deprecate cookies for 1% of users in Q1 2024",
    "Google's Privacy Sandbox is ready. Chrome to drop third-party cookies in 2024",
    "Google will disable third-party cookies for some Chrome users in early 2024",
    "Google details its next steps for wiping out Chrome tracking cookies",
    "The Chrome Privacy Sandbox APIs Will Be Generally Available For All Users In July",
    "Meta and Google news adds fuel to the open-source AI fire",
    "@MikeIsaac @CadeMetz When you face a moat, flood the field.",
    "A Meta AI leak sparked a movement to “Free the Llama” Story by me https://www.wsj.com/... [image]",
    "Alibaba to spin off its cloud, AI and business messenger unit",
    "Alibaba kicks off unit IPOs as revenue growth weakens",
    "Alibaba Group Announces March Quarter and Full Fiscal Year 2023 Results",
    "Alibaba reports lower-than-expected Q1 earnings, confirms cloud business IPO plan",
    "Alibaba board approves separate listings for Cloud, Cainiao units",
    "Alibaba plans to list cloud division as quarterly revenue misses expectations",
    "Elon Musk claimed he gave $100 million to OpenAI. Filings show he gave far less.",
    "Treasury Committee - UK Parliament",
    "@davidgerard@circumstances.run",
    "Regulating Crypto  —  Summary So-called “cryptoassets” span a wide and rapidly evolving range …",
    "The UK can't figure out if crypto is gambling or a financial service. Why not both?",
    "UK Treasury report asks government to regulate crypto as gambling",
    "Crypto has no ‘intrinsic value’ should be regulated as gambling, UK panel says",
    "UK Parliament's Treasury Committee wants crypto regulated as gambling",
    "Regulate Crypto Just Like Gambling, UK Treasury Committee Says",
    "Crypto retail trading should be regulated as gambling — UK lawmakers",
    "UK Treasury Committee Urges Government to Regulate Crypto as Gambling",
    "UK panel proposes treating crypto trading as gambling",
    "UK lawmakers propose regulating crypto as gambling",
    "UK Lawmakers Call for Regulation of Crypto Retail Trading as Gambling",
    "This is the way https://committees.parliament.uk/ ... [image]",
    "if i had more time i'd start a website called old people yelling at crypto https://twitter.com/...",
    "YouTube is bringing unskippable 30-second ads to TV",
    "The world watches YouTube: Highlights from Brandcast 2023",
    "YouTube Unveils 30-Second Select Spots, Pause Ads at Brandcast Event",
    "YouTube's Rolling Out 30-Second Unskippable Ads to Connected TVs",
    "If you're not paying for YouTube Premium yet, you might regret that very soon",
    "YouTube Introduces Non-Skippable 30-Second TV Ads",
    "YouTube Announces Unskippable Ads for TVs, NFL Partnership, and More",
    "YouTube launches 30-second unskippable ads for TV viewers",
    "YouTube TV Is Adding Unskippable 30-Second Ads, Are You Still Cutting The Cord?",
    "Upfronts: YouTube Adopts Non-Skippable 30-Second CTV Commercials",
    "YouTube debuts unskippable 30-second ads to target brands' TV ad dollars",
    "YouTube Bringing Unskippable 30-Second Ads To The Living Room",
    "FTC says popular fertility tracking app Premom shared sensitive data with Chinese analytics firms",
    "FTC alleges Premom fertility app shared sensitive health data",
    "Ovulation tracker app Premom charged with sharing users' personal information",
    "Free fertility app shared info with third parties, FTC says",
    "Fertility app Premom to pay $200K after sharing sensitive user data",
    "Creepshow: FTC Fines Premom for Handing Period Data to Chinese Companies and Google",
    "FTC says fertility app Premom shared user health data with third parties",
    "FTC Dings Reproductive Health App Over Data Sharing Violations",
    "FTC says popular fertility app gave advertisers pregnancy data without permission",
    "FTC says fertility tracking app Premom shared sensitive health data with third parties"
]