[
    "Updating our inactive account policies",
    "Warning: Google to Delete Accounts That Have Been Inactive for 2 Years",
    "Here's why your Gmail account may be at risk of being deleted",
    "Google will delete your account if it remains inactive for 2 years",
    "Google to delete accounts inactive for two years in security push",
    "Google Will Delete Accounts That Have Been Inactive For Two Years",
    "Google Accounts That Sit Unused For Too Long Will Soon Be Deleted Entirely",
    "Your inactive Gmail accounts will get deleted — how to keep them active",
    "Google will delete inactive accounts starting December 2023",
    "Google To Delete Old Gmail And YouTube Accounts Not Used In Two Years",
    "Google plans to delete inactive accounts after two years",
    "Google threatens to start deleting inactive Gmail accounts",
    "In December, Google's Deleting a Ton of Inactive Accounts",
    "Haven't used your Google account recently? It may be deleted",
    "Use it or lose it: Google says it will delete inactive accounts",
    "Google will start deleting inactive accounts after two years",
    "Google will start deleting inactive accounts later this year",
    "Google will start purging inactive accounts later this year",
    "Log in or lose it: Google will start deleting your unused personal accounts",
    "Don't use your Google account? You could lose it",
    "Google About to Start Deleting Accounts If You Don't Use Them",
    "Google may delete your Gmail account if it's been inactive for too long",
    "Google will delete inactive accounts this year",
    "Watch out, Google might delete your old Gmail account if you aren't careful",
    "Google may start deleting dormant Gmail accounts later this year",
    "Google is going to start deleting accounts that haven't logged in for 2 years",
    "Old, unused Gmail accounts are getting the boot",
    "@Jonathanglick@mstdn.social",
    "Elon Musk keeps insisting the Texas shooter with a swastika tattoo is not a white supremacist",
    "Tesla may reverse its stance and start advertising",
    "Tesla is going to try advertising says Elon Musk who ‘hates’ it",
    "Elon Musk teases two new EVs, says Tesla is already building one",
    "Elon Musk says if his tweets lose his firms money then so be it",
    "Elon Musk: I will say what I want even if it loses me money",
    "Musks says ‘so be it’ to consequences of his tweeting",
    "Tesla will ‘try a little advertising’, Elon Musk says",
    "@Techmeme @rogoswami Those who live in la la land glass houses shouldn't throw ephemeral stones",
    "‘FriendlyName’ Buffer Overflow Vulnerability in Wemo Smart Plug V2",
    "Critical security flaw is exposing older Wemo Smart Plugs to hackers",
    "Researchers find security flaw in Wemo Smart Plug, Belkin says it won't release a patch",
    "Unpatched Wemo Smart Plug Bug Opens Countless Networks to Cyberattacks",
    "PSA: Older Wemo Smart Plugs Have Vulnerability That Leaves Them Open to Attack",
    "Researchers find exploit in Belkin's Wemo Mini Smart Plug V2",
    "PSA: time to recycle your old Wemo smart plugs (if you haven't already)",
    "Washington Post on YouTube",
    "US Senator Uses ChatGPT for Opening Remarks at a Hearing on AI",
    "OpenAI proposed license to regulate AI, Baidu urges self content moderation",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies on artificial intelligence before Senate committee",
    "Advocating for Open Models in AI Oversight: Stability AI's Letter to the United States Senate",
    "Top AI execs tell US Senate: Please, please pour that regulation down on us",
    "OpenAI's Sam Altman To Congress: Regulate Us, Please!",
    "OpenAI CEO asks Congress for AI regulation and a new agency",
    "OpenAI CEO to Congress: Regulate me",
    "OpenAI CEO Calls for New Regulatory Agency for AI",
    "Congress deliberates AI regulation to avoid mistakes of the past",
    "OpenAI CEO Sam Altman calls for increased AI regulation in Senate hearing",
    "Sam Altman: CEO of OpenAI calls for US to regulate artificial intelligence",
    "OpenAI CEO Sam Altman testifies in ‘historic’ Senate hearing on AI safety",
    "ChatGPT boss calls for a new government agency to keep AI companies in check",
    "OpenAI CEO Sam Altman Urges Congress to Create AI Regulation at Senate Hearing",
    "1 big thing: Altman enjoys Hill honeymoon phase",
    "Sam Altman calls for ‘incredible scrutiny’ of major AI companies, including OpenAI and Microsoft",
    "In Senate testimony, OpenAI CEO Sam Altman agrees with calls for an AI regulatory agency",
    "OpenAI CEO Calls for Regulation But No Pause on Advanced AI",
    "CEO Behind ChatGPT Warns Congress AI Could Cause ‘Harm to the World’",
    "OpenAI chief concerned about AI being used to compromise elections",
    "OpenAI CEO says AI chatbots will ‘entirely automate away some jobs’",
    "WATCH LIVE | OpenAI CEO testifies before Congress",
    "The CEO behind ChatGPT is testifying. Here's what to expect.",
    "ChatGPT Creator Tells Congress He Wants an AI Regulatory Agency",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies before Senate Judiciary Committee",
    "Always great to have men testifying about work women pioneered. https://twitter.com/...",
    "United States Senate Committee on the Judiciary",
    "International Business Times",
    "San Francisco Business Journal",
    "CEO behind ChatGPT warns Congress AI could cause ‘harm to the world’",
    "Oversight of A.I.: Rules for Artificial Intelligence",
    "Mr. ChatGPT goes to Washington: OpenAI CEO Sam Altman testifies before Congress on AI risks",
    "OpenAI's Sam Altman Urges A.I. Regulation in Senate Hearing",
    "ChatGPT's Sam Altman Calls on Congress to Adopt Safety Standards for AI Systems",
    "OpenAI CEO calls for laws to mitigate ‘risks of increasingly powerful’ AI",
    "Sam Altman wows lawmakers at closed AI dinner: ‘Fantastic...forthcoming’",
    "OpenAI CEO Testifies on Artificial Intelligence",
    "Sam Altman's testimony: Navigating the PR playbook in the soon-to-be-regulated AI industry",
    "OpenAI CEO in “historic” move calls for regulation before Congress",
    "NEWSLETTERS  ·EYE ON A.I.  —  OpenAI CEO Sam Altman tells senators he wants to see A.I. licensed.",
    "OpenAI CEO Sam Altman Asks Congress to Regulate AI",
    "The C.E.O. of OpenAI Heads to Congress to Discuss Rules for A.I.",
    "OpenAI's Sam Altman Calls for AI Regulation in Senate Testimony",
    "ChatGPT chief issues AI warning",
    "Historic Senate hearing sees OpenAI CEO Sam Altman championing AI safety",
    "ChatGPT chief says AI should be regulated by a US or global agency",
    "Sam Altman's Washington charm offensive is working",
    "6 takeaways from the OpenAI senate hearing",
    "Lawmaker asks ChatGPT if the government should regulate AI, and the answer won't surprise you",
    "Sam Altman On AI Oversight: Balancing Risks & Advancements",
    "OpenAI CEO Sam Altman tells US Senate panel generative AI needs regulation",
    "OpenAI stumps in Washington",
    "OpenAI CEO: If AI Goes Wrong, ‘It Can Go Quite Wrong’",
    "OpenAI's Sam Altman got a warm welcome on Capitol Hill",
    "OpenAI's Altman Acknowledges AI Dangers, Asks for Regulation",
    "Senator Makes Point About A.I. With Fake Audio of Himself",
    "ChatGPT's Altman Pleads To US Senate For AI Rules",
    "Sam Altman, CEO of ChatGPT deveoper OpenAI, is testifying before Congress about AI",
    "ChatGPT's creator warns Congress the technology could cause ‘significant harm’",
    "OpenAI CEO Sam Altman's congressional testimony comes at a critical AI moment",
    "ChatGPT's chief to testify before Congress as concerns grow about artificial intelligence's risks",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "Who is Sam Altman, the OpenAI CEO testifying at Congress?",
    "OpenAI immediately going for AI regulation is lame as fuck",
    "Can you say, “pulling up the ladders”? https://twitter.com/...",
    "Ledger Recover by Coincover",
    "‘Backdoor’ for Seed Phrases? Ledger's New Recovery Feature Spooks Users",
    "Crypto hardware maker's recovery feature draws ire",
    "Are ledger hardware wallets secure? A comprehensive analysis",
    "‘Backdoor’ in Ledger? Here's What's Going On—And How to Keep Your Crypto Safe",
    "Ledger Under Fire for Allegedly Exposing User Seed Phrases",
    "Ledger Bats Back Criticism of New Wallet Recovery Service",
    "‘Lots of inaccuracies’: Ledger pushes back on security fears over its crypto wallet update",
    "Ledger dubs service ‘risk-free’ despite losing millions of user emails",
    "“We don't want it” CT Responds To Ledger Recover",
    "Stupidest idea you can make as a hardware wallet manufacturer.... https://twitter.com/... [image]",
    "teenage engineering has the opportunity to do something incredibly funny https://twitter.com/...",
    "@DavidNielsen@mastodon.social",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "iPhones will soon be able to learn your voice and speak for you",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple previews new accessibility features, including AI-generated voice clone",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Apple previews useful accessibility features coming to iOS 17",
    "Apple's upcoming accessibility features include text-to-speech AI that can imitate users' voices",
    "Apple Adds Live Speech and AI-Based Voice Generation in iOS 17",
    "Modest Apple talks up these ‘incredible’ advances in iOS",
    "Apple previews new Assistive Access, Live Speech, and other accessibility coming in iOS 17",
    "Soon, your iPhone will be able to speak in your own voice",
    "The Next Major iPhone Update Will Be Capable of Digitally Reproducing Your Voice",
    "Your iPhone will soon be able to replicate your voice after 15 minutes of training",
    "Apple reveals game-changing accessibility features including Live Speech and Personal Voice",
    "Voice-Cloning Tech Coming to iPhone, iPad to Help Those With Disabilities Speak",
    "Apple to Expand Accessibility Options in 2023",
    "Apple previews new iOS 17 accessibility features ahead of WWDC 2023 event",
    "Apple's new tools for cognitive, speech, vision accessibility in its products wins praise",
    "Apple's upcoming Personal Voice feature can clone your voice in 15 minutes using AI",
    "Apple introduces a slew of new accessibility features ahead of WWDC",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple's Personal Voice, Point and Speak Features Use AI to Boost Accessibility",
    "Apple Details New Accessibility Features Coming to iOS, iPadOS, and macOS Later This Year",
    "Apple Previews New Accessibility Features For iPad, iPhone, And Mac",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "@johnvoorhees@mastodon.macstories.net",
    "@blakereid@mastodon.lawprofs.org",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2",
    "Apple launches new concert discovery features on Apple Maps and Apple Music",
    "Apple Adds Live Music Features to Maps and Music",
    "Apple Music, Maps Launch New Concert Discovery Features",
    "Apple introduces ‘concert discovery’ for Music and Maps",
    "How to find your favorite artist's Set List on Apple Music; see tour dates and get tickets",
    "Apple launches Maps and Apple Music with New Concert Discovery Features",
    "Apple launches concert discovery and venue guides on Apple Maps and Apple Music",
    "Apple brings new concert discovery features to Maps and Music",
    "Apple Music and Maps gain new concert discovery features on iPhone, iPad and Mac",
    "Apple Launches Concert Discovery Features on Apple Music and Apple Maps",
    "Apple taps into Shazam with new live concert features in Music and Maps",
    "Apple Maps and Music Are Making it Easier to Find Concerts",
    "Apple adds new concert-finding features to Maps and Music",
    "Now Apple Music is putting live gigs on the Maps",
    "Apple Music adding concert set list playlists, tour dates, and more",
    "Apple now helps you discover concerts in Maps and Music",
    "@viticci@mastodon.macstories.net",
    "HealthcareInfoSecurity.com",
    "@briankrebs@infosec.exchange",
    "U.S. Department of the Treasury",
    "Russian National Charged with Ransomware Attacks Against Critical Infrastructure",
    "Russian ransomware affiliate charged with attacks on critical infrastructure",
    "Alleged Russian Hacker Charged in $200 Million Ransomware Spree",
    "Russian man charged over ransomware attacks, including against D.C. police",
    "Office of Foreign Assets Control",
    "Cyber-related Designation  —  SPECIALLY DESIGNATED NATIONALS LIST UPDATE",
    "Alleged Babuk Ransomware Hacker ‘Wazawaka’ Indicted in US",
    "DOJ Offers $10 Million Reward for Info on Alleged Russian Ransomware Hacker",
    "United States Sanctions and Charges Russia-based Ransomware Developer Mikhail Matveev",
    "US puts $10 million bounty on Russian hacker's head",
    "US sanctions Russian ransomware operator who leaked stolen DC police data",
    "Alleged Babuk ransomware gang leader ‘Wazawaka’ indicted, sanctioned by US",
    "US sanctions Russian accused of being a ‘central figure’ in major ransomware attacks",
    "The Dangers of Google's .zip TLD",
    "New TLDs: Not Bad, Actually",
    "Is the new .zip top-level domain a cyber security risk?",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "App Store stopped over $2 billion in fraudulent transactions in 2022, Apple claims",
    "Apple says it blocked over $2 billion in App Store fraud in 2022",
    "Apple Touts Fraud and Abuse Prevention in the App Store",
    "Apple rejected nearly 1.7 million App Store submissions in 2022",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple says its App Store prevented over $2B in fraudulent transactions last year",
    "Apple's App Store prevented more than $2 billion worth of fraudulent transactions in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "Apple says App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple prevented $2 billion worth of fraud on the App Store in 2022",
    "Apple blocked over $2 billion in fraudulent transactions & 1.7 million bogus apps in 2022",
    "Apple's App Store Blocked Over $2 Billion in Fraud Last Year",
    "United States District Court for the Northern District of California",
    "U.S. Tech Espionage Team Unveils First Cases Involving China and Russia",
    "US charges former Apple employee for trying to steal technology, fleeing to China",
    "Indictment  —  At all times relevant to this Indictment: 1.  Apple, Inc. (\"Apple\") …",
    "Ex-Apple Engineer Indicted in Crackdown on Flow of Restricted Tech to China, Russia",
    "US charges Apple ex-employee for trying to steal technology",
    "Ex-Apple engineer accused of stealing self-driving car secrets",
    "US charges former Apple engineer with attempt to steal self-driving car tech",
    "Chinese ex-Apple engineer stole Apple Car secrets, says DoJ",
    "DOJ charges former Apple engineer with stealing self-driving car technology for China",
    "Apple autonomous driving tech secrets stolen by ex-engineer, feds say",
    "DOJ Indicts Ex-Apple Engineer for Stealing Self-Driving Car Tech for China",
    "U.S. DOJ charges Apple ex-employee for attempting to steal technology, fleeing to China",
    "A third former Apple employee has been charged with stealing self-driving car tech",
    "US ‘strike force’ charges Chinese and Russian nationals with stealing sensitive tech",
    "they stole the apple car! 😂 that never launched",
    "IBM to Help Automate Cloud Data Protection with Acquisition of Polar Security",
    "IBM acquires Israeli co Polar Security",
    "IBM Snaps up DSPM Startup Polar Security",
    "IBM snags Polar Security to boost cloud data practice",
    "IBM buys data security startup Polar Security in reported $60M deal",
    "IBM Buys Polar Security to Find and Protect Cloud, SaaS Data",
    "IBM buying binge rages on with reported $60M deal for startup targeting ‘shadow data’",
    "Latch to Acquire Ring Founder Jamie Siminoff's Latest Company, Honest Day's Work",
    "Ring founder takes over as Latch CEO shortly after leaving Amazon",
    "Ring co-founder, robotics vice president leave Amazon",
    "Latch to Acquire Honest Day's Work",
    "Ring founder Jamie Siminoff departs to join Latch",
    "Ring founder to become CEO of commercial smart home company Latch",
    "The founder of Ring is leaving Amazon to join Latch",
    "Free compensation benchmarking data from 3,000 startups",
    "Google Cloud Press Releases",
    "Google Cloud Launches Two New AI Solutions to Speed Up Drug Discovery & Precision Medicine",
    "How HPC and generative AI will accelerate drug discovery and precision medicine",
    "Anybotics raises $50M to expand international deployments, develop new capabilities",
    "Ripple's XRP Bucks Crypto Gloom After Latest Court Twist Sparks 8% Jump",
    "Breaking: Court victory for Ripple as judge denies SEC motion to seal Hinman docs",
    "Why Is XRP Surging by Over 8% Today?",
    "XRP lawsuit: Judge denies SEC motion to seal documents in win for Ripple",
    "Judge denies SEC motion to seal Hinman speech documents in Ripple case",
    "TechCrunch Founder Criticizes SEC for Disfavoring Ripple's Democratization of $XRP Trading",
    "Judge Torres Rules That SEC Cannot Seal Hinman Docs in Ripple Case",
    "Turn product data into revenue without engineers",
    "The first AI navigator for your entire network",
    "App Spotlight: Ringover for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Tue. 05/16 - Open Source Vs. Centralized AI, Part I",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "YouTube's recommendations send violent and graphic gun videos to 9-year-olds, study finds",
    "Study finds YouTube algorithm can push violent, graphic videos to young children",
    "How to download YouTube videos on PC, iOS, Android, and Mac",
    "YouTube's recommendations are leading kids to gun videos, report says",
    "Baltimore Business Journal",
    "Cybersecurity firm Huntress raises $60M as it eyes international expansion",
    "Huntress Closes $60M Series C for MDR Expansion",
    "Ellicott City-based Huntress raises $60M Series C",
    "New Investment Fuels Our Mission To Enable SMBs to Better Protect Their Business Assets",
    "Cybersecurity startup Huntress raises $60M Series C round",
    "Huntress Adds $60 Million in Funding to Expand Managed Security Business",
    "Huntress Raises $60M Series C for Its Cybersecurity Tech",
    "Huntress Lands $60M, Eyes Potential IPO In Coming Years",
    "CORRECTION: Rumble Acquires Podcasting and Live Streaming Platform Callin",
    "Why companies still shy away from podcast ads",
    "Yet Another Bug in Facebook Ads",
    "These glitches never seem to benefit the buyer https://twitter.com/...",
    "Zoom Partners with Anthropic to Expand Federated Approach to AI",
    "Zoom makes a big bet on AI with investment in Anthropic",
    "Zoom to use Anthropic's Claude AI to better its customer service",
    "Zoom announces partnership with Anthropic for AI call center services",
    "Zoom To Inject Anthropic's AI Chatbot Into Video, Collaboration Products",
    "Zoom Invests in and Partners With Anthropic to Improve Its AI Functionality",
    "Zoom partners with Anthropic to add its Claude chatbot to its platform",
    "AI monetization! https://twitter.com/...",
    "Framework Laptop 13 review: cracking modular PC gets all-round upgrade",
    "Framework Laptop 13: Fully User-Repairable, but Can It Compete with MacBook Air?",
    "Framework 13 Intel 13th Gen mainboard",
    "Kustomer Embarks on a New Chapter as a Standalone Company",
    "Meta Moves on From Customer Service Platform Kustomer",
    "Meta spins out customer service startup Kustomer amid ‘year of efficiency’",
    "the boys are back. excited for the next phase. https://twitter.com/...",
    "A Santa Clara blockchain startup raised an $81M Series A round",
    "Internet infrastructure firm Auradine raises $81 million",
    "Investing in Hippocratic AI",
    "General Catalyst, Andreessen Horowitz bet on large language models for health care",
    "Hippocratic AI Raises $50 Million To Power The Healthcare Bot Workforce",
    "Hippocratic AI launches with $50M to build large language model for healthcare",
    "Meet the Startup Promising to Deliver the 1st Healthcare-focused Generative AI Model",
    "Hippocratic AI Launches with $50M for Safety Large Language Model for Healthcare",
    "WHO urges caution over use of generative AI in healthcare",
    "Hippocratic AI Unveils Safety-Focused Language Model with $50M Funding",
    "Hippocratic AI launches with $50M to build a chatbot for healthcare",
    "Hippocratic Health raises $50 mln seed funding to build AI model",
    "AI Health Startup Gets $50 Million Seed Funding From Venture Titans",
    "Twitter Sued for Allegedly Helping to Silence Saudi Critics",
    "Twitter sued over Saudi spying that allegedly landed popular user in prison",
    "Twitter, Saudi Arabia Sued In US Over Jailed User",
    "River CEO says bitcoin interest fueled by institutional investors after $35m capital raise",
    "Bitcoin Financial Services Startup River Raises $35M in Series B Backed by Peter Thiel",
    "This is like a weird 2023 reboot of “Wargames.” https://twitter.com/...",
    "Hottest online game involves the CIA. https://www.wsj.com/...",
    "EU states approve world's first comprehensive crypto rules",
    "EU Finance Ministers Vote In Favour Of MiCA",
    "EU Council Unanimously Votes in Favor of MiCA Legislation",
    "Europe's crypto rules get final approval, giving market a global lead",
    "EU finance ministers approve MiCA crypto regulation",
    "EU Adopts Comprehensive Crypto Regulation",
    "European Union Officially Adopts New Comprehensive Crypto Regulation With Passing of MiCA",
    "European Union: Council Adopts Crypto Framework or Markets in Crypto-Assets (MiCA)",
    "EU Council gives final approval to MiCA legislation",
    "MiCA drop: Europe seals the deal on the world's first comprehensive crypto law",
    "EU Council Approves Comprehensive Crypto Regulatory Framework",
    "EU finance ministers approve MiCA crypto regulation: should you buy AltSignals now?",
    "EU finance ministers green light MiCA crypto regulation",
    "Musk and Yaccarino Are Bound to Clash",
    "FTX founder Sam Bankman-Fried to be subject of ‘high-octane’ book by Michael Lewis",
    "Unfortunately you rarely get this sort of deal. https://twitter.com/...",
    "Extreme Didion “this is gold” vibes https://www.nytimes.com/... [image]",
    "EU greenlights Activision Blizzard and Microsoft merger",
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]"
]