[
    "Quinnipiac University Poll",
    "@sandofsky@mastodon.social",
    "Elon Musk's Event With Ron DeSantis Exposes Twitter's Weaknesses",
    "Twitter technical issues crash Ron DeSantis's 2024 campaign announcement",
    "Glitches, echoes and ‘melting the servers’ crash",
    "DeSantis: ‘Bitcoin Represents a Threat to the Current Regime’",
    "Elon Musk and Ron DeSantis's fiasco shows they didn't realize Twitter needs TV",
    "Twitter users aren't just witnessing a mob heist — they're the hostages",
    "Elon Musk Turns Ron DeSantis' Presidential Run Announcement Into a Twitter ‘DeSaster’",
    "Twitter repeatedly crashes as DeSantis tries to make presidential announcement",
    "Outages, garbled audio: DeSantis's 2024 launch marred by Twitter tech meltdown",
    "Florida Gov. Ron DeSantis' presidential announcement on Twitter plagued by technical problems",
    "DeSantis Campaigns on Pro-Bitcoin, Anti-CBDC Message",
    "DeSantis Campaign Debut on Twitter Faces Technical Glitches",
    "Ron DeSantis gambled on Elon Musk and went bust",
    "Ron DeSantis' Twitter Spaces Conversation With Elon Musk Kicks Off With Major Glitches",
    "Ron DeSantis's very online and very disastrous 2024 campaign announcement",
    "Ron DeSantis's presidential campaign launch was an infomercial for Twitter",
    "Ron DeSantis debuts presidential bid in a glitch-ridden Twitter ‘disaster’",
    "The Hill's Morning Report — Shaky start: DeSantis's 2024 launch marred by glitches",
    "Florida Governor makes bold promise to protect Bitcoin in US presidential bid",
    "Elon Musk breaks DeSantis campaign — and Twitter's future",
    "Ron DeSantis Pushed Elon Musk's Twitter to Its Breaking Point",
    "Twitter Spaces crashes repeatedly during DeSantis 2024 announcement",
    "Florida Gov. Ron DeSantis announces he's running for president in 2024",
    "Elon Musk's Twitter Event With Ron DeSantis Hits Technical Issues",
    "Biden capitalizes on DeSantis Twitter Spaces failure",
    "Ron DeSantis Disastrous Presidential Announcement with Elon Musk, Servers Crash",
    "DeSantis Campaign Sputters to Launch as Twitter Spaces Livestream Crashes",
    "DeSantis' 2024 Announcement Delayed By Twitter Glitches",
    "DeSantis' Twitter Campaign Launch Was a Glitch-Filled Disaster",
    "Ron DeSantis ‘Disastrous’ 2024 Launch Marred by Twitter Glitches",
    "Twitter glitches disrupt Ron DeSantis' presidential run announcement",
    "Ron DeSantis Twitter Spaces Event Experiences ‘Rapid Unscheduled Disassembly’",
    "Biden trolls DeSantis over glitchy 2024 launch on Twitter Spaces",
    "Twitter crashes in Ron DeSantis U.S. presidential run announcement",
    "Start of Ron DeSantis presidential campaign melts down in Twitter problems",
    "Elon Musk ushers in DeSantis's 2024 campaign, signaling a new era for Twitter",
    "@lauren@mastodon.laurenweinstein.org",
    "Sounds like DeSantis and Musk should have hosted their show on Truth Social servers.",
    "This link works: [Donate to reelect Joe Biden and Kamala Harris]",
    "I wonder if this is a DDOS attack",
    "We had more people join when I played Among Us 👾 https://twitter.com/...",
    "I'm running for president to lead our Great American Comeback. [video]",
    "It'd be like if the escalator had just stopped halfway down...",
    "10 million views. https://twitter.com/...",
    "everyone: wow, he shit his pants elon: yes, but everybody saw it [image]",
    "If only there were some kind of audio/visual medium already installed in every American household.",
    "Ron DeSantis learning what happens when you launch things with Elon Musk [image]",
    "“Before you can be president, unmute yourself”",
    "Ron DeSantis sitting somewhere in a swivel chair 10 out of 10 raging",
    "Musk's talent for fucking over everyone he partners with is by far his most redeeming quality.",
    "Wait, I'm listening now. Is....is he...reading a speech into a Twitter Spaces? omg",
    "holy fucking shit, Ron DeSantis's campaign launch crashed and burned faster than a Tesla",
    "What a small, grumpy claque of incels and whiners.",
    "https://twitter.com/... [image]",
    "Launching my presidential campaign on ham radio",
    "Today in “The important thing is that the rocket cleared the launchpad!” [image]",
    "LOL. TFG https://twitter.com/...",
    "BuzzFeed exploding the watermelon hit 820,000 concurrent viewers in 2016 https://twitter.com/...",
    "All Presidential candidates are most welcome on this platform",
    "https://twitter.com/... [video]",
    "Ron DeSantis' campaign launch: [image]",
    "Well you do want these things to be memorable. 🤷‍♂️ https://twitter.com/...",
    "one of the worst websites I've ever seen [image]",
    "Ok now Joe from Scranton has entered the room with an epic dunk. https://twitter.com/...",
    "No advance prep? Idiot. https://twitter.com/...",
    "Sean Spicer vibes here https://twitter.com/...",
    "Trump was a political mastermind for his Twitter use, but DeSantis is “way too online.”",
    "This is the full video of DeSantis with Hitler and the devil posted on Trump's Instagram [video]",
    "Man what https://twitter.com/... [image]",
    "Live look at Tucker Carlson, who decided to broadcast his new show on Twitter [image]",
    "I think she might be leaving something out https://twitter.com/...",
    "The Jungle Cat, keeping it real. https://twitter.com/...",
    "Fantastic job all around https://twitter.com/...",
    "Biden is trolling Musk and DeSantis in real time. https://twitter.com/...",
    "he just destroyed ron and elon [video]",
    "Against all odds we could actually have a funny campaign season [image]",
    "can't believe this is how he announced [image]",
    "OpenAI may leave the EU if regulations bite - CEO",
    "OpenAI Could Quit Europe Over New AI Rules, CEO Sam Altman Warns",
    "ChatGPT-maker warns it might leave EU over planned AI law",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "Sam Altman Says OpenAI Will Leave the EU if There's Any Real AI Regulation",
    "ChatGPT could “cease operating” in the EU after proposed AI regulations",
    "AI could grow so powerful it replaces experienced professionals within 10 years, Sam Altman warns",
    "OpenAI could ‘cease operating’ in Europe over AI laws: Sam Altman",
    "OpenAI may quit Europe If AI regulation proves ‘challenging’: CEO Sam Altman",
    "No 10 acknowledges ‘existential’ risk of AI for first time",
    "Sam Altman's big European tour",
    "Sam Altman sells superintelligent sunshine as protestors call for AGI pause",
    "A conversation with OpenAI CEO Sam Altman | Hosted by Elevate",
    "Why OpenAI's Sam Altman was just in Lagos",
    "@paulo170595 @SimonFounder flew to paris, took the eurostar to london",
    "Wow, gpt4 even making physical travel way more efficient too 👏 https://twitter.com/...",
    "Joint Cybersecurity Advisory",
    "Volt Typhoon targets US critical infrastructure with living-off-the-land techniques",
    "People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection",
    "Chinese Malware Hits Systems on Guam. Is Taiwan the Real Target?",
    "National Security Agency/Central Security Service",
    "China rejects claim it is spying on Western critical infrastructure",
    "China hits back over Five Eyes blame for US infrastructure cyber attack",
    "Microsoft: Chinese hackers hit key US bases on Guam",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "U.S. and International Partners Release Advisory Warning of PRC State-Sponsored Cyber Activity",
    "Chinese hackers hit critical U.S. infrastructure, intelligence agencies warn",
    "China-backed hacker group spying on US critical systems, warns Microsoft",
    "China hits back after Microsoft says state-sponsored group hacked critical US infrastructure",
    "Why are Chinese hackers targeting Guam?",
    "Chinese Hacker Group Volt Typhoon Targets US Critical Infrastructure",
    "Chinese hackers breach US critical infrastructure in stealthy attacks",
    "‘Volt Typhoon’ China-Backed APT Infiltrates US Critical Infrastructure Orgs",
    "Microsoft links attacks on American critical infrastructure systems to China",
    "China's Stealthy Hackers Infiltrate U.S. and Guam Critical Infrastructure Undetected",
    "US, Microsoft warn Chinese hackers attacking ‘critical’ infrastructure",
    "Microsoft says Chinese state-sponsored hackers penetrate critical U.S. infrastructure",
    "Beware, Volt Typhoon: Chinese hackers pose clear, present danger to US, says Microsoft",
    "Five Eyes and Microsoft accuse China of attacking US infrastructure again",
    "Microsoft chief calls for humans to rule AI, safeguard critical infrastructure",
    "Microsoft's President Backs New Agency to Regulate ChatGPT, Other AI Systems",
    "Microsoft Calls for A.I. Rules to Minimize the Technology's Risks",
    "Microsoft outlines its vision for keeping A.I. in check",
    "Microsoft provides AI governance principles following ChatGPT popularity",
    "Fahrenheit Wins Bid to Acquire Assets of Insolvent Crypto Lender Celsius",
    "Arrington Capital-backed group to acquire Celsius assets",
    "Michael Arrington-Backed Fahrenheit LLC Wins Bid to Buy Bankrupt Celsius",
    "Fahrenheit Consortium Wins Bid to Acquire Celsius Network",
    "Fahrenheit Emerges Victorious, Acquires Celsius' Assets In A Bidding War",
    "Celsius Network's bold bid selection revealed",
    "Fahrenheit Consortium acquires bankrupt Celsius Network",
    "Celsius Bankruptcy Struggles Coming to an End as Fahrenheit Clinches Win in Auction",
    "Crypto lender Celsius picks Fahrenheit's bid for bankruptcy exit",
    "Fahrenheit To Acquire Assets of Bankrupt Crypto Lender Celsius",
    "Crypto Consortium Fahrenheit Wins Bid to Acquire Bankrupt Celsius' Assets",
    "Fahrenheit Emerges as Winner in Bid to Acquire Celsius' Assets",
    "Fahrenheit wins auction for Celsius' assets",
    "Fahrenheit buying Celsius? You can't make this up",
    "This is just outstanding https://www.coindesk.com/... via @coindesk",
    "PlayStation Showcase 2023 - Accessories Sneak Peek",
    "Sony announces Project Q handheld for local streaming of PlayStation 5 games",
    "Sony Teases Project Q, A Mobile PS5 Streaming Game Console With An 8-Inch Display",
    "PlayStation Showcase recap: everything announced at today's show",
    "Sony's ‘Project Q’ Handheld Streams Games From Your PS5",
    "Sony PlayStation Project Q: Everything you need to know",
    "Sony's PS5 streaming Project Q handheld will launch this year",
    "PlayStation Showcase 2023: Spider-Man 2 impresses, Project Q confuses",
    "Sony's PlayStation handheld reportedly arriving in November",
    "PlayStation handheld may release just in time for the holidays",
    "Sony's Project Q PlayStation 5 Handheld May Launch In November",
    "Sony's Next Handheld Project Q Reportedly Releasing This November",
    "PlayStation's Handheld Project Q Reportedly Launching In November",
    "Sony's Project Q is a handheld without the portability",
    "Sony launches its first PlayStation earbuds for gamers",
    "I want Apple to steal this unexpected PlayStation Earbuds feature",
    "Project Q: Sony announces new gaming handheld",
    "Sony launches PlayStation earbuds with lossless, low-latency audio for PC and PS5",
    "What is PlayStation Project Q and how does it work?",
    "Sony Project Q handheld console will fundamentally change how PS5 users game",
    "PlayStation ‘Project Q’ Streaming Device Launches Later This Year",
    "PlayStation to release a new streaming handheld Project Q",
    "PlayStation Officially Unveils The Handheld Project Q",
    "Sony's making a new handheld to stream PS5 games",
    "Currently scheduled to release mid-late November 2023.",
    "Cannot wait to play Square Enix's Splatoon on my Sony Wii U [image]",
    "wii u did this 11 years ago and you all laughed https://twitter.com/...",
    "Nvidia forecasts second-quarter revenue above estimates",
    "NVIDIA Announces Financial Results for First Quarter Fiscal 2024",
    "Nvidia, AMD Stocks Up Sharply as AI Drives Chip Demand",
    "Nvidia Soars to a Record as Worldwide AI Boom Fuels Chips Demand",
    "NVIDIA Chases Trillion Dollar Market Cap After A Stellar Quarter And AI Outlook",
    "Nvidia Poised for Record Sales as AI Demand Kicks In",
    "Nvidia stock price is surging thanks to ChatGPT and an expected boom in generative AI",
    "NVIDIA shares soar as AI demand boosts revenues and forecast",
    "The A.I. chip boom is pushing Nvidia toward $1 trillion, but it won't help Intel and AMD",
    "Nvidia races towards $1tn club as AI frenzy drives chip stocks higher",
    "Nvidia revenue falls but AI-focused forecast sees stocks surge",
    "NVIDIA revenues fell 13% in Q1 compared to the year before",
    "NVIDIA is on its way becoming a trillion dollar company all because of AI. [image]",
    "nvidia just added an intel-sized $150bn to its market cap after hours",
    "Nvidia's $NVDA Q1 visualized [image]",
    "+26% after hours. That's nearly $200b in one day https://twitter.com/...",
    "The number of big egos who tried to get cute and short NVDA They didn't listen... [image]",
    "Nvidia just added $151B to its market cap in under 30 minutes. Insanity.",
    "I didn't name my dog Nvidia for nothing",
    "Walking naturally after spinal cord injury using a brain-spine interface",
    "AI is the key to astonishing breakthrough that allowed paralysed man to walk again",
    "A paralyzed man can walk again using a groundbreaking mind-reading brain implant",
    "Mind-reading AI allows paralyzed man to walk again",
    "Brain implants help paralysed man to walk again",
    "Swiss researchers develop tech to help person with paralysis walk again",
    "Paralyzed man walks for first time in over a decade with electronic brain implants",
    "Motorcycle crash victim can walk and do chores thanks to brain, spine implants",
    "AI-based ‘digital bridge’ enables paraplegic patient to walk",
    "Full paper here: https://www.nature.com/...",
    "Microsoft appeals UK's block on Activision deal",
    "EU defends split with UK on Microsoft, Activision Blizzard bid",
    "The EU explains why it approved Microsoft's Activision Blizzard deal.",
    "Microsoft appeals UK veto of Activision Blizzard takeover",
    "Microsoft's appeal over UK's Activision veto is ‘chance to find a third way,’ say legal experts",
    "Microsoft Has Officially Appealed The CMA Decision On Their Activision Deal",
    "Microsoft Officially Appeals UK CMA Decision to Block the Activision Blizzard Merger",
    "Microsoft appeals against UK watchdog's veto of Activision Blizzard takeover",
    "Microsoft to lodge appeal against UK regulator's block of Activision deal - Sky News",
    "ChatGPT for iPhone now available in the UK and 10 other countries; unfair Apple criticism",
    "ChatGPT for iOS is now available in 11 more countries",
    "How to use ChatGPT on iPhone for good, not evil",
    "The official ChatGPT app on iOS is now available in 11 more countries",
    "The official ChatGPT app is now available in 11 more countries",
    "ChatGPT app expands to 11 more countries",
    "United Nations official and others in Armenia hacked by NSO Group spyware",
    "Pegasus iPhone spyware is now a tool of war",
    "Apple alerted Pegasus spyware victims during first known use in a military conflict",
    "Researchers say they found spyware used in war for the first time",
    "NSO Spyware Used to Target Prominent Armenians, Researchers Say",
    "NSO spyware used in Armenia-Azerbaijan conflict, report finds",
    "‘Despicable’ iPhone Hacks In Armenia Find NSO Spyware ‘In Active Warzone’",
    "Confirmation & Research Note 1: Pegasus infections in Armenian Civil Society",
    "Pegasus Spyware Is Detected in a War Zone for the First Time",
    "Committee to Protect Journalists",
    "Radio Free Europe/Radio Liberty",
    "Probe Reveals Dozens Targeted By Pegasus Spyware In Armenia, Including Two RFE/RL Journalists",
    "Azerbaijan Suspected in Hacking of Armenian Officials With Israeli NSO Spyware",
    "Researchers find Israeli-made spyware deployed across Armenia",
    "Armenia/Azerbaijan: Pegasus spyware targeted Armenian public figures amid conflict",
    "Armenians hacked with Pegasus spyware during war: NGO",
    "Sam Altman's Crypto Project Worldcoin Raises $115M, Led By Blockchain Capital",
    "Worldcoin developer nets $115 million fundraise led by Blockchain Capital",
    "Tools for Humanity Secures $115 Million in Funding Round Led by Blockchain Capital",
    "$115M for Worldcoin Secured: ChatGPT, OpenAI CEO Closes Successful Fundraiser",
    "Who is Starling Bank's new CEO John Mountain?",
    "UK's Starling Bank CEO departs months after it pulled out of Ireland launch",
    "One of Britain's Only Female Bank Bosses Is Stepping Down",
    "Iconic Fintech Founder Anne Boden Announces Exit as CEO of Starling Bank",
    "Starling founder Anne Boden relinquishes CEO role",
    "Boss of Goldman-backed digital bank Starling to step down next month",
    "Anne Boden to step down as chief of Starling as bank reports record profits",
    "Anne Boden to step down as Starling chief executive",
    "Starling Bank chief Anne Boden to step down amid record profit",
    "Breaking: Anne Boden to step down as Starling Bank CEO, as bank reports record profits of £195m",
    "She going to YC too? https://twitter.com/...",
    "Snowflake acquires Neeva to accelerate search in the Data Cloud through generative AI",
    "Silicon Valley Business Journal",
    "Snowflake acquires Neeva, sees stock get hammered following Q1 earnings report",
    "Snowflake acquires Neeva to bring intelligent search to its cloud data management solution",
    "SNOW Shares Plunge 14% as Snowflake Shares Posts Revenue Guidance",
    "Cloud data warehousing firm Snowflake acquires search startup Neeva",
    "Neeva joins Snowflake to bring the power of search and generative AI to Snowflake Customers",
    "Snowflake slashes forecast, stock slumps after earnings",
    "These guys can't go a month without trying to knife each other [image]",
    "Working together with YouTube",
    "Motorola Edge+ 2023 review: Boring design aside, this is a flagship worth considering",
    "Motorola Edge Plus Review: Refined Style and Specs, but Still Lost in the Crowd",
    "Motorola Edge Plus (2023) review: a Pixel 7 Pro and Galaxy S23 killer",
    "Score! The Samsung Galaxy S23 just crashed to lowest price ever",
    "Binance Launching NFT Loan Feature",
    "Binance Jumps on the NFT Lending Frenzy with ETH Loans",
    "Facebook owner Meta slashes business teams in final round of layoffs",
    "Meta global layoffs hit India, top executives among those asked to go",
    "Meta conducts yet another round of layoffs",
    "Meta has started its latest round of layoffs, focusing on business groups",
    "Meta Begins Another Round of Layoffs that Would Impact 6,000 More Employees",
    "Meta Begins ‘Final’ Layoff Round, With Thousands Affected",
    "Meta Layoffs Impacts Top Indian Execs",
    "Meta's Latest Cuts Include Trio of Top Sports Executives",
    "The first AI navigator for your entire network",
    "TikTok is testing an AI chatbot called Tako",
    "TikTok testing AI chatbot called ‘Tako’, research firm says",
    "TikTok Is Testing Its Own AI Chatbot Called Tako",
    "Tako is TikTok's AI chatbot, currently in testing",
    "OpenAI Raises $175 Million For Startup Investment Fund",
    "Investors are so horny for AI that they've invested $175mn in OpenAI's VC fund",
    "OpenAI Closes $175 Million Startup Investment Fund",
    "OpenAI raises $175m in funding to invest in AI start-ups",
    "Because every AI driven YC company needs follow on. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/24 - Microsoft Build Wrapup",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Nasdaq's Surprisingly Tough Fight for the Year's Marquee IPO",
    "eFishery becomes Indonesia's latest unicorn with 42XFund-led $108m Series D funding",
    "Singapore Grab co-founder Tan Hooi Ling to quit operational roles",
    "Grab co-founder Tan Hooi Ling to step down from operational roles",
    "Tan Hooi Ling to relinquish operations roles at Grab",
    "GRIMES REVIEWS A.I. GRIMES SONGS https://www.nytimes.com/... [image]",
    "Amazon to shutter its Chinese Appstore - the one used by hardly anyone, anywhere",
    "Amazon to Stop Providing App Store Services in China",
    "Amazon suspends Appstore services",
    "Amazon to Shut Down App Store Service in China, Succumbing to Local Competition",
    "Amazon China Will No Longer Provide App Store Services Starting July 17",
    "Amazon to stop providing app store services in China",
    "Amazon's Appstore to Shut Down in China",
    "Minnesota Passes Right to Repair",
    "Minnesota passes a right to repair bill that actually matters",
    "Right-to-repair rules are now the law in Minnesota",
    "Minnesota passes broadest Right to Repair measure to date",
    "Another win for the new Minnesota Vikings https://prospect.org/... https://twitter.com/...",
    "Right to repair is now the law of the land in Minnesota! https://www.ifixit.com/...",
    "Supreme Court of the United States",
    "Google never agreed it wouldn't copy Genius' song lyrics, US official says",
    "ML Genius Holdings LLC v. Google LLC",
    "Google Play Games for PC Beta Launches in Europe and New Zealand",
    "Google Play Games for PC is now available in Europe and New Zealand",
    "Google Play Games for PC Beta are now accessible to Europe",
    "Google Play Games out in Europe and New Zealand | News-in-brief",
    "Google Play Games Beta arrives for Samsung Galaxy laptops in Europe",
    "Google expands the availability of Play Games for PC to Europe",
    "Google Play Games now available on Galaxy laptops in Europe",
    "Google Play Games for PC launched in Europe",
    "Google Play Games for PC levels up with availability spreading to Europe",
    "Google Play Games on PC is now available in Europe and New Zealand",
    "Play Games for PC Beta opens up to Europe and New Zealand",
    "Do Kwon jail stay extended despite already posting huge bail",
    "Terra's Do Kwon To Remain Detained In Montenegro, Bail Revoked",
    "Montenegro Court Revokes Bail For Do Kwon In Fake Passport Case",
    "Terraform Labs Executives Denied Bail in Montenegro",
    "Do Kwon will remain detained in Montenegro",
    "iOS 17 Could Turn the iPhone Lock Screen Into a Smart Home Display",
    "iOS 17 Said to Feature Wallet, Find My, SharePlay, and AirPlay Upgrades",
    "Is the iPad gearing up to become your new home hub?",
    "iOS 17 to feature smart display mode when your iPhone is locked",
    "Apple could transform the iPhone lock screen to a smart display in iOS 17",
    "Apple plans to turn your iPhone into a smart display with iOS 17",
    "Leaks suggest iOS 17 could make your iPhone way more useful in the home",
    "The Pixel Tablet could have an unlikely competitor — your iPhone",
    "iOS 17 Will Turn an iPhone Into a Smart Home Display When Docked",
    "iOS 17 will turn locked iPhones into smart home-style displays, report says",
    "Apple reportedly working with hotels to expand AirPlay availability with iOS 17",
    "HuRAR! Microsoft brings native support for additional archive formats to Windows 11",
    "Windows 11 Quietly Updated with Support for RAR Archive File Format",
    "Windows 11 users no longer need third-party apps to open RAR files",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Netflix Begins Crackdown on Password Sharing in the UK and US",
    "Netflix's Dumb Password Sharing Crackdown Will Cost You $8 Per Moocher",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix's password crackdown has started in the U.S.",
    "The free ride is over. https://about.netflix.com/..."
]