[
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix's password crackdown has started in the U.S.",
    "Netflix expands controversial password sharing crackdown in Europe",
    "Netflix's password-sharing crackdown has come to Ireland",
    "How to cancel Netflix  —  Looking to cancel Netflix now that password sharing is coming to an end?",
    "Netflix Launches Paid Sharing in U.S., Will Start Blocking Users With Unauthorized Passwords",
    "Netflix's global password crackdown is off to a terrible start",
    "Netflix cracks down password-sharing in Malaysia: extra user slot costs RM13 per month",
    "Netflix to start charging US customers for sharing account passwords",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix is cracking down further on account sharing",
    "Netflix extends password sharing crackdown",
    "Netflix's crackdown on password sharing expands to the US",
    "Netflix begins password sharing crackdown in the US, UK, and other regions",
    "Netflix's password-sharing crackdown is here: How much it'll cost you now",
    "The Netflix password sharing crackdown is here. Check your inbox.",
    "It's time: Netflix's account sharing fee is now live in the US for $7.99 a month per user",
    "Adding Extra Members to Your Netflix Account Costs $8 a Pop",
    "Sharing a Netflix password will now cost $7.99 a month per additional user",
    "Netflix password sharing crackdown finally hits the United States",
    "Want to share your Netflix account? That'll be an extra $8",
    "Netflix expands password-sharing crackdown worldwide",
    "Netflix Password Sharing Crackdown Rolls Out in the U.S.",
    "Pay up!  Netflix begins account sharing crackdown in the U.S.",
    "The Netflix crackdown on password sharing in the US has arrived",
    "Netflix reveals cost of adding members in password-sharing crackdown",
    "Netflix finally brings its password-sharing crackdown to the US, its biggest market",
    "Netflix Tells US Consumers to Stop Sharing Accounts",
    "Netflix Announces Extra Member Tier as First Step of U.S. Password-Sharing Crackdown",
    "@campuscodi@mastodon.social",
    "Twitter Is a Far-Right Social Network",
    "DeSantis Set to Announce 2024 Run on Twitter With Elon Musk",
    "The surgeon general's warning is a wake-up call for social networks",
    "The Hill's Morning Report — DeSantis to share '24 campaign debut with Musk",
    "5 Things to Know Before the Stock Market Opens Wednesday",
    "Ron DeSantis to Join Elon Musk on Twitter Wednesday to Announce 2024 Run",
    "DeSantis sees a path to the White House — 240 characters at a time",
    "Florida college student who shared location of Elon Musk is now tracking Ron DeSantis",
    "Musk's Twitter tries to recapture the political spotlight post Trump with DeSantis 2024 run",
    "Is Elon Musk's Twitter about to supplant Fox News?",
    "Explainer: What is Twitter Spaces where DeSantis will announce his presidential run?",
    "Elon Musk is Set to Host Ron DeSantis' Presidential Campaign Launch via Twitter Spaces",
    "Why YouTube is a tough place for kids podcasts",
    "DeSantis to Announce 2024 Presidential Run in Interview with Elon Musk",
    "Ron DeSantis to Launch 2024 Presidential Run in Twitter Talk With Elon Musk",
    "Elon Musk will launch Ron DeSantis' presidential campaign on Twitter Spaces",
    "Elon Musk Is Going to Try to Make Ron DeSantis Cool",
    "Ron DeSantis to announce presidential bid in Twitter Space with Elon Musk",
    "DeSantis to Announce His 2024 Campaign Alongside Elon Musk",
    "DeSantis to announce 2024 bid on Twitter Spaces meeting with Elon Musk",
    "Ron DeSantis to announce 2024 presidential campaign Wednesday in conversation with Elon Musk",
    "Breaking: DeSantis To Declare Presidential Bid In A Twitter Space With Elon Musk | Coingape",
    "@lauren@mastodon.laurenweinstein.org",
    "Well this ‘analysis’ from the Times aged wonderfully... https://twitter.com/... [image]",
    "Musk hasn't even endorsed DeSantis and praised one of his opponents last week lmao [image]",
    "Unsafe levels of dork energy in one place https://twitter.com/...",
    "So much free speech, it's blinding. https://twitter.com/...",
    "This is a real slap in Fox's face https://www.semafor.com/... [image]",
    "Wonder if this is going to be the thing that makes Trump start tweeting again?",
    "Worth noting Sacks is belligerently isolationist on Ukraine https://twitter.com/...",
    "That's one way to make your candidate seem human! https://www.nytimes.com/...",
    "The guy DeSantis is launching his campaign with hasn't even endorsed him lmao [image]",
    "Elon Musk: Twitter must be politically neutral also Elon Musk: [image]",
    "San Francisco Business Journal",
    "The Biggest Challenge for Twitter's New CEO Will Be Managing Elon Musk",
    "With DeSantis campaign event, Musk seeks to shore up a sinking Twitter",
    "AP sources: DeSantis to announce 2024 presidential bid Wednesday on Twitter Spaces with Elon Musk",
    "Elon Musk signals Twitter's headquarters may leave San Francisco",
    "The Official Microsoft Blog",
    "Microsoft Developer on YouTube",
    "@thekenyeung@mastodon.social",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "Bing at Microsoft Build 2023: Continuing the Transformation of Search",
    "Key announcements from Microsoft Build 2023",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Empowering every developer with plugins for Microsoft 365 Copilot",
    "Here are all the AI updates Microsoft announced at its developers conference keynote",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Hallelujah! Windows 11 is finally introducing RGB lighting standards",
    "Here are the biggest announcements coming out of Microsoft Build 2023",
    "Microsoft integrates AI front & centre into Windows 11 with Windows Copilot",
    "New Windows 11 File Explorer design gets teased by Microsoft during Build 2023",
    "Microsoft Build 2023: Copilots & Plugins",
    "Windows Copilot: Your new AI assistant for Windows 11",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "Microsoft wants you to think inside the Dev Box from July",
    "Bing Integrates With ChatGPT",
    "Microsoft flaunts redesigned and modern File Explorer in Windows 11",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft Build 2023: What businesses need to know",
    "Microsoft & OpenAI to create a new ecology of chat robot plugins",
    "Microsoft Build 2023: Every major AI and Bing Chat announcement",
    "For Microsoft, AI belongs everywhere",
    "OpenAI's Brockman: Industry use cases, developers next stage for generative AI, ChatGPT",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft launches generative AI tools for developers",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "A livestream of the Microsoft Build 2023 keynote",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "The man who put Microsoft in the AI lead",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Microsoft confirms 365 Copilot AI will be ‘natively integrated’ into Edge",
    "Bing Search is coming to ChatGPT",
    "With Windows Copilot, every Windows user can be a power user. https://blogs.windows.com/...",
    "Chinese Businesses Fueling the Fentanyl Epidemic Receive Tens of Millions in Crypto Payments",
    "Crypto payments to China chemical suppliers fuel US fentanyl epidemic",
    "Chinese Companies Selling Fentanyl Received More Than $27 Million In Crypto Payments: Report",
    "Chinese companies selling synthetic opioid chemicals raked in $27M in crypto payments",
    "Kane and Pia Muehlenbeck on YouTube",
    "First Impressions: Final Cut Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad are here",
    "Final Cut Pro and Logic Pro for iPad now available on the App Store",
    "Final Cut Pro and Logic Pro are finally available on your iPad - here's how to get them",
    "Apple releases Final Cut Pro and Logic Pro for iPad",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro for iPad Reviews: Worth the Wait, But Some Limitations",
    "Final Cut Pro on iPad Feels Like a Great and Optional Upgrade",
    "Apple Brings Final Cut Pro And Logic Pro To iPad",
    "Final Cut Pro iPad hands-on - one of Apple's best multi-touch apps on iPad",
    "The biggest features missing from Final Cut Pro for iPad at launch",
    "2023 Apple Design Awards finalists announced",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut Pro for iPad: Release date, features, compatibility, price",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Final Cut Pro For iPad 1st Review: Smooth, Fast And Affordable",
    "Final Cut Pro for iPad Now Available",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "Apple has officially released Final Cut Pro and Logic Pro for iPad",
    "Apple Updates Final Cut Pro and Logic Pro for Mac to Support New iPad Apps",
    "FINAL CUT PRO FOR IPAD - First impressions for travel vlogging",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "Final Cut Pro for iPad is finally here - and its secret weapon is the Apple Pencil",
    "Final Cut Pro on iPad is a game changer for content creators — here's why",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro on iPad: Effortless Editing",
    "Apple Final Cut for iPad Review: Lots Here, But Some Things Still Missing",
    "Final Cut Pro on iPad is AMAZING - Hands on Review!",
    "Oh nooo, my beloved Markers are not in FCP for iPad 🥲",
    "@johnvoorhees@mastodon.macstories.net",
    "Final Cut Pro on iPad is working properly now and is glorious. [image]",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Logic Pro for iPad: Release date, features, compatibility, price",
    "Get creative: Final Cut Pro and Logic Pro launch for iPad",
    "Hands-On With Apple's Logic Pro for iPad",
    "No subscriptions in Final Cut Pro and Logic Pro for Mac following iPad versions.  Yet...",
    "Final Cut Pro and Logic Pro for macOS updated with new features and support for iPad apps",
    "Hands On With Apple's Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Introducing a new era of AI-powered ads with Google",
    "Yes, Google's AI-infused search engine will have ads",
    "Google AI Moves Slowly to Google Advertising. Soon, That Is. Soon.",
    "Google Will Soon Show You AI-Generated Ads",
    "Here's how ads might look in Google's new AI-powered search experience",
    "Google debuts new generative AI advertising tools",
    "Google details plans for AI-generated ads in Search",
    "Generative AI Is Coming Soon To Search, Performance Max And Google Ads",
    "What ads will look like in Google's Search Generative Experience [Gallery]",
    "@chrismessina@mastodon.xyz",
    "New tools to help small businesses connect with online shoppers",
    "Google Product Studio brings AI-generated images to advertisers",
    "Google Ads Generative AI Performance Max & New Google Product Studio",
    "Google Unveils ‘Product Studio’ AI Tool for Small Businesses",
    "Google will roll out new AI tools for advertisers, marketers",
    "Google Product Studio Lets Merchants Create Product Imagery With Generative AI",
    "Embracer cuts forecast after collapse of “groundbreaking” $2 billion partnership deal",
    "Tomb Raider games firm Embracer tumbles after partnership talks collapse",
    "Embracer's shares plummet after $2bn partnership deal evaporates",
    "Embracer CEO Admits ‘Challenging Year’ Despite ‘Encouraging’ Sales For Dead Island 2",
    "Embracer Group Stock Crashes Following Cancellation of Transformative $2 Billion Deal",
    "Oh sheeeeeeesh I'd hoped Embracer would actually ship games... https://twitter.com/...",
    "ghosted for 2 bil lmao https://twitter.com/...",
    "@ravirockks@infosec.exchange",
    "Google Mobile Vulnerability Reward Program Rules",
    "Google Launches Bug Bounty Program for Mobile Applications",
    "Google announced its Mobile VRP (vulnerability rewards program)",
    "Android fingerprint locks are on thin ice",
    "Google Unveils Bug Bounty Program For Android Apps",
    "Google wants to pay you for finding security flaws in its biggest Android apps",
    "Find Android bugs, earn up to $30k",
    "Android should become a more secure platform thanks to new bug bounty program for Google apps",
    "Generative AI Podcasts Are Here. Prepare to Be Bored",
    "Spotify may use AI to make host-read podcast ads that sound like real people",
    "Spotify could employ AI-generated voices to read you personalized ads",
    "AI Voices Could Soon be Reading Ads on Spotify Podcasts",
    "Encoding of speech in convolutional layers and the brain stem based on language experience",
    "Center for Democracy and Technology",
    "Lost in Translation: Large Language Models in Non-English Content Analysis",
    "PSVR 2 sold just shy of 600,000 units in six weeks",
    "PSVR 2 Outsold Original PSVR in First 6 Weeks, Sony Confirms",
    "Sony says it sold 600,000 PS VR 2 units in six weeks",
    "I was getting concerned about PSVR 2 — but Sony just reassured me about its future",
    "PSVR2 Sales at 600,000 Six Weeks After Launch, Sony Confirms",
    "Despite high price, PlayStation VR2 still beat predecessor's launch sales",
    "PS VR2's launch sales surpass original headset, Sony says",
    "PS VR2 sales surpass expectations, Sony confirms",
    "The PlayStation VR 2 Sold Better At Launch Than Original PSVR",
    "PlayStation is betting big on new franchises and live service games",
    "Sony Confirms PSVR 2 Sold 600k Units Up To April, Outpacing Original PSVR Launch",
    "Sony Prepares ‘Aggressive’ Cloud Gaming Push in Coming Months",
    "Sony claims PS VR2 sales are ahead of projections and is outselling original headset",
    "PlayStation VR2 Has Sold Almost 600,000 Units Since Launch",
    "OpenFin Raises $35M in Series D Funding",
    "Bank of America leads $35 million round in OpenFin",
    "digital nomads still thriving, homogenizing the world https://restofworld.org/... [image]",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "Xiaomi Q1 revenue falls 18.9%, net income up 13.1%",
    "Welcoming AI to the Microsoft Store on Windows",
    "How to use the AI features in Microsoft Store on Windows",
    "Microsoft opens the door to allow more Android apps on Windows 11",
    "Build 2023: Microsoft Store Adds AI Hub and AI Summaries to Showcase AI Apps",
    "Microsoft Store hones in on AI in Windows with new section and AI-generated reviews",
    "AI is headed to the Microsoft Store on Windows",
    "How to use Bing with OpenAI & ChatGPT: Everything that you need to know",
    "Windows 11 is getting a ChatGPT-boosted AI assistant",
    "Microsoft Reveals Over 50 AI Tools",
    "ChatGPT will Now have Bing Search Engine Built-In",
    "Bing search engine is now built into ChatGPT as Microsoft looks to boost traffic",
    "Windows Copilot adds ChatGPT-like assistant to Windows 11, but doesn't fix what's wrong",
    "Bing Search Is The Default Search Engine For ChatGPT",
    "ChatGPT rivals Bard even more with its new features",
    "Tools Of The Trade: When To Use ChatGPT And When To Use Google",
    "Bing becomes the default search engine of ChatGPT",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "Microsoft integrates Bing Search into OpenAI's ChatGPT",
    "Microsoft integrates Bing Search with ChatGPT, launches common plugins platform",
    "ChatGPT Will Use Bing to Answer Questions",
    "ChatGPT Adding Bing as Its Default Search Experience",
    "8 Key Factors to Consider When Testing AI Chatbots for Accuracy",
    "Microsoft to Integrate Bing Search into OpenAI's ChatGPT",
    "ChatGPT is about to integrate Bing and leave Google in the dust",
    "OpenAI makes Microsoft Bing the default search in ChatGPT",
    "ChatGPT Is Using Microsoft's Bing to Deliver Answers",
    "Global strategy to regulate crypto assets",
    "Microsoft beats Google by integrating an AI assistant straight into its OS",
    "Build 2023: Microsoft Tackles Inappropriate Content with Azure AI Content Safety",
    "Safety. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "AI Startup Figure Raises $70 Million for Humanoid Robot",
    "AI startup Figure raises $70 million to build humanoid robots",
    "South Korea warns US could ‘overburden’ its chipmakers with China limits",
    "S. Korea asks US to give more leeway on chip expansion in China",
    "Samsung, SK Hynix may eventually suffer more than benefit from Micron sanction",
    "The Logi Dock Flex Is Designed To Entice Workers Back To The Office",
    "Logitech G Pro X 2 Lightspeed review: You'll really hear the difference",
    "Logitech's Pro X 2 gaming headset promises longer battery life",
    "Logitech's new G Pro X 2 gaming headset has graphene audio drivers",
    "Court rejects Meta's challenge against EU antitrust requests for information",
    "Facebook-owner Meta must hand over data to European regulators in anti-competitive probe",
    "EU court rejects Meta challenge against EU antitrust requests for information",
    "Meta loses court battle with European Commission over request to hand over documents",
    "META LOSES ITS FIGHT OVER EU'S HUNT FOR ANTITRUST PROBE EVIDENCE.",
    "Alibaba to cut 7% of cloud unit workforce in preparation for separate IPO",
    "Alibaba's Cloud arm plans workforce reduction of 7% in overhaul: Report",
    "Alibaba Cloud to cut 7 per cent of staff ahead of planned IPO",
    "Alibaba's Cloud Arm to Cut 7% of Staff in Overhaul, Sources Say",
    "Alibaba Cloud to Downsize Headcount by 7%, with Layoff Signaling Beginning of Its Spinoff Process",
    "Alibaba Cloud is laying off 7% of its workforce",
    "Alibaba to cut 7% of workforce in its cloud unit as it pursues IPO for the division",
    "Alibaba to lay off 7% of workforce in its cloud division ahead of the unit IPO",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "TikTok Responds to Montana Ban With a Lawsuit",
    "The Exclusive College Club Training Student Influencers",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "TikTok Fights Back: Sues Montana Over Controversial App Ban",
    "TikTok Giving Oracle Code Access Amid Security Concerns",
    "Now TikTok Sues To Stop Montana's TikTok Ban",
    "TikTok CEO says ‘we will prevail’ against Montana ban",
    "Montana's attempt to ban TikTok is facing multiple legal challenges",
    "Goldman Sachs backs Japan's biggest taxi app with $1 billion valuation",
    "Japanese taxi-hailing platform GO raises nearly $75m from Goldman Sachs",
    "Windows 11 getting native support for 7-Zip, RAR, and GZ archives",
    "Microsoft finally gets around to supporting rar, gz and tar files in Windows",
    "Windows 11 Is Getting Native RAR, 7-ZIP, TAR, GZ File Compression Support",
    "Windows 11 can now natively open RAR files",
    "Ahoy, matey! Windows 11 will soon have native RAR support",
    "Windows 11 will soon extract RAR, 7z and other archive formats natively",
    "Microsoft uses open source to kill WinRAR by adding native .rar support to Windows 11",
    "Opening RAR files natively in Windows 11 is coming and people online are going crazy over it",
    "Thanks for everything, WinRAR: Windows is finally getting native RAR support",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Banking infrastructure innovator, Episode Six, clinches $48m in Series C funding",
    "Flipboard is ready to work with Bluesky and Pixelfed",
    "Peloton's latest turnaround efforts are new app memberships",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton Works to Stay Relevant With Massive Rebrand",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "Peloton App Gets a Free Tier",
    "Peloton relaunches its workout app with new free and pricier subscription tiers",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "BuzzFeed cooks up new AI-powered recipe generator, Botatouille",
    "BuzzFeed's Chatbot Mistake, Bing's Big Goal",
    "Pixar meets The Last of Us movie about botulism toxin controlling a chef https://twitter.com/...",
    "A little too botulism evoking for me https://twitter.com/...",
    "Introducing Microsoft Fabric: Data analytics for the era of AI",
    "Reduce your business costs with AI-powered Microsoft Fabric",
    "Microsoft announces unified analytics platform Fabric",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "Anthropic Raises $450 Million for ‘Honest’ AI Systems",
    "AI developer Anthropic raises $450M in Series C round",
    "Anthropic Raises $450 Million to Fuel AI Work",
    "Google-backed Anthropic raises $450 million in latest AI funding",
    "AI Craze Hits New Level As Anthropic Locks Up $450M, Builder.ai Closes $250M Round",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple partners with Broadcom for USA-made components",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple partners with Broadcom for developing 5G components: Check details",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple secures supply of 5G components as it signs new multibillion-dollar deal with Broadcom",
    "Apple enters multibillion-dollar mobile chip deal with Broadcom",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple Extends Broadcom Pact With Multibillion-Dollar 5G Deal",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO"
]