[
    "Reddit CEO Steve Huffman: 'It's time we grow up and behave like an adult company'",
    "Reddit's CEO really wants you to know that he doesn't care about your feedback",
    "Reddit has a terrible plan to end blackout: ask you to vote out protesting mods",
    "Key Facts to Understanding Reddit's Recent API Updates",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts",
    "Reddit is in crisis as prominent moderators loudly protest the company's treatment of developers",
    "RIF developer counters Reddit CEO's claims that he didn't want to work with Reddit",
    "Reddit's fight with its most powerful users enters new phase as blackout continues",
    "Reddit CEO compares moderators to aristocracy as blackout stretches on",
    "The Reddit blackout is already forcing unexpected changes",
    "Reddit CEO lashes out on protests, moderators and third-party apps",
    "Why Reddit Is Destined to Turn to Crap",
    "Reddit CEO Steve Huffman: Third-Party Apps Aren't Adding Much Value",
    "iMore Show #846: How Reddit is Killing Apollo - we chat to Christian Selig",
    "Reddit releases new fact sheet, says 80% of its top 5,000 communities are open",
    "Reddit CEO boldly says API fees are here to stay, blackout or not",
    "Reddit CEO doubles down on API changes",
    "Reddit CEO gives update on API changes while showing he really doesn't care about your feedback",
    "Reddit CEO Pushes Back Against Blackout—Will Consider Letting Users Vote Out Moderators",
    "Reddit's CEO Is Just Making Everything Worse",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’",
    "Reddit CEO Stands Firm Amidst Protests: 'It's Time We Grow Up'",
    "Oh man.  He's doing the CEO equivalent of posting through it.",
    "Spez is a little bitch and I hope his IPO fails and he gets shitcanned. https://twitter.com/...",
    "‘Reddit is fighting for its soul.’ TIL vampires have souls. Who knew https://twitter.com/...",
    "Gorilla mindset, baby. https://twitter.com/...",
    "the reddit ceo looks like someone who posts in alt-right subreddits https://twitter.com/...",
    "this may be one of the greatest ceo meltdowns we'll ever witness https://twitter.com/... [image]",
    "never go full elon https://twitter.com/...",
    "Yeah well users should be able to vote out executives https://twitter.com/...",
    "Lol Reddit is only going to get more fun over the next two weeks https://twitter.com/...",
    "It also wasn't designed to pay dividends to shareholders https://twitter.com/...",
    "Reddit CEO slams protesters, calls them “landed gentry”",
    "Mods will be removed one way or another: Spez responds to the API Protest Blackout.",
    "Reddit's CEO really wants you to know he doesn't care about your feedback",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Blackouts",
    "The landed gentry on ToS...",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Reddit CEO slams protest leaders, calls them ‘landed gentry’",
    "Reddit CEO Steve Huffman isn't backing down: our full interview",
    "“Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts”",
    "Reddit CEO slams protest leaders, saying he'll change rules that favor ‘landed gentry’",
    "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’ - The Verge",
    "Subreddits need a land value tax. https://twitter.com/...",
    "Steve Huffman really asked Elon Musk to hold his beer... https://www.nbcnews.com/...",
    "Who art thou landed gentry :-)",
    "Reddit tyrant-in-chief finds more fuel for the dumpster fire with threat to replace moderators",
    "Reddit CEO Threatens to Boot Moderators Who Back Blackout Protest",
    "Reddit CEO Plans to Pursue Changes to Company's Moderator Removal Policy",
    "Reddit Reportedly Begins Telling Mods To Reopen Shuttered Subreddits Or Face Replacement",
    "Reddit CEO Suggests User Votes to Remove Moderators",
    "Reddit CEO Flames Protesting Moderators, Calls Them ‘Landed Gentry’",
    "Reddit Allegedly Threatens to Remove Moderators in Response to Blackout",
    "Another misstep in a comically badly executed policy change",
    "we are at farkcon 2 here folks https://www.theverge.com/...",
    "The note Reddit sent to moderators threatening them if they don't reopen",
    "Reddit, Inc. is intentionally killing off 3rd-party apps with exorbitant API call prices. …",
    "Here's the note Reddit sent to moderators threatening them if they don't reopen",
    "Apple subreddit reopens after moderation team threatened with removal",
    "Some of the Biggest Subreddits Are Retreating From the API War",
    "Reddit Threatens to Remove Moderators if They Don't Reopen Subreddits",
    "Reddit warns moderators of the blacked-out subreddits",
    "Reddit says it won't force subreddits back open (but will it?)",
    "Reddit says it won't overrule mods and force subreddits back open",
    "Millions of Americans' personal DMV data exposed in massive MOVEit hack",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "Louisiana driver's licenses, auto registrations targeted in massive data breach",
    "Data breach could affect 3.5 million Oregonians",
    "DMV data breach compromises 3.5 million Oregonians' personal information",
    "Data breach impacts 3.5M Oregon ID, driver's license holders",
    "Oregon DMV, Louisiana OMV warn residents of MOVEit data breach",
    "Hackers Stole Millions of Driver's Licenses and IDs from U.S. States",
    "Oregon DMV data breach concerns 3.5 million people",
    "Everything You Need To Know About What We Shared With NYAG",
    "Tether on FOIL and Continued Commitment to Transparency",
    "Tether says New York handed over financial documents to CoinDesk",
    "Tether Responds to Claims it Blocked Accounts of Major Crypto Firms",
    "Here's what new Tether documents reveal about its reserves",
    "Tether Counted Securities Issued by Chinese Firms Among Its Reserves: Bloomberg News",
    "Tether CTO calls USDT depeg ‘good stress test’ for company",
    "Documents reveal USDT was once backed by Chinese securities",
    "Tether did back USDT with Chinese securities, documents show: Bloomberg",
    "USDT issuer Tether responds to Chinese securities exposure reports",
    "FUD Alert: Tether (USDT) Depegging Signals the Beginning of Uncertainty",
    "Tether responds to reports on Chinese securities backing USDT reserves",
    "Tether Allows Access to Reserves Post Depegging Fiasco",
    "@mostlyharmlessz@muskless.social",
    "@Techmeme this was always suspected but never confirmed, glad to see some truth coming out.",
    "tether getting ahead of the news with cascading short sells https://tether.to/...",
    "Pweeeeass don't write the newsss 👉👈🥺 https://tether.to/... [image]",
    "Tether: Please don't panic when CoinDesk publishes an upcoming article about our us!!!",
    "U.S. Securities and Exchange Commission",
    "BlackRock's iShares Files Paperwork for Spot Bitcoin ETF",
    "BlackRock files for spot bitcoin ETF, with Coinbase as a crypto custodian",
    "Is BlackRock's clout enough to get its bitcoin ETF past the SEC?",
    "Bitcoin Recrosses $26.3K to Hit Highest Level in a Week Amid BlackRock Optimism",
    "BlackRock Files Bitcoin ETF Application With the SEC",
    "Cryptocurrencies climb to end the week as investors digest BlackRock's bitcoin ETF plans",
    "Bitcoin Jumps Past $25.7K After BlackRock iShares ETF Filing",
    "BlackRock Could Get SEC Approval for Bitcoin ETF With Included New Agreement",
    "Will BlackRock Win the First Bitcoin ETF Approval? Here are the Odds",
    "BlackRock's Bitcoin ETF surprise sets up battle with Gensler's SEC",
    "BlackRock's record of ETFs approved by the SEC is 575-1",
    "Cardano Founder Hoskinson Slams Bitcoin Maxis Who Support BlockRock",
    "BlackRock Bitcoin ETF: Good Or Bad? What Are The Chances? Experts React",
    "BlackRock Joins Race for Spot Bitcoin ETF, Submits Application to SEC",
    "BlackRock Files Application For Bitcoin Spot Exchange Traded Fund",
    "BTC Primed For Trillion-Dollar Boost As BlackRock Expects Landmark Bitcoin ETF Approval",
    "Can BlackRock's Bitcoin ETF Help Bitcoin Price Turn Around?",
    "Here's The Impact Of BlackRock's Bitcoin ETF Application On The Cryptocurrency Industry?",
    "Further evidence that Bitcoin is a commodity, and falls outside the securities issue",
    "Crypto community divided: BlackRock ETF's impact on DeFi remains uncertain",
    "Why Is Bitcoin Up Today?  —  The Bitcoin price has risen 3.2% since yesterday's low of $24,827.",
    "BlackRock files application for spot bitcoin ETF",
    "Bitcoin climbs as BlackRock files for ETF backed by the cryptocurrency",
    "BlackRock files for bitcoin ETF; Coinbase as custodian",
    "BlackRock delves deeper into crypto with push for bitcoin ETF",
    "BlackRock applies for spot Bitcoin ETF — a US first if approved",
    "BlackRock joins ranks of US bitcoin ETF hopefuls",
    "BlackRock files for Bitcoin ETF, Coinbase and Nasdaq listed as partners",
    "How it started: How it's going: [image]",
    "I thought Coinbase was an exchange, how can they be the custodian? https://www.cnbc.com/...",
    "Thirtieth time is the charm? https://twitter.com/...",
    "Notice on Changes of Services in the Netherlands",
    "Binance to Quit Netherlands After Failing to Acquire License",
    "Binance to leave Netherlands",
    "Binance's French arm says money laundering raid was ‘regulatory obligation’",
    "Crypto Exchange Binance Probed by France for Alleged Illegal Practices",
    "Binance Under Investigation in France",
    "Binance claims French authorities made on-site visit",
    "Binance Exits Netherlands After Failed Registration Attempt",
    "Binance exits Netherlands and faces France probe",
    "Binance France chief brushed off concerns days before police visit",
    "Binance Under Investigation in France for Alleged Money Laundering",
    "France investigates Binance for money laundering as Netherlands shuts door on exchange",
    "Binance Under Investigation In France, Company Exits Dutch Market After Cyprus Decision: Report",
    "Just-In: Binance Confirms On-Site Visit In France's Money Laundering Investigation",
    "French Investigation Targets Binance: Allegations of Money Laundering and Regulatory Violations",
    "Netherlands ‘Dismiss’ Binance's Licence Application",
    "French authorities have been investigating Binance since February 2022",
    "Binance is under investigation in France for alleged money laundering: Le Monde",
    "Binance under investigation in France since February 2022: Report",
    "France Probes Binance Exchange for Suspected Money Laundering",
    "France's AMF Turns On Binance: Investigations Underway Since 2022",
    "Binance Faces Allegations Of ‘Aggravated’ Money Laundering In France",
    "Binance Lays Off 50 U.S. Staff, Faces Investigation in Europe",
    "French Authorities Investigating Binance for ‘Aggravated Money Laundering’",
    "Binance is getting nuked from all directions. https://twitter.com/...",
    "Binance Under Investigation in France, Accused of ‘Aggravated’ Money Laundering",
    "Introducing Voicebox: The Most Versatile AI for Speech Generation",
    "Meta to Help People Craft More Zuck Deepfakes With ‘Voicebox’ AI",
    "Meta's reveals new text-to-speech Voicebox AI but you can't have it",
    "Meta introduces Voicebox, a generative AI model for speech",
    "Meta reveals AI tool that lets you edit audio, speak in six languages, and more",
    "Voicebox: Text-Guided Multilingual Universal Speech Generation at Scale",
    "Meta's new ‘Voicebox’ AI is a text-to-speech tool that learns like ChatGPT",
    "Everything you need to know about Meta's AI Voicebox",
    "Meta AI Unveils ‘Voicebox’ Speech Generation Model",
    "Meta's New Voicebox AI Serves Up Generative Text-To-Speech",
    "Meta announces Voicebox, its generative AI model for audio",
    "Samsung Galaxy Z Flip 5 leaked press render highlights phone's exciting new cover display",
    "New Samsung Z Flip 5 leak highlights a gloriously big cover screen",
    "Samsung Galaxy Z Fold 5 Flaunts A Sweet Hinge Upgrade In Leaked Renders",
    "Samsung Galaxy Z Flip 5 leaked renders reveal massive Cover Display",
    "Leaked Z Fold 5 renders show it could solve a major foldable phone issue",
    "Samsung Galaxy Z Flip5 could have a bigger cover display (like the Motorola Razr+)",
    "Samsung Galaxy Z Flip 5 Render Shows the Big Cover Screen in Action",
    "Samsung Galaxy Watch 6: Everything you need to know",
    "Leaked Galaxy Z Flip 5 press render shows off the new cover screen",
    "Samsung Galaxy Z Flip 5 shows off its huge outer display in official-looking image",
    "Galaxy Z Fold 5 shows off in first official press render with gap-less hinge",
    "BREAKING: Galaxy Z Flip 5 design revealed via official leaked images",
    "Samsung Galaxy Z Flip 5 official render leak flaunts Music widget on big cover screen",
    "Leaked Samsung Galaxy Z Flip 5 marketing materials confirms larger display",
    "The New Galaxy Z Flip 5 leak shows a bigger cover display",
    "Samsung Galaxy Z Fold 5 and Galaxy Z Flip 5 official renders just leaked",
    "Samsung Galaxy Z Fold 5 press render shows slim form-factor and S Pen",
    "Leaked Galaxy Z Flip 5 Image Shows Off Larger External Display",
    "This is the Galaxy Z Flip 5 leak we've been waiting for",
    "Samsung Galaxy Z Flip 5 showcased in leaked promotional images",
    "Stunning Samsung Galaxy Z Flip 5 photo leak shows spectacular external display",
    "Breaking: Galaxy Z Flip 5 first official press image leaked",
    "Leaked Samsung Galaxy Z Flip 5 marketing image confirms bigger outer display",
    "First Galaxy Z Flip 5 press render leaks, showing that huge small screen",
    "How to improve your local ranking on Google",
    "Local SEO in 2023: 5 simple ways to dominate local search",
    "a good look into why google sucks now https://twitter.com/...",
    "SEO Arms Race Has Left Google and the Web Drowning in Garbage Text",
    "Meta Reducing Quest 2 & 3 Minimum Age From 13 To 10 Years Old",
    "Meta to Lower Age for Users of Virtual Reality Headset to 10 From 13",
    "Bakkt delists Solana, Polygon and Cardano amid regulatory uncertainty: Fortune",
    "Bakkt to Delist Solana, Cardano and Polygon Following SEC Lawsuits",
    "Cardano Continues Decentralization Growth As SEC Targets ADA",
    "Bakkt Takes Proactive Measures, Delists Polygon, Solana, and Cardano Amid Regulatory Crackdowns",
    "Bakkt follows Robinhood, eToro in delisting major altcoins: Report",
    "Bakkt Delists Cardano, Polygon and Solana on Regulatory Grounds",
    "Polygon, Cardano, Solana delisted from Bakkt, 1 week after Robinhood",
    "Breaking: Bakkt Exchange Delists ADA, MATIC, and SOL",
    "Bakkt Bids Adieu to Solana, Polygon, and Cardano Amid Regulatory Whirlwinds",
    "Bakkt delists Solana, Polygon, and Cardano amid regulatory uncertainty",
    "Personalized wealth management, built for tech people",
    "Texas State Securities Board",
    "Abra Earn and Abra Boost Warning",
    "Texas regulator accuses lending firm Abra of committing fraud",
    "Crypto lender Abra has been insolvent since March, says Texas regulator",
    "Texas state regulators say crypto lender Abra has been insolvent for months",
    "Regulators say crypto lender Abra is insolvent and lied about FTX exposure",
    "Crypto Lender Abra Has Been Insolvent Since March, Says State Regulator",
    "Texas regulator accuses Abra Group of securities fraud",
    "Crypto Trading Platform Abra In Hot Water: Texas Regulator Accuses It Of Fraud",
    "Elon Musk asks: 'If I'm so smart, why did I pay so much for Twitter?'",
    "Tesla shares jump after Elon Musk declares self-driving cars are near",
    "Macron meets Musk as EU rivalries heat up for Tesla factory",
    "Much speech very free https://twitter.com/...",
    "Vision Pro: Apple assembles manufacturing partners for first-gen headset",
    "Free compensation benchmarking data from 3,000 startups",
    "Top 5 tips for establishing your next attendance policy",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/16 - Google Does it Again",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Meta rolls back COVID-19 misinformation rules in many countries",
    "Meta rolls back measures to tackle Covid misinformation",
    "Widow of slain Saudi journalist Jamal Khashoggi files suit against Pegasus spyware maker",
    "Jamal Khashoggi's Widow Says Notorious Spyware Left Her ‘Irrevocably Altered’",
    "Khashoggi's widow sues Israeli spyware company NSO over phone hacking",
    "Tech firms in talks with news outlets over AI licensing deals",
    "Media companies meet AI companies to talk about this",
    "OpenAI, Google and Microsoft negotiate the future of journalism",
    "Selling islands for seashells https://www.ft.com/...",
    "Frank's Charlie Javice called ‘king of finding magic numbers’ before $175M JPMorgan sale",
    "Australian Financial Review",
    "Chinese President Xi, Bill Gates meet on Friday in Beijing during latter's visit to China",
    "Bill Gates meets with President Xi Jinping in Beijing",
    "China's Xi tells Bill Gates he hopes US-China friendship will continue",
    "Bill Gates Meets President Xi Jinping in Beijing, Discusses Eradication of Infectious Diseases",
    "Bill Gates, in First Visit to China Since 2019, Meets With Xi",
    "China leader's latest tech meet-and-greet: Bill Gates",
    "Xi Jinping meets ‘old friend’ Bill Gates ahead of Antony Blinken's China visit",
    "Xi wants tech ties with ‘old friend’ Bill Gates",
    "Chinese president Xi Jinping stresses cooperation in meeting with Bill Gates",
    "Xi Tells Gates China Is Willing To Engage in Tech Cooperation",
    "Planning for an “ASEAN Guide on AI Governance and Ethics” is underway https://twitter.com/...",
    "The word ‘guardrails’ is quite à la mode these days https://twitter.com/...",
    "Amazon's purchase of Roomba maker cleared by CMA",
    "UK clears Amazon's $1.7 bln deal for Roomba-maker iRobot",
    "Amazon's iRobot Acquisition Cleared by U.K. Regulator",
    "UK competition regulator greenlights Amazon's billion-dollar purchase of iRobot",
    "UK gives Amazon green light to scoop up Roomba maker iRobot",
    "iRobot shares surge after UK regulator clears Amazon acquisition",
    "Amazon's Planned Acquisition of iRobot Passed by UK's CMA",
    "Amazon's $1.7B iRobot acquisition greenlighted by UK antitrust regulator",
    "Regulator clears Amazon's acquisition of Roomba maker iRobot",
    "Amazon's $1.7 billion deal to buy Roomba maker iRobot gets UK approval",
    "Amazon cleared to buy iRobot vacuum cleaner maker",
    "Intel to invest $4.6 bln in new chip plant in Poland",
    "Intel will build $5 billion plant in Poland, nears $11 billion subsidy deal in Germany",
    "Intel Plans Assembly and Test Facility in Poland",
    "Intel Selects Location in Poland for New Semiconductor Assembly and Test Facility",
    "Intel to invest $4.6B in new chip factory in Poland",
    "Intel to invest up to $4.6 billion in new Poland chip site",
    "Intel plans €4.6B microchips factory in Poland",
    "Intel picks Poland for new chip facility as EU demand grows",
    "Micron to invest US$600 million on China plant despite Beijing's ban",
    "Micron chips in $600M for China memory facility despite Beijing sanctions",
    "Micron Vows $600 Million China Investment Weeks After Chip Ban",
    "US chip giant Micron to invest $600 mn in China plant",
    "Micron, Blacklisted by Beijing, to Pump $600 Million Into China Expansion",
    "Micron invests $600m in China amid chip sanctions, eyes $1bn India factory",
    "Micron to invest $600mn in Chinese factory despite Beijing chip ban",
    "Micron says committed to China, invests $602 mln in existing plant",
    "Intel to start shipping a quantum processor",
    "Intel's New Chip to Advance Silicon Spin Qubit Research for Quantum Computing",
    "Intel and HRL Laboratories Collaborate with UW-Madison to Accelerate Quantum Computing Research",
    "Intel Announces Release of ‘Tunnel Falls,’ 12-Qubit Silicon Chip",
    "Next generation quantum computing takes a step forward thanks to Intel's new chip",
    "Week In Review: Design, Low Power",
    "Intel's Revolutionary Approach to Quantum Computing",
    "Intel launches 12-qubit ‘Tunnel Falls’ quantum chip and reveals plan for $4.6bn Poland factory",
    "Intel Announce ‘Tunnel Falls’ Quantum Research Chip",
    "Tunnel Falls: Intel reveals 12-qubit quantum chip for research",
    "Intel launches 12-qubit quantum research chip called Tunnel Falls",
    "Intel launches new quantum chip that could one day make x86 obsolete",
    "Intel Debuts Tunnel Falls Quantum Chip and LQC Program to Work with It",
    "Partnerships bring together UW-Madison quantum computing research, industry leaders",
    "Intel continues to pave its own quantum path with Tunnel Falls",
    "Intel Comes Out of Quantum Stealth with their 12 Qubit Tunnel Falls Chip",
    "Intel launches quantum chip Tunnel Falls",
    "Intel launches groundbreaking quantum computing chip ‘Tunnel Falls’",
    "Intel shows mass produced 12qbit CMOS quantum chip",
    "Intel Tunnel Falls Into Quantum Computing",
    "Intel unveils Tunnel Falls 12-qubit quantum chip",
    "Intel Announces Its Newest Silicon-Based Quantum Chip",
    "Intel sprinkles 12-qubit quantum test chips into the hands of researchers",
    "Intel to start shipping “Tunnel Falls” 12-qubit quantum processor",
    "Amazon's second headquarters comes to life in 21 photos from the official opening",
    "Amazon's ‘HQ2’ - once possibly destined for NC - opens in suburban DC",
    "Amazon debuts its headquarters complex in Virginia as it brings workers back to office",
    "Amazon officially opens first phase of HQ2 in Virginia with room for 14k employees",
    "As Amazon HQ2 opens its doors, neighbors brace for a transformation",
    "Scenes from our Met Park HQ2 grand opening. 📸 🍌 🎉 😊 https://www.aboutamazon.com/ ... [image]",
    "Meta reportedly making LLaMA commercially available, despite lawmaker inquiries",
    "The race for open source language models is heating up",
    "Metas LLaMA v2 could shake up the Chatbot business",
    "4D chess... https://twitter.com/...",
    "Meta Wants Companies to Make Money Off Its Open-Source AI, in Challenge to Google",
    "Russian national arrested in Arizona, charged for alleged role in LockBit ransomware attacks",
    "Russian National Arrested in Connection With LockBit Ransomware",
    "20-Year-Old Russian LockBit Ransomware Affiliate Arrested in Arizona",
    "Latest arrest places LockBit firmly in the crosshairs of international cyber police",
    "Russian National Arrested, Charged in US Over Role in LockBit Ransomware Attacks",
    "Feds catch another LockBit hacker, Justice Department announces",
    "The Official Squarespace …",
    "Google Domains is yet another useful service to get the ax in favor of “focus\"\"",
    "The Official Squarespace Newsroom",
    "Squarespace Enters Definitive Agreement to Acquire Google Domains Assets",
    "Google unexpectedly sells its domain-hosting business to Squarespace",
    "Google Domains shutting down, assets sold and being migrated to Squarespace",
    "Google Is Getting Rid of Another Service",
    "Google to wind down Google Domains, sell assets to Squarespace",
    "Google sunsets Domains business and shovels it off to Squarespace",
    "About the Squarespace purchase of Google Domains registrations",
    "Squarespace snaps up Google Domains promising ‘seamless transition’",
    "Google is Selling its Domains Service to Squarespace",
    "Alphabet Inc.'s Google Sells Domain Business to Squarespace for $180 Million",
    "Squarespace Has Acquired Google Domains",
    "Google Domains shuts down, assets sold to Squarespace",
    "Google Domains sells to Squarespace as Google surprisingly exits domain registration business",
    "After unleashing .ZIP domain on the net, Google to shut down Google Domains",
    "Squarespace to Acquire Google Domains Assets",
    "Google Domains is dead, business sold to Squarespace",
    "Google Sells Its Databank of More Than 10 Million Domain Names to Squarespace",
    "Google Domains Agrees To Be Acquired By Squarespace",
    "Google is killing Google Domains, selling it to Squarespace for $180 million",
    "Google just killed Google Domains: Just kidding, it got sold",
    "Squarespace buys Google Domains for $180 million",
    "Squarespace Says It Will Acquire Google Domains Assets From Alphabet",
    "I am absolutely shocked. lmao https://9to5google.com/...",
    "I'm so mad about this. https://twitter.com/... [image]",
    "that's what you get for using a Google product 🫡 https://twitter.com/...",
    "This season of Killed by Google sucks https://twitter.com/...",
    "so long, google domains 🫡 https://twitter.com/... [image]",
    "At this point why would anyone use Google for anything other than search 🤡 https://twitter.com/...",
    "Goodbye Google Domains https://twitter.com/...",
    "Alphabet selling Google Domains assets to Squarespace",
    "Squarespace Enters Definitive Agreement to Acquire Google Domains Assets.",
    "Alphabet Selling Google Domains Assets to Squarespace",
    "Squarespace acquires Google Domains",
    "Introducing the Partner Plus Program",
    "Twitch announces a new program to help streamers make more money",
    "Twitch is offering some streamers a 70/30 split. But are its requirements “unobtainable”?",
    "Twitch's New Partner Plus Program Sucks",
    "Twitch streamer fires back at new Partner Plus program's “unobtainable” requirements",
    "Twitch Is Starting To Feel Like A Failed State",
    "Twitch to improve revenue splits, but only when certain conditions are met",
    "Twitch introduces new revenue split for Partners, but there's a catch",
    "Twitch ups streamers' rev-share in new Partner Plus program",
    "Twitch introduces 70/30 revenue split in new Partner Plus program",
    "Twitch's new Partner Plus program offers some streamers a 70/30 revenue split",
    "Twitch will give smaller streamers a bigger cut of subscriptions",
    "Twitch introduces the Partner Plus Program with a 70/30 spit."
]