[
    "U.S. District Court, Western District of Washington",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC",
    "Amazon's response to our recent settlement with the U.S. Department of Justice regarding Alexa",
    "Amazon must pay over $30 million over claims it invaded privacy with Ring and Alexa",
    "FTC Smacks Amazon for Alexa and Ring Privacy, Security Failures",
    "The Download: clean energy investments, and Amazon's data privacy fine",
    "Amazon Fined $25 Million for Deceiving Parents, Violating Child Privacy Law",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "Amazon to pay more than $30 million to settle FTC privacy complaints over Alexa and Ring",
    "FTC charges Amazon with privacy violations over Alexa and Ring cameras",
    "Amazon Settles Complaints Over Ring Surveillance, Use of Children's Voice Recordings",
    "Amazon to Pay $31m After FTC's Security and Privacy Allegations",
    "Amazon settles with FTC for $25M after ‘flouting’ kids' privacy and deletion requests",
    "Amazon Fined $25M in Child Privacy Case",
    "Amazon to pay $25M fine for keeping kids' data through Alexa",
    "FTC fines Amazon $25M for violating children's privacy with Alexa",
    "Amazon to pay $30M to settle the FTC's Alexa, Ring complaints",
    "Amazon faces $30 million fine over Ring, Alexa privacy violations",
    "Amazon to pay $25m over child privacy violations",
    "Amazon to pay $30M to settle FTC privacy allegations over Ring, Alexa",
    "Amazon Settles FTC's Ring and Alexa Privacy Lawsuits for $31 Million",
    "Federal regulators fine Amazon $25 million over child privacy issues",
    "Amazon will pay $25 million to settle FTC lawsuit over Alexa privacy for kids",
    "Amazon.com to pay $25 million to settle Alexa privacy lawsuit with FTC",
    "U.S. District Court, District of Columbia",
    "FTC settles with Amazon Ring over hacking, security incidents",
    "Ring camera privacy breaches see Amazon fined - but only $6M",
    "Federal Trade Commission v. Ring LLC",
    "Ring's Response to Our Recent Settlement With the FTC",
    "Amazon to pay $30.8M for Alexa and Ring privacy violations",
    "Amazon to pay over $30 million for Ring and Alexa privacy violations",
    "Amazon Ring, Alexa accused of every nightmare IoT security fail you can imagine",
    "Amazon to Pay $5.8 Million for Spying on Customers Through Their Ring Cameras",
    "Amazon's Ring doorbell was used to spy on customers, FTC says in privacy case",
    "Amazon to pay $30.8m to settle FTC privacy claims",
    "Amazon settles Alexa and Ring privacy violations for $30 million",
    "Amazon's Ring used to spy on customers, FTC says",
    "Amazon Settles Ring Customer Spying Complaint",
    "Amazon settles for $30M in response to Ring and Alexa data privacy violations",
    "Amazon to pay over $30 million to settle FTC privacy violation lawsuits",
    "Amazon will pay more than $30M for Alexa and Ring privacy violation allegations",
    "Amazon to pay $30M in FTC settlements over Alexa, Ring privacy violations",
    "How to be sure your home security isn't spying on you",
    "Amazon will pay more than $30M to settle FTC complaints over Alexa and Ring privacy issues",
    "Amazon To Pay $30 Million For Alexa, Ring Privacy Violations",
    "FTC: Security failings at Amazon's Ring let hackers, employees access customer videos",
    "Ring Settles FTC Allegations of Poor Cybersecurity, Privacy",
    "FTC Orders Ring to Pay $5.8 Million in Refunds For Surveilling Customers, Failing to Stop Hackers",
    "Amazon's Ring agrees to pay $5.8 million to settle FTC spying suit",
    "Amazon's Ring and FTC Settle Charges of Privacy Violations",
    "Amazon settles lawsuit with FTC over Ring doorbell privacy concerns",
    "Amazon gets slap on the wrist over privacy violations with Ring cameras",
    "FTC's Ring Settlement Shows Why Companies Don't Respect User Privacy",
    "Refreshed Mac Studio with all-new M2 Ultra could launch next week",
    "Apple is reportedly testing high-end Macs powered by its new M2 chips",
    "Is this confirmation of the Mac Pro coming at WWDC?",
    "Apple might launch some very powerful Macs at WWDC",
    "Apple preps new high-end M2 Max and M2 Ultra Macs ahead of WWDC",
    "Apple's M2 Ultra may supercharge a new Mac, but it's not the one you think",
    "Apple rumored to announce new Mac Studio at WWDC, Mac Pro's future uncertain",
    "Ahead of WWDC23, Apple is Testing new High-End Macs with M2 Ultra Processors and more",
    "New M2 Ultra desktop Macs could appear at WWDC",
    "Apple preps first Mac with M2 Ultra chip and M2 Max desktop ahead of WWDC",
    "New high-end Macs with M2 Max and Ultra chips could debut at WWDC23",
    "Apple is testing M2 Max and M2 Ultra Macs just before WWDC",
    "Last-minute rumor suggests Apple testing high-end M2 Max & M2 Ultra Macs ahead of WWDC",
    "Apple Tests High-End Mac Desktops Ahead of WWDC: Report",
    "Apple said to be finalising new Mac desktops based on M2 Max and M2 Ultra chips",
    "Two new Macs with M2 Max & M2 Ultra being tested ahead of WWDC",
    "New Desktop Macs With M2 Ultra and M2 Max Chips Could See WWDC Debut",
    "Apple is Testing New M2 Max and M2 Ultra Macs Ahead of WWDC [Report]",
    "Apple might announce ‘several’ Macs at WWDC",
    "Report: Some Arkane staff hoped Microsoft acquisition would kill Redfall﻿",
    "Report: Arkane Hoped Microsoft Would Cancel Or Reboot ‘Redfall’",
    "Redfall devs reportedly hoped it would be cancelled or rebooted by Microsoft",
    "Redfall devs reportedly didn't actually want to make the game",
    "Redfall suffered unclear direction during development, new report suggests",
    "Arkane Staff Reportedly Hoped Microsoft Would Cancel Redfall",
    "What went wrong with Redfall.",
    "Report: Xbox Exclusive Redfall Suffered From Few Resources, Poor Direction",
    "Report: Redfall Playtesters ‘Shocked’ At How Little The Game Changed During Development",
    "Redfall Development Was Reportedly Plagued by Understaffing and Confusing Direction",
    "Redfall Faced “Unclear Direction,” Significant Departures During Development - Rumor",
    "Instagram Ranking Explained",
    "Instagram CEO Adam Mosseri explains how the app recommends the content you see",
    "Instagram attempts to explain ‘shadowbanning’, but creators still aren't happy",
    "Here's how Instagram recommends the content you see",
    "Instagram Shares New Explainer on How its Feed, Reels and Stories Algorithms Work",
    "Instagram explains its recommendations and ‘shadowbanning’",
    "Instagram rankings get explained, CEO addresses ‘shadowbanning’",
    "Official: Current Instagram algorithm explained",
    "Instagram testing new personalisation control for users, transparency tools for creators",
    "Instagram has revealed how its ranking algorithm works",
    "How The Instagram Algorithm Works For Stories, Feed, Reels, And Explore",
    "Instagram boss talks rankings, Feed, Reels and Stories",
    "Multichain Can't Find Its CEO as Company Loses Access to Its Servers",
    "Multichain team cannot locate CEO, halts service for affected chains",
    "Crypto Bridging Protocol Multichain ‘Unable to Contact’ CEO Zhaojun",
    "Crypto token MULTI crashes as Multichain confirms CEO missing",
    "Multichain Shuts Cross-Chain Bridge Protocol After CEO Goes Missing: What Next?",
    "Multichain (MULTI) team locked out as CEO goes missing",
    "Multichain unable to contact CEO, has no access to project servers",
    "Breaking: Multichain Suspends Cross-Chain Services, Fails To Contact CEO",
    "What happened to being permissionless and decentralized? https://twitter.com/...",
    "PKI at its finest. One man has the private 🔑 everyone else... not so much https://twitter.com/...",
    "I don't know a single chain mentioned in this tweet https://twitter.com/...",
    "interesting, ceo is gone $multi https://www.theblock.co/... [image]",
    "Multichain team says it can't contact CEO amid protocol problems https://www.theblock.co/...",
    "International Business Times",
    "Improving mathematical reasoning with process supervision",
    "OpenAI is trying to stop ‘AI hallucinations’ where ChatGPT just makes stuff up",
    "OpenAI: New Process-Supervised Reward Modeling Improves AI Reasoning",
    "Here's how OpenAI plans to cleanse ChatGPT of false information",
    "OpenAI Announces New Approach To Fight AI ‘Hallucinations’ After Legal Fabrications",
    "OpenAI develops LLM that uses a chain of thought like humans",
    "ChatGPT creator seeking to eliminate chatbot ‘hallucinations’",
    "Process supervision makes intuitive sense too! https://twitter.com/...",
    "Access to models → Alignment progress https://twitter.com/...",
    "It's about the journey and not about the destination they say... https://openai.com/...",
    "Reddit's API pricing results in shocking $20 million-a-year bill for Apollo",
    "📣 Had a call with Reddit to discuss pricing. …",
    "Reddit Quotes Extraordinarily High API Pricing to Apollo Developer",
    "Reddit may force Apollo and third-party clients to shut down, asking for $20M per year API fee",
    "Death By API: Reddit Joins Twitter In Pricing Out Apps",
    "Reddit looks set to kill third-party clients with multimillion dollar fees",
    "Reddit API Pricing Would Cost Apollo Developer $20 Million Per Year",
    "The best Reddit client app is in danger due to price demands",
    "Reddit wants to kill third-party Reddit apps and Apollo could be one of them",
    "A developer says Reddit could charge him $20 million a year to keep his app working",
    "Reddit Joins Twitter In Squeezing Devs With Unreasonable Fees",
    "Proposed changes to Reddit API could mean the end of third-party apps like Apollo",
    "Reddit wants to make a ‘million dollars’ from API following Twitter",
    "Apollo for Reddit might shut down due to Reddit's new API pricing",
    "Popular Reddit app Apollo may go out of business over Reddit's new, unaffordable API pricing",
    "Reddit has it in for third-party clients ↦",
    "The attack on third-party social client apps continues https://twitter.com/...",
    "bro is there even gonna be any of the Old Internet left by the end of 2023 https://twitter.com/...",
    "API Extortion Era https://twitter.com/...",
    "India Semiconductor Mission",
    "Amid Geopolitical Gale, Taiwan's Chipmakers Chart New Course",
    "India expands scope of its semiconductor ambitions; Vedanta likely gets a lifeline",
    "Govt invites fresh bids for $10 bn semiconductor fab scheme",
    "Real child murder victims recreated by AI in sick true-crime TikTok trend",
    "New TikTok Trend Uses AI-Generated Kids To Exploit Real Murder Victims",
    "Elon Musk's whirlwind China trip included talks with vice premier",
    "Tesla cuts inventory Model 3 prices as Elon Musk preps to preview new Highland version in China",
    "Tesla to Reveal Updated Model 3 in Shanghai with Elon Musk: Report",
    "Elon Musk resists decoupling, plans Tesla expansion in China",
    "Is Elon Musk going to compromise Twitter for his business prospects in China?",
    "Elon Musk: Tesla boss on first China trip in over three years",
    "Musk meets Chinese officials to deepen Tesla's China ties",
    "Now I know who's getting my next invite code 🙃",
    "38 astronauts to orbit so far! https://twitter.com/...",
    "So this raises the question - should Elon Musk stay in China .... https://twitter.com/...",
    "Elon Musk fully complying with local laws and regulations! https://www.bloomberg.com/...",
    "Introducing the Leap Motion Controller 2 from Ultraleap",
    "Ultraleap launches Leap Motion Controller 2",
    "Ultraleap launches second generation of iconic hand tracking camera - Leap Motion Controller 2",
    "Ultraleap launches 2nd gen of its hand tracking camera with the Leap Motion Controller 2",
    "Leap Motion's gesture control quest continues with the Leap Motion Controller 2",
    "Vive XR Elite Getting New Tracking And Mixed Reality Features & Improvements",
    "Tether USD₮ Reaches All-Time High, Surpasses Previous Market Cap High of $83.2B",
    "Tether reaches record as jittery crypto investors flock to stability",
    "Tether USDT market cap breaks ATH, Binance CEO points at regulatory caps",
    "Tether's USDT sets new all-time high in spite of regulatory concerns",
    "Tether Achieves New Milestone with Record-Breaking Market Cap",
    "Tether Stablecoin Recoups Lost Market Value in 2022 Crash, Topping $83.2 Billion",
    "Good job! https://twitter.com/...",
    "I don't see why this is a compelling use case for AI https://www.bloomberg.com/... [image]",
    "Spinoza ground lenses so ASML could vaporise... https://twitter.com/...",
    "Amazon corporate workers stage walkout, citing ‘lack of trust’ in leadership",
    "Amazon workers walk out to protest return to office mandates",
    "Amazon Workers Walk Out to Protest Climate, Office Return Policy",
    "Amazon employees stage walkout over return-to-office mandate, climate goals, and layoffs",
    "Amazon corporate workers stage walkout at Seattle headquarters",
    "Corporate Amazon workers walk out over climate goals and return to office",
    "Amazon Workers Walk Out Over Layoffs and Broken Climate Promises",
    "Hundreds of Amazon workers walk out to protest return-to-office, climate",
    "Amazon employees stage walkout at HQ over frustrations with leadership",
    "Some Amazon employees walk out in Seattle to protest climate, office policies",
    "Amazon employees walk out, seeking bolder climate action and end of return-to-office policy",
    "Amazon Employees Walk Out to Fight Back-to-Office Policy and Climate Change",
    "Amazon workers walk out to protest return to office mandates and the company's climate impact",
    "Amazon workers walk out over ‘lack of trust’ in leadership",
    "Gotta love a good white collar walkout. https://twitter.com/...",
    "Messages in the crowd at the Amazon walkout in Seattle. [image]",
    "Match Group debuts Archer, a new face-first gay dating app for men",
    "Match Group's ‘Archer’ App Wants to Offer Gay Men So Many Targets They Can't Miss",
    "NEW SOCIAL-FIRST DATING APP “ARCHER” LAUNCHES FOR GAY, BISEXUAL, AND QUEER MEN",
    "Archer is the new ‘social-first’ dating app for queer men",
    "Unlock a new pipeline channel: your existing customers",
    "Google leads funding round for Indian space startup Pixxel",
    "Spacetech Startup Pixxel Bags $36 Mn Funding From Google, Others",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "What is Generative AI and how does AI improve customer experience?",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Wed. 05/31 - AI Industry Says: \"Regulate Us!\" But Why?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "BeReal is testing a direct messaging feature called RealChat",
    "C3.ai shares slide as revenue forecast fails to live up to AI hype",
    "C3.ai Stock Dives. It Must Find Its Place In the AI Ecosystem, Like Nvidia.",
    "AI Stock Tumbles As C3.ai's Revenue Outlook Misses Estimates",
    "Oppo MR headset announced just days before Reality Pro - but only for developers",
    "Apple's XR Headset Is Coming - What We Know So Far",
    "Oppo introduced a new MR glass partnered with Qualcomm in China",
    "Oppo MR Glass developer headset announced with Snapdragon XR2+ chipset",
    "The VR space just got more crowded.",
    "GetYourGuide raises $194 million to fuel curated travel experiences and global expansion",
    "Bringing AI to the Data Center",
    "As part of AI push, Chinese tech giant Baidu is now rolling out an AI venture fund",
    "Capillary Technologies raises $45 million to fuel acquisitions and expansion",
    "Capillary raises $45 Mn from Avataar Ventures and others",
    "SaaS startup Capillary Technologies secures $45M from Avataar Ventures, others",
    "After Deferring IPO Plan, Capillary Bags $45 Mn Funding From Avataar Ventures And Its LPs",
    "Amazon Implementing AI Solution to Spot Damaged Items Before Shipping",
    "Amazon is using AI in its warehouses to spot damaged items.",
    "Damn the Amazon AI just identified me as damaged goods :(",
    "Cortex Raises $35M in Series B Funding",
    "A new standard for Internal Developer Portals - Putting our new Series B financing to work",
    "Cortex Applications raises $35M to bring visibility into microservices quality",
    "Measurabl gathers $93m to boost real estate ESG platform growth",
    "Measurabl, an ESG platform for real estate, raises $93M",
    "Proptech Firm Measurabl Closes $93 Million Series D Raise",
    "Measurabl raises $93M Series D for real estate ESG",
    "Measurabl Raises $93M in Series D Funding",
    "Measurabl Snags $93M For Carbon Footprint Management",
    "Photonic computing company Lightmatter raises $154m",
    "Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "Lightmatter's photonic AI hardware is ready to shine with $154M in new funding",
    "Lightmatter triples valuation to solve generative AI's energy crunch",
    "The Future Is Bright — Lightmatter Raises $154M to Deliver Photonic Products to Customers",
    "These AI Investors Are Following The Light By Giving This Startup $154M",
    "Okta and CrowdStrike shares plunge on broader macroeconomic concerns",
    "CrowdStrike Earnings Top Estimates, But Recurring Revenue Metric Disappoints",
    "CrowdStrike Swung to Profit in 1Q as Sales Jumped",
    "CrowdStrike Reports First Quarter Fiscal Year 2024 Financial Results",
    "Salesforce posts slowest quarterly revenue growth since 2010",
    "CRM giant Salesforce's focus on margins sees sales growth slip",
    "Salesforce Announces Strong First Quarter Fiscal 2024 Results",
    "Salesforce delivers to expectations but contract delays and rising capital costs weigh on stock",
    "Salesforce CEO Benioff Predicts AI Spending Boom",
    "Salesforce Q1 better than expected, margins improve",
    "Salesforce forecasts current-quarter revenue above estimates",
    "Salesforce predicts record earnings, but the stock is still falling",
    "Google's Communications Chief to Depart",
    "Silicon Valley Business Journal",
    "Google head of communications and advisor to CEO Sundar Pichai to exit",
    "Says a lot about where Google is right now. https://twitter.com/...",
    "Legendary Torrent Site RARBG Shuts Down Due to War, COVID, Inflation",
    "RARBG: Over 267,000 Movie & TV Show Magnet Links Appear Online",
    "Rarbg: Popular movie and TV torrent site shuts down",
    "Hello guys, We would like to inform you that we have decided to shut down our site. …",
    "Popular movie and TV torrent site RARBG suddenly shuts down after 15 years",
    "Apple's app ecosystem generated $1.1trn in 2022, report finds",
    "The Continued Growth and Resilience of Apple's App Store Ecosystem",
    "Apple says the App Store is a $1.1 trillion business",
    "Citing facts, Apple denies the ‘Apple tax’ hype",
    "Apple's App Store generates $1.1 tn in revenue for devs in 2022: Study",
    "Apple's App Store tipped the scales at $1.1 trillion in sales in 2022",
    "Apple touts App Store facilitated $1.1 trillion in developer sales in 2022",
    "Report shows the amazing strength of the global App Store ecosystem last year",
    "App Store Developers Generated $1.1 Trillion in 2022",
    "App Store developers raked in astonishing $1.1 trillion in 2022",
    "Apple Says App Store Ecosystem Generated $1.1 Trillion for Developers in 2022",
    "15 years ago, Apple launched the App Store. Last year, it brought in $1.1 trillion for developers",
    "Apple App Store Commerce Climbed 29% Last Year to $1.1 Trillion",
    "App Store developers surpass $1 trillion milestone from sales in 2022",
    "Apple-Funded Study Suggests App Store Ecosystem Facilitated $1.1 Trillion in Sales in 2022",
    "Apple says App Store ‘ecosystem’ crossed $1 trillion in 2022, here's what that means",
    "AI chips are hot. Here's what they are, what they're for and why investors see gold",
    "How Activists Proved to be Salesforce's ‘Superpower’"
]