[
    "Lawyer cites fake cases invented by ChatGPT, judge is not amused",
    "Mata v. Avianca, Inc. (1:22-cv-01461)",
    "A lawyer used ChatGPT and now has to answer for its ‘bogus’ citations",
    "A lawyer used ChatGPT for legal filing. The chatbot cited nonexistent cases it just made up",
    "A Lawyer's Filing “Is Replete with Citations to Non-Existent Cases”—Thanks, ChatGPT?",
    "ChatGPT: US lawyer admits using AI for case research",
    "Lawyer apologizes for fake court citations from ChatGPT",
    "A lawyer used ChatGPT for legal research, but later found the chatbot created fake cases",
    "Lawyer faces punishment after ChatGPT gave him fake cases to cite on a court-submitted brief",
    "Lawyer Uses ChatGPT In Federal Court And It Goes Horribly Wrong",
    "US lawyer penalised for using ChatGPT: Here's why",
    "ChatGPT's Erroneous Legal Citations Land Lawyer in Trouble",
    "Lawyer ‘Greatly Regrets’ Relying on ChatGPT After Filing Motion Citing Six Non-Existent Cases",
    "@kendraserra@dair-community.social",
    "AI will make idiots dumber. https://twitter.com/...",
    "grabbed the funniest bit of that legal case where someone used ChatGPT to write a brief [image]",
    "Nintendo has blocked the Steam version of GameCube and Wii emulator Dolphin",
    "Nintendo has blocked the Steam release of Wii emulator Dolphin",
    "Dolphin on Steam Indefinitely Postponed",
    "Nintendo targets Steam with fresh DMCA strike to remove Dolphin Emulator",
    "Dolphin Emulator release on Steam is “indefinitely postponed”",
    "Dolphin Emulator Steam listing removed following Nintendo DMCA",
    "Nintendo filed a DMCA notice against Dolphin emulator's release on Steam",
    "Dolphin Emulator Steam Release ‘Indefinitely Postponed’ After Cease and Desist From Nintendo",
    "Dolphin emulator Steam release delayed indefinitely following Nintendo DMCA notice",
    "Buzzkill Nintendo Slams Valve With DMCA Takedown Over Dolphin Wii Emulator",
    "Nintendo Hits Valve With Steam DMCA Takedown Notice",
    "Dolphin emulator's Steam launch blocked by Nintendo DMCA notice to Valve",
    "Nintendo serves Valve a takedown notice to remove an emulator from Steam",
    "Nintendo Sends DMCA to Wii/Game Cube Emulator Dolphin Ahead of Steam Launch",
    "Wii emulator Dolphin hit with DMCA notice by Nintendo to block Steam launch",
    "Nintendo Sends Valve DMCA Notice Over Wii Emulator Listing On Steam",
    "Dolphin Emulator Steam release Indefinitely Postponed due to Nintendo DMCA",
    "U.S. sends clear message on China's ban of Micron chips",
    "US 'won't tolerate' China's ban on Micron chips, commerce secretary says",
    "U.S. 'won't tolerate' China's ban on Micron chips-Raimondo",
    "Funny watching the US throw its toys out of the pram. https://www.bnnbloomberg.ca/ ... [image]",
    "what happens when US bans $NVDA and $AMD from selling to china? https://twitter.com/...",
    "China claims semiconductor consensus with South Korea, while Seoul stays quiet",
    "Samsung's $230bn chip hub draws top equipment makers to Seoul area",
    "China, South Korea Agree to Strengthen Talks on Chip Industry",
    "U.S. 'won't tolerate' China's ban on Micron chips, Raimondo says",
    "@chockenberry@mastodon.social",
    "Third-party Twitter apps historically accounted for 17% of all engagement, former exec says",
    "Texas Monthly Profiles Tapbots Founders Paul Haddad and Mark Jardine",
    "Blur Dominates 82% of the NFT Lending Market",
    "Blend's Unprecedented Surge: Dominating 82% of the NFT Lending Market in 22 Days",
    "New Crypto Protocol Captures More Than 80% of the NFT Lending Market in Just One Month: DappRadar",
    "More NFT Holders On Blur Are Taking Loans, Not Trading",
    "Binance launches compliant platform for users in Japan",
    "Information for Japan Resident Customers of Binance.com About Transition to the New Local Platform",
    "Binance begins transition to new platform for Japan",
    "Binance makes return into Japan under a new subsidiary",
    "Binance kicks off transition to new platform in Japan",
    "Breaking: Binance To Suspend Crypto Services For Japan By November 30 | Coingape",
    "AI boom drives gains for chip stocks",
    "S&P, Nasdaq soar in 2023 thanks to big tech stocks",
    "BigTech is Dead. Long Live #BigTech https://twitter.com/...",
    "How could Google have ever allowed this to be sold, even for a second? https://www.bbc.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) The History Of Internet Porn",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA"
]