[
    "@luis_in_brief@social.coop",
    "@GossiTheDog@cyberplace.social",
    "Threads app: Instagram owner's Twitter rival logs 5 million users in first hours",
    "Introducing Threads: A New Way to Share With Text",
    "How to find Threads badge on Instagram",
    "Explainer: Understanding the ‘ticket’ for Threads on Instagram and how users can sign up",
    "Threads Had Big Launch Energy. Twitter Is Under Pressure",
    "7 of Twitter's most followed users have jumped onto Threads: ‘May this platform have good vibes’",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "The Instagram Threads launch countdown jumped forward and is now targeting 7PM ET",
    "5 Things to Know Before the Stock Market Opens Thursday",
    "Threads, Meta's Twitter competitor, is now live",
    "How to sign up for Threads - the new social media app on the block",
    "How to change your Threads feed to accounts you actually follow",
    "SamMobile is now available on Threads, and you can follow us",
    "SamLover Joins Threads: Follow Us for the Latest Updates",
    "Zuckerberg's Twitter clone Threads is live.  Here's what you need to know.",
    "Threads: Five million join new Meta app in matter of hours",
    "Mark Zuckerberg's Twitter Killer Is Shockingly Viable. Oh No.",
    "As Twitter Falters, Threads Surpasses 5 Million Sign Ups on Day One",
    "What you need to know about Threads, Instagram's new Twitter competitor",
    "Mark Zuckerberg's Sneak Attack: Twitter Rival Threads Launches Earlier Than Expected",
    "Threads, Instagram's Twitter competitor, is now available to download",
    "What you need to know about Threads, Instagram's new Twitter killer app",
    "Meta's Threads Is Here. What It Is and How to Use It",
    "Mark Zuckerberg just released Threads, Meta's new rival to Twitter. Here's how to sign up",
    "Meta Launches Instagram Threads, its Twitter Killer",
    "Instagram's Twitter competitor, Threads, is available now",
    "Meta's Threads app is here to challenge Twitter",
    "Instagram Launches Threads, a Text-Based ‘Conversation’ App, in Challenge to Elon Musk's Twitter",
    "Instagram Unveils Threads App, a Major Threat to Musk's Twitter",
    "Welcome To ‘Threads,’ Facebook's Twitter Killer",
    "Zuckerberg Under Fire in China After Report of Quest Sale Talks",
    "Meta's Twitter competitor Threads won't support ActivityPub at launch",
    "Instagram's Twitter clone, Threads, is available to download again",
    "i hope every body finds the social media home they truly deserve",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "Gosh. Yuk. Hmmmm. Really, Threads? [image]",
    "This and how you have to give it access to your contacts means NFW. https://twitter.com/...",
    "This is getting ridiculous [image]",
    "Users in EU can view threads on Threads, but can't sign up. https://www.threads.net/...",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "threads first impressions It's good Really good Elons in trouble",
    "Meta's new app was built entirely using this keyboard: [image]",
    "Threads has been available for 30 minutes and people are already roasting Zuckerberg [image]",
    "Zuck is already using his new app to pitch himself on podcasts [image]",
    "the fact that it will eventually work with decentralized social media apps is really intriguing.",
    "Threads will 100% only be a thing people use for maybe a month",
    "Did Meta just launch a new social media website without a website?",
    "It turns out, building an Instagram account is now 100x more valuable",
    "Folks, Instagram images preview on Threads [image]",
    "Sad to inform the social media interns at brands are at it already [image]",
    "threads feels like for designers, by designers so far https://www.threads.net/...",
    "this is how you return from an 11-year twitter hiatus. https://twitter.com/...",
    "Mark Zuckerberg's first tweet in 11 years and he's trolling Twitter 🙃 https://twitter.com/...",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "Seeing former Twitter employees use Threads is chefs kiss.",
    "Let's do this. Welcome to Threads. 🔥",
    "It's so over, we're so back",
    "Congrats on the launch @zuck!  Needed this space.",
    "At this rate Twitter will be reduced to just a bunch of...threads",
    "Twitter = tweets Mastodon = toots Bluesky = skeets Threads = threats",
    "So is each post a ‘Stitch’?",
    "Waiting for my friends to join me [image]",
    "Meta launches Instagram Threads in a direct challenge to Twitter",
    "Adam Mosseri says Meta's Threads app won't have ActivityPub support at launch",
    "Meta takes on Twitter with Instagram-made Threads app",
    "How to enable dark mode for Instagram Threads on Android and iOS",
    "Meta takes aim at Twitter with Threads app, millions join",
    "What is Instagram Threads? How to sign up for Meta app and new in-app features, explained",
    "Threads: how do I sign up and is it any different to Twitter?",
    "10 million join Threads in under 10 hours, boosted by Instagram integration",
    "Zuckerberg-Musk fight is on: Meta launches ‘Twitter Killer’ Threads app",
    "Meta's Twitter rival is here, and it is off to a flying start",
    "Instagram Will Now Let You Add Up to Three Collaborators on Posts and Reels",
    "Meta Launches Threads, Betting Instagram Mojo Can Take on Twitter With New App",
    "Hands-on with Threads - Instagram's promising Twitter rival misses key features",
    "How to hide Threads replies based on specific words",
    "Twitter's biggest rival, Threads, is official and live in 100 countries",
    "Twitter rival Threads crosses 10 mn users within hours of launch",
    "Millions flock to Instagram Threads, Elon Musk laughs at it",
    "Meta launches Instagram Threads to dethrone Twitter",
    "Meta Releases ‘Threads’ App to Rival Twitter",
    "Meta's new Threads app kicks Twitter while it's down",
    "Twitter Competitor Threads Hits 5 Million Sign-Ups In 4 Hours, Meta CEO Mark Zuckerberg Says",
    "Digiday+ Research Briefing: Instagram hopes Threads will overtake Twitter as top messaging app",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "Meta Platforms unveils Threads to rival Twitter",
    "A Look at the Threads UI, and Features Coming to the Twitter Alternative App",
    "Meta Threads briefly went live earlier than planned",
    "Instagram Launch of Twitter Rival ‘Threads’ Expected on Thursday",
    "Dead on arrival  —  https://www.platformer.news/ ...  [image]",
    "If you needed a reason to join threads, this is it [image]",
    "IG famous people posting on threads like “morning coffee ❤️” I can't do this??????????",
    "threads quite quickly giving linkedin energy [video]",
    "first post i seen on threads. already wanna kms [image]",
    "lol Zuck just can't help himself [image]",
    "@georgebsocial @TimSweeneyEpic yea, I agree. I don't like typing / sharing things on a mobile app",
    "A well executed animation like this pull to refresh in Threads just feels sooooo good. 😚 [video]",
    "lol threads currently using the “you have no control over what you see model” [image]",
    "please help make this the first viral threads tweet",
    "I know it's called threads but can we please leave the spool emoji on twitter 🧵",
    "More engagement from 3k followers on here than 5m on Twitter.  Hmmmm",
    "Sorry I'm late, I was threading",
    "@jkottke@saturation.social",
    "@chopaganda@shakedown.social",
    "How to get verified on Threads",
    "Threads using decentralised protocol clear victory for our cause: Mastodon CEO",
    "Instagram Threads: Heres how it works and how it is better than popular social media platforms",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "Everything you need to know about Threads, Instagram's Twitter clone",
    "Meta's Instagram soft-launches Threads to take on Twitter",
    "How many days will it take for FB's Threads app to have more users than Mastodon?",
    "Hey @mosseri, quick question.  What button do I press so I only see the people I follow?",
    "Zuck doing this to Elon during Cancer season is top shelf petty.",
    "What to know about Threads",
    "@amethyst@haunted.computer",
    "@jaredwhite@indieweb.social",
    "Threads is trying to entice people from Instagram using badges",
    "Millions sign on for Meta's Threads - here's how it is fighting Twitter + get the app",
    "Is NFT Twitter Dead? Influencers Swarm Over to Zuckerberg's Twitter Rival - Threads",
    "Tech Titans Clash: Musk vs. Zuckerberg in Epic Cage Fight as Meta Launches Threads",
    "Special Episode: Meta's Twitter Rival Arrives, with Adam Mosseri",
    "Meta Officially Launches Threads—Challenging Elon Musk And Twitter",
    "How to Open Threads Profiles from Mastodon and Twitter Directly in the Threads App",
    "Meta's Threads Can Have a Larger User Base Than Twitter, but There's a Catch",
    "Threads and Bluesky. [video]",
    "@rwaddilove@techhub.social",
    "You can't delete your Threads profile without deleting your whole Instagram",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "Does deleting Threads account delete your Instagram too?",
    "Deleting your Threads profile will also kill your Instagram account",
    "10 million people joined Threads in the first 7 hours, Zuckerberg claims",
    "Execs Say 10M Joined Threads in First 7 Hours",
    "It took 7 hours for Threads to reach 10 million users",
    "@Techmeme This is similar to Google, Microsoft and others.  One account for multiple services.",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "https://techcrunch.com/... *laughs maniacally*",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "I'm muting this but here's a screenshot [image]",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads: Ten million join Meta's Twitter rival, Zuckerberg says",
    "Instagram's Twitter Copycat Threads Meets Pent-Up Demand",
    "Threads has launched at an opportune time, but it'll be tough to outshine Twitter, analysts say",
    "Threads app surges to 10M users, Zuckerberg says of Twitter rival",
    "Threads gained 10 million new users in seven hours",
    "Meta's Rival to Twitter Already Has 10 Million Users. What to Know About Threads.",
    "Ten million flock to Meta's rival to Twitter, says Zuckerberg",
    "Instagram's Twitter killer Threads smashes 10 million user milestone hours after launch",
    "Zuckerberg's Twitter rival Threads reaches 10M users in 7 hours",
    "10 million sign up for Meta's Twitter rival app, Threads",
    "Threads, new Twitter rival, sees 5 million sign-ups in four hours of launch",
    "Welp, @FabrizioRomano is on Threads. It's for real [image]",
    "10 million sign ups in seven hours 🤯",
    "Threads just passed 2 million sign ups in the first two hours.",
    "Just passed 5 million sign ups in the first four hours...",
    "And here I was just a few hours ago putting rocket ship emojis on the 5 million post ...",
    "Threads has 10M sign ups in seven hours",
    "Introducing Superalignment  —  We need scientific and technical breakthroughs to steer …",
    "OpenAI is forming a team to rein in superintelligent AI",
    "ChatGPT maker to dedicate a fifth of compute power to preventing ‘rogue’ AI",
    "OpenAI forms a new team to ensure safe development of Superintelligent AI",
    "OpenAI creates a new team to tackle ‘superintelligent’ AI systems",
    "OpenAI introduces team dedicated to stopping rogue AI",
    "OpenAI doubles down on preventing AI from ‘going rogue’",
    "OpenAI building new team to stop superintelligent AI going rogue",
    "OpenAI Just Formed A Team To Keep Superintelligent AI Under Control",
    "OpenAI forms research team to tackle dangers of AI ‘superintelligence’",
    "OpenAI bets on new Superalignment team to stop AI going rogue",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/...",
    "Four years to save humanity from its own creation... the race is on... https://twitter.com/...",
    "so many grandiose sounding yet vacuous words in one blog post https://twitter.com/...",
    "OpenAI has gone off the deep end. https://openai.com/...",
    "I had to read the mind-numbing word “superalignment” and now so do you. https://twitter.com/...",
    "My alignment is bigger than yours. https://twitter.com/...",
    "“we aim to make sure god has good morals” https://twitter.com/...",
    "How droll. What we really need is a superduperalignment team. https://twitter.com/...",
    "Guys, time to drop a new buzzword https://twitter.com/...",
    "Introducing Superalignment",
    "OpenAI: Introducing Superalignment",
    "Introducing Superalignment - OpenAI blog post",
    "Introducing Superalignment by OpenAI",
    "Celsius ex-CEO ‘broke rules’, Valkyrie refiles for Bitcoin ETF, Fink backs crypto",
    "CFTC Concludes Former Celsius CEO Mashinsky Broke Rules Before Firm's Collapse: Report",
    "Celsius and former CEO Mashinsky broke US rules, CFTC concludes: Bloomberg",
    "CFTC Finds Former Celsius CEO Mashinsky Broke Number Of US Rules",
    "Celsius And Ex-CEO Mashinsky Violated US Regulations, CFTC Rules",
    "CFTC accuses Celsius of misleading investors, may file a lawsuit",
    "Crypto Daily Roundup: Larry Fink says ‘Crypto is Digitizing Gold’",
    "Celsius and Former CEO Alex Mashinsky Violated US Law, Says CFTC Spokesman",
    "CFTC Finds Celsius Network and Its Ex-CEO Guilty of Breaking Rules",
    "CFTC to find Celsius and Former CEO Mashinsky violated US rules, Bloomberg reports",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "CFTC investigators conclude ex-Celsius CEO Mashinsky broke US rules: Report",
    "CFTC Concludes Bankrupt Crypto Lender Celsius Broke Rules, Lawsuit Coming?",
    "CFTC Finds Celsius And Alex Mashinsky Guilty Of Breaking US Rules",
    "Former Celsius CEO Accused Of Breaking U.S. Laws Before Collapse",
    "Report: CFTC Considering Lawsuit Against Celsius Network and Former CEO",
    "CFTC investigators conclude Celsius, ex-CEO broke rules - Bloomberg News",
    "CFTC Investigators Conclude Crypto Lender Celsius, Ex-CEO Broke Rules",
    "Our Plan for a Sustainably Open Social Network",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "Purchase and Manage Domains Directly Through Bluesky",
    "Twitter rival Bluesky to offer paid service",
    "This is a pretty reasonable and inoffensive first paid service.  [embedded post]",
    "@twwilliams@curmudgeon.cafe",
    "Ruling Puts Social Media at Crossroads of Disinformation and Free Speech",
    "State Department Cancels Meta Meeting After Court Ruling",
    "State Department Cancels Meetings With Meta After Ban on Government Censorship Collusion",
    "Why the Biden administration is no longer allowed to talk to social media platforms",
    "What could go wrong? [embedded post]",
    "International Business Times",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Samsung Galaxy Z Fold 5 and Flip 5 preorder reservations are live: book yours now!",
    "The Samsung Galaxy Z Flip 5 and more are confirmed to be landing on July 26",
    "Watch the Samsung Galaxy Unpacked - Journey to Seoul advertisement [KM]",
    "Samsung Galaxy Unpacked 2023 confirmed: Here's what's launching",
    "Samsung confirms Galaxy Unpacked date; Galaxy Z Fold 5, Flip 5 launching on July 26",
    "Samsung's new foldables are launching on July 26",
    "Galaxy Unpacked 2023 Set for July 26: Join The New Flip Side",
    "Samsung is holding its next Unpacked on July 26 to unveil new foldables",
    "Samsung Electronics to hold Galaxy Unpacked event on July 26",
    "The latest Samsung Unpacked event will reveal its latest Galaxy foldable phones July 26",
    "Samsung's Next Foldables Set to Arrive On July 26",
    "Samsung Galaxy Z Fold 5 rumored price drop — how low could it go?",
    "Samsung's summer foldable event officially streams on July 26th",
    "Samsung Galaxy Unpacked event confirmed for July 26: Where to watch and what to expect",
    "Samsung Unpacked Confirmed for July 26: ‘Join the Flip Side’",
    "Where to watch Samsung's July 26 Galaxy Unpacked event",
    "Samsung's next foldables are coming on July 26",
    "Galaxy Z Fold 5 and Flip 5 launch July 26, reservations open today with $50 credit",
    "Save $50 when you reserve a Samsung Galaxy Z Fold 5 or Galaxy Z Flip 5 for a limited time",
    "Samsung's Unpacked for new Galaxy Z foldables to be held on July 26 in Seoul",
    "These Are The Foldable Phones We're Expecting At Samsung Unpacked On July 26",
    "Samsung will unveil its new foldables on July 26th",
    "The Galaxy Buds could be a no-show at Samsung Unpacked",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "America's first law regulating AI bias in hiring takes effect this week",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "New York City Targets AI Use in Hiring: Anti-Bias Law Explained",
    "@DrYohanJohn@fediscience.org",
    "@timnitGebru@dair-community.social",
    "@emilymbender@dair-community.social",
    "@maxleibman@mastodon.social",
    "Twitter silently removes login requirement for viewing tweets",
    "Meta and Twitter's Social Media Fight Begins. Sorry Musk, Zuckerberg Wins Round One.",
    "Why Meta Platforms Was Rising Today",
    "Talk about flippity-floppity!!  —  https://techcrunch.com/...",
    "L, and I cannot stress this enough, OL.  [embedded post]",
    "they figured out what another microservice does [embedded post]",
    "hahahahahahhahahahahahahahhahhahahahaha hahahahahahahahaa https://techcrunch.com/...",
    "Phew. Glad the Very Special Emergency was resolved quickly. https://twitter.com/... [image]",
    "@mranthropology.bsky.social",
    "@campuscodi@mastodon.social",
    "Why did Twitter place a limit to how many tweets users can read per day? Musk is here to explain.",
    "Update on Twitter's Rate Limits",
    "@Techmeme This makes zero technical sense.",
    "translated: we aren't paying our cloud hosting bills https://twitter.com/...",
    "Did Elon fire the PR team too? https://twitter.com/...",
    "Sure, Jan https://twitter.com/...",
    "It's also 💯 bullshit, the rate limit has zero effect on bots. https://twitter.com/...",
    "Did a rate limit write this https://twitter.com/...",
    "Spotify cutting off remaining customers paying through the App Store",
    "Spotify stops accepting payments that were set up through Apple's App Store",
    "How to update your Spotify payment method",
    "Spotify kicks off legacy subscribers still paying through the App Store",
    "Spotify subscribers: You can't pay through App Store any more",
    "Grandfathered Spotify Premium subscribers can no longer pay via the App Store",
    "Spotify Cuts Off Existing App Store Subscribers As Ongoing Feud With Apple Continues",
    "Spotify Subscribers No Longer Allowed to Pay Through App Store",
    "Spotify Stops Accepting Payments Set Up Via Apple's App Store",
    "Automate your routine tasks using Zoho Cliq",
    "Air Force colonel says it took AI 10 minutes to complete a task that can take humans days",
    "Pentagon is testing whether AI can plan response to an all-out war",
    "@Techmeme @KatrinaManson 😂",
    "A Too Good To Check classic. [image]",
    "@mikedewar@mastodon.online",
    "Mastercard's new AI tool will help banks tackle APP scams globally",
    "Mastercard AI tool helps UK banks take on real-time payment scams",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Lightmatter: Next-gen computing built for AI.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Wed. 07/05 - Twitter Chaos: The Real Fireworks",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Critical metals curbs ‘not targeting’ any country: China",
    "After TSMC, NXP Semiconductors says no material impact from Chinese export curbs",
    "China says it told the U.S. and Europe about the export controls in advance",
    "Taiwan chip giant sees no production hit from China curb on rare metals",
    "US says it opposes export controls by China on metals, will consult allies",
    "Blur founder denies NFT exchange drags down prices",
    "Blur founder defends platform amid NFT market slump",
    "Declining Royalty Payments: Nansen Study Highlights NFT Creator's Concerns",
    "It gets funnier by the day that they tried to brand this shit “web3” [embedded post]",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "Twitter receives money transmitter licenses in three US states",
    "Microsoft Teams Exploit Tool Auto-Delivers Malware",
    "New tool exploits Microsoft Teams bug to send malware to users",
    "Vimeo announces departure of CEO",
    "Video platform Vimeo's CEO Anjali Sud to step down",
    "Vimeo Announces Departure of Anjali Sud as CEO, Appointment of Adam Gross as Interim CEO",
    "ZIRP was nuts [embedded post]",
    "BREAKING: Vimeo is still around https://twitter.com/...",
    "@danilo.redeem-tomorrow.com",
    "Gfycat.com shuts down on September 1 and all Gifs will be taken down",
    "Gfycat is shutting down on September 1st.Time to save all your Gfycat GIFs. …",
    "Gfycat, the Snap-owned GIF hub, shuts down on September 1",
    "Prepare for a meme massacre: Snap snuffs out Gfycat in September",
    "ChatGPT's explosive growth shows first decline in traffic since launch",
    "What Threads Could Mean for Meta...and Twitter",
    "ChatGPT's Success Hits a Speed Bump With Decreasing Traffic",
    "OpenAI yanks Bing integration from ChatGPT after users “exploit” bug to bypass paywalls",
    "ChatGPT's Website Traffic Dipped for the First Time Since Its Launch,",
    "Karkhana.io digitizes the manufacturing process",
    "CADDi Raises $89 Million to Expand Procurement Platform and Cloud Service",
    "Actively exploited vulnerability threatens hundreds of solar power stations",
    "Munich's EGYM takes on $225 million via Jared Kushner's Affinity Partners as it eyes an IPO",
    "Jared Kushner's Affinity Makes First European Investment",
    "Generative AI Games Raise Copyright Ownership Concerns",
    "Binance Australia's Offices Searched by Financial Regulator: Bloomberg",
    "Binance Australia Offices Searched By Regulators in Derivatives Probe",
    "Fairphone 4—the repairable, sustainable smartphone—is coming to the US",
    "The modular Fairphone 4 is now available in the US, but there's a big catch",
    "Fairphone 4: A Phone For Those Who Care About Sustainability, Not Megapixels",
    "Sustainable Fairphone 4 set to arrive to the US, starting at $630",
    "Fairphone 4—the repairable, sustainable smartphone, is coming to the US",
    "The environmentally conscious Fairphone 4 is finally coming to the US",
    "Fairphone is coming to America"
]