[
    "Data Protection Commission",
    "European Data Protection Board",
    "San Francisco Business Journal",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "EU hits Meta with record €1.2B privacy fine",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "EU slaps Meta with $1.3 billion fine for moving data to US servers",
    "Facebook to be fined £648m for mishandling user information",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Meta hit with record $1.95 billion fine",
    "Pocket.watch's Streaming Expansion",
    "Facebook owner Meta expected to face record fine over transfer of European data to US servers",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "EU, U.S. data transfer pact expected by summer, EU Commission says after Meta fine",
    "Meta Platforms receives $1.3B European fine for failure to protect user data and privacy",
    "Meta fined $1.3 billion for violating European data privacy rules",
    "European watchdog fines Meta $1.3 billion over privacy violations",
    "Meta Fined Record $1.3 Billion for Violating EU Rules on Data Transfers",
    "Breaking Meta fined €1.2 billion by Irish data watchdog",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta Hit With $1.3B Record-Breaking Fine for GDPR Violations",
    "DPC fine should be a wake-up call for government",
    "That Meta GDPR fine is €1.2B.  Plus biz must stop sending EU data to US",
    "Meta fined $1.3 billion by EU for privacy violations",
    "Meta fined $1.3 billion for transferring user data from the EU to the US",
    "Meta to fight “unjustified” record $1.3 billion GDPR fine",
    "EU Regulators Hit Meta with Record $1.3 Billion Fine for Data Transfer Violations",
    "Meta Fine, Not Fine  —  DATA PROTECTIONDATA PROTECTION BY DESIGNDATA STRATEGYTECH TRENDS",
    "Meta fined €1.2B in the EU for moving users' data to the US",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "As Meta is hit with EU data ban and $1.3 billion fine, what happens next?",
    "Meta Fined €1.2bn for Violating GDPR",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "CCIA Statement on Irish Decision Regarding EU-US Data Transfers",
    "Meta fined record $1.3 billion by EU over handling of Facebook user data",
    "EU regulators fine Meta a record-breaking $1.3B for data privacy violations",
    "Meta Receives €1.3 Billion Fine For Sending EU Facebook Data to the US",
    "Facebook hit with record $1.3B fine in European privacy case",
    "Facebook Ordered to Suspend Data Transfers to US From Europe",
    "Meta slapped with massive $1.3B fine for EU-U.S. data transfers",
    "Facebook privacy breach sees parent company Meta fined a record $1.3B",
    "Meta's new record-setting EU fine is nearly as big as its last six combined",
    "Irelands slaps Meta with $1.3B fine over GDPR data privacy violations",
    "Meta's €1.2bn fine for breaching GDPR could have a big impact on EU-US data transfers",
    "EU Fines Meta A Record $1.3 billion For Violating EU Privacy Law",
    "Meta gets hit with a $1.3 billion fine by the EU for sending personal data to the US",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers",
    "Meta ordered to pay a $1.3 billion fine because they're bad with data",
    "Irish DPA Finally Fines Facebook",
    "EU hands Meta record $1.3 billion fine over data transfers to US",
    "Meta hit with record €1.2 billion fine for transferring European Facebook user data to the US",
    "Meta Was Just Fined a Record-Breaking $1.3 Billion by E.U. Regulators",
    "Meta fined 1.2 billion euro for violating GDPR in the EU",
    "Facebook Fined €1.2 Billion for Transferring EU User Data to the US",
    "EU fines Meta €1.2bn over transfer of data to US",
    "Meta Issued Record-Breaking $1.3 Billion Fine for Mishandling Data",
    "EU hits Meta with $1.3 billion fine for transferring European user data to the US",
    "EU fines Facebook $1.3 billion for privacy violations",
    "EU slaps Meta with $1.3 billion fine over data privacy concerns",
    "Meta Fined $1.3bn In Europe's Largest GDPR Punishment to Date",
    "Facebook Owner Meta to Challenge Historic €1.2 Billion Fine",
    "Meta Executives Respond to Record $1.3 Billion GDPR Fine",
    "EU Slaps Meta With Record €1.2 Billion Fine Over Sending User Data To US",
    "Meta breached your privacy for the sake of adverts — and has been fined $1.3bn as a result",
    "Facebook's Meta fined a record $1.3 billion for transferring EU users' data to the US",
    "Biggest fines under EU privacy law",
    "Facebook Fined $1.3B — Zuckerberg Furious in GDPR Fight",
    "Meta Down 1.4% Premarket After $1.3B Fine Over US Data Transfers",
    "Meta receives record €1.2bn GDPR fine for US data transfers",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "EU regulators hit Meta with record $1.3B fine in data privacy inquiry",
    "Meta hit with €1.2B fine over data privacy rules",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "It's always fun when reporters don't respect embargoes.",
    "@JohnSullivan@mastodonapp.uk",
    "A tweet about a Pentagon explosion was fake.  It still went viral.",
    "‘Verified’ Twitter accounts share fake image of ‘explosion’ near Pentagon, causing confusion",
    "Market dips briefly after AI image of fake explosion near Pentagon goes viral",
    "Fake picture of explosion at Pentagon spooks Twitter",
    "FACT FOCUS: Fake image of Pentagon explosion briefly sends jitters through stock market",
    "Verified Twitter Account Pushes AI-Generated Image of Pentagon ‘Explosion’",
    "Fake Pentagon attack hoax shows perils of Twitter's paid verification",
    "‘Verified’ Twitter Accounts Spread Pentagon Explosion Hoax",
    "How Fake AI Photo of a Pentagon Blast Went Viral and Briefly Spooked Stocks",
    "Fake Image Of Explosion Near Pentagon Went Viral—Even Though It Never Happened",
    "AI-Generated Hoax of Pentagon Explosion Sparks Brief Market Sell-Off",
    "Twitter Tests New Explainer Pop-Up on Verified Accounts Which Displays Date Verified",
    "Fake image of Pentagon explosion goes viral",
    "Fake Pentagon explosion photo caused a real dip in the stock market",
    "Faked Images of Pentagon Explosion Circulate on Twitter",
    "AI-generated photo of fake Pentagon explosion sparks brief stock selloff",
    "AI-Generated Image of Pentagon Explosion Caused Markets to Dip",
    "Pentagon explosion hoax goes viral after verified Twitter accounts push",
    "Large Explosion near The Pentagon Complex in Washington D.C. - Initial Report",
    "pay-to-\"verify\" blue checks... 🥴 https://twitter.com/...",
    "Ah yes, no-one saw this coming. https://www.vice.com/...",
    "New Twitter is fraud-friendly https://twitter.com/...",
    "This election season is gonna be hell with AI-assisted disinformation. https://twitter.com/...",
    "Russian propaganda now running with this lie. https://twitter.com/...",
    "Twitter bug sees deleted tweets resurrected for some users",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "Twitter users report deleted tweets return, won't delete",
    "Those tweets you deleted might be back online without your knowledge",
    "Twitter's latest bug reportedly restores deleted tweets and retweets",
    "A Twitter Bug Is Restoring ‘Deleted’ Tweets and Retweets",
    "Oh crap! Thanks to @jjvincent for the reporting on this. https://www.theverge.com/...",
    "lol lmao good luck in EU courts Elon https://twitter.com/...",
    "How soon before our DM end up in our public timeline? https://artifact.news/...",
    "Everything is going well here at twitter dot com. https://www.theverge.com/...",
    "Now you can edit your WhatsApp messages",
    "Now You Can Edit Your WhatsApp Messages",
    "WhatsApp Users Can Now Edit Messages For Up to 15 Minutes",
    "Meta is giving users 15 minutes to edit WhatsApp messages",
    "WhatsApp testing ability to edit messages, similar to iMessage and Telegram [U: Available now]",
    "WhatsApp Will Now Let You Edit Your Sent Messages for up to 15 Minutes After Hitting ‘Send’",
    "WhatsApp now lets you edit your messaging nightmares - here's how to do it",
    "WhatsApp adds iMessage-like editing with a 15 minute window",
    "You Can Now Edit Sent Messages on WhatsApp—If You're Fast Enough",
    "WhatsApp gains the ability to edit sent messages across chats",
    "WhatsApp is finally letting everyone edit sent messages with the latest update",
    "WhatsApp finally lets you fix typos in sent messages",
    "WhatsApp Now Lets You Edit Messages for 15 Minutes After Sending Them",
    "WhatsApp Now Lets You Edit Your Messages",
    "Introducing WhatsApp's latest superpower: edit your sent messages!",
    "WhatsApp Now Lets You Edit Messages (But You Have To Be Quick)",
    "Mark Zuckerberg announces new feature that lets users edit WhatsApp messages",
    "WhatsApp finally rolls out message editing for the masses",
    "You can edit messages on WhatsApp, Finally!",
    "WhatsApp finally allows you to edit sent messages",
    "Message editing is coming to WhatsApp",
    "You can finally edit WhatsApp messages, with one major limitation",
    "WhatsApp's latest update lets you edit messages within 15 minutes of sending them",
    "You can finally edit messages on WhatsApp",
    "WhatApp is borrowing one massive iMessage feature, and it's about time",
    "WhatsApp Now Lets You Edit Messages Within 15 Minutes Of Sending",
    "WhatsApp finally rolls out the ability to edit messages",
    "Editable WhatsApp messages are coming to help you fxi silly typos",
    "WhatsApp Edit Messages feature soon to be there",
    "WhatsApp Says You Can Now Edit Messages",
    "WhatsApp allows users to edit messages",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "General Secretariat of the Council of the European Union",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "Google's Photos App is Still Unable to Find Gorillas",
    "Wait what? https://twitter.com/...",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "OpenAI CEO Sam Altman lays out his company's view of AI regulation.",
    "The hype game becomes the regulatory capture game. https://openai.com/...",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "US District Court, District of Montana",
    "TikTok sues Montana over new law banning the app",
    "TikTok sues Montana to block ban, citing First Amendment",
    "TikTok sues Montana over controversial state ban",
    "TikTok Sues Montana, Calling State Ban Unconstitutional",
    "TikTok sues Montana over ban, claims national security concerns “unfounded”",
    "TikTok sues Montana over law that bans app",
    "TikTok files lawsuit to overturn Montana's 1st-in-nation ban on the video sharing app",
    "TikTok Sues Montana to Reverse App Ban",
    "TikTok hits Montana with federal lawsuit in attempt to dissolve ban",
    "TikTok, Citing First Amendment, Sues Montana Over Impending Ban",
    "TikTok sues Montana to block first statewide ban of app",
    "TikTok is suing Montana over statewide ban",
    "TikTok sues Montana to reverse state's ban of the app",
    "TikTok sued Montana over its statewide ban of the app",
    "TikTok sues Montana after new law banning its app",
    "TikTok Files Lawsuit Against Montana, Calls State Ban Unconstitutional",
    "TikTok sues Montana over statewide ban",
    "TikTok Sues Montana, Claiming the App's Ban is Unconstitutional",
    "TikTok Sues Montana Over Law Banning the App, Arguing It Violates First Amendment",
    "TikTok files lawsuit against Montana over download ban",
    "TikTok Sues Montana Over State's Ban of Its Service",
    "TikTok sues Montana over app ban",
    "TikTok Inc. v. Austin Knudsen",
    "Social media expert discusses consequences of changes for TikTok, Twitter",
    "Oak Ridge National Laboratory",
    "US supers maintain grip on Top500 list as China seemingly hides its powers",
    "Early Frontier users seize exascale advantage, grapple with grand scientific challenges",
    "Top500: Frontier Gains 92 Petaflops; Henri Gets a Little Greener",
    "TOP500 List Updated With Frontier Remaining At The Top",
    "AMD-powered Frontier supercomputer remains top dog and boosts performance",
    "TOP500 supercomputers list: US continues to dominate, number of AMD-powered systems increases 29%",
    "Top500 List Shows AMD Leading With 121 Supercomputers In Its Bag, 168 Powered By NVIDIA GPUs",
    "Frontier still reigns as world's fastest supercomputer",
    "Nvidia, HPE Announce Superchip-Powered ‘Isambard 3’ Supercomputer",
    "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers",
    "NVIDIA Notches a Modest Grace Superchip Win at ISC 2023",
    "Uber Puts Diversity Head on Leave After Worker Backlash Over 'Don't Call Me Karen' Events",
    "Uber's diversity chief on leave after employee criticism over 'Don't Call Me Karen' panel",
    "Uber Diversity Chief Suspended After Events on Race Spark Uproar",
    "Uber diversity exec put on leave after hosting 'Don't Call Me Karen' panel",
    "Uber suspends diversity chief over 'Don't Call Me Karen' events",
    "Uber suspended its DEI chief after she hosted events titled “Don't Call Me Karen”",
    "This is everything all at once https://www.nytimes.com/...",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Zoom Raises Annual Sales Forecast in Sign Pandemic-Era Customers Here to Stay",
    "Zoom ends Q1 with 215,900 enterprise customers, touts AI strategy",
    "Introducing speech-to-text, text-to-speech, and more for 1,100+ languages",
    "Meta's open-source speech AI recognizes over 4,000 spoken languages",
    "Preserving the World's Language Diversity Through AI",
    "Meta Open Sources Multi-Lingual Language Models to Maximize Inclusion",
    "Meta's Open Source AI Project Can Identify 4,000+ Spoken Languages",
    "Meta AI open-sources tools for self-supervised training of speech recognition models",
    "We're open sourcing another new AI model today that we call Massively Multilingual Speech. …",
    "South Korea signals its chipmakers can fill gap after China's ban on Micron",
    "US Expresses ‘Serious Concerns’ About China Move Against Micron",
    "China's Micron ban creates chip dilemma for Samsung, SK Hynix",
    "South Korea's SK Hynix shares rise slightly after China fails U.S. rival Micron in security review",
    "With Ban on Micron, China Escalates Microchip Clash With U.S.",
    "Micron expects revenue impact following China ban",
    "China bans Micron from being used for major infrastructure projects in the country",
    "China wants U.S. to meet it halfway and fix ties",
    "China's Micron ban revives U.S. trade tensions, fuels Asian chip rally",
    "Who will benefit from China's Micron ban?",
    "China bans US chipmaker Micron from key infrastructure projects",
    "Revelations of surveillance misuse complicate policy fight",
    "China bans major chip maker Micron from key infrastructure projects",
    "China Action Against Micron Called Political, Seen Crimping Sales",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "China bars Micron chips from critical infrastructure purchases",
    "China fails Micron's products in security review, bars some purchases",
    "Chinese agency claims U.S. chipmaker Micron poses national security risk",
    "China Bans Micron Chip Sales",
    "3 US chip stocks to watch as China cracks down on Micron",
    "Monday, May 22, 2023  —  More layers of uncertainty, demonetization, BTC payments and more",
    "China imposes sales ban on Micron citing national security risks",
    "China bans chip maker Micron from key infrastructure projects",
    "China bans US chipmaker Micron in apparent retaliation for sanctions",
    "China bans Micron chips over “network security risks”",
    "China hits back, bans major US chip maker Micron",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "China bans Micron chips in key infrastructure over ‘national security’ risks",
    "China Bans Some Sales of Chips From U.S. Company Micron",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/22 - Meta Hit With Biggest Ever GDPR Fine",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Google upgrades its AI flood-forecasting technology to help more people",
    "Google's AI-powered Flood Hub disaster alert system is now available in 80 countries",
    "Google's AI-enabled flood forecasting goes global",
    "Google expands its AI-powered Flood Hub to 80 countries",
    "Google expands AI flood forecasting tool to Ireland among other locations",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden picks new FCC nominee to fill seat that's been empty for over two years",
    "Comcast Statement on FCC Nomination and Renominations",
    "President Biden nominates a fresh face to break FCC deadlock",
    "Biden nominates telecom attorney Anna Gomez to FCC after more than two years of deadlock",
    "Biden names Democrat Anna Gomez as nominee for fifth FCC seat",
    "Biden Nominates Telecom Attorney Anna Gomez as FCC Commissioner",
    "Biden Names FCC Picks, Pushes for Democratic Majority at Deadlocked Agency",
    "FCC Nominee Anna Gomez is an FCC and NTIA Veteran",
    "Biden to nominate Dem Anna Gomez for key FCC seat after Gigi Sohn flap",
    "Board resolutions face shareholder pushback",
    "FlowX.AI Raises USD35M in Series A Funding",
    "FlowX.ai Raises $35M in Groundbreaking Funding to Accelerate Enterprise Digitization with AI",
    "AI enterprise innovator FlowX.AI rakes in $35m, eyes global expansion",
    "Romanian insurtech FlowX.ai raises $35M in a Series A round",
    "He Was Investigating Mexico's Military. Then the Spying Began. https://www.nytimes.com/...",
    "You Can Now Buy Stepn NFTs on iOS—But You'll Have to Pay the Apple Tax",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Blockchain Gaming Platform STEPN Integrates With Apple Pay, Here's What We Know",
    "Web3 Lifestyle App STEPN Integrates Apple Pay for In-Game Purchases",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "Professor Falsely Students of ChatGPT Plagiarism",
    "Applied Materials wants Uncle Sam's help with $4B chip R&D nerve center",
    "Applied Materials to Spend Up to $4 Billion in Silicon Valley Thanks to Chips Act",
    "Silicon Valley Business Journal",
    "Applied Materials to create multibillion-dollar R&D facility in Silicon Valley",
    "Meta and data, chips and dips, crypto and meltdowns",
    "Applied Materials Plans to Build $4 Billion R&D Site With US Aid",
    "Applied Materials to invest $4 bln in Silicon Valley chip research center",
    "Applied Materials to Build $4 Billion Chip Research Facility in Silicon Valley",
    "Semiconductor manufacturer to invest $4B for new facility in California",
    "Patient21 Raises $108 Million to Expand Digital Health Platform",
    "Dentistry software provider Patient21 raises healthtech's biggest round of 2023",
    "Patient21 Nabs $108M To Expand In-Person Health Care Offerings",
    "Patient21 Raises €100M in Series C Funding",
    "iPhone maker Wistron calls it quits, saying Apple didn't allow it to make a profit",
    "Wistron is Selling Its India iPhone Assembly Business to Tata Group [Report]",
    "Wistron quits making iPhones in India to focus on Vietnam",
    "Unable to make a profit, Wistron is giving up iPhone assembly in India",
    "Attacker Takes Over Tornado Cash DAO With Vote Fraud, Token Slumps 40%",
    "Tornado Cash attacker to potentially give back governance control, proposal reveals",
    "TORN Price gets Lift After Tornado Cash Attacker Proposes to Reverse Governance Attack",
    "Tornado Cash attacker proposes to return control",
    "DeFi has rough weekend with Aave and Tornado Cash chaos",
    "Tornado Cash Attacker Funnels 360 ETH Through Crypto Mixer After Weekend Governance Exploit",
    "Tornado Cash attacker considers returning governance control",
    "Hijacker's Remorse in Tornado Cash Governance Tussle?",
    "Tornado Cash Hacker Hints of Undoing Attack Pushing Price of Torn Up by 10%",
    "Tornado Cash DAO suffers hostile takeover",
    "Bitcoin miner revenue derived from fees drops to 7%",
    "Global Crypto Mining News (May 15 to May 21)",
    "Bitcoin Mining  —  Mining Purpose and Function:  —  Miners are an essential component …",
    "Bitcoin Mining Revenue Surges after Increased Interest in Memecoins and NFTs on Blockchain",
    "Ordinals boost Litecoin and Dogecoin's network activities",
    "Dogecoin, Litecoin Transactions ‘Spike’ After Ordinals Intervene"
]