[
    "Read the new Twitter CEO's first email to employees",
    "Twitter's New CEO Makes It Clear: This Is Elon's Ship, She's Just Running It,",
    "People are getting fired up about Twitter CEO Linda Yaccarino's ‘Enter Twitter 2.0’ announcement",
    "Twitter boss Linda Yaccarino gives first hint on shake-up plans",
    "Twitter CEO Linda Yaccarino Outlines “Twitter 2.0” Vision",
    "Twitter 2.0 explained by the new CEO",
    "New Twitter CEO outlines her plans for the social media platform",
    "Twitter CEO Linda Yaccarino Says Twitter Will Be World's Most Accurate Information Source",
    "Twitter 2.0: New CEO's Vision for the World's Most Accurate Information Source",
    "New Twitter CEO wants to create ‘global town square’: report",
    "Twitter CEO Linda Yaccarino pens downs a letter for employees: Here's what the letter says",
    "Twitter Sends First Comms Email Since Takeover",
    "Twitter's new CEO has shared her first email to employees",
    "Twitter's new CEO wants to turn it into the 'world's most accurate real-time information source'",
    "Elon Musk Successor Reveals Real Reason She Chose Twitter",
    "Twitter CEO Linda Yaccarino echoes Musk in emphasizing freedom of speech in debut tweet thread",
    "Twitter's new CEO just sent her first email to employees, then posted it on Twitter",
    "excruitiatingly hollowed words.  the glass cliff is real.",
    "Hello Twitter. People keep asking me: Why Twitter? So, I'll tell you. 👇",
    "Fire your ghostwriter, Linda https://twitter.com/...",
    "Good luck but extremely skeptical it'll go as she envisions https://www.theverge.com/...",
    "never on this app lol https://twitter.com/...",
    "Has she told Elmo this? https://twitter.com/...",
    "Breaking Points on YouTube",
    "International Business Times",
    "EXCLUSIVE: Jack Dorsey On RFK Jr. Elon Musk, AI Regulation | Breaking Points",
    "Jack Dorsey saga: How Elon Musk learnt fast to respect strict Indian laws [details]",
    "Jack Dorsey Says that He Hopes Twitter would Adopt Bitcoin Technology",
    "'That's why they banned Rahul Gandhi': Congress after Jack Dorsey claims ‘govt pressure’",
    "India slams ex-Twitter chief's claims of pressure as ‘outright lie’",
    "India Denies Dorsey's Claims It Threatened to Shut Down Twitter",
    "India threatened to shut Twitter and raid employees",
    "India threatened to block Twitter, raid employees: former CEO Jack Dorsey",
    "Outright lie, no one was raided or sent to jail: Rajeev Chandrasekhar to Dorsey",
    "India threatened to shut down Twitter, says ex-CEO Jack Dorsey; govt says ‘outright lie’",
    "Breaking: Jack Dorsey Alleges Indian Govt Threatened To Shut Down Twitter, Raid Employees",
    "Murder of democracy...: BJP, Congress spat over Twitter co-founder Jack Dorsey's claim. Watch",
    "Centre dismisses Jack Dorsey's claims of Twitter shutdown over farmer protests",
    "Government rejects ex-Twitter CEO Dorsey's ‘Shut Down’ claim as ‘outright lie’",
    "India Refutes Jack Dorsey's Allegations On Pressure During Farmers' Protests",
    "India Clashes With Twitter Ex-CEO Dorsey Over Removal of Posts",
    "India threatened to shut down Twitter and raid employees' homes, Jack Dorsey says",
    "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials",
    "SEC officials pushed Hinman to clarify ETH wasn't a security: Court docs",
    "XRP Jumps After Highly Anticipated Hinman Docs Are Unsealed",
    "Hinman docs unsealed: SEC concerned over ‘Ether is not a security’ statement",
    "Ripple v. SEC and the Hinman Speech: What Happened Behind the Scenes",
    "Ripple CEO Will Not Describe Hinman Emails as ‘Fraud’",
    "In Response to Hinman Docs, Ripple CEO Slams SEC's “Politically-Motivated Overreach”",
    "Hinman Emails Show Several SEC Officials Had Input on 2018 Speech",
    "Ripple's CEO sees release of Hinman documents as positive",
    "Dissecting the ‘Hinman Emails’: Adam Cochran on SEC Staff's Concerns over Comments About Ethereum",
    "Ripple's chief legal officer calls for investigation after release of Hinman docs",
    "Hinman speech contained “made-up analysis”, Ripple's Chief legal officer says",
    "Next 24 Hours Will Be Critical For Crypto - Here's Why",
    "Hinman Doc. Release: Ripple Garlinghouse says it is Worth the Wait",
    "Full document 👇🏼 https://www.dropbox.com/...?",
    "Hinman details very clearly saying ETH is not a security https://twitter.com/...",
    "@MikeRiverso@mastodon.social",
    "Apollo's Christian Selig explains his fight with Reddit — and why users revolted",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "Thousands Of Reddit Communities Go Private To Protest Platform's New Price Policy For Apps",
    "Reddit says protesting communities crashed the site",
    "Reddit faces backlash as thousands of communities ‘black out’ over new API pricing",
    "Over 8,000 subreddits go dark in protest against Reddit's API fees",
    "Reddit goes dark over API price changes that'll kill third-party apps and NSFW content",
    "Over 7k Subreddits Go Private in Protest Over API Pricing Increase",
    "Reddit's Crypto Communities Go Dark In Support of Protest Against API Changes",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Reddit Crashed Because Too Many Users Are Protesting Site Changes",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Thousands of Reddit communities ‘go dark’ in protest of new developer fees",
    "Reddit communities go dark to protest upcoming API changes",
    "Reddit API charges spark community outrage, dayslong blackout",
    "You're making money while increasing interest in our site?  Bad third party apps, bad.",
    "“The adventure that is the end of free money continues!” https://twitter.com/...",
    "won't be anything left to take public. https://twitter.com/...",
    "OpenAI reportedly warned Microsoft about Bing's bizarre AI responses",
    "Microsoft's complicated relationship with OpenAI",
    "How awkward :) https://twitter.com/...",
    "AI used to create new and final Beatles song, says Paul McCartney",
    "Paul McCartney says AI tools helped rescue John Lennon vocals for ‘last Beatles record’",
    "Paul McCartney used AI to make a new Beatles song",
    "Paul McCartney: AI has enabled a “final” Beatles song",
    "Paul McCartney uses AI to resurrect old John Lennon demo for “final Beatles record”",
    "Paul McCartney is using AI to create a final song for The Beatles",
    "The Beatles Used AI to Create Their ‘Final Song’ With John Lennon's Voice",
    "Paul McCartney Says A.I. Helped Complete ‘Last’ Beatles Song",
    "Paul McCartney Says “Final Beatles Record” In Works With AI-Assisted John Lennon Vocal",
    "How Paul McCartney Used AI to Create the ‘Final Beatles Record’",
    "Paul McCartney: AI helps create ‘the last Beatle record’",
    "Paul McCartney Is Using AI To Complete ‘Final’ Beatles Song",
    "Paul McCartney Used AI to Make a Final Beatles Song — But Not In a Creepy Way",
    "AI helped create ‘last Beatles record,’ Paul McCartney says",
    "Paul McCartney Confirms The Beatles Will Release ‘Final’ Song Using AI",
    "The Beatles releasing ‘final’ album this year — with a little help from AI",
    "Paul McCartney Used AI to Finish an Unreleased Beatles Song",
    "Paul McCartney Says He's Using AI to Build the ‘Final’ Beatles Song",
    "The Beatles Come Together for ‘Last Record’ Using AI, Paul McCartney Says",
    "Paul McCartney Says He Used AI to Produce a “Final” Beatles Song",
    "‘Last Beatles record’ is on the way (with a little help from AI friends)",
    "Paul McCartney says A.I. got John Lennon's voice on ‘last Beatles record’",
    "AI helped make a song on ‘the last Beatles record’, McCartney says",
    "Paul McCartney says ‘final’ Beatles song coming thanks to artificial intelligence",
    "The Beatles are over. Why can't McCartney just let it be?https://www.bbc.com/...",
    "United States District Court, Northern District of California",
    "FTC files to block Microsoft from buying Activision Blizzard",
    "Federal Trade Commission v. Microsoft Corp. and Activision Blizzard, Inc.",
    "US FTC seeks court order to block Microsoft acquisition of Activision -source",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC Seeks Injunction to Stop Microsoft From Closing Activision Deal",
    "FTC sues to block Microsoft's takeover of video game maker Activision Blizzard",
    "US FTC moves to block Microsoft-Activision deal",
    "FTC to seek federal court order temporarily blocking Microsoft-Activision deal",
    "FTC asks federal judge to block Microsoft's $69 billion Activision deal",
    "FTC asks court to prevent Microsoft closing Activision Blizzard deal early",
    "FTC Sues Microsoft to Block Activision Blizzard Acquisition",
    "Microsoft's Acquisition of Activision Blizzard in Jeopardy After FTC Files Injunction",
    "The FTC has asked a US court to temporarily block Microsoft's acquisition of Activision Blizzard",
    "FTC Motions for an Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "FTC files restraining order to block Microsoft's Activision Blizzard deal",
    "FTC Files for Temporary Restraining Order against Acquisition of Activision Blizzard by Microsoft",
    "FTC files to temporarily block the Microsoft-Activision deal",
    "US regulators move to block Microsoft's acquisition of Activision Blizzard",
    "The FTC is filing an injunction to block Microsoft's Activision acquisition",
    "FTC Files Injunction to Block Microsoft's Activision Deal: What to Know",
    "FTC files injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC Officially Moves To Block Microsoft's Activision Blizzard Acquisition",
    "FTC Sues to Block Massive Tech Deal",
    "FTC files lawsuit to block Microsoft deal to buy Activision Blizzard",
    "Microsoft Welcomes FTC's Injunction on Xbox's Activision Blizzard Buyout",
    "The FTC files an injunction to block the Activision Blizzard deal",
    "FTC asks judge to put a stop to Microsoft-Activision deal immediately",
    "FTC Files Temporary Restraining Order and Preliminary Injunction Against Microsoft",
    "Report: FTC seeking injunction to block Microsoft's Activision Blizzard acquisition",
    "Microsoft Met With Another Roadblock in Activision Blizzard Acquisition",
    "FTC tries to block Microsoft Activision deal",
    "The FTC Is Reportedly Filing To Block Microsoft's Activision Blizzard Acquisition",
    "FTC Reportedly Plans to File an Injunction Against Microsoft's Acquisition of Activision Blizzard",
    "FTC asks US court to block Microsoft-Activision Blizzard deal",
    "FTC reportedly seeks injunction to stop Microsoft's Activision Blizzard deal",
    "FTC to Sue Microsoft to Block $69 Billion Activision Deal: Report",
    "FTC files injunction to temporarily block Microsoft's Activision Blizzard deal",
    "The FTC doubles down on its opposition to Microsoft acquiring Activision with a new injunction",
    "The FTC is reportedly filing an injunction against the Xbox-Activision deal",
    "The FTC can change the venue, but not the facts. https://twitter.com/...",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft, Activision Deal",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "From Fan Funding to Shopping: More ways for creators to earn on YouTube",
    "Earning Money on YouTube Just Got Easier",
    "YouTube is lowering the eligibility requirements for creators to make money",
    "YouTube drastically lowers requirements for video monetization",
    "Changes to YouTube Partner Program terms",
    "It's now easier to get your YouTube channel monetized",
    "YouTube makes it much easier for everyone to earn money from making videos",
    "ICYMI Alert: YouTube Gives Smaller Creators Earlier Access to YPP",
    "@davidgerard@circumstances.run",
    "Emmer, Davidson Introduce ‘SEC Stabilization Act’ to Remove Chair Gary Gensler",
    "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "Maybe Coinbase Should Never Have Gone Public",
    "Congressmen Introduces Bill to Fire Gensler: Here's What it Would Mean for Crypto",
    "US Lawmakers Float New Bill to Sack SEC Chair Gary Gensler",
    "Gary Gensler hasn't always believed everything but bitcoin is a security",
    "U.S. Congressman Officially Files Bill to Fire SEC Chair Gary Gensler",
    "The SEC has spoken: The future of finance is not in America",
    "“But the SEC let us go public” and other flawed arguments in Coinbase's defense",
    "Netflix reportedly plans first live sports event with celebrities playing golf",
    "Netflix Could Stream its First Live Sports Event This Fall",
    "Netflix in talks to live stream its first sports event later this year, says report",
    "Netflix is reportedly getting ready to stream its first-ever sporting event",
    "Netflix's first live sports stream could have Apple TV Plus and Paramount Plus worried",
    "Netflix to stream celebrity golf tournament",
    "Netflix may soon livestream a golf tournament featuring F1 drivers and pro golfers",
    "Netflix weighs live broadcast of golf tournament, its first foray into live sports, WSJ says",
    "I feel like the professional golfers have an edge here",
    "Lolwut  —  Not sure what the opposite of clickbait is (click repellent?) but this qualifies",
    "I'm going to put my money on the professional golfers https://twitter.com/...",
    "I would very much watch this please and thank you https://twitter.com/...",
    "Together at last: the two dullest non-sports on the planet https://twitter.com/...",
    "Office of the Director of National Intelligence",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data, U.S. Says",
    "US intelligence confirms it buys Americans' personal data",
    "Report: FBI buys your phone data, just like everyone else",
    "US Government Has Secretly Used Data Brokers to Amass Information on Citizens",
    "FBI Pays for Your Phone Data and There's Nothing You Can Do to Stop It",
    "Confirmed: US Intelligence agencies are buying personal data, raising privacy concerns",
    "US government admits to buying Americans' personal data",
    "U.S. Government Buying ‘Intimate’ Data About Americans, Report Finds",
    "US intelligence agencies buy Americans' personal data, new report says",
    "The U.S. Is Openly Stockpiling Dirt on All Its Citizens Thanks to Commercial Data Brokers",
    "ODNI Declassified Report on CAI",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data",
    "The US Is Openly Stockpiling Dirt on All Its Citizens",
    "Uniswap Labs releases draft code for ‘entirely new’ version of Uniswap",
    "Uniswap Update Means ‘The Possibilities Are Pretty Endless,’ Says Developer",
    "Uniswap Labs Shares Roadmap for Uniswap v4",
    "Uniswap v4: Customizable And Cost-Effective Solution For DEXs?",
    "Uniswap V4 code draft features custom liquidity pools plugins",
    "Uniswap releases version 4 code, allowing for new types of liquidity pools",
    "Congrats to the team on Uni v4 https://github.com/...",
    "MrBeast's Latest Video Breaks His Own View Record in 24 Hours",
    "Flavrs Cooks Up Creator Equity Fund",
    "MrBeast smashes his own YouTube views record from Squid Game video in only 24 hours",
    "This is worth your time and moral dilemma. https://www.nytimes.com/...",
    "MrBeast has become a viral sensation for his acts of altruism",
    "AI-powered Google Search could affect web information ecosystem",
    "Oracle founder Larry Ellison now world's 4th richest person",
    "The Download: inaccurate welfare algorithms, and training AI for free",
    "Nothing Phone (2) launches on July 11 - here's everything we know so far",
    "The Nothing Phone 2 Finally Has a Launch Date",
    "Nothing Phone (2) Has a Release Date, But We Still Don't Know Its Price",
    "Nothing Phone 2 launches on July 11",
    "Nothing Phone 2 launch date confirmed, here's the info you need",
    "Nothing will reveal the Phone 2 on July 11th",
    "Nothing Phone (2) to launch on July 11",
    "It's official — Nothing Phone (2) is launching July 11 and it's coming to the US",
    "Here's Where you can Watch the Nothing Phone 2 Launch Event",
    "Nothing Phone 2 Launch Date is Finally Confirmed, Releasing Earlier Than Expected",
    "Nothing Phone (2) Launch Date Confirmed with a US Release",
    "Nothing Phone (2) announcement set for July 11",
    "Nothing Phone 2 to launch on July 11: Here's what you need to know",
    "Nothing Phone 2 official launch date revealed: Check details",
    "One of 2023's most hyped phones will launch on July 11",
    "Embracer announces restructuring program, studio closures expected",
    "Advanced Micro Devices, Inc.",
    "AMD Launches Ryzen PRO 7000 Series Mobile & Desktop Platform",
    "AMD Brings AI to x86 with its Ryzen Pro 7000 Series Processors",
    "AMD Ryzen Pro 7040 Series heralds Zen 4 and RDNA 3 technology",
    "AMD launches Zen 4-powered Ryzen 7000 PRO Series for laptops and desktops",
    "AMD Intros Ryzen 7000 Pro Mobile and Desktop Chips, AI Comes to Pro Series",
    "AMD Ryzen PRO 7000 Series CPUs: The future of AI-powered business for laptops and (maybe) desktops",
    "AMD Introduces Ryzen 7000 PRO Family Of Zen 4 CPUs For Enterprise Laptops And Desktops",
    "AMD launches Ryzen PRO 7000 series processors for laptops and desktops",
    "AMD Ryzen 7000 Goes Pro For Desktops & Laptops: Phoenix & Raphael With Zen 4 CPU Cores",
    "AMD Announces Ryzen Pro CPUs for Laptops and Desktops",
    "AMD launches Ryzen PRO 7000 65W desktop series, Ryzen 9 PRO 7945 features 12 Zen4 cores",
    "AMD Ryzen Pro 7000 processors now available for desktop workstations",
    "Synthesia Raises $90M in Series C Funding",
    "AI startup Synthesia gains unicorn status after Nvidia-backed fundraise",
    "UK's Synthesia raises $90 million valuing the AI video creation platform at $1 billion",
    "AI Video Creation Pioneer Synthesia Raises $90 Million Series C Led by Accel",
    "AI firm Synthesia hits $1B valuation with Nvidia support",
    "Personalized wealth management, built for tech people",
    "Four-week-old AI start-up raises record €105mn in European push",
    "Accenture announces jaw-dropping $3 billion investment in AI",
    "Accenture Commits $3B To AI",
    "Accenture to Invest $3 Billion in AI to Accelerate Clients' Reinvention",
    "Accenture to invest $3 billion in AI, double talent workforce to 80,000",
    "Accenture's AI practice to have 80,000 employees",
    "Accenture Will Invest $3 Billion to Expand Its A.I. Offerings",
    "Accenture announced a $3 billion investment in AI",
    "SoftBank's Vision Fund to cut up to 30% of staff",
    "SoftBank Group prepares new round of layoffs at Vision Fund: Report",
    "Free compensation benchmarking data from 3,000 startups",
    "Embrace the future of note-taking with Noteboard",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/12 - Why Your Favorite Subreddit Might Go Dark.",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Meta Horizon Worlds v114 Release Notes",
    "Nothing can go wrong with resurrecting Barrens chat.",
    "A deep-tech fund for the Nordics and Baltics - Voima Ventures launches €90 million fund",
    "NYC food delivery gig workers score a big minimum wage victory",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "Food delivery workers in New York City now earn $18 per hour",
    "EU countries amend draft proposal on gig workers' rights, companies unhappy",
    "NYC mandates minimum wage for app-based delivery workers",
    "NYC Food Delivery Workers Secure Landmark Minimum Pay Rate",
    "NYC establishes first minimum wage for food delivery workers",
    "New York City Sets New Minimum Wage for Food Delivery Workers",
    "Uber, DoorDash, and Other Delivery Apps Will Now Have to Pay Workers a Minimum Wage in NYC",
    "These food delivery drivers will get the nation's first minimum wage for app-based workers",
    "Insight Partners Slows Dealmaking Amid Tech Funding ‘Bloodbath’",
    "TCV Misses $5.5 Billion Fundraising Goal, Filings Show",
    "A blueprint for private and public sector partnership to stop fake reviews",
    "There's something interesting happening with Amazon's product reviews — and yes, it's about AI",
    "Amazon cracks down on fake reviews with AI",
    "CloudZero nabs $32m investment in new era for cloud cost management",
    "CloudZero raises $32M to nearly double size of team",
    "CloudZero Raises $32 Million To Transform Cloud Cost Management",
    "Cloud cost intelligence platform CloudZero raises $32M",
    "CloudZero Raises $32M in Series B Funding",
    "Oracle's Ellison: Cloud Revenue Grew Because We're ‘Faster Than Competitors’ Clouds'",
    "Oracle Announces Fiscal 2023 Fourth Quarter and Fiscal Full Year Financial Results",
    "ORCL Stock Jumps 6% as Oracle Beats Estimates for Revenue and Profit in Q4 2023",
    "Oracle cloud revenue up 54 percent in fourth quarter",
    "Oracle Reports Record Revenue of $50 Billion in FY23, Driven by Cloud Growth",
    "Oracle beats quarterly revenue estimates on cloud services demand",
    "Oracle 4Q Revenue, Net Income Beat Estimates — Earnings Review",
    "Oracle Pushes to Record High as AI-Frenzy Spurs Cloud Demand",
    "Oracle beats on top and bottom lines as cloud revenue jumps",
    "Oracle Earnings Day Is Here. The Focus is on Cloud and AI.",
    "Seems nobody gets fired for buying Oracle. Sadly. https://twitter.com/...",
    "New 15-inch MacBook Air, Mac Studio, and Mac Pro are available today",
    "First Benchmark Result Surfaces for Mac Pro With M2 Ultra Chip",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "M2 Ultra Mac Studio review: Top of the line",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "Apple's New 15-Inch M2 MacBook Air, Macs Studio & Pro Available Today",
    "New 15-inch MacBook Air, Mac Studio, Mac Pro Available Today",
    "Apple Mac Studio vs. Mac Pro: M2 Ultra desktops, compared",
    "Your M2 Ultra Mac Studio and 15-inch MacBook Air is waiting at your local Apple Store",
    "Apple's 15-inch MacBook Air and M2 Max/Ultra Mac Studio are now available in Canada",
    "New Mac Studio and M2 Ultra Mac Pro now available to pick up in store as deliveries begin today",
    "Apple's 15-inch MacBook Air, M2 Mac Studio and Mac Pro Now Available in Canada",
    "Apple Mac Studio (M2 Max) review: Re-filling the need for speed",
    "M2 Mac Studio Review: This is the New Pro Mac",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "First 15-Inch MacBook Air, M2 Ultra Mac Studio and Mac Pro Orders Begin Arriving to Customers",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Mac Studio review roundup: The Pro's choice",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "Ex-Samsung Elec executive accused of stealing secrets for China chip factory",
    "U.S. Government to Allow Chipmakers to Expand Facilities in China",
    "Former Samsung exec accused of stealing data to build copycat chip plant in China",
    "Ex-Samsung executive alleged to have stolen tech to recreate chip plant in China",
    "Samsung Ex-Executive Arrested for Alleged Chip Tech Theft #1674",
    "Asia Markets Mostly Rise as U.S. Inflation Forecasts Fall, Nikkei to Reach New 2023-Highs",
    "Ex-Samsung exec charged with stealing trade secrets to create copycat chip factory in China",
    "Ex-Samsung exec arrested for trying to steal a ‘complete copy’ of a factory.",
    "Ex-Samsung executive faces trial for stealing chip secrets",
    "Former Samsung executive indicted for stealing chip tech",
    "Ex-Samsung Executive Accused of Stealing Secrets for China Chip Factory",
    "Bethesda Softworks on YouTube",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Phil Spencer Says Xbox Series X Doesn't Need An Upgrade, Is That True?",
    "Xbox Series X isn't getting an upgrade anytime soon — but it doesn't need one",
    "Xbox boss insists there's no demand for a more powerful console yet",
    "Xbox head Phil Spencer doesn't see the need for an upgraded Xbox Series X yet",
    "Phil Spencer Claims Starfield Will Be Profitable Thanks To Game Pass",
    "Xbox Isn't Working On A More Powerful Console Yet",
    "Giant Bomb at Nite: Night 3",
    "Microsoft Will Absolutely Make Money On Starfield, Phil Spencer Says",
    "Why Microsoft wants to upend the video game industry",
    "Starfield PC System Requirements Revealed, Stuck at 30 FPS on Xbox",
    "A PS5 PRO WITHOUT COMPETITION?  MICROSOFT DOESN'T SEE THE NEED FOR A NEW XBOX",
    "Xbox's Bright Future, and How We'll Get There",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "Why Microsoft Is Excited About the Future of Gaming on the Xbox",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Starfield has “fewest bugs that any game from Bethesda has ever shipped with”, Microsoft says",
    "Microsoft exec says Starfield has ‘the fewest bugs any Bethesda game ever shipped with’",
    "Xbox says PC audience 'isn't a window, it's a market that deserves our games day 1'",
    "Don't expect a more powerful Xbox Series X anytime soon",
    "Microsoft unveils black 1TB Xbox Series S, doesn't see the need for mid-cycle console refresh",
    "Don't Expect an Xbox Series X Pro Console",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Starfield Direct - Gameplay Deep Dive",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition",
    "Watch 45 minutes of new Starfield gameplay",
    "UK lawmakers drop crypto-is-gambling idea and welcome a16z's riches",
    "Andreessen Horowitz (\"a16z\") Announces its First International Expansion to the United Kingdom",
    "Expanding to the UK  —  Over the last year it has become clear that blockchains …",
    "London crypto move is a sign of desperate times",
    "Gensyn Raises £33.8M in Series A Funding",
    "a16z Expands To London Citing Favorable Crypto Regulatory Environment",
    "Andreessen Horowitz is opening its first international office in London",
    "a16z Chooses the U.K. for First International Expansion",
    "London lures a16z's first international office with ‘predictable’ crypto regs",
    "Gensyn AI Secures $43M for Decentralized Machine Learning Led by a16z",
    "Absolutely mad https://twitter.com/...",
    "it's called u16k now actually https://twitter.com/...",
    "This is a win for the UK. Congrats to @a16z and the UK Crypto community. https://twitter.com/...",
    "Are US politicians paying attention? https://twitter.com/...",
    "UK is having its “How can I help” Miami moment for crypto.... https://twitter.com/...",
    "BRITISH DYNAMISM https://twitter.com/... [image]"
]