[
    "WSJ News Exclusive | FTX Begins Talks on Reboot as Managers Uncover Past Misconduct",
    "FTX Accuses Former Top Officer Of Helping Sam Bankman-Fried Steal Customer Funds",
    "FTX Reportedly Seeking to Relaunch",
    "FTX engages in talks to bring back international crypto exchange",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "“Fallen” FTX Gears Up for a Relaunch - Here's When and How",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange",
    "FTX Halts Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX Stops Sale of $500 Million Stake in AI Firm Anthropic: Report",
    "FTX's $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "FTX Suspends Sale of $500M Stake in Anthropic",
    "FTX Freezes Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m",
    "FTX hits brakes on sale of $500 million stake in AI firm: Bloomberg",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "Kroll Restructuring Administration",
    "FTX Sues Former Compliance Chief Who Allegedly Silenced Whistleblowers",
    "FTX Sues Ex-Compliance Chief Over ‘Hush Money’ Payments",
    "FTX takes legal action over alleged use of ‘hush money’ to conceal wrongdoing",
    "FTX troubles double with $500 AI sale suspension and hush money accusations",
    "FTX management details new allegations on misuse of customer funds",
    "Senior Attorney Helped FTX Founder Misuse Customer Funds, Report Says",
    "FTX sues Dan Friedberg alleging he used ‘hush money’ to silence whistleblowers",
    "International Business Times",
    "Sam Bankman-Fried fails to dismiss criminal charges related to FTX",
    "Judge Rejects Sam Bankman-Fried's Bid to Dismiss Criminal Charges Over FTX, Confirms Trial",
    "Sam Bankman-Fried Hits A Blank Wall As Judge Denies Motions To Dismiss Criminal Charges",
    "Judge denies Sam Bankman-Fried's motion to dismiss charges",
    "Judge's Decision on Sam Bankman-Fried's Motion to Dismiss Charges in FTX Case",
    "Judge rejects SBF's motions to dismiss criminal charges, citing lack of merit",
    "Judge Rules Against Sam Bankman-Fried's Motion to Dismiss Most Charges",
    "Judge Rejects SBF Motion as New FTX Fraud Details Emerge",
    "Judge says arguments behind SBF's motions to dismiss criminal charges are ‘moot or without merit’",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "Judge Rejects FTX Founder Sam Bankman-Fried's Motions to Dismiss Criminal Charges",
    "the new season of black mirror just dropped a new episode https://www.nytimes.com/...",
    "Siemens Energy confirms data breach after MOVEit data-theft attack",
    "Extortion Group Clop's MOVEit Attacks Hit Over 130 Victims",
    "Alert Regarding Data Incident",
    "Two major energy corporations added to growing MOVEit victim list",
    "Extortion Group Clop's MOVEit Attacks Hit 108 Victims",
    "UCLA, Siemens Among Latest Victims of Relentless MOVEit Attacks",
    "UCLA, Siemens Energy latest MOVEit victims to confirm breaches",
    "Casualties keep growing in this month's mass exploitation of MOVEit 0-day",
    "ECB welcomes European Commission legislative proposals on digital euro and cash",
    "Privacy fears dominate launch of digital euro plan",
    "The case for a digital euro",
    "EU could move step closer to digital euro this October, Lagarde says",
    "EU Wants Digital Euro to Complement Cash, Not Replace It",
    "European Commission aims for universal acceptance with digital euro proposal",
    "EC stresses privacy in digital euro plan",
    "European Commission Publishes Proposals to Preserve Cash and Create Digital Euro Framework",
    "EU's plan to dominate global markets with digital euro",
    "ECB expresses support for European Commission's digital euro proposal",
    "EU Moves Ahead With Push to Create Digital Euro for Payments",
    "EU to take one giant leap towards digital euro",
    "EU moves closer to launching digital euro",
    "Mairead McGuinness: EU must win people's trust for digital euro",
    "EU publishes draft bill for digital euro and cash payments",
    "EU Publishes Digital Euro Bill Featuring Privacy Controls, Offline Guarantee",
    "US mulls new export restriction on computing power in AI chips",
    "US weighs further restrictions on chip exports to China",
    "US Mulls Even Tighter Restrictions to Stop AI Chips From Reaching China",
    "U.S. Considers New Restrictions for AI Chip Exports to China",
    "US Plans New AI Computer Chip Export Controls Aimed at Nvidia",
    "Semiconductor industry sees stocks fall with possible new China export restrictions",
    "US weighs tougher restrictions on AI chip exports to China",
    "Semiconductor Stocks Hit By Worries Over U.S. Curbs On AI Chip Exports To China",
    "Nasdaq slides after big gain as Nvidia shares decline: Live updates",
    "The brewing AI chip war between the U.S. and China is getting in the way of Nvidia's stock rally",
    "US mulls tightening ban on AI chips to China",
    "Nvidia downplays possible U.S. chip export restrictions",
    "Biden Administration Weighs Further Curbs on Sales of A.I. Chips to China",
    "Stocks Making the Biggest Moves Midday: Pinterest, Carnival, General Mills, Netflix and More",
    "Nvidia and AMD shares fall on report of new U.S. ban on AI chip exports to China",
    "Nvidia and AMD shares fall as US considers tightening restrictions on AI chip exports to China",
    "U.S. considers curbs on AI chip exports to China",
    "U.S.-China AI Race Heats Up as Washington Mulls New Chip Restrictions",
    "China's AI firms might further lose chip access in new US ban",
    "European Markets Expected to Open Higher After Tentatively Breaking Losing Streak",
    "U.S. Mulls New Restrictions on AI Chip Exports to China",
    "These Stocks Are Moving the Most Today: Nvidia, AMD, AeroVironment, Micron, and More",
    "Biden may restrict AI chip exports to China, impact Nvidia",
    "US to impose new regulations limiting AI chip exports to China: report",
    "Amazon Will Invest Rs 2 Lakh Crore In India; 20 Lakh Jobs Will Be Generated Across India",
    "Subsidiaries of Stalled Chinese EV Startup Byton Face Liquidation",
    "Asia Markets Mixed as Australia Inflation Slows and China Industrial Profits Sink",
    "This is obviously why we need to build Skynet first. https://twitter.com/...",
    "Binance's Yi He sheds light on relationship with CZ, tells Bloomberg she's no Caroline Ellison",
    "OpenAI brings the competition to DeepMind's doorstep with new London office",
    "ChatGPT owner OpenAI to open first foreign office in UK",
    "Carl Pei's smartphone startup Nothing raises $96 million from investors for U.S. expansion",
    "Smartphone Startup Nothing Raises $100 Million To Build The Apple Of Android",
    "Here's the OnePlus folding phone expected for later this year",
    "Hedge Fund Davidson Kempner Reviews $250 Million Byju's Loan as Crisis Grows",
    "Nothing raises $96 mn to expand product and technology portfolio: Details",
    "Nothing Closes $96M Financing Round to Scale Product and Technology Portfolio",
    "Nothing is coming for Apple with fresh funding and the Phone 2",
    "Nothing closes $96 million round ahead of Nothing Phone 2 launch: Here's what we know",
    "Nothing Phone (2) is getting an awesome ringtone upgrade",
    "@joshsternberg.bsky.social",
    "@williamgunn@mastodon.social",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "Transparency and brand safety on Google Video Partners",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "Google could lose billions due to alleged violations of its own video ad standards",
    "Google's Ad Scam Eerily Similar To Facebook's Metric Inflation Scam",
    "Google does very little to reduce advertisers costs",
    "Google Is Placing Ads for Top Brands on Spammy, Chatbot-Generated Blogs",
    "YouTube ads accused of primarily serving on low-quality websites, Google denies",
    "Google's video ads are shortchanging advertisers and failing standards, report claims",
    "Google accused of misleading its advertisers on over 80% of ad placements",
    "Study Says Google Violated Own Ad Standards, Could Face Refunds",
    "Google lied about ad metrics: report",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google fires back after study claims “80%” of video ads violate its own terms of service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "This is amazing contextual advertising.  —  https://www.wsj.com/...  [image]",
    "omg this is such a good read if you have ever been an ad or media nerd https://adalytics.io/...",
    "holy fudge I did NOT KNOW YouTube does audience extension campaigns https://www.wsj.com/...",
    "This report if confirmed impacts the entire media industry. https://www.wsj.com/...",
    "WSJ News Exclusive |  Google Violated Its Standards in Ad Deals, Research Finds",
    "Google Violated Its Standards in Ad Deals, Research Finds",
    "Personalized wealth management, built for tech people",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "What Shein Influencer Backlash Can Teach Us About Taking On Opportunities",
    "How much money Instagram influencers make",
    "Shein's charm offensive is off to a rocky start",
    "Shein sent American influencers to China. Social media users are furious",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "How Shein's influencer trip to a Chinese factory backfired",
    "Shein exploited marginalized women for their influencer trip. It worked.",
    "What Are Social Media Influencers (and Why Does Everyone Want to Become One)",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "what the hell is a confidence activist [image]",
    "@danilo.redeem-tomorrow.com",
    "Introducing DoorDash's Biggest App Updates in a Decade",
    "DoorDash Workers Can Finally Get Paid Hourly, But Only During Deliveries",
    "DoorDash introduces ‘Earn by Time’ option in select cities",
    "DoorDash, Shifting Business Model, Will Offer Drivers Hourly Pay",
    "Doordash just announced its ‘biggest app update ever.’ Here's what's new",
    "DoorDash introduces a slew of new features, including an ‘Earn by Time’ option for delivery people",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "Free compensation benchmarking data from 3,000 startups",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Lightmatter: Next-gen computing built for AI.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/28 - Who Needs A Mac Pro?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Astrix Security Raises $25M in Series A Funding",
    "Astrix Security garners $25m Series A to enhance non-human identity security",
    "Astrix Security Raises $25M to Protect Nonhuman Identities",
    "Astrix Raises $25 Million to Help Enterprises Secure App-to-App Connections",
    "Astrix Security raises $25 million to further secure non-human identities",
    "We Raised A Bunch Of Money",
    "Fly.io raises $70M to help developers launch apps closer to users",
    "Y Combinator sees huge jump in AI-focused start-ups",
    "One-third of new Y Combinator startups focused on AI, CEO says",
    "Major League Baseball scouts use two iPhones and AI to identify player potential",
    "AI could help pick Major League Baseball's next big star",
    "Roblox Trying To Describe Adult Poop Is Very Funny",
    "What Roblox wants to build next with CEO David Baszucki | Decoder",
    "Databricks scoops up more of the new AI data stack",
    "Singaporean ex-Googler's startup raises $58m for enterprise AI endeavor",
    "Announcing our $58M funding to Build Generative Models and Advance AI Research",
    "Generative AI startup Reka emerges from stealth with $58 million in its pocket",
    "AI model startup Reka raises $50 million led by DST Global Partners",
    "@ravirockks@infosec.exchange",
    "Singapore AI-Powered AR Wearable Startup Scores $3 Million From Oculus And Siri Cofounders",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Google Kills Augmented Reality Glasses Project",
    "Augmedics closes $82.5M Series D, marks 4,000 U.S. patients treated with Xvision",
    "Augmedics raises $82.5 million to accelerate adoption of augmented reality spine surgery",
    "Augmedics Raises $82.5 Million to Boost Adoption of Augmented Reality Spine Surgery",
    "Augmedics gets $82.5 million in funding round for AR spinal surgery tool",
    "Augmedics Raises $82.5M for Augmented Reality Spine Surgery Platform",
    "Augmedics Raises $82.5M in Series D Funding",
    "Augmedics raises $82.5 million amid Series D decline",
    "EU law would let iCloud users transfer their data to rival platforms",
    "Moving data from iCloud may need to be made easier under upcoming EU law",
    "PSD3: The European Union unveils new open banking rules",
    "Data act: Council and Parliament strike a deal on fair access to and use of data",
    "EU data act adopts smart contract kill switch regulations",
    "EU advances rules that wrestle control of user data away from Big Tech",
    "New EU Law, If Passed, Would Let iCloud Users Transfer Their Data Across Multiple Services",
    "EU lawmakers agree to make non-consensual sex a criminal offense",
    "EU strikes deal to give users more control over data",
    "EU finalizes controversial smart contract kill switch rules under Data Act",
    "Crypto: EU Moves Ahead With Disputed Smart Contract Kill-Switch",
    "EU a step closer to Data Act that will take on Big Tech",
    "EU reach data rule deal targeting Big Tech",
    "EU's Controversial Smart Contract Kill-Switch Rules Finalized by Negotiators",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "EU countries, lawmakers reach data rule deal targeting Big Tech",
    "ChatGPT can now access the internet on mobile. Here's how",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT for iOS app shipped with Bing integration",
    "ChatGPT iOS App Adds Microsoft Bing Integration",
    "The 6 Best Alternatives to ChatGPT",
    "ChatGPT Gains Bing Support On iOS But You'll Have To Pay For It",
    "ChatGPT iOS app now supports “Browse with Bing” feature",
    "ChatGPT on iOS adds support for Bing, but locks it behind a subscription",
    "ChatGPT iOS app gets Bing integration to access data beyond its cutoff date",
    "OpenAI's ChatGPT iOS app can now browse the web",
    "ChatGPT is adding Bing access on iPhone, but only if you pay up",
    "ChatGPT Plus Subscribers Can Now Surf the Web Via Bing",
    "ChatGPT for iOS can now use Bing for AI results - but only if you pay",
    "ChatGPT app on iOS now allows users to access information from the web: Here's how to use it",
    "ChatGPT's iPhone app now has Bing built-in",
    "ChatGPT for iOS now lets paid subscribers use Bing right from the app",
    "TikTok is opening its own online U.S. store",
    "TikTok Bankrolls Influencers' Lawsuit Against Montana Ban",
    "Lawmakers raise concern over TikTok data stored in China",
    "TikTok updates: Creative Challenge, Youth Council, Montana lawsuit...",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok Is Funding Montana Users' Lawsuit After Ban: Report",
    "After Montana Banned TikTok, Users Sued.  TikTok Is Footing Their Bill.",
    "After Montana banned TikTok, users sued.  TikTok is footing their bill",
    "Google Has Reportedly Killed its ‘Iris’ AR Glasses Project",
    "Google Abandons Augmented Reality Glasses Project Iris to Focus on AR Software",
    "Google Kills ‘Project Iris’ Augmented Reality Glasses Project",
    "Iris is the latest Google AR/VR project headed for the graveyard",
    "Apple Glasses won't face competition from Google Iris smart glasses",
    "Google kills off its Apple Vision Pro competitor",
    "Google canceled its Apple Vision Pro rival that might have been even better",
    "Google ditching its plan to make AR glasses really doesn't matter: here's why",
    "Google reportedly cans AR glasses hardware project",
    "Google has apparently killed its AR glasses - and that's good news for Apple",
    "Google's “Project Iris” goes to the graveyard",
    "Google reportedly gave up on its own augmented reality headset",
    "Google won't be rivalling Apple Vision Pro as it scraps plans for Iris AR glasses",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Google is no longer building its own augmented reality glasses",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google's next-gen AR glasses join the Google graveyard",
    "Google kills off the latest iteration of its AR glasses",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Looks like Google might have canceled its new AR glasses",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project",
    "Supreme Court of the United States",
    "Cyberstalkers shielded by SCOTUS ruling on speech and online threats",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "Supreme Court Raises Bar on Prosecuting Online Stalkers",
    "Supreme Court clarifies when online harassment can be prosecuted",
    "Supreme Court says a conviction for online threats violated 1st Amendment",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "The Supreme Court Made It Harder — Again — For Women to Get Justice",
    "Supreme Court Puts First Amendment Limits on Laws Banning Online Threats",
    "Supreme Court rules for online stalker convicted of making ‘true threats’",
    "Supreme Court makes it more difficult to convict someone of making a threat",
    "U.S. Supreme Court rejects Colorado's standard for criminal threats",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok connects brands to user-generated ads with new feature",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "TikTok Launches ‘Creative Challenge’ to Provide More Income Opportunities for Creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "Personal Data About Paid U.S. TikTok Creators Is Probably Stored in China",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram tests feature to block explicit images in direct message requests",
    "Instagram might make it harder for you to send an unsolicited dick pic",
    "Instagram and Messenger get more parental supervision tools",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Both TikTok and Meta introduce new parental controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Meta Announces New Teen Safety Tools, Including Updated Parental Oversight and Messaging Controls",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Facebook Messenger launches “parental control” mode",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Meta guardrails: More safeguards, monitoring tools for teens launch across social platforms",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Facebook adds parental control tools to Messenger",
    "Meta launches parental controls for Messenger. Here's how to use them."
]