[
    "U.S. Securities and Exchange Commission",
    "SEC sues Coinbase over exchange and staking programs, stock drops 13%",
    "US SEC charges crypto platform Coinbase, one day after suing Binance",
    "Gary Gensler says 'we don't need more digital currency' after Coinbase, Binance lawsuits",
    "Coinbase Violated State Securities Laws With Staking Program, Alabama Regulator Alleges",
    "Coinbase sued by SEC in New York Federal court",
    "Coinbase drops 15% in pre-trading after SEC announces lawsuit",
    "Coinbase is being sued by the SEC",
    "SEC Sues Coinbase on Unregistered Securities Exchange Allegations",
    "SEC sues Coinbase alleging that it's operating an unregistered exchange",
    "SEC Sues Coinbase, Alleges It Is Unregistered Broker-Dealer",
    "Coinbase sued by SEC one day after regulator sues Binance",
    "SEC Charges Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "Coinbase: SEC lawsuit is 'hurting America's economic competitiveness'",
    "After Binance, US SEC sues Coinbase for securities laws violations",
    "Coinbase sued in the US for breaking securities laws",
    "SEC charges Coinbase with running an illegal exchange in fresh blow for crypto",
    "SEC Sues Coinbase for Violating Securities Law, Exposing Customers to ‘Significant Risk’",
    "SEC names more tokens as securities, including chiliz, flow, near and nexo",
    "S.E.C. Accuses Coinbase of Breaking Market Rules",
    "SEC cracking down on crypto: Coinbase, Binance face charges",
    "Coinbase and other firms reach out to US authorities",
    "SEC Sues Coinbase, Largest U.S. Crypto Trading Platform",
    "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market",
    "Elon Musk Shills Dogecoin as SEC Designates Top Cryptos as Securities",
    "Coinbase Stock Price: Can Crypto Exchange Survive COIN Shares Slump, SEC Charges?",
    "Crypto Crackdown: SEC Charges Coinbase After Going After Binance",
    "Coinbase May Face Cease & Desist Orders From 10 States Following SEC's Lawsuit",
    "SEC Goes After Coinbase, Biggest US Crypto Exchange",
    "SEC Chair Gary Gensler Says We Don't Need More Digital Currency",
    "Coinbase sued by SEC, slapped with show cause order by ten US states",
    "BREAKING: Coinbase Faces SEC Lawsuit for Allegedly Violating Securities Laws, Stock Tumbles",
    "SEC Sues Coinbase Over Alleged Securities Violations",
    "Ripple's XRP Not Named a Security in the SEC's Case Against Coinbase",
    "Coinbase drops 15% in pre-market trading after SEC lawsuit",
    "Coinbase (COIN) Shares Tumble 9% amid SEC's Binance Securities Violation Allegations",
    "SEC sues Coinbase for operating without registration since 2019",
    "Coinbase Sued by SEC for Breaking US Securities Rules",
    "SEC sues US leading crypto platform Coinbase for violating securities rules; details here",
    "Breaking: Coinbase Sued by SEC Just a Day After Binance Lawsuit - Which Firm is Next?",
    "mission driven company, where the mission is failure",
    "How are the “we take a long view of crypto” people doing today",
    "If you have to pick a fight with everyone, maybe you are the one at fault. 🤷‍♂️",
    "SEC v Coinbase https://storage.courtlistener.com/ ...",
    "SEC Chair Gensler on SquakBox: “we already have digital currency. It's called the US dollar.”",
    "Here's the head of the SEC promoting an unregistered security. https://twitter.com/...",
    "Yes. https://twitter.com/...",
    "Gary upping the ante this week. https://twitter.com/...",
    "This + Binance action yesterday. A Ripple case decision must be imminent? https://twitter.com/...",
    "woke up and already feeling protected. thank you Gary Gensler https://twitter.com/... [image]",
    "SEC complaint is 101 pages long: https://storage.courtlistener.com/ ...",
    "the us government doesn't believe you're an adult capable of making your own financial decisions",
    "BREAKING WE'RE ALL CRIMINALS",
    "Mistakes were apparently made... https://twitter.com/...",
    "The SEC is settling all the family business this week. https://storage.courtlistener.com/ ...",
    "SEC is going crazy https://twitter.com/...",
    "SEC brings charges against cryptocurrency trading platform Coinbase",
    "SEC sues Coinbase over alleged violations of securities laws",
    "SEC accuses Coinbase cryptocurrency exchange of breaking US regulations",
    "Coinbase Staking Program Targeted by Alabama Securities Regulator",
    "Coinbase Stock Down 18% in Pre-Market Trading in Wake of SEC Lawsuit",
    "SEC claims Coinbase's staking service is an investment contract in lawsuit",
    "SEC Sues Coinbase—Alleges Crypto Trading Platform Operated As Unregistered Exchange Since 2019",
    "SEC sues Coinbase over exchange and staking programs",
    "SEC Sues Coinbase, Alleging It Acted As An Unregistered Broker",
    "SEC lawsuit triggers selloff in Coinbase stock, COIN down 15%",
    "SEC Sues Coinbase After Binance",
    "Coinbase COIN Stock Drops 10% Following SEC's Lawsuit Against Binance",
    "Bitcoin rises slightly after SEC sues Coinbase alleging it acted as an unregistered broker",
    "The SEC Claims These Coins are Securities in the Lawsuit Against Coinbase",
    "Introducing Apple Vision Pro",
    "Apple's $3,499 Vision Pro Headset Will Test Marketing Might",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "Apple's entry into VR is a ‘watershed moment,’ say top industry execs",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Tim Cook says $3,500 Apple Vision Pro is ‘a great value’",
    "Apple's AR Vision Pro headset isn't the HoloLens competitor I thought it was going to be",
    "Apple's Vision Pro an impressive headset with few likely buyers, analysts say",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple Vision Pro vs. Meta Quest 3: The next generation of VR",
    "‘Zombie Wearing Headset’: Anand Mahindra's tweet after Cook's Apple Vision Pro video goes viral",
    "Tim Cook talks Vision Pro price, isolation, ChatGPT, and more in ABC News interview [Video]",
    "Apple CEO Tim Cook says Vision Pro is 'tomorrow's engineering, today': Exclusive",
    "Apple's Vision Pro Is Pricey, but It Has a Chance",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple's Vision Pro Joins Crowded Field Trying to Make Headsets the Next Big Thing",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "Thank you, Apple! Ignore the haters. Innovation is brave, inspiring, necessary, and cool.",
    "Apple's Vision Pro rips off the HoloLens, seven years later",
    "Check out the winners in the 2023 Apple Design Awards",
    "Apple Thinking About the Next Decade & Beyond with Vision Pro Announcement",
    "Apple Unveils Vision Pro: A $3,499 Headset That Blends AR and VR like Microsoft's HoloLens",
    "You can make the Apple Vision Pro even more expensive with a luxury leather headband",
    "Apple's new Vision Pro headset will support Microsoft Word, Excel, and Teams",
    "EyeSight Is One Of Apple Vision Pro's Wildest Features",
    "Apple Vision Pro: your 7 biggest questions about the headset answered",
    "Is Vision Pro the Future of Computing, or a Dystopian Mind Prison?",
    "Apple's Mixed-Reality Headset, Vision Pro, Is Here",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "Apple Welcomes the World to Its Augmented Future",
    "Nobody Is Taking Apple's $3,500 VR Headset Seriously",
    "Apple Vision Pro first take: 3 reasons this changes everything",
    "Disney To Create Content For Apple Vision Pro, Disney+ Available From Day One",
    "WWDC: Apple unveils Vision Pro headset, cites early 2024 release date, offers AR preview of device",
    "Twitter reacts with laughs to Apples Vision Pro headset shown at WWDC23",
    "From the seminal 2003 paper on spatial computing [image]",
    "It's far better than I expected, and I had high expectations.",
    "Welcome to the future #RealityPro [image]",
    "apple: your ipad is too close also apple: HAHAHAH [image]",
    "She had to sell everything [image]",
    "should i buy a used car or an apple vision pro",
    "The apple vision pro saved our relationship [image]",
    "POV: the year is 2035 and HR is about to fire you https://twitter.com/... [image]",
    "lets all kill ourselves https://twitter.com/...",
    "interviewer “are you reading from a script?” me: “no why” [image]",
    "Apple Vision Plus - $3600. A book by Mozart and a cup of tea - $25. Not a hard choice.",
    "Apple going no controllers is so beyond stupid. There's no way this is a good idea",
    "Tim Cook dropping a $3.5k face computer right after starting a bank [video]",
    "The reaction to the price of the Apple Vision Pro though! 😂😭 [video]",
    "this says all you need to know about apple vs meta [image]",
    "In Canada, the sales tax on the Vision Pro is the price of a Quest 3",
    "deleting the email like [image]",
    "This is just a great way to parent, that won't affect your children negatively at all [image]",
    "Ok I used it. It's good. Real good. More soon. [image]",
    "Mom? Mom? Mom! Mom are you spatially computing again? [image]",
    "Apple just made folding phones seem like a bargain.",
    "For just $3500! https://twitter.com/...",
    "And not inside a case like in 2007! https://twitter.com/...",
    "Ah - here's why the stock dropped. Menswear guy isn't a fan https://twitter.com/...",
    "Battery fanny pack included. [image]",
    "Here it in in the flesh #AppleVisionPro [image]",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "Some video is the display showing a person you are in a full VR experience. [video]",
    "First in person look at Apple Vision Pro #WWDC23 [video]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "new reaction image just dropped [image]",
    "i just know i'm gonna hate buy this thing so hard [image]",
    "Here it is. Apple Vision Pro. [video]",
    "AHHHHHHHH HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH (Breathes) AHHHHHHH [image]",
    "Notice the bevel on the new Apple VisionPro AR goggles is borrowed from the Apple Watch. [image]",
    "paying $3499 to rewatch my wife and children leave me #WWDC23 [image]",
    "Meanwhile at Meta [Mark Zuckerberg's Eiffel Tower photo]",
    "@WinObs It connects to this setup: [image]",
    "Here's the battery pack [image]",
    "This will be the new Patagonia Vest for Silicon Valley VCS",
    "Oh there's someone using a keyboard. So that's interesting. Yeah I want one.",
    "the Vision Pro seems like a lonely device",
    "time to get a new mortgage 🥴 [image]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "Wow! Disney Plus on Apple Vision Pro looks truly magical. [video]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "Hopefully the product is better than the movie :shudder: https://twitter.com/...",
    "going to wear a vision pro into molotov's",
    "Marques Brownlee on YouTube",
    "Apple Vision Pro Impressions!",
    "I wore the Apple Vision Pro. It's the best headset demo ever.",
    "What's so ‘pro’ about Apple's Vision Pro headset?",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Apple Vision Pro hands-on: A new milestone for mixed reality, but issues remain",
    "A First Try of Apple's $3,500 Vision Pro Headset",
    "Apple Vision Pro Testers Share Impressions: ‘By Far the Best Headset’",
    "Apple Vision Pro looks insanely impressive - but my Vision Air 2 guess still feels right",
    "Hands On With Apple's Vision Pro: The Opposite of Disappearing",
    "What's Clear and Blurry About Apple's Vision Pro Headset",
    "Hands on with Apple's Vision Pro: bringing the metaverse to life",
    "Did Apple just make a move into the Metaverse?",
    "This is all the futuristic tech inside the Apple Vision Pro headset",
    "TechScape: Is Apple's $3,500 Vision Pro more than just another tech toy for the rich?",
    "Apple Vision Pro demo roundup: Here's what everyone is saying",
    "Apple Vision Pro first look",
    "Apple Vision Pro first impression: “Nothing less than a genuine leapfrog”",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "In defense of the Apple Vision Pro battery pack (with one major concession)",
    "Hot Take On The New Apple Vision Pro XR Headset",
    "Hands-on: Apple Vision Pro isn't for Gaming, But it Does Everything Else Better",
    "This is not the final form https://9to5mac.com/...",
    "You're a rock star #WWDC23 [video]",
    "This is gonna be a game changer for movie cops with dead wives [video]",
    "“.. the closest thing I've seen to magic.” @MKBHD $AAPL #VisionPro https://www.youtube.com/...",
    "Pretty funny, in hindsight, that we roasted these for being too bulky and tech-forward [image]",
    "I gotta admit, this part made me a bit sad. [image]",
    "Digital Photography Review",
    "If Apple Vision Pro is the answer, what's the question?",
    "Apple Vision Pro: What it means for content and photography",
    "I think it's extraordinarily telling that no Apple exec posed for photos wearing the thing.",
    "A great point https://twitter.com/...",
    "The Unveiling of Apple's Vision Pro: A Revolutionary Leap Forward in Augmented Reality",
    "I wanted the “Wow” factor for the Apple Vision Pro reveal, but all I got was a “Why?”",
    "Word, Excel and Teams are coming to the Apple Vision Pro AR headset",
    "The Future Of Spatial Computing: Apple Unveils The Vision Pro AR Headset",
    "12 photos that show off all the cool features of Apple's new Vision Pro headset",
    "Unity Software stock price surges on news of Apple's Vision Pro headset. Here's what's happening",
    "Apple Vision Pro + cooperation with Disney is 🔥🔥🔥 #WWDC23",
    "The Disney vision for Apple AR/VR is far more compelling than Apple's demo was [video]",
    "Yeah, Apple just killed Meta and Oculus with this Disney partnership.",
    "Unity + Apple Disney + Apple Meta is done.",
    "Me, accepting GDPR popups next year: [image]",
    "Zuck at the Oculus team rn [Image: “Code. I wanna see some fucking code!\"]",
    "mfw watching #WWDC23 [image]",
    "me using the new apple headset [video]",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "VC Firm Sequoia Capital to Divide Into 3 Independent Companies",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia Splits Into Three Entities, Makes China Standalone Firm",
    "Sequoia Capital's Chinese Arm to Split From U.S. Firm",
    "Sequoia Capital to carve off China and India units as it faces ‘increasingly complex’ pressures",
    "Sequoia rebrands to Peak XV Partners in India and SEA",
    "Sequoia splits China and India arms from US mothership",
    "Sequoia Capital to split into three parts, separating its China and India businesses",
    "Sequoia splitting into three independent entities for India & SEA, China, US & Europe",
    "Venture-Capital Firm Sequoia to Separate China Business as Political Tensions Rise",
    "Sequoia to separate China, India and Southeast Asia by March 2024",
    "Sequoia Spins Off India Unit; Rebrands To Peak XV Partners",
    "Here is the global business update we shared with our LPs. [image]",
    "Massive moment for venture in India https://www.forbes.com/...",
    "really solid piece from @alexrkonrad https://www.forbes.com/...",
    "👀😳 https://twitter.com/...",
    "End of an era. https://twitter.com/...",
    "Binance Withdrawal On Track to be Largest Since March Crypto Banking Crisis",
    "Binance experience massive outflows in the wake of SEC lawsuit",
    "Crypto exchange Binance hit by outflows of almost $1 billion in last 24 hours",
    "Binance adds Bitcoin NFTs to its marketplace one day after SEC lawsuit",
    "U.S. SEC sues Coinbase, one day after Binance lawsuit",
    "Investors pull $790 million from crypto exchange Binance after SEC charges",
    "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen",
    "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "Is BNB Price Aiming to Trade Below $250? What's Next for BNB Following Binance's Lawsuit?",
    "In light of SEC suing Coinbase and Binance, some memorable crypto press releases",
    "The SEC, Gaming Tokens, and Web3: What Now?",
    "Gensler “very confident” SEC can win against Coinbase, Binance",
    "Binance lawsuit adds another 10 cryptos to SEC securities list",
    "SEC vs. Binance: $115 billion battle over crypto regulation",
    "Shiba Inu Investors Go All-In: 338 Billion Token Accumulation Signals Bullish Cue",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "The SEC's case against Binance, a live reading by Liz Lopatto",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "SEC Sues Binance and CEO Zhao for Breaking Securities Rules",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "CFTC Chair Behnam Will Testify at a House Hearing on Bitcoin Futures",
    "SEC's ‘Scathing’ Charges Against Binance Deal a Big Blow to US Crypto",
    "Altcoins Dip Following Second SEC Lawsuit Against Crypto Exchange",
    "Crypto stocks fall after US SEC sues Coinbase over failure to register",
    "SEC Sues Coinbase Over Staking Services, Failing to Register",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "House Debate Over New Crypto Bill Comes As Binance Suit Shows Regulatory Cracks In U.S.",
    "SEC Wants Blood: Coinbase Sued 1 Day After Binance",
    "NFT Mogul Transfers NFTs Worth Millions To Show Support For Binance",
    "SEC Sues Binance Over Violations of US Securities Rules, Exchange Hits Back",
    "Coinbase stock tumbles after SEC complaint against Binance",
    "Pepecoin Frenzy Fades: How Meme Token's Price, Market Cap Were Cut In Half",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "both coley and brooks testified to SEC [image]",
    "SEC filing calls BNB a security [image]",
    "Strong together. https://twitter.com/...",
    "Xbox FTC Settlement and Reimagining the Future of Safety on Xbox",
    "Microsoft to pay $20 million to settle Xbox Live privacy allegations",
    "Microsoft Fined $20 Million by FTC Over Storage of Xbox Data",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "Microsoft to pay $20 million FTC fine over storage of Xbox information",
    "Microsoft to Pay $20M to Settle FTC Charges It Violated Children's Privacy",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Kids' Xbox Data",
    "Microsoft Charged $20 Million by FTC Over ‘Illegally Collected’ Children's Information on Xbox",
    "FTC Fines Microsoft $20 Million for Illegally Collecting Children's Data",
    "The FTC wants Microsoft to pay $20 million for mishandling children's personal information",
    "Microsoft to pay $20 million for violating children's privacy laws",
    "Microsoft To Settle FTC Kids' Privacy Case With $20M",
    "Microsoft to pay $20 million FTC settlement over improperly storing Xbox account data for kids",
    "Microsoft settles with FTC for $20 million over Xbox child data violations",
    "Microsoft will pay the FTC $20 million to settle charges over collecting children's data",
    "The FTC has fined Microsoft $20 million for illegally collecting children's personal info on Xbox",
    "US fines Microsoft $20m over child data violations",
    "Microsoft hit with $20 million fine after collecting children's data on Xbox consoles",
    "Microsoft Must Pay US Government $20 Million Over Xbox Privacy Violations",
    "FTC Fines Microsoft For COPPA Violations Affecting Younger Xbox Users",
    "Apple Ghosts the Generative AI Revolution",
    "Apple users can now type what they ducking want",
    "Apple WWDC AI word count: 0",
    "“Transformer-based” in the keyboard. First LLM mention. Everyone take a drink. #WWDC",
    "Not sure why anyone thought there would be an AI focus today... https://twitter.com/...",
    "Apple announces powerful new privacy and security features",
    "Craig Federighi on new Apple privacy features; how Apple will protect us from AI",
    "Apple WWDC: New Macs, Vision Pro Headset, macOS Sonoma, and iOS / iPadOS 17",
    "iOS 17, iPadOS 17, macOS Sonoma, watchOS 10: List of all eligible devices under one roof",
    "Apple Podcasts for Creators",
    "iOS 17 makes iPhone more personal and intuitive",
    "‘Ducking hell’ to disappear from Apple autocorrect",
    "iOS 17: What's new for Apple Podcasts",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "Yes, interactive widgets are coming to iPhone, too, in iOS 17",
    "Apple Podcasts to get refreshed ‘Now Playing’ interface, new search filters and more with iOS 17",
    "Sharing your phone number will get much easier with iOS 17",
    "How to install the iOS 17 Developer Beta",
    "Smartphone Accessories: Momax 15W MagSafe 3-in-1 Charging Station $50 (58% off), more",
    "Very excited and proud for Podcasts in iOS 17 https://podcasters.apple.com/ ...",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "Apple Debuts iOS 17 With Live Voicemail, Sonoma Widgets And A Slew Of New Features",
    "iPadOS 17 brings new levels of personalization and versatility to iPad",
    "StandBy might just be the killer iOS 17 feature, but only if you have an iPhone 14 Pro",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple Music improvements in iOS 17: collaborative playlists, crossfade playback, and more",
    "Download the new iPadOS 17 wallpapers right here",
    "Here Are the iPhone and iPad Models That Will Get the iOS 17 and iPadOS 17",
    "iOS 17: Release date, download, beta, supported devices, and more",
    "The new iPad Lock Screen and widgets look terrific https://www.bloomberg.com/...",
    "iPad Lock Screen just looks so much nicer now. #WWDC23 [image]",
    "Apple adds AI to PDF She said “machine learning models” = AI #WWDC23 [video]",
    "Apple just killed PDFElement and other PDF editing apps",
    "How far off are we from Apple making PDF the dominant replacement format for .DOC files?",
    "Finally the Health App comes to the iPad.. Yayy!!! #WWDC23 [image]",
    "kind of a weird place for widgets on the iPad lock screen, but excited to try them",
    "iPad widgets just destroyed any proprietary home automation system done",
    "Apple Shortens ‘Hey Siri’ to Just ‘Siri’",
    "Siri is about to get less (or more) frustrating to use with iOS 17",
    "Download Official iOS 17 Wallpapers for Your iPhone",
    "Apple Has Ducking Great News for iPhone Pottymouths",
    "Apple iOS 17: Top 17 features coming to iPhones this fall",
    "iOS 17 Features Revealed, See If Your iPhone Will Get this upgrade",
    "Apple's iOS 17 expands protection against unsolicited nudes",
    "Apple's new iOS 17 will warn you if someone tries to send unsolicited nudes",
    "New Apple iOS17 feature would prevent unsolicited nudes",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iOS 17 won't be coming to iPhone X, iPhone 8 or iPhone 8 Plus",
    "TSMC can help ‘stabilize’ U.S.-China relations: Chairman",
    "TSMC's Cautious Outlook Underscores Near-Term Realities",
    "TSMC feeling ‘good’ about possible Germany plant, in talks on subsidies",
    "TSMC Says Capex to Be Near Low End of Target at $32 Billion",
    "“Going to the US is not all downside” https://www.ft.com/...",
    "Made it. $TSM AGM. I'm at the back, final row. 🙃 [image]",
    "Unlock a new pipeline channel: your existing customers",
    "Here's why so many Reddit communities are planning to go offline for 48 hours (or more)",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "Top Reddit communities going dark to protest third-party API charges",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/05 - WWDC And The Apple Headset",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early",
    "iOS 17 beta is here, but only for developers",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Beta 1 of MacOS Sonoma Available to Download",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "Sam Altman joins investors in $19 million round for crypto life insurance startup",
    "Digital asset-denominated life insurer Meanwhile snags $19 million funding round",
    "Mobileye Stock Falls. Intel Found a Way to Cash in on AI.",
    "Mint Explainer: What's Byju's beef with its lenders?",
    "High-Flying Indian Startup Byju's Skips Payment on Dollar Loan",
    "A Long, Strange Trip for the ‘Uber for Nurses’",
    "AI generated content should be labelled, EU Commissioner Jourova says",
    "Gigabyte rolls out update to fix dangerous backdoor in its motherboards",
    "You can now update your Gigabyte motherboard BIOS to fix that security backdoor",
    "Want quick access to Bing Chat on your phone? Add this handy widget",
    "watchOS 10: All you need to know about the next major Apple Watch update",
    "This mental health focus in Apple's WWDC keynote is very cool. 💙",
    "Apple Watch will now track your mental health. #WWDC23 #watchOS10 [image]",
    "AirPods redefine the personal audio experience",
    "WWDC: Apple promises great AirPods updates",
    "Apple Adaptive Audio for AirPods — what it is and how it works",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "@MKBHD “Adaptive Audio” rebrand: “Selective Listening”",
    "tvOS 17 brings FaceTime and video conferencing to the biggest screen in the home",
    "Apple Announces tvOS 17 Features Including Facetime; Update to Be Released This Fall",
    "tvOS 17 brings FaceTime to Apple TV 4K, new Control Center, Siri Remote improvements, more",
    "Finally some love for tvOS. Video conferencing with an iPhone as camera seems clunky though.",
    "ok is this tvOS update the secret star of the show lmao",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "Apple debuts macOS 14 Sonoma",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Safari 17 in macOS Sonoma beefs up user privacy",
    "Presenter Overlay is going to kill many indie apps #WWDC23 [image]",
    "Literally no one plays AAA games on Mac and this changes nothing. And will change nothing.",
    "Apple Silicon remains the star of WWDC",
    "My ten takeaways from WWDC 2023",
    "M2 Ultra cheap? The most expensive Mac Pro is surprisingly affordable",
    "Apple Silicon Mac Pro does not support PCI-E Radeon video cards",
    "The new Apple silicon Mac Pro is both cheaper and more expensive",
    "Mac Studio and Mac Pro upgraded with the M2 Ultra chip",
    "Apple launches new Mac Studio with M2 Max and M2 Ultra chips",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "New M2 Mac Studio and Mac Pro cost up to twice as much in these countries",
    "Check out the new Mac Pro with M2 Ultra",
    "Apple's M2 Ultra Mac Pro Completes the Mac Transition to Apple Silicon",
    "Everything announced at WWDC that you can pre-order now",
    "why is the mac pro 3k more than the mac studio with the same chip lol",
    "This is not powerful enough for pros",
    "@ianzelbo No MPX slots. Means no GPUs...",
    "Sorry, but the new Mac Pro is a meme [image]",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "Mass exploitation of critical MOVEit flaw is ransacking orgs big and small",
    "Clop Hits British Airways, BBC and Boots as Organizations Brace for More Attacks",
    "British Airways, BBC and Boots were impacted the by Zellis data breach",
    "MOVEit victims emerge: British Airways, BBC and Nova Scotia",
    "Extent of N.S. software breach still unknown, Microsoft blames ransomware gang",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "BBC and British Airways affected by data breach at payroll company Zellis",
    "Boots, BA and BBC have data stolen in cyber attack",
    "Major Data Breach Exposes BA, BBC and Boots to File Transfer Hack: What You Need to Know",
    "British Airways, BBC and Boots staff hit in major payroll cyber attack ‘linked to Russia’",
    "British Airways staff's details stolen in cyber breach hitting firms around the world"
]