[
    "The Securities and Exchange Commission, Nigeria",
    "Circular on the Activities of Binance Nigeria Limited",
    "Nigeria regulator says local Binance operations ‘illegal’",
    "Nigeria's SEC Says Binance Operations in Country Are ‘Illegal’",
    "Nigerian Regulator Moves Against Binance Amid U.S. Crypto Crackdown",
    "BREAKING: Binance Declared illegal By Nigerian SEC, Accused Of Wrongful Operation",
    "Nigeria's SEC declares Binance Nigeria's operations illegal",
    "Nigeria SEC declares Binance operations in country illegal",
    "Nigeria regulator halts Binance operations: Report",
    "Breaking: Binance Declared “Illegal” By Nigeria SEC, Ordered To Cease Operations",
    "Nigeria's SEC orders Binance Nigeria Limited to stop operations",
    "Nigeria regulator says Binance not registered and must stop soliciting investors: Reuters",
    "Binance getting pressure from other jurisdictions now. https://twitter.com/...",
    "The crypto pivot to Africa just took a hit https://twitter.com/... [image]",
    "Does anyone remember Pink Care Token? https://twitter.com/...",
    "This is terrible news for scammers. https://twitter.com/...",
    "Binance Declared Illegal By Nigeria SEC",
    "ChatGPT is fun, but it is not funny! Humor is still challenging Large Language Models",
    "ChatGPT can only tell 25 jokes, and can't come up with new ones, researchers find",
    "ChatGPT fun but not funny: Students in Germany put ChatGPT's humor to the test",
    "So it's just like your dad then. https://arstechnica.com/...",
    "Researchers discover that ChatGPT prefers repeating 25 jokes over and over",
    "Generative AI tool Stable Diffusion amplifies race, gender stereotypes",
    "Awake and in good spirits: Teen hit by Tesla while getting off bus making progress in recovery",
    "Tesla driver hits a dog, claims they were on Full Self-Driving Beta",
    "can't wait for this guy to put a chip in my brain https://twitter.com/...",
    "17 Fatalities, 736 Crashes: The Shocking Toll Of Tesla's Autopilot",
    "17 fatalities, 736 crashes: The shocking toll of Tesla's Autopilot",
    "New Crypto Banking System Coming Amidst Coinbase and Binance Crackdown",
    "Credit Suisse CEO teases UBS deal finalization",
    "Report: Crypto Companies Widening Their Search for Banking Partners",
    "As Traditional Banks Step Back, New Players Fill Gap in Crypto Banking",
    "The Future of Finance: Blockchain Technology Set To Reshape the Financial Landscape",
    "BinanceUS to suspend dollar deposits, Vitalik pledges $100m to Covid relief",
    "via @NYTimes- modern day Ponzi scheme anyone? https://www.nytimes.com/...",
    "This is the most amazing article I've ever read in my entire life https://twitter.com/... [image]",
    "Ooo, free money, what shalt we do? https://twitter.com/...",
    "I am SHOCKED to learn that crypto bros were narcissistic crooks. https://twitter.com/...",
    "Their Crypto Company Collapsed. They Went to Bali",
    "Their Crypto Company Collapsed.  They Went to Bali.",
    "China's Crucial Role in Shaping Global AI Safety: A Call from OpenAI's CEO",
    "OpenAI CEO Sam Altman Backs China To Lead AI Regulations",
    "OpenAI CEO Calls for Collaboration With China to Counter AI Risks",
    "Remember the Uyghurs? And how they are monitored? https://twitter.com/...",
    "Judge in FTX bankruptcy rejects media challenge, says customer names can remain secret",
    "Court Supports FTX's Request to Remove Customer Names from Bankruptcy Filings",
    "Judge Upholds Confidentiality of FTX Customers' Identities, Citing Security Concerns",
    "FTX Bankruptcy: Court Rules Customer Identities Can Remain Permanently Shielded",
    "FTX Judge Says Identity Of Customers Will Remain Undisclosed",
    "Free Figma template of onboarding & activation designs",
    "This Week in Coins: Market Crashes as SEC Slams Binance and Coinbase",
    "SEC Coin Is Exploding - Next 100x Shitcoin?",
    "Gensler can destroy the U.S. crypto industry, but he can't kill crypto",
    "SEC Chair Gensler says crypto frenzy is rife with ‘hucksters, fraudsters, scam artists’",
    "The New Crypto Bill Gary Gensler Doesn't Want You to Know About",
    "Ex-SEC attorney says to ‘get out of crypto now’ amid regulatory offensive",
    "AT&T switching to Google's Jibe platform for RCS",
    "AT&T moves its default Android messaging to RCS",
    "AT&T Switches to Google's Jibe for RCS",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "(IHP) Microsoft CTO Kevin Scott",
    "Jun 8-12VIRTUAL: Summer Game Fest",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "United States District Court for the Northern District of California",
    "Realtek Semiconductor v. Mediatek Inc., IPValue Management, and Future Link Systems",
    "Smart TV industry rocked by alleged patent conspiracy from chipmaker [Updated]",
    "Smart TV industry rocked by alleged patent conspiracy from chip maker",
    "‘E3 killed itself’, not competition from Summer Game Fest, says Geoff Keighley",
    "The biggest announcements from Summer Game Fest 2023",
    "Summer Games Fest 2023: Every Single New Title and Trailer Revealed",
    "Summer Game Fest 2023: Everything Announced",
    "Summer Game Fest 2023: Spider-Man 2 Release Date, Sonic Superstars And Other Highlights",
    "Summer Game Fest 2023: How to watch and what to expect",
    "All the Coolest Sci-Fi, Fantasy, and Horror Trailers From Summer Games Fest 2023",
    "Geoff Keighley says E3 was dying long before Summer Game Fest began",
    "E3 Killed E3, Says Summer Game Fest's Geoff Keighley",
    "How to watch Summer Game Fest 2023 and what to expect",
    "How the Summer Game Fest rewarded fans for their patience with long-awaited sequels | The DeanBeat",
    "Summer gaming events 2023: with E3 canceled, here's what's next",
    "Summer Game Fest 2023 LIVE: Every Xbox and PC game announcement, trailer, and reveal",
    "Best Crypto to Buy Now 9 June - Immutable X, Render, Stacks",
    "Is it still safe to invest in crypto in the U.S.?",
    "SEC Clampdown Spurs $4B Deposit Flight From Binance, Coinbase and Binance.US",
    "Statement of CFTC Division of Enforcement Director Ian McGinley on the Ooki DAO Litigation Victory",
    "CFTC Wins Lawsuit Against Ooki DAO",
    "CFTC Claims Big Victory in Ooki DAO Litigation",
    "Ooki DAO to shut down after ‘precedent setting’ court battle with CFTC",
    "CFTC Scores Victory in Landmark Ooki DAO Litigation Case",
    "CFTC awarded default judgment in case against Ooki DAO",
    "OokiDAO Loses Lawsuit Filed By CFTC, Ordered To Pay $643,000",
    "Ooki DAO to pay $643K fine after CFTC's court victory",
    "“When a DAO comes into contact with general partnership law, something bad happens.” …",
    "US CFTC Wins Precedent Setting Case Against Ooki DAO, Calling It a ‘Wake-Up Call’",
    "Starting to feel like I may not be able to trust Ooki DAO",
    "the DAO is legally a person https://twitter.com/...",
    "Not a good case outcome for DAOs... https://twitter.com/...",
    "CFTC Wins Lawsuit Against DeFi Ooki DAO for ‘operating an illegal trading platform’",
    "Bing Preview Release Notes: Voice Chat on Desktop",
    "Microsoft adds voice mode to Bing AI on the web",
    "Bing Chatbot Can Now Have A Voice Conversation With You On Desktop Systems",
    "Microsoft Brings Voice Chat to Bing Chat on Desktop",
    "Microsoft adds AI voice chat to Bing on desktop",
    "You can now talk to Bing Chat in Windows 11 with your voice",
    "Bing AI Voice Chat Comes to Desktop",
    "As Cortana Retires, Microsoft Brings AI-Powered Bing Voice Mode to Desktop",
    "Bing Chat's desktop version now supports Voice Chat",
    "Bing Chat now adds voice chat for desktop users in this week's dev update",
    "Microsoft now lets you speak to its AI-powered Bing Chat",
    "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "Reddit won't budge on the API changes that are shutting down apps like Apollo",
    "Reddit's CEO's AMA turns into disaster",
    "Reddit CEO: We're Sticking With API Changes, Despite Subreddits Going Dark",
    "Reddit is showing no signs of relenting in its fight against third-party client Apollo",
    "Reddit CEO Cites Profit Push in Response to Backlash",
    "Apollo will shut down as tempers flare over Reddit API changes",
    "Reddit Shows No Signs Of Backing Down From Controversial API Changes In Heated AMA",
    "Reddit's Hoped-For IPO and Pipe Dream of Cashing in on OpenAI's Hype",
    "Reddit CEO does AMA, doesn't address or even mention upcoming subreddit protests",
    "Reddit CEO Says Keeping Explicit Content on the Site Is a ‘Constant Fight’",
    "Why everyone is freaking out about the Reddit API right now",
    "Popular Apollo Reddit App is Shutting Down",
    "Reddit's big fee demand triggers June 30 shutdown of Apollo app",
    "3rd-Party Reddit App Apollo Forced to Shut Down Due to API Charges",
    "Apollo service to shut down on June 30 following Reddit's change of API policy",
    "iOS app Apollo shuts down on June 30, and it's all Reddit's fault",
    "Reddit's absurd API price forcing Apollo to shut down on June 30",
    "What an absolute dumpster fire for Reddit's CEO here: https://www.reddit.com/...",
    "Spez, the CEO of Reddit, doubles down on his accusations against @apolloreddit [image]",
    "the reddit ama with the CEO is going as well as you'd expect lol https://www.reddit.com/...",
    "the reddit AMA regarding the API changes is going about as well as you'd expect [image]",
    "The reddit AMA surround the API apocalypse has some gems in it [image]",
    "The way spez is treating @ChristianSelig is absolutely disgusting. Shame on Reddit [image]",
    "the ceo of reddit is an actual dumb little piggy boy [image]",
    "Addressing the community about changes to our API",
    "[DISCUSSION] Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "Reddit CEO Steve Huffman defends API changes in AMA",
    "Everything about this “AMA”",
    "Get your scripts ready guys, the AMA has started.",
    "u/spez addresses the community regarding the API changes",
    "Gas usage for stablecoins, NFTs on Ethereum continues decline",
    "Future of Decentralized Finance (DeFi): Polygon",
    "Kraken launches your gateway to the world of NFTs",
    "Kraken Launches NFT Marketplace Out of Beta With Over 250 NFT Collections",
    "US-Based Crypto Exchange Kraken Officially Rolls Out New NFT Marketplace",
    "Kraken's NFT Bid Sets Sail, New Marketplace Out of Beta",
    "Nifty News: Kraken NFT exits beta, Coinbase's ‘Stand with Crypto’ gains support and more",
    "Kraken Launches Full-Scale NFT Marketplace with Over 250 Offerings",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange And Illicitly Operating Another",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange and Illicitly Operating Another",
    "Security News This Week: 9 Years After the Mt. Gox Hack, Feds Indict Alleged Culprits",
    "Mt. Gox Hack Update: Russian Nationals Charged, Unveiling a Major Crypto Theft Conspiracy",
    "Russians charged with hacking Mt. Gox crypto exchange, running BTC-e",
    "DoJ Charges Two Russians for Trying to Launder 647K BTC Stolen From Mt.Gox",
    "DOJ Identifies and Charges Mt. Gox Hackers For Stealing 647,000 Bitcoin",
    "Russians charged with hacking Mt. Gox exchange and operating BTC-e",
    "US DOJ Charges Two Russian Nationals With Mt. Gox Hack",
    "U.S. DOJ Charges Two Russians For Hacking Mt Gox",
    "DoJ charges 2 Russians for hacking Mt. Gox crypto exchange",
    "US Justice Department charges two men in Mt. Gox hack",
    "Mt. Gox Suspects Charged: Russian Nationals Indicted by DOJ",
    "DOJ charges two Russians in Mt. Gox crypto hack",
    "Two Russians Charged for Infiltrating Mt Gox and Operating Illicit Crypto Exchange, BTC-e",
    "DOJ charges Russian nationals with laundering bitcoin in 2011 Mt. Gox hack",
    "US DoJ charges two Russians for hacking crypto exchange Mt. Gox",
    "Russian nationals accused of Mt. Gox bitcoin heist, shifting stolen funds to BTC-e",
    "DOJ charges two Russian nationals with historic Mt. Gox hack",
    "DOJ unseals Mt. Gox charges targeting two Russian nationals",
    "US Hits Two Russians With Criminal Charges Over Mt. Gox Bitcoin Hack",
    "Breaking: US DOJ Charges Russian Nationals In Mt. Gox Hack & Running BTC-e Exchange",
    "DOJ unseals Mt. Gox charges against 2 Russian nationals",
    "Feds charge two men for the $400 million Bitcoin hack that took down Mt. Gox",
    "Breaking: DOJ Takes Down Mt. Gox Hackers For Multi-Million Dollar Crypto Theft",
    "DOJ charges two Russian hackers with scheme to launder 647,000 BTC",
    "US DOJ charges 2 Russians with laundering over 600k Bitcoin",
    "US DOJ officially names names in the granddaddy of all SFYL exchange hacks, Mt. Gox",
    "Cardano (ADA), Polygon (MATIC), Solana (SOL) Update",
    "Users Can't Trade These Three Tokens on Robinhood Anymore",
    "Robinhood to delist Solana, Cardano, Polygon tokens after SEC describes them as securities",
    "Tokens delisted, exchange closed following SEC crypto lawsuits",
    "ADA, SOL and MATIC Tank 10% Each After Robinhood Delisting, Will More Exchanges Follow?",
    "Robinhood to Delist ADA, SOL and MATIC After SEC Classification as ‘Securities’",
    "Crypto Tokens Plunged This Week After Gensler Stepped Up SEC's Industrywide Crackdown",
    "Robinhood Ceases Support For Cardano, Solana, And Polygon After SEC Calls Them Securities",
    "Robinhood to Delist Cardano, Solana, and Polygon Amidst SEC Regulatory Pressure",
    "Robinhood To Delist ADA, MATIC & SOL Following SEC's Crackdown",
    "Robinhood Delists Solana, Cardano, And Polygon",
    "Robinhood pulls the plug on MATIC, SOL, ADA amid SEC crackdown",
    "Robinhood to cut support for Cardano, Polygon, and Solana",
    "Robinhood Moves to Cut Support for Cardano, Polygon and Solana",
    "Robinhood Ends Support for All Tokens Named in SEC Lawsuit as Securities",
    "Robinhood Delists Cardano, Solana and Polygon Following SEC Suits",
    "Robinhood Delists Cardano, Polygon and Solana Following SEC Labeling Them As Securities",
    "Shiba Inu: Will Robinhood Delist SHIB?",
    "Robinhood to delist Cardano, Solana, Polygon; Here's when support will end",
    "Robinhood nixes ADA, MATIC, SOL",
    "Robinhood Markets removes three crypto tokens",
    "Robinhood Removes 3 Crypto Tokens Following Regulatory Crackdown",
    "Solana, Cardano ..... baby why don't we go down to Kokomo",
    "Crypto is getting pummeled https://twitter.com/...",
    "Nvidia's AI software exposes sensitive data - Details",
    "‘Late in the game’: Sunak and Starmer in policy scramble as AI surges ahead",
    "NVIDIA's AI Software Tricked Into Bypassing Guardrails, Giving Out SSNs",
    "Nvidia's AI Software Tricked Into Leaking Data 1",
    "Nvidia's AI software tricked into leaking data",
    "A First Look At The Impact of Netflix's Password Sharing Crackdown",
    "Netflix sees massive subscriber jump after password-sharing crackdown",
    "Netflix password crackdown boosts new subscribers to highest level since Covid began",
    "Uh Oh, Netflix's Password Sharing Crackdown Is Actually Working",
    "Netflix subscription numbers rise amid password-sharing crackdown",
    "Netflix's Password-Sharing Crackdown a Success",
    "Netflix sees subscribers spike in the US, courtesy of new password sharing policies",
    "Netflix's password sharing crackdown seems to be working",
    "Netflix Subscriptions Jump as U.S. Password-Sharing Crackdown Begins",
    "Netflix's password-sharing crackdown got me — here's what happened",
    "Netflix Saw as Much as 100,000 Daily Sign-Ups Post Password-Sharing Ban",
    "Netflix's password crackdown leads to massive subscription spike",
    "Ugh, Netflix saw growth after the password crackdown. You know what that means.",
    "Netflix Adds More Than 200,000 New Subscribers After Password-Sharing Crackdown",
    "Netflix Password Sharing Crackdown Works, U.S. Subscriber Numbers Soar",
    "Netflix Subscriptions Rise as Password-Sharing Crackdown Takes Effect",
    "People can't seem to quit Netflix after all",
    "Netflix's password-sharing crackdown has really worked out — for Netflix",
    "In a shocking turn of events, Netflix subscriptions rise after password-sharing crackdown",
    "Netflix's Password Sharing Crackdown Leads to Spike in Account Sign-Ups",
    "Subscriptions Soar as Netflix Begins US Password-Sharing Crackdown",
    "Silicon Valley Business Journal",
    "Netflix's crackdown on password sharing may be paying off",
    "Apple vs. Meta is going to be the tech face-off to watch",
    "Netflix Sign-Ups Increase 102% After Password Sharing Crackdown: Report",
    "Netflix sees jump in subs as it begins to curb password sharing in US, says report",
    "Netflix's Password Sharing Crackdown Leads Subscriptions To Climb",
    "Netflix Reportedly Sees Spike In Sign-Ups Following Password Sharing Crackdown",
    "Netflix's crackdown on password sharing appears to be working",
    "Netflix Stock Rises As Account-Sharing Crackdown Boosts Paid Subscriber Numbers",
    "Sorry, but Netflix's password-sharing crackdown seems to be going really well so far",
    "Netflix's password sharing crackdown is actually working as subscriptions spike",
    "Netflix Sign-Ups Jump Amid Password Sharing Crackdown, Report Says",
    "Netflix's subscriber numbers may have actually grown on the heels of its password sharing ban",
    "Netflix Sees Huge Growth In Subscribers After Password-Sharing Crackdown - Report",
    "Netflix Password-Sharing Rules Having Record-Setting Impact on American Subscriber Acquisition",
    "Netflix sign-ups jump as US password sharing crackdown kicks off",
    "Netflix's Looming Account-Sharing Crackdown Sparks Surge of New Sign-Ups",
    "Netflix subscriptions rise as password sharing crackdown becomes a hit",
    "Could Netflix's password-sharing crackdown actually be working?",
    "Netflix Added Subscribers After Password Crackdown, Research Firm Says",
    "Is Netflix's Anti-Password Sharing Too Unpopular?",
    "Gross subscriber addition ≠ net subscriber acquisition because: churn https://www.wsj.com/...",
    "Spotify tests YouTube like ‘Your Offline Mix’ feature; Is it different? Know it all..",
    "Bad internet? Spotify may bring an offline playlist",
    "Spotify is officially testing an offline mix",
    "Spotify is testing an offline mix for bad signal days",
    "Spotify testing ‘Your Offline Mix’ playlist for when you're offline",
    "Spotify is finally ready to save you when you forget to download a playlist",
    "Spotify Is Testing an ‘Offline Mix’ Option for Spotty Internet Connection",
    "Spotify is Tested an ‘Offline Mix’ Feature",
    "Spotify Testing ‘Your Offline Mix’ for Patchy Connections",
    "Spotify's “Offline Mixes” Downloads Songs Smartly for Offline Listening",
    "Spotify is testing a feature that could fix a problem we've all encountered",
    "Spotify is testing an ‘offline mix’ that downloads recently played songs",
    "Spotify tests “offline mix” for when you lose connectivity",
    "Spotify wants to steal one of YouTube Music's best features",
    "Spotify testing new Your Offline Mix playlist to make experience better",
    "Spotify testing ‘Offline Mix,’ its version of one of YouTube Music's best features",
    "Got no internet?  Spotify is testing an offline mix playlist",
    "Apple Music should steal this upcoming Spotify feature",
    "Youtube Music has this since years https://twitter.com/...",
    "Binance.US Set to Be Cut Off From Banking System After SEC Suit",
    "Binance.US prepares to suspend US dollar deposits and withdrawals from exchange",
    "Binance.US To Suspend USD Deposits And Fiat Withdrawal Channels",
    "Binance US Halts USD Deposits, Withdrawals — Asks Users to Withdraw Dollars by June 13",
    "Bitcoin Trades at Narrow Discount on Binance.US",
    "Binance.US Suspends USD Deposits And Withdrawals Amid SEC Pressure",
    "Binance.US Banking Partners Set to Cut Dollar Payment Rails",
    "Binance US to Pause USD Fiat Withdrawals From June 13",
    "Binance.US suspends USD deposits as senators call for DoJ investigation",
    "Bitcoin trades at slight discount on Binance.US as banking partners cut ties",
    "Binance.US to Halt Fiat Withdrawals As Early As June 13",
    "Binance.US to Lose Banking Access, Halts Dollar Deposits",
    "Binance.US Halts USD Deposits, Blames SEC's ‘Witch-hunt’",
    "BinanceUS suspends USD deposits and withdrawals",
    "Binance.US To Suspend All USD Deposits And Withdrawals",
    "Binance Withdrawals: Exchange Suspends USD Deposits as Banking Partners Mull Fiat Pause",
    "Bitcoin is showing great resilience as it enters a new era",
    "Binance US Shifts to ‘Crypto-Only’ Operations Amid Intensified SEC Scrutiny",
    "Binance.US suspends USD deposits following SEC pressures",
    "The crackdown continues. The walls are closing in. https://www.reuters.com/...",
    "Binance.US To Halt Dollar Deposits After SEC Crackdown"
]