[
    "One in three Americans have tried generative AI tools, new survey shows",
    "The AI survey says.... https://twitter.com/... [image]",
    "Introducing Meta Quest+ | VR Title Subscription",
    "Say Hello to Meta Quest+, Our New VR Subscription Service",
    "Meta Launches Monthly VR Game Subscription Service for Quest",
    "Meta launches Quest+ subscription & it's actually not a bad deal",
    "Meta launches new VR subscription ‘Meta Quest+’ for $7.99",
    "Meta's Quest+ subscription offers two VR titles per month",
    "Meta Quest Plus — Meta's VR gaming subscription is finally here",
    "Meta Quest Reveals First 4 Games for New PS Plus-Style Service",
    "Meta announces Quest+, a VR subscription that will offer two titles every month",
    "Meta Quest+ subscription is the VR version of PS Plus and Xbox Live Gold",
    "Meta launches Quest+ games subscription for VR",
    "MosaicML Agrees to Join Databricks to Power Generative AI for All",
    "Databricks picks up MosaicML, an OpenAI competitor, for $1.3B",
    "Databricks acquires generative AI startup MosaicML in $1.3B deal",
    "Databricks' $1.3 billion buy of AI startup MosaicML is a battle for the database's future",
    "Databricks Signs Definitive Agreement to Acquire MosaicML, a Leading Generative AI Platform",
    "Databricks to Acquire MosaicML",
    "Databricks to Buy Generative AI Startup MosaicML for $1.3 Billion",
    "Databricks acquires MosaicML in $1.3bn deal to democratise generative AI",
    "Databricks is acquiring MosaicML for a jaw-dropping $1.3 billion",
    "Databricks adds on to the Lakehouse, acquires MosaicML for $1.3 billion",
    "Databricks buys AI darling MosaicML for $1.3B",
    "Databricks Acquires MosiacML to Further Democratizing Generative AI",
    "Databricks strikes $1.3 bln deal for generative AI startup MosaicML",
    "Databricks acquires MosaicML to make generative AI accessible for every organization",
    "Man, two billion dollar acquisitions today.",
    "Instagram style acquisitions now going down in AI. This is a big deal for startups. [image]",
    "AI Software M&A is hot! https://twitter.com/...",
    "Databricks Strikes $1.3B Deal for Generative AI Startup MosaicML",
    "How Google DeepMind Plans to Outsmart ChatGPT with Gemini",
    "“Google DeepMind's CEO says its next algorithm will eclipse ChatGPT”",
    "Google DeepMind's CEO Says Its Next Algorithm Will Eclipse ChatGPT",
    "Airline 5G mess still not over, expect flight delays from this weekend",
    "A 5G deadline could ground some US flights starting July 1st",
    "Secretary Buttigieg warns of flight delays from July 1 due to 5G",
    "If your flight is delayed or canceled starting July 1st, blame it on 5G",
    "An upcoming 5G deadline could cause airline delays starting July 1st",
    "Film and TV Profits Have Collapsed Over the Last Decade",
    "Meghan Markle is ‘not a great talent’: UTA CEO after Spotify deal bust",
    "Hollywood is leaving podcasting to podcasters",
    "Taylor Swift turned down Meghan Markle's invite to appear on her podcast",
    "Taylor Swift Turned Down Meghan Markle's Podcast Invite: Report",
    "The real story of how Facebook almost acquired Waze, but we ended up with Google",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Wolfspeed Announces $1.25 Billion Funded Secured Notes Led by Apollo Credit Funds",
    "Chipmaker to Raise Over $1 Billion in Debt From Apollo-Led Group",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "Korean firms fight talent exodus as chip tech war intensifies",
    "There's room for more: Now you can allow up to 5,000 attendees in Zoho Webinar",
    "Bodega Delivery: Amazon Turns to Thousands of Small Shops to Speed Up Deliveries",
    "Amazon will use small businesses to help deliver packages in the US",
    "Amazon wants to turn small shops into delivery partners",
    "Amazon will now pay your coffee shop to deliver packages",
    "Amazon Recruiting Local Businesses for Last-Mile Delivery",
    "Amazon is leaning on small businesses to help deliver packages around the U.S.",
    "A small business might deliver your next Amazon package",
    "Amazon to lean on local businesses for “last mile” delivery",
    "US Supreme Court lets Google win stand against Genius suit over song lyrics",
    "Supreme Court Rejects Lawsuit Accusing Google of Stealing Millions of Song Lyrics",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/26 - The M&A Deluge In AI Begins",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Google Pixel Fold review: A weekend later, I'm nearly sold on the Fold",
    "Google Pixel Fold Initial Review: Shockingly good, but is it worth the money?",
    "I tried to replace my phone with the Motorola Razr+'s cover display — here's what happened",
    "5 upcoming foldable phones you could wait for instead of buying the Pixel Fold",
    "IBM's $4.6B Apptio deal marks another new era for Seattle-area cloud and IT management company",
    "IBM to buy Apptio for $4.6B to help companies optimize IT spend",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM to acquire software firm Apptio for $4.6 bln",
    "IBM to acquire FinOps leader Apptio for $4.6 billion",
    "IBM Agrees to Pay $5 Billion for Apptio Acquisition",
    "IBM Will Buy Software Company Apptio for $4.6 Billion",
    "IBM Buys Software Firm Apptio for $4.6 Billion",
    "IBM acquires hybrid cloud software company Apptio for $4.6B",
    "IBM acquires Apptio for $4.6 billion, wants to optimize, automate your IT",
    "IBM confirms $4.6bn Apptio takeover",
    "IBM to buy Apptio from Vista for $4.6 billion",
    "IBM to acquire Apptio for $4.6 billion to bolster its cloud and automation capabilities",
    "IBM paying $4.6B in cash for tech software firm Apptio in CEO's latest tech deal",
    "IBM nears $5 billion deal for software provider Apptio, Wall Street Journal reports",
    "IBM nears US$5 billion deal for Apptio",
    "Japan bolsters its chip industry with buyout of equipment maker JSR",
    "Japan steps into chip supply chain with $6.4bn JSR deal",
    "Japan-backed fund JIC to buy chip materials maker JSR for $6.4b",
    "Japan fund eyes JSR buyout as Tokyo ramps up chip intervention",
    "2023 Engineering Salary Expectations Trends Report",
    "Tech Workers Forgoing Higher Salaries Amid Layoff Crisis",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "New York City Department of Education impacted by online security breach",
    "Community Letter on Data Incident",
    "45,000 NYC students among the victims of MOVEit global data breach, DOE officials say",
    "NYC student data breached in worldwide MOVEit cyberattack, say city Education Department officials",
    "NYC schools hacked with sensitive info on 45,000 students compromised: DOE",
    "Crypto ticks higher, fintech gets interesting again and fraud is still bad",
    "Proud of you @christinacaci - https://www.techmeme.com/...",
    "@amandamarcotte.bsky.social"
]