[
    "The Official Microsoft Blog",
    "Microsoft 365 Developer Blog",
    "@thekenyeung@mastodon.social",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft goes all in on plug-ins for AI apps",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Bing at Microsoft Build 2023: Continuing the Transformation of Search",
    "Windows Copilot will bring AI inside Windows 11",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "The 5 biggest announcements from Microsoft Build 2023",
    "Microsoft reveals major File Explorer redesign coming soon to Windows 11",
    "Microsoft Edge is getting Copilot and support for ChatGPT plugins",
    "Build 2023: Microsoft 365 Copilot to Get Plugins Support",
    "Microsoft Build 2023 Puts AI in Everything, Adds Dev Mode for Windows 11",
    "Microsoft Build 2023: What businesses need to know",
    "Microsoft's M365 Copilot AI assistant gets third-party app integrations",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft launches generative AI tools for developers",
    "All the major Bing Chat and AI announcements from Microsoft Build 2023",
    "Microsoft expands AI plugins and copilot ecosystem for developers",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "Microsoft Bing search is being added to ChatGPT; new Bing Chat plugin partners revealed",
    "OpenAI's Brockman: Industry use cases, developers next stage for generative AI, ChatGPT",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft announces Windows Copilot, Bing in ChatGPT at Build 2023",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft is bringing OpenAI ChatGPT plugins to Windows 11",
    "Build 2023: AI announcements recap",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "Microsoft Presents Shared Plugin-Ecosystem for Bing, ChatGPT and Microsoft Products",
    "Build 2023: Building apps that bring together AI and collaboration",
    "Microsoft is bringing AI Copilot features to Edge",
    "Microsoft 365 Copilot Gets Support for Plugins",
    "Microsoft Announces AI Integrations at Build 2023, Including Windows Copilot",
    "The Windows Copilot puts Bing Chat in every Windows 11 computer",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft Developer on YouTube",
    "A livestream of the Microsoft Build 2023 keynote",
    "Windows AI Copilot Rolls Out in Preview Next Month, Plug-Ins Coming to Bing AI",
    "Is this Apple's sneaky way of teasing an AR headset at WWDC 2023? …",
    "How to watch Microsoft's Build 2023 conference",
    "Watch the Microsoft Build keynotes here, starting at 12PM ET",
    "How to watch Microsoft Build 2023",
    "Microsoft Build 2023: How to watch, what to expect, and more",
    "Microsoft Build 2023: How to watch, what to expect",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Microsoft confirms 365 Co-Pilot AI will be ‘natively integrated’ into Edge",
    "Bing Search is coming to ChatGPT",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "Microsoft to Release Windows 11 “Moment 3” Update on May 24, 2023",
    "The man who put Microsoft in the AI lead",
    "Microsoft makes a push for AI responsibility and safety through Azure",
    "Safety. https://twitter.com/...",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Why Microsoft is combining all its data analytics products into Fabric",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "At Build 2023, Microsoft unveils new Fabric OneLake Shortcuts for ADLS, AWS, Google Storage",
    "Microsoft unveils Microsoft Fabric at Build 2023, pitches integration, simplified pricing",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft Brings AI Copilot to PowerBI, Power Pages and Microsoft Fabric",
    "Microsoft Fabric Brings New AI-Powered Data Analytics Features to Boost Productivity",
    "Build 2023: Microsoft officially announces Fabric, an end-to-end, unified analytics platform",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsot Introduces Azure AI Studio for Building, Training, and Deploying Intelligent Apps",
    "Microsoft Wants Companies to Build Their Own Generative AI Chatbot Copilots",
    "Windows Copilot AI assistant brings ChatGPT straight to your desktop",
    "Microsoft wants to make Windows a better place for developers",
    "Microsoft's cloud-hosted developer workstations will soon be generally available",
    "Microsoft's new Dev Home app for Windows 11 makes it easier to set up your workflow",
    "Microsoft boosts Windows developer productivity with Dev Home",
    "Microsoft Dev Box preview to soon end and be generally available, 2TB SSD added",
    "Reimagining Developer Workstations with Microsoft Dev Box",
    "Build 2023: Cloud based Microsoft Dev Box to hit general availability in July",
    "Microsoft Dev Box Adds New Features Ahead of its General Availability in July",
    "Build 2023: Microsoft Dev Box will be generally available in July 2023",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "Apple Inks Multibillion-Dollar Wireless-Chip Supply Deal With Broadcom",
    "Apple to Pay Broadcom Billions for US-Made 5G Chips",
    "Apple and Broadcom sign multi-billion dollar deal to manufacture more 5G components in the U.S.",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple strikes ‘multibillion-dollar’ deal with Broadcom for 5G parts",
    "Apple's Broadcom Deal Is a Big Moment—but Not Because of 5G Chips",
    "Apple inks multibillion-dollar chip deal with Broadcom",
    "Apple boosts its commitment to US manufacturing with a massive Broadcom deal worth billions",
    "Apple signs multi-billion-dollar 5G deal with Broadcom",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple Strikes Multibillion-Dollar Supply Deal With Broadcom",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple in multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple and Broadcom sign deal that will power your iPhone 16 next year - and beyond",
    "Apple signs deal with Broadcom to ‘deepen investments in the U.S. economy’",
    "Apple Just Made A Multibillion Dollar Move To Secure Its 5G iPhone Future",
    "Apple And Broadcom Sign Multibillion-Dollar Deal",
    "Apple strikes big deal with Broadcom for US-made 5G components",
    "Apple Strikes Multibillion Manufacturing Deal with Broadcom",
    "Made in USA: Apple strikes multi-billion dollar chips deal with Broadcom",
    "Apple inks multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple multibillion-dollar Broadcom deal seems mostly for 5G",
    "Apple announces multibillion-dollar Broadcom deal amid rumors of in-house 5G iPhone radio",
    "Apple inks multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Microsoft pledges to watermark AI-generated images and videos",
    "Microsoft Designer and Bing Image Creator will soon tag images and videos with metadata info",
    "Build 2023: Microsoft to watermark AI generated content created by Bing Image Creator and Designer",
    "Microsoft Bing will become ChatGPT's default search engine in latest OpenAI collaboration",
    "Bing integration with ChatGPT will blur the lines between OpenAI and Microsoft chatbots",
    "Microsoft confirms Bing AI and ChatGPT plugins will work together",
    "Microsoft beefs up ChatGPT and Bing in wide-ranging AI product launch",
    "Bing to be default search engine on Open AI's ChatGPT",
    "Bing is coming to ChatGPT as the default search experience",
    "Microsoft Sticks Bing Into ChatGPT after Sticking ChatGPT Into Bing",
    "Build 2023: Microsoft Announces Bing Search Integration Into ChatGPT",
    "Microsoft just supercharged ChatGPT with Bing's AI-powered search",
    "Microsoft to Add Bing Search to OpenAI's ChatGPT in Battle With Google",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "Microsoft says Bing can be default search engine for ChatGPT users",
    "Bing coming to ChatGPT is a seismic shift for generative AI — here's why",
    "Microsoft Bing will connect ChatGPT to the internet for all users",
    "Build 2023: OpenAI ChatGPT to have Microsoft Bing search integration",
    "Build 2023: OpenAI's ChatGPT to use Bing as its default search experience",
    "Bing Search Tests Blue Highlighted Text In AI Chat Answers Within Search",
    "Bing Chat vs ChatGPT: Which AI Chatbot Reigns Supreme for Freelancers?",
    "Microsoft puts a spotlight on AI in its Windows app store",
    "Announcing the Microsoft Store App Awards 2023 Winners!",
    "Windows 11's Microsoft Store is getting AI-powered reviews and dedicated ‘AI Hub’ features",
    "Microsoft Store will use AI to summarize app reviews by customers",
    "The Microsoft Store will finally restore your pinned apps across Windows 11 devices",
    "Build 2023: Microsoft Brings AI Features to the Microsoft Store",
    "The Microsoft Store will help curate AI tools for you now",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft Store gets AI-generated review summaries, keywords and a dedicated AI Hub",
    "Build 2023: Microsoft Store is adding an AI Hub, expanding Store Ads",
    "The Seamless Transition: Microsoft Store's New Backup and Restore Feature",
    "Binance Blasts ‘Desperate’ Reuters Report It Commingled Customer and Company Funds",
    "Binance pushes back against Reuters report alleging company commingled funds",
    "Binance reportedly mixed customer funds with company revenue at a US bank",
    "Binance allegedly commingled customer funds: Reuters",
    "Binance commingled funds at Silvergate: Reuters",
    "Reports suggest Binance mixed customer and company funds",
    "Binance regularly commingled customer funds with corporate revenue in 2020 and 2021: Reuters",
    "Binance Exchange Allegedly Commingled Customer Funds and Company Revenue",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Meta loses millions as made to sell Giphy to Shutterstock",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta sells Giphy at a significant loss after UK breakup order",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Shutterstock Agrees to Acquire Giphy From Meta",
    "Shutterstock picks up Giphy for $53 million after UK blocks Meta's acquisition",
    "Shutterstock to Buy Meta's Giphy for $53 Million on UK Antitrust Order",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "Meta Sells Giphy for $53 Million to Shutterstock. U.K. Regulators Score a Big Win.",
    "Meta sells Giphy to Shutterstock for $53 million to comply with UK regulator order",
    "Meta sells Giphy at a $347m loss to comply with UK regulator",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Meta Sells GIPHY To Shutterstock, Reportedly Taking A Big Loss In The Process",
    "Meta sold Giphy at a $262 million loss",
    "Shutterstock to Acquire Giphy from Meta for $53M",
    "Meta sells GIPHY to Shutterstock for a big loss after regulators force a sale",
    "Meta complies with UK order, sells Giphy to Shutterstock at a huge loss",
    "Meta Sells Giphy to Shutterstock in $53 Million Deal",
    "Meta Sells Giphy to Shutterstock at a $260 Million Loss",
    "Feels like a steal https://www.reuters.com/...",
    "Google Product Studio brings AI-generated images to advertisers",
    "Google Will Soon Show You AI-Generated Ads",
    "Google Leans Into Generative AI to Power Product Imagery for Merchants",
    "New tools to help small businesses connect with online shoppers",
    "Google Product Studio Lets Merchants Create Product Imagery With Generative AI",
    "Introducing a new era of AI-powered ads with Google",
    "Google Search Generative Experience integrates Search, Shopping ads",
    "Google to test ads in generative AI search results",
    "Social Media and Youth Mental Health",
    "‘Take action and protect our kids’: U.S. Surgeon General warns of social media risks",
    "US Surgeon General says social media can pose ‘a profound risk’ to teens' mental health",
    "Surgeon General Warns of Social Media's ‘Profound Risk of Harm’ to Kids",
    "Surgeon General warns of social media's negative impact on kids' mental health",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Surgeon general issues advisory about social media risks for kids",
    "On ‘Defining Public Health Issue of Our Time,’ a Warning",
    "8 Social Media Tips for Parents and Teens from the U.S. Surgeon General",
    "Car seats and baby formula are regulated. Is social media next?",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "Surgeon general issues urgent warning about kids and social media",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "US Surgeon General says social media may be hazardous to teen health",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "San Francisco Business Journal",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "Anthropic raises $450M to build powerful but trustworthy AI systems",
    "Anthropic secures $450M in Series C funding from Google, Salesforce and others",
    "AI start-up Anthropic raises $450mn from Google and Spark Capital",
    "Alphabet-backed AI startup Anthropic raises $450 million",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "AI startup Anthropic raises $450M from Spark, Google, Salesforce",
    "OpenAI rival Anthropic raises $450 million in funding with backing from Google to take on ChatGPT",
    "Anthropic pulls in another $450 million to build safe AI",
    "Ex-OpenAI execs raise $450 million for Anthropic, a rival A.I. venture backed by Google",
    "Here's why Max's new $20-a-month 4K plan is worth it",
    "Max Goes Live With New $19.99 4K Plan",
    "Max streaming guide: Signing up, pricing, features, 4K content availability and more",
    "HBO Max is officially just MAX: what this means for you",
    "How to Download Max App on Roku Devices if HBO Max Didn't Update Automatically",
    "Max Experiencing Launch Day Issues As Streaming Platform Switches From HBO Max",
    "Max launches as HBO Max and Discovery+ mash-up with even more 4K",
    "The rebranded HBO Max service launches today, new 4K tier announced",
    "Warner Bros. reveals Max: Rebranded HBO Max",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Warner Bros Discovery relaunches HBO Max streamer as ‘Max’ in bid for broader audience",
    "HBO Max become Max today, 4K content gets major boost.",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Max makes its U.S. debut, giving subscribers 35K hours of content",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "why are all the streaming services blue now [image]",
    "These generative AI tools coming to Adobe Photoshop will blow your mind",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Don't Believe Your Lying Eyes in the AI Era",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe harnesses Firefly to bring new generative AI features to Photoshop",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "Adobe Firefly now works with Photoshop, wants to improve your business' content",
    "Photoshop's new AI-powered tricks will fix your biggest mistakes",
    "Adobe Adds AI Image Generator Firefly to Photoshop",
    "Adobe is adding its Firefly AI into Photoshop later this year",
    "Adobe Brings Firefly Generative AI Tools to Photoshop",
    "Adobe adds AI features to Photoshop with new Generative Fill feature",
    "Adobe Photoshop just got even easier to use with Generative Fill AI edits",
    "Photoshop just got a massive upgrade thanks to Adobe Firefly generative AI",
    "Photoshop's New ‘Generative Fill’ Uses AI to Expand or Change Photos",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use",
    "Photoshop Now Lets You Use Text to Edit Your Photos Thanks to New AI Tools",
    "Adobe integrates generative AI directly into Photoshop with new Firefly capabilities",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe Introduces AI Image Generator Firefly to Photoshop",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "IOSCO Sets the Standard for Global Crypto Regulation",
    "IOSCO: Crypto Regulators Should ‘Just Push Ahead’",
    "Global Standard Setter Recommends More Investor Protection Following Turmoil Over the Past Year",
    "International watchdog launches consultation on crypto regulations",
    "Regulators Should Block Firms From ‘Combining’ Crypto Functions, Says IOSCO",
    "Global securities watchdog IOSCO call for crypto regulation standards",
    "IOSCO proposes global standard for crypto regulation",
    "IOSCO Urges Global Regulators to Accelerate and Strengthen Oversight of Crypto Markets",
    "Crypto Regulation Goes Global: Watchdog Presents Landmark Framework For Digital Markets",
    "FTX filings hint at reboot, OKX exchange picks Paris as hub",
    "International Securities Regulator IOSCO Proposes Policy Recommendations for Crypto",
    "Apple releases Final Cut Pro and Logic Pro for iPad, here's pricing, compatibility, more",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Hands On With Apple's Logic Pro for iPad",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Hands-On With Apple's Logic Pro for iPad",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Apple's Final Cut Pro and Logic Pro for the iPad Are Now Available to Download",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Final Cut Pro and Logic Pro for iPad are here",
    "First Impressions: Final Cut Pro for iPad",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "Apple releases Final Cut Pro and Logic Pro for iPad",
    "Logic Pro now available for iPad: Here's everything you need to know",
    "Final Cut Pro and Logic Pro now available for iPad, here's how to get them",
    "Download: Final Cut Pro And Logic Pro For iPad Released",
    "Caroline Ellison's ‘diary’ a key piece of evidence in Sam Bankman-Fried's FTX fraud case: report",
    "The 6 best features of Amazon's new Fire Max 11, our biggest and most powerful tablet yet",
    "Fire Max 11 is Amazon's largest and most powerful tablet yet",
    "Amazon launches its biggest tablet, the $230 Fire Max 11",
    "Amazon takes aim at Apple and Google with the $230 Fire Max 11, its biggest tablet ever",
    "Amazon Announces Fire Max 11 Tablet With Fingerprint Sensor",
    "Introducing the All-New Fire Max 11: Amazon's Biggest and Most Powerful Tablet Yet",
    "Amazon Fire Max 11 is a $230 Android tablet with keyboard and stylus",
    "Amazon's new $329 Fire Max 11 productivity bundle looks surprisingly promising",
    "Amazon's New Fire Max 11 Tablet Promises Better Everything",
    "The Fire Max 11 Is Amazon's Largest Tablet Yet (and the First With Fingerprint Recognition)",
    "This Fire Max 11 Tablet Is How Amazon Plans To Squash The iPad",
    "Amazon's Fire Max 11 debuts with companion keyboard case, stylus, and $230 price tag",
    "Who needs the Pixel Tablet? Amazon's new Fire Max 11 looks great",
    "Good luck getting work done on Android 9 ! https://twitter.com/...",
    "reminder: the 11-inch Fire Max 11 is now Max https://twitter.com/...",
    "Waymo and Uber partner to bring Waymo's autonomous driving technology to the Uber platform",
    "Uber Teams With Google's Waymo to Offer Driverless Ride-Hailing",
    "Uber will offer Waymo robotaxi rides and deliveries in Phoenix starting later this year",
    "Uber partners with Alphabet's Waymo to offer driverless rides",
    "Waymo robotaxis coming to Uber app with new partnership",
    "Uber and Waymo Partner on Driverless Taxis in Phoenix",
    "Waymo's self-driving cars will be available on Uber's app, starting in Phoenix",
    "Waymo Partners With Rival Uber In Phoenix For Rides And Food",
    "Uber and Waymo fought in court over self-driving trucks. Now they're teaming up",
    "Waymo's Autonomous Vehicles Are Coming To Uber",
    "Waymo and Uber sign multi-year partnership to provide driverless rides and deliveries",
    "headlines i would never imagine a mere six years ago https://blog.waymo.com/... [image]",
    "So excited to bring Waymo's incredible technology to the @Uber platform 🙌 https://twitter.com/...",
    "A Waymo car stopping to do food delivery seems less than ideal: https://www.theverge.com/...",
    "Uber and Waymo team up to bring autonomous taxis to Phoenix. [ai] https://www.theverge.com/...",
    "CEO Sundar Pichai says Google cares deeply about responsible AI",
    "Google boss Sundar Pichai warns AI is ‘too important not to regulate’",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "You can now use Flipboard to browse Bluesky",
    "Peloton relaunches its workout app with new free and pricer subscription tiers",
    "Peloton's new subscriptions leave behind its pricey hardware",
    "Peloton's New App Pricing: Bad for Off-Brand Bike Owners",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "General Secretariat of the Council of the European Union",
    "@mattburgess@infosec.exchange",
    "A day of bad news for spyware makers",
    "Spain seeks to ban encryption, leaked document reveals",
    "Leaked EU files suggest Spain supports end-to-end encryption ban",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Universal Music Group signs deal with AI-music startup Endel",
    "Universal Music Group Embraces AI “Soundscapes” With New Deal",
    "Baidu Ai Chatbot Raises Questions With Its Claim of ‘improved’ Communication",
    "BandLab Adds USD$25M in Series B1 Financing At $425M Post-Money Valuation",
    "BandLab Raises Another $25 Million, Now Valued at $425 Million",
    "TymeBank's parent company gets $77.8 million to drive its South African and Asian expansion plans",
    "Tyme Raises $77.8M in Series C Funding",
    "SFC finalises rules for retail cryptocurrency trading in Hong Kong from June 1",
    "New Crypto Rules Suggest Hong Kong Is ‘Testing Ground’ for China, Say Experts",
    "Hong Kong? Singapore? Tokyo? Seoul? Dubai? The race is on for the Web3 hub of Asia | Part 2",
    "Hong Kong to issue crypto licences with measures to protect retail investors",
    "Hong Kong set to offer retail crypto trading licenses soon",
    "Bitcoin climbs back above $27,000 after Hong Kong greenlights some retail crypto trading",
    "Hong Kong greenlights retail trading of cryptocurrency",
    "Hong Kong's Security and Futures Commission (SFC) to open doors for crypto trading platforms",
    "Breaking: Hong Kong Allows Retail Investors Trade Bitcoin, ETH, Other Crypto",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "QIA Leads $250-Mn Funding In British-Indian Entrepreneur's Builder.Ai",
    "Alphabet-backed AI startup Anthropic raises $450 million as funding freeze thaws",
    "London-Based Startup Builder.ai Raises $250 Million",
    "QIA Leads $250 Million Funding Round for App Platform Builder.ai",
    "London AI firm bags $250m injection led by Qatari sovereign wealth fund",
    "Microsoft-Backed Builder.ai Raises $250 Mn In Series D Funding Round Led BY QIA",
    "Builder.ai keeps on building, now with a fresh $250+ million",
    "The best TV streaming service 2023",
    "Tech industry coalition launches Stop Scams UK to combat online fraud",
    "Big tech and banks conspire in new scheme to combat fraud",
    "Very confusing country where Schemes are Good but Scams must be Stopped. https://twitter.com/...",
    "Judge Dismisses Shareholder Lawsuit Over Elon's Twitter Takeover",
    "Tesla (TSLA) shareholders show overwhelming support for Elon Musk despite controversies",
    "Exclusive: Reliance JioMart fires 1,000, a bigger layoff round likely",
    "JioMart to lay off thousands to improve margins",
    "Reliance JioMart cuts 1,000 jobs and to eliminate thousands more, report says",
    "Google expands its AI-powered flood tracking service to 60 more countries",
    "US District Court, District of Montana",
    "TikTok Sues Montana, Calling State Ban Unconstitutional",
    "TikTok to let Oracle view source code, algorithm, and content moderation",
    "TikTok sues Montana over new law banning the app",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "TikTok sues to stop Montana from enforcing its “unconstitutional” ban",
    "TikTok sues Montana to block ban, citing First Amendment",
    "What's Trending Today: TikTok Sues Montana, Denver Nuggets Sweep Lakers",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "Leave it to the feds: TikTok sues Montana",
    "Take that: TikTok sues Montana over law banning social media site",
    "TikTok sues Montana to block state-wide ban",
    "TikTok challenges the US state of Montana over ban of its app",
    "TikTok Inc. v. Austin Knudsen",
    "TikTok Sues State of Montana",
    "TikTok sues US state of Montana over law banning its use",
    "Montana TikTokers Sue Over App Ban",
    "TikTok Sues Montana Over Ban, Cites First Amendment",
    "TikTok sues Montana after state became first to ban its app",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "Please, World, Please, Regulate AI. Oh, Come Now, You Silly Goose",
    "OpenAI calling for AI regulation is a solid step in no direction",
    "a key feature of the IAEA is that China and Russia are members https://twitter.com/...",
    "“Open Source is great, as long as it doesn't exceed our latest released capability” 😂",
    "The hype game becomes the regulatory capture game. https://openai.com/...",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "European Data Protection Board",
    "Data Protection Commission",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "How Meta got caught in tensions between the US and EU",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Meta has a $11 billion reason not to leave the EU",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "EU regulators fine Meta $1.3 billion, but some say potential data losses could be even harsher",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "EU hits Meta with record €1.2B privacy fine",
    "European regulators signal they are fed up with Facebook",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "Facebook's Parent Company Meta Fined €1.2bn for Data Breach",
    "Irish watchdog opposed €1.2bn Meta fine, saying it would have no ‘meaningful dissuasive effect’",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "TechScape: Warnings of a ‘splinternet’ were greatly exaggerated - until now",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "EU Fines Meta Record €1.2bn; New Twitter CEO Reassures Top Ad Group",
    "How many billions can Meta's Facebook pay the EU? And does it even matter?",
    "Meta Penalized $1.3B by the Irish DPC for Illegal Data Transfers to the U.S.",
    "DPC fine should be a wake-up call for government",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "Facebook to be fined £648m for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes."
]