[
    "Another unicorpse. Who's keeping a list? https://www.theinformation.com/ ...",
    "Another Frank! https://twitter.com/...",
    "New tech fraud just dropped! 🍿 https://twitter.com/...",
    "19 out of 20 “users” were not 🤯 https://twitter.com/...",
    "Such negativity—why not say 5% are real? https://twitter.com/...",
    "Why do so many startups funded by SoftBank end up imploding like a submersible? ↓ [image]",
    "Social app IRL, which raised $200 million, shuts down after CEO misconduct probe",
    "Aloud - dubbing for everyone",
    "YouTube's new tool can automatically dub videos in other languages",
    "YouTube integrates AI-powered dubbing tool",
    "You may soon listen to YouTube videos in any language thanks to AI",
    "YouTube could soon automatically dub videos using AI",
    "YouTube is testing an AI voice-dubbing feature for creators, and it's incredibly fast",
    "YouTube to boost AI-generated foreign language dubs",
    "YouTube Integrates AI-Powered Dubbing Service",
    "How to dub YouTube videos with AI-powered Aloud tool",
    "YouTube video translation is getting an AI-powered dubbing tool upgrade",
    "YouTube will soon be introducing its new AI-powered dubbing tool",
    "ICYMI: Twitch Says Competition Will Make Us Stronger; VidCon Recap Day One",
    "YouTube adding AI dub technology to translate videos for creators",
    "YouTube AI Dubbing: Overcoming Language Barriers",
    "YouTube Is Adding AI-Powered Dubbing",
    "Phil Spencer Confirms Starfield Was Potentially Going to Skip Xbox Prior to ZeniMax Acquisition",
    "Phil Spencer Gives Clue on When The Elder Scrolls 6 Will Release",
    "The Elder Scrolls 6 Doesn't Have Confirmed Platforms Yet, Is 5-Plus Years Away",
    "Xbox Boss Confirms Last Place in Console Wars, Says CoD Will Stay on PlayStation",
    "“Call of Duty [will Remain] on Sony's PlayStation 5” Testifies Phil Spencer Under Oath",
    "Starfield was almost a PS5 exclusive before Microsoft bought Bethesda",
    "Starfield could have been a PS5 exclusive, says Xbox exec",
    "Sony Planned to Make Starfield a PlayStation Exclusive Before Microsoft Acquired Bethesda",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Microsoft Bought Bethesda To Stop Starfield Becoming A PS5 Exclusive",
    "Not even head of Xbox Phil Spencer knows if Elder Scrolls 6 will be on PlayStation",
    "Bethesda's upcoming Indiana Jones game will only be available on Xbox and PC",
    "Bethesda's Indiana Jones game confirmed to be Xbox and PC exclusive",
    "Xbox Boss Promises To Keep Call Of Duty On PlayStation (Again)",
    "The Elder Scrolls VI to launch in 2028 at the earliest",
    "Starfield's Potential PS5 Exclusivity Prompted Microsoft to Acquire Bethesda",
    "Bethesda's Indiana Jones game now Xbox exclusive after multiplatform deal change",
    "Bethesda's upcoming Indiana Jones game to release as an Xbox, PC exclusive",
    "Xbox's Phil Spencer has final say on game exclusivity",
    "I should kept Twitter until Microsoft offered to buy my Twitter account. https://twitter.com/...",
    "International Business Times",
    "Australian Financial Review",
    "Meta Will Launch Twitter Competitor In Mid-July: Report",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "Elon Musk vs. Mark Zuckerberg Cage Match Prompts Hypothetical Odds",
    "Elon Musk, Mark Zuckerberg ‘Dead Serious’ About UFC Fight: 'Let's Go Full MMA'",
    "No Joke: Musk and Zuckerberg Really Want to Fight, Says UFC Boss",
    "Dana White reveals Elon Musk & Mark Zuckerberg “dead serious” about fight",
    "Here's the real reason behind Elon Musk, Mark Zuckerberg cage fight",
    "Here's everything about the Elon Musk vs Mark Zuckerberg cage fight",
    "Sam Altman says he'd go watch Elon Musk cage fight Mark Zuckerberg",
    "Dana White says Elon Musk and Mark Zuckerberg are ‘dead serious’ about fighting in the Octagon",
    "Dana White Says Musk And Zuckerberg Are Serious About A UFC Fight",
    "Dana White says Elon Musk and Mark Zuckerberg are ‘dead serious’ about fighting in UFC match",
    "Dana White insists Musk vs. Zuckerberg is real: ‘Biggest fight ever!’",
    "Dana White Talking to Elon Musk and Mark Zuckerberg About UFC Fight",
    "‘Send Me Location:’ Mark Zuckerberg Says He's Down to Fight Elon Musk in a Cage Match",
    "Musk vs Zuck: Twitter and Facebook bosses agree to a... cage fight",
    "Billionaire cage fight: Elon Musk and Mark Zuckerberg arrange combat",
    "Mark Zuckerberg agrees to fight Elon Musk in a cage match",
    "@SlugtalesNews @alexeheath Jack's Blue Sky is my choice. Can't wait.",
    "@alexeheath So Instagram is not only TikTok but also Twitter?",
    "@petergyang It's a totally new text based app",
    "Some more reporting on the Fediverse aspect of this app: [image]",
    "I have a feeling this might be the Twitter-killer. https://twitter.com/...",
    "@zackwhittaker@mastodon.social",
    "Matthew Russell Lee's Newsletter",
    "British Hacker Gets 5 Years for Stealing Crypto and Swatting Social Media Influencers in NDCA",
    "Twitter Hacker Gets Five Years in Prison for Breaching Accounts of Top US Leaders",
    "FTX seeks to claw $700M from Bankman-Fried friends and affiliated funds",
    "FTX Seeks to Claw Back $700 Million From K5 Global and Related Entities",
    "FTX Strikes Back: Sues Ex-Clinton Aide's Investment Firm For $700 Million",
    "FTX files lawsuit to demand compensation from firms linked to its collapse",
    "FTX files suit against SBF's old pals to attempt $700M clawback",
    "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "FTX Attempts Clawback of $700M Allegedly Spent After A Networking Party",
    "Alameda seeks to claw back $700 million SBF paid ‘super networkers’",
    "FTX Seeks to Recover $700 Million from Sam Bankman Fried's Affiliated Funds",
    "FTX Sues K5 Global Investment Firm for $700 Million",
    "Alameda Seeks Return of $700M Paid to ‘Super Networkers’ for Celebrity, Political Access",
    "Google announces second edition of ‘Startup School’ starting July 11",
    "Eddie Wu prepares to run Alibaba empire built with mentor Jack Ma",
    "VC giant Andreessen Horowitz expands into wealth management",
    "Circle was a principal beneficiary of SVB government rescue",
    "When VCs Benefit From FDIC Funds: Examining The Implications",
    "FDIC Documents Reveal Circle And Sequoia As SVB's Top Depositors",
    "Silicon Valley Business Journal",
    "The FDIC's move to backstop SVB deposits saved Sequoia $1B",
    "US Taxpayers Backstopped Big Tech, VC Billions During SVB Collapse",
    "Circle was SVB's biggest client: report",
    "These SVB Depositors Got Burned—Now They're Fighting Back",
    "Circle and Sequoia were among top depositors at Silicon Valley Bank: Report",
    "Sequoia Had $1 Billion in SVB Deposits When Bank Was Seized",
    "Circle Was Top Depositor Aided by SVB Government Rescue: Bloomberg",
    "LOL omg https://twitter.com/...",
    "Big VC, Tech Got Backstop for Billions in Uninsured SVB Deposits",
    "@TriflingTree@mastodon.social",
    "@WeavingWithAI@sigmoid.social",
    "Midjourney v5.2 Update Features Impressive ‘Zoom Out’ Tool",
    "Midjourney 5.2 brings zoom out and integrated prompt analysis",
    "Midjourney 5.2 Zoom out feature is insane. [image]",
    "Zoom Out with Midjourney v5.2 [image]",
    "MidJourney 5.2 zoom out feature needs a tad bit of work [image]",
    "“Stunning”—Midjourney update wows AI artists with camera-like feature",
    "Vision Pro will turn any surface into a display with touch control",
    "Apple Vision Pro will let you toss timers all over your kitchen while cooking",
    "Apple Vision Pro to Feature ‘Travel Mode’ for Better In-Flight Experience",
    "I think Vision Pro might threaten Google Search more than ChatGPT",
    "Apple Introduces visionOS Beta: A Game-Changer for the Future",
    "Apple Vision Pro Spatial Computing Developer Tools Now Available",
    "Apple wants the Vision Pro to be the world's most expensive in-flight accessory",
    "Apple Vision Pro Travel Mode could make economy feel like first class — but is it worth it?",
    "Apple Vision Pro has a Travel Mode that could change how you fly — here's how",
    "Apple wants you to wear a Vision Pro while flying",
    "Apple Vision Pro's Guest Mode will let you share the $3,500 headset with friends",
    "Apple Vision Pro headset packs interesting ‘Travel Mode’ feature - here's a look",
    "Apple Vision Pro may have a Travel Mode for plane rides",
    "Apple Vision Pro has speed limit, requires Travel Mode for in-flight use",
    "A First Look at Vision Pro's Travel Mode",
    "The Apple Vision Pro could come with a ‘travel mode’ for plane rides",
    "Apple Releases visionOS SDK, Creating Spatial Experiences, Apple's Developer Advantage",
    "Apple Vision Pro will have an in-flight Travel Mode - here's what we know",
    "Apples Vision Pro features a Travel Mode designed for the airplane use",
    "visionOS SDK  —  Apple today announced the availability of new software tools and technologies …",
    "Apple's Vision Pro features a ‘Travel Mode’ designed for airplane use",
    "Travel Mode for Apple's Vision Pro headset discovered in visionOS code",
    "Apple Unveils Vision Pro SDK and Developer Labs",
    "Apple Vision Pro to offer ‘Travel Mode’ for airplane flights",
    "Apple's Vision Pro headset will have a special ‘Travel Mode’ for in-flight use",
    "Apple's Vision Pro will have a special mode for using it on an airplane",
    "The SharePlay design videos for Vision are interesting",
    "Daily Search Forum Recap: June 23, 2023",
    "Google Search rolling out ‘Perspectives’ filter for more personal and human results",
    "Amazon commits to $15 billion India investment, CEO says",
    "Effective scheduling is key to workforce optimization",
    "YouTube is testing an online-games offering",
    "EU, Meta agree to July stress test on EU online content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "@MishaalRahman@androiddev …",
    "Android's ‘Emergency SOS’ blamed for influx of false calls, Google will make changes",
    "Latest Galaxy S23 update makes important change to emergency SOS feature",
    "Android's emergency call shortcut is flooding dispatchers with false calls",
    "Mistaken 911 calls through Android phones could soon be a thing of the past",
    "June “Super Update” will prevent Galaxy S23, S22 users from disabling Emergency SOS",
    "Emergency SOS is always active on Galaxy S23 after June update",
    "Now the UK is warning Android users over accidental emergency calls",
    "Samsung's June 2023 update permanently enables Emergency SOS",
    "Google moves for changes to Android Emergency SOS in response to accidental calls",
    "Android's Emergency SOS feature causes a spike in accidental 999 calls",
    "@MishaalRahman@androiddev.social",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/23 - Meta To Turn Off The (Canadian) News Spigot?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Peak XV, Prosus and Chan Zuckerberg confirm exit from Byju's board",
    "Peak XV Partners, Prosus confirm resignation of Byju's board members",
    "Indian Startup Byju's Loses Board Members in Latest Setback",
    "Exited Byju's board, say Peak XV, Prosus",
    "Byju's investors confirm board exits",
    "Accelerant raises $150M for its insurance underwriting platform",
    "SEC Temporarily Waives $30M Fine, Demands BlockFi Pays Investors",
    "SEC to Delay $30 Million BlockFi Fine Until Investors Are Repaied",
    "SEC waives BlockFi's $30M fine until creditors are paid",
    "SEC will ‘forego’ $30M BlockFi penalty until investors are repaid",
    "US SEC Agrees to Forego BlockFi's $30M Fine Until Investors are Repaid",
    "SEC To BlockFi In $50 Million Settlement Saga - Pay Debtors First",
    "SEC postpones $30 million BlockFi penalty to boost creditor repayments",
    "SEC Temporarily Suspends $30M BlockFi Penalty Pending Investor Repayment",
    "SEC delays BlockFi's $30 million penalty, focusing on investor reimbursement",
    "SEC to Forego BlockFi's Outstanding $30 Million Penalty—For Now",
    "SEC allows BlockFi customers to be repaid before collection of $30.2M fine",
    "Reddit users bombard site with John Oliver pictures in latest protest over new policy",
    "Wait, Reddit had less than $700M of revenue?? How?? https://twitter.com/...",
    "Reddit sales growth slowdown preceded fight over new API fees",
    "@GottaLaff@mastodon.social",
    "@brendannyhan@mastodon.social",
    "Former Trump Campaign Official in Talks to Cooperate in Jan. 6 Inquiry",
    "Shocking. The “Twitter Files” were rigged? Who could've guessed? https://twitter.com/...",
    "Weird this didn't make it into the Twitter Files. https://www.washingtonpost.com/ ...",
    "JPMorgan expands its JPM Coin system to include euro payments: Bloomberg",
    "Bitcoin Price Surges as JPMorgan and Others Launch Crypto Projects",
    "JPMorgan Enables Euro Blockchain Payments With JPM Coin - Report",
    "JP Morgan expands blockchain payment system to include euros",
    "JP Morgan starts offering euro transfers with JPM Coin payment system",
    "JPMorgan's JPM Coin Expands for Euro Transactions",
    "JPMorgan unveils euro blockchain payment solution",
    "First Mover Americas: Bitcoin Might Take a Breather",
    "JPMorgan's blockchain project expands to include euro-denominated payments",
    "JPMorgan bank deploys JPM Coin for euro-denominated payments",
    "JPMorgan Launches Euro Blockchain Payments via JPM Coin",
    "JPMorgan launches euro blockchain payments for corporate clients",
    "JPMorgan begins euro payments on its blockchain platform: Bloomberg",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Card to arrive in India",
    "Apple set to launch its credit card in India: Report",
    "Apple Pay May Finally Come to India",
    "Apple Sets Sights on Indian Credit Card Market in Partnership with HDFC Bank",
    "Apple explores launching Apple Card in India",
    "Apple Is Planning To Launch Its Credit Card In India: Report",
    "Apple to launch credit card in India, in talks with NPCI for Apple Pay",
    "Apple to launch credit card in India, will also introduce Apple Pay: Report",
    "Apple Pay and US-exclusive Apple Card could expand to India",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple Card may arrive in India soon in partnership with HDFC Bank",
    "Apple Card could expand to India, four years after US rollout",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card may launch next in India",
    "Apple Card will launch in India next, report claims",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "Apple Card and Apple Pay could soon launch in India",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Will Apple Card arrive in India before it reaches Europe?",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple in talks to launch Apple Pay in India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Reportedly in Discussions with Banks to Launch Apple Card in India",
    "TSMC Arizona plant safety questioned after multiple accidents, fake active shooter drill",
    "@HopelessDemigod@mstdn.social",
    "Twitter agrees to comply with tough EU disinformation laws",
    "Technology is stress testing our society. Time to turn the tables.",
    "EU to Push Ahead With Data Act Despite Criticism",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "EU plants flag in Silicon Valley ahead of big tech crackdown",
    "Is Twitter ready for Europe's new Big Tech rules? EU official says it has work to do",
    "EU warns Twitter to beef up content moderation as new rules loom",
    "EU Warns Twitter Must Focus on Disinformation Ahead of Elections",
    "Europe takes its fight against Big Tech to CEOs' turf: San Francisco",
    "Twitter agrees to comply with tough EU disinformation laws |  Twitter",
    "@dangillmor@mastodon.social",
    "Meta won't negotiate with publishers, will end Facebook news in Canada",
    "Changes to News Availability on Our Platforms in Canada",
    "Canada's Online News Act Targets Facebook and Google",
    "Canada will require Google and Meta to pay media outlets for news under bill set to become law",
    "Facebook to end news access in Canada over incoming law on paying publishers",
    "Meta says it will block news from Facebook, Instagram in Canada",
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Meta to ban news sharing on Facebook in Canada after journalism bill passes",
    "Facebook and Instagram to restrict news access in Canada",
    "Meta to pull news from Facebook and Instagram in Canada",
    "Canada passes Online News Act - Meta says it will block news on Facebook and Instagram",
    "As Canada Passes Corrupt Link Tax, Meta Says No More News Links In Canada",
    "Meta to stop showing news on feed to Canadian users because of new law, won't pay news outlets",
    "Meta Re-Affirms Plan to Ban News Content in Canada in Response to Proposed online News Act",
    "Meta says it will end news availability on Facebook and Instagram in Canada",
    "Meta Tells Canada: No News for You!",
    "Meta Will Remove News Content From Facebook and Instagram in Canada",
    "Facebook and Instagram to block news in Canada",
    "Want to Share News Articles on Facebook in Canada? Tough Luck",
    "Why Meta Platforms is shutting down Facebook, Instagram news access in Canada",
    "Meta to block news access for Facebook and Instagram users in Canada",
    "Canada Bill C-18 Delivers a Victory: How Long Will the Triumph Pay Off in Cash Money?",
    "Meta to Block Facebook and Instagram News Sharing in Canada",
    "Meta to Remove News From Facebook and Instagram in Canada",
    "Facebook shutters news rather than pay up under new Canadian law",
    "Meta will remove news from Facebook and Instagram in Canada",
    "Meta stops serving news to the Canadian users as Bill C-18 gets closer becoming reality",
    "Meta is yanking news from Facebook and Instagram in Canada",
    "Meta to halt news on Facebook and Instagram in Canada",
    "Canada Passes Law Forcing Facebook, Google to Pay Media for Links",
    "Meta to end news sharing in Canada",
    "Meta to follow through on Facebook, Instagram block in Canada after content bill advances",
    "Canada residents will not be able to access news on Facebook, Instagram; Here's why",
    "Facebook vows to restrict news access in Canada",
    "Meta to end news sharing on Facebook and Instagram for all Canadians",
    "Meta makes good on promise to remove news from Canadian Facebook",
    "Facebook says it will pull Canadian access to news as Bill C-18 heads for Royal Assent",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "Meta to End News on Facebook and Instagram in Canada",
    "Meta to pull plug on news sharing in Canada",
    "Bill C-18: Liberal Government's Online News Act Becomes Law",
    "News Media Canada Welcomes Passage of Online News Act",
    "Meta to Block News on Facebook, Instagram in Canada Over New Law",
    "The Online News Act is now law! #C18 #CdnPoli https://twitter.com/... [image]",
    "Meta has already basically cut off all traffic to news sites anyway https://twitter.com/...",
    "Oh no!! Just kidding. #NoOneCares https://twitter.com/...",
    "Meta confirms it will block news on Facebook, Instagram as Senate passes Bill C-18",
    "Facebook confirms that all news sharing in Canada will end due to passage of Bill C-18",
    "Facebook cutting off news in Canada to avoid paying publishers for content",
    "@mattontech@mastodon.sdf.org",
    "PlayStation Boss Jim Ryan ‘Pretty Sure’ Call of Duty Will Remain on PlayStation in Bombshell Email",
    "Microsoft Says It Could Abandon Activision Deal if Judge Delays It",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Microsoft embraces third-place status in console wars",
    "Microsoft slates next Xbox console generation for 2028",
    "Xbox says Activision forced it into lesser Call of Duty revenue deal",
    "Bombshell Email Reveals Sony Didn't Believe Microsoft Would Take ‘Call Of Duty’ Exclusive",
    "Microsoft says Xbox has 'lost the console wars",
    "Microsoft had to pay Activision extra to get Call Of Duty on Xbox",
    "Microsoft Admits it ‘Lost the Console Wars’ As it Tries to Salvage Activision Deal",
    "Xbox Has ‘Lost the Console Wars,’ Microsoft Says",
    "The Outer Worlds 2 might end up on PlayStation",
    "Microsoft Expects Next Console Generation to Start in 2028",
    "Microsoft Reveals When It Thinks PlayStation 6, Next Xbox Will Be Out",
    "Microsoft and the FTC's fight over Activision reveals secret deals, bombshell emails, and more",
    "Microsoft Says Even Rival Sony Had No Concern Over Activision Deal",
    "Microsoft Has Claimed That It's Already Lost The “Console Wars”",
    "The FTC's case against Microsoft could quickly turn into Xbox vs. PlayStation",
    "Microsoft Says Xbox Has Been Losing The Console Wars Since 2001",
    "Microsoft May Have Inadvertently Revealed When The PS6 Will Arrive",
    "Xbox is actually a small indie game company... https://twitter.com/...",
    "Argonne National Laboratory",
    "Exascale-class Aurora supercomputer is finally ready for duty",
    "Aurora supercomputer will be online in 2023, say creators Intel and HPE",
    "2 ExaFLOPS Aurora Supercomputer Is Ready: Intel Max Series CPUs and GPUs Inside",
    "Aurora Supercomputer Blade Installation Complete",
    "Aurora's 10,624 Blades in Place as Exascale System Nears Completion",
    "Intel and HPE complete assembly of record-breaking Aurora supercomputer",
    "Argonne installs final components of Aurora supercomputer",
    "Awesome to see this!  It took a village!  Congratulations!!",
    "Prime Trust Has ‘Shortfall of Customer Funds,’ Nevada Regulator Says",
    "Prime Trust faces customer withdrawal issues - Nevada regulator raises concerns",
    "Nevada Regulators Order Prime Trust To Shut Down Operations - Here's Why",
    "Prime Trust insolvency fears, Nevada regulator issues cease-and-desist order",
    "Crypto Custodian BitGo Cancels Acquisition of Prime Trust",
    "Nevada regulator says Prime Trust can't meet all client withdrawals",
    "In another blow to crypto, Stably halts withdrawals",
    "@LokiTheCat@toot.community",
    "@BobRobertsonXI@hachyderm.io",
    "DuckDuckGo Windows browser now available in public beta",
    "DuckDuckGo now has its own PC browser for keeping what you do online private",
    "DuckDuckGo browser comes to Windows in beta: Features, how to download and more",
    "Worried about your online privacy? DuckDuckGo's browser has arrived on Windows 11",
    "DuckDuckGo Browser For Windows Enters Public Beta",
    "DuckDuckGo is bringing its browser to Windows",
    "DuckDuckGo's Windows browser is here to protect your privacy",
    "DuckDuckGo's privacy-focused browser is available for Windows now",
    "Hands-On with DuckDuckGo Browser for Windows https://www.thurrott.com/...",
    "Good news for #privacy. #WindowsInsiders https://www.theverge.com/...",
    "DuckDuckGo browser beta for Windows bakes in a lot of privacy tools",
    "DuckDuckGo Browser Beta for Windows Bakes in a Lot of Privacy Tools",
    "DuckDuckGo offers its privacy-centered browser in a Windows open beta"
]