[
    "WSJ News Exclusive | FTX Begins Talks on Reboot as Managers Uncover Past Misconduct",
    "FTX ‘Reboot’ Talks Begin and Send FTT Token Soaring 15%",
    "FTT jumps as much as 33% on news of potential FTX ‘reboot’",
    "FTX engages in talks to bring back international crypto exchange",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "FTX Reportedly Seeking to Relaunch",
    "FTX seeks final submissions this week for revival plans: WSJ",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange",
    "FTX Halts Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX Stops Sale of $500 Million Stake in AI Firm Anthropic: Report",
    "FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold",
    "FTX Suspends Sale of $500M Stake in Anthropic",
    "Crypto Exchange FTX Puts a Pause on Anthropic Stake Sale",
    "FTX's $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "FTX Freezes Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m",
    "FTX hits brakes on sale of $500 million stake in AI firm: Bloomberg",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "International Business Times",
    "Sam Bankman-Fried fails to dismiss criminal charges related to FTX",
    "Judge Rejects Sam Bankman-Fried's Bid to Dismiss Criminal Charges Over FTX, Confirms Trial",
    "Sam Bankman-Fried Hits A Blank Wall As Judge Denies Motions To Dismiss Criminal Charges",
    "Judge denies Sam Bankman-Fried's motion to dismiss charges",
    "Judge's Decision on Sam Bankman-Fried's Motion to Dismiss Charges in FTX Case",
    "Judge rejects SBF's motions to dismiss criminal charges, citing lack of merit",
    "Judge Rules Against Sam Bankman-Fried's Motion to Dismiss Most Charges",
    "Judge Rejects SBF Motion as New FTX Fraud Details Emerge",
    "Judge says arguments behind SBF's motions to dismiss criminal charges are ‘moot or without merit’",
    "Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "Judge Rejects FTX Founder Sam Bankman-Fried's Motions to Dismiss Criminal Charges",
    "Kroll Restructuring Administration",
    "Ex-FTX Compliance Officer Sued for Allegedly Paying Off Would-Be Whistleblowers",
    "FTX Says a Former Top Lawyer Helped Raid Customer Accounts",
    "FTX Sues Former Compliance Chief Who Allegedly Silenced Whistleblowers",
    "FTX accuses ex-lawyer of aiding Bankman-Fried's fraud, silencing whistleblowers",
    "Ex-FTX lawyer Dan Friedberg was SBF's ‘fixer,’ paid ‘hush money’ to whistleblowers: lawsuit",
    "FTX takes legal action over alleged use of ‘hush money’ to conceal wrongdoing",
    "FTX Accuses Former Top Officer Of Helping Sam Bankman-Fried Steal Customer Funds",
    "FTX troubles double with $500 AI sale suspension and hush money accusations",
    "FTX Sues Ex-Compliance Chief Over ‘Hush Money’ Payments",
    "FTX sues Dan Friedberg alleging he used ‘hush money’ to silence whistleblowers",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Xbox won't make Call of Duty worse on PlayStation — here's why",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "Call of Duty Netted Almost $1 Billion in Revenue for PlayStation in USA Alone",
    "Sony Says Current CoD Contract For PlayStation Ends After 2023's Game",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "PlayStation head doesn't think Call of Duty aligns with the ‘standard Nintendo audience’",
    "Jim Ryan Says Publishers “Unanimously” Hate Xbox Game Pass",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "Introducing Proton Pass - Protecting your passwords and online identity",
    "Proton Pass end-to-end encrypted password manager is here and free for everyone",
    "Proton's got a new password manager with email masking and more",
    "ProtonMail Developer Launches Free, Encrypted Password Manager",
    "Proton Pass: Free Password Manager for iOS, Android and More",
    "Proton Pass  —  Free and fully encrypted password manager to keep your login credentials safe.",
    "Proton's Password Manager Is Now Available for Everyone",
    "Proton's password manager Proton Pass comes out of beta",
    "Proton's encrypted password manager is now available to everyone.  - The Verge",
    "Proton Pass free password manager emerges from beta",
    "Proton's new password manager has just landed for all users",
    "Save 80% Off ‘Proton Pass Plus’ Password Manager Forever! [Limited Time Deal]",
    "Proton Pass password manager launches with a deal that's just too good to pass up",
    "Proton launches its password manager Proton Pass, now available for download",
    "Proton Pass password manager leaves beta: here is our take",
    "Proton Pass password manager is out of beta and available for free",
    "Proton Pass, the free password manager from Proton Mail, is out of beta",
    "ECB welcomes European Commission legislative proposals on digital euro and cash",
    "EU proposes to establish legal framework for potential digital euro",
    "The case for a digital euro",
    "European Commission aims for universal acceptance with digital euro proposal",
    "Europe moves closer to creating the digital euro—but privacy fears persist",
    "Leaked Draft Reveals EU Commission's Plans for Digital Euro: A Closer Look at the CBDC",
    "Privacy fears dominate launch of digital euro plan",
    "EU's plan to dominate global markets with digital euro",
    "EU Moves Ahead With Push to Create Digital Euro for Payments",
    "EU could move step closer to digital euro this October, Lagarde says",
    "Digital Euro System Now Underway in Europe, EU Commission Says It 'Won't Replace Cash'",
    "Digital euro proposal from European Commission seeks universal approval",
    "ECB expresses support for European Commission's digital euro proposal",
    "European Commission Publishes Proposals to Preserve Cash and Create Digital Euro Framework",
    "EU Wants Digital Euro to Complement Cash, Not Replace It",
    "EC stresses privacy in digital euro plan",
    "EU moves closer to launching digital euro",
    "Mairead McGuinness: EU must win people's trust for digital euro",
    "EU to take one giant leap towards digital euro",
    "EU publishes draft bill for digital euro and cash payments",
    "EU Publishes Digital Euro Bill Featuring Privacy Controls, Offline Guarantee",
    "Reclusive Binance co-founder Yi He speaks on SEC case",
    "Binance's Yi He sheds light on relationship with CZ, tells Bloomberg she's no Caroline Ellison",
    "Smartphone Startup Nothing Raises $100 Million To Build The Apple Of Android",
    "Carl Pei's smartphone startup Nothing raises $96 million from investors for U.S. expansion",
    "Nothing Raises Something — $96M",
    "Nothing Phone 2's U.S. Release Just Got One Step Closer To Reality",
    "Carl Pei's Nothing bags $96 million funding ahead of Phone (2) launch",
    "Here's the OnePlus folding phone expected for later this year",
    "Nothing raises $96 mn to expand product and technology portfolio: Details",
    "Nothing Closes $96M Financing Round to Scale Product and Technology Portfolio",
    "Nothing is coming for Apple with fresh funding and the Phone 2",
    "Nothing closes $96 million round ahead of Nothing Phone 2 launch: Here's what we know",
    "OpenAI brings the competition to DeepMind's doorstep with new London office",
    "OpenAI opens first international office in London",
    "OpenAI's first global office will be in London, the company says",
    "ChatGPT owner OpenAI to open first foreign office in UK",
    "Excited to announce OpenAI's first international expansion with a new office in London!  🇬🇧 🚀 …",
    "Announcing OpenAI London office: https://openai.com/...",
    "@danilo.redeem-tomorrow.com",
    "DoorDash, Shifting Business Model, Will Offer Drivers Hourly Pay",
    "Introducing DoorDash's Biggest App Updates in a Decade",
    "DoorDash updates to include a minimum hourly wage for drivers",
    "DoorDash introduces ‘Earn by Time’ option in select cities",
    "DoorDash introduces a slew of new features, including an ‘Earn by Time’ option for delivery people",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "DoorDash Workers Can Finally Get Paid Hourly, But Only During Deliveries",
    "Why Some Artists Boycott Venues That Use Facial-Recognition Tech",
    "the new season of black mirror just dropped a new episode https://www.nytimes.com/...",
    "🎉 Announcing Slang.ai's $20M in funding",
    "Slang.ai Raises $20M in Series A Funding Led by Homebrew",
    "Slang taps AI to answer phone calls for brick-and-mortar businesses",
    "Slang.ai Closes $20 Million Led By Homebrew to Empower Restaurants and Retailers with Voice AI",
    "Generative AI Voice Startup Slang.ai Raises $20M to Answer Phones at Restaurants and Retailers",
    "Slang.ai raises $20M to bring the power of voice AI to retailers and restaurants",
    "Siemens Energy confirms data breach after MOVEit data-theft attack",
    "Extortion Group Clop's MOVEit Attacks Hit Over 130 Victims",
    "Extortion Group Clop's MOVEit Attacks Hit 108 Victims",
    "Two major energy corporations added to growing MOVEit victim list",
    "UCLA, Siemens Among Latest Victims of Relentless MOVEit Attacks",
    "UCLA, Siemens Energy latest MOVEit victims to confirm breaches",
    "Casualties keep growing in this month's mass exploitation of MOVEit 0-day",
    "Visa Buys Brazilian Fintech Pimso for $1 Billion",
    "Visa to acquire Brazilian fintech Pismo for $1 billion in cash",
    "Free Figma template of onboarding & activation designs",
    "Australian Financial Review",
    "Biden Administration Weighs Further Curbs on Sales of A.I. Chips to China",
    "Chinese Internet Stocks Slip on Report U.S. to Tighten AI Chip Exports",
    "US mulls new export restriction on computing power in AI chips",
    "For Nvidia and China, an AI Battle With Washington Bodes Ill",
    "Nasdaq slides after big gain as Nvidia shares decline: Live updates",
    "Congress must use budget power to move tech firms out of Beijing's orbit, former lawmaker says",
    "US is planning new AI chip export controls aimed at Nvidia",
    "US weighs further restrictions on chip exports to China",
    "Chip stocks drop as U.S. mulls fresh curbs on AI access to China",
    "US weighs tougher restrictions on AI chip exports to China",
    "Nvidia and AMD shares fall on report of new U.S. ban on AI chip exports to China",
    "US Mulls Even Tighter Restrictions to Stop AI Chips From Reaching China",
    "Nvidia downplays possible U.S. chip export restrictions",
    "Nvidia Drops on Report US Plans More AI Chip Curbs for China",
    "Stocks Making the Biggest Moves Midday: Pinterest, Carnival, General Mills, Netflix and More",
    "Nvidia's Chips Fuel A.I. — Here's Why the U.S. Worries About China's Access",
    "Semiconductor industry sees stocks fall with possible new China export restrictions",
    "US mulls tightening ban on AI chips to China",
    "Nvidia and AMD shares fall as US considers tightening restrictions on AI chip exports to China",
    "U.S.-China AI Race Heats Up as Washington Mulls New Chip Restrictions",
    "U.S. Considers New Restrictions for AI Chip Exports to China",
    "Possible U.S. Curbs On AI Chip Exports To China Roil Semiconductor Stocks, Nvidia Falls",
    "U.S. considers curbs on AI chip exports to China",
    "China's AI firms might further lose chip access in new US ban",
    "U.S. Mulls New Restrictions on AI Chip Exports to China",
    "Biden may restrict AI chip exports to China, impact Nvidia",
    "US to impose new regulations limiting AI chip exports to China: report",
    "European Markets Expected to Open Higher After Tentatively Breaking Losing Streak",
    "These Stocks Are Moving the Most Today: Nvidia, AMD, AeroVironment, Micron, and More",
    "This is obviously why we need to build Skynet first. https://twitter.com/...",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "How much money Instagram influencers make",
    "What Shein Influencer Backlash Can Teach Us About Taking On Opportunities",
    "Shein's charm offensive is off to a rocky start",
    "Shein sent American influencers to China. Social media users are furious",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "How Shein's influencer trip to a Chinese factory backfired",
    "What Are Social Media Influencers (and Why Does Everyone Want to Become One)",
    "Shein exploited marginalized women for their influencer trip. It worked.",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "what the hell is a confidence activist [image]",
    "Databricks AI Assistant Offers ‘Cemented’ Business Knowledge",
    "Databricks reinforces commitment to truly open data lakehouses with Delta Lake 3.0",
    "Snowflake and Databricks are putting the data stored in their services to work",
    "Databricks Offers Data Unity Option With New Delta Lake Release",
    "Databricks Data + AI Summit 2023 Keynote Recap: LakehouseIQ, Delta Lake 3.0, and More!",
    "Databricks Introduces New Generative AI Tools, Investing in Lakehouse AI",
    "Databricks Unveils Lakehouse AI - A Platform For Building Generative AI Models",
    "Databricks Unleashes New Tools for Gen AI in the Lakehouse",
    "Leveraging Data in Snowflake and Databricks for Optimal Results",
    "What is Delta Lake in Databricks?",
    "Introducing Lakehouse Federation Capabilities in Unity Catalog",
    "Databricks rolls out AI assistant to help analyze business data",
    "Databricks Delta Lake 3.0 to counter Apache Iceberg tables",
    "Databricks adds federation, generative AI front end and development tools to its lakehouse",
    "What's new with Unity Catalog at Data and AI Summit 2023",
    "Databricks Data + AI Summit: LakehouseIQ, Lakehouse AI and everything announced",
    "Introducing LakehouseIQ: The AI-Powered Engine that Uniquely Understands your Business",
    "Introducing Materialized Views and Streaming Tables for Databricks SQL",
    "What's New with Data Sharing and Collaboration on the Lakehouse",
    "Databricks builds a data mesh with the launch of Lakehouse Federation",
    "Snowflake, Databricks set to collide over AI",
    "Databricks continues generative AI push, launches LakehouseIQ, Lakehouse AI tools",
    "Lakehouse AI: a data-centric approach to building Generative AI applications",
    "Databricks' Delta Lake 3.0 bridges compatibility gaps with Apache Iceberg and Hudi",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Lightmatter: Next-gen computing built for AI.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/28 - Who Needs A Mac Pro?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "TuSimple prepares to exit US autonomous trucking market",
    "TuSimple may sell US business as it turns attention to Asia",
    "Astrix Security Raises $25M in Series A Funding",
    "Astrix Security Raises $25M to Protect Nonhuman Identities",
    "Astrix Raises $25 Million to Help Enterprises Secure App-to-App Connections",
    "Astrix Security garners $25m Series A to enhance non-human identity security",
    "Astrix Security raises $25 million to further secure non-human identities",
    "We Raised A Bunch Of Money",
    "Fly.io Raises $70M in Series C Funding",
    "Fly.io raises $70M to help developers launch apps closer to users",
    "On EQT Ventures' investment in Fly.io, a new public cloud for developers",
    "Y Combinator sees huge jump in AI-focused start-ups",
    "One-third of new Y Combinator startups focused on AI, CEO says",
    "Major League Baseball scouts use two iPhones and AI to identify player potential",
    "Baseball Scouts Use iPhones and AI to Evaluate Skills and Predict Injuries",
    "AI could help pick Major League Baseball's next big star",
    "Companies with the most PoS agents in Nigeria - Report",
    "Roblox Trying To Describe Adult Poop Is Very Funny",
    "What Roblox wants to build next with CEO David Baszucki | Decoder",
    "Databricks scoops up more of the new AI data stack",
    "Singaporean ex-Googler's startup raises $58m for enterprise AI endeavor",
    "Announcing our $58M funding to Build Generative Models and Advance AI Research",
    "AI model startup Reka raises $50 million led by DST Global Partners",
    "Generative AI startup Reka emerges from stealth with $58 million in its pocket",
    "@ravirockks@infosec.exchange",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Augmedics closes $82.5M Series D, marks 4,000 U.S. patients treated with Xvision",
    "Augmedics raises $82.5 million to accelerate adoption of augmented reality spine surgery",
    "Augmedics Raises $82.5 Million to Boost Adoption of Augmented Reality Spine Surgery",
    "Augmedics gets $82.5 million in funding round for AR spinal surgery tool",
    "Augmedics Raises $82.5M for Augmented Reality Spine Surgery Platform",
    "Augmedics Raises $82.5M in Series D Funding",
    "Augmedics raises $82.5 million amid Series D decline",
    "Data act: Council and Parliament strike a deal on fair access to and use of data",
    "EU law would let iCloud users transfer their data to rival platforms",
    "Moving data from iCloud may need to be made easier under upcoming EU law",
    "EU advances rules for giving users more control over their device data",
    "Data transfer from iCloud, to other services, could be streamlined by EU's Data Act",
    "EU advances rules that wrestle control of user data away from Big Tech",
    "European Union advances its Data Act despite crypto community backlash",
    "Data Act: Commission welcomes political agreement on rules for a fair and innovative data economy",
    "New EU Law, If Passed, Would Let iCloud Users Transfer Their Data Across Multiple Services",
    "EU strikes deal to give users more control over data",
    "EU lawmakers agree to make non-consensual sex a criminal offense",
    "EU data act adopts smart contract kill switch regulations",
    "Crypto: EU Moves Ahead With Disputed Smart Contract Kill-Switch",
    "EU a step closer to Data Act that will take on Big Tech",
    "EU reach data rule deal targeting Big Tech",
    "EU's Controversial Smart Contract Kill-Switch Rules Finalized by Negotiators",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "EU countries, lawmakers reach data rule deal targeting Big Tech",
    "ChatGPT can now access the internet on mobile. Here's how",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT iOS App Adds Microsoft Bing Integration",
    "ChatGPT Plus Subscribers Can Now Surf the Web Via Bing",
    "ChatGPT Gains Bing Support On iOS But You'll Have To Pay For It",
    "ChatGPT app on iOS now allows users to access information from the web: Here's how to use it",
    "ChatGPT iOS app now supports “Browse with Bing” feature",
    "ChatGPT iOS app gets Bing integration to access data beyond its cutoff date",
    "ChatGPT on iOS adds support for Bing, but locks it behind a subscription",
    "Google reportedly gives up on making AR glasses—for the third time",
    "Apple Glasses won't face competition from Google Iris smart glasses",
    "Google Kills ‘Project Iris’ Augmented Reality Glasses Project",
    "Google Has Reportedly Killed its ‘Iris’ AR Glasses Project",
    "Google refocuses AR strategy after ‘Iris’ shutdown",
    "Google reportedly ends ‘Iris’ augmented reality glasses project",
    "Apple Vision Pro is so good, Google trashed its next-gen Iris Glasses",
    "Google Abandons Augmented Reality Glasses Project Iris to Focus on AR Software",
    "Google canceled its Apple Vision Pro rival that might have been even better",
    "Google has apparently killed its AR glasses - and that's good news for Apple",
    "Google's “Project Iris” goes to the graveyard",
    "Google reportedly cans AR glasses hardware project",
    "Google won't be rivalling Apple Vision Pro as it scraps plans for Iris AR glasses",
    "Iris is the latest Google AR/VR project headed for the graveyard",
    "Google ditching its plan to make AR glasses really doesn't matter: here's why",
    "Google kills off its Apple Vision Pro competitor",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Google is no longer building its own augmented reality glasses",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google's next-gen AR glasses join the Google graveyard",
    "Google kills off the latest iteration of its AR glasses",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Looks like Google might have canceled its new AR glasses",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project",
    "TikTok Bankrolls Influencers' Lawsuit Against Montana Ban",
    "TikTok invites creators to make ads for marketers in new pilot",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok funds lawsuit by Montana users challenging statewide ban",
    "TikTok updates: Creative Challenge, Youth Council, Montana lawsuit...",
    "TikTok connects brands to user-generated ads with new feature",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok Launches ‘Creative Challenge’ to Provide More Income Opportunities for Creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "Instagram tests feature to block explicit images in direct message requests",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram might make it harder for you to send an unsolicited dick pic",
    "Instagram and Messenger get more parental supervision tools",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Both TikTok and Meta introduce new parental controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Meta Announces New Teen Safety Tools, Including Updated Parental Oversight and Messaging Controls",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Facebook Messenger launches “parental control” mode",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Meta is giving parents more visibility into who their teens are messaging on social media",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Facebook adds parental control tools to Messenger",
    "Meta launches parental controls for Messenger. Here's how to use them."
]