[
    "International Business Times",
    "Over $35 Million Lost in Atomic Wallet Attack as Exploit Investigation Continues",
    "Atomic Wallet Users Hacked for $35M Worth of Bitcoin, Ether, Tether and Other Tokens",
    "Atomic Wallet hack losses top $35M, on-chain sleuth reports",
    "Atomic Wallet Alerts Users Of Ongoing Exploit; Victims Claim Complete Loss Of Crypto Portfolios",
    "Atomic Wallet Reportedly Hacked: $35M in Crypto Assets Vanish",
    "Atomic Wallet Security Breach Results In $35 Million Crypto Heist",
    "Atomic Wallet Hacked: Largest Victim Reportedly Lost 2.8M USDT",
    "Atomic Wallet Hack: Decentralized Finance Wallet Breached, Millions Lost in Attack",
    "Atomic Wallet users lose $35 million in crypto assets in security breach: Report",
    "Atomic Wallet hacks total over $35 million",
    "Scam Alert: Atomic Wallet Calls for Caution as it Investigates Ongoing Compromise",
    "Atomic Wallet Hack Causes Over $35M in Losses",
    "Atomic Wallet hacked, users lose millions in crypto",
    "Breaking - Atomic Wallet Hacked, Crypto Analyst ZachXBT Investigates",
    "On Setting the Record Straight",
    "Stability AI Founder Overstated Startup Strength, Report Says",
    "Good time to remember there are two sides to every story This is Emad's https://twitter.com/...",
    "This is the most beautiful pivot to AI I have ever seen https://twitter.com/...",
    "Twitter co-founder Jack Dorsey endorses Robert F. Kennedy, Jr. in 2024 presidential race",
    "Instagram reinstates Robert F. Kennedy Jr.'s account",
    "Instagram reinstates Robert F. Kennedy Jr. amid presidential bid launch - WaPo",
    "Zuck Loves Biden: Facebook Prevents RFK Jr. from Launching Instagram Campaign Account",
    "RFK Jr. Says He Will Join Elon Musk For Twitter Interview After Being Banned From Instagram",
    "Elon Musk Invites Robert Kennedy Jr. for Twitter Spaces Interview",
    "*years long headache forms*",
    "Sony CEO Hands Microsoft a Golden Assist by Downplaying Cloud Gaming Importance",
    "Sony's CEO admits that cloud gaming is still “very tricky” technically",
    "Sony CEO warns technical issues still remain for cloud gaming",
    "Sony: Cloud Gaming Is an Amazing Business Model, But There Are Big Challenges",
    "PlayStation Boss Says Cloud Gaming Has Too Many Technical Difficulties",
    "Cloud Gaming Has Promise, but Still Has a Lot of “Technical Difficulties”, Says Sony CEO",
    "Sony may use proprietary AI to augment PlayStation cloud gaming",
    "Sony CEO Says Significant Barriers to Cloud Gaming Remain: FT",
    "Sony chief plays down threat to consoles from cloud gaming https://www.ft.com/...",
    "holymoly this is good! https://twitter.com/...",
    "TSMC Arizona job hiring hurt by ‘brutal’ culture",
    "ISS U.S. National Laboratory",
    "CTF in space: hackable satellite set to launch",
    "US Space Force plans to launch its own cybersecurity satellite this week",
    "World's 1st ‘hacking sandbox’ satellite and more to ride on SpaceX's next NASA cargo launch",
    "Moonlighter space-hacking satellite readies for launch https://www.theregister.com/ ...",
    "@dcseifert@mastodon.social",
    "What is Telly and is there a catch with its free 55-inch 4K TV?",
    "everything about this sounds absolutely awful https://www.theverge.com/...",
    "Personalized wealth management, built for tech people",
    "Dollar-Based Stablecoins to Strengthen Greenback, CZ Says, Thinks DeSantis ‘Is Great’",
    "Binance Looking for the Next Heir to CZ Amid Regulatory Woes | Coingape",
    "The Google Pixel Watch is randomly popping open for some",
    "Users report their Pixel Watch backplates randomly falling off",
    "Google Pixel Watch backplate coming undone for some users",
    "Google Pixel Watch Owners Report Issue With Backplate Falling Off",
    "Some Pixel Watch owners are reporting backplates falling off",
    "Some Pixel Watch owners are seeing the back panel fall off without clear cause",
    "Oof, some Pixel Watch units are randomly popping open (Update: Google statement)",
    "Google Pixel Watch's back is falling off and causing major frustrations",
    "Some Google Pixel Watch Units Are Falling Apart on Their Own",
    "Our Teardown Engineer's Favorite Pixel Watch Feature: Mystery Adhesive",
    "Pixel devices and random hardware issues go hand in hand https://www.androidpolice.com/ ...",
    "The legal case for Montana's TikTok ban",
    "TikTok code being worked on from China prompts fresh alarm",
    "Free compensation benchmarking data from 3,000 startups",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Hubble Network Targets Bluetooth-Enabled Satellite Network with $20M Series A",
    "Hubble Network Raises $20M in Series A Funding",
    "Swing Education Raises $38 Million in Series C Funding",
    "Swing Education Completes $38 Million In Series C To Connect Schools And Substitute Teachers",
    "Swing Education Raises $38M in Series C Funding",
    "Android Update To Introduce Digital ID Wallets",
    "Google Wallet Now Saves Passes, Tickets and Driver's License ID",
    "Google Wallet's latest update lets you save more than just your money",
    "Big things in digital identity https://arstechnica.com/...",
    "@kentborg@social.tchncs.de",
    "@Techmeme Sounds like a blessing, other languages being less attacked by LLMs.",
    "Money stored in Venmo and other payment apps could be vulnerable, financial watchdog warns",
    "Consumer Financial Protection Bureau",
    "Analysis of Deposit Insurance Coverage on Funds Stored Through Payment Apps",
    "U.S. financial agency says if you have money in PayPal or Venmo, get it out now",
    "Money stored on apps like PayPal and Venmo could be at risk, feds warn",
    "Don't store money in Venmo, Cash App or PayPal, regulator says",
    "Federal Watchdog: Move Cash Out of CashApp, PayPal, Venmo or Risk Losing It",
    "Don't Store Your Money on Venmo, U.S. Govt Agency Warns",
    "I feel pretty good about my $ in Apple Cash.",
    "Meta Is Trying, and Failing, to Crush Unions in Kenya",
    "Kenyan court declares Meta as the primary employer in its lawsuit",
    "Court blocks sacking of content moderators, holds Meta liable",
    "Kenyan Court Halts Mass Layoff of Facebook Moderators, Orders Support and Care",
    "Meta blocked from firing content moderators",
    "Kenya court orders suspension of mass layoff of Facebook moderators",
    "Apple is expected to unveil a sleek, pricey headset. Is it the device VR has been looking for?",
    "Augmented reality needs an iPhone moment",
    "Apple's mixed reality headset is a make-or-break moment for VR and AR",
    "If Apple wants its headset to win, it needs to reinvent the app",
    "Virtual Reality Industry Excitement Said to Hit ‘Fever Pitch’ Ahead of Apple Launch",
    "This could be Apple's biggest product launch since the Apple Watch",
    "What our primate relatives can teach us about our own genomes",
    "Hundreds of new primate genomes offer window into human health—and our past",
    "AI trained on ape DNA predicts genetic disease risks for humans",
    "YouTube reverses its election misinformation policy",
    "YouTube now allows videos that falsely claim Trump won 2020 election",
    "YouTube will stop removing false claims of 2020 US election fraud",
    "YouTube rolls back its rules against election misinformation",
    "An update on our approach to US election misinformation",
    "YouTube to stop deleting false claims about 2020 election",
    "YouTube faces backlash as it halts removal of false claims about 2020 US Presidential election",
    "YouTube will stop removing false presidential election fraud claims",
    "After Ban, YouTube Will Allow Videos That Back 2020 Election Fraud Claims",
    "YouTube will no longer take down false claims about U.S. elections",
    "YouTube Revises Its U.S. Election Misinformation Policy Amid Election Season",
    "YouTube says it will stop removing false claims about past elections",
    "YouTube reverses course, will not take down controversial or disproven political content",
    "YouTube will stop removing false claims about 2020 election fraud",
    "YouTube changes policy to allow false claims about past U.S. presidential elections",
    "YouTube reverses policy, will allow election denial"
]