[
    "@dangillmor@mastodon.social",
    "Popular Android TV boxes sold on Amazon are laced with malware",
    "Lemon Group's Cybercriminal Businesses Built on Preinfected Devices",
    "Millions of Android Phones and TVs May Come with Preinstalled Malware",
    "Guerrilla malware is preinfected on 8.9 million Android devices, Trend Micro says",
    "Android TV boxes found preloaded with malware — what's going on?",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "China bans Micron's products from key infrastructure over security risk",
    "China bans major chip maker Micron from key infrastructure projects",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "China bans Micron chips in key infrastructure over ‘national security’ risks",
    "China says Micron's products fail security review, bars some purchases",
    "China bans shipments from U.S. memory chipmaker Micron Technology",
    "Chinese agency claims U.S. chipmaker Micron poses national security risk",
    "China Goes Ahead with Micron Technology Sales Ban",
    "China Bans Some Sales of Chips From U.S. Company Micron",
    "China bans Micron products after security review finds unspecified flaws",
    "China Orders Halt To Using Micron Chips Claiming Security Concerns In Rising Tech War",
    "China Bans Micron Chips in Wake of Cybersecurity Review",
    "China Tells Tech Manufacturers: Stop Using US-Made Micron Chips",
    "China Limits Use Of Chips From US-Based Micron Over Security Concerns",
    "China Bars Purchases of Micron Chips, Escalating US Conflict",
    "China Partially Bars Micron Chips, Stepping Up Feud with United States",
    "China says US chip maker Micron failed security review",
    "@0x00string@infosec.exchange",
    "@JoeUchill@mastodon.social",
    "@santim@social.vivaldi.net",
    "@chrismessina@mastodon.xyz",
    "Neeva, the would-be Google competitor, is shutting down its search engine",
    "Google challenger Neeva gives up on consumer search, goes all in on AI and the enterprise",
    "Google search competitor Neeva shuts down to focus on enterprise",
    "Who Can Beat Google in the Search Game? It Won't Be Neeva",
    "Neeva's ad-free, subscription-based search engine is shutting down",
    "Neeva shuts down its search engine to focus on AI products",
    "Google Challenger Neeva Focuses on AI With ‘No Path’ for Consumer Search",
    "Google search rival Neeva is shutting down its search engine to work on AI products",
    "Neeva, The Ad-Free Search Engine, Announces Closure",
    "Neeva Shut Downs its Search Engine",
    "Neeva Shuts Down Search Engine Ahead of Snowflake Deal",
    "It takes a lot to switch user behavior https://www.theverge.com/...",
    "LLMs are a bigger opportunity for startups than search https://twitter.com/...",
    "Meta Looks to Launch AR Partnership With Magic Leap",
    "Meta reportedly wants to license Magic Leap's AR technology",
    "Meta And Magic Leap Reportedly In Talks Over AR Tech As Apple Headset Nears",
    "Meta reportedly in talks with Magic Leap for IP licensing and manufacturing",
    "Meta in Negotiations with Magic Leap: A Leap Towards Building the Metaverse",
    "Meta in Talks With Magic Leap Over AR Deal",
    "An overview of the executive team behind Apple's upcoming mixed reality headset",
    "Australian Financial Review",
    "Report: Apple to start selling Ted Lasso merch through the Apple online store",
    "‘Ted Lasso’ merch set to land in online Apple Store in June",
    "Apple's VR headset will change the world when the price is right",
    "Exclusive ‘Ted Lasso’ merch coming to Apple Store Online",
    "Ted Lasso merch could be coming to the Apple Online Store soon",
    "Apple's online store will soon offer you Ted Lasso “merch”",
    "Nearly every Apple top exec is working on the AR headset",
    "Apple Reality Pro AR Headset: Eye-Watering Price And Brilliant Unique Feature Leaked In New Report",
    "Apple's big WWDC 2023 launch may include MR headset, new MacBook Air",
    "Apple Reality Pro headset: Everything we know about Apple's AR/VR headset",
    "Dear Apple, this is what we want from the Reality Pro headset",
    "For passengers on the left side of the plane, a view of $DIS frontier https://twitter.com/...",
    "Bitcoin Blockchain Continues to See Growth in Ordinal Inscriptions and BRC20 Tokens",
    "Bitcoin Ordinals fees surged by 700% since April",
    "Bitcoin Ordinals' total mintage fees increase 700% from April: Report",
    "Meme Tokens and NFTs Took Over Bitcoin—Now It's Happening on Dogecoin and Litecoin",
    "Bitcoin's Price Faces Bleak Outlook as Selling Pressure from Miners Surge",
    "Tornado Cash DAO Attacker Proposes Restoring Governance Control",
    "Tornado Cash's TORN Token Up 10% as Attacker Submits Proposal to Undo Attack",
    "Tornado Cash DAO suffers hostile takeover",
    "Ethereum Transaction Hash (Txhash) Details | Etherscan",
    "Top Crypto Gainers & Losers Today - Tornado Cash Crash, Pepe Price Bounces",
    "Tornado Cash attacker creates proposal that could restore governance",
    "Tornado Cash suffers governance hijack",
    "Hackers Exploit Sanctioned Crypto Mixer Tornado Cash, Unleashing Chaos",
    "TORN price dumps 50% after attacker takes over Tornado Cash DAO",
    "Tornado Cash (TORN) Suffers 27% Drop As Hackers Strike",
    "Malicious Proposal Exploits Tornado Cash Governance",
    "Attacker uses malicious proposal to take over Tornado Cash governance",
    "Attacker hijacks Tornado Cash governance via malicious proposal",
    "Breaking: Tornado Cash Suffers Governance Attack, TORN Price Tumbles 50% | Coingape",
    "The esports world is starting to teeter",
    "Reported offers for TSM's LCS slot fall well short of league's record sale price",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Hidden crypto holdings turn divorce battles into high-stakes cases, attorneys warn",
    "Crypto hunter busts husband's $500k BTC hideout in divorce",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "(IHP) Amazon's First Employee Shel Kaphan",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "How US Universities Hope to Build a New Semiconductor Workforce",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Private debt delivers calm waters in storm of volatility",
    "FBI misused surveillance tool on Jan. 6 suspects, BLM arrestees and others",
    "FBI misused intelligence database in 278,000 searches, court says",
    "The FBI just got caught in yet more massive, outrageous FISA abuses",
    "The FBI Broke The Law Over 278,000 Times With Illegal Searches On Americans",
    "FBI Searched Jan. 6 Rioters and George Floyd Demonstrators in Spy Database",
    "FBI repeatedly misused surveillance tool, unsealed FISA order reveals",
    "POV: The FBI will keep abusing personal data until we end Section 702",
    "FBI misused controversial surveillance tool to investigate Jan. 6 protesters",
    "Gee they would never break the law would they? They do, every day. https://twitter.com/...",
    "Mistakes were made — 278,000 times. https://twitter.com/...",
    "Bitcoin Payments: Strike Introduces Global Money App in Over 65 Countries",
    "Strike Goes Global Adding USDt Support and Enhanced App Unveiled at Bitcoin 2023 Conference",
    "Strike Relocates Global Headquarters To El Salvador, Expands Presence To 65 Countries",
    "Strike Expands Services To 65 Global Markets, Moves Headquarters To El Salvador",
    "Strike moves global headquarters to El Salvador, expands bitcoin payments to 65 countries",
    "Bitcoin Payments App Strike Expands to More Than 65 Countries From Three",
    "Strike moves global headquarters to El Salvador, expands to 65 countries",
    "Bitcoin Wallet Strike Expands Support to 3 Billion People, Targets Global South",
    "Max Keiser Says XRP And All Cryptocurrencies Are Securities, Except For Bitcoin — Here's Why",
    "G7 Hiroshima Leaders' Communiqué",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 Countries Seek ‘Common Vision’ for AI",
    "G7 leaders unite to regulate generative AI globally under the ‘Hiroshima Process’",
    "G7 countries call to have global technical standards for AI",
    "G7 calls for ‘responsible’ use of generative AI",
    "Dennis Duffy was ahead of his time. https://www.wsj.com/...",
    "COMMENTS OF AT&T  —  Before the FEDERAL COMMUNICATIONS COMMISSION Washington …",
    "FCC Gives SpaceX Starlink A Major Win Against Dish Network",
    "AT&T files with the FCC seeking to put the kibosh on T-Mobile's satellite-to-cellular plan",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "AT&T has some concerns about Starlink and T-Mobile's satellite-to-cellular plans",
    "AT&T Asks FCC to Block T-Mobile From Expanding Network With SpaceX Satellites",
    "A New Kind of Space Race: Companies Vie Over Market For Satellite-Enabled Phone Calls",
    "Microsoft's Acquisition of Activision Blizzard Has Been Approved in China",
    "Microsoft Gains China's Approval to Acquire Activision Blizzard amid Ongoing Antitrust Scrutiny",
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "Microsoft says China approves its plan to buy video game-maker Activision Blizzard",
    "China's antitrust committee joins Microsoft's growing list of Activision approvals",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "China approves Xbox acquisition of Activision Blizzard as pressure builds on CMA",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard"
]