[
    "@profcarroll@federate.social",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Google's Online Advertising Practices Violate Antitrust Laws, E.U. Says",
    "Today's European Commission announcement about our advertising technology",
    "EU charges Google with anti-competitive practices in ad tech business",
    "Google risks forced breakup of ad business as EU alleges shocking misconduct",
    "EU regulator orders Google to sell part of ad-tech business",
    "Google gets EU antitrust charges on ad tech business",
    "EU Seeks Breakup of Google's Adtech Business",
    "EU Hits Google With Antitrust Complain Over its Ad Tech Business",
    "The European Union threatens to break up Google's ad business",
    "Google should break up digital ad business over competition concerns, European regulators say",
    "Europe seeks breakup of Google ad business, adding to antitrust woes",
    "Google should break up digital ad business over antitrust concerns: EU regulator",
    "EU targets Google's ad business",
    "Google may be forced to break up its ad business after EU charges",
    "EPC welcomes SO against Google issued today by the European Commission",
    "European Commission has accused Google of violating anti-trust laws",
    "EU suggests breaking up Google's display ad business over antitrust concerns",
    "European Commission could move to break up Google's ad empire",
    "Google's ads business violates antitrust laws, should break up, EU says",
    "The EU wants to break up Google's ad business",
    "European Commission says Google is partaking in ‘abusive’ ad tech practices",
    "EU Commission: Google must break up its ad business or face a massive fine",
    "EU hits Google with fresh charges over ad technology",
    "Europe teases breaking up Google over ad monopoly",
    "Google Ad business faces breakup after being charged with EU antitrust violations",
    "Google/EC: regulators' current zeal is a function of past failures",
    "Google's ads business under threat from EU Commission",
    "European Commission: Google Must Divest Part of Its Display-Ads Business",
    "European Commission files antitrust complaint against Google's ad business",
    "Europe May Seek Breakup Of Google Digital Advertising Business",
    "The EU Wants to Break Up Google's Biggest Business",
    "European Commission says it may want to break up Google's ad-tech business",
    "EU slaps Google with antitrust charges over ad tech policies",
    "The EU is going after Google's bread and butter",
    "EU officials accuse Google of antitrust violations in its ad tech business",
    "EU orders Google break up digital ad business for ‘abusing dominant position’",
    "Google Ad Business Accused of Breaking EU Antitrust Laws",
    "Google's Ad Tech Dominance Sparks Breakup Threat From EU",
    "Brussels ramps up Google antitrust case with break-up threat",
    "EU Says It Might Seek Breakup of Google's Ad-Tech Business",
    "EU proposes breaking up Google over anti-competition concerns",
    "Google Faces Breakup of Ads Business Over EU Antitrust Concerns",
    "The EU is determined to crush Silicon Valley. https://twitter.com/...",
    "Google response to ⁦@EU_Competition⁩ antitrust charges today. [image]",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling - The Verge",
    "8 ways Google Lens can help make your life easier",
    "Google Lens can now search for skin conditions",
    "Google Lens Now Lets You Search for a Skin Condition. Here's How",
    "Google Lens can tell you what skin condition you have",
    "What's wrong with your skin? Ask Dr. Google Lens",
    "Google Lens makes it easy to search about skin conditions",
    "Google Lens will soon work with Bard, will also be able to identify skin conditions like rashes",
    "Google Lens, Bard, Search AI, and online shopping just got new AI features",
    "Google announces big AI upgrades — including identifying skin conditions",
    "Google Lens is Here to Identify Your Skin Rash",
    "Google Lens Can Now Search Skin Conditions With Just a Photo",
    "Google Lens now uses AI to help you identify that weird rash",
    "Google Lens can identify skin conditions and is coming soon to Bard",
    "Virtually try on clothes with a new AI shopping feature",
    "Google's New AI Tool Is About to Make Online Shopping Even Easier",
    "Google Is Weaving Generative AI Into Online Shopping Features",
    "Google Claims Its AI Can Guess How a Shirt Will Fit on Every Body Type",
    "New Google Shopping feature uses AI to model clothing on different body types",
    "Google Shopping AI feature could abolish changing rooms",
    "Let Google AI try on clothes for you with this new tool",
    "Google Try-On Leverages the Power of Generative AI to Let You Preview Clothes",
    "Google Is Using AI to Show How Clothes Look on Real People Before You Buy",
    "Google Unveils AI-Powered Virtual Try-On for a Tailored Online Shopping Experience",
    "With AI, Google Can Now Shows How Clothes Fit on Different Models",
    "From virtual shopping to skin condition scanning: Google unveils new AI-powered features",
    "Google Debuts AI-Powered Virtual Try-on Tool",
    "Twitter Hit With $250M Lawsuit From Music Publishers Over “Massive Copyright Infringement” Claim",
    "Music publishers sue Twitter for $250m+ alleging ‘rampant infringement of copyrighted music’",
    "Music publishers sue Twitter for allowing copyrighted songs",
    "Twitter Faces Legal Battle Over Copyright Infringement",
    "Music Publishers Sue Twitter, Accusing It of Copyright Infringement",
    "Twitter Hit With $250 Million Copyright-Infringement Lawsuit From Music Publishers",
    "Who's Headed to VidCon Next Week",
    "Twitter Sued By Music Publishers For Copyright Infringement",
    "17 music publishers sue Twitter, alleging infringement",
    "Music publishers file lawsuit against Twitter for alleged copyright infringement",
    "Twitter Hit With $250 Million Lawsuit Over Alleged Music Copyright Violations",
    "NMPA Sues Twitter for $250 Million in Copyright Lawsuit for Music Publishers",
    "Preparing for more, annoying DMCA takedowns... https://www.wsj.com/...",
    "Australian Financial Review",
    "MEPs ready to negotiate first-ever rules for safe and transparent AI",
    "Europe moves ahead on AI regulation, challenging tech giants' power",
    "EU Lawmakers Vote to Restrict AI Use, Ban Public Face-Scanning",
    "Europe challenges tech giants' power with new AI laws",
    "Europe takes another big step toward agreeing an AI rulebook",
    "Europe plans to put guardrails on ChatGPT and other AI apps",
    "EU lawmakers pass landmark artificial intelligence regulation",
    "EU takes major step toward AI regulation as the AI Act moves into final phase",
    "E.U. Takes a Step Closer to Passing the World's Most Comprehensive AI Regulation",
    "Digital euro proposal set for debate as EU advances AI restrictions legislation",
    "AI Regulation Is Here.  Almost.",
    "EU Parliament approves strengthened protections for consumers on AI",
    "EU Lawmakers Pass Landmark AI Regulation Bill",
    "AI Regulation in Europe Gets Closer to a Final Vote",
    "Europe's A.I. Act enters the final stretch",
    "EU Gets Big Step Closer to Novel AI Regulations",
    "EU Parliament published its final position on the AI Act",
    "Everything You Need to Know About the EU's Game-Changing AI Legislation",
    "When generative AI lies, who is liable?",
    "European Parliament adopts AI Act position",
    "EU lawmakers approve tougher rules as AI Act moves closer to becoming law",
    "European Union AI Act passes in parliament",
    "EU Parliament approves AI Act, moving it closer to becoming law",
    "EU lawmakers vote for landmark Artificial Intelligence regulation",
    "The Who, Where, and How of Regulating AI  —  During the past year, perhaps the only thing …",
    "EU moves ahead with draft law to regulate AI",
    "European lawmakers vote to adopt EU AI Act",
    "European Parliament Preps AI Regulation Targeting Apps Like ChatGPT",
    "EU moves closer to passing one of world's first laws governing AI",
    "EU outlines rules aiming to make it clear when content has been generated by an AI",
    "Europe Moves Ahead on AI Regulation, Challenging Tech Giants' Power",
    "EU Approves Formation of Artificial Intelligence Act",
    "Europe passes landmark AI legislation by overwhelming majority",
    "Discrimination is a bigger AI risk than human extinction - EU commissioner",
    "Markets Await a Fed Pause — but Not an End to Rate Increases",
    "No shit https://twitter.com/...",
    "It's too late, we poisoned MTurk https://twitter.com/...",
    "“Rechanical Turk” https://www.techmeme.com/...",
    "There goes every MTurk study... https://twitter.com/...",
    "33-46% of workers on MTurk used LLMs in a text production task",
    "Samsung Brings Irregular Heart Rhythm Notification to Galaxy Watch in 13 Markets",
    "Samsung Galaxy Watch's Irregular Heartbeat Monitoring Feature Is Coming This Summer",
    "Galaxy Watch will now tell you your ticker's off with heart rate notifications",
    "Samsung Galaxy Watch will get irregular heart rate notifications this summer",
    "Samsung's Irregular Heart Rhythm Notification Feature Coming This Summer to 13 Markets",
    "This Apple Watch life-saving feature is finally coming to Samsung smartwatches",
    "Samsung's Galaxy Watch Is Picking Up A Key Health Feature Later This Year",
    "Breaking: Samsung confirms Galaxy Watch 6 will get AFib notifications",
    "Galaxy Watch Devices Getting Irregular Heart Rhythm Notification",
    "Galaxy Watches will get IHRN Health feature in 13 markets this summer",
    "Samsung details availability of important Galaxy Watch health feature",
    "Samsung Announces Galaxy Watch Irregular Heart Rhythm Notifications",
    "Samsung announces a new heart health tracking feature for Galaxy Watch users",
    "Samsung to release Galaxy Watch6 and Galaxy Watch6 Pro with AFib notification technology",
    "Fake Security Researcher GitHub Repositories Deliver Malicious Implant",
    "Hackers impersonate security analysts to advertise bogus zero day exploits laced with malware",
    "Someone is posing as a fake security company to create malicious GitHub repositories",
    "Attackers set up rogue GitHub repos with malware posing as zero-day exploits",
    "Malicious Actors Exploit GitHub to Distribute Fake Exploits",
    "Fake Researcher Profiles Spread Malware through GitHub Repositories as PoC Exploits",
    "This is the fake account @TwitterSafety https://twitter.com/... [image]",
    "Evidence for the utility of quantum computing before fault tolerance",
    "IBM's Latest Research Paper Signals A New Era Of Quantum Computing Is Here",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "IBM compensates for errors, gets usable results out of quantum processor",
    "New technique in error-prone quantum computing makes classical computers sweat",
    "Quantum Error Mitigation and the Path to Useful Quantum Computing",
    "IBM quantum computer beat a supercomputer in a head-to-head test",
    "What IBM's result means for quantum computing",
    "IBM Reports Accurate Quantum at 100+ Qubits",
    "It's a big day. https://www.nytimes.com/...",
    "5 key highlights of the SEC's lawsuit against Binance",
    "Now Binance Withdraws as Crypto Service Provider With Cyprus SEC",
    "Binance CEO Rejects Claims of Manipulating Market to Bolster Native Exchange Coin BNB",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "Binance's Cyprus unit seeks deregistration as crypto service provider",
    "Binance Seeks to Withdraw Cyprus' Unit Crypto Service Registration",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "Judge Postpones Asset Freeze as Binance US and SEC Agree to Work on Deal",
    "Judge Denies SEC's Request To Freeze Binance.US Assets, Calls For Collaborative Compromise",
    "Judge Tries To Broker A Compromise In SEC Versus Binance Case",
    "Binance.US and SEC Working on a Deal to Avoid Total Asset Freeze - Here's What You Need to Know",
    "Binance.US Assets Freeze: Judge Urges SEC to Allow Binance to Operate in the U.S.",
    "Binance.US agrees with SEC to avoid full asset freeze",
    "Binance.US and SEC Working to Avoid Asset Freeze",
    "SEC vs Binance: Judge Denies Restraining Order, Calls For Negotiation",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "Court wants Binance.US, SEC to avoid full asset freeze",
    "Binance.US Strives to Prevent Asset Freeze Through Negotiations with SEC",
    "Binance gets more time to protest US exchange asset freeze",
    "Breaking: US Federal Judge Rejects SEC's Request to Freeze Binance.US Funds",
    "How American courts have become central to crypto law",
    "The New Razer Blade 14 Is the Ultimate Portable Gaming Machine",
    "New Razer Blade 14 arrives with Ryzen 9 7940HS and RTX 4070",
    "One of the most ambitious gaming laptops just got even better",
    "You can now Buy Razer's Next-gen Blade 14 Laptop",
    "Razer refreshes Blade 14 with Ryzen 9, NVIDIA RTX 4070, and AMD Ryzen AI",
    "AMD's Hardware AI Ryzen ‘Phoenix’ CPUs Set to Soar in Razer's Blade 14 Laptop",
    "Razer Blade 14 laptop refresh features powerful Ryzen 9 and RTX 4070 chips",
    "Razer Blade 14 gets major upgrade with Ryzen 7000 and an Nvidia RTX 4070",
    "Razer's Blade 14 Promises Extremely Powerful Gaming Laptop With Fancy Chipsets",
    "Razer's new Blade 14 gaming laptop is extremely powerful, but there's a catch",
    "Razer Blade 14 gaming laptop now available with Ryzen 9 7940HS and up to RTX 4070",
    "Razer Blade 14 Laptop Refresh Packs AMD Ryzen 9 7940HS, Ryzen AI And RTX 40 Firepower",
    "Razer's Latest Blade 14 Cuts Deep With Ryzen 7940HS and RTX 4070 Muscle",
    "Razer debuts new Blade 14 with Ryzen 9 CPU and RTX 40 graphics",
    "Report: AWS considers diversifying its AI server offerings with AMD's new chips",
    "Silicon Valley Business Journal",
    "Amazon mulling use of AMD chips for AWS, eschews Nvida cloud system",
    "AWS is considering AMD's new AI chips",
    "Amazon eyes AMD's revolutionary AI chips",
    "Discover How AWS Designed Silicon Fuels Customer Outcomes at AWS Silicon Innovation Day",
    "AI chip race heats up as AMD introduces rival to Nvidia technology",
    "Stocks Making the Biggest Moves Midday: Logitech, Toyota, UnitedHealth, AMD & More",
    "AMD Aims To Take AI Chip Share From Nvidia With New Products",
    "AMD aims to dethrone Nvidia in the AI-chip wars",
    "AMD takes on Nvidia with MI300X AI GPU - could it land AWS as a client?",
    "AMD reveals new AI chip challenging Nvidia's dominance",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "AWS May Start Using AMD Chips",
    "AMD's New Chip Fails to Impress Investors. It's Still an AI Winner, Analyst Says.",
    "Cloud Division Of Amazon is Investing in AMD's New AI Chips",
    "AMD unveils new AI chip, targeting Nvidia's market lead",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "AWS is Considering AMD's New AI Chips",
    "Nobel laureate Maria Ressa says research by Oxford institute can be used against reporters",
    "Influencers overtaking journalists as news source: report",
    "The Digital News Landscape of 2023: Gen Z, TikTok, and the Decline of Traditional Media",
    "Worldwide, online news is looking a lot more like TikTok and a lot less like “shared articles”",
    "Fewer people trust traditional media, more turn to TikTok for news, report says",
    "20% of 18-to-24-year-olds use TikTok as a news source",
    "Using TikTok as a news source? Here are 3 ways to identify misinformation",
    "Sharp decline in appetite for news in recent years, Reuters Institute says",
    "Publishers enjoy a trust bump as more Australians take up digital subscriptions",
    "TikTok and Instagram influencers top list of trusted news sources for today's youth: report",
    "Leftwing audiences value ABC and SBS much more than rightwing viewers do, survey finds",
    "Social media eclipses publishers as entry point for news: But Facebook fading",
    "TikTok a growing source for news - but from influencers, not journalists",
    "More young people are using TikTok to access news, research finds",
    "Poor Mastodon https://reutersinstitute.politics.ox.ac .uk/ ... [image]",
    "The Reddit blackout has left Google barren and full of holes",
    "A popular Google search hack doesn't work because of the Reddit protests",
    "Google Aims To Improve Search Quality With New Feedback Form",
    "Parts of Reddit are staying dark.  Our search results may suffer for it.",
    "Free compensation benchmarking data from 3,000 startups",
    "Canva introduces new developer tools and $50M investment fund",
    "Canva Launches Developer Platform, Eyes Generative AI Apps",
    "Fernride nudges yard trucks toward full autonomy with $31M in new funds",
    "Munich-based FERNRIDE raises €29 million to solve autonomous trucking with human-assisted approach",
    "Senators Introduce Bill to Exempt AI from Section 230 Protections",
    "Senate bill would hold AI companies liable for harmful content",
    "US senators propose bill to eliminate Section 230 protection for AI companies",
    "AI Could Face New Rules in the EU to Address Risks to You",
    "Bipartisan U.S. bill would end Section 230 immunity for generative AI",
    "Bipartisan bill seeks to deny AI companies liability protections",
    "Personalized wealth management, built for tech people",
    "TechRadar ranks Zoho Recruit as 2023's best recruitment CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/14 - EU Threatens Google With A Breakup",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Cybersecurity and Infrastructure Security Agency",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "U.S. and International Partners Release Comprehensive Cyber Advisory on LockBit Ransomware",
    "LockBit victims in the US alone paid over $90m in ransoms since 2020",
    "CISA: LockBit behind 1 in 6 ransomware attacks on US gov't in 2022",
    "Understanding Ransomware Threat Actors: LockBit",
    "CISA, Partners Release LockBit Ransomware Cybersecurity Advisory",
    "Why the European Antitrust Case Against Google Might or Might Not Matter",
    "@dcseifert@mastodon.social",
    "The Best Tablets for Taking Notes for School and Work (Plus the Best Deals Right Now)",
    "Amazon Fire Max 11 Review: The Best Roblox Tablet On The Market Today",
    "Amazon Fire Max 11 review: I miss Google apps",
    "Amazon Fire Max 11 review: Easily the best Fire tablet yet",
    "Fire Max 11 Review: Amazon Ups Its Tablet Game",
    "Amazon Fire Max 11 review: Punching way above its weight class",
    "“Amazon Fire Max 11 review: Easily the best Fire tablet yet” Also a really, really low bar.",
    "Informatica to acquire Privitar, a data access management company",
    "Informatica acquires Privitar to strengthen privacy controls",
    "Informatica acquires Privitar to boost data access management",
    "Informatica bets big on data privacy with Privitar acquisition",
    "Four-week-old AI start-up raises record €105m in European push",
    "Phil Spencer seems interested in bringing Hexen back",
    "Phil Spencer: ‘I think of Xbox Game Pass as a content fund’",
    "Phil Spencer talks AI, “living games” and more in new interview",
    "Phil Spencer Wants You To Stop Reading Into His T-Shirt Choices",
    "Phil Spencer Teases Multiple Games That Weren't Shown In This Year's Xbox Showcase",
    "Starfield Will Help the Growth of PC and Xbox Game Pass - Phil Spencer",
    "Cyber liability insurance vs. data breach insurance: What's the difference?",
    "Popular versions of Hong Kong protest song disappear from music streaming platforms",
    "Hong Kong Protest Song Unavailable on iTunes After Government Seeks Ban",
    "#Apple banned #GloryToHongKong before #HongKong did. Apple is craven. https://twitter.com/...",
    "#GloryToHongKong was removed from multiple music streaming platforms. [image]",
    "News podcasts: who is listening and what formats are working?",
    "Sequoia's Split, the Consumer Social Nuclear Winter & Zombie-corns",
    "Sequoia Is Hunting for Early Deals and More AI as It Splits From China",
    "VC Firm Sequoia India & Southeast Asia Is Now Peak XV Partners",
    "Peak XV Partners to target US software deals post split",
    "Will Peak XV be able to scale the heights reached by Sequoia?",
    "MERGER OF VODAFONE UK & THREE UK TO CREATE ONE OF EUROPE'S LEADING 5G NETWORKS",
    "Vodafone, Hutchison unveil UK mobile merger",
    "Vodafone, CK Hutchison agree UK mobile business merger",
    "Vodafone to merge with Three to create UK giant",
    "Vodafone and Three announce UK mega-merger",
    "Vodafone, Three to merge UK businesses, create largest UK MNO",
    "Vodafone and Three agree UK merger, but will regulator block the deal?",
    "Vodafone and Three Merging Networks to Form UK's Largest Mobile Operator",
    "Vodafone, Three to merge UK mobile phone operations to capitalize on 5G rollout",
    "Vodafone and Three, two of the UK's biggest carriers, will merge",
    "Vodafone and CK Hutchison agree UK mobile merger",
    "Vodafone, Three Merge U.K. Operations to Create 5G Giant, Promise $14 Billion Investment",
    "It's official: Vodafone and Three to tie the knot in the UK",
    "CK Hutchison, Vodafone to merge units to form UK's biggest mobile provider",
    "Vodafone and Three merger will be UK's largest network, here's what it could mean for you",
    "Vodafone and Three plan merger to create UK's biggest mobile carrier",
    "Vodafone and Three agree to merger in the UK",
    "Vodafone and Three agree to £15bn UK merger",
    "Vodafone and Three plan to merge in the UK in a $19B deal (if regulators approve)",
    "Vodafone and Three agree merger to form UK's largest mobile operator",
    "Vodafone and Three agree UK merger to create biggest mobile player worth £15bn",
    "UK: Vodafone and Three announce intention to merge, creating the biggest operator",
    "Vodafone and Three confirm UK merger agreement",
    "Vodafone and Three merger to test how much national security law can gum up M&A activity",
    "Samsung to give staff Friday off once a month in latest embrace of 4-day work week",
    "Samsung Electronics picked as most preferred employer after a decade",
    "More flexible workweeks at Samsung, large firms",
    "Arm in talks with Apple, Intel, others over IPO investments",
    "Samsung might pour a lot of cash into Arm this year",
    "Intel approached to take on key investor role in Arm IPO",
    "@paul@social.paulkedrosky.com",
    "Pepsi, Burger King reclaim brand value with smart advertising, report finds",
    "Is AI The Cause Of Job Cuts This Year?",
    "Machines are helping doctors become more like humans. https://www.nytimes.com/...",
    "Researchers Demo Alarming Exploit That Steals Encryption Keys By Recording Power LEDs",
    "This reads like a plot device from a lame 80s hacker flick https://arstechnica.com/...",
    "Recovering secret keys from devices using video footage of their power LED",
    "Hackers Can Steal Cryptographic Keys By Video-Recording Power LEDs 60 Feet Away",
    "Hackers can steal cryptographic keys by video-recording power LEDs 60 feet away",
    "International Business Times",
    "Musk and Dorsey criticize Apple over its treatment of a social media app that allows bitcoin tips",
    "Apple Rejects Bitcoin Wallet Zeus a Day After Threatening to Delist Damus",
    "Apple threatens to remove Jack Dorsey-backed Damus app over in-app transactions",
    "Jack Dorsey-Backed Damus Faces Explusion From Apple's App Store Over Bitcoin Tipping Feature",
    "Decentralized Social Media App Damus Faces Apple App Store Removal Over Bitcoin Tipping Feature",
    "Elon Musk fires back at Apple over bitcoin app removal",
    "Jack Dorsey-Backed Damus App to Suspend Tipping Feature as App Store Threatens Removal",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "Apple wants Bitcoin tipping feature Damus removed from store",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Apple will remove Damus app unless it drops Bitcoin tipping feature",
    "Apple threatens to ban popular social media App over Bitcoin tipping",
    "Apple to delist Nostr-based Damus app over Bitcoin tip feature",
    "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted",
    "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "Due To Bitcoin Payments, Apple Bans Nostr Client Damus From App Store",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/..."
]