[
    "Washington Post on YouTube",
    "OpenAI, IBM Urge Senate to Act on AI Regulation After Past Tech Failures",
    "OpenAI CEO Sam Altman tells US senators AI regulation is ‘critical’",
    "US Senator Uses ChatGPT for Opening Remarks at a Hearing on AI",
    "Sam Altman Tells Congress AI's Effect on Society Will Be Like Photoshop on Steroids",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies on artificial intelligence before Senate committee",
    "OpenAI CEO says AI chatbots will ‘entirely automate away some jobs’",
    "WATCH LIVE | OpenAI CEO testifies before Congress",
    "The CEO behind ChatGPT is testifying. Here's what to expect.",
    "OpenAI CEO Sam Altman testifies before U.S. Senate: live",
    "Always great to have men testifying about work women pioneered. https://twitter.com/...",
    "United States Senate Committee on the Judiciary",
    "San Francisco Business Journal",
    "Oversight of A.I.: Rules for Artificial Intelligence",
    "OpenAI CEO calls for laws to mitigate ‘risks of increasingly powerful’ AI",
    "Sam Altman wows lawmakers at closed AI dinner: ‘Fantastic...forthcoming’",
    "Sam Altman, CEO of ChatGPT deveoper OpenAI, is testifying before Congress about AI",
    "Washington Races to Develop and Implement Effective AI Policy",
    "OpenAI CEO in “historic” move calls for regulation before Congress",
    "OpenAI CEO embraces government regulation in Senate hearing",
    "Silicon Valley Business Journal",
    "Senate panel begins AI examination; ChatGPT CEO Sam Altman testifies",
    "Tesla Board Faces Shareholders Grumpy Over Elon Musk Oversight",
    "OpenAI CEO tells US senators regulation is ‘critical’",
    "OpenAI's Sam Altman concerned about AI used to compromise elections",
    "The C.E.O. of OpenAI Heads to Congress to Discuss Rules for A.I.",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "Mr. ChatGPT goes to Washington: OpenAI CEO Sam Altman testifies before Congress on AI risks",
    "OpenAI CEO Testifies on Artificial Intelligence",
    "ChatGPT's Sam Altman Calls on Congress to Adopt Safety Standards for AI Systems",
    "OpenAI CEO Sam Altman's congressional testimony comes at a critical AI moment",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies before Senate Judiciary Committee",
    "ChatGPT's chief testifies before Congress as concerns grow about artificial intelligence risks",
    "Can you say, “pulling up the ladders”? https://twitter.com/...",
    "Apple previews new accessibility features, including AI-generated voice clone",
    "Apple announces new accessibility features ahead of iOS 17, macOS 14 reveal",
    "Apple innovates in accessibility as WWDC nears",
    "Apple Details New Accessibility Features Coming to iOS, iPadOS, and macOS Later This Year",
    "Apple reveals upcoming accessibility features, including a voice replicator",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple's Personal Voice, Point and Speak Features Use AI to Boost Accessibility",
    "Apple introduces a slew of new accessibility features ahead of WWDC",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "New iOS 17 accessibility features include Personal Voice and Live Speech",
    "iOS 17 is getting some giant new accessibility features",
    "iOS 17 first features announced: Live Speech, Personal Voice, Point and Speak and more",
    "Apple announces several new innovative accessibility features coming to iOS latest this year",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple unveils new Accessibility features coming with iOS 17 later this year",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "New accessibility features for iOS 17 have just been given a big preview",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple previews new accessibility tools, including Live Speech and Assistive Access",
    "Apple Introduces New Features for Cognitive Accessibility",
    "Apple previews iOS 17 accessibility features, including one that recreates your voice on calls",
    "Apple promises Live Speech, Personal Voice, and Point and Speak are coming to iOS",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2",
    "Apple launches new concert discovery features on Apple Maps and Apple Music",
    "Apple taps into Shazam with new live concert features in Music and Maps",
    "Apple adds new concert-finding features to Maps and Music",
    "Apple Music and Apple Maps Launching New Concert Features Today",
    "Apple Music rolls out new concert discovery features with Apple Maps integration",
    "Apple Music adding concert set list playlists, tour dates, and more",
    "Apple now helps you discover concerts in Maps and Music",
    "Apple Launches Concert Discovery Features on Apple Music and Apple Maps",
    "Now Apple Music is putting live gigs on the Maps",
    "Apple Music wants to connect you with the artists you love through a new Set Lists feature",
    "Apple Music And Apple Maps Will Now Inform Users Of Nearby Concerts Happening In Their Areas",
    "Apple Music and Apple Maps updates help find where your favorite band is playing",
    "Apple Adds Live Music Features to Maps and Music",
    "Find live music with new features on Apple Maps and Apple Music",
    "Apple announces new concert discovery features on Apple Maps and Apple Music",
    "Apple will now help you find concerts and gigs in Apple Maps with Apple Music",
    "Apple launches new concert discovery features on Apple Music and Apple Maps",
    "Apple Music, Apple Maps Get New Concert Discovery Features",
    "You can now listen to official concert set lists on Apple Music",
    "Twitter Agrees to Buy HR Tech Startup Laskie",
    "Musk Buys Job Tool Laskie in First Acquisition for Twitter",
    "Twitter, Company That Doesn't Pay Its Bills, Acquires Job Search Startup Laskie",
    "Funding down, exits muted, and valuations flat in rough quarter for European startups",
    "Twitter buys LinkedIn competitor Laskie in first acquisition since Musk takeover",
    "Elon Musk's latest purchase might mean Twitter will be the place to find your next job",
    "Elon Musk wants you to find your next job on Twitter as it takes on Linkedin",
    "Elon Musk's Twitter Adds This ‘Acquisition’ Tool",
    "FTX founder Sam Bankman-Fried to be subject of ‘high-octane’ book by Michael Lewis",
    "Unfortunately you rarely get this sort of deal. https://twitter.com/...",
    "Extreme Didion “this is gold” vibes https://www.nytimes.com/... [image]",
    "U.S. Department of the Treasury",
    "Russian National Charged with Ransomware Attacks Against Critical Infrastructure",
    "Alleged Babuk ransomware gang leader ‘Wazawaka’ indicted, sanctioned by US",
    "US sanctions Russian accused of being a ‘central figure’ in major ransomware attacks",
    "Office of Foreign Assets Control",
    "Cyber-related Designation  —  SPECIALLY DESIGNATED NATIONALS LIST UPDATE",
    "EU states approve world's first comprehensive crypto rules",
    "MiCA is here. There are nine other EU crypto laws you should know about",
    "Crypto rules get final approval to make Europe a global leader on regulation",
    "EU finance ministers approve MiCA crypto regulation",
    "EU Countries OK World's First Comprehensive Crypto Rules",
    "EU finance ministers approve MiCA crypto regulation: should you buy AltSignals now?",
    "EU finance ministers green light MiCA crypto regulation",
    "MiCA Receives Greenlight From EU Finance Ministers",
    "New tax transparency rules will help Member States shine a light on the crypto-asset sector",
    "EU Finance Ministers Give Final Go-ahead to MiCA",
    "Just-In: EU Council Approves MiCA For Bringing Clear Crypto Regulation",
    "EU Crypto Law Progresses with Finance Ministers' Approval",
    "EU finance ministers unanimously greenlight MiCA regulations",
    "EU's MiCA gets unanimous nod from European Council",
    "MiCA: A Catalyst for Increased VC Funding in European Crypto Startups",
    "SEC Fires Back at Coinbase's Request For New Crypto Rules",
    "The SEC calls Coinbase's suit over digital asset rules petition ‘baseless’",
    "Coinbase Hasn't Proven SEC Needs to Create Crypto-Specific Rules, Regulator Says",
    "SEC seeks denial of Coinbase petition for imminent crypto rules",
    "Deaton Joins Ripple Policy Head To Criticize SEC's Delayed Rulemaking Process",
    "Crypto Vs SEC: Will Coinbase's Petition Triumph Against SEC's Judicial Scrutiny",
    "SEC Urges Judge to Reject Coinbase Demand for Rules Explanation",
    "Coinbase Request for Clarity on Crypto Rules ‘Should Be Denied’, Says SEC",
    "Coinbase's Petition Regarding Digital Asset Rules Deemed ‘Baseless’ by SEC",
    "SEC Claps Back at Coinbase's Demand for Regulatory Clarity",
    "SEC urges court to reject Coinbase's demand for regulatory clarity",
    "SEC in no rush to respond to Coinbase calls for regulatory clarity",
    "SEC responds to Coinbase with utter rejection",
    "SEC Says Crypto Regulatory Clarity May Take Years and They're in No Rush",
    "SEC won't give into Coinbase demands, says it wants the impossible",
    "SEC Denies Coinbase's Request For Clarity On Crypto Regulation",
    "SEC Wants Court To Dismiss Coinbase Demand for Rules Explanation",
    "SEC Asks Court to Deny Coinbase Demand for Crypto Rules",
    "SEC Responds To Coinbase Complaint: Crypto Rules May Take Years",
    "Crypto Regulatory Clarity May Take Years: SEC",
    "Coinbase says SEC response reinforces concern about the regulator actions",
    "SEC Will Continue Using Enforcement Actions As A Substitute For Rulemaking",
    "The SEC basically told Coinbase, “We'll get to it, eventually” https://blockworks.co/...",
    "AI Health Startup Gets $50 Million Seed Funding From Venture Titans",
    "General Catalyst, Andreessen Horowitz bet on large language models for health care",
    "Hippocratic Health raises $50 mln seed funding to build AI model",
    "Hippocratic AI Raises $50 Million To Power The Healthcare Bot Workforce",
    "Investing in Hippocratic AI",
    "Why we need a secure side door for encrypted apps, not a back door",
    "Twitter rolls out encryption for direct messages but with key limitations",
    "This company is under two FTC consent decrees for data privacy violations. https://twitter.com/...",
    "Jump Trading manipulated UST price for $1.3B profit, class action lawsuit alleges",
    "SEC filings uncover secret agreement between Jump Trading and Terraform Labs",
    "How Jump Trading allegedly manipulated UST into collapse",
    "Jump Trading Made $1 Billion in Secret Deal to Prop Up TerraUSD: Report",
    "SEC Says Jump Trading Secretly Propped Up Do Kwon's TerraUSD",
    "But I was told they were just “making markets...” https://www.wsj.com/...",
    "Twitter Sued for Allegedly Helping to Silence Saudi Critics",
    "Kustomer Embarks on a New Chapter as a Standalone Company",
    "IBM buying binge rages on with reported $60M deal for startup targeting ‘shadow data’",
    "Huntress Closes $60M Series C for MDR Expansion",
    "Managed security startup Huntress raises $60M to support underserved small and midsized firms",
    "App Spotlight: Ringover for Zoho CRM",
    "Hottest online game involves the CIA. https://www.wsj.com/...",
    "This is like a weird 2023 reboot of “Wargames.” https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/16 - Open Source Vs. Centralized AI, Part I",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Auradine raises $81 million to build ‘next-generation web infrastructure’",
    "Blockchain Privacy Firm Auradine Raises $81M From Stanford, Marathon Digital",
    "Internet infrastructure firm Auradine raises $81 million",
    "Auradine Raises $81 Million in Series A Financing for Next-Generation Web Infrastructure",
    "India Digest: StepChange raises $4m; Mayfield exits BluSmart",
    "Bitcoin company River raises $35 million",
    "Bitcoin services startup River Financial secures $35 million from Peter Thiel, others",
    "River Raises $35M In Series B Funding",
    "Bitcoin Lightning company River raises $35M amid ‘new wave of institutional adoption’",
    "Two Trading Apps That Allowed Chinese Citizens to Invest Overseas Get Pulled From China",
    "Futu and Up Fintech to remove their apps from online stores in mainland China",
    "China Online Brokers Pull Apps as Cross-Border Trades Targeted",
    "Futu and UP Fintech to Remove Apps From Chinese App Store",
    "Futu and UP Fintech take down trading apps in China to meet CSRC requirements",
    "Futu, UP Fintech shares fall on plan to remove apps in China",
    "Regulators ask Futu and UP Fintech to remove apps in China - sources",
    "Futu and Fintech to remove apps from Chinese app stores on regulatory directives sources",
    "Baidu to ensure AI won't ‘hallucinate’ on sensitive topics: CEO",
    "Baidu charts an AI future after posting better-than-expected earnings",
    "Baidu Announces First Quarter 2023 Results",
    "China's Baidu beats quarterly revenue estimates on ad strength",
    "Baidu Stock Rises. It Topped Earnings Expectations.",
    "Japan's top-funded tech companies in the last decade",
    "Vodacom, MTN double down as fibre race heats up",
    "MTN unveils plan to build R6-billion Africa fibre cable",
    "Irish Council for Civil Liberties",
    "5 years: GDPR's crisis point — ICCL's 2023 GDPR report",
    "75% of Irish data watchdog's GDPR decisions since 2018 overruled - report",
    "5 years: GDPR's crisis point - ICCL report on EEA data protection authorities",
    "GDPR measures are ‘failing’ to reign in Big Tech, report claims",
    "Warren Buffett's Berkshire Hathaway sells entire stake in TSMC",
    "Warren Buffett's $4.1 billion bet on TSMC lasted less than six months",
    "Warren Buffett sold all TSMC shares over concerns about Taiwan's stability",
    "Buffett's Berkshire bids farewell to TSMC shares",
    "Warren Buffett completely sells his TSMC stake",
    "TSMC added by Macquarie, Fidelity and Coatue after Buffett cut stake -filings",
    "Ethernovia Raises $64 Million to Accelerate the Revolution of Vehicle Networks",
    "Ethernovia Raises $64M To Boost Electric Vehicle Manufacturing",
    "Office of the Maine Attorney General",
    "Pharmacy Services Provider Attack Exposed Medical Data on Nearly Six Million Patients",
    "US pharmacy giant says hackers accessed personal data of almost 6 million patients",
    "Millions of PharMerica customers hit in ransomware attack",
    "PharMerica data breach impacts more than 5.8 million individuals",
    "PharMerica Breach Hits Over 5.8 Million Customers",
    "Pharmacy giant PharMerica says medical info of nearly 6 million patients leaked",
    "5.8M records stolen in ransomware attack on pharmacy company PharMerica",
    "PharMerica Leaks 5.8M Deceased Users' PII, Health Information",
    "PharMerica Discloses Data Breach Impacting 5.8 Million Individuals",
    "PharMerica Reports Breach Affecting Nearly 6 Million People",
    "PharMerica Notifies 5.8M Individuals of Healthcare Data Breach",
    "Introducing Chat Lock on WhatsApp",
    "Chat Lock: Making your most intimate conversations even more private",
    "WhatsApp 2023: New Privacy Features, Settings, and More",
    "WhatsApp Chat Lock: Making Your Most Intimate Conversation Even More Private",
    "WhatsApp users joke new Chat Lock feature is ‘tailored for cheating’",
    "WhatsApp introduces Chat Lock to protect sensitive messages",
    "WhatsApp now allows you to lock chat with fingerprint or passcode",
    "WhatsApp launches password-protected folder to hide confidential chats",
    "WhatsApp's new privacy feature locks sensitive chats and hides them from notifications",
    "WhatsApp's new feature lets you lock and hide conversations",
    "WhatsApp's Chat Lock feature makes your most intimate chats even more private",
    "WhatsApp Gains Chat Lock Feature for More Private Conversations",
    "WhatsApp Chat Lock: The secret to keep your chats even more private",
    "Privacy First: Here is Chat Lock for WhatsApp",
    "WhatsApp Adds ‘Chat Lock’ for Extra Privacy In-App",
    "WhatsApp now lets you lock chats with a password or fingerprint",
    "Chat Lock on WhatsApp will make your ‘extra-special messages’ more private",
    "New WhatsApp feature further protects your chats from prying eyes",
    "WhatsApp Chat Lock is official to protect your extra special chat",
    "WhatsApp Introduces New Chat Lock Feature [Video]",
    "WhatsApp's Chat Lock lets you secure conversations behind a password or biometrics",
    "WhatsApp Now Lets You Lock Chats Behind Passwords Or Biometrics",
    "New WhatsApp feature lets you lock away your super-sensitive chats",
    "WhatsApp's new Chat Lock feature will allow you to protect your intimate conversations",
    "WhatsApp now lets you lock and hide individual chats",
    "WhatsApp Introduces “Chat Lock” Feature To Hide Conversations",
    "WhatsApp Introduces ‘Chat Lock’ Feature To Protect Your Intimate Conversations",
    "WhatsApp now lets you lock chats with a password or fingerprint ID",
    "WhatsApp's Chat Lock feature will let users password protect their private conversations",
    "WhatsApp launches feature to lock chats",
    "WhatsApp adds chat lock feature to safeguard private conversations",
    "Latest Odisha News, Breaking News Today",
    "Mark Zuckerberg announces new WhatsApp feature ‘Chat Lock’ to safeguard intimate chats",
    "WhatsApp Introduces Chat Lock Feature, Empowering Users with Enhanced Privacy and Security",
    "WhatsApp will allow users to lock and hide conversations, Meta announces",
    "WhatsApp now lets you lock your saucy chats so that no one reads your personal messages",
    "WhatsApp launches Chat Lock feature, allows sender, messages to be hidden",
    "WhatsApp Chat Lock feature launched for private conversations",
    "All WhatsApp users gain a brand new feature to stop nosy friends once and for all",
    "WhatsApp launches Chat Lock feature, what it is, how to use and more",
    "WhatsApp Launches ‘Chat Lock’ Privacy Feature",
    "Mark Zuckerberg announced chat lock feature on WhatsApp for iOS and Android",
    "“No message preview for added privacy.” Let the chaos begin",
    "@wcathcart @WhatsApp With that feature, all private chat apps are dead",
    "New locked chats in WhatsApp make your conversations more private. …",
    "Cloudflare expands zero-trust to generative AI",
    "Cloudflare adds AI scanning coverage to protect intellectual property and customer data",
    "Together's $20M seed funding to build open-source AI and cloud platform",
    "Together raises $20m seed funding to build open-source AI models",
    "Open Source Generative AI Startup Together Raises $20M",
    "Together raises $20M to decentralize and open-source AI model creation",
    "Together raises $20M to build open source generative AI models",
    "The AI Startup Together Successfully Secures Funding for Open-Source AI and Cloud Platform",
    "Microsoft Completes Rollout of Basic iMessage Support on Windows 11",
    "All iPhone-owning Windows 11 users can now send iMessages from their PC",
    "Phone Link for iOS now available for all Windows 11 users featuring iMessage and more",
    "Microsoft finally brings iMessage to Windows with Phone Link app",
    "How to sync iPhone with Windows 11: The Link to Windows app for iOS explained",
    "How to use Phone Link with iPhone to send messages from your PC",
    "Want to hook up your iPhone with Windows 11? Well now you can",
    "Microsoft rolls out Phone Link for iOS to all Windows 11 users: Check requirements here",
    "How to Set Up and Use iMessage on Windows 11",
    "You can now use iMessage on your Windows 11 PC",
    "How to get iPhone notifications on Windows PC using this free and quick method",
    "How to sync messages between iPhone and Mac",
    "Microsoft Bridges the Gap Between iPhone and Windows 11 with Phone Link",
    "Microsoft launches app for iPhone users to use iMessage on PC",
    "With Phone Link for iOS, You Can Use iMessage on a PC (But There's a Catch)",
    "All Windows 11 users can now use iMessage on their PCs",
    "Microsoft's ‘Phone Link’ app for iOS is now rolling out to all Windows 11 customers",
    "Windows 11 Now Has Its Own Version of Airdrop for iPhone to PC Transfers",
    "How to use iMessage on Windows",
    "Phone Link for iOS is now available to all Windows 11 users, bringing iMessage and more to PCs",
    "Windows 11 PCs can now send and receive iMessages",
    "iPhone syncing for Windows 11 is now available for everyone",
    "Microsoft releases update that allows iPhone users to text from Windows",
    "Phone Link for iOS is now available to all Windows 11 users",
    "Microsoft iMessage on Windows 11, here are the pros and cons [U: Fully rolled out]",
    "UK MPs grill regulator over Microsoft Activision Blizzard deal block, day after EU grants approval",
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "EU Microsoft Activision Approval Contrasts The Deeply Odd UK Rejection",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft bid for Activision Blizzard — but the saga is ‘unlikely to end soon’",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "EU Official Says CMA Overstated Microsoft's Share in Cloud Gaming Market",
    "EU approves Microsoft $69 billion acquisition of Activision",
    "Buffett stays bullish on Bank of America, dumps two other banks",
    "One Approval Down, Two More to Go: Microsoft Wins EU's Approval for Activision Deal",
    "EU Gives Green Signal to Microsoft $69B Acquisition of Activision Blizzard",
    "One Difference Between EU & CMA Led To Different Outcomes on The Microsoft Activision Deal",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "Microsoft's $68.7B acquisition of Activision gets the green light from the EU",
    "European Commission gives nod to Microsoft Activision deal",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "The CMA and Activision Blizzard respond to the EU approving the Microsoft acquisition",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "Microsoft's big video game merger just got an extra life",
    "Microsoft's regulatory concessions in Activision deal may tamper Xbox ecosystem growth",
    "EU regulators approve Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "The EU approves Microsoft-Activision takeover as long as Xbox Cloud cannot unfairly benefit",
    "European Union approves Microsoft's $69 billion bid for Activision",
    "EU Surprises by Approving Microsoft Activision Merger After UK Shut It Down",
    "Boss fight cleared: Europe approves Microsoft's Activision takeover",
    "What's next for the Microsoft-Activision deal after receiving EU approval?",
    "Microsoft Activision Deal Has Been Approved By The EU Regulator",
    "EU approves Microsoft's $69 billion acquisition of Activision, clearing a major hurdle",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "E.U. breaks with Britain and U.S. to clear Microsoft's Activision deal",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]",
    "@rodhilton@mastodon.social",
    "This free TV comes with two screens",
    "Pluto TV Co-Founder Launches Telly, the Ultimate Free Television Upgrade for the Living Room",
    "Telly Wants To Give You A 55-Inch 4K HDR Smart TV For Free But There's A Catch",
    "Double-screen ‘free’ TV will show you ads, even when not in use",
    "Telly Launches Free 55″ UHD Smart TV Behind Ad-Supported Business Model",
    "You can get a free 55-inch Smart TV - but there's (quite a big) catch",
    "The Morning After: This company will give you a free TV if you're willing to watch non-stop ads",
    "Telly Offers Half-Million Free 55-Inch 4K TVs, Advertisers To Pick Up Tab",
    "You can get a free 55-inch 4K TV — but there's a massive catch",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "This free TV has a second screen for extra ads - and it could be a privacy nightmare",
    "Want a free TV? Telly will give you one, but there are a couple of stipulations",
    "Telly Offers Free 4K TVs, But with 24/7 Ads Built-In",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "‘Free’ TV Costs Only Your Constant Attention",
    "This startup will give you a 4K TV for free if you watch nonstop ads",
    "‘Telly’ is a free dual-screen TV powered by ads, includes free Android TV dongle",
    "You can get a 4K TV for free, with a very creative new catch",
    "New company giving away free TVs. Here's how to get one",
    "Telly Launches Dual-Screen, Ad-Supported TV For Free: Here's How To Get One",
    "hey guys, free hackable TV https://variety.com/...",
    "Whys there a camera and mic attached to this tv? FED WORK!!!!! https://twitter.com/..."
]