[
    "@JohnSullivan@mastodonapp.uk",
    "‘Verified’ Twitter accounts share fake image of ‘explosion’ near Pentagon, causing confusion",
    "How Fake AI Photo of a Pentagon Blast Went Viral and Briefly Spooked Stocks",
    "A tweet about a Pentagon explosion was fake.  It still went viral.",
    "‘Verified’ Twitter accounts push Pentagon explosion hoax",
    "Fake viral images of an explosion at the Pentagon were probably created by AI",
    "Fake picture of explosion at Pentagon spooks Twitter",
    "Pentagon explosion hoax goes viral after verified Twitter accounts push",
    "Pentagon Bomb Hoax Highlights Power of Artificial Intelligence - What Could It Mean For Crypto?",
    "Fake Image Of Explosion Near Pentagon Went Viral—Even Though It Never Happened",
    "Fake AI-generated image of explosion near Pentagon spreads on social media",
    "Fake image of Pentagon explosion goes viral",
    "No, the Pentagon Didn't Blow Up Monday",
    "Blue Tick Accounts on Twitter Add Weight to Pentagon Explosion Hoax",
    "Market dips briefly after AI image of fake explosion near Pentagon goes viral",
    "Fake image of a Pentagon explosion briefly goes viral",
    "FACT FOCUS: Fake image of Pentagon explosion briefly sends jitters through stock market",
    "Verified Twitter Account Pushes AI-Generated Image of Pentagon ‘Explosion’",
    "Fake Pentagon attack hoax shows perils of Twitter's paid verification",
    "‘Verified’ Twitter Accounts Spread Pentagon Explosion Hoax",
    "Fake Pentagon explosion photo caused a real dip in the stock market",
    "AI-Generated Hoax of Pentagon Explosion Sparks Brief Market Sell-Off",
    "AI-Generated Image of Pentagon Explosion Caused Markets to Dip",
    "AI-generated photo of fake Pentagon explosion sparks brief stock selloff",
    "Faked Images of Pentagon Explosion Circulate on Twitter",
    "Large Explosion near The Pentagon Complex in Washington D.C. - Initial Report",
    "Ah yes, no-one saw this coming. https://www.vice.com/...",
    "pay-to-\"verify\" blue checks... 🥴 https://twitter.com/...",
    "Elon Musk carefully enabled this ⤵️ https://twitter.com/...",
    "New Twitter is fraud-friendly https://twitter.com/...",
    "Russian propaganda now running with this lie. https://twitter.com/...",
    "This election season is gonna be hell with AI-assisted disinformation. https://twitter.com/...",
    "General Secretariat of the Council of the European Union",
    "Leaked EU files suggest Spain supports end-to-end encryption ban",
    "Spain Advocated for An All-Out Ban on End-to-End Encryption",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "Xi's Micron Ban Shows China's Limited Options to Hit Back at US",
    "US expresses ‘serious concerns’ as China restricts sale of major chip maker Micron",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "Micron expects revenue impact following China ban",
    "China's Micron ban highlights chipmakers' dilemma as Sino-U.S. tensions grow",
    "China/Micron: Beijing ban restricts chip options for local companies",
    "International Business Times",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "OpenAI's Altman Wants International Body Akin To Nuclear Watchdog IAEA To Regulate AI",
    "ChatGPT's parent OpenAI wants humans to regulate AI, proposes a regulatory body",
    "Wangiri phone scam is reportedly back in Kenya",
    "The hype game becomes the regulatory capture game. https://openai.com/...",
    "“Open Source is great, as long as it doesn't exceed our latest released capability” 😂",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "US District Court, District of Montana",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "TikTok sues Montana over new law banning the app",
    "TikTok sues Montana to block ban, citing First Amendment",
    "TikTok sues Montana to block state-wide ban",
    "TikTok sues Montana to reverse state's ban of the app",
    "TikTok files lawsuit against Montana over download ban",
    "TikTok challenges the US state of Montana over ban of its app",
    "TikTok Inc. v. Austin Knudsen",
    "TikTok sues Montana over statewide ban",
    "TikTok Sues State of Montana",
    "TikTok Sues Montana Over Ban, Cites First Amendment",
    "Montana TikTokers Sue Over App Ban",
    "Leave it to the feds: TikTok sues Montana",
    "TikTok sues Montana in bid to overturn statewide app ban",
    "TikTok sues US state of Montana over law banning its use",
    "TikTok's Lawsuit Against Montana Is a Test Case Amid National Ban Debate",
    "Montana TikTok Ban Signed Into Law, Goes Into Effect in 2024",
    "TikTok sues Montana over state-wide ban",
    "TikTok Files Lawsuit Against Montana, Calls State Ban Unconstitutional",
    "TikTok sued Montana over its statewide ban of the app",
    "TikTok sues Montana over law that bans app",
    "TikTok Challenges Montana's Decision to Ban the App",
    "TikTok sues Montana after new law banning its app",
    "TikTok Sues Montana to Reverse App Ban",
    "TikTok hits Montana with federal lawsuit in attempt to dissolve ban",
    "TikTok, Citing First Amendment, Sues Montana Over Impending Ban",
    "TikTok Sues Montana Over Law Banning the App, Arguing It Violates First Amendment",
    "TikTok sues Montana after state became first to ban its app",
    "TikTok is suing Montana over statewide ban",
    "TikTok Sues Montana Over State's Ban of Its Service",
    "TikTok sues Montana over app ban",
    "TikTok Sues Montana Over New Law Banning App",
    "Warner Bros Discovery relaunches HBO Max streamer as ‘Max’ in bid for broader audience",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Max makes its debut in the U.S. to give subscribers 35K hours of content",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "HBO Max become Max today, 4K content gets major boost.",
    "Warner Bros. reveals Max: Rebranded HBO Max",
    "HBO Max is now just Max in the US",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "Here are Max's 220 movies and shows available in 4K at launch",
    "Most Expensive ‘Max’ Plan to Feature 1,000+ 4K Titles — See the List",
    "Warner Bros. says that Max will have over 1000 titles in 4K when it launches tomorrow",
    "HBO Max Is Now Just Max: Everything You Need To Know Including Programs, Pricing & More",
    "Meet Max: What you can watch on the new app that combines HBO Max and Discovery+",
    "why are all the streaming services blue now [image]",
    "Twitter brings up people's deleted past as another weird bug hits the platform",
    "A Twitter Bug Is Restoring ‘Deleted’ Tweets and Retweets",
    "Twitter users report deleted tweets return, won't delete",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "Twitter bug sees deleted tweets resurrected for some users",
    "Those tweets you deleted might be back online without your knowledge",
    "New Twitter bug is restoring deleted tweets for hundreds of users",
    "Twitter's latest bug reportedly restores deleted tweets and retweets",
    "Oh crap! Thanks to @jjvincent for the reporting on this. https://www.theverge.com/...",
    "lol lmao good luck in EU courts Elon https://twitter.com/...",
    "How soon before our DM end up in our public timeline? https://artifact.news/...",
    "Everything is going well here at twitter dot com. https://www.theverge.com/...",
    "Google upgrades its AI flood-forecasting technology to help more people",
    "Google's AI-enabled flood forecasting goes global",
    "Google expands its AI-powered Flood Hub to 80 countries",
    "Google's AI-powered Flood Hub disaster alert system is now available in 80 countries",
    "Google expands AI flood forecasting tool to Ireland among other locations",
    "Introducing speech-to-text, text-to-speech, and more for 1,100+ languages",
    "MMS: Scaling Speech Technology to 1000+ languages",
    "Meta's open-source speech AI recognizes over 4,000 spoken languages",
    "Preserving the World's Language Diversity Through AI",
    "Meta's speech model can recognise over 4000 spoken languages: What this means",
    "Meta's Open Source AI Project Can Identify 4,000+ Spoken Languages",
    "Meta Open Sources Multi-Lingual Language Models to Maximize Inclusion",
    "Meta AI open-sources tools for self-supervised training of speech recognition models",
    "1100 languages! And see where their speakers are concentrated https://twitter.com/... [image]",
    "We're open sourcing another new AI model today that we call Massively Multilingual Speech. …",
    "Free compensation benchmarking data from 3,000 startups",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "IOSCO proposes global standard for crypto regulation",
    "FTX filings hint at reboot, OKX exchange picks Paris as hub",
    "International Securities Regulator IOSCO Proposes Policy Recommendations for Crypto",
    "Global securities watchdog IOSCO call for crypto regulation standards",
    "IOSCO Presents Comprehensive Crypto Guidelines for Regulation",
    "International securities watchdog proposes first set of global rules for crypto sector",
    "Hong Kong Securities Regulator to Accept License Applications for Crypto Exchanges Starting June 1",
    "Hong Kong greenlights retail trading of cryptocurrency",
    "Breaking: Hong Kong Allows Retail Investors Trade Bitcoin, ETH, Other Crypto",
    "Exclusive: Reliance JioMart fires 1,000, a bigger layoff round likely",
    "JioMart to lay off thousands to improve margins",
    "JioMart layoff: Over 1,000 employees, including 500 executives, asked to resign; says report",
    "Reliance JioMart cuts 1,000 jobs and to eliminate thousands more, report says",
    "JioMart Fires 1,000 Employees, More Layoffs Likely",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "TikTok: Inspire creativity and bring joy.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/22 - Meta Hit With Biggest Ever GDPR Fine",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Builder.ai keeps on building, now with a fresh $250+ million",
    "Builder.ai raises $250 mln in investment round led by QIA",
    "Qatar Investment Authority leads $250m funding in AI startup Builder.ai",
    "London-Based Startup Builder.ai Raises $250 Million",
    "Very confusing country where Schemes are Good but Scams must be Stopped. https://twitter.com/...",
    "Yelp Stock Surges as Activist Investor Pushes for Sale",
    "Yelp Soars Most Since August on Report of Activist Call for Sale",
    "Activist Investor Calls on Yelp to Sell Itself",
    "Mobility Startup Chalo Bags $57 Mn Funding To Enter New International Markets",
    "Chalo Pockets $45 Mn From Avataar Ventures, Others",
    "Zoom Raises Annual Sales Forecast in Sign Pandemic-Era Customers Here to Stay",
    "Zoom lifts annual forecasts even as growth slows from pandemic peaks",
    "Zoom Continues to Feel Pinch of Tightening Tech Budgets",
    "Zoom ends Q1 with 215,900 enterprise customers, touts AI strategy",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden picks new FCC nominee to fill seat that's been empty for over two years",
    "President Biden nominates a fresh face to break FCC deadlock",
    "Comcast Statement on FCC Nomination and Renominations",
    "FCC Nominee Anna Gomez is an FCC and NTIA Veteran",
    "Biden nominates telecom veteran to FCC in bid to overcome stalemate",
    "Biden nominates Anna Gomez for FCC commissioner vacancy",
    "Now You Can Edit Your WhatsApp Messages",
    "You can now edit that regrettable WhatsApp message — with one caveat",
    "Wish you could tweak that text? WhatsApp is letting users edit messages",
    "Can I edit a WhatsApp message? How the new edit feature works and when it is being released",
    "WhatsApp users are getting another great messaging upgrade",
    "How to edit sent WhatsApp messages",
    "WhatsApp's message editing feature now rolling out globally!",
    "Message Editing feature joins WhatsApp on Android, get it now!",
    "WhatsApp chat typo can now be edited easily in 15 mins: Heres how",
    "How to edit messages in WhatsApp",
    "WhatsApp now allow you to edit sent messages",
    "WhatsApp Introduces Edit Message Feature to Avoid Sending Wrong Messages",
    "WhatsApp chat edit feature now rolling out, check how to use it",
    "WhatsApp finally lets you edit messages, but you have to be fast",
    "WhatsApp finally lets you edit sent messages. Here's how to do it",
    "How to edit sent messages on WhatsApp: Know process, time limit, and more",
    "WhatsApp to allow users to edit messages within 15 minutes",
    "WhatsApp will let you edit messages within a 15-minute window",
    "WhatsApp finally lets you edit sent messages",
    "WhatsApp testing ability to edit messages, similar to iMessage and Telegram [U: Available now]",
    "Editable WhatsApp messages are coming to help you fxi silly typos",
    "Meta is giving users 15 minutes to edit WhatsApp messages",
    "Now you can edit your WhatsApp messages",
    "WhatsApp now lets you edit your messaging nightmares - here's how to do it",
    "WhatsApp Users Can Now Edit Messages For Up to 15 Minutes",
    "You can finally edit messages on WhatsApp",
    "You can edit messages on WhatsApp, Finally!",
    "WhatsApp Will Now Let You Edit Your Sent Messages for up to 15 Minutes After Hitting ‘Send’",
    "WhatsApp finally allows you to edit sent messages",
    "WhatsApp adds iMessage-like editing with a 15 minute window",
    "WhatsApp is finally letting everyone edit sent messages with the latest update",
    "You Can Now Edit Sent Messages on WhatsApp—If You're Fast Enough",
    "WhatsApp Now Lets You Edit Messages (But You Have To Be Quick)",
    "WhatsApp Now Lets You Edit Your Messages",
    "WhatsApp Says You Can Now Edit Messages",
    "WhatsApp finally rolls out message editing for the masses",
    "Introducing WhatsApp's latest superpower: edit your sent messages!",
    "WhatApp is borrowing one massive iMessage feature, and it's about time",
    "WhatsApp Now Lets You Edit Messages for 15 Minutes After Sending Them",
    "Mark Zuckerberg announces new feature that lets users edit WhatsApp messages",
    "Message editing is coming to WhatsApp",
    "WhatsApp finally rolls out the ability to edit messages",
    "You can finally edit WhatsApp messages, with one major limitation",
    "WhatsApp finally lets you fix typos in sent messages",
    "WhatsApp Now Lets You Edit Messages Within 15 Minutes Of Sending",
    "WhatsApp allows users to edit messages",
    "WhatsApp Is Getting iMessage-Like Edit Feature",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Apple Pay Integration Breaks New Ground for Web3 Gaming App, STEPN",
    "The ChatGPT iPhone app has serious privacy issues you need to know about",
    "Stepn Integrates Apple Pay To Enable Direct NFTs Purchase",
    "You Can Now Buy Stepn NFTs on iOS—But You'll Have to Pay the Apple Tax",
    "Apple Pivots Toward Greater Acceptance of Web3, Again",
    "Web3 Lifestyle App STEPN Integrates Apple Pay for In-Game Purchases",
    "STEPN Teams With Apple Pay To Let Its Users Buy NFTs Using Credit Cards On The App",
    "STEPN Secures Landmark Integration With Apple, GMT Price Explodes Over 8%",
    "Blockchain Gaming Platform STEPN Integrates With Apple Pay, Here's What We Know",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "European Data Protection Board",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "EU hits Meta with record €1.2B privacy fine",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "Facebook hit with record €1.2 billion GDPR fine for transferring EU data to US",
    "EU slaps Meta with $1.3 billion fine for moving data to US servers",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "European regulators signal they are fed up with Facebook",
    "How many billions can Meta's Facebook pay the EU? And does it even matter?",
    "Meta Fine, Not Fine  —  DATA PROTECTIONDATA PROTECTION BY DESIGNDATA STRATEGYTECH TRENDS",
    "Facebook to be fined £648m for mishandling user information",
    "EU Fines Meta Record €1.2bn; New Twitter CEO Reassures Top Ad Group",
    "Europe's Meta Ruling Tangles Web",
    "Facebook owner Meta expected to face record fine over transfer of European data to US servers",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "DPC fine should be a wake-up call for government",
    "Meta fined $1.3 billion for transferring user data from the EU to the US",
    "Meta to fight “unjustified” record $1.3 billion GDPR fine",
    "EU Regulators Hit Meta with Record $1.3 Billion Fine for Data Transfer Violations",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Meta Hit With $1.3B Record-Breaking Fine for GDPR Violations",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Facebook Fined $1.3 Billion for Violating EU Data Privacy Rules",
    "Meta fined $1.3 billion for violating European data privacy rules",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Facebook Ordered to Suspend Data Transfers to US From Europe",
    "European watchdog fines Meta $1.3 billion over privacy violations",
    "Meta vows to appeal €1.2bn fine by Irish data watchdog",
    "That Meta GDPR fine is €1.2B.  Plus biz must stop sending EU data to US",
    "Meta slapped with €1.2 billion fine by EU over GDPR breaches",
    "Meta Issued Record-Breaking $1.3 Billion Fine for Mishandling Data",
    "Facebook Owner Meta to Challenge Historic €1.2 Billion Fine",
    "Meta Receives €1.3 Billion Fine For Sending EU Facebook Data to the US",
    "Facebook Fined $1.3B — Zuckerberg Furious in GDPR Fight",
    "Meta Fined €1.2bn for Violating GDPR",
    "Meta Executives Respond to Record $1.3 Billion GDPR Fine",
    "Meta Was Just Fined a Record-Breaking $1.3 Billion by E.U. Regulators",
    "EU hands Meta record $1.3 billion fine over data transfers to US",
    "Facebook Fined €1.2 Billion for Transferring EU User Data to the US",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "EU fines Meta €1.2bn over transfer of data to US",
    "Meta Platforms receives $1.3B European fine for failure to protect user data and privacy",
    "Meta breached your privacy for the sake of adverts — and has been fined $1.3bn as a result",
    "EU Slaps Meta With Record €1.2 Billion Fine Over Sending User Data To US",
    "Meta's €1.2bn fine for breaching GDPR could have a big impact on EU-US data transfers",
    "Irelands slaps Meta with $1.3B fine over GDPR data privacy violations",
    "Biggest fines under EU privacy law",
    "Facebook owner Meta fined record €1.2 billion over EU-US data transfers",
    "Meta hit with record €1.2 billion fine for transferring European Facebook user data to the US",
    "Meta Fined $1.3bn In Europe's Largest GDPR Punishment to Date",
    "Meta fined 1.2 billion euro for violating GDPR in the EU",
    "Facebook's Meta fined a record $1.3 billion for transferring EU users' data to the US",
    "Irish DPA Finally Fines Facebook",
    "Meta gets hit with a $1.3 billion fine by the EU for sending personal data to the US",
    "Meta slapped with massive $1.3B fine for EU-U.S. data transfers",
    "Meta Faces Record $1.3B Fine for European Data Privacy Violations",
    "Facebook hit with record $1.3B fine in European privacy case",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers",
    "Meta ordered to pay a $1.3 billion fine because they're bad with data",
    "US-EU Data Transfers Thrown Into Doubt Following Record Fine For Meta",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes.",
    "Tornado Cash Sanctions Key to Drop in Crypto Hacks Last Quarter: TRM Labs",
    "‘Not over yet’: Tornado Cash attack rages on with $1m in jeopardy",
    "TORN Price gets Lift After Tornado Cash Attacker Proposes to Reverse Governance Attack",
    "DeFi has rough weekend with Aave and Tornado Cash chaos",
    "Tornado Cash attacker to potentially give back governance control, proposal reveals",
    "Tornado Cash attacker proposes to return control",
    "Attacker Takes Over Tornado Cash DAO With Vote Fraud, Token Slumps 40%",
    "Tornado Cash Attacker Funnels 360 ETH Through Crypto Mixer After Weekend Governance Exploit",
    "Tornado Cash attacker considers returning governance control"
]