[
    "International Business Times",
    "Linda Yaccarino Leaves NBCUniversal Amid Talks to Become Twitter CEO",
    "Who is Linda Yaccarino, Elon Musk's pick for Twitter CEO?",
    "Elon Musk says he has found new Twitter CEO",
    "New Twitter CEO May Be Linda Yaccarino",
    "Elon Musk says he has found a new CEO for Twitter.",
    "Twitter's new CEO is probably this NBC exec",
    "Right-wing Twitter worried Musk's CEO pick could return Twitter to its roots",
    "Twitter Under Elon Musk Is Starting to Look Like SpaceX",
    "From dealing with Musk to fixing Twitter Blue: what's in the next CEO's in-tray?",
    "Elon Musk is handing a truckload of mess to Twitter's new CEO",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "Twitter's New CEO a ‘Velvet Hammer’ to Help Musk Win Back Sales",
    "Linda Yaccarino leaves NBCUniversal, adding fuel to the Twitter CEO fire",
    "Elon Musk picks NBC advertising executive as next Twitter CEO",
    "NBCUniversal ad exec Linda Yaccarino will be the new Twitter CEO",
    "Elon Musk picks NBCU's Linda Yaccarino as new Twitter CEO",
    "Top Exec Leaves NBCUniversal Amid Twitter CEO Reports",
    "Musk Taps Linda Yaccarino As Twitter CEO Replacement",
    "Musk confirms Twitter's new CEO is ad guru Linda Yaccarino from NBCUniversal",
    "Elon Musk names Linda Yaccarino as new Twitter chief",
    "Linda Yaccarino is Twitter's new CEO: What to know about Elon Musk's pick",
    "Will she fix Twitter? Musk names NBCUniversal's Linda Yaccarino as new CEO",
    "Elon Musk appoints new Twitter CEO, NBCU's Linda Yaccarino",
    "Elon Musk Says NBCUniversal Ad Boss Linda Yaccarino Is Twitter's New CEO",
    "Twitter's new CEO is Linda Yaccarino, a longtime ad exec for NBCU",
    "Twitter confirms appointment of Yaccarino as new CEO",
    "How Will Twitter Change Under a New CEO?",
    "NBCU's Linda Yaccarino in Talks for Twitter CEO",
    "Elon Musk names Linda Yaccarino as Twitter CEO",
    "Who is Linda Yaccarino, reportedly Twitter's next CEO?",
    "Elon Musk Confirms Linda Yaccarino as New Twitter CEO",
    "Elon Musk names Linda Yaccarino new Twitter CEO",
    "Elon Musk Picks Linda Yaccarino as Next Twitter CEO",
    "NBCUniversal ad chief leaves as Twitter speculation swirls",
    "NBCUniversal says Yaccarino to depart amid reports of Twitter CEO role",
    "Linda Yaccarino Exits NBCUniversal, Mark Marshall Named Interim Ad Sales Chief",
    "Twitter has a new CEO as Elon Musk moves to a new role",
    "Elon Musk's reported Twitter CEO pick Linda Yaccarino leaving NBCUniversal ‘effective immediately’",
    "Linda Yaccarino says she's inspired by “provocative leadership.” Elon Musk's Twitter fits the bill",
    "RUMOR: Elon Musk To Step Aside At Tesla And Twitter",
    "Elon Musk Officially Announces Former NBCU Executive Linda Yaccarino as Twitter CEO",
    "NBCUniversal veteran will replace Elon Musk as Twitter CEO",
    "Elon Musk finds new Twitter CEO",
    "Elon Musk confirms Linda Yaccarino is now the new Twitter CEO; resigns as NBCUniversal ad chief",
    "New Twitter CEO Linda Yaccarino Follows Shiba Inu (SHIB)",
    "Elon Musk names NBCU's Linda Yaccarino as Twitter's new CEO",
    "New Twitter CEO rumoured to be NBC's Linda Yaccarino",
    "Reports: NBC Universal executive will take over as the new CEO of Twitter",
    "Meet Twitter's (now confirmed) incoming CEO Linda Yaccarino who just quit NBCUniversal",
    "Linda Yaccarino is Twitter's new CEO: Here's what to know",
    "A New Twitter CEO Won't Change Who Calls the Shots",
    "Elon Musk Steps Down, Meet the New Twitter CEO - Linda Yaccarino",
    "Elon Musk to Step Down as Twitter CEO in Six Weeks",
    "Who is Linda Yaccarino - the rumoured new CEO of Twitter?",
    "NBCUniversal's Linda Yaccarino in Talks to Run Twitter — Report",
    "Breaking: Elon Musk Announces Linda Yaccarino As New Twitter CEO",
    "Tesla Investors Cheer Elon Musk Stepping Down as Twitter CEO. Why They Shouldn't.",
    "New Twitter CEO rumored to be ex-TV exec as Elon Musk steps down",
    "Twitter's getting a new CEO and it might be this advertising exec",
    "NBCUniversal's Linda Yaccarino is in talks to become Twitter CEO: report",
    "Elon Musk Has Found His Replacement for Twitter CEO",
    "New Twitter CEO Yaccarino A Dogecoin Lover? Profile Reveals A Surprise",
    "Twitter Is Getting A New CEO As Musk Decides To Step Aside",
    "Elon Musk to step down as Twitter CEO, NBCU's Yaccarino reportedly in the running",
    "Linda Yaccarino Exits NBCUniversal Amid Twitter Talks; Mark Lazarus Assumes Oversight of Ad Sales",
    "Tesla Shares Print Mild Gains as Elon Musk Is Set to Step Down as Twitter CEO",
    "Twitter's new CEO could be a top NBCUniversal female exec, report says",
    "Linda Yaccarino emerges as top candidate for Twitter CEO: What you need to know",
    "Elon Musk Names Linda Yaccarino As Twitter CEO — Update",
    "Who is Linda Yaccarino, the possible female CEO of Twitter?",
    "Twitter CEO Favorite Linda Yaccarino Leaves NBCU",
    "Elon Musk says he's hired a new Twitter CEO but he will still be around [Update]",
    "Where Does Dogecoin Stand Under Twitter's New CEO Linda Yaccarino's Reign?",
    "We may already know who Twitter's new CEO is",
    "NBCU exec Linda Yaccarino might be the next Twitter CEO, and here's why",
    "NBCUniversal's Linda Yaccarino in talks to run Twitter, Wall Street Journal reports",
    "Elon Musk announces NBCU exec as new Twitter CEO",
    "Twitter Chief Elon Musk to Pass on Mantle to New CEO, Takes CTO Role",
    "Elon Musk Says He's Stepping Down as Twitter CEO, Will Oversee Product",
    "The anti Italian bias being displayed toward the new twitter ceo is sickening",
    "Love to see it https://twitter.com/...",
    "Flashback: Elon Musk Calls CEO a ‘Made-Up Title’ https://www.wsj.com/...",
    "Congratulations to new Twitter CEO (and future Congressional witness) @lindayacc",
    "She's an absolute force: https://twitter.com/...",
    "RIP Free Speech https://twitter.com/...",
    "a right wing Comcast executive https://twitter.com/...",
    "@JoannaStern So was that a “funding secured” sort of tweet? Hopefully it gives her leverage.",
    "when you've lost cat turd 2... https://twitter.com/...",
    "Looks like Kara was right. https://www.wsj.com/... https://twitter.com/...",
    "Chinese smartphone brand Oppo shutters chip design unit amid sufficiency drive",
    "China's Oppo to cease chip development amid smartphone gloom",
    "No more MariSilicon? OPPO is shutting down its custom chip unit.",
    "Oppo gives up on building custom chips for its flagship phones",
    "Oppo abruptly shuts down chip unit responsible for MariSilicon chips",
    "OPPO ceases operations of chip design unit responsible for MariSilicon X",
    "China's phone giant Oppo disbands chip design unit as shipments slump",
    "Oppo shuts down chip development - No More MariSilicons",
    "It's The End Of The Road For OPPO's MariSilicon Custom Processors",
    "Oppo axes chip arm Zeku amid declining smartphone market",
    "Oppo shuts down MariSilicon custom chip unit. Will it force others too?",
    "Oppo shuts down own chip division and potential Samsung Foundry client",
    "Oppo's custom MariSilicon chips are all but dead",
    "Oppo disbands in-house chip design unit",
    "Not Quite a Global Rollout: Google Avoids Launching ChatGPT Rival Bard in EU",
    "Why isn't Bard available in Canada or the EU? Here's what Google says.",
    "Google Bard is Not Coming to Europe Because of Concerns it Breaches GDPR Rules",
    "Google ends the waitlist for Bard: Now available for users across 180+ countries",
    "Google releases Bard to the world - but leaves the EU behind",
    "Google Bard AI chatbot is not available in the European Union over potential GDPR concerns",
    "The AI race heats up: Google announces PaLM 2, its answer to GPT-4",
    "Why Google Bard is Not Available in Canada",
    "Here's why Google's Bard AI chatbot is available in 180 countries, but not Canada",
    "Toyota: Car location data of 2 million customers exposed for ten years",
    "Toyota Japan exposed millions of vehicles' location data for a decade",
    "Toyota apologizes for data exposure of more than 2 million vehicles in Japan",
    "Toyota Admits Decade-Long Data Leak Affecting 2.15 Million Customers",
    "Toyota exposed car location data of 2 million drivers for 10 years — what you need to know",
    "Toyota: Data on more than 2 million vehicles in Japan were at risk in decade-long breach",
    "Toyota Japan Exposed Data on Millions of Vehicles For a Decade",
    "Vehicle data of over 2 million Toyota users been publicly available in Japan since a decade",
    "British Entrepreneur Mike Lynch Extradited to U.S. Over HP Case",
    "Darktrace co-founder Mike Lynch extradited to US to face fraud charges",
    "Autonomy founder Mike Lynch detained in US on fraud charges",
    "Mike Lynch: Autonomy founder extradited to US in criminal case",
    "Autonomy founder Mike Lynch flown to US for HPE fraud trial",
    "Autonomy founder Mike Lynch extradited to US",
    "Autonomy founder Mike Lynch extradited to the U.S. to face fraud charges",
    "And that business is never moving back to America and its vassals. https://twitter.com/...",
    "Anthropic's Claude AI can now digest an entire book like The Great Gatsby in seconds",
    "Introducing 100K Context Windows",
    "Anthropic leapfrogs OpenAI with a chatbot that can read a novel in less than a minute",
    "ChatGPT rival Anthropic's Claude can now read a novel in under a minute",
    "Claude AI Can Digest 75,000 Words in Under a Minute",
    "This ChatGPT competitor is making waves by being able to process an entire novel",
    "AI startup Anthropic pushes its chatbot's context window to process 75k words",
    "Anthropic's Claude AI Can Now Process Entire Novels In Under A Minute",
    "Anthropic says its Claude AI can now read a whole book in under a minute",
    "Look out, ChatGPT: this rival chatbot can now read a whole novel in under a minute",
    "AI startup Anthropic unveils moral principles behind chatbot Claude",
    "100k tokens is long enough to be in a relationship. https://twitter.com/...",
    "This has real applications. https://twitter.com/...",
    "Wow. Super impressive. https://twitter.com/...",
    "Context windows will just be a non-issue soon. Love it. https://twitter.com/...",
    "Introducing the AI Sandbox for advertisers and expanding our Meta Advantage suite",
    "Meta advertisers will soon get access to generative AI tools",
    "Meta reveals new generative AI tools for advertisers",
    "Get Ready for AI-Created Ads on Facebook",
    "Meta Introduces AI-Powered Ad Tools: AI Sandbox and Meta Advantage",
    "Meta Introduces AI Tools to Create Ads and Predict Performance",
    "Meta announces AI image generation tools for advertisers",
    "Meta's AI Sandbox Is ‘Playground’ for Facebook and Instagram Advertisers",
    "Meta unveils generative AI tool for Facebook and Instagram advertisers",
    "Facebook owner Meta announces tests of generative AI ads tool",
    "Meta is using AI to build the next generation of online ads",
    "Meta rolls out generative-AI tools for creating Facebook ads",
    "Meta unveils A.I. ‘testing playground’ to help advertisers build campaigns",
    "Meta introduces AI tools to create ads and predict performance",
    "Meta Begins Testing Generative AI Elements for Facebook and Instagram Ads",
    "Silicon Valley Business Journal",
    "Meta is testing out some new generative AI-powered ad tools",
    "Meta Bets Its Future On AI And Advantage+",
    "Meta's Generative AI ‘Sandbox’ Is Also a Creator Play",
    "AI Is Hot—But Meta Is Still ‘Really Interested in the Metaverse,’ Exec Claims",
    "Meta bets its advertising scale can differentiate new generative AI tools",
    "Meta adds generative AI into its ad platform",
    "Meta climbs into ‘AI Sandbox’ with tools for advertisers",
    "Meta rolls out new AI focused tools for advertisers",
    "Meta details generative AI ad tools and large-scale Lattice model architecture",
    "Meta Leadership Team Unveils New AI-Powered Advertising Tools",
    "Meta announces generative AI-powered product suite for ads",
    "Meta just secured a patent for AI generated ads, which could give the company a needed boost",
    "Turn product data into revenue without engineers",
    "Eurobites: EU presses ahead with Black Sea link",
    "Binance.US Exploring Options to Cut Changpeng Zhao's Stake",
    "Binance.US looks to cut founder Zhao's majority stake amid regulatory pressure",
    "Binance.US Explores Ways to Decrease CZ's Dominant Share: The Information",
    "Binance CEO looks to cut majority stake in exchange's US unit: The Information",
    "Binance.US Reportedly Trying To Reduce CZ's Majority Stake In Company",
    "CZ seeks to sell Binance.US stake, Do Kwon calls finances ‘average’ following $176m asset freeze",
    "Binance.US Considers to Reduce Changpeng Zhao's Majority Stake",
    "Binance.US Moves To Reduce CZ's Stake Amid Regulatory Woes",
    "Binance.US Considers Reducing Founder Changpeng Zhao's Control Amid Regulatory Scrutiny",
    "Binance.US seeks to reduce CZ's majority stake",
    "Binance.US Explores Reducing Stake of Changpeng Zhao amid US Regulatory Crackdown",
    "CZ Looking to Offload Some of Majority Stake in Binance US: Report",
    "Binance U.S. founder CZ explores stake reduction amidst regulatory scrutiny",
    "Binance.US Seeks Ways to Reduce CZ's Majority Stake: Report",
    "Binance.US Contemplates Lowering Founder Changpeng Zhao's Stake Amid Regulatory Concerns",
    "Binance.US seeking ways to cut Changpeng Zhao's majority stake: Report",
    "Binance US Seeks To Cut Changpeng Zhao's Controlling Stake In The Exchange",
    "Binance.US may reduce founder Changpeng Zhao's ownership stake: The Information",
    "Just-In: CZ Seeking To Dump Binance.US Stakes Amid CFTC Probe | Coingape",
    "Fractional NFT project Tessera to shut down amid challenging crypto market",
    "Unlock a new pipeline channel: your existing customers",
    "The better way to manage your contacts and deepen relationships",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Yelp: Connect people with great local business.",
    "TikTok: Inspire creativity and bring joy.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/12 - Twitter Has A New CEO",
    "May 10-12HYBRID: Linux Open Source Summit NA + Linux Security Summit NAVancouver",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Byju's closes Rs 2,000-crore debt funding from Davidson Kempner",
    "Byju's raises $250 Mn in debt from Davidson Kempner",
    "Byju's raises $250 million from Davidson Kempner as part of $1 billion round",
    "Byju's raises $250 mn from Davidson Kempner through structured instruments",
    "NFT and Crypto Tax Proposal Progresses in the EU",
    "Terraform CEO Do Kwon to Be Released on Bail in Montenegro",
    "Do Kwon prosecutor warns of flight risk as crypto fugitive granted €400,000 bail and house arrest",
    "Montenegro court releases crypto entrepreneur Do Kwon on bail",
    "Do Kwon Set to Be Released on Bail in Montenegro Travel Document Forgery Case",
    "Terraform's Do Kwon Wins Release on Bail From Montenegro Court",
    "Lawyers of Kwon, Chang-joon Request $400K+ Bail and House Arrest",
    "Montenegro court agrees to release founder of cryptocurrency firm Terraform Labs on bail",
    "Terra Founder Do Kwon Released on Bail in Montenegro",
    "Terra Luna founder Do Kwon's bail terms officially accepted by Montenegro court",
    "Breaking: Do Kwon To Be Released From Jail As Court Accepts $436K Bail",
    "TerraUSD Creator Do Kwon Granted $437,000 Bail In Montenegro",
    "Breaking News: Do Kwon Secures Bail Release from Montenegro Court!",
    "Terra Founder Do Kwon Buys His Way Out Of Jail In Montenegro",
    "Do Kwon Pleads Not Guilty To Faking Travel Documents After Seizure Of His $176M Assets",
    "Terraform Labs Founder Do Kwon to Be Released on $440K Bail (Report)",
    "Montenegro Court Agrees To Release Terraform's Kwon and CFO on Bail",
    "Terraform's Do Kwon pleads not guilty to passport forgery; lawyers propose US$437,000 bail",
    "Do Kwon's Lawyers Ask for His Release on $436,800 Bail",
    "Do Kwon granted bail at €400,000 - against prosecutors wishes",
    "Terraform labs Do Kwon co-founder pleads not guilty to passport fraud in Montenegro",
    "I guess he finally deployed that capital https://twitter.com/...",
    "Seems like a flight risk https://www.theblock.co/...",
    "Elon Musk's bid to end tweet pre-approval faces skeptical court",
    "SEC Is Acting Unfairly Against Crypto Firms Says US Chamber of Commerce",
    "Is the SEC Acting ‘Unlawfully’ in the Digital Assets Space? The US Chamber of Commerce Thinks So!",
    "U.S. Chamber of Commerce joins forces with digital asset industry, criticizes SEC's approach",
    "Can Coinbase Drag US SEC To Provide Clear Crypto Rules After This?",
    "Chamber Of Commerce Backs Coinbase, Slams SEC Regulatory Approach Toward Crypto Assets",
    "Battle Lines Drawn: U.S. Chamber of Commerce Sides with Crypto Industry Against SEC",
    "US Chamber of Commerce blasts SEC's approach to ether, Coinbase",
    "Is the SEC's Regulation of Crypto Unlawful? US Chamber of Commerce Delivers Shocking Verdict!",
    "US Chamber of Commerce sides with crypto industry, blasts SEC",
    "US Chamber of Commerce backs Coinbase in SEC fight",
    "US Chamber of Commerce Slams SEC, Backs Coinbase in Legal Fight",
    "Chamber of Commerce Backs Coinbase in SEC Fight With Scathing Amicus",
    "Coinbase's SEC Complaint Draws Allies Depicting U.S. Regulator as Crypto Bully",
    "Germany's Wingcopter lands €40m investment for drone delivery",
    "Wingcopter bags €40M from EU to scale ‘new era for drone delivery’",
    "Wingcopter raises $44M from EU to scale drone deliveries across the globe",
    "Riot Games leadership shake up, Dylan Jadeja named CEO",
    "Riot Games appoints Dylan Jadeja as new CEO",
    "Riot Games global president A. Dylan Jadeja to become CEO later this year",
    "Riot Games gets new CEO with leadership shake-up",
    "Riot Games Will Get A New CEO Later This Year",
    "LA Tech ‘Moves’: Riot Games and DermTech Welcomes New CEO",
    "Riot Games unveils new CEO as Nicolo Laurent steps down",
    "Riot president Jadeja stepping up to CEO",
    "CEO of League of Legends developer is stepping down, will remain in advisory role “for years”",
    "Riot Games appoints A. Dylan Jadeja as new CEO",
    "Riot introduces new CEO after Nicolo Laurent steps down to ‘focus on family’",
    "Activision, Once Dinged for ‘Frat Boy’ Culture, Hires More Women",
    "setting a new standard for Indians in the gaming industry 😂 ily ty ❤️ https://twitter.com/...",
    "How Lyft's new CEO is ‘copying’ his former boss Jeff Bezos to turn around the company",
    "You can now request a Lyft as soon as you land at the airport instead of waiting for your bags",
    "Lyft Aims to Remove Travel Anxiety With Airport Pickup Feature",
    "Lyft launches new preorder option at airports ahead of a busy summer travel season",
    "silicon valley has uninvented the bus https://www.bloomberg.com/...",
    "Coinbase Classifies PEPE the Frog as a Hate Symbol, Receives Backlash from the PEPE Community",
    "Crypto Twitter attacks Coinbase over Pepe characterization",
    "Coinbase Apologizes After Calling PEPE a ‘Hate Symbol’",
    "Coinbase Apologizes After Describing PEPE Meme Coin As A ‘Hate Symbol’- Backlash Heat Cools Down",
    "Coinbase says ‘we screwed up’ after Pepe the Frog backlash",
    "Coinbase Says it “Screwed Up” in Apology Over Pepe Coin Coverage",
    "‘We screwed up’: Coinbase issues apology for derogatory PepeCoin remarks",
    "Coinbase Boycott Explained: $PEPE Community Reacts to “Hate Symbol” Label",
    "‘We screwed up’ — Coinbase CLO responds to outrage after exchange associated Pepe with hate groups",
    "Memecoin Army Extracts Coinbase Apology After Botched Pepe Newsletter",
    "Just-In: Coinbase Apologizes For Calling PEPE A “Hate Symbol”",
    "Coinbase Says it ‘Screwed Up’ Pepecoin Coverage in Its Newsletter",
    "‘We screwed up’: Coinbase chief legal officer apologizes after Pepe newsletter controversy",
    "Coinbase warns of PEPE alt-right ties, token holders declare war",
    "‘We Screwed Up’: Coinbase Apologizes for Pepe Comments as #DeleteCoinbase Trends",
    "Coinbase Faces Boycott Backlash After Calling PEPE Coin A ‘Hate Symbol’",
    "Coinbase apology  —  $pepe meme token is a trend.  —  Crypto embraced the meme culture …",
    "COINBASE VS PEPE ARMY https://twitter.com/...",
    "BlockFi Crypto Customers Lose Fight Over Disputed Coin Transfers",
    "BlockFi gets court permission to return $297 million to Wallet customers",
    "BlockFi users to get back $297M from Wallet accounts: Report",
    "Setback For BlockFi Users As Judge Rules Against Recovering $300M",
    "BlockFi Will Refund $297 Million to Users",
    "BlockFi Wallet Account Users to Get Back $297 Million: Report",
    "BlockFi customers can get $300M of their assets returned",
    "BlockFi Can Return Nearly $300M to Some Wallet Customers, Judge Rules",
    "Judge Says BlockFi Custodial Account Holders Can Be Repaid $300 Million",
    "BlockFi Customers Lose Battle To Recover $300 Million, U.S. Judge Says",
    "BlockFi receives permission to return $297M to certain customers",
    "Judge says BlockFi customers can be refunded $300 million from custodial wallets: CoinDesk",
    "“Meaningful harm” from AI necessary before regulation, says Microsoft exec",
    "EU draft legislation will ban AI for mass biometric surveillance and predictive policing",
    "AI Act: a step closer to the first rules on Artificial Intelligence",
    "EU lawmakers back transparency and safety rules for generative AI",
    "MEPs vote in raft of amendments to EU AI Act",
    "Europe's AI Act takes next step including training-data rules",
    "EU Parliament in favour of tougher rules for AI Act",
    "AI Act moves ahead in EU Parliament with key committee vote",
    "Sure, A.I. is developing at speed, but so is the regulatory pushback",
    "EU's revised AI Act: Say goodbye to public facial recognition",
    "Proposed EU legislation for AI transparency and safety rules advances",
    "European AI Act moves forward in EU Parliament",
    "EU nears ban on predictive policing and facial recognition after AI Act vote",
    "EU Reaches ‘Milestone’ on Road to Regulating AI",
    "Europe Agrees On Stricter AI Rules for ChatGPT",
    "EU draft AI Act updated with public facial recognition ban",
    "EU lawmakers agree tough measures over use of AI",
    "CYBER: Inside the Italian Mafia's Encrypted Phone of Choice",
    "Twitter's Encrypted DMs Are Deeply Inferior to Signal and WhatsApp",
    "How to send encrypted DMs on Twitter: A step-by-step guide",
    "Twitter's new encrypted message feature criticized by security and privacy experts",
    "Twitter rolled out encrypted messages for verified users in early access on the web",
    "Testing a new encrypted messaging app's extraordinary claims",
    "Twitter Rolls Out Encrypted Messaging, Don't Trust It",
    "Twitter enables encrypted messaging for verified users",
    "Twitter's Encrypted DMs Require Blue Subscription, Aren't Totally Secure",
    "About Encrypted Direct Messages",
    "Secure messaging arrives on Twitter - sort of. 'Don't trust it yet,' Musk warns",
    "Twitter Launches Initial Version of Encryption for DMs",
    "Twitter Launches Not-Actually-Encrypted Encrypted DMs",
    "Twitter DMs are now encrypted but there's one huge catch",
    "Twitter Gets Encrypted DMs, But You Might Not Want To Use Them Yet",
    "Twitter's encrypted DMs are here, but they have many, many limitations",
    "Twitter's verified users get early access to encrypted messaging",
    "You can now encrypt your Twitter DMs - as long as you pay for Twitter Blue",
    "Twitter launches encrypted messaging for verified users",
    "Twitter rolls out encrypted DMs, but only for paying accounts",
    "Early version of encrypted direct messages just launched. Try it, but don't trust it yet.",
    "End-to-end encryption is hard. https://www.engadget.com/...",
    "I'm not angry (or surprised) I'm just disappointed https://www.wired.com/..."
]