[
    "@yaeleisenstat.bsky.social",
    "Artificial intelligence could lead to extinction, experts warn",
    "Top AI researchers and CEOs warn against ‘risk of extinction’ in 22-word statement",
    "OpenAI's Altman and other AI giants back warning of advanced AI as ‘extinction’ risk",
    "AI Poses ‘Risk of Extinction’ on Par With Pandemics and Nuclear War, Tech Executives Warn",
    "Industry leaders warn ‘AI poses risk of extinction’",
    "ChatGPT launched six months ago. Its impact — and fallout — is just beginning | The AI Beat",
    "Runaway AI Is an Extinction Risk, Experts Warn",
    "The AI hallucinations intensify",
    "Leading experts warn of a risk of extinction from AI",
    "Prominent AI leaders warn of ‘risk of extinction’ from new technology",
    "AI could make humans extinct, say top experts and CEOs in stark warning",
    "Eminent AI experts and corporate heads caution about the probability of ‘extinction risk’",
    "AI is an ‘extinction risk’ for humanity, say tech industry leaders",
    "A.I. poses human extinction risk on par with nuclear war, Sam Altman and other tech leaders warn",
    "AI ‘godfather’ Yoshua Bengio feels ‘lost’ over life's work",
    "‘The Risk of Extinction:’ AI Leaders Agree on One-Sentence Warning About Technology's Future",
    "AI, extinction, nuclear war, pandemics ... That's expert open letter bingo",
    "Coalition of AI leaders sees ‘societal-scale risks’ from the technology's misuse",
    "AI experts sign doc comparing risk of ‘extinction from AI’ to pandemics, nuclear war",
    "Risk of extinction by AI should be global priority, say experts",
    "OpenAI execs warn of “risk of extinction” from artificial intelligence in new open letter",
    "Artificial Intelligence leaders warn of ‘risk of extinction’ from AI",
    "Mitigating risk of ‘extinction’ from AI technology should be ‘global priority’, experts say",
    "AI warning: Human extinction threat should be a ‘global priority,’ say experts",
    "Geoffrey Hinton, Yoshua Bengio warn “risk of extinction from AI” in public letter",
    "In 22 Words, Tech Leaders Warn of Colossal AI Risks",
    "ChatGPT creators and others plead to reduce risk of global extinction from their tech",
    "Artificial intelligence could lead to ‘extinction’ of humanity, warn dozens of AI experts",
    "AI Is as Risky as Pandemics and Nuclear War, Top CEOs Say, Urging Global Cooperation",
    "Top AI CEOs, experts warn that humans may face risk of extinction from AI",
    "AI experts and industry leaders issue warning on AI risks",
    "AI poses ‘extinction’ risk comparable to nuclear war, pandemics: experts",
    "Top AI experts warn of tech's ‘risk of extinction’ — similar to nuclear weapons, pandemics",
    "AI industry and researchers sign statement warning of ‘extinction’ risk",
    "We can't put the ChatGPT AI genie back in the bottle, even if it means risking extinction",
    "AI Experts From Google, OpenAI And Elsewhere Issue Dire Extinction Warning",
    "‘Extinction event’ from AI? Yes, tech leaders warn in call for controls",
    "AI poses ‘extinction’ risk comparable to nuclear war, CEOs of OpenAI, DeepMind, and Anthropic say",
    "OpenAI and Google DeepMind CEOs Sign Statement Warning That AI Poses “Risk of Extinction”",
    "Artificial intelligence threatens extinction, experts say in new warning",
    "AI Could Cause Human ‘Extinction,’ Tech Leaders Warn",
    "AI executives warn its threat to humanity rivals ‘pandemics and nuclear war’",
    "Scientists, experts saying mitigating ‘extinction’ risk of AI should be global priority",
    "The Download: how to talk about AI, and Montana's TikTok ban",
    "AI presents ‘risk of extinction’ on par with nuclear war, industry leaders say",
    "Are AI execs worried there's a dark future looming for AI?",
    "Artificial intelligence poses ‘risk of extinction,’ tech execs and experts warn",
    "The hotdog guy in this instance is the New York Times lol https://twitter.com/...",
    "Couldn't buy better PR if you tried https://twitter.com/...",
    "This has quickly become the self aggrandizement super bowl https://twitter.com/...",
    "They're not warning they're bragging https://www.nytimes.com/...",
    "Panicky or visionary? https://twitter.com/...",
    "This seems promising https://www.safe.ai/... (organized by @ai_risks) [image]",
    "I was proud to sign this statement alongside a remarkable list of experts https://twitter.com/...",
    "ChatGPT should include inline tips",
    "A lawyer used ChatGPT to prepare a court filing. It went horribly awry.",
    "Apple Headset Display Specs Revealed By Supply Chain Analyst",
    "Data about Apple's AR headset screens has been leaked",
    "Apple's First AR/VR Headset Could Offer Impressive Display Specs",
    "Apple AR/VR Headset Leak Details Surprising Display Specs",
    "Here's are the specs for Apple's ‘Reality One’ XR headset displays",
    "Apple AR/VR Headset Display Specs Revealed Ahead of WWDC",
    "Leak reveals Apple's mixed-reality headset display specs days ahead of expected WWDC announcement",
    "A new Rumor claims that Apple's XR Headset Display may deliver up to 5,000 nits of Brightness",
    "Apple's Reality Pro headset could feature 4K resolution per eye and 5000 nits of brightness",
    "Apple's rumored VR headset could have ridiculously high-end screens",
    "Apple's mixed reality headset could feature dual displays with 5,000 nits brightness",
    "Apple hints and leaks all but confirm xrOS — here's what we know",
    "Apple's AR/VR headset to boast 8K resolution and 5000 nits brightness",
    "Apple mixed-reality headset display specs leak",
    "Apple Reality Pro leak reveals a seriously high-res display—4K for each eye",
    "Apple Headset to Feature 4K Micro-OLED Displays With 5000 Nits of Brightness [Report]",
    "@9to5mac @apollozac Just not the resolution or refresh rate",
    "The ultimate display coming next Monday. https://twitter.com/...",
    "4000 PPI 🤩 https://twitter.com/...",
    "HoloLens was less than 500 nits. Just for comparison.",
    "MoonPay executives pocketed $150 million raised from Series A",
    "This was among the biggest secondary share sales *ever* for such a young company.",
    "Australian Financial Review",
    "Nvidia set to become first chipmaker valued at over $1 trillion",
    "Nvidia Breaks the $1 Trillion Market Cap Threshold",
    "Nvidia hits $1 trillion market cap as the chipmaker unveils more AI products",
    "Nvidia joins $1 trillion club after beating rivals to AI",
    "Nvidia became a $1 trillion company thanks to the AI boom",
    "Nvidia touches $1 trillion market cap as chipmaker rides AI wave",
    "AI demand briefly catapults Nvidia into $1 trillion club",
    "Nvidia Touches $1 Trillion Mark After Beating Rivals to AI",
    "Nvidia Hits $1 Trillion Market Value",
    "NVIDIA: Revolutionizing the Tech Landscape with Generative AI",
    "Nvidia Stock Hits $1 Trillion Market Cap On AI Supercomputer News",
    "Nvidia becomes a $1 trillion company on the back of AI explosion",
    "Nvidia Enters a Highly Exclusive Club",
    "Nvidia becomes the first chipmaker to hit $1 Trillion market cap, thanks to the AI boom",
    "Nvidia briefly worth $1 trillion thanks to AI boom",
    "Nvidia's market capitalization tops $1T for the first time",
    "Chipmaker Nvidia joins exclusive $1 trillion companies club",
    "Nvidia Soars to $1 Trillion Market Cap on the Back of AI Hype",
    "Nvidia passes $1 trillion market cap as investors fall in love with AI",
    "Chat-powered AI boom is helping rewrite the winners and losers of the chip market",
    "NVIDIA is now worth $1 trillion - and it's all about AI, not gaming GPUs",
    "Nvidia smashes $1trn valuation spurred by its savvy AI deals",
    "Chipmaker Nvidia joins exclusive club of companies with a $1 trillion market capitalization",
    "Nvidia's $1 trillion valuation sees crypto AI tokens surge",
    "Nvidia Surge Results in Historic $1 Trillion Market Valuation",
    "Nvidia stock soars: How the AI boom lifted the chipmaker's market cap",
    "NVIDIA Surpasses $1 Trillion Market Cap",
    "Nvidia hits $1 trillion in market value on booming AI demand",
    "Nvidia Surpasses $1 Trillion Market Capitalization",
    "Nvidia becomes first US chipmaker valued at over $1 trillion; joins exclusive FAANG group",
    "Nvidia joins the trillion-dollar club",
    "Nvidia hits $1T market cap as market opens",
    "Chipmaker Nvidia hits $1 trillion market capitalization",
    "Nvidia hits $1tn market cap as chipmaker rides AI wave",
    "Nvidia Set for $1 Trillion Market Cap",
    "NVIDIA's Value Now Exceeds $1 Trillion",
    "Nvidia stock set to hit $1 trillion market cap for the first time",
    "NVIDIA is now worth 1 trillion dollars",
    "Wall Street's AI obsession pushes Nvidia valuation past $1 trillion mark",
    "Nvidia set to become first US chipmaker valued at over $1 trillion",
    "NVIDIA market cap cracks US$1 trillion mark for first time",
    "Nvidia CEO Gets Rock Star Reception in Taiwan With AI Stock Surge",
    "Nvidia Isn't The Only One Getting a Massive AI Boost",
    "Nvidia Hits $1 Trillion in Market Value on Booming AI Demand",
    "Nvidia Close to $1 Trillion Market Valuation. AI Is Driving the Market.",
    "Why AI Scientists Are Freaking Us Out",
    "An Investment Firm Just Confirmed The Worst: Twitter Is Destroying Itself",
    "Fidelity: Twitter is Now Only Worth a Third of What Elon Musk Paid for It",
    "Fidelity marks down value of Twitter stake again",
    "Twitter is now worth one-third what Elon Musk paid",
    "Twitter is Approving Far More Government Censorship Requests Under Elon Musk",
    "Twitter now worth just 33% of Elon Musk's purchase price",
    "Yikes. This means Fidelity values Twitter around ~$15 billion [image]",
    "Only took seven months, too. https://www.bloomberg.com/... [image]",
    "Destroying that much value in such a short period isn't easy to do. https://twitter.com/...",
    "Elon took on $13bn of debt to buy Twitter https://twitter.com/...",
    "Google's Pixel Watch 2 May Get an Insane Battery Life",
    "The Pixel Watch 2 might kiss Samsung chips goodbye to improve battery",
    "Google's Pixel Watch 2 will reportedly have significantly improved battery life",
    "Pixel Watch 2 could ditch Exynos for Snapdragon and gain more battery life",
    "New Pixel Watch 2 Processor Boosts Battery in a Big Way, Leaked Specs Suggest",
    "Pixel Watch 2 Rumored to Feature the Snapdragon W5 Chipset",
    "This Google Pixel Watch 2 upgrade could solve the first model's biggest problem",
    "This Pixel Watch 2 leak just made it the 2023 smartwatch I can't wait for",
    "Pixel Watch 2 could feature improved processor, more health sensors",
    "Google Pixel Watch 2: News and Expected Price, Release Date, Specs; and More Rumors",
    "Google Rumored to Switch to Snapdragon Chip in Pixel Watch 2",
    "The Pixel Watch 2 will reportedly get a major bump in performance and battery life",
    "Pixel Watch 2 tipped to gain increased battery life thanks to a new chip",
    "Google's Pixel Watch 2 could vastly improve its predecessor's battery life, power, and sensors",
    "Thought the first one would get W5 but it makes sense here https://twitter.com/...",
    "Nvidia CEO Says Intel's Test Chip Results For Next-Gen Process Are Good",
    "Silicon Valley Business Journal",
    "Intel's contract chipmaking business is off to a mixed start",
    "Can Intel Compete With Taiwan Semi? Nvidia CEO Says Test Chips ‘Look Good.’",
    "Nvidia open to partnership with Intel, says CEO",
    "Block Party Resource Center",
    "Block Party's Twitter product is on indefinite hiatus as of May 31",
    "Product FAQ  —  Twitter Product Hiatus Why is Block Party's Twitter product on indefinite hiatus?",
    "just fell to my knees. this app has been so vital to my safety on here https://twitter.com/...",
    "As traditional revenue streams dry up, both HPE and HP target AI-driven growth",
    "HPE rides edge computing, HPC growth in fiscal Q2",
    "2023 Second Quarter Results",
    "HP Misses Revenue Target Amid Continued Soft PC Sales",
    "HP Sales Decline Worse Than Expected as PC Slump Continues",
    "HP Inc. Reports Fiscal 2023 Second Quarter Results",
    "HP Revenues Fall 22 Percent on Lower PC Sales",
    "HP slips as Q2 earnings top expectations, keeps full-year cash flow forecast",
    "HP: AI can change the role of PCs",
    "Beyond data collection: Exploring the uses for online forms - Part I (Payments)",
    "Transak Secures $20M in Series A to Strengthen Development of Web3 Onboarding Solutions",
    "Transak Bags $20 Mn To Scale Web3 Payments & Onboarding Infra Solutions",
    "Series-A Announcement: Transak Secures $20M to Solve Web3 Onboarding End-To-End",
    "Web3 Platform Transak Raises $20 Million Series A",
    "Web3 Startup Transak Secures $20M in a Series A Round Led By CE Innovation Capital",
    "The game programming flex of all time. [video]",
    "This is the 2023 version of the Last of Us Part 2 rope physics https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/30 - Nvidia Joins The $1T Club",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Chinese organisations launched 79 LLMs since 2020",
    "Binance Mulls Letting Some Clients Keep Trading Collateral at Banks: Report",
    "Binance Considers Allowing Traders to Store Collateral in Banks",
    "Binance Has A Master Plan To Manage Crypto Risk By Letting Traders Hold Collateral In Banks",
    "Binance considers allowing traders to secure collateral at banks: Report",
    "Binance considers allowing investors to hold collateral in banks",
    "Binance May Allow Institutional Clients To Keep Collateral At A Bank",
    "Binance Considers Plan for Traders to Hold Collateral in a Bank",
    "Binance in Talks To Let Traders Keep Collateral at a Bank: Bloomberg",
    "Binance mulls plan to let traders hold collateral in a bank: Bloomberg",
    "Just-In: Binance Explores Partnership With Banks To Offset Crypto Risk | Coingape",
    "US agency closes investigation into Tesla game feature",
    "Tesla escapes recalls for allowing ‘in-motion’ gaming in its vehicles",
    "NHTSA ends probe into Tesla's driver-accessible gaming feature",
    "Tesla is off the hook for allowing gaming while driving",
    "Tesla cleared by NHTSA for in-car gaming feature",
    "SCOTUS Declines to Hear Reddit Child Sex Abuse Case, Handing Big Tech a Win",
    "Supreme Court declines request seeking to hold Reddit liable for alleged child porn",
    "U.S. Supreme Court declines to hear bid to sue Reddit over child porn",
    "Sorry, but Alexa can no longer talk like Samuel L. Jackson",
    "Amazon's Alexa Will No Longer Sound Like Shaquille O'Neal",
    "Amazon's Alexa Is Losing Its Celebrity Voices Like Melissa McCarthy & Samuel L. Jackson",
    "Amazon is ending celebrity voices for Alexa that delivered weather, jokes and more",
    "Amazon Scraps Alexa Celebrity Voices, And Samuel L. Jackson Is The First To Go",
    "Amazon ditches Alexa's celebrity voices and will issue refunds upon request",
    "Amazon yanks Alexa's paid celebrity voices, no word on refunds",
    "Amazon is ending support for Alexa's celebrity voices soon",
    "Amazon ends Alexa celebrity voices: How to get a refund on voices you bought",
    "These Celebrity Voices Are Disappearing From Amazon's Alexa",
    "Amazon has discontinued its celebrity voices program for Alexa",
    "Say Goodbye to Amazon Alexa's Celebrity Voices",
    "Amazon Pulls Plug on Alexa Voices From Melissa McCarthy, Samuel L. Jackson, Shaquille O'Neal",
    "Buy a Celebrity Voice for Your Alexa Device? Get Your Refund!",
    "First deep fake ad on Twitter (mis)using a Guardian link https://twitter.com/...",
    "The Gaming Startups Bucking the Funding Drought",
    "Tenstorrent Scores Big Win At LG",
    "Don't underrate China's ability to catch up in chips: Nvidia CEO",
    "Tenstorrent Partners with LG to Build AI and RISC-V Chiplets for Smart TVs of the Future",
    "Tenstorrent and LG ink chiplet development partnership",
    "Canadian AI computing company, LG partner on chips for smart TVs, automotive",
    "Tenstorrent Partners with LG to Build AI and RISC-V Chiplets",
    "AI can do everything, but can crypto do something?",
    "SPACs have collectively lost over $100B of market value. https://www.wsj.com/...",
    "Windows 11, version 22H2 known issues and notifications",
    "Microsoft Surface Pro X webcams quit working last week—flawed workaround issued",
    "Microsoft issues temporary fix for buggy Surface Pro X cameras",
    "Microsoft deploys a temporary fix for faulty Surface Pro cameras. What to know",
    "Microsoft offers a workaround to fix the camera issue on Qualcomm-based Windows PCs",
    "Windows driver woes trip AMD GPU owners, blind Arm-powered cameras",
    "Microsoft shares fix for cameras not working on Surface laptops",
    "Microsoft shares temporary fix for Surface Pro X camera bug",
    "Microsoft Releases Temporary Fix For Surface Pro X Camera Bug",
    "Microsoft issues temporary fix for Surface Pro X camera bug",
    "Microsoft temporarily fixed broken webcams on ARM PCs by lowering their image quality",
    "Microsoft Disables Features to Get Surface Pro X Cameras Working Again",
    "Binance Names Richard Teng Head of All Regional Markets",
    "Binance appoints former Singapore exec as head of regional markets",
    "Binance Crypto Exchange Appoints Richard Teng to Lead All Regional Markets Outside US",
    "Binance eyes Global leadership with New Power Player - Richard Teng",
    "Binance Appoints Richard Teng as Head of Regional Markets Amid Regulatory Scrutiny",
    "Binance Appoints Former MAS Exec as Head of Regional Markets Outside US",
    "Binance names Richard Teng as head of regional markets outside US",
    "ChatGPT continues to hurt ‘homework helper’ Chegg",
    "Gemini's market share declines as regulatory, financial challenges mount",
    "Proposed European SEP Regulation Would Undermine Efficiency, Innovation and Economic Growth",
    "Big Tech's latest bit of astroturfing on EU digital policy https://twitter.com/... [image]",
    "US govt banned NSO's Pegasus, but said to buy rival spyware Paragon Graphite",
    "Cyberweapon Developers Are Ingratiating Themselves With U.S. Officials",
    "Really interesting story that speaks to the limitations of the spyware EO https://www.ft.com/..."
]