[
    "Reddit CEO lashes out on protests, moderators and third-party apps",
    "Dude might be taking the wrong lessons from the last few months",
    "More Reddit layoffs incoming?",
    "So the Reddit CEO sees this as a success story. Wild stuff. https://twitter.com/... [image]",
    "The note Reddit sent to moderators threatening them if they don't reopen",
    "Reddit CEO praises Elon Musk's cost-cutting as protests rock the platform",
    "Reddit CEO praises Elon Musk's cost-cutting as protests rock platform",
    "Reddit CEO praises Elon Musk as protests rock the platform",
    "Reddit CEO Threatens to Boot Moderators Who Back Blackout Protest",
    "Reddit CEO Steve Huffman: 'It's time we grow up and behave like an adult company'",
    "Many Subreddits Still Out of Action as Reddit's API Pricing Protest Continues",
    "Reddit CEO Suggests User Votes to Remove Moderators",
    "Reddit CEO slams protest leaders, saying he'll change rules that favor ‘landed gentry’",
    "Key Facts to Understanding Reddit's Recent API Updates",
    "Reddit releases new fact sheet, says 80% of its top 5,000 communities are open",
    "Reddit's CEO isn't budging on API changes, say goodbye to your favorite apps",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts",
    "Reddit CEO Pushes Back Against Blackout—Will Consider Letting Users Vote Out Moderators",
    "Subreddits need a land value tax. https://twitter.com/...",
    "Steve Huffman really asked Elon Musk to hold his beer... https://www.nbcnews.com/...",
    "never go full elon https://twitter.com/...",
    "Yeah well users should be able to vote out executives https://twitter.com/...",
    "Lol Reddit is only going to get more fun over the next two weeks https://twitter.com/...",
    "It also wasn't designed to pay dividends to shareholders https://twitter.com/...",
    "Reddit CEO slams protesters, calls them “landed gentry”",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Reddit says it won't force subreddits back open (but will it?)",
    "Who art thou landed gentry :-)",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’ - The Verge",
    "Reddit CEO slams protest leaders, calls them ‘landed gentry’",
    "Notice Of Proposed Stipulation and Consent Order",
    "Binance Reaches Deal With Government to Avert U.S. Shutdown",
    "Binance.US Reaches Agreement With SEC to Avoid Full Asset Freeze",
    "Binance, CZ Agree to Repatriate US Customer Assets, SEC Secures Court Order",
    "SEC and Binance.US strike a temporary agreement on asset access",
    "Breaking: Binance, Binance.US Reaches Deal With The US SEC",
    "Binance and SEC Settle: U.S. Customer Funds and Wallet Keys Return Onshore",
    "Binance, SEC strike deal to move all US customer funds, wallet keys back onshore - CoinDesk",
    "Binance to lose access to Binance.US's cryptocurrency under proposed SEC deal",
    "Report: Binance.US Cuts Jobs Following SEC Charges",
    "Binance.US Cuts Staff Amid SEC Lawsuits",
    "Binance.US Starts Firing Staff after SEC Lawsuit",
    "Deal made to Move All U.S. Customer Funds, Wallet Keys Back Onshore",
    "Kick's $100 Million xQc Contract Is More Than LeBron James' $97.1 Million Lakers Deal",
    "Inside the CEO Switch at Twitch",
    "Hasan says Kick will face more scrutiny after signing xQc",
    "Twitch Star xQc Signs $70 Million+ Deal With Rival Platform Kick",
    "xQc Is Ditching Twitch For Kick After Signing $100 Million Deal",
    "Twitch Mega Streamer xQc Signed By Gambling Company For $100 Million",
    "xQc signs $100 million deal with Kick, a new fledgling Twitch competitor",
    "xQc Signs Massive Deal with Kick Streaming Platform",
    "xQc scores unbelievable $100 million deal to start streaming on Kick",
    "Gaming, streaming communities left in shock of xQc's Kick mega-deal: 'You can't make this s**t up'",
    "xQc unterzeichnet 100 Millionen Dollar Deal mit Streaming-Plattform Kick",
    "Felix Lengyel, aka xQC signe un contrat de 100M$ pour aller streamer sur Kick à la place de Twitch",
    "xQc signs $100 million non-exclusive contract with Kick",
    "xQc signs $100 million deal to stream *non-exclusively* on Kick",
    "Louisiana Office of Motor Vehicles",
    "MOVEit Data Breach Impacts OMV",
    "Millions of Americans' personal DMV data exposed in massive MOVEit hack",
    "A Russia-Based Hacking Rampage Hits US Agencies and Exposes Millions",
    "Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "Millions of Oregon, Louisiana state IDs stolen in MOVEit breach",
    "Missouri Office of Administration",
    "State of Missouri Issues Statement on Recent Global Cyberattack",
    "Third MOVEit vulnerability raises alarms as US Agriculture Department says it may be impacted",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "Oregon Department of Transportation",
    "ODOT Data Accessed as Part of Global MOVEit Hack",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "Explainer: How MOVEit breach shows hackers' interest in corporate file transfer tools",
    "More state governments report MOVEit vulnerability exposure",
    "Massive Data Breach Affecting Millions Could Have Broader Impact",
    "Louisiana driver's licenses, auto registrations targeted in massive data breach",
    "Hackers Steal Data on Millions of Oregon, Louisiana Driver's License Holders",
    "Hackers Stole Millions of Driver's Licenses and IDs from U.S. States",
    "Oregon DMV, Louisiana OMV warn residents of MOVEit data breach",
    "Moveit hack: US agencies, banks and universities among latest victims",
    "Ransomware Group Starts Naming Victims of MOVEit Zero-Day Attacks",
    "Every Louisiana driver's license holder exposed in cyberattack",
    "MOVEit: Every Louisiana driver's license holder exposed in colossal cyber-attack",
    "Millions of Americans' Personal Data Exposed in Global Hack",
    "San Francisco Business Journal",
    "Crypto payments platform Wyre shutters, citing bear market conditions",
    "Crypto Infrastructure Provider Wyre to Wind Down Operations Due to Extended Bear Market",
    "Crypto Payments Firm Wyre is Shutting Down",
    "Wyre To Shut Down As Crypto Winter Claims Another Casualty",
    "Wyre Bows Out: Crypto Platform Succumbs to Bear Market",
    "Crypto startup Wyre, once valued at $1.5 billion, officially shuts down",
    "@unrealfred@mastodon.online",
    "Elon Musk, Bernard Arnault to Share Power Lunch in Paris Friday",
    "Linda Yaccarino and the new era of Twitter",
    "Elon Musk Says He Has Improved ‘Corrosive’ Twitter for Most Users",
    "Elon Musk says the Twitter advertiser exodus is all but over",
    "Why the New Twitter CEO's Plans for Twitter 2.0 Left Us Cold",
    "Elon Musk Says Twitter Advertisers Are Coming Back",
    "Ad Buyers Question UGC and Moderation Policies Ahead of Twitter's Muted Cannes Appearance",
    "Musk woos ad giants in Paris to fix Twitter's woes",
    "It's incredible, but in 2023, Musk's only idea left is “pivot to video.”",
    "Ok, maybe he does understand how the ad business works https://twitter.com/...",
    "PIVOT TO VIDEOOOOO https://twitter.com/...",
    "I'm sure this will work out well. https://twitter.com/...",
    "FTC Orders 1Health.io to Improve DNA Data Privacy, Security",
    "DNA Testing Startup Lied To Customers About Deleting Their Data, FTC Alleges",
    "In a first, FTC charges genetic testing firm over failure to protect data",
    "Free compensation benchmarking data from 3,000 startups",
    "Huawei protests EU's phase-out guideline targeting vendor status",
    "Time to rebrand as “https://meet.ai/ , bitch”? https://twitter.com/...",
    "Office of the General Counsel | Federal Trade Commission",
    "Federal Ethics Response to Meta Petition for Chair Khan's Recusal",
    "New from me: https://www.bloomberg.com/...",
    "she should be recused from her job https://twitter.com/...",
    "Lina Khan is behaving like a dictator at the FTC. Sad 😟 https://twitter.com/... [image]",
    "Personalized wealth management, built for tech people",
    "Top 5 tips for establishing your next attendance policy",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/16 - Google Does it Again",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Jack Ma conducts first class as visiting professor at University of Tokyo",
    "Jack Ma Has Recently Been Teaching at A University in Tokyo",
    "Alibaba founder Jack Ma is ‘alive’ and ‘happy,’ top exec says after China's tech crackdown",
    "Micron Vows $600 Million China Investment Weeks After Chip Ban",
    "China's ByteDance Has Gobbled Up $1 Billion of Nvidia GPUs for AI This Year",
    "Nvidia is selling your GPUs to China",
    "One-Minute Daily AI News 6/16/2023",
    "Two Years In, Amazon CEO Andy Jassy Faces Challenges At Every Turn",
    "Addverb, AWS partner to decrease robot deployment times",
    "Now I think it's definitely because the budget was cut",
    "year of efficiency? https://www.cnbc.com/...",
    "Tiger Global is Falling Short of $6 Billion Target for New Fund",
    "Funding and acquisitions in Indian startups this week [12-17 June]",
    "Tiger Global Raises $2.7 Billion, 55% Less Than Target Set Last Fall",
    "owen wilson saying wow [embedded post]",
    "Stack Broverflow. https://twitter.com/...",
    "Introducing New Parent-Managed Meta Accounts for Families",
    "Meta Lowers Age Requirement for Quest VR Headsets to Allow Preteens",
    "Meta to Lower Age for Users of Virtual Reality Headset to 10 From 13",
    "Quest 2 is now okay for 10-year-olds, Meta says",
    "Facebook owner wants preteens to step into virtual reality with its Quest headset",
    "Meta allows 10-year-old kids to use its Quest VR headset",
    "10-year-olds are finally allowed to use the Quest. Here's why that's good",
    "Meta Reduces Age Requirements for VR Accounts",
    "Meta says it's totally fine for 10-year-olds to wear its VR headset, probably",
    "Meta will lower the Quest headset's recommended age from 13 to 10",
    "Meta lowers the minimum age for its Quest headsets from 13 to 10",
    "Trying to tap into the only market that thinks VR is cool https://twitter.com/...",
    "Introducing New Parent-Managed Meta Accounts for Families |  Meta Quest Blog",
    "Countries where the Samsung One UI 6.0 beta program will be available",
    "Samsung Galaxy Z Flip 5 leaked press render highlights phone's exciting new cover display",
    "Samsung Galaxy Z Fold 5 needs to prioritize durability over features — here's why",
    "Samsung Galaxy Z Fold 5 and Flip 5 Could Lie Flat When Folded",
    "Samsung Galaxy Z Flip 5 Leaked Press Photo Reveals Major Updates",
    "Galaxy Watch 6 Smiles For The Camera In Leaked Images",
    "Leaked Samsung Galaxy Z Fold 5 renders reveal thinner bezels",
    "Samsung Galaxy Z Flip5 could have a bigger cover display (like the Motorola Razr+)",
    "Leaked Z Fold 5 renders show it could solve a major foldable phone issue",
    "Samsung Galaxy Z Flip 5 Render Shows the Big Cover Screen in Action",
    "Samsung Galaxy Watch 6: Everything you need to know",
    "New Samsung Z Flip 5 leak highlights a gloriously big cover screen",
    "Google Pixel Fold trade-in prices: How much will you get for your old phone?",
    "This is the Galaxy Z Flip 5 leak we've been waiting for",
    "The New Galaxy Z Flip 5 leak shows a bigger cover display",
    "Samsung Galaxy Z Fold 5 Flaunts A Sweet Hinge Upgrade In Leaked Renders",
    "Leaked Galaxy Z Flip 5 press render shows off the new cover screen",
    "Samsung Galaxy Z Flip 5 shows off its huge outer display in official-looking image",
    "Samsung Galaxy Z Flip 5 showcased in leaked promotional images",
    "Here's the Galaxy Z Flip 5 and Its Big Cover Display",
    "Stunning Samsung Galaxy Z Flip 5 photo leak shows spectacular external display",
    "Breaking: Galaxy Z Flip 5 first official press image leaked",
    "Samsung Galaxy Z Flip 5 official render leak flaunts Music widget on big cover screen",
    "Samsung Galaxy Z Fold 5 press render shows slim form-factor and S Pen",
    "BREAKING: Galaxy Z Flip 5 design revealed via official leaked images",
    "Leaked Samsung Galaxy Z Flip 5 marketing materials confirms larger display",
    "Leaked Samsung Galaxy Z Flip 5 marketing image confirms bigger outer display",
    "First Galaxy Z Flip 5 press render leaks, showing that huge small screen",
    "This is the Samsung Galaxy Z Fold5! Official Image Leaks",
    "Introducing Voicebox: The Most Versatile AI for Speech Generation",
    "Meta Unveils Speech Generation Model Voicebox",
    "Voicebox is Meta's new speech-related AI model",
    "Meta Unveils Voicebox Generative AI for Text-to-Speech",
    "Meta Unveils Voicebox: The Future of AI-Driven Speech Generation",
    "Voicebox: Text-Guided Multilingual Universal Speech Generation at Scale",
    "Meta Showcases New ‘Voicebox’ Speech-to-Text Translation Tool",
    "Meta's new AI app is both for patients with vocal cord damage and in-game NPCs",
    "Everything you need to know about Meta's AI Voicebox",
    "Meta's new ‘Voicebox’ AI is a text-to-speech tool that learns like ChatGPT",
    "Meta AI Unveils ‘Voicebox’ Speech Generation Model",
    "Meta to Help People Craft More Zuck Deepfakes With ‘Voicebox’ AI",
    "Meta's New Voicebox AI Serves Up Generative Text-To-Speech",
    "Meta unveils speech generation AI: Voicebox",
    "Meta's reveals new text-to-speech Voicebox AI but you can't have it",
    "Meta introduces Voicebox, a generative AI model for speech",
    "Meta reveals AI tool that lets you edit audio, speak in six languages, and more",
    "Meta announces Voicebox, its generative AI model for audio",
    "Let's supercharge personalized voice scams! Thanks Meta! https://twitter.com/...",
    "FRONT PAGE TECH on YouTube",
    "Vision Pro from a Developer's Perspective",
    "Apple Vision Pro Introduction Is Now the Most Watched Video on YouTube",
    "How the Apple Vision Pro compares to Meta's headsets",
    "Vision Pro Introduction Now Apple's Most Watched YouTube Video",
    "this is NOT the future — Apple Vision Pro",
    "Apple's Growth Vision Is Getting Hard for Some to See",
    "Apple's Vision Pro headset is a hobby. Why won't Tim Cook say that?",
    "Vision Pro: Apple assembles manufacturing partners for first-gen headset",
    "I've been informed that an OTA update for VisionOS 1.0 has surfaced. Borealis 21N5165g for N301.",
    "Everything You Need To Know About What We Shared With NYAG",
    "Tether responds to account deactivation controversy, raises compliance checks",
    "NYAG releases documents detailing Tether's exposure to Chinese securities in 2021",
    "Tether Lambasts Media Outlets For False Chinese Securities Tie-Up Claims",
    "A Look at the Reserve Statements That Tether Tried to Conceal",
    "Here's what new Tether documents reveal about its reserves",
    "Tether Counted Securities Issued by Chinese Firms Among Its Reserves: Bloomberg News",
    "Tether responds to reports on Chinese securities backing USDT reserves",
    "Tether on FOIL and Continued Commitment to Transparency",
    "Documents reveal USDT was once backed by Chinese securities",
    "Tether did back USDT with Chinese securities, documents show: Bloomberg",
    "FUD Alert: Tether (USDT) Depegging Signals the Beginning of Uncertainty",
    "Tether Allows Access to Reserves Post Depegging Fiasco",
    "Tether says New York handed over financial documents to CoinDesk",
    "@mostlyharmlessz@muskless.social",
    "@Techmeme this was always suspected but never confirmed, glad to see some truth coming out.",
    "tether getting ahead of the news with cascading short sells https://tether.to/...",
    "Pweeeeass don't write the newsss 👉👈🥺 https://tether.to/... [image]",
    "U.S. Securities and Exchange Commission",
    "BlackRock's application for Bitcoin ETF sparks clarification and potential breakthrough",
    "BlackRock's Bitcoin ETF Would Be a Big Deal",
    "BlackRock ETF: Analyst Reveals Who the Real Beneficiary Will Be",
    "BlackRock could be the break crypto desperately needs",
    "Crypto News : Bitwise Follows BlackRock's Lead, Reapplies for Bitcoin Spot ETF",
    "BlackRock's record of ETFs approved by the SEC is 575-1",
    "Bitwise refiles for Bitcoin spot ETF following BlackRock",
    "Blackrock Files for Bitcoin Trust — Analyst Calls It a ‘Real Deal’ Spot Bitcoin ETF Filing",
    "BlackRock Bitcoin ETF Is the ‘Real Deal’—Is This Finally the One?",
    "BlackRock's New Strategy: This Could Be The Key To Securing Bitcoin ETF Approval",
    "Is BlackRock's clout enough to get its bitcoin ETF past the SEC?",
    "Cryptocurrencies climb to end the week as investors digest BlackRock's bitcoin ETF plans",
    "BlackRock Could Get SEC Approval for Bitcoin ETF With Included New Agreement",
    "BTC Primed For Trillion-Dollar Boost As BlackRock Expects Landmark Bitcoin ETF Approval",
    "Cardano Founder Hoskinson Slams Bitcoin Maxis Who Support BlockRock",
    "BlackRock's Bitcoin ETF surprise sets up battle with Gensler's SEC",
    "BlackRock's iShares Files Paperwork for Spot Bitcoin ETF",
    "Can BlackRock's Bitcoin ETF Help Bitcoin Price Turn Around?",
    "BlackRock files for spot bitcoin ETF, with Coinbase as a crypto custodian",
    "BlackRock Files Application For Bitcoin Spot Exchange Traded Fund",
    "Why Is Bitcoin Up Today?  —  The Bitcoin price has risen 3.2% since yesterday's low of $24,827.",
    "Here's The Impact Of BlackRock's Bitcoin ETF Application On The Cryptocurrency Industry?",
    "BlackRock Joins Race for Spot Bitcoin ETF, Submits Application to SEC",
    "BlackRock Files Bitcoin ETF Application With the SEC",
    "BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian",
    "BlackRock Files for Bitcoin Spot ETF",
    "BlackRock's Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?",
    "Cardano Founder Slams Bitcoin Maxis' “Greed”",
    "BlackRock files paperwork for spot bitcoin ETF: Report",
    "BlackRock Tries for Spot-Bitcoin ETF With Fresh SEC Filing",
    "BlackRock Files Bitcoin Spot ETF Application, Taps Coinbase",
    "How it started: How it's going: [image]",
    "I thought Coinbase was an exchange, how can they be the custodian? https://www.cnbc.com/...",
    "Thirtieth time is the charm? https://twitter.com/..."
]