[
    "Gurman: First M3 Macs may launch by end of the year, chip has more CPU/GPU cores compared to M2",
    "Report: Apple Testing M3 Pro Chips With 12 CPU and 18 GPU Cores",
    "Rumored next-generation Apple Silicon processor expected in fall 2023 at the earliest",
    "Apple's next-gen M3 Pro chip could pack even more CPU and GPU cores",
    "First M3 Macs to arrive in late 2023 with improved CPU/GPU cores",
    "Gurman: Apple Testing ‘M3 Pro’ Chip for MacBook Pro With 12-Core CPU and 18-Core GPU",
    "Apple Testing ‘M3 Pro’ Chip With 12 CPU Cores, 18 GPU Cores [Gurman]",
    "Forget ChatGPT. These Are the Best AI-Powered Apps.",
    "Co-Writing with Opinionated Language Models Affects Users' Views",
    "International Business Times",
    "@ampersarnie@mastodon.social",
    "Twitter limits access to some tweets in Turkey ahead of tightly contested election",
    "Twitter says it will restrict access to some tweets before Turkey's election",
    "Twitter under fire for perceived censorship ahead of election in Turkey",
    "Twitter succumbs to Erdoğan's pressure, silences key voices in Turkey on election eve",
    "Twitter joins Turkey's presidential debate, censoring posts ahead of election",
    "Twitter Restricts Content in Turkey Ahead of Elections",
    "Twitter blocks content in Turkey ahead of pivotal elections after threat to ban platform",
    "Elon Musk faces backlash for content restrictions in Turkey ahead of presidential election",
    "Why Turkey's Election Is All About the Economy",
    "Turkey Quake City 'Won't Vote For Erdogan Again'",
    "Erdogan leads in Turkey's election, but opposition disputes numbers",
    "Results start trickling in for fiercely fought elections that could unseat Turkey's Erdogan",
    "Earthquakes and the economy leave Turkey's Erdogan facing his toughest election battle in years",
    "Turkey election 2023 live news: Voting ends in tight race",
    "@Techmeme There's nothing fishy about that, at all.",
    "Elon got pwned here. https://twitter.com/...",
    "Freedom of speech vs. just a figure of speech. https://twitter.com/...",
    "Lend Twitter some of that donation money so they can fight it too then 🤗 https://twitter.com/...",
    "Free speech absolutist seems super sensitive today https://twitter.com/...",
    "Free speech king Elon Musk strikes again! https://twitter.com/...",
    "this whole Twitter free speech thing is going just as you might expect https://twitter.com/...",
    "Elon Musk, free speech champion https://www.forbes.com/...",
    "How much is ChatGPT Plus and what does the ChatGPT subscription get you?",
    "OpenAI rolling out ChatGPT plugins to Plus users",
    "OpenAI rolls out web browsing and plugins to all ChatGPT Plus users",
    "OpenAI brings 70+ ChatGPT plugins and web search to all ChatGPT Plus users",
    "How to Turn on ChatGPT's New Beta Web Browsing and Plugins Features",
    "Introducing New Features in ChatGPT",
    "@AnnemarieBridy@mastodon …",
    "New York AG fines companies that spammed FCC with fake anti-net neutrality comments",
    "Three Companies Faked Millions of Comments Supporting 2017 Repeal of ‘Net Neutrality’ Rules",
    "‘Virtual Girlfriend’ Chatbot Trained on Conversations With Men Starts Talking Mostly About Sex",
    "This AI girlfriend made $72k in a week",
    "Snapchat influencer launches an AI-powered ‘virtual girlfriend’ to help ‘cure loneliness’",
    "AI is about to take parasocial influencer relationships to the next level",
    "Amazon optimizes delivery network for speedier delivery, lower costs",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "@thomasapowell@fosstodon.org",
    "Privacy and civil rights groups warn against rapidly growing mass-surveillance network",
    "Biometric data is the new oil. https://www.context.news/...",
    "You Don't Need an HDR Display to See Android 14's ‘Ultra HDR’ Photos",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "TikTok: Inspire creativity and bring joy.",
    "Stripe: Help us build universal payments.",
    "Yelp: Connect people with great local business.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP Bonus) Tesla Cofounder Marc Tarpenning",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Pakistan's political turmoil over Imran Khan's arrest, explained",
    "Pakistan Ex-PM Imran Khan Calls For Nationwide Protests",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "‘Support democracy. No question of martial law’ says Pakistan army amid unrest",
    "Imran Khan, the Pakistani politician taking on the army",
    "JioCinema vs Hotstar and other OTTs compared: Which to subscribe and which to skip",
    "JioCinema Unveils Subscription Plan For Premium Content To Take On Netflix, Other OTT Rivals",
    "JioCinema Premium subscription plan launched: Here's everything about it",
    "Indian billionaire Ambani's JioCinema unveils pricing in fight with Netflix, Disney",
    "No more freebies: Ambani's JioCinema to now charge premium subscription for HBO and other content",
    "JioCinema Premium subscription plan launched in India: check out price, list of HBO shows and more",
    "JioCinema makes SVoD debut with HBO, WB shows",
    "JioCinema Premium subscription plan launched as HBO shows arrive on the platform",
    "Indian watchdog has opened up inquiry into Google for breach of anti-trust directive",
    "Google faces antitrust compliance review in India following Match Group complaint",
    "India's CCI probes Google over alleged anti-competitive in-app payment fees. All details inside",
    "Report: Indian Regulator Investigating Google's Fees for In-App Payments",
    "As AI consumes search, what will be left for us humans?",
    "Apple supplier Foxconn turns to in-house EV chips to cut reliance on iPhones",
    "The future of how AI is made and used is at a crossroads. https://www.technologyreview.com/ ...",
    "Inside the Italian Mafia's Encrypted Phone of Choice",
    "*potentially removing jobs. Fixed it for you. https://twitter.com/...",
    "Y'all gonna retract all this in 6 months or nah https://twitter.com/...",
    "Binance leaves Canada due to stricter crypto rules",
    "Binance Faces Regulatory Obstacles in Canada, Decision to Exit Announced",
    "Binance Pulls Out of Canada Amid Tougher Crypto Regulation",
    "Binance pulls out of Canada amid new crypto regulations",
    "Binance will “proactively withdraw” from Canada",
    "Binance pulling out of Canada, says doing business there untenable",
    "Binance to Exit Canada After Country Imposes New Crypto Rules",
    "World's Biggest Crypto Exchange Binance is Leaving Canada",
    "Binance Set To Leave Canadian Market Due To Unfavorable Regulatory Landscape",
    "Binance pulls out of Canada amid tightening crypto regulations",
    "Binance pulls out of Canada, cites incompatibility with local market conditions",
    "Breaking: Binance Will Proactively Withdraw From The Canadian Crypto Marketplace",
    "Binance Exits Canadian Market Due to New Regulations",
    "Binance announces exit from Canada",
    "Binance Says Farewell to Canada Following New Guidance Implementing Restrictions on Exchanges",
    "Binance to stop serving Canadian market, blames new stablecoin guidance",
    "Binance halting operations in Canada",
    "I remember when Binance “exited” the United States https://twitter.com/... https://twitter.com/..."
]