[
    "@profcarroll@federate.social",
    "Google faces EU break-up order over anti-competitive adtech practices",
    "Google's Online Advertising Practices Violate Antitrust Laws, E.U. Says",
    "EU charges Google with anti-competitive practices in ad tech business",
    "EU Hits Google With Antitrust Complain Over its Ad Tech Business",
    "Today's European Commission announcement about our advertising technology",
    "EU regulator orders Google to sell part of ad-tech business",
    "The European Union threatens to break up Google's ad business",
    "Google's ad business violates antitrust laws, EU regulator says",
    "European Commission has accused Google of violating anti-trust laws",
    "Europe seeks break-up of Google ad business, adding to antitrust woes",
    "The EU Wants to Break Up Google's Biggest Business",
    "Google gets EU antitrust charges on ad tech business",
    "Google must break up digital ad business over competition concerns, European regulators say",
    "Google may be forced to break up its ad business after EU charges",
    "Google Ad Business Accused of Breaking EU Antitrust Laws",
    "The EU is going after Google's bread and butter",
    "EU officials accuse Google of antitrust violations in its ad tech business",
    "EU orders Google break up digital ad business for ‘abusing dominant position’",
    "European Commission says Google is partaking in ‘abusive’ ad tech practices",
    "EU proposes breaking up Google over anti-competition concerns",
    "Google's ads business under threat from EU Commission",
    "European Commission files antitrust complaint against Google's ad business",
    "Google Faces Breakup of Ads Business Over EU Antitrust Concerns",
    "Google's Ad Tech Dominance Sparks Breakup Threat From EU",
    "EU Says It May Seek Breakup of Google's Ad-Tech Business",
    "EU slaps Google with antitrust charges over ad tech policies",
    "Brussels hits Google with fresh charges over ad technology",
    "Google should break up digital ad business over competition concerns, European regulators say",
    "The EU is determined to crush Silicon Valley. https://twitter.com/...",
    "Google response to ⁦@EU_Competition⁩ antitrust charges today. [image]",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling",
    "EU suggests breaking up Google's ad business in preliminary antitrust ruling - The Verge",
    "Publications press releases",
    "MEPs ready to negotiate first-ever rules for safe and transparent AI",
    "Europe takes another big step towards agreeing an AI rulebook",
    "EU Lawmakers Vote to Restrict AI Use, Ban Public Face-Scanning",
    "Facial recognition emerges as AI rulebook's make-or-break issue",
    "European lawmakers vote to adopt EU AI Act",
    "Europe plans to put guardrails on ChatGPT and other AI apps",
    "European Parliament Preps AI Regulation Targeting Apps Like ChatGPT",
    "EU moves closer to passing one of world's first laws governing AI",
    "European parliament votes through world's first draft AI bill",
    "Europe passes landmark AI legislation by overwhelming majority",
    "EU lawmakers pass landmark artificial intelligence regulation",
    "AI Regulation Is Here.  Almost.",
    "EU Parliament Approves AI Act as a Step towards Global AI Regulation",
    "EU outlines rules aiming to make it clear when content has been generated by an AI",
    "EU Parliament approves strengthened protections for consumers on AI",
    "Discrimination is a bigger AI risk than human extinction - EU commissioner",
    "Europe Moves Ahead on AI Regulation, Challenging Tech Giants' Power",
    "Markets Await a Fed Pause — but Not an End to Rate Increases",
    "No shit https://twitter.com/...",
    "The Reddit blackout has left Google barren and full of holes",
    "Parts of Reddit are staying dark.  Our search results may suffer for it.",
    "Hundreds of subreddits plan to go dark indefinitely after Reddit CEO's internal memo",
    "Reddit Blackout: Top subreddits pledge revolt will “continue indefinitely”",
    "Reddit protests see some of the most useful Android subreddits ‘go dark’ [U]",
    "Here are some of the major subreddits that will stay down indefinitely",
    "Popular subreddits plan to extend API protests indefinitely",
    "Rolling strikes in force, as a summer of discontent hits Reddit. https://twitter.com/...",
    "“Will pass” .... Maybe not https://t.co/mTERSe2VTx",
    "The Reddit blackout will continue",
    "Indefinite Blackout: Next Steps, Polling Your Community, and Where We Go From Here",
    "/r/linux_gaming should extend the blackout",
    "Reddit subs with millions of followers plan to extend the blackout indefinitely",
    "Electronic Frontier Foundation",
    "@williamgunn@mastodon.social",
    "@christianselig@mastodon …",
    "@ChanceHMiller@mastodon.social",
    "@Aaron@social.aaroncrocco.com",
    "@dcseifert@mastodon.social",
    "Subreddits Are Planning an Indefinite Blackout in Response to Leaked Reddit CEO Memo",
    "Thousands of Subreddits Pledge to Remain Dark to Protest Reddit API Change",
    "Reddit CEO assures employees that API pricing protests haven't hurt revenue",
    "The Reddit blackout shows no signs of stopping",
    "Reddit Blackout: CEO downplays protest. Subreddits vow to keep fighting.",
    "Reddit CEO says everything is fine",
    "Reddit Blackout Crashes The Site As Reddit Users Realize They're In The Power Position",
    "Reddit CEO says blackout protest “will pass”, pissed-off moderators pledge indefinite shutdowns",
    "Reddit CEO unphased by historic Blackout, assures staff it “will pass”",
    "Reddit blackout: Read internal memo shared by CEO Steve Huffman addressing the issue",
    "Reddit CEO Comments on Subreddit Blackout, Tells Employees It ‘Will Pass’",
    "Reddit CEO: Protests are a ‘lot of noise’ that ‘will pass’",
    "Top Reddit Communities Make Blackout Indefinite Following Leaked Memo",
    "New Revelations About Shopify's Deliverr Sale Spotlights CEO",
    "Reddit CEO Steve Huffman Is Confident the Current Sitewide Protest Is No Big Deal",
    "Reddit CEO Tells Employees in a Memo the Blackout ‘Will Pass’",
    "Reddit's CEO doesn't seem worried his social network is on pause",
    "Reddit's top boards are shutting down for 48 hours to protest API prices",
    "Reddit CEO Says Blackout Hasn't Really Cost Them Money Yet And ‘Will Pass’",
    "Subreddits respond to CEO's comments by extending blackouts indefinitely",
    "@christianselig@mastodon.social",
    "my usage of reddit shall too pass https://www.theverge.com/...",
    "There is nothing more heinous than reddit wanting to be a sustainable business.",
    "I think he forgets just how hive-mindey and virtue-flaggy Redditors are https://twitter.com/...",
    "this seems like a great way to absolutely ensure it will never pass https://twitter.com/...",
    "The end of Reddit? Why the blackout is still going - and what happens next",
    "Article: Reddit CEO tells employees that subreddit blackout ‘will pass’.",
    "Good job proving him right",
    "Reddit CEO tells employees that subreddit blackout “will pass”",
    "The Reddit blackout has improved the overall state of Reddit and should remain permanent",
    "Reddit CEO tells employees that subreddit blackout ‘will pass’",
    "Reddit CEO is not negotiating with the hostage takers lmao what will the nerds do now?",
    "Reddit CEO Tells Employees That Subreddit Blackout ‘Will Pass’",
    "Reddit CEO assures employees that API protests haven't hurt revenue",
    "Reddit CEO: Apollo-Related Subreddit Blackouts ‘Will Pass,’ No Significant Revenue Impact So Far",
    "Binance still using Ethereum account suspected of commingling funds",
    "Binance under fire: accused of using Ethereum account to comingle client funds",
    "Binance.US, SEC Not Far Apart on Deal Avoiding Full Asset Freeze",
    "Binance's Cyprus unit seeks deregistration as crypto service provider",
    "U.S. Judge Rebuffs SEC Request for Binance.US Asset Freeze for Now",
    "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "Binance.US and SEC Working to Avoid Asset Freeze",
    "Binance.US and SEC Work On Deal to Avoid Total Asset Freeze: Report",
    "Binance.US Assets Freeze: Judge Urges SEC to Allow Binance to Operate in the U.S.",
    "U.S. Judge Denies Binance.US Asset Freeze For Now",
    "SEC vs Binance: Judge Denies Restraining Order, Calls For Negotiation",
    "Court wants Binance.US, SEC to avoid full asset freeze",
    "Binance gets more time to protest US exchange asset freeze",
    "Binance.US agrees with SEC to avoid full asset freeze",
    "Crypto Scores 4 Major Victories Vs SEC, Is the US Industry Winning?",
    "Binance.US Strives to Prevent Asset Freeze Through Negotiations with SEC",
    "Breaking: US Federal Judge Rejects SEC's Request to Freeze Binance.US Funds",
    "How American courts have become central to crypto law",
    "Binance.US and SEC told to reach compromise on restraining order",
    "Stocks Making the Biggest Moves Midday: Logitech, Toyota, UnitedHealth, AMD & More",
    "AI chip race heats up as AMD introduces rival to Nvidia technology",
    "With no big customers named, AMD's AI chip challenge to Nvidia remains uphill fight",
    "AMD's New Chip Fails to Impress Investors. It's Still an AI Winner, Analyst Says.",
    "Cloud Division Of Amazon is Investing in AMD's New AI Chips",
    "Exclusive: Amazon's cloud unit is considering AMD's new AI chips",
    "AWS is Considering AMD's New AI Chips",
    "Function calling and other API updates",
    "OpenAI Announces API Updates and Price Cuts for Developers",
    "OpenAI updates GPT-4 with new features",
    "OpenAI: Function calling and other API updates.  Huge set of announcements from OpenAI today. …",
    "ChatGPT Owner OpenAI Announces API Updates and Price Reduction",
    "OpenAI rolls out new features while also reducing pricing",
    "OpenAI brings new features to the API of GPT-4 and GPT-3",
    "OpenAI Updates API, GPT-3.5 Turbo, And GPT-4 For Enhanced Generative AI Applications",
    "OpenAI Upgrades GPT-4 and GPT-3.5 Turbo Models, Reduces API Prices",
    "OpenAI rolls out big chatbot API upgrades for developers",
    "lots of good updates including function calling and 16k context 3.5-turbo: https://openai.com/...",
    "16k 3.5 turbo is my hot new friend https://twitter.com/...",
    "New OpenAI update: lowered pricing and a new 16k context version of GPT-3.5",
    "OpenAI intros new generative text features while reducing pricing",
    "International Business Times",
    "FTC awarded temporary restraining order to halt Microsoft's Activision Blizzard deal",
    "Microsoft-Activision Blizzard deal temporarily blocked by US judge",
    "FTC secures restraining order temporarily prohibiting Microsoft-Activision merger from closing",
    "Microsoft-Activision: US judge temporarily blocks $69bn deal",
    "Microsoft Purchase of Activision Temporarily Blocked by Judge",
    "US Judge Temporarily Blocks Microsoft Activision-Blizzard Deal Following FTC Motion",
    "Xbox officially can't buy Activision Blizzard... for now",
    "Court Temporarily Blocks Microsoft's $69B Buyout Of Activision Blizzard After FTC Intervention",
    "Microsoft's Activision acquisition temporarily blocked by US judge",
    "Microsoft-Activision Blizzard merger temporarily blocked by US judge",
    "Microsoft Blocked From Buying Activision For Now, As Judge Grants Temporary Restraining Order",
    "FTC wins a temporary restraining order blocking the Microsoft—Activision deal",
    "Judge Grants FTC's Temporary Restraining Order Against Xbox & Activision Blizzard",
    "FTC has been granted its restraining order to keep Microsoft from buying Activision Blizzard",
    "Judge temporarily blocks Microsoft's $69 billion purchase of Activision",
    "FTC Files Injunction to Block Microsoft's Acquisition of Activision Blizzard",
    "Microsoft Buy Of Activision Blizzard Temporarily Blocked",
    "Microsoft's $69B Activision Blizzard deal temporarily blocked in U.S.",
    "Microsoft has been temporarily restrained from buying Activision Blizzard, judge rules",
    "Samsung might pour a lot of cash into Arm this year",
    "Intel approached to take on key investor role in Arm IPO",
    "Silicon Valley Business Journal",
    "Intel is reporteldy considering taking a big stake in Arm as part of Arm's IPO",
    "Intel in talks to be anchor investor in Arm IPO - source",
    "IBM Achieves Breakthrough In Quantum Computing",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "IBM quantum computer beat a supercomputer in a head-to-head test",
    "Bipartisan bill seeks to deny AI companies liability protections",
    "Fewer people trust traditional media, more turn to TikTok for news, report says",
    "Worldwide, online news is looking a lot more like TikTok and a lot less like “shared articles”",
    "Sharp decline in appetite for news in recent years, Reuters Institute says",
    "Influencers overtaking journalists as news source: report",
    "Social media eclipses publishers as entry point for news: But Facebook fading",
    "TikTok a growing source for news - but from influencers, not journalists",
    "Publishers enjoy a trust bump as more Australians take up digital subscriptions",
    "Leftwing audiences value ABC and SBS much more than rightwing viewers do, survey finds",
    "TikTok and Instagram influencers top list of trusted news sources for today's youth: report",
    "Poor Mastodon https://reutersinstitute.politics.ox.ac .uk/ ... [image]",
    "Starfield Will Help the Growth of PC and Xbox Game Pass - Phil Spencer",
    "Phil Spencer Teases Multiple Games That Weren't Shown In This Year's Xbox Showcase",
    "MERGER OF VODAFONE UK & THREE UK TO CREATE ONE OF EUROPE'S LEADING 5G NETWORKS",
    "Vodafone and Three Merging Networks to Form UK's Largest Mobile Operator",
    "Vodafone and Three agree UK merger, but will regulators block the deal?",
    "UK carriers are taking a page out of US carriers' playbook",
    "Vodafone and Three, two of the UK's biggest carriers, will merge",
    "It's official: Vodafone and Three to tie the knot in the UK",
    "CK Hutchison, Vodafone to merge units to form UK's biggest mobile provider",
    "Vodafone, Hutchison unveil UK mobile merger",
    "Vodafone, CK Hutchison agree UK mobile business merger",
    "Vodafone to merge with Three to create UK giant",
    "Vodafone, Three to merge UK businesses, create largest UK MNO",
    "Vodafone and Three announce UK mega-merger",
    "Vodafone and CK Hutchison agree UK mobile merger",
    "Vodafone, Three to merge UK mobile phone operations to capitalize on 5G rollout",
    "Vodafone and Three agree to £15bn UK merger",
    "Vodafone and Three plan to merge in the UK in a $19B deal (if regulators approve)",
    "Vodafone, Three Merge U.K. Operations to Create 5G Giant, Promise $14 Billion Investment",
    "Vodafone and Three agree to merger in the UK",
    "Vodafone and Three agree merger to form UK's largest mobile operator",
    "Vodafone and Three plan merger to create UK's biggest mobile carrier",
    "Vodafone and Three merger will be UK's largest network, here's what it could mean for you",
    "Vodafone and Three agree UK merger to create biggest mobile player worth £15bn",
    "Vodafone and Three confirm UK merger agreement",
    "Researchers Demo Alarming Exploit That Steals Encryption Keys By Recording Power LEDs",
    "This reads like a plot device from a lame 80s hacker flick https://arstechnica.com/...",
    "Hackers can steal cryptographic keys by video-recording power LEDs 60 feet away",
    "Hackers Can Steal Cryptographic Keys By Video-Recording Power LEDs 60 Feet Away",
    "Open letter by Embracer Group CEO on restructuring program",
    "Embracer Group announces comprehensive restructuring program with immediate implementation",
    "Embracer announces layoffs and game cancellations after a $2 billion deal falls through",
    "Embracer was not the one group to rule them all after $2 billion deal falls through",
    "Embracer Group Is Closing Studios And Cancelling Projects In A Major Restructure",
    "Swedish gaming giant Embracer Group to cut studios",
    "Embracer announces restructuring program, studio closures expected",
    "Tomb Raider, Lord of the Rings owner Embracer to close studios, cancel games",
    "Cyber liability insurance vs. data breach insurance: What's the difference?",
    "Jack Dorsey's plan for decentralized social app may be thwarted by Apple's strict payment rules",
    "Jack Dorsey-Backed Damus App to Suspend Tipping Feature as App Store Threatens Removal",
    "Elon Musk fires back at Apple over bitcoin app removal",
    "Apple wants Bitcoin tipping feature Damus removed from store",
    "Bitcoin Payments Threaten to Remove Damus App From Apple's App Store",
    "Apple will remove Damus app unless it drops Bitcoin tipping feature",
    "Apple to delist Nostr-based Damus app over Bitcoin tip feature",
    "Apple threatens to ban popular social media App over Bitcoin tipping",
    "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted",
    "Apple threatens to remove Damus from App Store over Bitcoin Lightning payments",
    "Due To Bitcoin Payments, Apple Bans Nostr Client Damus From App Store",
    "What a surprise, @tim_cook and @Apple are anti-freedom https://twitter.com/...",
    ".@Apple 🫱🏻‍🫲🏼 censorship Ironic this coincides w/ @OsloFF https://twitter.com/...",
    "Fuck Apple and fuck all of the Big Tech gatekeepers. https://twitter.com/...",
    "Sequoia Is Hunting for Early Deals and More AI as It Splits From China",
    "VC Firm Sequoia India & Southeast Asia Is Now Peak XV Partners",
    "Will Peak XV be able to scale the heights reached by Sequoia?",
    "Peak XV Partners to target US software deals post split",
    "Informatica acquires Privitar to strengthen privacy controls",
    "Informatica acquires Privitar to boost data access management",
    "Informatica bets big on data privacy with Privitar acquisition",
    "Informatica acquires Privatar, a data access management company",
    "Personalized wealth management, built for tech people",
    "Google Bard was reportedly launching in the EU this week, delayed over privacy concerns",
    "Google's AI ambitions just hit another major roadblock",
    "Google's Bard chatbot has been blocked in the European Union over privacy concerns",
    "Google's Bard AI Chatbot Delayed in EU Due to Privacy Concerns",
    "Bard: EU data protectors question Google about chatbot",
    "Irish DPC delays Google Bard AI chatbot launch in the EU",
    "Google Delays Bard AI Launch in the EU Over Privacy Concerns",
    "Google delays EU launch of its AI chatbot after privacy regulator raises concerns",
    "Amazon Fire Max 11 review: I miss Google apps",
    "Amazon Fire Max 11 review: Easily the best Fire tablet yet",
    "Fire Max 11 Review: Amazon Ups Its Tablet Game",
    "Amazon Fire Max 11 Review: The Best Roblox Tablet On The Market Today",
    "Amazon Fire Max 11 review: Punching way above its weight class",
    "Machines are helping doctors become more like humans. https://www.nytimes.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "TechRadar ranks Zoho Recruit as 2023's best recruitment CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/13 - New Beatles Song Thanks To AI",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Hong Kong Protest Song Unavailable on iTunes After Government Seeks Ban",
    "Samsung Electronics picked as most preferred employer after a decade",
    "More flexible workweeks at Samsung, large firms",
    "@paul@social.paulkedrosky.com",
    "Is AI The Cause Of Job Cuts This Year?",
    "EU demonstrates double standards over Huawei",
    "EU funds multiple Huawei projects despite European ban",
    "Medivis Raises $20M Series A to Advance Surgery with Augmented Reality",
    "Mayo Clinic, Disney CEO back AR medtech's $20M investment round",
    "Medivis Raises $20M in Series A Funding",
    "NSO vets raise $18 million Series A for cyber startup Kodem",
    "Kodem Launches with $25M in Funding From Greylock and TPY Capital to Fix Application Security",
    "Kodem employs runtime intelligence to assess application risk for AppSec teams",
    "Application security startup Kodem emerges from stealth with $25M",
    "Cloudera's CEO is stepping down",
    "SEC lawyers say ‘Coinbase is not entitled’ to lawsuit response",
    "SEC Says It May Make a Recommendation on Coinbase Petition Within 4 Months",
    "SEC asks for more time to respond to Coinbase call for crypto clarity",
    "SEC Requests Extension to Respond to Coinbase Regulation Request",
    "SEC Anticipates Responding to Coinbase Petition in 120 Days",
    "SEC Responds to Coinbase's “Baseless” Demand for Regulatory Framework: Says No",
    "SEC Responds to Coinbase Request for Crypto Clarity, Wants More Time",
    "SEC refuses to make any decision on Coinbase's rulemaking petition",
    "Just-In: US SEC Refuses To Commit Deadline in Coinbase Crypto Clarity Case",
    "SEC snubs Coinbase's seven-day rulemaking request but could act by October",
    "SEC Indicates Potential Decision on Coinbase Petition Expected in Upcoming 4 Months",
    "SEC responds to Coinbase's second request for action: ‘Still no’",
    "Over 90% of developers use AI tools at work: Survey",
    "Most developers are already pretty on board with AI",
    "Developer sentiment around AI/ML",
    "AI and coding: How these tech companies are using generative AI for programming",
    "Databricks hits $1B revenue milestone as it doubles down on AI with Rubicon acquisition",
    "Welcome Rubicon to Databricks: The Future of AI Storage and Serving Systems",
    "Logitech Announces CEO Departure",
    "Logitech CEO Bracken Darrell resigns",
    "Logitech CEO is stepping down",
    "Logitech says CEO Bracken Darrell stepping down, to leave company",
    "Logitech's CEO is leaving for another job",
    "Advanced Micro Devices, Inc.",
    "The Third Time Charm Of AMD's Instinct GPU",
    "AMD Has a GPU to Rival Nvidia's H100",
    "AMD says Meta is using its cloud chip as it rolls out AI strategy update",
    "AMD takes on Nvidia with MI300X AI GPU - could it land AWS as a client?",
    "AMD reveals new AI chip challenging Nvidia's dominance",
    "AMD Instinct MI300X accelerator for AI revealed, combines CPU, GPU, and 192 GB of HBM3 memory",
    "AMD launches new Instict MI300X AI chip to take on Nvidia's GPUs",
    "AMD reveals new A.I. chip to challenge Nvidia's dominance",
    "Is The New AMD MI300X Better Than The NVIDIA H100?",
    "AMD Preps GPU to Challenge Nvidia's Grip on the Generative AI Market",
    "AMD Eyes AI, Cloud Expansion With Instinct MI300X, EPYC 97X4 Chips",
    "AMD unveils MI300x AI chip as ‘generative AI accelerator’",
    "AMD makes its case for generative AI workloads vs. Nvidia",
    "What are the odds Nvidia will be pushing out a 144GB H100 in Q4? 🤔 https://twitter.com/...",
    "AMD Expands AI Product Lineup with GPU-Only Instinct Mi300X with 192GB Memory",
    "AMD Expands AI/HPC Product Lineup With Flagship GPU-only Instinct Mi300X with 192GB Memory",
    "Outage of Amazon's cloud service causes some websites to go dark",
    "AWS experiment with Lambda in cloudless configuration fails to impress",
    "Amazon Web Services (AWS) outage temporarily disrupts services, Ethereum network remains resilient",
    "Amazon says AWS is operating normally after outage that left publishers unable to operate websites",
    "Amazon Web Services back after major outage: Check details",
    "AWS experienced outages in the US, but Ethereum kept humming",
    "Amazon's Cloud Computing Service Experiences Regional Outage",
    "Amazon server outage makes some websites go dark",
    "Big Amazon cloud services recovering after outage hits thousands of users",
    "Amazon Alexa, other services stop working; AWS outage causes chaos for users",
    "Amazon Says It's Resolving Outage That Knocked Websites Offline",
    "AWS went down for millions of customers, taking a host of top sites with it",
    "AWS outage causes some websites to go dark",
    "Amazon Web Services briefly hit by wide-ranging outage, impacting major websites",
    "Amazon Web Services Meltdown Temporarily Breaks the Internet",
    "Amazon's cloud computing service recovers from outage",
    "AWS went down, taking parts of the Internet with it — what we know",
    "AWS Outage Appeared to Affect Delta, McDonald's and Others",
    "AWS Outage Downs Other Websites, Apps",
    "Meta releases ‘human-like’ AI image creation model",
    "Meta teaches AI image model to stop generating human fingers like a drunk Picasso",
    "I-JEPA: The first AI model based on Yann LeCun's vision for more human-like AI",
    "Meta Shares New Generative AI Paper, Which Looks at its Advancing Predictive Models",
    "Meta Reveals a New “Human-Like” Artificial Intelligence Model",
    "Method  —  I-JEPA is a method for self-supervised learning.  At a high level …",
    "Self-Supervised Learning from Images with a Joint-Embedding Predictive Architecture",
    "@MetaAI @ylecun Fantastic 👏👏👏🙏",
    "Meta are goated for this Take notes closedAI @openAI https://twitter.com/...",
    "Well if LLM's dont give us AGI, Yann's other projects will xD https://twitter.com/...",
    "Hands-free photos, SpO2 and more for the Pixel family",
    "The Pixel Watch Gets SpO2 Monitoring, and an Expensive New Accessory",
    "New blog articles in Google Nest Community",
    "Introducing the new home panel on Pixel devices",
    "Your Pixel 7 Pro can now get *really* close in videos",
    "Pixel Drop June 2023: Enhanced Safety Features, Hands-Free Photos, and Fitness Updates",
    "Google's June 2023 Pixel Feature Drop is a big one",
    "Google Pixel devices receive massive June feature drop and security patches"
]