[
    "Databricks picks up MosaicML, an OpenAI competitor, for $1.3B",
    "Databricks to Acquire MosaicML",
    "Databricks to Buy Generative AI Startup MosaicML for $1.3 Billion",
    "Databricks acquires MosaicML in $1.3bn deal to democratise generative AI",
    "Databricks is acquiring MosaicML for a jaw-dropping $1.3 billion",
    "Databricks Signs Definitive Agreement to Acquire MosaicML, a Leading Generative AI Platform",
    "Databricks strikes $1.3 bln deal for generative AI startup MosaicML",
    "MosaicML Agrees to Join Databricks to Power Generative AI for All",
    "Databricks acquires MosaicML to make generative AI accessible for every organization",
    "Man, two billion dollar acquisitions today.",
    "AI Software M&A is hot! https://twitter.com/...",
    "Databricks Strikes $1.3B Deal for Generative AI Startup MosaicML",
    "Apple Product Roadmap 2023-24: Over 15 New Devices in Development",
    "Apple is reportedly working on a ton of new gadgets",
    "The next Apple Watch Ultra might arrive sooner than we thought",
    "Apple leaks predict its next 18 launches from iPhones to iMacs - here's the full list",
    "Apple's entire product release roadmap for 2023 and early 2024 may have leaked",
    "Apple preparing a range of new products as new report reveals its 2023-24 pipeline",
    "Apple reportedly plans new Apple Watch Ultra with iPhone 15 this fall",
    "The Vision Pro's top strap could be an extra purchase rather than included in the box",
    "Apple reportedly prepping iMac ‘with a screen over 30 inches’",
    "Apple Watch Ultra 2 coming this Fall, M3-powered Macs on the way too",
    "Apple's Vision Pro can boost Europe's XR kingpin — in the short-term, at least",
    "The fruits of Apple's labor: Roadmap reveals M3 MacBooks, OLED iPads, and more",
    "Apple's M3 iMac refresh could launch within months",
    "Apple Watch Ultra 2 back on for autumn, says report",
    "Apple Watch Ultra 2 reportedly coming this fall — here's what we know",
    "Apple to launch Apple Watch Ultra 2 along with iPhone 15: Report",
    "Apple reportedly working on iMac with 30-inch+ screen",
    "Apple reportedly working on a 30-inch iMac, Apple Watch Ultra 2, and more over the next year",
    "Apple's Vision Pro Headset Reported to Not Include Top Strap in Box Despite Weight Issue",
    "Allegedly arriving in 2023: Apple Watch Series 9 & Ultra 2, but no SE3",
    "All-new 30-inch iMac rumored, updated 24-inch model in development",
    "Major leak reveals every secret Mac Apple is working on",
    "Apple is reportedly working on several Mac models",
    "Mark Gurman: To finish Vision Pro, Apple is roping in 1000s of employees",
    "Second-gen Apple Watch Ultra to launch this fall",
    "Apple Vision Pro May Have A Surprising Omission, New Leak Says",
    "Apple “insider” reveals list of upcoming devices including the second-gen Watch Ultra",
    "Gurman: Apple working on a new iMac with a display larger than 30 inches",
    "Apple's Vision Pro headset may not come with a top strap in the box",
    "Apple's fall roadmap reportedly revealed, including a 30-inch iMac and a M3 MacBook",
    "What to expect from Apple in fall 2023: iPhone 15, Apple Watch Ultra 2, and more",
    "Apple Vision Pro still has a way to go",
    "Rumor | M3 MacBook Pros of all sizes appear on new 2024 Apple product roadmap",
    "A 30\" iMac Pro would be worth the wait! https://twitter.com/...",
    "Apple Has Finally Unveiled the Vision Pro.  Here's What It's Launching Next",
    "New Ultra coming this Fall",
    "Airline 5G mess still not over, expect flight delays from this weekend",
    "A 5G deadline could ground some US flights starting July 1st",
    "Secretary Buttigieg warns of flight delays from July 1 due to 5G",
    "If your flight is delayed or canceled starting July 1st, blame it on 5G",
    "An upcoming 5G deadline could cause airline delays starting July 1st",
    "5G Rollout Could Cause Air Travel Nightmare Starting Next Week",
    "Film and TV Profits Have Collapsed Over the Last Decade",
    "Hollywood is leaving podcasting to podcasters",
    "Taylor Swift turned down Meghan Markle's invite to appear on her podcast",
    "Taylor Swift Turned Down Meghan Markle's Podcast Invite: Report",
    "Taylor Swift turned down Meghan Markle's invite to appear on podcast: report",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Wolfspeed Announces $1.25 Billion Funded Secured Notes Led by Apollo Credit Funds",
    "Chipmaker to Raise Over $1 Billion in Debt From Apollo-Led Group",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "The real story of how Facebook almost acquired Waze, but we ended up with Google",
    "Amazon to invest $100 million in generative AI center as demand for AI applications soars",
    "The AI survey says.... https://twitter.com/... [image]",
    "Korean firms fight talent exodus as chip tech war intensifies",
    "Free compensation benchmarking data from 3,000 startups",
    "US Supreme Court lets Google win stand against Genius suit over song lyrics",
    "@amandamarcotte.bsky.social",
    "Personalized wealth management, built for tech people",
    "There's room for more: Now you can allow up to 5,000 attendees in Zoho Webinar",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Amazon will use small businesses to help deliver packages in the US",
    "Amazon Recruiting Local Businesses for Last-Mile Delivery",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM to acquire software firm Apptio for $4.6 bln",
    "IBM Will Buy Software Company Apptio for $4.6 Billion",
    "IBM acquires hybrid cloud software company Apptio for $4.6B",
    "IBM Buys Software Firm Apptio for $4.6 Billion",
    "IBM to acquire Apptio for $4.6 billion to bolster its cloud and automation capabilities",
    "IBM paying $4.6B in cash for tech software firm Apptio in CEO's latest tech deal",
    "IBM confirms $4.6bn Apptio takeover",
    "IBM Nears Deal for Vista-Owned Apptio",
    "IBM nears $5 billion deal for software provider Apptio, Wall Street Journal reports",
    "IBM nears US$5 billion deal for Apptio",
    "Japan-backed fund JIC to buy chip materials maker JSR for $6.4b",
    "Japan steps into chip supply chain with $6.4bn JSR deal",
    "Japan fund eyes JSR buyout as Tokyo ramps up chip intervention",
    "2023 Engineering Salary Expectations Trends Report",
    "Tech Workers Forgoing Higher Salaries Amid Layoff Crisis",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "45,000 NYC students among the victims of MOVEit global data breach, DOE officials say",
    "NYC student data breached in worldwide MOVEit cyberattack, say city Education Department officials",
    "New York City Department of Education impacted by online security breach",
    "Community Letter on Data Incident",
    "NYC schools hacked with sensitive info on 45,000 students compromised: DOE",
    "Crypto ticks higher, fintech gets interesting again, and fraud is still bad",
    "Proud of you @christinacaci - https://www.techmeme.com/...",
    "Amazon AWS PR: A Signal from a Weakening Heart?",
    "Amazon to Boost Total India Investment to $26 Billion by 2030",
    "@javahippie@freiburg.social",
    "American TikTok user data stored in China, video app admits"
]