[
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "EU approves Microsoft's takeover of Activision Blizzard",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "One Difference Between EU & CMA Led To Different Outcomes on The Microsoft Activision Deal",
    "European Commission gives nod to Microsoft Activision deal",
    "One Approval Down, Two More to Go: Microsoft Wins EU's Approval for Activision Deal",
    "EU approves Microsoft $69 billion acquisition of Activision",
    "European Union approves Microsoft's $69 billion bid for Activision",
    "Microsoft's regulatory concessions in Activision deal may tamper Xbox ecosystem growth",
    "EU regulators approve Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "The EU approves Microsoft-Activision takeover as long as Xbox Cloud cannot unfairly benefit",
    "CMA Stands By Activision Blizzard Decision Despite European Commission's Ruling on Merger",
    "EU Surprises by Approving Microsoft Activision Merger After UK Shut It Down",
    "Boss fight cleared: Europe approves Microsoft's Activision takeover",
    "What's next for the Microsoft-Activision deal after receiving EU approval?",
    "Microsoft Activision Deal Has Been Approved By The EU Regulator",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "EU approves Microsoft's $69 billion acquisition of Activision, clearing a major hurdle",
    "CMA decries EU's Microsoft-Activision approval, stands by rejection",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard",
    "Activision Blizzard EU Approval Doesn't Impress the UK's CMA, Which is Sticking to its Guns",
    "Microsoft's bid to buy Activision Blizzard clears a key hurdle. But the $69B deal is still at risk",
    "EU Regulators Approve Microsoft's Activision Blizzard Acquisition",
    "Restart game? EU approves Microsoft's $69bn Activision bid weeks after UK rejected deal",
    "UK regulator “stands by its decision” to block Activision deal after EU ruling",
    "EU approves Microsoft's Activision Blizzard acquisition",
    "EU Greenlights Microsoft's Massive $69B Acquisition Of Activision-Blizzard",
    "Microsoft and Activision Blizzard clear major hurdle in acquisition saga, but deal isn't done",
    "Microsoft Activision Deal Might Not Be Dead After All, Approved In Europe",
    "Microsoft & Activision Blizzard merger is a go with conditions, says EU regulators",
    "Xbox's Acquisition Of Activision Blizzard Has Been Approved By EU Regulators",
    "EU approves Microsoft's $68.7 billion acquisition of Activision Blizzard",
    "Microsoft's Activison Blizzard Acquisition Approved By EU",
    "EU Approves Microsoft's Acquisition of Activision Blizzard",
    "EU Approves Microsoft's $69 Billion Acquisition of Activision",
    "EU approves Microsoft's $68.7bn Activision Blizzard bid",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "The EU officially approves Microsoft's acquisition of Activision Blizzard",
    "E.U. breaks with Britain and U.S. to clear Microsoft's Activision deal",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "Microsoft wins EU approval for $69bn Activision Deal",
    "European Commission approves Microsoft's Activision Blizzard purchase for Xbox",
    "Microsoft-Activision Buyout Approved By European Commission",
    "EU Makes Microsoft ‘Automatically License’ ActiBlizz Cloud Games Post-Merger",
    "European Union approves Microsoft's purchase of Activision Blizzard King",
    "Microsoft's Activision Purchase Receives Green Light From EU",
    "EU Commission Approves Microsoft's $69B Activision Acquisition",
    "Microsoft's $69 Billion Activision Deal Approved by the EU",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]",
    "Chat Lock: Making your most intimate conversations even more private",
    "Introducing Chat Lock on WhatsApp",
    "WhatsApp launches password-protected folder to hide confidential chats",
    "Chat Lock on WhatsApp will make your ‘extra-special messages’ more private",
    "WhatsApp Chat Lock: The secret to keep your chats even more private",
    "WhatsApp brings chat lock for individual chat threads to Android",
    "WhatsApp Chat Lock: Making Your Most Intimate Conversation Even More Private",
    "WhatsApp's Chat Lock feature makes your most intimate chats even more private",
    "WhatsApp Chat Lock is official to protect your extra special chat",
    "WhatsApp Adds ‘Chat Lock’ for Extra Privacy In-App",
    "New WhatsApp feature further protects your chats from prying eyes",
    "WhatsApp's Chat Lock lets you secure conversations behind a password or biometrics",
    "WhatsApp Now Lets You Lock Chats Behind Passwords Or Biometrics",
    "WhatsApp Introduces New Chat Lock Feature [Video]",
    "New WhatsApp feature lets you lock away your super-sensitive chats",
    "WhatsApp's new privacy feature locks sensitive chats and hides them from notifications",
    "WhatsApp now lets you lock and hide individual chats",
    "WhatsApp's new Chat Lock feature will allow you to protect your intimate conversations",
    "WhatsApp Introduces “Chat Lock” Feature To Hide Conversations",
    "WhatsApp Introduces ‘Chat Lock’ Feature To Protect Your Intimate Conversations",
    "WhatsApp now lets you lock chats with a password or fingerprint ID",
    "WhatsApp's Chat Lock feature will let users password protect their private conversations",
    "WhatsApp launches feature to lock chats",
    "WhatsApp adds chat lock feature to safeguard private conversations",
    "Latest Odisha News, Breaking News Today",
    "Mark Zuckerberg announces new WhatsApp feature ‘Chat Lock’ to safeguard intimate chats",
    "WhatsApp Introduces Chat Lock Feature, Empowering Users with Enhanced Privacy and Security",
    "WhatsApp will allow users to lock and hide conversations, Meta announces",
    "WhatsApp now lets you lock your saucy chats so that no one reads your personal messages",
    "WhatsApp launches Chat Lock feature, allows sender, messages to be hidden",
    "WhatsApp Chat Lock feature launched for private conversations",
    "All WhatsApp users gain a brand new feature to stop nosy friends once and for all",
    "WhatsApp launches Chat Lock feature, what it is, how to use and more",
    "WhatsApp Launches ‘Chat Lock’ Privacy Feature",
    "Mark Zuckerberg announced chat lock feature on WhatsApp for iOS and Android",
    "WhatsApp Adds New “Chat Lock” For More Private Conversations",
    "WhatsApp announces Lock Chat feature for Android, iOS apps: Check details",
    "“No message preview for added privacy.” Let the chaos begin",
    "@wcathcart @WhatsApp With that feature, all private chat apps are dead",
    "New locked chats in WhatsApp make your conversations more private. …",
    "Office of the Maine Attorney General",
    "PharMerica data breach impacts more than 5.8 million individuals",
    "Pharmacy giant PharMerica says medical info of nearly 6 million patients leaked",
    "5.8M records stolen in ransomware attack on pharmacy company PharMerica",
    "PharMerica Leaks 5.8M Deceased Users' PII, Health Information",
    "PharMerica Reports Breach Affecting Nearly 6 Million People",
    "PharMerica Discloses Data Breach Impacting 5.8 Million Individuals",
    "Data of 5.82M PharMerica patients stolen, accessed during cyberattack",
    "PharMerica Notifies 5.8M Individuals of Healthcare Data Breach",
    "IRS Weighs Creating a Government-Run Tax-Prep Option",
    "The IRS is building a government-run system for tax preparation",
    "Watch Out, TurboTax: IRS to Test Free, Online Tax-Filing System",
    "The IRS reportedly has a free TurboTax alternative in the works",
    "IRS could create government-run tax prep option",
    "Black Americans likely audited at higher rates, IRS says",
    "excited to discover why this is unconstitutional https://twitter.com/...",
    "This is awesome. Glad it's finally happening. https://twitter.com/...",
    "Another reminder of how behind the curve US fintech is https://twitter.com/...",
    "Twitter rolls out encryption for direct messages but with key limitations",
    "This company is under two FTC consent decrees for data privacy violations. https://twitter.com/...",
    "Online search to make up lost time with AI",
    "Amazon's conversational AI search plans sound like a nightmare",
    "Amazon plans ‘once-in-a-generation’ changes for Search, job ad reveals",
    "Amazon job listings hint at ChatGPT-like conversational AI for online store",
    "Amazon's online store could be turbo-charged with generative AI features",
    "Amazon is hiring AI engineers to build a ChatGPT-like search interface",
    "Amazon to Add Generative AI to Marketplace Search",
    "Amazon planning conversational AI chatbot for website search",
    "Amazon is building an AI-powered ‘conversational experience’ for search",
    "Google search will be led by generative AI only in the US",
    "Maybe Amazon will launch a voice assistant. https://twitter.com/...",
    "Amazon on AI-search... https://twitter.com/...",
    "Together's $20M seed funding to build open-source AI and cloud platform",
    "Together raises $20m seed funding to build open-source AI models",
    "Together raises $20M to build open source generative AI models",
    "Together raises $20M to decentralize and open-source AI model creation",
    "The AI Startup Together Successfully Secures Funding for Open-Source AI and Cloud Platform",
    "Buffett sheds stake in TSMC, while Macquarie, Fidelity buy shares: filings",
    "Irish Council for Civil Liberties",
    "5 years: GDPR's crisis point — ICCL's 2023 GDPR report",
    "75% of Irish data watchdog's GDPR decisions since 2018 overruled - report",
    "5 years: GDPR's crisis point - ICCL report on EEA data protection authorities",
    "GDPR measures are ‘failing’ to reign in Big Tech, report claims",
    "75 per cent of Irish Data Protection Commissioner decisions overruled, according to report",
    "Free compensation benchmarking data from 3,000 startups",
    "Jump Trading Made $1 Billion in Secret Deal to Prop Up TerraUSD: Report",
    "SEC Says Jump Trading Secretly Propped Up Do Kwon's TerraUSD",
    "Terra Luna Classic Price Prediction: LUNC Consolidates In A Pennant - Where Next?",
    "But I was told they were just “making markets...” https://www.wsj.com/...",
    "Musk Makes First Acquisition for Twitter Parent, Job Tool Laskie",
    "Twitter Agrees to Buy HR Tech Startup Laskie",
    "Elon Musk's Twitter Adds This ‘Acquisition’ Tool",
    "Vodacom, MTN double down as fibre race heats up",
    "MTN unveils plan to build R6-billion Africa fibre cable",
    "Turn product data into revenue without engineers",
    "The better way to manage your contacts and deepen relationships",
    "Trends you should look out for the rest of 2023",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/15 - Media Day On The Podcast",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Coinbase Hasn't Proven SEC Needs to Create Crypto-Specific Rules, Regulator Says",
    "SEC Asks Court to Deny Coinbase Demand for Crypto Rules",
    "SEC Denies Coinbase's Request For Clarity On Crypto Regulation",
    "Crypto Vs SEC: Will Coinbase's Petition Triumph Against SEC's Judicial Scrutiny",
    "SEC in no rush to respond to Coinbase calls for regulatory clarity",
    "SEC Urges Judge to Reject Coinbase Demand for Rules Explanation",
    "SEC seeks denial of Coinbase petition for imminent crypto rules",
    "SEC Responds To Coinbase Complaint: Crypto Rules May Take Years",
    "SEC Wants Court To Dismiss Coinbase Demand for Rules Explanation",
    "The SEC calls Coinbase's suit over digital asset rules petition ‘baseless’",
    "SEC Will Continue Using Enforcement Actions As A Substitute For Rulemaking",
    "Crypto Regulatory Clarity May Take Years: SEC",
    "SEC Chair Gensler Argues That Rules Already Exist To Regulate Crypto in Light of Coinbase Pushback",
    "The SEC basically told Coinbase, “We'll get to it, eventually” https://blockworks.co/...",
    "Ethernovia Raises $64 Million to Accelerate the Revolution of Vehicle Networks",
    "Ethernovia Raises $64M To Boost Electric Vehicle Manufacturing",
    "Ethernovia, an Automotive Ethernet Startup, Receives $64 Million Investment",
    "Ethernovia Raises $64M in Series A Funding",
    "Cloudflare adds AI scanning coverage to protect intellectual property and customer data",
    "Microsoft Completes Rollout of Basic iMessage Support on Windows 11",
    "How to use Phone Link with iPhone to send messages from your PC",
    "How to sync messages between iPhone and Mac",
    "All Windows 11 users can now use iMessage on their PCs",
    "Windows 11 Now Has Its Own Version of Airdrop for iPhone to PC Transfers",
    "With Phone Link for iOS, You Can Use iMessage on a PC (But There's a Catch)",
    "Microsoft launches app for iPhone users to use iMessage on PC",
    "Microsoft's ‘Phone Link’ app for iOS is now rolling out to all Windows 11 customers",
    "Microsoft Bridges the Gap Between iPhone and Windows 11 with Phone Link",
    "Windows 11 just gained one of the primary reasons to buy a Mac",
    "Phone Link for iOS is now available to all Windows 11 users, bringing iMessage and more to PCs",
    "Windows 11 PCs can now send and receive iMessages",
    "iPhone syncing for Windows 11 is now available for everyone",
    "Microsoft releases update that allows iPhone users to text from Windows",
    "Microsoft iMessage on Windows 11, here are the pros and cons [U: Fully rolled out]",
    "Phone Link for iOS is now available to all Windows 11 users",
    "Phone Link for iOS is now available to all Windows 11 customers",
    "How to use Phone Link for iPhone on Windows 11",
    "Microsoft Phone Link for iOS Now Available to All Windows 11 Users",
    "ZestMoney top leadership to form new management after founders leave",
    "ZestMoney 2.0: New leadership, assured variable pay for employees & profitability goals set",
    "India: ZestMoney's founders resign after deal with PhonePe falls through",
    "ZestMoney Founders Resign After PhonePe Deal Collapses",
    "Founders Quit ZestMoney After Acquisition Deal Falls Through: Report",
    "After Failed Acquisition Talks, ZestMoney Founders Quit",
    "Lizzie Chapman, other co-founders of Zest Money resign months after PhonePe acquisition deal fails",
    "ZestMoney founders resign in wake of failed sale",
    "Zip Raises $100 Million Series C at $1.5 Billion Valuation to Revolutionize Procurement",
    "Procurement startup Zip secures $100M funding round",
    "Procurement Startup Zip Lands $100M — Ups Valuation To $1.5B",
    "YouTube TV hits 6.3 million subscribers as all other live TV services shrink",
    "A small cable company is going all-in on YouTube TV for video",
    "Cable TV has fewest subscribers since 1992, YouTube TV is the only riser",
    "YouTube TV passes 6 million subscribers https://9to5google.com/...",
    "Following ChatGPT's success, OpenAI may be releasing an open-source AI model soon",
    "OpenAI readies new open-source AI model - The Information",
    "ChatGPT creator OpenAI is releasing an open-source AI model: Report",
    "Open-source AI continues to celebrate as Big Tech mulls over moats",
    "Open-Source AI Is Gaining on Google and ChatGPT",
    "How Vice Media Became a Money Pit",
    "Microsoft Azure Cloud Services Under Scrutiny from EU Antitrust Regulators",
    "Microsoft's big video game merger just got an extra life",
    "The European Union's antitrust watchdog launches an investigation into Microsoft Azure",
    "EU approves Microsoft's Activision Blizzard acquisition as Azure reportedly faces scrutiny",
    "EU Starts Antitrust Investigation of Microsoft Azure",
    "Microsoft wins EU antitrust nod for Activision deal after UK veto",
    "Microsoft Cloud Service Under Scrutiny From EU Antitrust Arm",
    "John Battelle's Search Blog",
    "EU AI Act To Target US Open Source Software",
    "Google Splits the Web Into “Commercial” and “Non Commercial” Search",
    "First the cookie bullshit, and now this. https://technomancers.ai/... [image]",
    "International Business Times",
    "Japan Loses $721M To North Korean Crypto Hackers; US Is Third Worst-Hit Nation: Report",
    "Japan Was Hacked for $721M in Crypto by N.Korea, Says Nikkei",
    "North Korean hackers stole $721 million in cryptocurrency from Japan - Nikkei",
    "Japan leads world in losses from North Korean crypto hacking with 30% of total: Report",
    "G7 Nations Must Do More to Stop North Korea Crypto Hacks, Japan Suggests",
    "North Korean hackers stole US$721 million in cryptocurrency from Japan",
    "North Korean Crypto Thefts Surpass $2.5 Billion",
    "North Korean hackers steal $497M in crypto from US businesses",
    "@rodhilton@mastodon.social",
    "This free TV comes with two screens",
    "Double-screen ‘free’ TV will show you ads, even when not in use",
    "Pluto TV Co-Founder Launches Telly, the Ultimate Free Television Upgrade for the Living Room",
    "Telly, A Start-Up Led By Pluto TV's Co-Founder, Offers Dual-Screen Smart TVs For Free",
    "Telly will give you a free TV if you'll watch non-stop ads",
    "Telly unveils free big-screen TV supported entirely by advertising; you get it for free",
    "This free TV has a second screen for extra ads - and it could be a privacy nightmare",
    "Want a free TV? Telly will give you one, but there are a couple of stipulations",
    "Telly Offers Free 4K TVs, But with 24/7 Ads Built-In",
    "‘Free’ TV Costs Only Your Constant Attention",
    "This startup will give you a 4K TV for free if you watch nonstop ads",
    "‘Telly’ is a free dual-screen TV powered by ads, includes free Android TV dongle",
    "You can get a 4K TV for free, with a very creative new catch",
    "New company giving away free TVs. Here's how to get one",
    "Telly Launches Dual-Screen, Ad-Supported TV For Free: Here's How To Get One",
    "A Startup From the Co-Founder of Pluto TV Thinks America Is Ready for Free TVs",
    "Startup Telly Offers You a Free 55-inch TV in Exchange For Constant Ads",
    "You Can Now Join the Waitlist for Telly's Free Data-Harvesting TVs",
    "Hardware startup Telly launches a free smart TV entirely supported by ads",
    "Your Next TV Could Be Free (If You Don't Mind a Second Screen Dedicated to Ads)",
    "Telly reveals its free dual-screen TV, complete with ads",
    "This 55-Inch 4K TV Is Free And Has Two Screens—But There Is A Catch",
    "A new company wants to give you a free TV, in exchange for always showing you ads",
    "Dual-screen ‘Telly’ is a crazy new TV that's free, but the second screen constantly shows ads",
    "This Company Will Give You A Free TV In Exchange For Your Data",
    "There's a way to get a free flatscreen TV — but with a catch",
    "You can reserve your free 55-inch ad-supported TV from Telly now, to ship later this year",
    "First Free, Ad-Supported Television Set Readies for Primetime",
    "Telly is looking to give away a half-million free TVs — but there's a catch",
    "hey guys, free hackable TV https://variety.com/...",
    "Whys there a camera and mic attached to this tv? FED WORK!!!!! https://twitter.com/..."
]