[
    "Addressing the distribution of illicit sexual content by minors online",
    "Instagram's recommendation algorithms are promoting pedophile networks",
    "Meta vows to take action after report found Instagram's algorithm promoted pedophilia content",
    "Meta is setting up a taskforce after Instagram was found to guide users to child-sex context",
    "Meta starts task force in fight against child pornography on Instagram",
    "Instagram algorithm boosted ‘vast pedophile network,’ alarming report claims",
    "Instagram's Algorithm Promotes and Connects ‘Vast’ Network of Pedophiles",
    "Meta now lets you buy blue tick for your Facebook, Instagram profile in India",
    "Well this seems terrible https://www.wsj.com/...",
    "Instagram Connects Vast Pedophile Network $META https://www.wsj.com/...",
    "Apple's new Proton-like tool can run Windows games on a Mac",
    "Apple's new toolkit makes it easier for developers to bring Windows games to Mac",
    "Apple hid something AMAZING for Mac gaming at WWDC",
    "Wine comes to macOS: Apple's Game Porting Toolkit powered by CrossOver source code",
    "Unleashing the Gaming Revolution: CrossOver Mac's DirectX 12 Support Update!",
    "You can now run Windows games on Macs with Apple's Game Porting Toolkit",
    "Apple is stealing a trick from the Steam Deck for macOS gaming",
    "CrossOver announces DirectX 12 support coming to macOS this summer",
    "Apple's Game Porting Toolkit Can Run DirectX 12 Games on macOS",
    "Apple has a new toolkit that could make it easier for developers to port PC games to Macs",
    "Diablo 4 and Cyberpunk 2077 now run on a Mac with Apple's new game compatibility toolkit",
    "Apple introduces Proton-like emulation for Windows games on Macs",
    "Apple simplifies porting Windows games to Mac",
    "Windows games can run on Mac thanks to Apple's Proton-like Game Porting Toolkit",
    "Apple unveils new Game Porting Toolkit that runs Windows games on Mac",
    "New DirectX 12-to-Metal translation could bring a world of Windows games to macOS",
    "Mac Gaming to Gain DirectX 12 Support via CrossOver 23",
    "Apple Just Made The Best Windows Games Emulator for MacOS",
    "@dangillmor@mastodon.social",
    "@metacurity@infosec.exchange",
    "Big Tech rolls back misinformation measures ahead of 2024",
    "Apple previews new features coming to Apple services this fall",
    "iOS 17 to Enable Recurring Apple Cash Payments for Kids Allowances and Other Shared Expenses",
    "Apple to expand how digital IDs can be used this fall",
    "Apple Announces Businesses Can Accept iPhone IDs Later This Year",
    "iOS 17 will add support for recurring payments to Apple Cash",
    "Apple highlights new services features coming later this year",
    "iOS 17 makes Apple Cash more useful with recurring payments to friends and family",
    "These are all the features coming to Apple services this fall",
    "Apple Highlights the Best New Features Coming to its Services",
    "Apple Highlights New Features Coming to Apple Services This Fall",
    "Meet Your New Creative Writing Partner — The Jetpack AI Assistant",
    "WordPress has a new AI tool that will write blog posts for you",
    "Introducing Jetpack AI Assistant in WordPress.com",
    "WordPress is getting an AI assistant that will write blog posts for you",
    "WordPress's New AI Tool Can Write Entire Blog Posts For You",
    "WordPress gets an AI assistant that can write blog posts, correct grammar, translate content",
    "Wordpress' New AI Lets You Blog Without Actually Blogging",
    "Wordpress' Jetpack AI will write your blog posts for you",
    "WordPress Now Has An AI Content Generator - Free Access Available",
    "Messi Spurns Giant Saudi Offer for Beckham's Miami, BBC Says",
    "Lionel Messi to join Inter Miami after leaving PSG",
    "Lionel Messi Agrees To Join Inter Miami: Reports",
    "Lionel Messi to join MLS club Inter Miami",
    "Lionel Messi Docuseries Gets Green Light At Apple TV+",
    "Apple to offer Messi MLS revenue share to seal move to Inter Miami",
    "Report: Lionel Messi Will Come To MLS And Join Inter Miami",
    "Lionel Messi headed to Inter Miami as soccer legend makes MLS move",
    "Barcelona Paris Saint-Germain Argentina Apple TV+",
    "Messi has decided. His destination: Inter Miami Leo Messi se va al Inter Miami",
    "MLS broadcaster Apple TV tweeted about Messi to Miami before deleting the tweet. [image]",
    "they're so funny for this [image]",
    "so this is what swayed his decision https://twitter.com/...",
    "MLS, Apple, and Adidas preparing the Messi deal https://twitter.com/... [image]",
    "How to join Apple's beta program and try out new software",
    "Apple Makes Developer Betas Free to Download and Install",
    "iOS 17, iPadOS 17 Developer Beta Available For Free For All",
    "Apple is making developer betas free and accesible to everyone",
    "Apple adds a free tier for its developer program",
    "Apple accidentally released the iOS 17 developer beta to the public",
    "Apple accidentally releases public iOS 17 beta early [u]",
    "Apple will let you install its newest developer betas right now — for free",
    "Users without developer accounts seeing iOS 17 beta [U]",
    "Now anyone can download the iOS 17 Developer Beta 1 for free",
    "4 Reasons Why You Shouldn't Install the iOS 17 Beta on Your iPhone",
    "Apple makes iPhone developer accounts (and betas) free for everyone",
    "Apple's iOS 17 Developer Beta is now free for everyone — but some users are furious",
    "Apple makes downloading iOS 17, iPadOS 17 and other developer betas free",
    "Apple makes OS betas free for all users",
    "Apple's iOS 17 developer beta is now free to install",
    "It wasn't a mistake — Apple betas are now free",
    "iOS 17 cheat sheet: Release date, supported devices and more",
    "Apple's iOS 17 developer beta is available for free",
    "You can now install the iOS 17 developer beta 1 for free, here's how",
    "Apple Developer Program access no longer requires $99 subscription",
    "iPhone users can try out new iOS 17 features without any repercussions or cost",
    "You Can Install MacOS Sonoma Beta Right Now, But Don't",
    "How to download the watchOS 10 beta on your Apple Watch",
    "Rare bug allows non-developer iPhone users to download and install iOS 17 beta",
    "Apple made the iOS 17 developer beta available to everyone — but you probably shouldn't install it",
    "How And When You Can Try Apple's New Software For iPhone, iPad, Mac & More",
    "iOS 17 beta 1 hands-on: A buggy delight that further alienates Android users",
    "Apple Mistakenly Made iOS 17 Developer Beta Available to Everyone",
    "How to get iOS 17 — Quick! You might get it for free",
    "How to download the iOS 17 beta on your iPhone right now",
    "How to install the watchOS 10 Developer Beta",
    "iOS 17 Developer Beta made available to all",
    "WWDC 2023: Here are all the new Health features announced by Apple",
    "iOS 17 beta is here, but only for developers",
    "Download the new iPadOS 17 wallpapers right here",
    "Beta 1 of iOS 17 & iPadOS 17 Available to Download",
    "iPadOS 17 will not launch with marquee ‘Standby’ feature",
    "Apple iOS 17 blunder could make your iPhone unusable",
    "Apple macOS Sonoma: Features, compatibility, more",
    "Apple WWDC 2023: What to expect, from iOS 17 to new MacBooks",
    "@williamgunn@mastodon.social",
    "iOS 17 makes iMessage group chats with Android users more bearable — sort of",
    "iOS 17 might just make iPhone owners hate green bubbles less",
    "iOS 17 swerves around Android to fix green bubble group chats for iPhones",
    "Apple quietly tests iMessage feature that might reduce green bubble bullying",
    "iOS 17 will make life worse for Android users - here's why",
    "Chatting with iPhone users from Android will be even worse in iOS 17",
    "iOS 17 beta brings changes to SMS texting, including ability to edit messages and more",
    "HealthcareInfoSecurity.com",
    "@dannyjpalmer@infosec.exchange",
    "Hackers Issue ‘Ultimatum’ Over Payroll Data Breach",
    "Ransomware group Clop issues extortion notice to ‘hundreds’ of victims",
    "BBC, British Airways among big-name victims in MOVEit software hack",
    "Clop cyber gang claims MOVEit attack and starts harassing victims",
    "Clop Ransomware Gang Asserts It Hacked MOVEit Instances",
    "Clop ransomware claims responsibility for MOVEit extortion attacks",
    "Twitch bans stream sponsor overlays, and “I've never seen creators so pissed”",
    "Twitch apologises as streamers leave after adverts row",
    "Twitch Is Shafting Streamers, Again",
    "Twitch Continues To Excel At Bad Decisions And Worse Communication",
    "Twitch Takes Steps To Limit Sponsorships For Streamers And Then Takes A Step Back",
    "Twitch responds to overwhelming backlash toward new ad policies",
    "Adin Ross Names Two Big Streamers Who Are Not Allowed on Kick",
    "Twitch's new branded content guidelines could prove disastrous for esports",
    "Twitch tries to spin content guidelines change with apology—but no one's falling for it",
    "“This is f*cking everybody over” Asmongold on Twitch's new brand guidelines [video]",
    "International Business Times",
    "Crypto Billionaires' Wealth Crushed by SEC After Big 2023 Bounce",
    "U.S. Securities and Exchange Commission",
    "Breaking Down the SEC's Double Whammy",
    "Binance and Coinbase Show Knives Out for Crypto",
    "The SEC Says These Crypto Assets Are Securities: Their Reasoning Is Wrong",
    "SEC lawsuits against Binance and Coinbase unify the crypto industry",
    "Binance and Coinbase CEOs lose billions over SEC suit",
    "Coinbase CEO Brian Armstrong Unfazed By SEC Lawsuit",
    "Binance, Coinbase CEOs Collectively Lost $1.7 Billion Of Personal Wealth After SEC Crackdown",
    "No More Wild West: SEC Introduces New Era for Crypto",
    "Binance Lawsuit: SEC Now Considers 61 Cryptocurrencies as Securities",
    "Crypto CEOs See Wealth Crushed After SEC's Twin Lawsuits",
    "Crypto chaos as the sector faces SEC crackdown",
    "With Coinbase lawsuit, the US ramps up crypto crackdown",
    "US sues Binance and founder Zhao over ‘web of deception’",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "SEC lawsuits against Coinbase and Binance could result in massive payday for lawyers",
    "Why did the SEC let Coinbase go public?",
    "Prices of Some Crypto Coins Drop After SEC Says They're Securities",
    "SEC charges Coinbase over illegally listing securities",
    "Crypto Crackdown: Coinbase and Binance Lawsuits Shake Markets",
    "Coinbase is being sued by the SEC",
    "Seven bombshells from the SEC's Coinbase suit",
    "Coinbase sued by SEC in New York Federal court",
    "The Feds Are Going After Coinbase. But They Have a Bigger Target.",
    "How to cancel Amazon Prime Video channel and app subscriptions",
    "S&P 500 Is Little Changed, Hovers Near Highest Level Since August: Live Updates",
    "United States District Court for the District of Columbia",
    "Press Release SEC Seeks Emergency Relief to Ensure Binance.US Customers' Assets are Protected",
    "SEC asks for emergency order to freeze Binance US assets anywhere in the world",
    "SEC Seeks Emergency Order to Freeze Binance US Assets",
    "Binance.US says user funds ‘remain safe’ amid SEC attempt to freeze assets",
    "SEC Seeks Freeze of Binance.US Assets",
    "US SEC Files an Emergency Motion in DC Court To Freeze Binance.US Assets — What's in It?",
    "As SEC files motion to freeze Binance assets, crypto market remains green",
    "SEC Files Emergency Action Application To Freeze Binance.US Assets",
    "SEC files motion to freeze cryptocurrency held by Binance.US",
    "CZ Charges: Will DoJ Charge Binance Chief Changpeng Zhao With Fraud, Other Offences?",
    "Asset Freeze Bombshell: SEC Takes Aggressive Stand Against Binance.US",
    "Binance.US Says SEC Lawsuit Is Unjustified",
    "Bitcoin Trades for a Premium on Binance.US Amidst SEC Lawsuit",
    "SEC seeks to freeze $2bn in Binance.US assets, Coinbase vows to take legal fight to Supreme Court",
    "SEC Goes to War With Crypto: Bitcoin Pumps!",
    "What exactly does the SEC claim CZ did with BinanceUS?",
    "SEC files motion for restraining order to freeze Binance US assets",
    "SEC Seeks to Freeze Binance.US Assets, Files Temporary Restraining Order",
    "Binance says US users' crypto is safe after SEC files to freeze assets",
    "SEC Seeks to Freeze Binance.US Assets and Protect Customer Funds",
    "Woo: “Binance customers don't care” about SEC enforcement action",
    "SEC Seeks Court Approval to Freeze Binance US Crypto Assets, Citing Customer Safety Concerns",
    "SEC Wants to Freeze Binance Assets to Protect US Customers",
    "U.S. SEC Files Emergency Motion To Freeze Binance US' Assets",
    "SEC Strikes: Seeks Temporary Restraining Order To Freeze Binance.US Assets",
    "[DB] SEC Seeks Temporary Restraining Order to Freeze Binance US Assets: Court Filing",
    "OMG OMG OMG OMG OMG [image]",
    "Her name was Catherine Coley",
    "🤔 I wonder if Catherine Coley was an informant? https://www.cnbc.com/...",
    "Withdraw from Binance US if you have any funds on the platform. https://twitter.com/...",
    "Cool. And https://binance.us/ definitely has the money, right? Right? https://twitter.com/...",
    "They want them to sell all assets for USD HAHAHAHA https://twitter.com/... [image]",
    "Elusive Ex-Binance.US CEO Catherine Coley Reemerges in SEC Suit",
    "Binance.US to pause OTC Trading Portal, delist some trading pairs after SEC suit",
    "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’",
    "SEC claims Binance spent commingled funds on $11M yacht",
    "SEC seeks freeze on Binance.US assets amid claims",
    "SEC's probe on Binance.US was initiated in 2020, recent court filings reveal",
    "SEC Files Motion To Freeze Assets Of Two Binance.US Units",
    "Binance.US Says Customer Funds Are Safe As SEC Requests Restraining Order To Freeze Assets",
    "SEC seeks express court order to freeze BinanceUS's assets",
    "The SEC sues Binance, unveils 13 charges against crypto exchange in sweeping lawsuit",
    "SEC Asks Court to Freeze Binance.US Assets",
    "Minecraft's Trails & Tales update adds a fan-requested mob, plus cherry blossoms and camels",
    "Build the world of your dreams: Minecraft officially launches on Chromebooks",
    "Minecraft for Chromebooks officially launches",
    "Minecraft now available natively on Chromebooks",
    "Minecraft: Bedrock Edition is Now Officially Available for Chromebooks",
    "Minecraft is releasing a new version for Chromebooks",
    "Minecraft: Trails and Tales update is live, along with official Chromebook support",
    "Minecraft arrives on the Play Store for all Chromebook users",
    "Minecraft Leaves Early Access, Fully Launches on Chromebooks",
    "Minecraft for Chromebook has finally arrived",
    "Minecraft is now available on Chromebook",
    "Minecraft Trails and Tales brings armor trims, hidden treasure, sniffers and more",
    "Florida man (not that one) sold $100M-plus in counterfeit network gear",
    "Cisco Counterfeiter Pleads Guilty to $100m Scheme",
    "Improving search experiences with Enterprise Search on Gen App Builder",
    "Priceline Partnering with Google on New AI Tools",
    "STAT+: Google strikes deal with Mayo Clinic to comb patient records using generative AI",
    "Priceline joins A.I. chatbot race, signing on with Google to help ease travel booking",
    "Priceline Aims to Offer ‘Personal Concierge’ via Google AI",
    "Priceline partners with Google to deploy generative AI",
    "Priceline Charts Businesswide Generative AI Deployments with Google Cloud",
    "Google Brings AI to Priceline to Help Plan Your Vacations",
    "Huawei could be banned from 5G networks across the EU",
    "Cyberdefenders respond to hack of file-transfer tool",
    "EU considers mandatory ban on using Huawei to build 5G - FT",
    "The Download: ocean-based carbon removal, and Musk's untweeted trip to China",
    "EU mulling 5G ban for Huawei and others report",
    "EU considering ban on Huawei 5G - FT",
    "Everyone points to Huawei.  But ZTE is still all over the place",
    "Replika's New AI App Is Like Tinder but With Sexy Chatbots",
    "Introducing Blush, the AI that Improves Romantic Intimacy and Gives Real-Life Dating a Boost",
    "The creators of Replika unveil a new AI dating app called Blush",
    "Venture Capital Giant Sequoia Spins Off China and India Units",
    "Sequoia Capital Announces Upcoming Split amid Growing Brand Confusion and Other Reasons",
    "Will greater local autonomy take Sequoia to new heights?",
    "What Sequoia Should Have Said  —  I remember my jaw dropping last year when The Information's …",
    "US venture capital giant Sequoia to split off China business",
    "Sequoia's three-way split brings abrupt end to global strategy",
    "Sequoia splits China and India arms from US mothership",
    "Personalized wealth management, built for tech people",
    "Tingo Group: Fake Farmers, Phones, and Financials—The Nigerian Empire That Isn't",
    "Fintech Tingo's shares slump as Hindenburg takes short position",
    "With its share price down 55%, Tingo Group will address Hinderburg research allegations today",
    "Tingo lost 94% of value of US-traded shares in 16 months before Hindenburg published allegations",
    "The Tingo Tangle: Hindenberg Research Alleges Fabricated Figures, An ‘Exceptionally Obvious Scam’",
    "Tingo Group Refutes Malicious and Misleading Allegations in Hindenburg Research Report",
    "US-Listed Nigerian ‘Agri-Fintech’ Firm Tingo Rocked By Allegations Of Brazen Fraud",
    "Hindenburg Research publishes investigation into fintech Tingo Group claiming financial fraud",
    "Shortseller Hindenburg Research calls Tingo Group an exceptionally obvious scam",
    "That @HindenburgRes report on tingo is devaststing",
    "Louis Vuitton embraces Web3, launches its iconic trunk as a digital collectible",
    "Louis Vuitton To Release $42,000 Physical-Backed NFTs",
    "Louis Vuitton Vends $41k NFTs to Elite Customers",
    "Louis Vuitton To Debut New NFT Collection For Top Customers",
    "Digital Luxury Unleashed as Louis Vuitton Presents NFT ‘VIA Treasure Trunk’ Experience",
    "Louis Vuitton Selling $41K NFTs That Can't Be Resold",
    "Louis Vuitton Set to Launch $42,000 Physical-Backed NFT Trunks",
    "Louis Vuitton Launches Treasure Trunk Digital Collectible Priced at €39,000",
    "Free compensation benchmarking data from 3,000 startups",
    "Marketing strategies & tips for startups",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/06 - The SEC Sues Coinbase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Amazon Pay Adds Affirm, Providing Customers and Merchants with Another Flexible Payment Option",
    "Microsoft will provide the US government agencies with OpenAI's GPT-4 AI model",
    "Microsoft Azure OpenAI Service now available for government customers",
    "Microsoft unveils OpenAI service for government customers",
    "Microsoft launches generative AI service for government agencies",
    "San Francisco Business Journal",
    "This Is How Sam Altman Works the Press and Congress. I Know From Experience.",
    "OpenAI Inc. CEO Sam Altman says company won't compete with its clients",
    "OpenAI still not training GPT-5, Sam Altman says",
    "Tim Cook reveals he uses ChatGPT and comments on Apple's keen observation of the technology",
    "ChatGPT Maker OpenAI Is Staying Private So It Can Make ‘Strange’ Decisions",
    "Salesforce CEO Benioff shakes up executive team with new hires",
    "Salesforce CEO Benioff shakes up top ranks - source",
    "e-Conomy India 2023  —  Executive Summary A continued shift in consumer and merchant behaviour …",
    "Smaller cities key to India's digital decade",
    "India's digital economy to register 6x growth, reach $1 trillion by 2030",
    "'India's Internet economy to reach $1 trillion by 2030'",
    "India's Internet Economy To Grow Sixfold To $1 Trillion By 2030, Says Google-Temasek-Bain Report",
    "India's internet economy to reach $1T by 2030, contribute 12-13% to GDP: Report",
    "India's Internet economy to grow six-fold to $1 trillion by 2030",
    "India's internet economy to reach US$1 trillion by 2030: Google, Temasek and Bain & Company report",
    "e-Conomy India 2023: Strategies for growth in India's digital decade",
    "GetHarley secures $52M in funding to revolutionize the medical aesthetic industry",
    "GetHarley raises £42m for digital dermatological platform",
    "GetHarley Closes $52 Million Funding Round Led by Index Ventures",
    "GSoft announces CA$125 million investment from CDPQ to accelerate growth strategy",
    "Caisse Invests $93 Million in GSoft to Fund Global Acquisitions",
    "Samsung Will Show Off Next-Gen Foldables in First-Ever Seoul Unpacked",
    "Samsung Foldable Unpacked to be held in South Korea this year",
    "Samsung to Unveil Next Generation Foldable Devices at Galaxy Unpacked in July",
    "Samsung's next foldable-focused Galaxy Unpacked will take place in late July",
    "Samsung's Galaxy Unpacked will take place in South Korea",
    "The Galaxy Z Flip 5, Fold 5 are officially coming earlier than expected",
    "BREAKING: Samsung confirms Galaxy Z Flip 5, Z Fold 5 will launch in July",
    "Samsung picks Seoul to unveil new foldable phones for 1st time",
    "Samsung will focus on foldables in its upcoming July Unpacked event",
    "Samsung confirms details about its upcoming Galaxy Unpacked event: Here's what we know",
    "Samsung Galaxy Z Fold 5: News, leaks, rumored price, and release window",
    "Its official: Samsung Galaxy Z Fold 5 launching on July 26 in Korea",
    "Official: Samsung confirms first Korea Unpacked, Galaxy Z Fold 5 launch on July 27",
    "Samsung confirms Galaxy Unpacked 2023 event in July: What to expect",
    "Samsung's new foldables will be launching this July",
    "Samsung's next Unpacked event is all about foldables - and it's happening sooner than usual",
    "Samsung Galaxy Unpacked 2023: New foldables launching in Seoul next month [details]",
    "Samsung's next-generation foldables will be revealed at Galaxy Unpacked in July",
    "Samsung Galaxy Z Fold 5 and Flip 5 launching late July at Unpacked in South Korea",
    "Samsung confirms Galaxy Z Flip 5, Fold 5 launch details",
    "Samsung Confirms Galaxy Unpacked for Galaxy Fold 5 Happening in July",
    "The press release (archived): [image]",
    "Nuview Receives Investment from Leonardo DiCaprio",
    "Actor Leonardo DiCaprio Invests in NUVIEW's LiDAR Satellite Constellation",
    "Now in beta: Save and sign in with passkeys using 1Password in the browser",
    "1Password ushers in passwordless era, launches passkeys in beta",
    "1Password is bringing its public passkey beta to your browser",
    "Google Workspace users can now log in without a password, thanks to passkeys",
    "1Passwords Launches Beta Support for Passkeys",
    "Are we heading towards a future without passwords?",
    "1Password's latest beta rolls out Chrome passkeys",
    "Passkey is now available on 1Password beta starting today: Here's how to access it",
    "1Password passkeys beta is here: Everything you need to know",
    "Google unlocks passkeys support for Workspace",
    "How to use passkeys with 1Password and ditch your passwords for good",
    "1Password passkey support for the web launches in public beta on the Mac",
    "Google Workspace Now Supports Passkey Login",
    "1Password rolls out Chrome passkeys with latest beta, how to use it",
    "1Password rolls out support for Passkeys in beta for browsers, with limited support on mobile",
    "Apple augments Vision Pro with acquisition of AR startup Mira",
    "An AR headset for work? Apple just bought Mira, a startup that builds exactly that",
    "Apple buys AR headset startup Mira",
    "Apple Acquires AR Startup Mira",
    "Apple acquires a lightweight AR headset startup Mira: Report",
    "Apple confirms acquisition of AR startup Mira following Vision Pro launch: Report",
    "Apple boosts its Vision Pro headset with an AR startup buyout",
    "Apple's AR/VR shopping spree continues",
    "Apple confirms acquisition of AR startup Mira: What this means for its spatial computing dreams",
    "Apple buys enterprise-focused AR headset firm, Mira",
    "Apple acquires augmented reality headset startup",
    "Apple acquires B2B AR startup Mira",
    "Report: Apple Acquires AR Headset Maker Mira",
    "Apple acquires Mira, a startup building lightweight AR hardware",
    "Apple reportedly acquired AR start-up Mira as it pushes new headset vision",
    "Mira made AR headsets for the US Military — and Apple owns the company now",
    "Apple buys AR headset startup Mira - The Verge",
    "@RichLightShed ... Funny part there is Apple looked at buying Within first!",
    "Daily Digest: Marc Benioff tips hand on Salesforce succession plans; Layoffs at Reddit",
    "Reddit to lay off about 5% of workforce: Report",
    "Reddit is the latest tech company to announce layoffs, affecting 5 percent of its workers",
    "Reddit to cut 5% of workforce, slow hiring in restructuring move: report",
    "Reddit lays off over 90 employees, reduces fresh hiring to cut costs",
    "Reddit Laying Off 5% Of Workforce, Joining Tech Sector Contraction",
    "Reddit to lay off about 5% of its workforce as tech job cuts top 200,000",
    "What's Behind the Redditor API Strike",
    "Instagram Reportedly Developing AI Chatbot With 30 Personalities",
    "Instagram is apparently testing an AI chatbot that lets you choose from 30 personalities",
    "Instagram reportedly testing an AI chatbot with 30 personalities",
    "Instagram AI chatbot is in the works - a new companion is coming",
    "Social-Media-Platform-Instagram- Possibly-Working-on-an-AI-Chatbot",
    "Instagram may soon announce its own AI chatbot",
    "Instagram may be looking into ways of thinking instead of its users",
    "Instagram May Be The Next Social Media App To Get An AI Chatbot",
    "Instagram may be preparing an AI-powered chatbot",
    "Instagram may roll out its own AI chatbot in the near future",
    "Instagram is Working on Bringing AI Chatbot for Chats to Make Your Experience More Engaging",
    "Instagram works on AI Chatbots in DMs",
    "Instagram new AI chatbot in DMs will soon be helping you to frame response",
    "Microsoft to pay $20M settlement for illegally collecting children's personal data",
    "Microsoft to pay $20m for child privacy violations",
    "Microsoft to pay $20 million for XBOX children privacy violations",
    "AI's steep costs are already triggering competition concerns",
    "Xbox COPPA violations cost Microsoft $20 million in FTC settlement",
    "Microsoft to Pay $20 Million Penalty for Illegally Collecting Kids' Data on Xbox",
    "Microsoft will pay $20 million for violating children's online privacy on Xbox",
    "Microsoft To Pay $20m For Violating Children's Privacy",
    "Recent Privacy Fines Remind Us Why We Need Web3",
    "Xbox hit with a $20 million fine for 'illegally retaining children's personal information'",
    "Microsoft has been fined $20 million for collecting children's data",
    "Xbox fined $20M for child privacy violations by FTC",
    "Microsoft Settles Charges Over Data Collection on Children Using Xbox",
    "That fine is 49 minutes of Microsoft's revenue."
]