[
    "San Francisco Business Journal",
    "International Business Times",
    "@Noupside@saturation.social",
    "Right-wing Twitter worried Musk's CEO pick could return Twitter to its roots",
    "Linda Yaccarino Leaves NBCUniversal Amid Talks to Become Twitter CEO",
    "Who is Linda Yaccarino, Elon Musk's pick for Twitter CEO?",
    "Elon Musk Appoints Linda Yaccarino as Twitter's New Chief",
    "Elon Musk says he has found new Twitter CEO",
    "Elon Musk says he has found a new CEO for Twitter.",
    "New Twitter CEO May Be Linda Yaccarino",
    "Twitter's new CEO is probably this NBC exec",
    "Three takeaways from Elon Musk's recent spar with new Twitter CEO Linda Yaccarino",
    "From dealing with Musk to fixing Twitter Blue: what's in the next CEO's in-tray?",
    "Twitter Under Elon Musk Is Starting to Look Like SpaceX",
    "Elon Musk is handing a truckload of mess to Twitter's new CEO",
    "Elon Musk picks NBCU's Linda Yaccarino as new Twitter CEO",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "Linda Yaccarino leaves NBCUniversal, adding fuel to the Twitter CEO fire",
    "NBCUniversal says Yaccarino to depart amid reports of Twitter CEO role",
    "Elon Musk names Linda Yaccarino as new Twitter chief",
    "Elon Musk Picks Linda Yaccarino as Next Twitter CEO",
    "RUMOR: Elon Musk To Step Aside At Tesla And Twitter",
    "Elon Musk names Linda Yaccarino new Twitter CEO",
    "Elon Musk to Step Down as Twitter CEO, To Move to Exec Chair and CTO",
    "Five questions new Twitter CEO Linda Yaccarino will have to answer",
    "Elon Musk is Stepping Down as Twitter CEO, Names Replacement",
    "NBCUniversal's Linda Yaccarino resigns, named Twitter CEO",
    "4 things to know about new Twitter CEO Linda Yaccarino",
    "Elon Musk finally finds someone “stupid enough” to take the job as Twitter CEO",
    "How Will Twitter Change Under a New CEO?",
    "Twitter's new CEO is Linda Yaccarino, a longtime ad exec for NBCU",
    "Musk Installs NBCU's Linda Yaccarino to Be His Adult in the Room",
    "Who Is Linda Yaccarino And Why Is Elon Musk's New Twitter CEO So Divisive?",
    "Musk names ex-NBCUniversal exec as new Twitter CEO",
    "Elon Musk picks former NBCUniversal exec to be the new CEO of Twitter",
    "Elon Musk finds new Twitter CEO",
    "Elon Musk Picked Who to Run Twitter?",
    "Elon Musk finally finds ‘someone foolish enough to take the job’ of Twitter CEO",
    "NBCU's Linda Yaccarino in Talks for Twitter CEO",
    "Who is Linda Yaccarino, Elon Musk's pick as the new Twitter CEO?",
    "Meet Twitter's New CEO: Advertising Exec Linda Yaccarino",
    "Elon Musk picks NBC advertising executive as next Twitter CEO",
    "Elon Musk names Linda Yaccarino as new Twitter CEO",
    "Musk Taps Linda Yaccarino As Twitter CEO Replacement",
    "NBCUniversal ad exec Linda Yaccarino will be the new Twitter CEO",
    "Elon Musk appoints new Twitter CEO, NBCU's Linda Yaccarino",
    "Linda Yaccarino Exits NBCUniversal Amid Twitter Talks; Mark Lazarus Assumes Oversight of Ad Sales",
    "Who Is The New Twitter CEO Linda Yaccarino",
    "Elon Musk Officially Announces New Twitter CEO",
    "Meet Twitter's (now confirmed) incoming CEO Linda Yaccarino who just quit NBCUniversal",
    "Twitter's new CEO is an NBCUniversal executive with deep ad industry ties",
    "New Twitter CEO rumoured to be NBC's Linda Yaccarino",
    "Elon Musk names Linda Yaccarino as Twitter CEO",
    "Elon Musk to Step Down as Twitter CEO in Six Weeks",
    "Tesla Shares Print Mild Gains as Elon Musk Is Set to Step Down as Twitter CEO",
    "Elon Musk Confirms Linda Yaccarino as New Twitter CEO",
    "Who is Linda Yaccarino, reportedly Twitter's next CEO?",
    "Twitter CEO Favorite Linda Yaccarino Leaves NBCU",
    "NBCUniversal ad chief leaves as Twitter speculation swirls",
    "Linda Yaccarino is Twitter's new CEO: Here's what to know",
    "Linda Yaccarino Exits NBCUniversal, Mark Marshall Named Interim Ad Sales Chief",
    "Twitter Is Getting A New CEO As Musk Decides To Step Aside",
    "Elon Musk's reported Twitter CEO pick Linda Yaccarino leaving NBCUniversal ‘effective immediately’",
    "Twitter confirms appointment of Yaccarino as new CEO",
    "Elon ‘I Hate Advertising’ Musk Names NBC Ad Exec as Twitter CEO",
    "A New Twitter CEO Won't Change Who Calls the Shots",
    "Twitter's new CEO could be a top NBCUniversal female exec, report says",
    "New Twitter CEO rumored to be ex-TV exec as Elon Musk steps down",
    "Where Does Dogecoin Stand Under Twitter's New CEO Linda Yaccarino's Reign?",
    "Tesla Investors Cheer Elon Musk Stepping Down as Twitter CEO. Why They Shouldn't.",
    "Who is Linda Yaccarino, the possible female CEO of Twitter?",
    "Elon Musk Has Found His Replacement for Twitter CEO",
    "We may already know who Twitter's new CEO is",
    "Twitter's getting a new CEO and it might be this advertising exec",
    "New Twitter CEO Yaccarino A Dogecoin Lover? Profile Reveals A Surprise",
    "Who is Linda Yaccarino - the rumoured new CEO of Twitter?",
    "Elon Musk Steps Down, Meet the New Twitter CEO - Linda Yaccarino",
    "Twitter Chief Elon Musk to Pass on Mantle to New CEO, Takes CTO Role",
    "NBCU exec Linda Yaccarino might be the next Twitter CEO, and here's why",
    "NBCUniversal's Linda Yaccarino is in talks to become Twitter CEO: report",
    "Linda Yaccarino emerges as top candidate for Twitter CEO: What you need to know",
    "NBCUniversal's Linda Yaccarino in talks to run Twitter, Wall Street Journal reports",
    "Elon Musk to step down as Twitter CEO, NBCU's Yaccarino reportedly in the running",
    "Elon Musk Names Linda Yaccarino As Twitter CEO — Update",
    "Elon Musk says he's hired a new Twitter CEO but he will still be around [Update]",
    "Reports: NBC Universal executive will take over as the new CEO of Twitter",
    "Elon Musk says he's picked a new CEO for Twitter",
    "Elon Musk Says He's Stepping Down as Twitter CEO, Will Oversee Product",
    "Elon Musk says a new Twitter CEO is starting in six weeks",
    "Hopefully included in the orientation packet. https://twitter.com/... https://twitter.com/...",
    "The anti Italian bias being displayed toward the new twitter ceo is sickening",
    "Love to see it https://twitter.com/...",
    "Congratulations to new Twitter CEO (and future Congressional witness) @lindayacc",
    "RIP Free Speech https://twitter.com/...",
    "Oh Linda. How did you not see this coming? https://twitter.com/...",
    "She's an absolute force: https://twitter.com/...",
    "Flashback: Elon Musk Calls CEO a ‘Made-Up Title’ https://www.wsj.com/...",
    "He sent these two tweets back to back... https://twitter.com/...",
    "This is so **stupid*** https://twitter.com/...",
    "when you've lost cat turd 2... https://twitter.com/...",
    "a right wing Comcast executive https://twitter.com/...",
    "@JoannaStern So was that a “funding secured” sort of tweet? Hopefully it gives her leverage.",
    "Looks like Kara was right. https://www.wsj.com/... https://twitter.com/...",
    "Linda Yaccarino: an advertising veteran enters the wild world of Musk's Twitter",
    "‘Just What Elon Needs’: New Twitter CEO Linda Yaccarino Is Musk's Bet to Win Back Sales",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Elon Musk's bid to end tweet pre-approval faces skeptical court",
    "Linda Yaccarino To Bring Vaunted Ad Skills To Twitter",
    "HOT TAKE: Twitter Has a New CEO",
    "What to know about Linda Yaccarino, Musk's replacement as Twitter CEO",
    "Former NBCU Ad Exec Linda Yaccarino Is Twitter's New CEO",
    "What to know about Twitter's new CEO Linda Yaccarino",
    "New Twitter CEO is former NBCUniversal exec Linda Yaccarino",
    "Elon Musk's pick for Twitter CEO may be the win he needs",
    "Elon Musk appoints Linda Yaccarino as Twitter CEO",
    "Musk Picks Ad Exec Linda Yaccarino As Twitter CEO",
    "Musk's new Twitter CEO could heal damaged brand, advocates say",
    "Elon Musk Names Former NBC Exec Linda Yaccarino as New Twitter CEO",
    "Linda Yaccarino is Twitter's new CEO: What to know about Elon Musk's pick",
    "Linda Yaccarino says she's inspired by “provocative leadership.” Elon Musk's Twitter fits the bill",
    "NBCU ad chief Linda Yaccarino in talks to lead Twitter",
    "Elon Musk finally hires Twitter CEO: Here's what we know about her",
    "Who is Linda Yaccarino, the new CEO of Twitter?",
    "Elon Musk says he's hired a new CEO for Twitter and will reduce his own role",
    "Elon Musk Selects New Twitter CEO: Let the Speculation Begin",
    "Twitter follower count of new CEO @lindayacc last night (PT) and now https://twitter.com/...",
    "Ex-ByteDance exec claims CCP “maintained” access to U.S. data",
    "Fired ByteDance Exec Says China Exerted ‘Supreme’ Data Control",
    "Former executive of TikTok parent company claims China ‘maintained’ access to US data",
    "Ex ByteDance exec says China's Communist Party has special access to TikTok's US user data",
    "TikTok gives “supreme access” to CCP, says former ByteDance executive",
    "Ex-ByteDance Executive Claims Company Shared Data on U.S. Users With Chinese Government",
    "Ex-ByteDance Engineer Claims Communist Interference in TikTok Owner",
    "Former ByteDance exec claims company used bots to inflate TikTok engagement",
    "TikTok Is Testing Exclusive Deals With Musicians—but It's Definitely Not a Record Label",
    "Warned you. https://twitter.com/...",
    "Binance pulling out of Canada, says doing business there untenable",
    "Binance will “proactively withdraw” from Canada",
    "Binance Quits Canada Citing Unfavorable Regulatory Climate",
    "Binance to Close Canadian Shop Citing Recent Regulatory Changes",
    "Binance pulls out of Canada amid new crypto regulations",
    "Binance pulls out of Canada, cites incompatibility with local market conditions",
    "Binance Set To Leave Canadian Market Due To Unfavorable Regulatory Landscape",
    "Binance to Withdraw From Canadian Market Due to Regulatory Climate",
    "World's Biggest Crypto Exchange Binance is Leaving Canada",
    "Binance Exits Canadian Market Due to New Regulations",
    "Breaking: Binance Will Proactively Withdraw From The Canadian Crypto Marketplace",
    "Binance calls it quits in Canada, blames new rules",
    "Binance To Withdraw From the Canadian Marketplace",
    "Binance pulls out of Canada amid tightening crypto regulations",
    "Binance to Exit Canada After Country Imposes New Crypto Rules",
    "Binance announces exit from Canada",
    "Binance Says Farewell to Canada Following New Guidance Implementing Restrictions on Exchanges",
    "Will Binance Exit U.S. Next After Canada? | Coingape",
    "Binance to stop serving Canadian market, blames new stablecoin guidance",
    "Binance halting operations in Canada",
    "Google's Big Generative AI Experiment Is a Test for Humanity",
    "Marketing automation platform startup Klaviyo files confidentially for U.S. IPO",
    "SoftBank Is Said to Pitch $10 Billion IPO of Chip Designer Arm",
    "Ecom marketing doing $140M ish rev will be lucky to get $3-4B val https://twitter.com/...",
    "Five trends that may change the course of Generative AI models",
    "The future of how AI is made and used is at a crossroads. https://www.technologyreview.com/ ...",
    "WSJ: The Apple headset expected in June is not a finished product",
    "Apple is ‘already anticipating production issues’ ahead of Reality Pro launch",
    "Can Apple's new mixed-reality headset save VR?",
    "Nuro lays off 30 percent of staff, shifts focus to R&D",
    "Free compensation benchmarking data from 3,000 startups",
    "The Athletic and StubHub Announce Exclusive Ticketing Deal",
    "Foxconn accelerates drive for in-house EV chips",
    "The better way to manage your contacts and deepen relationships",
    "Turn product data into revenue without engineers",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "TikTok: Inspire creativity and bring joy.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Yelp: Connect people with great local business.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/12 - Twitter Has A New CEO",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Inside the Italian Mafia's Encrypted Phone of Choice",
    "Tessera and Escher Will Cease All Operations",
    "Paradigm-Backed NFT Startup Tessera Shuts Down",
    "Fractional NFT project Tessera to shut down amid challenging crypto market",
    "“Collective NFT ownership” 🤷‍♂️ https://twitter.com/...",
    "Byju's raises debt of Rs 2,000 crore linked to future Aakash IPO",
    "Byju's raises$250 mn debt from Davidson Kempner Cap",
    "Byju's raises $250 Mn in debt from Davidson Kempner",
    "Byju's Raises $250 Mn As Part Of Ongoing $1 Bn Round",
    "Byju's raises $250 mn from Davidson Kempner through structured instruments",
    "Google Bard hits over 180 countries and territories—none are in the EU",
    "Why isn't Bard available in Canada or the EU? Here's what Google says.",
    "AI Wars: Google's Improved Bard Is Ready to Take On OpenAI's ChatGPT",
    "Google's Bard AI: Global Expansion Excludes European Union and Canada",
    "Google Bard expansion still leaves out plenty of people",
    "Not Quite a Global Rollout: Google Avoids Launching ChatGPT Rival Bard in EU",
    "Google Bard Unavailable in European Union Countries and Canada",
    "Google Bard is Not Coming to Europe Because of Concerns it Breaches GDPR Rules",
    "Google ends the waitlist for Bard: Now available for users across 180+ countries",
    "Google Bard AI chatbot is not available in the European Union over potential GDPR concerns",
    "EU Crypto Tax Plans Include NFTs, Foreign Companies, Draft Text Shows",
    "NFT and Crypto Tax Proposal Progresses in the EU",
    "And that business is never moving back to America and its vassals. https://twitter.com/...",
    "Eurobites: EU presses ahead with Black Sea link",
    "Toyota: Car location data of 2 million customers exposed for ten years",
    "Toyota Japan exposed millions of vehicles' location data for a decade",
    "Toyota apologizes for data exposure of more than 2 million vehicles in Japan",
    "Toyota Admits Decade-Long Data Leak Affecting 2.15 Million Customers",
    "Cloud system error left Toyota customer data exposed for ten years",
    "Toyota has been exposing cloud customer data publicly for a decade due to human error",
    "Toyota reveals potential location breach involving two million vehicles",
    "Toyota accidentally exposed millions of customers' data for nearly a decade",
    "The locations of over 2 million Toyota cars were exposed for 10 years",
    "Toyota Exposed Auto Location of 2M Japanese Customers",
    "Toyota exposed car location data of 2 million drivers for 10 years — what you need to know",
    "Toyota Data Breach Exposed Location Data of 2 Million Customers for a Decade",
    "Toyota: Data on more than 2 million vehicles in Japan were at risk in decade-long breach",
    "Toyota Japan Exposed Data on Millions of Vehicles For a Decade",
    "Vehicle data of over 2 million Toyota users been publicly available in Japan since a decade",
    "China's Oppo to cease chip development amid smartphone gloom",
    "No more MariSilicon? OPPO is shutting down its custom chip unit.",
    "Chinese smartphone brand Oppo shutters chip design unit amid sufficiency drive",
    "China's Oppo to shut down chip design unit as smartphone sales slump",
    "Oppo shutters the unit that designed its custom MariSilicon chips",
    "Oppo shuts down its chip design subsidiary",
    "Oppo reportedly closing its chip design business",
    "China's phone giant Oppo disbands chip design unit as shipments slump",
    "OPPO ceases operations of chip design unit responsible for MariSilicon X",
    "Oppo gives up on building custom chips for its flagship phones",
    "Oppo shuts down chip development - No More MariSilicons",
    "It's The End Of The Road For OPPO's MariSilicon Custom Processors",
    "Oppo abruptly shuts down chip unit responsible for MariSilicon chips",
    "Oppo shuts down MariSilicon custom chip unit. Will it force others too?",
    "Oppo axes chip arm Zeku amid declining smartphone market",
    "Oppo shuts down own chip division and potential Samsung Foundry client",
    "Oppo disbands in-house chip design unit",
    "Anthropic's Claude AI can now digest an entire book like The Great Gatsby in seconds",
    "Anthropic leapfrogs OpenAI with a chatbot that can read a novel in less than a minute",
    "Introducing 100K Context Windows",
    "This ChatGPT competitor is making waves by being able to process an entire novel",
    "ChatGPT rival Anthropic's Claude can now read a novel in under a minute",
    "Claude AI Can Digest 75,000 Words in Under a Minute",
    "AI startup Anthropic pushes its chatbot's context window to process 75k words",
    "Anthropic's Claude AI Can Now Process Entire Novels In Under A Minute",
    "Anthropic's Claude AI Can Now Digest an Entire Book like The Great Gatsby in Seconds",
    "Look out, ChatGPT: this rival chatbot can now read a whole novel in under a minute",
    "Anthropic says its Claude AI can now read a whole book in under a minute",
    "100k tokens is long enough to be in a relationship. https://twitter.com/...",
    "This has real applications. https://twitter.com/...",
    "Wow. Super impressive. https://twitter.com/...",
    "Context windows will just be a non-issue soon. Love it. https://twitter.com/...",
    "Introducing the AI Sandbox for advertisers and expanding our Meta Advantage suite",
    "New AI advancements drive Meta's ads system performance and efficiency",
    "Meta Introduces AI Tools to Create Ads and Predict Performance",
    "Meta Outlines its Evolving AI Ad Targeting Process, Which is Improving Ad Performance",
    "Meta unveils A.I. ‘testing playground’ to help advertisers build campaigns",
    "Meta Announces AI-Powered Tools To Streamline Ad Processes",
    "Meta Unveils AI Sandbox and Expands Meta Advantage Suite for Advertisers",
    "Meta's sprucing up its ads with new generative AI tools",
    "Meta announces generative AI-powered product suite for ads",
    "Meta reveals new generative AI tools for advertisers",
    "Meta advertisers will soon get access to generative AI tools",
    "Meta's AI Sandbox Is ‘Playground’ for Facebook and Instagram Advertisers",
    "Get Ready for AI-Created Ads on Facebook",
    "Meta unveils generative AI tool for Facebook and Instagram advertisers",
    "Meta Introduces AI-Powered Ad Tools: AI Sandbox and Meta Advantage",
    "Meta announces AI image generation tools for advertisers",
    "Meta is using AI to build the next generation of online ads",
    "Meta rolls out generative-AI tools for creating Facebook ads",
    "Meta introduces AI tools to create ads and predict performance",
    "Silicon Valley Business Journal",
    "Meta is testing out some new generative AI-powered ad tools",
    "Facebook owner Meta announces tests of generative AI ads tool",
    "Meta Bets Its Future On AI And Advantage+",
    "Meta's Generative AI ‘Sandbox’ Is Also a Creator Play",
    "Meta climbs into ‘AI Sandbox’ with tools for advertisers",
    "AI Is Hot—But Meta Is Still ‘Really Interested in the Metaverse,’ Exec Claims",
    "Meta bets its advertising scale can differentiate new generative AI tools",
    "Meta adds generative AI into its ad platform",
    "Meta rolls out new AI focused tools for advertisers",
    "Meta details generative AI ad tools and large-scale Lattice model architecture",
    "Meta Leadership Team Unveils New AI-Powered Advertising Tools",
    "Crypto Twitter attacks Coinbase over Pepe characterization",
    "Coinbase Apologizes After Calling PEPE a ‘Hate Symbol’",
    "Coinbase Classifies PEPE the Frog as a Hate Symbol, Receives Backlash from the PEPE Community",
    "Coinbase Apologizes After Describing PEPE Meme Coin As A ‘Hate Symbol’- Backlash Heat Cools Down",
    "Coinbase Says it “Screwed Up” in Apology Over Pepe Coin Coverage",
    "‘We screwed up’: Coinbase issues apology for derogatory PepeCoin remarks",
    "Coinbase Boycott Explained: $PEPE Community Reacts to “Hate Symbol” Label",
    "‘We screwed up’ — Coinbase CLO responds to outrage after exchange associated Pepe with hate groups",
    "Memecoin Army Extracts Coinbase Apology After Botched Pepe Newsletter",
    "Coinbase says ‘we screwed up’ after Pepe the Frog backlash",
    "Just-In: Coinbase Apologizes For Calling PEPE A “Hate Symbol”",
    "‘We screwed up’: Coinbase chief legal officer apologizes after Pepe newsletter controversy",
    "Coinbase apology  —  $pepe meme token is a trend.  —  Crypto embraced the meme culture …",
    "‘We Screwed Up’: Coinbase Apologizes for Pepe Comments as #DeleteCoinbase Trends",
    "Coinbase Says it ‘Screwed Up’ Pepecoin Coverage in Its Newsletter",
    "COINBASE VS PEPE ARMY https://twitter.com/...",
    "BlockFi gets court permission to return $297 million to Wallet customers",
    "Setback For BlockFi Users As Judge Rules Against Recovering $300M",
    "BlockFi Crypto Customers Lose Fight Over Disputed Coin Transfers",
    "BlockFi customers can get $300M of their assets returned",
    "BlockFi Will Refund $297 Million to Users",
    "BlockFi Wallet Account Users to Get Back $297 Million: Report",
    "BlockFi users to get back $297M from Wallet accounts: Report",
    "BlockFi Can Return Nearly $300M to Some Wallet Customers, Judge Rules",
    "Judge Says BlockFi Custodial Account Holders Can Be Repaid $300 Million",
    "BlockFi Customers Lose Battle To Recover $300 Million, U.S. Judge Says",
    "BlockFi receives permission to return $297M to certain customers"
]