[
    "The Official Microsoft Blog",
    "Microsoft Developer on YouTube",
    "@thekenyeung@mastodon.social",
    "Bing at Microsoft Build 2023: Continuing the Transformation of Search",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "Windows Copilot: Your new AI assistant for Windows 11",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Microsoft CTO tells devs to ‘do legendary sh*t’ with AI at 2023 Build conference",
    "A livestream of the Microsoft Build 2023 keynote",
    "Microsoft Build 2023: CEO Satya Nadella's Boldest Statements",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Empowering every developer with plugins for Microsoft 365 Copilot",
    "Hallelujah! Windows 11 is finally introducing RGB lighting standards",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "Bing Integrates With ChatGPT",
    "Microsoft Build 2023: What businesses need to know",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft flaunts redesigned and modern File Explorer in Windows 11",
    "Microsoft Build 2023: Microsoft Fabric and oodles of Azure AI integrations announced",
    "Microsoft Edge is getting Copilot and support for ChatGPT plugins",
    "Microsoft Bing search is being added to ChatGPT; new Bing Chat plugin partners revealed",
    "Microsoft Build 2023 Puts AI in Everything, Adds Dev Mode for Windows 11",
    "Build 2023: Microsoft 365 Copilot to Get Plugins Support",
    "Microsoft Announces AI Integrations at Build 2023, Including Windows Copilot",
    "For Microsoft, AI belongs everywhere",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "Microsoft Presents Shared Plugin-Ecosystem for Bing, ChatGPT and Microsoft Products",
    "Microsoft's M365 Copilot AI assistant gets third-party app integrations",
    "Microsoft expands AI plugins and copilot ecosystem for developers",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft launches generative AI tools for developers",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "Microsoft to roll out Windows 11 “Moment 3” update starting May 24, 2023",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft confirms 365 Copilot AI will be ‘natively integrated’ into Edge",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Bing Search is coming to ChatGPT",
    "The man who put Microsoft in the AI lead",
    "With Windows Copilot, every Windows user can be a power user. https://blogs.windows.com/...",
    "@campuscodi@mastodon.social",
    "Twitter Is a Far-Right Social Network",
    "Musk Hosting DeSantis Signals Starker Partisanship on Twitter",
    "DeSantis Set to Announce 2024 Run on Twitter With Elon Musk",
    "Elon Musk's right-wing media venture scores another big win",
    "Why YouTube is a tough place for kids podcasts",
    "Musk scores Daily Wire's full set of podcasts to put on Twitter",
    "DeSantis to Announce 2024 Presidential Run in Interview with Elon Musk",
    "Elon Musk Is Going to Try to Make Ron DeSantis Cool",
    "Elon Musk is Set to Host Ron DeSantis' Presidential Campaign Launch via Twitter Spaces",
    "DeSantis set to launch 2024 bid with Musk",
    "Ron DeSantis to announce presidential bid in Twitter Space with Elon Musk",
    "AP sources: DeSantis to announce 2024 presidential bid Wednesday on Twitter Spaces with Elon Musk",
    "Ron DeSantis to announce presidential run on Elon Musk's Twitter",
    "DeSantis sees a path to the White House — 240 characters at a time",
    "DeSantis to announce 2024 bid on Twitter Spaces meeting with Elon Musk",
    "Elon Musk will launch Ron DeSantis' presidential campaign on Twitter Spaces",
    "@lauren@mastodon.laurenweinstein.org",
    "That's one way to make your candidate seem human! https://www.nytimes.com/...",
    "Well this ‘analysis’ from the Times aged wonderfully... https://twitter.com/... [image]",
    "Musk hasn't even endorsed DeSantis and praised one of his opponents last week lmao [image]",
    "Unsafe levels of dork energy in one place https://twitter.com/...",
    "So much free speech, it's blinding. https://twitter.com/...",
    "Wonder if this is going to be the thing that makes Trump start tweeting again?",
    "Elon Musk: Twitter must be politically neutral also Elon Musk: [image]",
    "This is a real slap in Fox's face https://www.semafor.com/... [image]",
    "Worth noting Sacks is belligerently isolationist on Ukraine https://twitter.com/...",
    "The guy DeSantis is launching his campaign with hasn't even endorsed him lmao [image]",
    "Introducing a new era of AI-powered ads with Google",
    "Google Will Soon Show You AI-Generated Ads",
    "Here's how ads might look in Google's new AI-powered search experience",
    "Inside Google's plans for improving paid search with generative AI",
    "Google debuts new generative AI advertising tools",
    "Google Announces New Generative AI Ad Tools at Marketing Live Event",
    "Google details plans for AI-generated ads in Search",
    "Google to test ads in generative AI search results",
    "Google Ads will create AI-powered assets that target search queries",
    "@chrismessina@mastodon.xyz",
    "Google Product Studio brings AI-generated images to advertisers",
    "New tools to help small businesses connect with online shoppers",
    "Google Introduces Chatbot, Other Generative AI Creation Tools for Marketers",
    "Google Marketing Live 2023: What you need to know",
    "Google Search Generative Experience integrates Search, Shopping ads",
    "Yes, Google's AI-infused search engine will have ads",
    "Welcoming AI to the Microsoft Store on Windows",
    "Microsoft puts a spotlight on AI in its Windows app store",
    "Microsoft opens the door to allow more Android apps on Windows 11",
    "Windows 11 finally gets native RAR support",
    "Windows 11's Microsoft Store is getting AI-powered reviews and dedicated ‘AI Hub’ features",
    "Microsoft Store gets AI-generated review summaries, keywords and a dedicated AI Hub",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft pledges to watermark AI-generated images and videos",
    "Build 2023: Microsoft to watermark AI generated content created by Bing Image Creator and Designer",
    "Microsoft Designer and Bing Image Creator will soon tag images and videos with metadata info",
    "ChatGPT Adding Bing as Its Default Search Experience",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "Microsoft to add Bing search to OpenAIs ChatGPT in battle with Google",
    "Microsoft Build 2023: From ChatGPT on Bing to Azure AI, check latest announcement",
    "8 Key Factors to Consider When Testing AI Chatbots for Accuracy",
    "Here are all the AI updates Microsoft announced at its developers conference keynote",
    "ChatGPT is about to integrate Bing and leave Google in the dust",
    "Microsoft confirms Bing AI and ChatGPT plugins will work together",
    "Microsoft to Integrate Bing Search into OpenAI's ChatGPT",
    "Bing coming to ChatGPT is a seismic shift for generative AI — here's why",
    "Microsoft beefs up ChatGPT and Bing in wide-ranging AI product launch",
    "ChatGPT Will Use Bing to Answer Questions",
    "Google Bard AI Can Now Retrieve Images, And That's Just The Start",
    "Bing is coming to ChatGPT as the default search experience",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "FirstFT: Multibillion-dollar chip deal",
    "Born in the USA!  Broadcom will produce American-made RF modules for Apple",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple secures supply of 5G components as it signs new multibillion-dollar deal with Broadcom",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple and Broadcom sign multi-billion dollar deal to manufacture more 5G components in the U.S.",
    "Apple to Pay Broadcom Billions for US-Made 5G Chips",
    "Apple Strikes Multibillion-Dollar Deal to Use U.S.-Made Chips",
    "Apple Extends Broadcom Pact With Multibillion-Dollar 5G Deal",
    "Apple multibillion-dollar Broadcom deal seems mostly for 5G",
    "Apple and Broadcom sign deal that will power your iPhone 16 next year - and beyond",
    "Apple boosts its commitment to US manufacturing with a massive Broadcom deal worth billions",
    "Apple announces multibillion-dollar Broadcom deal amid rumors of in-house 5G iPhone radio",
    "Apple enters multibillion-dollar mobile chip deal with Broadcom",
    "Apple inks multi-billion-dollar deal with Broadcom for US-made chips",
    "Apple inks multibillion-dollar chip deal with Broadcom",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple Strikes Multibillion-Dollar Supply Deal With Broadcom",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Kane and Pia Muehlenbeck on YouTube",
    "First Impressions: Final Cut Pro for iPad",
    "The biggest features missing from Final Cut Pro for iPad at launch",
    "Final Cut Pro and Logic Pro for iPad are here",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro for iPad Reviews: Worth the Wait, But Some Limitations",
    "Final Cut Pro on iPad Feels Like a Great and Optional Upgrade",
    "Apple Brings Final Cut Pro And Logic Pro To iPad",
    "Final Cut Pro iPad hands-on - one of Apple's best multi-touch apps on iPad",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut Pro For iPad 1st Review: Smooth, Fast And Affordable",
    "Final Cut Pro for iPad is finally here - and its secret weapon is the Apple Pencil",
    "Final Cut Pro now available for iPad: Here's everything you need to know",
    "Final Cut Pro on iPad is a game changer for content creators — here's why",
    "Apple Updates Final Cut Pro and Logic Pro for Mac to Support New iPad Apps",
    "2023 Apple Design Awards finalists announced",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "Apple Final Cut for iPad Review: Lots Here, But Some Things Still Missing",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro on iPad is AMAZING - Hands on Review!",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "FINAL CUT PRO FOR IPAD - First impressions for travel vlogging",
    "Final Cut Pro on iPad: Effortless Editing",
    "@johnvoorhees@mastodon.macstories.net",
    "Final Cut Pro on iPad is working properly now and is glorious. [image]",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Hands-On With Apple's Logic Pro for iPad",
    "Hands On With Apple's Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Final Cut Pro and Logic Pro for macOS updated with new features and support for iPad apps",
    "Logic Pro now available for iPad: Here's everything you need to know",
    "No subscriptions in Final Cut Pro and Logic Pro for Mac following iPad versions.  Yet...",
    "Binance Denies Commingling ‘Billions’ in Customer Funds",
    "Report: Binance Vets Say Exchange Commingled Funds",
    "Binance Refutes Reuters' Claims of Commingling: “Story is so weak”",
    "Binance Exchange Allegedly Commingled Customer Funds and Company Revenue",
    "Binance Blasts ‘Desperate’ Reuters Report It Commingled Customer and Company Funds",
    "Binance regularly commingled customer funds with corporate revenue in 2020 and 2021: Reuters",
    "Binance Blasts Reuters Report It Mixed Customer/ Company Funds",
    "Binance allegedly commingled customer funds: Reuters",
    "Inside Binance Scandal: Former Insiders Claim Customer Funds Were “Mishandled”",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "Microsoft wants to help you build a website with Copilot AI",
    "Microsoft Build 2023: Windows 11 to soon have AI personal assistant, Copilot",
    "Microsoft beats Google by integrating an AI assistant straight into its OS",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsot Introduces Azure AI Studio for Building, Training, and Deploying Intelligent Apps",
    "Microsoft makes a push for AI responsibility and safety through Azure",
    "Safety. https://twitter.com/...",
    "Adobe Photoshop (beta) x Adobe Firefly: Announcing Generative Fill",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Adobe to integrate AI into Photoshop amid fears of job losses and mass faking of images",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "Adobe introduces generative AI in Photoshop to transform professional creativity",
    "Adobe Photoshop's new “Generative Fill” AI tool lets you manipulate photos with text",
    "Adobe Photoshop's AI art tools are now available for you to try",
    "Adobe is adding an AI-powered image generator to Photoshop",
    "Adobe Continues AI Push With Latest Generative Image Tool",
    "Adobe Integrates Firefly Directly Into Photoshop, Brings Generative AI to Creative Cloud",
    "Adobe Unleashes Generative AI in Photoshop Beta",
    "Adobe introduces ‘generative fill’ to Photoshop with its Firefly AI tool",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use,",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Shutterstock to Acquire GIPHY, the World's Largest GIF Library and Search Engine",
    "Meta will sell Giphy to Shutterstock, after antitrust ruling",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta has no choice but to sell Giphy at $262M loss to Shutterstock",
    "Meta sells Giphy to Shutterstock at a loss following UK order",
    "Giphy/Meta: the cost of doing business overseas keeps rising",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Shutterstock to Acquire Giphy",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Shutterstock to Acquire Giphy From Meta for $53 Million",
    "Meta unloads Giphy in the fire sale of the year",
    "Meta selling Giphy for fraction of purchase price",
    "Meta sells Giphy to Shutterstock at huge loss following antitrust ruling",
    "Meta Agrees to Sell Giphy to Shutterstock for a $347 Million Loss",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "Meta forced to sell Giphy, takes 87% loss in Shutterstock deal",
    "Shutterstock to buy GIPHY after CMA forced Meta to sell it",
    "Facebook Parent Meta Sells Giphy To Shutterstock For $53 Million Under Pressure From UK Regulator",
    "Meta Sells Giphy To Shutterstock For $53M Following Antitrust Lawsuit",
    "Shutterstock picks up Giphy for $53 million after UK blocks Meta's acquisition",
    "Shutterstock to Buy Meta's Giphy for $53 Million on UK Antitrust Order",
    "Shutterstock Agrees to Acquire Giphy From Meta",
    "Shutterstock to Acquire Giphy from Meta for $53M",
    "From $400M to $53M: Shutterstock Acquires Giphy from Meta at Fraction of Price",
    "Meta complies with UK order, sells Giphy to Shutterstock at a huge loss",
    "Shutterstock Acquires Giphy from Meta in $53 Million Deal",
    "Meta sells Giphy to Shutterstock for $53 million to comply with UK regulator order",
    "Shutterstock buys Giphy app from Meta for $53M",
    "Feels like a steal https://www.reuters.com/...",
    "Introducing Microsoft Fabric: Data analytics for the era of AI",
    "At Build 2023, Microsoft unveils new Fabric OneLake Shortcuts for ADLS, AWS, Google Storage",
    "Build 2023: Microsoft officially announces Fabric, an end-to-end, unified analytics platform",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "@caseynewton@mastodon.social",
    "Social Media and Youth Mental Health",
    "The surgeon general's warning is a wake-up call for social networks",
    "Building Happier: Social Media, Mental Health And What Parents Can Do",
    "Surgeon General Warns of Social Media Risk to Youth. Wall Street Shrugs.",
    "Surgeon general: Social media presents ‘profound risk’ for kids",
    "Social media may harm kids.  US Surgeon General says so",
    "The US surgeon general thinks social media poses a “profound risk” to teenagers' mental health",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Surgeon general issues advisory about social media risks for kids",
    "Social media could have a ‘profound risk’ on kids and teens, US surgeon general warns",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "A guide to teens, smartphones and social media settings",
    "Social media can put young people in danger, U.S. surgeon general warns",
    "‘Profound risk of harm’: Surgeon General issues warning about youth social media use",
    "Social media could harm youth mental health, U.S. Surgeon General warns",
    "Social media is driving the teen health crisis, warns surgeon general, and Big Tech must act",
    "Surgeon general warns social media is triggering teen mental health crisis",
    "Social Media a ‘Profound Risk’ to Kids, Warns U.S. Surgeon General",
    "On ‘Defining Public Health Issue of Our Time,’ a Warning",
    "Surgeon general issues urgent warning about kids and social media",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "US Surgeon General says social media may be hazardous to teen health",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "Chinese Businesses Fueling the Fentanyl Epidemic Receive Tens of Millions in Crypto Payments",
    "Chinese companies selling synthetic opioid chemicals raked in $27M in crypto payments",
    "Netflix crackdown on account sharing hits US with $8 fee for each extra user",
    "Netflix is finally cracking down on password sharing, will charge $8 monthly for extra members",
    "Netflix's password crackdown has started in the U.S.",
    "Silicon Valley Business Journal",
    "Netflix has begun crackiung down on password sharing in the U.S.",
    "Netflix Tells US Members Accounts Are for One Household",
    "Netflix Launches Paid Sharing in U.S., Will Start Blocking Users With Unauthorized Passwords",
    "Netflix Password Sharing Crackdown Begins in the U.S.",
    "Want to share your Netflix account? That'll be an extra $8",
    "If you said you'd cancel Netflix before paying for account sharing, time is up",
    "How to transfer a profile on Netflix before it charges you extra",
    "Netflix expands password-sharing crackdown worldwide",
    "It's time: Netflix's account sharing fee is now live in the US for $7.99 a month per user",
    "Netflix's controversial password-sharing crackdown hits the US",
    "The Netflix crackdown on password sharing in the US has arrived",
    "Netflix's password crackdown has hit the US and UK - here's what you need to know",
    "Netflix's password sharing clampdown reaches the UK",
    "Adding Extra Members to Your Netflix Account Costs $8 a Pop",
    "Netflix's Password-Sharing Crackdown Finally Hits The US, Here's What It Means",
    "Netflix password sharing crackdown has finally reached the US",
    "Breaking: Netflix Announces Official Password-Sharing Policy, Notifies U.S. Customers of New Rules",
    "Netflix password sharing is now officially dead",
    "Sharing a Netflix password will now cost $7.99 a month per additional user",
    "Netflix paid password sharing hits the U.S., but Americans shouldn't be too worried",
    "Netflix starts charging for account sharing in the US",
    "Netflix reveals cost of adding members in password-sharing crackdown",
    "Netflix Tells US Consumers to Stop Sharing Accounts",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix Bill Comes Due As Streaming Giant Begins Clampdown On Password Sharing In U.S.",
    "Netflix password sharing crackdown rolls out in the U.S.",
    "Netflix U.S. Password Sharing Crackdown Begins, Joining Canada",
    "Netflix Starts to Roll Out its Password Sharing Crackdown In The United States",
    "Netflix Starts Cracking Down On Password Sharing In The US",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "Anthropic Raises $450 Million to Fuel AI Work",
    "Google-backed Anthropic raises $450 million in latest AI funding",
    "AI Craze Hits New Level As Anthropic Locks Up $450M, Builder.ai Closes $250M Round",
    "AI Startup Anthropic Raises $450 Million for Safety-Focused Chatbot",
    "Ex-OpenAI execs raise $450 million for Anthropic, a rival A.I. venture backed by Google",
    "Anthropic secures $450M in Series C funding from Google, Salesforce and others",
    "OpenAI rival Anthropic raises $450 million in funding with backing from Google to take on ChatGPT",
    "Waymo and Uber partner to bring Waymo's autonomous driving technology to the Uber platform",
    "Waymo's self-driving cars will be available on Uber's app, starting in Phoenix",
    "Uber teams up with Google's Waymo on self-driving cars",
    "Waymo Partners With Rival Uber In Phoenix For Rides And Food",
    "Despite Bruising Court Battle, Uber to Offer Self-Driving Rides From Rival Waymo",
    "Uber to offer autonomous ride-hailing and delivery using Waymo's robotaxis",
    "Uber will now let you book a Waymo self-driving car through its app",
    "Waymo and Uber sign multi-year partnership to provide driverless rides and deliveries",
    "Robotaxis Are Coming to Phoenix, and You Can Ride Them on Uber",
    "Uber and Waymo fought in court over self-driving trucks. Now they're teaming up",
    "So excited to bring Waymo's incredible technology to the @Uber platform 🙌 https://twitter.com/...",
    "A Waymo car stopping to do food delivery seems less than ideal: https://www.theverge.com/...",
    "Uber and Waymo team up to bring autonomous taxis to Phoenix. [ai] https://www.theverge.com/...",
    "headlines i would never imagine a mere six years ago https://blog.waymo.com/... [image]",
    "Spotify may use AI to make host-read podcast ads that sound like real people",
    "AI Voices Could Soon be Reading Ads on Spotify Podcasts",
    "Personalized wealth management, built for tech people",
    "Samsung shows off several exciting displays including one that expands more than 5 times",
    "Samsung unveils a 12.4-inch rollable OLED panel",
    "Samsung Display makes screen that can recognize several fingers",
    "Samsung reveals OLED light-based blood pressure sensor",
    "Samsung unveils world's first OLED screen with built-in fingerprint, heart rate sensor",
    "Samsung's new OLED display tech has a built-in blood pressure sensor",
    "‘Max’ Streaming Service Celebrates Launch With Huge Deluge Of 4K Movies And TV Shows",
    "Max makes its U.S. debut, giving subscribers 35K hours of content",
    "With the Launch of “Max,” Streaming Enters a New Era of Consolidation",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "HBO Max relaunches as Max — here's what you need to know",
    "Max streaming guide: Signing up, pricing, features, 4K content availability and more",
    "HBO Max is officially just MAX: what this means for you",
    "Everything You Need to Know About Max When Service Launches on May 23",
    "HBO Max is now simply ‘Max’ with a new ‘Ultimate Ad-Free’ tier",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "The slow descent into madness. [image]",
    "how do you fuck up this badly https://twitter.com/...",
    "I keep clicking “Start Streaming” and nothing happens. Great product launch. No notes. [image]",
    "why are all the streaming services blue now [image]",
    "Flipboard is ready to work with Bluesky and Pixelfed",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-23HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Microsoft uses open source to kill WinRAR by adding native .rar support to Windows 11",
    "Windows 11 getting native support for 7-Zip, RAR, and GZ archives",
    "Ahoy, matey! Windows 11 will soon have native RAR support",
    "Windows will soon support more archive formats like 7-zip and RAR",
    "Opening RAR files natively in Windows 11 is coming and people online are going crazy over it",
    "Thanks for everything, WinRAR: Windows is finally getting native RAR support",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Universal Music Group partners with Endel for AI-generated wellness soundscapes",
    "Universal Music Group Embraces AI “Soundscapes” With New Deal",
    "Peloton Works to Stay Relevant With Massive Rebrand",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton the rebrand: High end exercise bike maker says it's now a health company for all",
    "Peloton Unveils Membership Tiers in ‘Anyone Anywhere’ Rebrand",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "Peloton relaunches its workout app with new free and pricier subscription tiers",
    "Peloton's New App Pricing: Bad for Off-Brand Bike Owners",
    "Peloton App Gets a Free Tier",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "BuzzFeed's Chatbot Mistake, Bing's Big Goal",
    "Pixar meets The Last of Us movie about botulism toxin controlling a chef https://twitter.com/...",
    "A little too botulism evoking for me https://twitter.com/...",
    "Microsoft wants you to think inside the Dev Box from July",
    "Microsoft wants to make Windows a better place for developers",
    "Microsoft's cloud-hosted developer workstations will soon be generally available",
    "Microsoft boosts Windows developer productivity with Dev Home",
    "Microsoft Dev Box preview to soon end and be generally available, 2TB SSD added",
    "Reimagining Developer Workstations with Microsoft Dev Box",
    "BandLab Raises Another $25 Million, Now Valued at $425 Million",
    "Caroline Ellison's ‘diary’ a key piece of evidence in Sam Bankman-Fried's FTX fraud case: report",
    "The 6 best features of Amazon's new Fire Max 11, our biggest and most powerful tablet yet",
    "Amazon launches its biggest tablet, the $230 Fire Max 11",
    "Fire Max 11 is Amazon's largest and most powerful tablet yet",
    "Introducing the All-New Fire Max 11: Amazon's Biggest and Most Powerful Tablet Yet",
    "The new Amazon Fire Max 11 is the company's biggest tablet ever, starts at $230",
    "Amazon's Latest Budget Tablet: A Look At The Fire Max 11",
    "Amazon's Fire Max 11 debuts with companion keyboard case, stylus, and $230 price tag",
    "Who needs the Pixel Tablet? Amazon's new Fire Max 11 looks great",
    "Amazon Wants you to be More Productive with its New Tablet",
    "This Fire Max 11 Tablet Is How Amazon Plans To Squash The iPad",
    "The Fire Max 11 Is Amazon's Largest Tablet Yet (and the First With Fingerprint Recognition)",
    "Good luck getting work done on Android 9 ! https://twitter.com/...",
    "reminder: the 11-inch Fire Max 11 is now Max https://twitter.com/...",
    "Prometheum Ember Capital is the First SEC Qualified Custodian for Digital Assets Securities",
    "Crypto Startup Says It Found Path to Register With SEC Under a Broker Rule",
    "Apple's chance to remake AI development",
    "White House Releases New AI National Frameworks, Educator Recommendations",
    "International Watchdog Eyes Crypto's Future as Hong Kong Releases Rulebook",
    "Hong Kong Expected to Lift Crypto Retail Trading Ban Next Month",
    "Hong Kong to Permit Licensed Crypto Exchanges to Offer Services to Retail Investors",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "IOSCO Sets the Standard for Global Crypto Regulation",
    "IOSCO releases recommendations to strengthen crypto regulation",
    "Could cryptocurrencies and digital assets be regulated globally?",
    "Crypto Regulation Goes Global: Watchdog Presents Landmark Framework For Digital Markets",
    "Global securities watchdog urges governments to regulate crypto like traditional financial assets",
    "IOSCO Introduces Global Policy Recommendation to Guide Crypto and Digital Assets Industry",
    "European Data Protection Board",
    "Data Protection Commission",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "How Meta got caught in tensions between the US and EU",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Meta has a $11 billion reason not to leave the EU",
    "What Would a U.S. Debt Default Mean for the World?",
    "Q&A: Is Meta data-transfer fine enough to allay privacy concerns?",
    "EU Committee Probes TikTok, UK's Updated GDPR",
    "TikTok's lead privacy regulator in Europe takes heat from MEPs",
    "Meta Fined €1.2 Billion and Ordered to Halt E.U.-U.S. Data Flow",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "EU regulators fine Meta $1.3 billion, but some say potential data losses could be even harsher",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "European regulators signal they are fed up with Facebook",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Facebook's Parent Company Meta Fined €1.2bn for Data Breach",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "EU hits Meta with record €1.2B privacy fine",
    "DPC fine should be a wake-up call for government",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes."
]