[
    "Twitter is refusing to pay its Google Cloud bills: report",
    "Elon Musk still hasn't paid Twitter's Google Cloud bill.",
    "Google is pretty good at shutting down its own products, but... https://twitter.com/...",
    "You good, @lindayacc? https://twitter.com/...",
    "Good thing enterprise migrations between cloud providers is trivial... https://twitter.com/...",
    "Elon be stiffin' https://twitter.com/...",
    "Awwwe they can repurpose Elon's old laptop and host it there https://twitter.com/...",
    "Pepperidge farm remembers https://blog.twitter.com/... https://twitter.com/...",
    "Nigeria regulator says local Binance operations ‘illegal’",
    "The Securities and Exchange Commission, Nigeria",
    "Circular on the Activities of Binance Nigeria Limited",
    "Nigeria's SEC Says Binance Operations in Country Are ‘Illegal’",
    "Nigerian Regulator Labels Binance Affiliate's Local Operations Illegal",
    "Binance Hit With Suspension Notice In Nigeria By Market Regulator",
    "Binance ordered out of Nigeria",
    "Nigeria regulator halts Binance operations: Report",
    "Nigeria SEC declares Binance operations in country illegal",
    "Nigerian Regulator Moves Against Binance Amid U.S. Crypto Crackdown",
    "BREAKING: Binance Declared illegal By Nigerian SEC, Accused Of Wrongful Operation",
    "Nigeria's SEC declares Binance Nigeria's operations illegal",
    "Nigeria's SEC orders Binance Nigeria Limited to stop operations",
    "Nigeria regulator says Binance not registered and must stop soliciting investors: Reuters",
    "Breaking: Binance Declared “Illegal” By Nigeria SEC, Ordered To Cease Operations",
    "Binance is Unregistered and Illegal in Nigeria — SEC Warns",
    "Binance is illegal in Nigeria",
    "Does anyone remember Pink Care Token? https://twitter.com/...",
    "Binance getting pressure from other jurisdictions now. https://twitter.com/...",
    "This is terrible news for scammers. https://twitter.com/...",
    "The crypto pivot to Africa just took a hit https://twitter.com/... [image]",
    "Binance Declared Illegal By Nigeria SEC",
    "iPhone subreddit starting protest early, going dark indefinitely",
    "Reddit's CEO's AMA turns into disaster",
    "Reddit CEO: We're Sticking With API Changes, Despite Subreddits Going Dark",
    "Reddit blackout: Subreddits to go private on Monday",
    "Redditors: Your favorite subreddit might go dark on Monday. Here's what's happening",
    "Reddit's users and moderators are pissed at its CEO https://www.theverge.com/... [image]",
    "Thousands of subreddits pledge to go dark after the Reddit CEO's recent remarks",
    "r/pics will go dark on June 12th in protest of Reddit's API changes that will kill 3rd party apps",
    "/r/gaming will go dark on June 12th in protest of reddit's API changes",
    "Reddit's users and moderators are revolting against its CEO",
    "Reddit's users and moderators are pissed at its CEO",
    "Reddit won't budge on the API changes that are shutting down apps like Apollo",
    "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "The Reddit App War Is Getting Messy",
    "Reddit CEO Cites Profit Push in Response to Backlash",
    "Apollo will shut down as tempers flare over Reddit API changes",
    "Reddit Shows No Signs Of Backing Down From Controversial API Changes In Heated AMA",
    "Reddit's Hoped-For IPO and Pipe Dream of Cashing in on OpenAI's Hype",
    "Reddit CEO does AMA, doesn't address or even mention upcoming subreddit protests",
    "Reddit CEO Says Keeping Explicit Content on the Site Is a ‘Constant Fight’",
    "Why everyone is freaking out about the Reddit API right now",
    "Reddit client Apollo shutting down on June 30 due to API pricing",
    "Popular Apollo Reddit App is Shutting Down",
    "What an absolute dumpster fire for Reddit's CEO here: https://www.reddit.com/...",
    "Spez, the CEO of Reddit, doubles down on his accusations against @apolloreddit [image]",
    "the reddit AMA regarding the API changes is going about as well as you'd expect [image]",
    "The reddit AMA surround the API apocalypse has some gems in it [image]",
    "the reddit ama with the CEO is going as well as you'd expect lol https://www.reddit.com/...",
    "The way spez is treating @ChristianSelig is absolutely disgusting. Shame on Reddit [image]",
    "the ceo of reddit is an actual dumb little piggy boy [image]",
    "Addressing the community about changes to our API",
    "[DISCUSSION] Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "Reddit CEO Steve Huffman defends API changes in AMA",
    "Everything about this “AMA”",
    "Get your scripts ready guys, the AMA has started.",
    "u/spez addresses the community regarding the API changes",
    "Lutheran church in Germany has AI deliver sermon",
    "300 People Attend a Church Sermon Generated by ChatGPT",
    "@BenPatrickWill@mastodon …",
    "@BenPatrickWill@mastodon.social",
    "Germany refusing Intel's additional demand for subsidies for chip plant: report",
    "Verizon DBIR: Social Engineering Breaches Double, Leading to Spiraling Ransomware Costs",
    "DBIR Report 2023 - Master's Guide",
    "Verizon 2023 DBIR: Human Error Involved in Many Breaches, Ransomware Cost Surges",
    "DOS Attacks Dominate, but System Intrusions Cause Most Pain",
    "Verizon 2023 DBIR: Credential Leaks Continue To Be A Major Issue",
    "2023 DBIR Executive Summary",
    "2023 Data Breach Investigations Report (DBIR)",
    "Seven key insights from the 2023 Verizon Data Breach Investigations Report",
    "Report Details Three Top Cyber Threats for Public Sector",
    "Verizon DBIR: Ransomware accounts for one in four data breaches",
    "Verizon 2023 Data Breach Investigations Report: 74% of breaches involve human element",
    "Germans beat Tesla to autonomous L3 driving in the Golden State",
    "Tesla driver hits a dog, claims they were on Full Self-Driving Beta",
    "can't wait for this guy to put a chip in my brain https://twitter.com/...",
    "17 fatalities, 736 crashes: The shocking toll of Tesla's Autopilot",
    "17 Fatalities, 736 Crashes: The Shocking Toll Of Tesla's Autopilot",
    "A new tool can tell if your paper was written by AI",
    "AI-generated academic science writing can be identified with over 99% accuracy",
    "Scientists claim >99 percent identification rate of ChatGPT content",
    "New Tool Can Tell If Something Is AI-Written With 99% Accuracy",
    "New tool claims it can identify AI-written science papers 99% of the time",
    "ChatGPT Is Convincing But Researchers Say They Can Spot AI Writing With 99% Accuracy",
    "U. Kansas researchers crack the code on ChatGPT detection",
    "Was the science paper written by a scientist or a LLM? https://www.cell.com/... [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "Credit Suisse CEO teases UBS deal finalization",
    "New Crypto Banking System Coming Amidst Coinbase and Binance Crackdown",
    "Report: Crypto Companies Widening Their Search for Banking Partners",
    "Vision Pro for Devs: Easy to Start, but UI Not Revolutionary",
    "ChatGPT is fun, but it is not funny! Humor is still challenging Large Language Models",
    "ChatGPT can only tell 25 jokes, and can't come up with new ones, researchers find",
    "ChatGPT fun but not funny: Students in Germany put ChatGPT's humor to the test",
    "So it's just like your dad then. https://arstechnica.com/...",
    "Researchers discover that ChatGPT prefers repeating 25 jokes over and over",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "(IHP) Microsoft CTO Kevin Scott",
    "Jun 8-12VIRTUAL: Summer Game Fest",
    "Jun 14-17Viva TechnologyParis",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Generative AI tool Stable Diffusion amplifies race, gender stereotypes",
    "Smart TV industry rocked by alleged patent conspiracy from chipmaker [Updated]",
    "Smart TV industry rocked by alleged patent conspiracy from chip maker",
    "AT&T moves its default Android messaging to RCS",
    "AT&T switching to Google's Jibe platform for RCS",
    "AT&T Switches to Google's Jibe for RCS",
    "Bing Preview Release Notes: Voice Chat on Desktop",
    "Microsoft adds voice mode to Bing AI on the web",
    "Bing Chatbot Can Now Have A Voice Conversation With You On Desktop Systems",
    "Microsoft Brings Voice Chat to Bing Chat on Desktop",
    "You can now talk to Bing Chat in Windows 11 with your voice",
    "Bing AI Voice Chat Comes to Desktop",
    "As Cortana Retires, Microsoft Brings AI-Powered Bing Voice Mode to Desktop",
    "Bing Chat gains voice search on desktop interface",
    "Bing Chat's desktop version now supports Voice Chat",
    "Bing Chat now adds voice chat for desktop users in this week's dev update",
    "Microsoft now lets you speak to its AI-powered Bing Chat",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange And Illicitly Operating Another",
    "Mt. Gox Hack Update: Russian Nationals Charged, Unveiling a Major Crypto Theft Conspiracy",
    "Russian Nationals Charged With Hacking One Cryptocurrency Exchange and Illicitly Operating Another",
    "DoJ Charges Two Russians for Trying to Launder 647K BTC Stolen From Mt.Gox",
    "DOJ Identifies and Charges Mt. Gox Hackers For Stealing 647,000 Bitcoin",
    "Russians charged with hacking Mt. Gox exchange and operating BTC-e",
    "Russians charged with hacking Mt. Gox crypto exchange, running BTC-e",
    "US DOJ Charges Two Russian Nationals With Mt. Gox Hack",
    "U.S. DOJ Charges Two Russians For Hacking Mt Gox",
    "DoJ charges 2 Russians for hacking Mt. Gox crypto exchange",
    "US Justice Department charges two men in Mt. Gox hack",
    "Mt. Gox Suspects Charged: Russian Nationals Indicted by DOJ",
    "DOJ charges two Russians in Mt. Gox crypto hack",
    "Two Russians Charged for Infiltrating Mt Gox and Operating Illicit Crypto Exchange, BTC-e",
    "DOJ charges Russian nationals with laundering bitcoin in 2011 Mt. Gox hack",
    "US DoJ charges two Russians for hacking crypto exchange Mt. Gox",
    "Russian nationals accused of Mt. Gox bitcoin heist, shifting stolen funds to BTC-e",
    "DOJ charges two Russian nationals with historic Mt. Gox hack",
    "DOJ unseals Mt. Gox charges targeting two Russian nationals",
    "US Hits Two Russians With Criminal Charges Over Mt. Gox Bitcoin Hack",
    "Breaking: US DOJ Charges Russian Nationals In Mt. Gox Hack & Running BTC-e Exchange",
    "DOJ unseals Mt. Gox charges against 2 Russian nationals",
    "Feds charge two men for the $400 million Bitcoin hack that took down Mt. Gox",
    "Breaking: DOJ Takes Down Mt. Gox Hackers For Multi-Million Dollar Crypto Theft",
    "US DOJ charges 2 Russians with laundering over 600k Bitcoin",
    "DOJ charges two Russian hackers with scheme to launder 647,000 BTC",
    "US DOJ officially names names in the granddaddy of all SFYL exchange hacks, Mt. Gox",
    "Robinhood To Remove ADA, Matic, and SOL After SEC Labels them as Securities",
    "XRP Holders Finally Back To Supporting Cardano Founder, But There's A Catch",
    "Users Can't Trade These Three Tokens on Robinhood Anymore",
    "Cardano (ADA), Polygon (MATIC), Solana (SOL) Update",
    "Robinhood to delist Solana, Cardano, Polygon tokens after SEC describes them as securities",
    "Robinhood to Delist ADA, SOL and MATIC After SEC Classification as ‘Securities’",
    "Crypto Tokens Plunged This Week After Gensler Stepped Up SEC's Industrywide Crackdown",
    "Robinhood Ceases Support For Cardano, Solana, And Polygon After SEC Calls Them Securities",
    "Robinhood to Delist Cardano, Solana, and Polygon Amidst SEC Regulatory Pressure",
    "Robinhood To Delist ADA, MATIC & SOL Following SEC's Crackdown",
    "Robinhood Delists Solana, Cardano, And Polygon",
    "Robinhood's decision to limit crypto trading makes good sense",
    "Robinhood pulls the plug on MATIC, SOL, ADA amid SEC crackdown",
    "Robinhood to cut support for Cardano, Polygon, and Solana",
    "Robinhood Delists Cardano, Polygon and Solana Following SEC Labeling Them As Securities",
    "Robinhood Markets removes three crypto tokens",
    "Solana, Cardano ..... baby why don't we go down to Kokomo",
    "Crypto is getting pummeled https://twitter.com/...",
    "Password sharing clampdown nets Netflix US subs",
    "A First Look At The Impact of Netflix's Password Sharing Crackdown",
    "Netflix subscription numbers rise amid password-sharing crackdown",
    "Netflix sees massive subscriber jump after password-sharing crackdown",
    "Uh Oh, Netflix's Password Sharing Crackdown Is Actually Working",
    "Netflix password crackdown boosts new subscribers to highest level since Covid began",
    "Netflix's Password-Sharing Crackdown a Success",
    "Netflix sees subscribers spike in the US, courtesy of new password sharing policies",
    "Netflix Subscriptions Jump as U.S. Password-Sharing Crackdown Begins",
    "Netflix sign-ups jump as US password sharing crackdown kicks off",
    "Netflix Saw as Much as 100,000 Daily Sign-Ups Post Password-Sharing Ban",
    "Netflix Adds More Than 200,000 New Subscribers After Password-Sharing Crackdown",
    "Netflix Password Sharing Crackdown Works, U.S. Subscriber Numbers Soar",
    "Netflix Subscriptions Rise as Password-Sharing Crackdown Takes Effect",
    "People can't seem to quit Netflix after all",
    "Netflix's password crackdown leads to massive subscription spike",
    "Netflix's password-sharing crackdown has really worked out — for Netflix",
    "Subscriptions Soar as Netflix Begins US Password-Sharing Crackdown",
    "Netflix's Password Sharing Crackdown Leads to Spike in Account Sign-Ups",
    "Netflix's password sharing crackdown seems to be working",
    "Silicon Valley Business Journal",
    "Netflix's crackdown on password sharing may be paying off",
    "Ugh, Netflix saw growth after the password crackdown. You know what that means.",
    "Apple vs. Meta is going to be the tech face-off to watch",
    "Netflix sees jump in subs as it begins to curb password sharing in US, says report",
    "Netflix's Password Sharing Crackdown Leads Subscriptions To Climb",
    "Netflix Reportedly Sees Spike In Sign-Ups Following Password Sharing Crackdown",
    "Netflix's crackdown on password sharing appears to be working",
    "Netflix Stock Rises As Account-Sharing Crackdown Boosts Paid Subscriber Numbers",
    "Netflix's password sharing crackdown is actually working as subscriptions spike",
    "Netflix Sign-Ups Jump Amid Password Sharing Crackdown, Report Says",
    "Netflix's subscriber numbers may have actually grown on the heels of its password sharing ban",
    "Netflix Sees Huge Growth In Subscribers After Password-Sharing Crackdown - Report",
    "Netflix Password-Sharing Rules Having Record-Setting Impact on American Subscriber Acquisition",
    "Netflix's Looming Account-Sharing Crackdown Sparks Surge of New Sign-Ups",
    "Sorry, but Netflix's password-sharing crackdown seems to be going really well so far",
    "In a shocking turn of events, Netflix subscriptions rise after password-sharing crackdown",
    "Gross subscriber addition ≠ net subscriber acquisition because: churn https://www.wsj.com/..."
]