[
    "International Business Times",
    "Changes to News Availability on Our Platforms in Canada",
    "Canadians will no longer have access to news content on Facebook and Instagram, Meta says",
    "Facebook to end news access in Canada over incoming law on paying publishers",
    "Canada will require Google and Meta to pay media outlets for news under bill set to become law",
    "Meta says it will block news from Facebook, Instagram in Canada",
    "Canada's Online News Act Targets Facebook and Google",
    "Meta To Block News On Canadian Facebook, Instagram After Bill C-18 Gets Thumbs Up",
    "Facebook shutters news rather than pay up under new Canadian law",
    "Meta to pull news from Facebook and Instagram in Canada",
    "Meta is yanking news from Facebook and Instagram in Canada",
    "Meta to Remove News From Facebook and Instagram in Canada",
    "Meta to end news sharing on Facebook and Instagram for all Canadians",
    "Meta stops serving news to the Canadian users as Bill C-18 gets closer becoming reality",
    "Meta will remove news from Facebook and Instagram in Canada",
    "Meta to follow through on Facebook, Instagram block in Canada after content bill advances",
    "Meta to halt news on Facebook and Instagram in Canada",
    "Canada residents will not be able to access news on Facebook, Instagram; Here's why",
    "Facebook says it will pull Canadian access to news as Bill C-18 heads for Royal Assent",
    "Facebook vows to restrict news access in Canada",
    "Meta pulls news content from Canadian Facebook and Instagram",
    "Meta makes good on promise to remove news from Canadian Facebook",
    "Meta to End News on Facebook and Instagram in Canada",
    "Meta to pull plug on news sharing in Canada",
    "Bill C-18: Liberal Government's Online News Act Becomes Law",
    "News Media Canada Welcomes Passage of Online News Act",
    "Meta to Block News on Facebook, Instagram in Canada Over New Law",
    "After Royal Assent of Bill C-18, Meta Reaffirms It Will End News Sharing in Canada",
    "Meta has already basically cut off all traffic to news sites anyway https://twitter.com/...",
    "Oh no!! Just kidding. #NoOneCares https://twitter.com/...",
    "The Online News Act is now law! #C18 #CdnPoli https://twitter.com/... [image]",
    "Canadians will no longer have access to news content on Facebook and Instagram",
    "Meta confirms it will block news on Facebook, Instagram as Senate passes Bill C-18",
    "Facebook confirms that all news sharing in Canada will end due to passage of Bill C-18",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "Apple Card May Soon Hit India As iPhone Maker Reportedly Talks With Local Banks, Regulator",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple Card may arrive in India soon in partnership with HDFC Bank",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card and Apple Pay could soon launch in India",
    "Apple Card could expand to India, four years after US rollout",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple Card will launch in India next, report claims",
    "Will Apple Card arrive in India before it reaches Europe?",
    "Samsung Pay rival Apple Pay is coming to India as well",
    "Apple in talks to launch Apple Pay in India",
    "Why Credit Card Adoption Is Rising In India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Vision Pro to Feature ‘Travel Mode’ for Better In-Flight Experience",
    "Exploring visionOS for Apple Vision Pro, iOS 17 Beta 2, and Apple Tech for Travel",
    "Apple Vision Pro Travel Mode could make economy feel like first class — but is it worth it?",
    "Apple Vision Pro's Guest Mode will let you share the $3,500 headset with friends",
    "Apple releases VisionOS SDK, developers can apply for Vision Pro hardware kit",
    "Apple Vision Pro has a Travel Mode that could change how you fly — here's how",
    "Apple wants you to wear a Vision Pro while flying",
    "I think Vision Pro might threaten Google Search more than ChatGPT",
    "Apple Releases visionOS SDK to Get Developers Amped for Vision Pro",
    "Apple Releases visionOS SDK, Creating Spatial Experiences, Apple's Developer Advantage",
    "Apple Vision Pro has speed limit, requires Travel Mode for in-flight use",
    "A First Look at Vision Pro's Travel Mode",
    "Apple Vision Pro may have a Travel Mode for plane rides",
    "Apple Vision Pro headset packs interesting ‘Travel Mode’ feature - here's a look",
    "Apple Vision Pro will have an in-flight Travel Mode - here's what we know",
    "Apples Vision Pro features a Travel Mode designed for the airplane use",
    "visionOS SDK  —  Apple today announced the availability of new software tools and technologies …",
    "6 things we've learned about the Apple Vision Pro from the visionOS beta",
    "Apple's Vision Pro features a ‘Travel Mode’ designed for airplane use",
    "The Apple Vision Pro could come with a ‘travel mode’ for plane rides",
    "Travel Mode for Apple's Vision Pro headset discovered in visionOS code",
    "Apple Unveils Vision Pro SDK and Developer Labs",
    "visionOS beta reveals new glimpses of Apple Vision Pro capabilities",
    "Travel Mode in visionOS optimizes your Vision Pro experience on airplane flights",
    "Apple Vision Pro to offer ‘Travel Mode’ for airplane flights",
    "Apple's Vision Pro headset will have a special ‘Travel Mode’ for in-flight use",
    "Apple's Vision Pro will have a special mode for using it on an airplane",
    "Here's a Walkthrough of visionOS, Apple Vision Pro Software [VIDEO]",
    "Apple Vision Pro to include ‘Guest Mode’ for sharing headset with others",
    "Microsoft Claims Bobby Kotick Demanded Bigger Revenue Share to Put Call of Duty on Xbox",
    "Sony Says It Couldn't Reveal PS6 Info To Activision After Microsoft Deal, Which Is A Trap",
    "Private email shows PlayStation chief unworried about Xbox-exclusive Call of Duty",
    "The FTC's case against Microsoft could quickly turn into Xbox vs. PlayStation",
    "Microsoft, FTC square off in Activision trial",
    "Sony says it wouldn't share PS6 details with Microsoft-owned Activision",
    "Microsoft Says Even Rival Sony Had No Concern Over Activision Deal",
    "Bethesda Exec Explains Why Starfield Being Xbox Exclusive Is a Good Thing",
    "Is PlayStation Really Worried About Losing Call of Duty To Microsoft? Private Emails Say No",
    "Can a Hollywood Operator Help TikTok? That Didn't Go So Well the First Time",
    "Sony to withhold PlayStation 6 info from Activision if Microsoft buyout completes",
    "Sony's PlayStation Chief Privately Denies Microsoft's Activision Deal is About Xbox Exclusivity",
    "Jim Ryan Wasn't Overly Concerned About Call Of Duty Xbox Exclusivity",
    "Xbox's Phil Spencer has final say on game exclusivity",
    "The view from day one: Microsoft challenges FTC in court over acquisition of Activision Blizzard",
    "PlayStation boss' private email said he wasn't worried about Xbox-Activision deal",
    "Microsoft says it could abandon the Activision deal if it is delayed by federal judges",
    "Hearing Over Microsoft's Takeover of Activision Blizzard Begins, With Bigwigs Set to Testify",
    "PlayStation Boss Admitted Xbox/Activision Deal Isn't About CoD Exclusivity In Private Email",
    "Sony is prepared to cut Activision Blizzard from PlayStation 6 plans",
    "To Clear Activision Deal, Microsoft Says: We've Lost The Console Wars",
    "Sony: No PlayStation 6 Information for Activision if Microsoft Deal Goes Through",
    "Microsoft paints Sony as ‘complainer-in-chief’ against $75bn Activision deal",
    "@mattontech@mastodon.sdf.org",
    "PlayStation Boss Jim Ryan ‘Pretty Sure’ Call of Duty Will Remain on PlayStation in Bombshell Email",
    "Microsoft Says It Could Abandon Activision Deal if Judge Delays It",
    "Microsoft says Xbox has 'lost the console wars",
    "Bombshell Email Reveals Sony Didn't Believe Microsoft Would Take ‘Call Of Duty’ Exclusive",
    "FTC: Xbox-exclusive Starfield is “powerful evidence” against Activision deal",
    "Microsoft had to pay Activision extra to get Call Of Duty on Xbox",
    "Microsoft Admits it ‘Lost the Console Wars’ As it Tries to Salvage Activision Deal",
    "Xbox Has ‘Lost the Console Wars,’ Microsoft Says",
    "Microsoft Expects Next Console Generation to Start in 2028",
    "Microsoft and the FTC's fight over Activision reveals secret deals, bombshell emails, and more",
    "The Outer Worlds 2 might end up on PlayStation",
    "Microsoft Reckons The Next Console Generation Will Kick Off In 2028",
    "Microsoft Says Xbox Has Been Losing The Console Wars Since 2001",
    "Microsoft May Have Inadvertently Revealed When The PS6 Will Arrive",
    "Xbox's Indiana Jones Game Was Originally Set To Launch On PlayStation Too",
    "Microsoft Filing Claims That Xbox Lost the Console Wars",
    "Xbox admits defeat in ‘console wars’",
    "“Xbox Has Lost the Console Wars” Admits Microsoft, Next-Gen Consoles Expected in 2028",
    "Sony: Future PlayStation info won't be given to Activision Blizzard if Microsoft buys it",
    "Microsoft Says Xbox Has “Lost The Console Wars” As Part Of FTC Arguments",
    "Microsoft Claims That Xbox Has “Lost The Console Wars”?",
    "Xbox opens FTC defence by claiming it's ‘lost the console wars’",
    "Microsoft Is Literally Now Saying That Xbox Has ‘Lost The Console Wars’",
    "Xbox is actually a small indie game company... https://twitter.com/...",
    "Twitter agrees to comply with tough EU disinformation laws",
    "Is Twitter ready for Europe's new Big Tech rules? E.U. official says it has work to do",
    "Europe takes its fight against Big Tech to CEOs' turf: San Francisco",
    "Twitter faces ‘stress test’ of Europe's tough new Big Tech rules",
    "EU Warns Twitter Must Focus on Disinformation Ahead of Elections",
    "Musk Continues to Skirt Controversy as Twitter Works to Reassure Regulatory Groups and Ad Partners",
    "Twitter agrees to comply with tough EU disinformation laws |  Twitter",
    "First Mover Americas: Bitcoin Might Take a Breather",
    "JPMorgan launches euro blockchain payments for corporate clients",
    "JPMorgan expands its JPM Coin system to include euro payments: Bloomberg",
    "JPMorgan's JPM Coin Expands for Euro Transactions",
    "JPMorgan unveils euro blockchain payment solution",
    "JPMorgan's blockchain project expands to include euro-denominated payments",
    "JPMorgan bank deploys JPM Coin for euro-denominated payments",
    "JPMorgan Launches Euro Blockchain Payments via JPM Coin",
    "JPMorgan begins euro payments on its blockchain platform: Bloomberg",
    "US campaign against facial recognition in venues ramps up",
    "100 artists and venues sign pledge against facial recognition",
    "Over 100 artists boycott venues that employ face-scanning tech",
    "Amazon Pledges $100 Million for Generative AI Startups",
    "Google accuses Microsoft of anti-competitive cloud practices in FTC letter",
    "Amazon invests $100M in new Generative AI Innovation Center to accelerate solution development",
    "AWS unveils $100mn program to boost generative AI initiatives",
    "Amazon is playing the long game on A.I.",
    "Amazon is putting up $100m to battle Microsoft and Google for the next generation of AI",
    "Amazon Invests $100M in AWS Generative AI Innovation Center",
    "Generative AI: Amazon's US$100M Challenge",
    "Amazon “Sabotaged” User Attempts to Cancel Prime, FTC Alleges",
    "What generative AI means for businesses and how AWS can help",
    "AWS Investing $100M in Generative AI Center",
    "AWS pledges $100M to launch generative AI innovation center",
    "Amazon's AWS Invests $100 Million in Generative AI Innovation Center",
    "Amazon looks to boost generative AI projects with new $100M cloud initiative",
    "AWS Launches New $100M Generative AI Innovation Center",
    "AWS Invests $100 Million In Its Generative AI Innovation Center",
    "AWS is putting $100 million into a center to help companies use generative AI.",
    "AWS invests $100 million in new Generative AI Innovation Center",
    "AWS invests $100 million to help customers succeed with generative AI",
    "Amazon Is Spending $100 Million to Teach Cloud Customers About AI",
    "Google Takes Aim at Microsoft's Azure Cloud Practices",
    "Russia tells Amazon Web Services to set up local representation or face restrictions",
    "They will Spinoff AWS. Trust me. $AMZN https://twitter.com/...",
    "Effective scheduling is key to workforce optimization",
    "Weird this didn't make it into the Twitter Files. https://www.washingtonpost.com/ ...",
    "TikTok COO, who defended firm against China fears, quits after 5 years",
    "TikTok's senior U.S. executive steps down, signaling major change",
    "TikTok looks to challenge Amazon and Shein with new e-commerce initiative",
    "Top TikTok exec and public face of company in US is stepping down",
    "TikTok COO V Pappas departs to pursue ‘entrepreneurial passions’",
    "TikTok's Top U.S. Executive to Leave the Company After Nearly Five Years",
    "TikTok Trendy Beat Shop to take on Wish, Temu et al",
    "Former Disney Executive Zenia Mucha Joins TikTok as Chief Brand and Communications Officer",
    "Advertisers Embrace TikTok at Cannes Despite Threat of Bans",
    "TikTok COO V Pappas steps down but takes on advisory role",
    "TikTok COO Pappas has quit - The Information",
    "TikTok expands ecommerce efforts with ‘Project S’",
    "TikTok's COO Vanessa Pappas Steps Down Amid Security Concerns",
    "TikTok Shakes Up Leadership Amid Questions About Its Future",
    "TikTok chief operating officer V Pappas steps down after five years",
    "Ex-Disney powerhouse Zenia Mucha hired by TikTok amid political pressure",
    "Vanessa Pappas Steps Down as TikTok COO",
    "TikTok operating chief Pappas to step down after five years",
    "TikTok's COO to step down after nearly 5 years at the popular social media company",
    "TikTok's #2 Exec Bails as Company Fights for Its Life",
    "TikTok COO Pappas Steps Down; Disney Veteran Joins as Communications Chief",
    "TikTok chief operating officer to step down",
    "V. Pappas, the COO of TikTok, has resigned",
    "V Pappas is leaving TikTok.",
    "TikTok COO V Pappas departs as the app faces more congressional battles",
    "TikTok COO V. Pappas Steps Down",
    "TikTok's most visible U.S. exec steps down",
    "TikTok's top U.S. executive to leave",
    "TikTok COO V Pappas steps down after five years in the role",
    "TikTok Shake-Up: COO V Pappas to Step Down, Ex-Disney Exec Zenia Mucha to Lead Comms",
    "TikTok COO Pappas Steps Down",
    "Here's the note I sent to all TikTok employees this morning [image]",
    "Big VC, Tech Got Backstop for Billions in Uninsured SVB Deposits",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/22 - So, Elon And Zuck Are Gonna Fight, I Guess",
    "Jun 19-23Cannes LionsCannes",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "SEC to Forego BlockFi's Outstanding $30 Million Penalty—For Now",
    "SEC postpones $30 million BlockFi penalty to boost creditor repayments",
    "US SEC Agrees to Forego BlockFi's $30M Fine Until Investors are Repaid",
    "SEC To BlockFi In $50 Million Settlement Saga - Pay Debtors First",
    "SEC Temporarily Suspends $30M BlockFi Penalty Pending Investor Repayment",
    "SEC allows BlockFi customers to be repaid before collection of $30.2M fine",
    "SEC delays BlockFi's $30 million penalty, focusing on investor reimbursement",
    "Wait, Reddit had less than $700M of revenue?? How?? https://twitter.com/...",
    "Reddit sales growth slowdown preceded fight over new API fees",
    "Joe Biden reiterates semiconductors will be made in the US again",
    "Film Forum Union Ratifies First Contract",
    "YouTube now requires users to declare if they are fan accounts",
    "YouTube is going after fan channels that impersonate others",
    "YouTube updates its policy for Fan Channels: Here's how it will impact creators",
    "YouTuber's channel terminated after the platform mistakenly identifies “graphic nudity”",
    "Micron, Applied Materials, make big investments in India",
    "Biden and Modi Announce Defense, Chips Deals at White House",
    "India confirms Micron's ATMP plant in Gujarat",
    "India will pay for 70% of Micron's $2.75 billion packaging plant",
    "Micron plans its first India facility, will invest up to $825 million in the initiative",
    "PM Modi invites Micron to boost chip making in India: Key things to know",
    "Micron to invest up to $825 mn in chip assembly plant in Gujarat",
    "Micron announces new India chip facility with investment up to nearly $2.8B",
    "PM Modi US visit: Micron to invest $800 million-plus for chip facility in India",
    "Micron to invest $825 mn in Gujarat semiconductor facility",
    "Micron announces $2.75bn chip testing project amid PM Modi's US visit",
    "Micron to set up $2.75 billion India chip assembly facility",
    "Micron Unveils UFS 4.0 Mobile Storage Using 232-Layer NAND For Huge Bandwidth Gains",
    "Micron to invest $825m for building chip assembly plant in India",
    "Micron and Applied Materials to Invest in India as Chip Makers Diversify",
    "Micron to invest $2.7B to set up chip packaging unit in India",
    "U.S. Offers India Drones, Jet Engines to Lure It From Russia",
    "Micron to set up a $2.75 billion semiconductor assembly, test facility in India: Check details",
    "Chipmakers Applied Materials, Micron To Invest Over $1.2 Bn In India",
    "Captions Raises $25M in Series B Funding",
    "Captions Announces A $25 Million Series B for Our AI-Powered Creative Studio",
    "Antitrust Threat to Figma-Adobe Deal Thwarts Hopes for VC Rebound",
    "AI video creation app Captions bags $25M from top VCs",
    "Video editing app Captions raises $25 million to build on its 100,000 daily active users",
    "Investing in Captions  —  As an investor, one of the most rewarding aspects of my job …",
    "Argonne National Laboratory",
    "Argonne Aurora Supercomputer Intel Max Blade Installation is Complete",
    "Aurora Supercomputer Blade Installation Complete",
    "Aurora's 10,624 Blades in Place as Exascale System Nears Completion",
    "2 ExaFLOPS Aurora Supercomputer Is Ready: Intel Max Series CPUs and GPUs Inside",
    "Intel, HPE Load Aurora Supercomputer With Over 63,000 GPUs, 21,000 CPUs",
    "Argonne installs final components of Aurora supercomputer",
    "Intel and HPE complete assembly of record-breaking Aurora supercomputer",
    "Intel Aurora Supercomputer Ready To Break Records With Nearly 64K GPUs Across 10K Blades",
    "Intel & HPE Declare Aurora Supercomputer Blade Installation Complete",
    "Awesome to see this!  It took a village!  Congratulations!!",
    "Prime Trust Has ‘Shortfall of Customer Funds,’ Nevada Regulator Says",
    "Prime Trust halts withdrawals and deposits as acquisition fails",
    "Prime Trust Halting Deposit/Withdrawal",
    "Nevada regulator says Prime Trust can't meet withdrawal requests",
    "Prime Trust insolvency fears, Nevada regulator issues cease-and-desist order",
    "Crypto Custodian BitGo Cancels Acquisition of Prime Trust",
    "Nevada regulator says Prime Trust can't meet all client withdrawals",
    "Prime Trust Suspends Withdrawals After BitGo Terminates Acquisition Deal",
    "Stably pauses withdrawals, minting after Prime Trust halts deposits",
    "Prime Trust halts withdrawals as acquisition falls through",
    "In another blow to crypto, Stably halts withdrawals",
    "(Stably) Prime Trust Halting Deposit/Withdrawal (USDS, BTCS, ETHS)",
    "Robinhood expands into credit sector with $95m acquisition of X1",
    "Robinhood Signs Agreement to Acquire X1",
    "Robinhood acquires credit card startup X1",
    "Robinhood Acquires FinTech Firm X1 to Offer No-Fee Credit Card",
    "Robinhood Ventures into Credit Card Market with Acquisition of Fintech X1",
    "Robinhood buys credit card fintech X1 for $95M",
    "Robinhood to Acquire Credit Card Startup X1 for $95 Million",
    "Robinhood Eyes Banking Market With $95M Credit Card Acquisition",
    "Robinhood Acquiring Credit Card Startup X1",
    "No Cash? No Problem: Robinhood Prepares To Offer Credit To Its Users",
    "Robinhood buys credit card startup X1",
    "Robinhood Announces $95 Million Acquisition of Credit Card Startup X1",
    "Robinhood agrees to acquire credit card startup X1",
    "Support for cybersecurity clinics across the U.S.",
    "Google announces $20 million investment for cyber clinics",
    "Google commits $20M to help fund ‘Cybersecurity Clinics,’ jobs",
    "@LokiTheCat@toot.community",
    "@BobRobertsonXI@hachyderm.io",
    "DuckDuckGo Windows browser now available in public beta",
    "DuckDuckGo's privacy-focused browser is available for Windows now",
    "DuckDuckGo browser comes to Windows in beta: Features, how to download and more",
    "Worried about your online privacy? DuckDuckGo's browser has arrived on Windows 11",
    "DuckDuckGo Browser For Windows Enters Public Beta",
    "DuckDuckGo's Windows browser is now available in open beta",
    "Protect your privacy with public beta of DuckDuckGo web browser for Windows",
    "DuckDuckGo is bringing its browser to Windows",
    "DuckDuckGo's Privacy-Focused Web Browser Now Available for Windows",
    "DuckDuckGo Browser Launches on Windows in Beta",
    "DuckDuckGo's Windows browser is here to protect your privacy",
    "DuckDuckGo browser for Windows available for everyone as public beta",
    "DuckDuckGo launches privacy-first Windows browser in beta",
    "DuckDuckGo's Privacy-Enhanced Browser Waddles Into Windows, How It Compares To Chrome",
    "DuckDuckGo's Privacy Focused Web Browser Is Finally Available for Windows",
    "DuckDuckGo's Privacy Browser Enters Open Beta On Windows - Here's How To Try It Out",
    "You Can Try DuckDuckGo's Windows Browser Now",
    "DuckDuckGo browser comes to Windows with a ton of privacy and security features",
    "DuckDuckGo Releases Beta Privacy Browser for Windows",
    "DuckDuckGo launches privacy-focused Windows web browser",
    "DuckDuckGo Launches Privacy-Centric Browser for Windows",
    "DuckDuckGo Browser Beta Now Available to All Windows Users",
    "DuckDuckGo's privacy-focused web browser now available for Windows (in beta)",
    "DuckDuckGo privacy-focused browser ships to Windows in open beta",
    "DuckDuckGo's Windows browser is now available as a public beta release",
    "The DuckDuckGo Windows web browser has launched in open beta for more privacy while surfing",
    "DuckDuckGo's privacy-focused browser is now available for Windows",
    "Hands-On with DuckDuckGo Browser for Windows https://www.thurrott.com/...",
    "Good news for #privacy. #WindowsInsiders https://www.theverge.com/...",
    "DuckDuckGo browser beta for Windows bakes in a lot of privacy tools",
    "DuckDuckGo Browser Beta for Windows Bakes in a Lot of Privacy Tools",
    "DuckDuckGo offers its privacy-centered browser in a Windows open beta",
    "Twitter CEO starts fighting Musk's battles, paying Musk's overdue bills",
    "New Twitter CEO Starts Paying the Bills: Report",
    "Twitter CEO Intervened to Mend Google Relationship After Cloud Payment Issue",
    "Google Cloud with a chance of Musk balls.",
    "New Twitter CEO Steps In to Repair Relationship with Google",
    "Twitter has apparently started paying for Google Cloud again",
    "Twitter pays Google Cloud bill, fixes relationship - report",
    "Twitter resumes paying Google Cloud",
    "Twitter resumes paying for Google Cloud",
    "Apple fixes 0-day kernel and WebKit security flaws in iOS, macOS, watchOS, and more",
    "Apple fixes iPhone software flaws used in widespread hacks of Russians",
    "Apple fixes critical zero-day vulnerabilities in iOS, macOS, & watchOS",
    "Apple issues fix for ‘Triangulation’ spyware vulnerability",
    "Apple Fixes Multiple 4-Year-Old Zero-Days",
    "About the security content of iOS 15.7.7 and iPadOS 15.7.7",
    "Apple fixes zero-day security flaws in iOS, macOS, watchOS, and more",
    "Apple issues fix for zero-day flaws used in spy attacks against Kaspersky. Patch now!",
    "Zero-Day Alert: Apple Releases Patches for Actively Exploited Flaws in iOS, macOS, and Safari",
    "Apple addressed actively exploited zero-day flaws in iOS, macOS, and Safari",
    "If you're reading this on an Apple device, go update it right now",
    "Apple fixes zero-day vulnerabilities used to covertly deliver spyware (CVE-2023-32435)",
    "Apple addresses two zero-days exploited in Operation Triangulation spyware campaign",
    "@FirewallDragons@mastodon.social",
    "Important Apple updates, install soon.  —  https://www.macrumors.com/...",
    "@lorenzofb has there been evidence that this is related to the Kaspersky claims?",
    "Rocking horse shit and hen's teeth rarity value here I reckon... https://twitter.com/...",
    "“The developers refer to string decryption as ‘unmunging’” https://twitter.com/...",
    "More details about the iOS spyware targeting employees at @kaspersky. https://twitter.com/...",
    "...so there is (very likely) a macOS version too 👀 https://twitter.com/... [image]",
    "Apple fixes zero-days used to deploy Triangulation spyware via iMessage",
    "iOS 16.5.1, macOS 13.4.1, and a slew of updates fix “actively exploited” security bugs"
]