[
    "Reddit CEO slams protest leaders, saying he'll change rules that favor ‘landed gentry’",
    "Reddit CEO Steve Huffman: 'It's time we grow up and behave like an adult company'",
    "Reddit's CEO really wants you to know that he doesn't care about your feedback",
    "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts",
    "Key Facts to Understanding Reddit's Recent API Updates",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’",
    "Reddit Says 80% of Top Forums Online After Days of API Protest",
    "Reddit CEO Stands Firm Amidst Protests: 'It's Time We Grow Up'",
    "Reddit's CEO Is Just Making Everything Worse",
    "Reddit CEO Pushes Back Against Blackout—Will Consider Letting Users Vote Out Moderators",
    "Reddit Knowingly Downvoting Self | Future Tech",
    "Oh man.  He's doing the CEO equivalent of posting through it.",
    "Spez is a little bitch and I hope his IPO fails and he gets shitcanned. https://twitter.com/...",
    "Lol Reddit is only going to get more fun over the next two weeks https://twitter.com/...",
    "Yeah well users should be able to vote out executives https://twitter.com/...",
    "It also wasn't designed to pay dividends to shareholders https://twitter.com/...",
    "Gorilla mindset, baby. https://twitter.com/...",
    "the reddit ceo looks like someone who posts in alt-right subreddits https://twitter.com/...",
    "never go full elon https://twitter.com/...",
    "Reddit CEO slams protesters, calls them “landed gentry”",
    "Reddit CEO Steve Huffman isn't backing down: our full interview",
    "Reddit CEO slams protesters, says he'll change site rules",
    "Reddit CEO slams protest leaders, calls them ‘landed gentry’",
    "“Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related Blackouts”",
    "Reddit CEO Steve Huffman: Reddit ‘was never designed to support third-party apps’ - The Verge",
    "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "The Official Squarespace …",
    "Google Domains shutting down, assets sold and being migrated to Squarespace",
    "The Official Squarespace Newsroom",
    "Squarespace Enters Definitive Agreement to Acquire Google Domains Assets",
    "About the Squarespace purchase of Google Domains registrations",
    "Squarespace buys Google Domains for $180 million",
    "Squarespace Says It Will Acquire Google Domains Assets From Alphabet",
    "Google is selling its Domains business to Squarespace",
    "Google Sells Google Domains as Part of ongoing Cost-Cutting Efforts",
    "I am absolutely shocked. lmao https://9to5google.com/...",
    "that's what you get for using a Google product 🫡 https://twitter.com/...",
    "Goodbye Google Domains https://twitter.com/...",
    "This season of Killed by Google sucks https://twitter.com/...",
    "At this point why would anyone use Google for anything other than search 🤡 https://twitter.com/...",
    "so long, google domains 🫡 https://twitter.com/... [image]",
    "Alphabet selling Google Domains assets to Squarespace",
    "Squarespace acquires Google Domains",
    "Alphabet Selling Google Domains Assets to Squarespace",
    "U.S. government says several agencies hacked as part of broader cyberattack",
    "‘Several’ US federal agencies affected by MOVEit breach",
    "US energy department, other agencies hit in global hacking spree",
    "Energy Department among ‘several’ federal agencies hit by MOVEit breach",
    "CISA Director tells MSNBC several federal agencies hit in cyberattack",
    "Two Energy Department entities breached as part of massive MOVEit compromise",
    "Missouri Office of Administration",
    "State of Missouri Issues Statement on Recent Global Cyberattack",
    "No ‘systemic risk’ to government networks from latest breach, CISA says",
    "Several U.S. Government Agencies Hacked in Cyberattack",
    "Several US government agencies were targeted in a global cyberattack",
    "Russian Ransomware Group Breached Federal Agencies in Cyberattack",
    "US Government Targeted in Widespread Cyberattack",
    "MOVEit exploit used against ‘several’ federal government agencies",
    "Russian cybercrime gang hacks federal agencies",
    "Multiple federal agencies hit in cyberattack: report",
    "US Government Agencies Breached In Global Cyber Attack Incident",
    "Global Cyberattack Hits Several US Federal Agencies",
    "US Agencies Hit in MOVEit Hacks as Victim List Grows",
    "for the record - it was cl0p. https://www.cnn.com/...",
    "Oil and gas giant Shell confirms it was impacted by Clop ransomware attacks",
    "MOVEit Transfer customers warned of new flaw as PoC info surfaces",
    "Clop Leaks: First Wave of Victims Named",
    "Clop has stepped up MOVEit attacks: here are five ways to manage the situation",
    "Clop MOVEit hacking victims now include Department of Energy facilities",
    "US government hit by Russia's Clop in MOVEit mass attack",
    "Third Flaw Uncovered in MOVEit Transfer App Amidst Cl0p Ransomware Mass Attack",
    "Hacker gang Clop publishes victim names on dark web",
    "Reports: Progress MOVEit Hacks Hit Federal Government, State Agencies, Companies",
    "Clop names a dozen MOVEit victims, but holds back details",
    "Clop begins naming alleged MOVEit victims",
    "Russian national arrested in Arizona, charged for alleged role in LockBit ransomware attacks",
    "Russian National Charged With Carrying Out 4 LockBit Attacks",
    "LockBit Affiliate Arrested, as Extortion Totals Reach $91M Since 2020",
    "Russian ransomware hacker extorted millions from U.S. businesses, prosecutors say",
    "Russian national charged in ransomware attacks against businesses in US",
    "Russian national arrested in US for deploying LockBit ransomware",
    "FEDS ARREST, CHARGE RUSSIAN NATIONAL IN ARIZONA FOR LOCKBIT ATTACKS",
    "Intel to start shipping a quantum processor",
    "Intel Debuts Tunnel Falls Quantum Chip and LQC Program to Work with It",
    "Intel Announces Release of ‘Tunnel Falls,’ 12-Qubit Silicon Chip",
    "Intel's New Chip to Advance Silicon Spin Qubit Research for Quantum Computing",
    "Partnerships bring together UW-Madison quantum computing research, industry leaders",
    "Intel Tunnel Falls Into Quantum Computing",
    "Intel Comes Out of Quantum Stealth with their 12 Qubit Tunnel Falls Chip",
    "Intel launches groundbreaking quantum computing chip ‘Tunnel Falls’",
    "Intel launches quantum chip Tunnel Falls",
    "Intel shows mass produced 12qbit CMOS quantum chip",
    "Intel continues to pave its own quantum path with Tunnel Falls",
    "IBM quantum computer passes calculation milestone",
    "Intel unveils Tunnel Falls 12-qubit quantum chip",
    "IBM touts error mitigation for greater quantum computing performance",
    "Intel Announces Its Newest Silicon-Based Quantum Chip",
    "Intel sprinkles 12-qubit quantum test chips into the hands of researchers",
    "We got a new contender in quantum computing",
    "New paper from IBM and UC Berkeley shows path toward useful quantum computing",
    "Introducing the Partner Plus Program",
    "Twitch Introduces 70/30 Revenue Split For Some Streamers Through New Program—With Some Caveats",
    "Twitch Reveals What It Will Take for Partners to Get 70% of Subscription Revenue",
    "Streamers claim Twitch payouts were lowered without warning",
    "Twitch execs hold Q&A on new Partner Plus program",
    "Twitch Introduces 70-30 Revenue Split, But There's A Catch",
    "Twitch's new partner program aims to increase creators' revenue split",
    "Twitch Enrages Streamers Again With Convoluted New Revenue Share Program",
    "Twitch's new Partner Plus program offers some streamers a 70/30 revenue split",
    "Twitch will give smaller streamers a bigger cut of subscriptions",
    "Twitch's New Partner Program Will Finally Give Streamers A 70/30 Cut Of The Revenue Pie",
    "Twitch introduces 70/30 revenue split for partners with new program—but there's a catch",
    "Twitch introduces the Partner Plus Program with a 70/30 spit.",
    "4D chess... https://twitter.com/...",
    "Inhuman Writing for Google Is Eating the Web",
    "Micron Vows $600 Million China Investment Weeks After Chip Ban",
    "Micron to invest $600mn in Chinese factory despite Beijing ban",
    "Micron invests $602m in Chinese plant amid chip restrictions",
    "Micron says committed to China, invests $602 mln in existing plant",
    "Amazon's second headquarters comes to life in 21 photos from the official opening",
    "Amazon debuts its headquarters complex in Virginia as it brings workers back to office",
    "Amazon officially opens first phase of HQ2 in Virginia with room for 14k employees",
    "As Amazon HQ2 opens its doors, neighbors brace for a transformation",
    "VICE: YouTube Tells Open-Source Privacy Software ‘Invidious’ to Shut Down",
    "Ticketmaster and Seat Geek to dump “junk fees” after White House pressure",
    "Watch Out for ‘Junk’ Fees When Booking Travel Online",
    "Ticketmaster parent Live Nation, others agree to show ‘junk fees’ after Biden pressure",
    "Live Nation-Ticketmaster to disclose full ticket prices upfront",
    "Ticket Giants, Under Pressure From Biden, Promise Transparency on Fees",
    "Ticketmaster says it will now institute ‘all-in pricing,’ but here's what that really means",
    "Live Nation and Ticketmaster are pledging to President Biden to show fees up front",
    "Biden praises companies for ending hidden fees",
    "Biden Applauds Ticketmaster's Plans for Fee Transparency After Taylor Swift Debacle",
    "Biden hauls in Live Nation, Airbnb, other execs to White House amid crackdown over junk fees",
    "Live Nation and Ticketmaster to start showing hidden ticket costs",
    "Ticketmaster, Others Agree to All-In Pricing as White House Cracks Down on Hidden Junk Fees",
    "Ticketmaster, SeatGeek pledge to show all-in pricing for customers up front: White House",
    "Live Nation and SeatGeek will stop hiding junk fees",
    "Ticketmaster to Announce Transparency on Fees at Biden Meeting",
    "Biden announces Live Nation and Ticketmaster will allow consumers to see all fees up front",
    "Ticketmaster, SeatGeek agree to show ‘all-in’ prices after Biden's junk fee crackdown",
    "Ticketmaster, SeatGeek to Show Ticket Buyers ‘All In’ Pricing That Includes Fees",
    "Comcast tells the FCC that it doesn't want to reveal its hidden broadband fees upfront",
    "Ticketmaster To Offer “All-In” Pricing As Joe Biden Promotes Progress On Eliminating “Hidden Fees”",
    "Ticketmaster, SeatGeek Commit to All-In Pricing After “Junk Fees” Criticism",
    "Oh the junk fees will be there, this is just a new way to hide them",
    "Ticket giants promise fee transparency, under pressure from Biden https://www.nytimes.com/...",
    "This is great news. https://twitter.com/...",
    "Intel Announces Major Brand Update Ahead of Upcoming Meteor Lake Launch",
    "Intel is officially killing off the ‘i’ in Core i7 — as it goes Ultra",
    "Intel announces biggest processor brand update in 15 years",
    "Intel is ditching the ‘i’ in its CPU branding for a simpler Intel Core and Core Ultra naming",
    "Intel just admitted defeat",
    "Intel Meteor Lake chips will drop the i branding and add an Ultra tier",
    "Intel's new processor branding drops the ‘i’ - and the ball",
    "Intel Rebrands its Processors into Intel Core, Intel Core Ultra",
    "Can A New Name Save Intel?",
    "Intel shakes up mainstream CPU branding, introduces Core Ultra line",
    "Say bye to the ‘i’ — Intel details new Core, Core Ultra chip branding",
    "Intel's new Core CPU branding is official: “i” is out, Ultra is in",
    "Intel responds to the Apple silicon Mac Pro with its own ‘Ultra’ chips",
    "Intel Details New Branding Changes Coming With its Meteor Lake CPUs",
    "The last generation: Intel has new labels for its next major CPU architecture",
    "Intel Just Made Its Biggest Brand Change To Processors In 15 Years",
    "Intel Shakes Up Core Processor Lineup with Significant Rebranding Initiative",
    "Intel confirms ‘Ultra’ branding for Meteor Lake processors, drops ‘i’ from Core series chips",
    "Goodbye to the “i”: Intel rebrands its CPUs as Core and Core Ultra for Meteor Lake launch",
    "Intel Says Bye to the ‘i’ and Hi to the ‘Ultra’",
    "Intel Unveils New “Core” Branding For Next-Gen CPUs, First Featured on Meteor Lake",
    "Intel Changes Meteor Lake Naming: “i” Removed From “i9”, new Core “Ultra” Brand",
    "Intel is rebranding its processors starting with Meteor Lake",
    "Intel makes bold move with new names for its game-changing Meteor Lake processors",
    "Intel's Core rebranding exercise offers a glimpse at Meteor Lake CPU specs",
    "Weird way for Intel to acknowledge the end of its partnership with Apple",
    "They just made it more confusing... https://twitter.com/...",
    "Rolls off the tongue https://twitter.com/...",
    "They should have just brought back the pentium brand. https://www.anandtech.com/...",
    "Intel is officially killing off the ‘i’ in Core i5/i7/i9 - as it goes Ultra",
    "Intel To Launch New Core Processor Branding for Meteor Lake: Drop the i, Add Ultra Tier",
    "Intel now has “Ultra” chips",
    "Personalized wealth management, built for tech people",
    "Mandiant says China-backed hackers exploited Barracuda zero-day to spy on governments",
    "Barracuda ESG zero-day exploited by China-linked APT",
    "Chinese spies blamed for data-harvesting raids on Barracuda email gateways",
    "Critical Barracuda ESG Zero-Day Linked to Novel Chinese APT",
    "Barracuda ESG zero-day attacks linked to suspected Chinese hackers",
    "Chinese UNC4841 Group Exploits Zero-Day Flaw in Barracuda Email Security Gateway",
    "Chinese hackers ‘breached hundreds of public, private networks’ globally",
    "Mandiant attributes Barracuda Networks malware campaign to China-linked hackers",
    "Barracuda ESG devices actively exploited in broad, ongoing espionage campaign",
    "Attacks on Barracuda Networks linked to China-backed hacking group",
    "CISA Order Highlights Persistent Risk at Network Edge",
    "China Behind ‘Wide-Ranging’ Barracuda Attacks, Mandiant Says",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "Barracuda Networks Releases Update to Address ESG Vulnerability",
    "Chinese Hackers Exploit Barracuda ESG Zero-Day",
    "Exploitation of Barracuda ESG appliances linked to Chinese spies",
    "Mandiant Says China-backed Hackers Exploited Barracuda Zero-Day To Spy on Governments",
    "Adobe Reports Record Revenue in Q2 Fiscal 2023",
    "Adobe Beats Quarterly Goals On Record Cloud Software Demand",
    "Adobe tops quarterly results and forecast estimates driven by AI",
    "Adobe Raises Sales Forecast as Company Rolls Out New AI Features",
    "Adobe Q2 strong, aims to gain generative AI momentum, monetize",
    "Instagram Broadcast Channels: New Features and Popular Channels in India",
    "Following WhatsApp, Instagram is now rolling out its ‘Channels’ feature globally",
    "Meta Platforms' Instagram Expands Broadcast Channels Globally",
    "Instagram Expands Broadcast Channels to All Creators, Tests New Channel Options",
    "Instagram Broadcast Channels Roll Out Globally: What You Need To Know",
    "Instagram's One-Way Broadcast Channels Roll Out Globally",
    "Instagram is rolling out its Telegram-like broadcast channels worldwide",
    "Instagram expands broadcast channels feature globally. Here's how to use it",
    "Instagram update: Zuck just announced the roll out of global Broadcast Channels [image]",
    "Free compensation benchmarking data from 3,000 startups",
    "10 reasons why Zoho Sign is a better alternative to DocuSign",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/15 - Everbody Does Ads Now",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Why is the crypto market down today? June 2023 industry failure",
    "Cruz, Graham, Grassley join Democrats to advance journalism antitrust bill",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Senate Judiciary Committee Passes Journalism Competition And Preservation Act",
    "Senate Judiciary Committee Passes the Journalism Competition and Preservation Act",
    "American Economic Liberties Project",
    "Saving the News from Big Tech: The Journalism Competition and Preservation Act",
    "Cava Is No Cure for IPO Indigestion",
    "Alibaba to Bring Tmall eCommerce Site to Europe",
    "Alibaba aims to make Europe a top priority market, says president Michael Evans",
    "EU boss Breton: There's no Huawei that Chinese comms kit is safe to use in Europe",
    "Twitter's inability to pay its rent is more urgent than building ‘Twitter 2.0’",
    "EU executive to block Huawei from its contracts",
    "Huawei Is Not Getting 5G Chips From Qualcomm; the Rumors Are Fake!",
    "@williamgunn@mastodon.social",
    "Delivering high-quality facial animation in minutes, MetaHuman Animator is now available!",
    "You can now animate Epic's ultra realistic MetaHumans with an iPhone camera capture",
    "Blue Dot: A 3Lateral Showcase of MetaHuman Animator",
    "Epic Games launches MetaHuman Animator to capture high-quality human faces with an iPhone",
    "@Techmeme Are we all just going to ignore how much this is going to empower disinformation agents?",
    "Amazon and Disney announce Hey Disney! launch for Echo devices",
    "‘Hey Disney!’ voice assistant is now available on US Echo devices",
    "‘Hey Disney’ Brings Mickey and Crew to Your Amazon Echo",
    "‘Hey Disney:’ Dory and Mickey Can Now Respond to Your Kids on Amazon Echo",
    "Amazon Echo Devices Get Their First Custom Alexa-Based Assistant",
    "Amazon's ‘Hey Disney’ assistant finally arrives for U.S. Echo users",
    "‘Hey Disney’ Custom Alexa Assistant Arrives",
    "Logitech's Streamlabs Ultra Product Suite adds a powerful new podcast editor on PC",
    "Nvidia's rivals struggle to gain ground in generative AI chip war",
    "Nvidia's competitors falter in AI chip war",
    "Privacy concerns are keeping Google Bard from making its debut in the EU",
    "Google warning its own staff about chatbots may be a bad sign",
    "Google urges its employees to exercise caution with AI chatbots, including Bard",
    "Google Warns Employees about Using Bard, ChatGPT and Other AI Chatbots",
    "Silicon Valley Business Journal",
    "Google is warning staff about using AI chatbots — including its own Bard",
    "Google Warns Employees: Be Careful When Using Bard",
    "Google Warns Staff Over AI Chatbot Usage",
    "Google Tells Employees to Stay Away from Its Own Bard Chatbot",
    "Google Warns Its Staff Regarding the Usage of Chatbots, Including Bard",
    "Google's Cautionary Tale: The Double-Edged Sword of AI Chatbots Like Bard and ChatGPT",
    "Google warns Googlers to be wary about using Google Bard",
    "Google, maker of AI chatbot Bard, warns its employees about using chatbots",
    "Alphabet cautions employees on AI chatbot data amid competition",
    "Google has alerted its employees about the potential risks associated with AI chatbots",
    "Google recently warned employees about submitting sensitive data to its Bard chatbot.",
    "Google warns own staff about entering data into, using code from, chatbots",
    "Google Warns Staff About Chatbots",
    "@kevin_hardiman@mastodon …",
    "Microsoft's New DIY Approach: Surface Device Replacement Parts Now Available",
    "You can now buy Surface replacement parts in the Microsoft Store",
    "Microsoft Now Lets You Buy Surface Replacement Parts in Its Store",
    "Microsoft Store now sells replacement parts to repair Surface devices",
    "Microsoft Store Now Offers Replacement Components for Surface Devices",
    "Microsoft dabbles in self-repair with Surface devices now DIY-friendlier",
    "Microsoft now sells Surface replacement parts for DIY repairs",
    "You can now buy spare parts for your Surface device directly from the Microsoft Store",
    "@kevin_hardiman@mastodon.social",
    "Microsoft Now Sells Surface Replacement Parts, Including Displays, Batteries, and SSDs",
    "@agreenberg@infosec.exchange",
    "Uber app will soon try to show you video ads while you wait for your driver",
    "Get Ready For Video Ads In Uber And Uber Eats",
    "Uber will start showing video ads in its apps this week",
    "Uber will show ads in its apps while you wait for cars and food",
    "Uber Plans Rollout of Full-Length Video Ads Across Multiple Customer Touchpoints",
    "Me in the back of an Uber from now on. https://www.wsj.com/... [image]",
    "Sorry what? Ads while I book a ride or overpay for food? https://twitter.com/...",
    "Crypto Lobbyists Ask SEC for Info on Prometheum, the Mysterious ‘Regulated’ Crypto Firm",
    "Blockchain Assoc. requests info on Prometheum over ‘suspicious’ approval",
    "Prometheum: The New Beacon of Crypto Compliance in the Eyes of the SEC",
    "Blockchain Association Files FOI Inquiry Into Prometheum",
    "Blockchain Association wants to know more about SEC's interactions with Prometheum",
    "House testimony by crypto firm Prometheum CEO raises questions about regulation",
    "lol this prometheum bro must have the same amphetamine patch dealer as SBF https://twitter.com/...",
    "And who is running Prometheum? These guys: [image]",
    "Good investigation. https://twitter.com/...",
    "Smells like corruption https://twitter.com/...",
    "At least they haven't lost a billion dollars of customers funds. https://twitter.com/...",
    "“we were so close” [image]",
    "Self righteous grift claiming regulatory clarity is the absolute worst https://twitter.com/...",
    "Megaupload coders sentenced to prison after home detention bid denied",
    "Megaupload programmers cop a plea in New Zealand to avoid extradition",
    "Kim Dotcom's Megaupload Coders Sentenced to Prison, Herald Says",
    "New Zealand court sentences Megaupload coders to prison",
    "Megaupload coders avoid 10-year sentences by testifying against Kim Dotcom",
    "The Guys Who Ran Piracy Site Megaupload Sentenced to 2.5 Years in Prison",
    "Megaupload pair jailed for their part in Kim Dotcom's online empire",
    "Megaupload sentencing: Judge asked to consider home detention but Crown wants prison",
    "Two Megaupload executives sentenced to jail",
    "Former Megaupload Executives Sentenced to 2.5 Years in Prison",
    "We are coming for you, Kim. https://twitter.com/...",
    "Men who helped run Megaupload sentenced to prison in New Zealand",
    "2 men who helped run popular pirating website Megaupload sentenced to prison in New Zealand",
    "Steam Update: In-game overlay, notifications, and a fresh coat of paint",
    "Steam update brings new features & Mac hardware acceleration",
    "Steam :: Steam News :: Steam Desktop Update",
    "Steam app for macOS updated with hardware acceleration for better performance",
    "Steam Gets Massive Update With Refreshed UI, New In-Game Overlay",
    "Steam's Big Desktop Update Out of Beta, Tons of Improvements",
    "New Steam Update Enhances UI, Revamps Overlay, And Adds Notes",
    "Steam's Massive Overhaul Is Here With A Fresh Look And New Capabilities For Gamers",
    "Steam gets massive overhaul that brings updated visuals and exciting new features",
    "Steam update overhauls desktop client, brings notes and pinned windows",
    "The new Steam client update looks funky, comes with new features",
    "The biggest Steam update in years just arrived. Here's what's new",
    "How to add non-Steam games on Steam Deck",
    "Valve Releases Major Steam Desktop Client Update",
    "Valve refreshes the look of Steam, adds new features",
    "Valve's Steam redesign is finally here",
    "Russia-backed hackers unleash new USB-based malware on Ukraine's military",
    "Microsoft Warns of New Russian State-Sponsored Hacker Group with Destructive Intent",
    "Microsoft Names Russian Threat Actor “Cadet Blizzard”",
    "Cadet Blizzard emerges as a novel and distinct Russian threat actor",
    "Cyberattack wave in Ukraine linked to Russia's GRU, Microsoft says",
    "Microsoft identifies new hacking group controlled by Russian intelligence",
    "Novel Russian Threat Group Cadet Blizzard Is Behind Recent Wave of Attacks, Microsoft",
    "Microsoft links Cadet Blizzard APT to Russia's military intelligence GRU",
    "Microsoft identifies new hacking unit within Russian military intelligence",
    "Russian APT ‘Cadet Blizzard’ Behind Ukraine Wiper Attacks",
    "Microsoft identifies, names new Russian-sponsored threat group",
    "Ongoing Russian cyberattacks targeting Ukraine",
    "Microsoft Outs New Russian APT Linked To Wiper Attacks In Ukraine",
    "Microsoft links data wiping attacks to new Russian GRU hacking group"
]