[
    "International Business Times",
    "Reddit hackers threaten to leak data stolen in February breach",
    "Reddit hackers demand $4.5 million and API changes in threat to leak 80GB of data",
    "Hacked Reddit Data To Be Published Unless API Changes Dropped, Hackers Say",
    "Reddit hackers issue ransom demands for cash and API changes",
    "BlackCat claims they hacked Reddit and will leak the data",
    "Reddit hacker's demands include reversing API changes",
    "Hackers threaten to leak 80GB of stolen Reddit data; demands $4.5 million to delete it [details]",
    "The BlackCat ransomware gang is now threatening to leak stolen Reddit data",
    "Reddit fiasco: Now hackers steal 80GB of data, demand $4.5 million",
    "Reddit claimed to have been hacked by BlackCat, and it has threatened to leak the data [Update]",
    "Reddit Files: BlackCat/ALPHV ransomware gang claims to have stolen 80GB of data from Reddit",
    "Hackers threaten to leak 80GB of confidential data stolen from Reddit",
    "Hackers Threaten To Leak 80GB of Confidential Data Stolen From Reddit",
    "Internal Teams at Crypto.com Trade Tokens for Profit: Report",
    "Crypto.com operates internal proprietary trading desks: Financial Times",
    "Crypto.com Internal Trading Teams Prompt Concerns Over Conflicts of Interest",
    "Reports of Controversial Trading Practices at Crypto.com Emerge, Exchange Responds",
    "Crypto.com denies allegations of market prices manipulation",
    "Crypto.com says operating in-house trading team, market maker not ‘controversial’",
    "Crypto Live News: Intra-team Conflict Emerges Among Trading Groups at Crypto.com Exchange",
    "Crypto.com Uses ‘Internal Teams’ to Trade Assets for ‘Profit’: Report",
    "wonder how much he regrets the deal https://twitter.com/... [image]",
    "What could possiblity go wrong? https://twitter.com/...",
    "Twitter suspends memecoin-linked AI bot after Elon Musk's ‘scam crypto’ claim",
    "Meme Coin BOB Tanks 45% After Elon Musk Calls its Twitter Bot Account a ‘Scam’",
    "Twitter AI Bot Gets Suspended after Elon Musk Accuses It of Being ‘Scam Crypto Account’",
    "Twitter suspends AI bot as Elon Musk dubs it crypto scam",
    "Elon Musk Accuses AI Twitter Account ‘Explain This Bob’ As Meme Coin Scam",
    "Elon Musk's ‘Scam Crypto’ Claim Leads to Suspension of AI Bot on Twitter - What's Going On?",
    "@ExplainThisBob This sure looks like a scam crypto account. If so, it will be suspended.",
    "this is an extremely funny series of events [image]",
    "Intel to build $25 bln factory in largest foreign investment in Israel - Netanyahu",
    "Intel Makes $25 Billion Israel Push As U.S.-China Chips War Intensifies",
    "Intel to upgrade new Kiryat Gat fab with $15b investment",
    "Intel to build in Israel as chipmakers move beyond East Asia",
    "Intel bringing $25 billion factory to Israel, months after agreeing on Italy deal",
    "Intel to invest another $25 billion In Israel",
    "Intel plans to build a $25bn chip factory in Israel",
    "Intel to invest $25B in Israeli chip manufacturing plants",
    "Intel to Build new Chip fab in Israel",
    "Intel will spend $25 billion to expand manufacturing in Israel",
    "Intel to invest $25 bn in new Israel plant: government",
    "Intel to build $25 billion advanced chip plant in Israel, Netanyahu says",
    "Intel to invest $25 billion to build factory in Israel",
    "Intel to spend $25bn on Israel chip plant upgrade, says Netanyahu",
    "Intel to invest $25 billion in Israel factory in record deal, Netanyahu says …",
    "largest-ever international investment in Israel 💽🇮🇱 https://www.reuters.com/...",
    "Intel to invest $25 billion in Israel factory in record deal, Netanyahu says",
    "iPhone Maker Foxconn Plans To Launch Electric Car Factory In India!",
    "Foxconn to establish EV manufacturing line in India",
    "He Went After Crypto Companies.  Then Someone Came After Him.",
    "Trial Lawyer Went After Crypto Companies.  Then Someone Went After Him.",
    "Is Elemental streaming on Disney+?",
    "Pixar's Elemental is the new Cars",
    "‘The Flash,’ Pixar's ‘Elemental’ Disappoint in Muted Box Office",
    "Elemental has single worst box office opening weekend in Pixar history",
    "Personalized wealth management, built for tech people",
    "Microsoft Security Response Center",
    "Microsoft Response to Layer 7 Distributed Denial of Service (DDoS) Attacks",
    "Recent Teams, Office outages were caused by cyberattacks: Microsoft",
    "Microsoft says early June service outages were cyberattacks",
    "Microsoft Says DDoS Attack Caused Outlook, OneDrive Service Disruption",
    "Microsoft says June Outlook outages were a DDoS attack",
    "Microsoft Confirms DDoS Attack Caused June Outage on Teams, Office, and Other Services",
    "Microsoft June Outage: DDoS Attack Took Down Outlook, OneDrive Earlier—Possibly Pro-Russian Ties",
    "Microsoft confirms recent service disruptions were caused by Russian hacking group",
    "Microsoft Discloses DDoS Attack Impact with Limited Details",
    "Microsoft confirms it was attacked, causing an outage that may have affected millions",
    "Early June Microsoft outages were result of large-scale DDoS hit",
    "Microsoft Blames Massive DDoS Attack for Azure, Outlook, and OneDrive Disruptions",
    "Microsoft quietly admits DDoS cyberattacks took down Office 365 and Outlook",
    "Microsoft discloses detailed analysis of Layer 7 DDoS attacks",
    "Microsoft confirms June Outlook and OneDrive outages were caused by DDoS attacks",
    "Microsoft confirms DDoS attack caused Azure, Outlook outages",
    "With dead-time dump, Microsoft revealed DDoS as cause of recent cloud outages",
    "Microsoft confirms recent service outages were DDoS attacks",
    "Microsoft says June Azure, Outlook outages were caused by DDoS attack",
    "Microsoft Azure and Outlook outages were caused by DDoS attacks",
    "Microsoft: June Outlook and cloud platform outages were caused by DDoS",
    "Microsoft confirms Azure, Outlook outages caused by DDoS attacks",
    "Microsoft says the early June outage to its services was due to a DDoS cyberattack",
    "DDoS Attacks Culprit of Recent Azure, Microsoft 365 Outages",
    "Microsoft says Azure outage was caused by ‘anomalous’ traffic spike",
    "Microsoft says Azure disrupted after a week of repeated service outages",
    "People dismiss dos... most orgs aren't protected against them https://twitter.com/...",
    "The recommendations section is odd when this impacted the provider https://msrc.microsoft.com/...",
    "APP Scams Emerge as Top Payments Fraud Threat, ACI Worldwide Report Claims",
    "SpaceX launches SATRIA-1 communications satellite for Indonesia, lands rocket at sea (video)",
    "SpaceX launches powerful Indonesian communications satellite",
    "SpaceX launch a communication satellite to provide internet to rural parts of Indonesia",
    "Indonesia launches country's largest telco satellite with SpaceX",
    "SpaceX, United Launch Alliance, and China ready rockets this week - TWIRL #119",
    "Free compensation benchmarking data from 3,000 startups",
    "Top 5 tips for establishing your next attendance policy",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Duolingo describes its marketing strategy as “unhinged.” And it's working. https://www.wsj.com/...",
    "@jeffjarvis@mastodon.social",
    "The future of design is at the hands of Adobe Photoshop AI's generative fill",
    "Incredible. https://www.washingtonpost.com/ ...",
    "The Hill's Morning Report — Shutdown talk to dominate the summer",
    "When AI Overrules the Nurses Caring for You",
    "Investors flags financial irregularities at Mojocare",
    "Investors open a can of worms at Mojocare",
    "Indian Health Startup Mojocare To Scale Down Operations After Layoffs, Financial Reporting Review",
    "Investors find financial irregularities at Mojocare, say business model not sustainable",
    "Health startup Mojocare lays off about 170 employees: Report",
    "B Capital Backed Healthtech Startup Mojocare In Hot Soup: VCs Flag Financial Irregularities",
    "Mojocare scales down amid financial irregularity claims",
    "Investors unearth financial irregularities at Healthtech startup Mojocare",
    "Exclusive: Mojocare lays off around 170 employees within a year of fundraise",
    "Investor and entrepreneur Ian Hogarth to lead UK AI Taskforce",
    "Tech entrepreneur Ian Hogarth to lead UK's AI Foundation Model Taskforce",
    "Tech entrepreneur Ian Hogarth to chair AI taskforce"
]