[
    "Updating our inactive account policies",
    "Warning: Google to Delete Accounts That Have Been Inactive for 2 Years",
    "Google to delete accounts inactive for two years in security push",
    "Your inactive Gmail accounts will get deleted — how to keep them active",
    "Google threatens to start deleting inactive Gmail accounts",
    "Google may delete your Gmail account if it's been inactive for too long",
    "Google About to Start Deleting Accounts If You Don't Use Them",
    "Haven't used your Google account recently? It may be deleted",
    "Google will delete inactive accounts this year",
    "Google may start deleting dormant Gmail accounts later this year",
    "If you have a Google account you haven't signed into for a while, you may need to do so soon",
    "Watch out, Google might delete your old Gmail account if you aren't careful",
    "Google Will Delete Accounts That Have Been Inactive For Two Years",
    "Google will start deleting inactive accounts later this year",
    "Google Accounts That Sit Unused For Too Long Will Soon Be Deleted Entirely",
    "Old, unused Gmail accounts are getting the boot",
    "Google will start purging inactive accounts later this year",
    "Don't use your Google account? You could lose it",
    "Google will delete inactive accounts starting December 2023",
    "Log in or lose it: Google will start deleting your unused personal accounts",
    "Google To Delete Old Gmail And YouTube Accounts Not Used In Two Years",
    "Google is going to start deleting accounts that haven't logged in for 2 years",
    "Google will start deleting inactive accounts after two years",
    "Use it or lose it: Google says it will delete inactive accounts",
    "Google plans to delete inactive accounts after two years",
    "In December, Google's Deleting a Ton of Inactive Accounts",
    "Google to start purging accounts that have been inactive for 2 years",
    "Google Updates Account Inactivity Policy to 2 Years",
    "Google will delete Google Accounts that has not been used or signed into for at least 2 years",
    "Washington Post on YouTube",
    "OpenAI's Sam Altman Urges A.I. Regulation in Senate Hearing",
    "US Senator Uses ChatGPT for Opening Remarks at a Hearing on AI",
    "Top AI execs tell US Senate: Please, please pour that regulation down on us",
    "OpenAI's Sam Altman To Congress: Regulate Us, Please!",
    "Congress deliberates AI regulation to avoid mistakes of the past",
    "OpenAI CEO Calls for New Regulatory Agency for AI",
    "OpenAI CEO Sam Altman Asks Congress to Regulate AI",
    "Advocating for Open Models in AI Oversight: Stability AI's Letter to the United States Senate",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies on artificial intelligence before Senate committee",
    "OpenAI CEO Sam Altman testifies in ‘historic’ Senate hearing on AI safety",
    "OpenAI CEO Calls for Regulation But No Pause on Advanced AI",
    "OpenAI CEO Sam Altman Urges Congress to Create AI Regulation at Senate Hearing",
    "ChatGPT boss calls for a new government agency to keep AI companies in check",
    "OpenAI CEO asks Congress for AI regulation and a new agency",
    "In Senate testimony, OpenAI CEO Sam Altman agrees with calls for an AI regulatory agency",
    "OpenAI CEO to Congress: Regulate me",
    "OpenAI CEO Sam Altman calls for increased AI regulation in Senate hearing",
    "1 big thing: Altman enjoys Hill honeymoon phase",
    "Sam Altman calls for ‘incredible scrutiny’ of major AI companies, including OpenAI and Microsoft",
    "Sam Altman: CEO of OpenAI calls for US to regulate artificial intelligence",
    "CEO Behind ChatGPT Warns Congress AI Could Cause ‘Harm to the World’",
    "OpenAI CEO Sam Altman tells US senators AI regulation is ‘critical’",
    "OpenAI CEO says AI chatbots will ‘entirely automate away some jobs’",
    "WATCH LIVE | OpenAI CEO testifies before Congress",
    "The CEO behind ChatGPT is testifying. Here's what to expect.",
    "ChatGPT Creator Tells Congress He Wants an AI Regulatory Agency",
    "WATCH LIVE: OpenAI CEO Sam Altman testifies before Senate Judiciary Committee",
    "Always great to have men testifying about work women pioneered. https://twitter.com/...",
    "United States Senate Committee on the Judiciary",
    "International Business Times",
    "San Francisco Business Journal",
    "Oversight of A.I.: Rules for Artificial Intelligence",
    "Mr. ChatGPT goes to Washington: OpenAI CEO Sam Altman testifies before Congress on AI risks",
    "CEO behind ChatGPT warns Congress AI could cause ‘harm to the world’",
    "OpenAI CEO calls for laws to mitigate ‘risks of increasingly powerful’ AI",
    "Sam Altman wows lawmakers at closed AI dinner: ‘Fantastic...forthcoming’",
    "OpenAI CEO Testifies on Artificial Intelligence",
    "ChatGPT chief says AI should be regulated by a US or global agency",
    "OpenAI CEO in “historic” move calls for regulation before Congress",
    "ChatGPT's Sam Altman Calls on Congress to Adopt Safety Standards for AI Systems",
    "Sam Altman's testimony: Navigating the PR playbook in the soon-to-be-regulated AI industry",
    "The C.E.O. of OpenAI Heads to Congress to Discuss Rules for A.I.",
    "An AI CEO Went to Washington and Asked for Rules: Key Takeaways",
    "OpenAI stumps in Washington",
    "ChatGPT chief issues AI warning",
    "OpenAI's Altman Acknowledges AI Dangers, Asks for Regulation",
    "NEWSLETTERS  ·EYE ON A.I.  —  OpenAI CEO Sam Altman tells senators he wants to see A.I. licensed.",
    "OpenAI's Sam Altman Calls for AI Regulation in Senate Testimony",
    "ChatGPT's Altman Pleads To US Senate For AI Rules",
    "ChatGPT's creator warns Congress the technology could cause ‘significant harm’",
    "Sam Altman, CEO of ChatGPT deveoper OpenAI, is testifying before Congress about AI",
    "Senator Makes Point About A.I. With Fake Audio of Himself",
    "OpenAI's Sam Altman got a warm welcome on Capitol Hill",
    "OpenAI CEO embraces government regulation in Senate hearing",
    "Sam Altman On AI Oversight: Balancing Risks & Advancements",
    "Historic Senate hearing sees OpenAI CEO Sam Altman championing AI safety",
    "Sam Altman's Washington charm offensive is working",
    "6 takeaways from the OpenAI senate hearing",
    "Lawmaker asks ChatGPT if the government should regulate AI, and the answer won't surprise you",
    "OpenAI CEO Sam Altman tells US Senate panel generative AI needs regulation",
    "Silicon Valley Business Journal",
    "Senate panel begins AI examination; ChatGPT CEO Sam Altman testifies",
    "OpenAI CEO Sam Altman's congressional testimony comes at a critical AI moment",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "ChatGPT's chief to testify before Congress as concerns grow about artificial intelligence's risks",
    "Who is Sam Altman, the OpenAI CEO testifying at Congress?",
    "OpenAI immediately going for AI regulation is lame as fuck",
    "Can you say, “pulling up the ladders”? https://twitter.com/...",
    "@DavidNielsen@mastodon.social",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "Apple will let you teach your iPhone to speak in your voice",
    "Modest Apple talks up these ‘incredible’ advances in iOS",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Apple previews useful accessibility features coming to iOS 17",
    "Apple's Personal Voice, Point and Speak Features Use AI to Boost Accessibility",
    "Apple reveals game-changing accessibility features including Live Speech and Personal Voice",
    "The Next Major iPhone Update Will Be Capable of Digitally Reproducing Your Voice",
    "Apple to Expand Accessibility Options in 2023",
    "Apple Details New Accessibility Features Coming to iOS, iPadOS, and macOS Later This Year",
    "Apple's upcoming accessibility features include text-to-speech AI that can imitate users' voices",
    "Apple introduces a slew of new accessibility features ahead of WWDC",
    "Your iPhone will soon be able to replicate your voice after 15 minutes of training",
    "Apple previews new iOS 17 accessibility features ahead of WWDC 2023 event",
    "Soon, your iPhone will be able to speak in your own voice",
    "Apple previews new Assistive Access, Live Speech, and other accessibility coming in iOS 17",
    "Voice-Cloning Tech Coming to iPhone, iPad to Help Those With Disabilities Speak",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "@blakereid@mastodon.lawprofs.org",
    "@johnvoorhees@mastodon.macstories.net",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2",
    "Apple launches new concert discovery features on Apple Maps and Apple Music",
    "Apple Adds Live Music Features to Maps and Music",
    "Apple Music, Maps Launch New Concert Discovery Features",
    "Apple introduces ‘concert discovery’ for Music and Maps",
    "Apple Music And Apple Maps Will Now Inform Users Of Nearby Concerts Happening In Their Areas",
    "Apple launches Maps and Apple Music with New Concert Discovery Features",
    "Apple launches concert discovery and venue guides on Apple Maps and Apple Music",
    "Apple adds new concert-finding features to Maps and Music",
    "Apple Launches Concert Discovery Features on Apple Music and Apple Maps",
    "Apple taps into Shazam with new live concert features in Music and Maps",
    "Apple brings new concert discovery features to Maps and Music",
    "Apple Music and Maps gain new concert discovery features on iPhone, iPad and Mac",
    "Now Apple Music is putting live gigs on the Maps",
    "How to find your favorite artist's Set List on Apple Music; see tour dates and get tickets",
    "Apple Music and Apple Maps updates help find where your favorite band is playing",
    "Apple Music adding concert set list playlists, tour dates, and more",
    "Apple now helps you discover concerts in Maps and Music",
    "@viticci@mastodon.macstories.net",
    "Ledger Recover by Coincover",
    "Crypto hardware maker's recovery feature draws ire",
    "Are ledger hardware wallets secure? A comprehensive analysis",
    "Ledger dubs service ‘risk-free’ despite losing millions of user emails",
    "‘Lots of inaccuracies’: Ledger pushes back on security fears over its crypto wallet update",
    "Ledger Under Fire for Allegedly Exposing User Seed Phrases",
    "‘Backdoor’ in Ledger? Here's What's Going On—And How to Keep Your Crypto Safe",
    "“We don't want it” CT Responds To Ledger Recover",
    "Ledger Bats Back Criticism of New Wallet Recovery Service",
    "Stupidest idea you can make as a hardware wallet manufacturer.... https://twitter.com/... [image]",
    "teenage engineering has the opportunity to do something incredibly funny https://twitter.com/...",
    "HealthcareInfoSecurity.com",
    "@briankrebs@infosec.exchange",
    "U.S. Department of the Treasury",
    "Russian National Charged with Ransomware Attacks Against Critical Infrastructure",
    "Russian ransomware affiliate charged with attacks on critical infrastructure",
    "Alleged Russian Hacker Charged in $200 Million Ransomware Spree",
    "Russian man charged over ransomware attacks, including against D.C. police",
    "Ransomware Charges Unsealed Against Russian National",
    "US puts $10 million bounty on Russian hacker's head",
    "Alleged Babuk Ransomware Hacker ‘Wazawaka’ Indicted in US",
    "DOJ Offers $10 Million Reward for Info on Alleged Russian Ransomware Hacker",
    "US sanctions Russian ransomware operator who leaked stolen DC police data",
    "Alleged Babuk ransomware gang leader ‘Wazawaka’ indicted, sanctioned by US",
    "United States Sanctions and Charges Russia-based Ransomware Developer Mikhail Matveev",
    "DOJ charges Russian hacker linked to attacks against US law enforcement agencies",
    "US sanctions Russian accused of being a ‘central figure’ in major ransomware attacks",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "Apple's App Store prevented more than $2 billion worth of fraudulent transactions in 2022",
    "Apple says it blocked over $2 billion in App Store fraud in 2022",
    "Apple blocked over $2 billion in fraudulent transactions & 1.7 million bogus apps in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "Apple Touts Fraud and Abuse Prevention in the App Store",
    "Apple says App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple rejected nearly 1.7 million App Store submissions in 2022",
    "Apple's App Store Blocked Over $2 Billion in Fraud Last Year",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple says its App Store prevented over $2 billion in fraudulent transactions last year",
    "Apple prevented $2 billion worth of fraud on the App Store in 2022",
    "‘FriendlyName’ Buffer Overflow Vulnerability in Wemo Smart Plug V2",
    "Critical security flaw is exposing older Wemo Smart Plugs to hackers",
    "Researchers find security flaw in Wemo Smart Plug, Belkin says it won't release a patch",
    "PSA: Older Wemo Smart Plugs Have Vulnerability That Leaves Them Open to Attack",
    "Unpatched Wemo Smart Plug Bug Opens Countless Networks to Cyberattacks",
    "Researchers find exploit in Belkin's Wemo Mini Smart Plug V2",
    "PSA: time to recycle your old Wemo smart plugs (if you haven't already)",
    "United States District Court for the Northern District of California",
    "US charges Apple ex-employee for trying to steal technology",
    "DOJ charges former Apple engineer with stealing self-driving car technology for China",
    "Ex-Apple engineer accused of stealing self-driving car secrets",
    "Indictment  —  At all times relevant to this Indictment: 1.  Apple, Inc. (\"Apple\") …",
    "US charges former Apple engineer with attempt to steal self-driving car tech",
    "Chinese ex-Apple engineer stole Apple Car secrets, says DoJ",
    "DOJ Indicts Ex-Apple Engineer for Stealing Self-Driving Car Tech for China",
    "Ex-Apple Engineer Indicted in Crackdown on Flow of Restricted Tech to China, Russia",
    "Apple engineer from China among US tech theft cases",
    "Apple autonomous driving tech secrets stolen by ex-engineer, feds say",
    "U.S. DOJ charges Apple ex-employee for attempting to steal technology, fleeing to China",
    "A third former Apple employee has been charged with stealing self-driving car tech",
    "US ‘strike force’ charges Chinese and Russian nationals with stealing sensitive tech",
    "they stole the apple car! 😂 that never launched",
    "IBM to Help Automate Cloud Data Protection with Acquisition of Polar Security",
    "IBM acquires Israeli co Polar Security",
    "IBM Snaps up DSPM Startup Polar Security",
    "IBM Buys Polar Security to Find and Protect Cloud, SaaS Data",
    "IBM buying binge rages on with reported $60M deal for startup targeting ‘shadow data’",
    "IBM snags Polar Security to boost cloud data practice",
    "IBM buys data security startup Polar Security in reported $60M deal",
    "@Jonathanglick@mstdn.social",
    "Elon Musk keeps insisting the Texas shooter with a swastika tattoo is not a white supremacist",
    "Elon Musk: I will say what I want even if it loses me money",
    "Musks says ‘so be it’ to consequences of his tweeting",
    "Tesla will ‘try a little advertising’, Elon Musk says",
    "@Techmeme @rogoswami Those who live in la la land glass houses shouldn't throw ephemeral stones",
    "Latch to Acquire Ring Founder Jamie Siminoff's Latest Company, Honest Day's Work",
    "Ring founder takes over as Latch CEO shortly after leaving Amazon",
    "Ring founder to become CEO of commercial smart home company Latch",
    "Ring co-founder, robotics vice president leave Amazon",
    "Latch to Acquire Honest Day's Work",
    "The founder of Ring is leaving Amazon to join Latch",
    "Ring founder Jamie Siminoff departs to join Latch",
    "ANYbotics Raises $50M in Series B Funding",
    "Anybotics raises $50M to expand international deployments, develop new capabilities",
    "Google Cloud Press Releases",
    "Google Cloud Launches Two New AI Solutions to Speed Up Drug Discovery & Precision Medicine",
    "How HPC and generative AI will accelerate drug discovery and precision medicine",
    "Zoom Partners with Anthropic to Expand Federated Approach to AI",
    "Zoom makes a big bet on AI with investment in Anthropic",
    "Zoom to use Anthropic's Claude AI to better its customer service",
    "Zoom partners with Anthropic to add its Claude chatbot to its platform",
    "Zoom To Inject Anthropic's AI Chatbot Into Video, Collaboration Products",
    "Zoom announces partnership with Anthropic for AI call center services",
    "AI monetization! https://twitter.com/...",
    "Kustomer Embarks on a New Chapter as a Standalone Company",
    "Meta Moves on From Customer Service Platform Kustomer",
    "Meta spins out customer service startup Kustomer amid ‘year of efficiency’",
    "the boys are back. excited for the next phase. https://twitter.com/...",
    "Framework Laptop 13: Fully User-Repairable, but Can It Compete with MacBook Air?",
    "Framework 13 Intel 13th Gen mainboard",
    "Review: Framework Laptop's 13th-gen Intel upgrade helps fix its battery problem",
    "App Spotlight: Ringover for Zoho CRM",
    "CORRECTION: Rumble Acquires Podcasting and Live Streaming Platform Callin",
    "Why companies still shy away from podcast ads",
    "Baltimore Business Journal",
    "Huntress Closes $60M Series C for MDR Expansion",
    "Cybersecurity firm Huntress raises $60M as it eyes international expansion",
    "Cybersecurity startup Huntress raises $60M Series C round",
    "Huntress Adds $60 Million in Funding to Expand Managed Security Business",
    "Huntress Raises $60M Series C for Its Cybersecurity Tech",
    "New Investment Fuels Our Mission To Enable SMBs to Better Protect Their Business Assets",
    "Huntress Lands $60M, Eyes Potential IPO In Coming Years",
    "Ellicott City-based Huntress raises $60M Series C",
    "Twitter Sued for Allegedly Helping to Silence Saudi Critics",
    "Twitter sued over Saudi spying that allegedly landed popular user in prison",
    "Twitter, Saudi Arabia Sued In US Over Jailed User",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Tue. 05/16 - Open Source Vs. Centralized AI, Part I",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Judge denies SEC motion to seal Hinman speech documents in Ripple case",
    "Breaking: Court victory for Ripple as judge denies SEC motion to seal Hinman docs",
    "TechCrunch Founder Criticizes SEC for Disfavoring Ripple's Democratization of $XRP Trading",
    "These glitches never seem to benefit the buyer https://twitter.com/...",
    "A Santa Clara blockchain startup raised an $81M Series A round",
    "Internet infrastructure firm Auradine raises $81 million",
    "Investing in Hippocratic AI",
    "General Catalyst, Andreessen Horowitz bet on large language models for health care",
    "Hippocratic AI Raises $50 Million To Power The Healthcare Bot Workforce",
    "Hippocratic Health raises $50 mln seed funding to build AI model",
    "Hippocratic AI Launches with $50M for Safety Large Language Model for Healthcare",
    "Hippocratic AI launches with $50M to build a chatbot for healthcare",
    "Hippocratic AI Unveils Safety-Focused Language Model with $50M Funding",
    "AI Health Startup Gets $50 Million Seed Funding From Venture Titans",
    "Hippocratic AI launches with $50M to build large language model for healthcare",
    "Meet the Startup Promising to Deliver the 1st Healthcare-focused Generative AI Model",
    "WHO urges caution over use of generative AI in healthcare",
    "Bitcoin Financial Services Startup River Raises $35M in Series B Backed by Peter Thiel",
    "River CEO says bitcoin interest fueled by institutional investors after $35m capital raise",
    "This is like a weird 2023 reboot of “Wargames.” https://twitter.com/...",
    "Hottest online game involves the CIA. https://www.wsj.com/...",
    "EU states approve world's first comprehensive crypto rules",
    "EU finance ministers approve MiCA crypto regulation",
    "EU finance ministers green light MiCA crypto regulation",
    "EU Council gives final approval to MiCA legislation",
    "European Union: Council Adopts Crypto Framework or Markets in Crypto-Assets (MiCA)",
    "European Union Officially Adopts New Comprehensive Crypto Regulation With Passing of MiCA",
    "MiCA drop: Europe seals the deal on the world's first comprehensive crypto law",
    "EU finance ministers approve MiCA crypto regulation: should you buy AltSignals now?",
    "EU Council Approves Comprehensive Crypto Regulatory Framework",
    "MiCA Receives Greenlight From EU Finance Ministers",
    "New tax transparency rules will help Member States shine a light on the crypto-asset sector",
    "Why the digital euro should be designed like a public good",
    "ECB believes digital euro is necessary despite lukewarm response from banks, consumers",
    "Musk and Yaccarino Are Bound to Clash",
    "FTX founder Sam Bankman-Fried to be subject of ‘high-octane’ book by Michael Lewis",
    "Unfortunately you rarely get this sort of deal. https://twitter.com/...",
    "Extreme Didion “this is gold” vibes https://www.nytimes.com/... [image]",
    "China's Baidu beats quarterly revenue estimates on ad strength",
    "Baidu to ensure AI won't ‘hallucinate’ on sensitive topics: CEO",
    "Baidu Stock Jumps 2% after Better-than-Expected Revenue News",
    "Baidu Announces First Quarter 2023 Results",
    "Musk Buys Job Tool Laskie in First Acquisition for Twitter",
    "Twitter Agrees to Buy HR Tech Startup Laskie",
    "Elon Musk claims he's the reason ChatGPT-owner OpenAI exists",
    "Elon Musk acquires Laskie, a tech job matcher",
    "Twitter makes its first acquisition under Elon Musk's leadership",
    "Twitter buys VC-backed hiring startup in first Musk-era deal",
    "Elon Musk's Twitter Just Acquired its First Company",
    "Funding down, exits muted, and valuations flat in rough quarter for European startups",
    "Elon Musk Moves Twitter Closer To ‘Super App’ Status With Startup Acquisition",
    "Irish Council for Civil Liberties",
    "5 years: GDPR's crisis point — ICCL's 2023 GDPR report",
    "75% of Irish data watchdog's GDPR decisions since 2018 overruled - report",
    "5 years: GDPR's crisis point - ICCL report on EEA data protection authorities",
    "GDPR measures are ‘failing’ to reign in Big Tech, report claims",
    "Coinbase is a ‘hold’ amid ‘too much regulatory risk,’ says Berenberg",
    "Coinbase Hasn't Proven SEC Needs to Create Crypto-Specific Rules, Regulator Says",
    "The SEC calls Coinbase's suit over digital asset rules petition ‘baseless’",
    "SEC Moves to Block Coinbase's Request for Clarification in Court (Report)",
    "Lawyer John Deaton knocks SEC after Coinbase rejection",
    "Ripple Counsel Spots a Typo in the SEC's Brief: 'The SEC's Crypto Regulatory Agenda..'",
    "Deaton Joins Ripple Policy Head To Criticize SEC's Delayed Rulemaking Process",
    "Coinbase's SEC Risk Makes MicroStrategy a Better Bet, Berenberg Says",
    "SEC Fires Back at Coinbase's Request For New Crypto Rules",
    "The SEC basically told Coinbase, “We'll get to it, eventually” https://blockworks.co/...",
    "UK MPs grill regulator over Microsoft Activision Blizzard deal block, day after EU grants approval",
    "Mergers: Commission clears acquisition of Activision Blizzard by Microsoft, subject to conditions",
    "EU greenlights Activision Blizzard and Microsoft merger",
    "Microsoft's Activision Blizzard acquisition approved by EU regulators",
    "EU approves Microsoft's $69 billion acquisition of Activision Blizzard, clearing huge hurdle",
    "EU approves Microsoft's deal to buy Activision Blizzard",
    "EU antitrust regulators clear $69 bln Microsoft, Activision deal",
    "Microsoft's $69 Billion Activision Deal Wins EU Approval",
    "EU clears Microsoft-Activision deal despite UK's decision to block acquisition",
    "Microsoft's $75 Billion Activision Blizzard Deal Gets EU Approval",
    "E.U. breaks with Britain and U.S. to clear Microsoft's Activision deal",
    "Europe greenlights Microsoft's $68.7B Activision acquisition",
    "Microsoft-Activision Blizzard deal approved by European Commission",
    "Brussels approves $69bn Microsoft deal that was blocked by British watchdog",
    "Our response to the European Commission's announcement today on Microsoft/Activision ⬇ [1/5]"
]