[
    "@JoeUchill@mastodon.social",
    "@0x00string@infosec.exchange",
    "@santim@social.vivaldi.net",
    "@chrismessina@mastodon.xyz",
    "Neeva, the would-be Google competitor, is shutting down its search engine",
    "Neeva, The Ad-Free Search Engine, Announces Closure",
    "Neeva Shuts Down Search Engine Ahead of Snowflake Deal",
    "Neeva Shut Downs its Search Engine",
    "Google search rival Neeva is shutting down its search engine to work on AI products",
    "LLMs are a bigger opportunity for startups than search https://twitter.com/...",
    "The esports world is starting to teeter",
    "Reported offers for TSM's LCS slot fall well short of league's record sale price",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "G7 Hiroshima Leaders' Communiqué",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 leaders unite to regulate generative AI globally under the ‘Hiroshima Process’",
    "G7 countries call to have global technical standards for AI",
    "G7 calls for ‘responsible’ use of generative AI",
    "G7 leaders confirm need for governance of generative AI technology",
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "Microsoft Gains China's Approval to Acquire Activision Blizzard amid Ongoing Antitrust Scrutiny",
    "China approves Xbox acquisition of Activision Blizzard as pressure builds on CMA",
    "China's antitrust committee joins Microsoft's growing list of Activision approvals",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard",
    "37 Countries Have Now Approved Microsoft's Deal To Buy Activision Blizzard",
    "China approves Microsoft-Activision merger",
    "Microsoft Reportedly Gets China Regulator Approval on ABK Deal",
    "China approves Microsoft's Activision Blizzard acquisition",
    "Microsoft Gains China's Antitrust Regulator Approval For Activision Purchase",
    "In The Latest Xbox ActiBlizz Twist, China Reportedly Approves Microsoft's Acquisition",
    "Magic Leap's CEO will discuss the future of AR at Disrupt's Hardware Stage",
    "COMMENTS OF AT&T  —  Before the FEDERAL COMMUNICATIONS COMMISSION Washington …",
    "FCC Gives SpaceX Starlink A Major Win Against Dish Network",
    "AT&T files with the FCC seeking to put the kibosh on T-Mobile's satellite-to-cellular plan",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "AT&T has some concerns about Starlink and T-Mobile's satellite-to-cellular plans",
    "AT&T Asks FCC to Block T-Mobile From Expanding Network With SpaceX Satellites",
    "A New Kind of Space Race: Companies Vie Over Market For Satellite-Enabled Phone Calls",
    "AT&T blasts T-Mobile's SpaceX plans as ‘woefully insufficient’",
    "SpaceX wins case against Dish Network in FCC spectrum spat",
    "FBI misused surveillance tool on Jan. 6 suspects, BLM arrestees and others",
    "FBI misused intelligence database in 278,000 searches, court says",
    "FBI Searched Jan. 6 Rioters and George Floyd Demonstrators in Spy Database",
    "FBI misused surveillance authorities to investigate Black Lives Matter protesters",
    "The FBI Broke The Law Over 278,000 Times With Illegal Searches On Americans",
    "Release of Two FISC Decisions Authorizing Novel Intelligence Collection",
    "FBI issued 278,000 improper searches in 2021: filings",
    "POV: The FBI will keep abusing personal data until we end Section 702",
    "FBI repeatedly misused surveillance tool, unsealed FISA order reveals",
    "Free compensation benchmarking data from 3,000 startups",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Private debt delivers calm waters in storm of volatility",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "TikTok: Inspire creativity and bring joy.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "(BNS) @BradyDale On SBF, FTX, All The Stuff",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Bitcoin's Hashrate Surpasses All-Time High.",
    "Bitcoin's Price Faces Bleak Outlook as Selling Pressure from Miners Surge",
    "Sharp Decline In Miner Balances Suggests Incoming Selling Pressure For Bitcoin",
    "Bitcoin Plunges Below $27,000 As Miners Show Signs Of Selling",
    "Strike Goes Global Adding USDt Support and Enhanced App Unveiled at Bitcoin 2023 Conference",
    "Strike Relocates Global Headquarters To El Salvador, Expands Presence To 65 Countries",
    "Strike Expands Services To 65 Global Markets, Moves Headquarters To El Salvador",
    "Strike moves global headquarters to El Salvador, expands bitcoin payments to 65 countries",
    "Bitcoin Payments App Strike Expands to More Than 65 Countries From Three",
    "Strike moves global headquarters to El Salvador, expands to 65 countries",
    "Bitcoin Wallet Strike Expands Support to 3 Billion People, Targets Global South",
    "Max Keiser Says XRP And All Cryptocurrencies Are Securities, Except For Bitcoin — Here's Why",
    "Dennis Duffy was ahead of his time. https://www.wsj.com/...",
    "International Business Times",
    "US presidential candidate accepts campaign donations in bitcoin",
    "Bitcoin is the Dominant Digital Commodity, Says Michael Saylor at Bitcoin 2023 Conference",
    "Miami Bitcoin Conference To See Fewer Attendees This Year: Here's Why",
    "Mobile pet game Peridot is an adorable, expensive ruse",
    "it was the pokemon IP that made it a hit, not the AR https://twitter.com/...",
    "How to optimize your LinkedIn profile and grow it to get noticed by recruiters",
    "This website has a fake commenter problem  —  https://www.ft.com/...",
    "@tchambers@indieweb.social",
    "@film_girl@mastodon.social",
    "@rodhilton@mastodon.social",
    "@noracodes@tenforward.social",
    "@trochee@dair-community.social",
    "This is Instagram's new Twitter competitor",
    "Instagram Readies Twitter Competitor for Summer Release",
    "Leaked slide reveals Instagram's challenger to Twitter; app could launch next month",
    "Instagram challenges Twitter with text-based app",
    "Instagram might be working on a Twitter killer",
    "Look Out Bluesky, Instagram's Twitter Clone Could Launch in June,",
    "Everything we know about Instagram's Twitter clone, due this summer",
    "Images of Instagram's Twitter Competitor Leaked, Lets Users Reach New Audiences",
    "Instagram Is Preparing A Twitter-Like App To Be Launched This Summer, Report Says",
    "Meta planning to use Instagram to supplant Twitter - here's the proof",
    "Instagram is readying a Twitter-like service",
    "Meta to release text-based version of Instagram, similar to Twitter",
    "Meta's top secret Twitter-killer app is coming soon",
    "Meta's Instagram is working on a text-based app to rival Twitter",
    "Meta's Twitter Competitor App is Set to be Launched Some Time Next Month",
    "Instagram's Twitter-Like App Could Be Released Next Month",
    "If this is Instagram's Twitter competitor, I'm ready to jump ship",
    "Meta's rumored Twitter competitor could launch as early as next month",
    "Meta's Twitter rival Instagram app “P92” reportedly coming in June",
    "Instagram's New Twitter Competitor Revealed",
    "Meta has been working on a new Twitter competitor, and here's what it looks like",
    "Instagram's text-based app might make Twitter users jump ship",
    "Instagram prepares Twitter competitor for summer release - Bloomberg News",
    "Instagram to Launch Twitter Competitor with New Text-Based App",
    "Instagram readies Twitter competitor for summer release: Report",
    "Instagram's Twitter Clone Leaks: Here are the Features",
    "Leaked Image Shows What Instagram's New Twitter Competitor Looks Like",
    "Instagram's New Twitter Competitor Leaks",
    "Satisfied With Its TikTok Clone, Meta Is Working on a Twitter Clone",
    "... are you seriously telling me Facebook is pushing “pivot to text?” https://twitter.com/...",
    "This is Instagram's new Twitter rival app https://www.theverge.com/...",
    "@mattmday Right??? I think I've joined like 9 new apps in the last 6 months",
    "Let's see how this goes. https://www.theverge.com/...",
    "curious to see how well this does... https://twitter.com/...",
    "Instagram joins Fediverse? https://twitter.com/...",
    "Meta/Instagram just released Twitter 😂 https://twitter.com/...",
    "I did *not* expect Meta's Twitter-esque app to be fediverse compatible https://twitter.com/...",
    "👀 FIRST LOOK: This is Meta's new text-based app https://twitter.com/... [image]"
]