[
    "European Data Protection Board",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "Facebook to be fined £648m for mishandling user information",
    "Facebook-owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Meta ordered to suspend Facebook EU data flows as it's hit with €1.2BN privacy fine",
    "EU hits Meta with record €1.2B privacy fine",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Facebook fined €1.2bn for mishandling user information",
    "Facebook fined €1.2bn for mishandling users' data",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "Breaking Meta fined €1.2 billion by Irish data watchdog",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook Parent Meta Hit With Record Fine for Transferring European User Data to US",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta hit with €1.2B fine over data privacy rules",
    "Meta: Why is Facebook, WhatsApp and Instagram owner facing a record fine from the EU?",
    "Meta Fined Record $1.3 Billion in EU Over US Data Transfers",
    "Meta Fined €1.2 Billion In Landmark EU Ruling | Coingape",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes.",
    "International Business Times",
    "Attacker Takes Over Tornado Cash DAO With Vote Fraud, Token Slumps 40%",
    "Tornado Cash DAO Attacker Proposes Restoring Governance Control",
    "What Is Tornado Cash? Attacker Issues Proposal To Reverse Malicious Changes On Governance",
    "Tornado Cash Hacker Hints of Undoing Attack Pushing Price of Torn Up by 10%",
    "Tornado Cash's TORN Token Surges 10% Amidst Proposal to Reverse Recent Attack",
    "Tornado Cash attacker creates proposal that could restore governance",
    "Tornado Cash attacker to potentially give back governance control, proposal reveals",
    "Tornado Cash DAO suffers hostile takeover",
    "Tornado Cash suffers governance hijack",
    "Hackers Exploit Sanctioned Crypto Mixer Tornado Cash, Unleashing Chaos",
    "TORN price dumps 50% after attacker takes over Tornado Cash DAO",
    "Tornado Cash (TORN) Suffers 27% Drop As Hackers Strike",
    "Malicious Proposal Exploits Tornado Cash Governance",
    "Attacker uses malicious proposal to take over Tornado Cash governance",
    "Tornado Cash Attacker Proposes To Give Back Control, TORN Price Spikes | Coingape",
    "Nvidia, HPE Announce Superchip-Powered ‘Isambard 3’ Supercomputer",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers",
    "Top500: Frontier Gains 92 Petaflops; Henri Gets a Little Greener",
    "TOP500 List Updated With Frontier Remaining At The Top",
    "US supers maintain grip on Top500 list as China seemingly hides its powers",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "China bans Micron's products from key infrastructure over security risk",
    "China's Micron ban creates chip dilemma for Samsung, SK Hynix",
    "China imposes sales restrictions on Micron as it escalates tech battle with Washington",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "China bans US chipmaker Micron from key infrastructure projects",
    "China bans major chip maker Micron from key infrastructure projects",
    "China hits back, bans chips from US company",
    "Who will benefit from China's Micron ban?",
    "China hits back, bans major US chip maker Micron",
    "China says Micron's products fail security review, bars some purchases",
    "Pressure mounts on Korean chipmakers as China restricts Micron chip sales",
    "China bans Micron chips over security concerns",
    "China chip stocks rally after Beijing said U.S. chip giant Micron is ‘major security risk’",
    "Chinese agency claims U.S. chipmaker Micron poses national security risk",
    "China bans Micron products after security review finds unspecified flaws",
    "China Orders Halt To Using Micron Chips Claiming Security Concerns In Rising Tech War",
    "China Bans Micron Chips in Wake of Cybersecurity Review",
    "China bans Micron chips in key infrastructure over ‘national security’ risks",
    "China Tells Tech Manufacturers: Stop Using US-Made Micron Chips",
    "China Limits Use Of Chips From US-Based Micron Over Security Concerns",
    "China Bans Some Sales of Chips From U.S. Company Micron",
    "China Bars Purchases of Micron Chips, Escalating US Conflict",
    "China fails Micron's products in security review, bars some purchases",
    "China Goes Ahead with Micron Technology Sales Ban",
    "China says US chip maker Micron failed security review",
    "@dangillmor@mastodon.social",
    "Popular Android TV boxes sold on Amazon are laced with malware",
    "Lemon Group's Cybercriminal Businesses Built on Preinfected Devices",
    "Millions of Android Phones and TVs May Come with Preinstalled Malware",
    "Report: Apple to start selling Ted Lasso merch through the Apple online store",
    "‘Ted Lasso’ merch set to land in online Apple Store in June",
    "‘Ted Lasso’ and AFC Richmond gear coming to the online Apple Store",
    "Ted Lasso merch could be coming to the Apple Online Store soon",
    "Exclusive ‘Ted Lasso’ merch coming to Apple Store Online",
    "Apple's online store will soon offer you Ted Lasso “merch”",
    "Nearly every Apple top exec is working on the AR headset",
    "Apple Reality Pro AR Headset: Eye-Watering Price And Brilliant Unique Feature Leaked In New Report",
    "Apple's big WWDC 2023 launch may include MR headset, new MacBook Air",
    "For passengers on the left side of the plane, a view of $DIS frontier https://twitter.com/...",
    "Uber's diversity chief put on leave after complaints of insensitivity",
    "This is everything all at once https://www.nytimes.com/...",
    "Zuckerberg might save metaverse with Magic Leap",
    "Meta reportedly wants to license Magic Leap's AR technology",
    "Meta And Magic Leap Reportedly In Talks Over AR Tech As Apple Headset Nears",
    "Meta reportedly in talks with Magic Leap for IP licensing and manufacturing",
    "Meta Looks to Launch AR Partnership With Magic Leap",
    "Meta in Negotiations with Magic Leap: A Leap Towards Building the Metaverse",
    "Meta in Talks With Magic Leap Over AR Deal",
    "Startup aims to steal Apple's AR thunder by launching the Spacetop augmented reality laptop",
    "Personalized wealth management, built for tech people",
    "Dentistry software provider Patient21 raises healthtech's biggest round of 2023",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "5 HR strategies for managing dynamic career trends with analytics",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Discord: Building something you actually use.",
    "TikTok: Inspire creativity and bring joy.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(IHP) Amazon's First Employee Shel Kaphan",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Wistron To Exit Apple's India Business, Bengaluru Plant To Be Acquired By Tata Group",
    "Dogecoin, Litecoin Transactions ‘Spike’ After Ordinals Intervene",
    "Bitcoin Blockchain Continues to See Growth in Ordinal Inscriptions and BRC20 Tokens",
    "Bitcoin Ordinals' total mintage fees increase 700% from April: Report",
    "How US Universities Hope to Build a New Semiconductor Workforce",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Crypto hunter busts husband's $500k BTC hideout in divorce",
    "Hidden crypto holdings turn divorce battles into high-stakes cases, attorneys warn",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "G7 nations admit they're nowhere on AI regulation",
    "G7 Hiroshima Leaders' Communiqué",
    "G7 Countries Seek ‘Common Vision’ for AI",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 calls on China to pressure Russia to end Ukraine war",
    "G7 countries call to have global technical standards for AI"
]